{
    "title": "Scuba Diver Watch Face",
    "summary": "The ultimate scuba diver watch face for your Android Wear device.",
    "icon": "//lh5.ggpht.com/kgzZBhWWeecvhbl2SLKGAfUNL78z6dKSnwak6oQTYDC88uts9poNfaCmhEX4OIBPYA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 4197,
    "developer": "Zuhanden",
    "developerId": "Zuhanden",
    "developerEmail": "mobile@zuhanden.de",
    "developerWebsite": "http://smartwatchface.co",
    "developerAddress": "Seehauser Str. 14\n81379 Munich\nGermany",
    "updated": "August 4, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "This watch face is designed for ultimate readability in low light situations. Scuba diver watch face turns your Android Wear smartwatch into a sporty dive watch. It works perfectly on the LG G Watch R and other Android Wear devices. Custom featuresThis dive watch face features:★ Superior readability★ Bold and exclusive sportwatch design★ No frills, just focus on time★ Powerful diver watch appearanceNotes to divers- Before diving with Scuba, please make sure your Android device is waterproof- Don’t go too deep yet and respect the waterproof indication of the smartwatch manufacturer Supported devices- This watchface works on all Android Wear devices - Supports round (LG G Watch R and Moto 360) and rectangular smartwatches (Samsung Gear Live and LG G Watch). - Does NOT work on Samsung Gear and smartwatches using other operating systemsMore watch faces- Visit our luxury watchmaker collection for Android Wear on the Play Store http://goo.gl/QOsOu4- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. ★★★★★ Engineered for the element",
    "descriptionHTML": "This watch face is designed for ultimate readability in low light situations. Scuba diver watch face turns your Android Wear smartwatch into a sporty dive watch. It works perfectly on the LG G Watch R and other Android Wear devices. <br><br><b>Custom features</b><br><br>This dive watch face features:<br><br>&#x2605; Superior readability<br>&#x2605; Bold and exclusive sportwatch design<br>&#x2605; No frills, just focus on time<br>&#x2605; Powerful diver watch appearance<br><br><b>Notes to divers</b><br><br>- Before diving with Scuba, please make sure your Android device is waterproof<br>- Don&#x2019;t go too deep yet and respect the waterproof indication of the smartwatch manufacturer <br><br><b>Supported devices</b><br><br>- This watchface works on all Android Wear devices <br>- Supports round (LG G Watch R and Moto 360) and rectangular smartwatches (Samsung Gear Live and LG G Watch). <br>- Does NOT work on Samsung Gear and smartwatches using other operating systems<br><br><b>More watch faces</b><br><br>- Visit our luxury watchmaker collection for Android Wear on the Play Store http://goo.gl/QOsOu4<br>- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. <br><br><b>&#x2605;&#x2605;&#x2605;&#x2605;&#x2605; Engineered for the element</b>",
    "histogram": {
        "1": 137,
        "2": 100,
        "3": 298,
        "4": 1224,
        "5": 2438
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/N1pLjdrpggSaT6ad4zOhcNjUcaZjVR6pINalKzlhurdhSBKHO5p1spfu4QnxiwvJPg=h310",
        "//lh4.ggpht.com/rMlK7BCRBAGOYLJgV8DgFTQu_6uPUxkYPMcnHPhxPrMGXAuwFWHJcoiFYu1dcq9ZGA=h310",
        "//lh4.ggpht.com/fdbWtQoEqNVv7De_GD9HA7kAuEuPRAN4rzsear3oPiZYIa3xa7ilGlj_C5I6eJffqvU=h310",
        "//lh5.ggpht.com/Cvy-XoG2wZU4JhBJVeiR4B7pxHmiZXDBPyWpb6PCJf5UDGr90khSOlOGFI-V4MAGSS8=h310",
        "//lh5.ggpht.com/5f_Vx3rmX77w3ywcvHJ_J0MlK57JS3eci7ExxBqfgxxRFPMFF8D_5NrcMuyKUN_uHA=h310",
        "//lh4.ggpht.com/XMFJf2XyOQ7wC7lm4eduWMxCqPukoULeE4AG8_ktm1QPfjkruahBuLMkmLjfl5xfBA=h310"
    ],
    "comments": [
        "Minimal but attention to detail shows if you look for it. I try other faces from time to time but always come back to this. Very well done, thank you for making this!  -1 star for additional and IMO unneccsary permissions, which are easily-enough changed in Android 8 beta that I'm running but... why?",
        "This is a very nice watch face. However, I found it used 2x battery of my other watch faces and there are premium features available but the details are a mystery. I am disappointed since I purchased the (very good) Ranger watch face from this developer.",
        "Update for Android 2.0? Not sure what's been updated, the same info as prior. Need more complication options instead of just the one. Will give 5 stars when this is available.",
        "I install this app but as I launch this face from my mobile it does not go to my wearable watch",
        "I paid for the watch face and this app continues to crash on my phone despite reinstalling.",
        "As a low vision user this is one of the few watch faces I can actually see."
    ],
    "recentChanges": [
        "Android Wear 2.0 adaptations"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.smartwatchface.scuba.diver.watch.face.android.wear&hl=en&gl=us",
    "appId": "co.smartwatchface.scuba.diver.watch.face.android.wear"
}