{
    "title": "Ranger Military Watch Face",
    "summary": "Military watch face with special night mode design. Exclusive for Android Wear.",
    "icon": "//lh3.ggpht.com/LOK9Dp3kC1qWp5D-SrK5Far2jY3NTENdvyLmmvBpL9bdeharUYG0vA_LkGt-Sm4ZLWQ=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.4,
    "reviews": 7142,
    "developer": "Zuhanden",
    "developerId": "Zuhanden",
    "developerEmail": "mobile@zuhanden.de",
    "developerWebsite": "http://www.smartwatchface.co",
    "developerAddress": "Seehauser Str. 14\n81379 Munich\nGermany",
    "updated": "August 4, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Ranger is a military style watch face for your Android Wear device. Discover the urban ranger in you.This watch face features a special night mode design for ultimate readability in low light situations. Military engineering combined with unparalleled precision and reliability creates an iconic watch face ready to meet your most demanding challengesThis analog watchface will make your Android Wear device even more iconic: ★ Military watch with special night mode★ Multiple customization features ★ Adventurous spirit and exclusive design★ Multiple functions in small dials ★ Works for round and squared watches Android Wear 2.0 complicationsThis is a super flexible way to customize the information you see on this gorgeous watch face. In order to choose third party complications, please open the settings of the watch face on the smartwatch. Choose complications and select third-party complications. Now you can choose between a large selection of complications data providers. Watch face customization options:- Weather- Second time- 24h military time- Compass - Step tracker- Battery level indicators - Date and day of weekHow to access the customization settings:- Open Android Wear companion app- Select watch face in the selection- Then you will see a settings icon on top of the watch face - Press on the settings icon on top of watch picker - Now you can customize your watch faceSupported devices- Works on all Android Wear 2.0 devices - Supports round (e.g. Moto 360 and LG G Watch R) and rectangular smartwatches (e.g. Samsung Gear Live and LG G Watch). - Does NOT work on Samsung Gear and smartwatches using other operating systems More watch faces- Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. - Weather information is provided by http://openweathermap.org★★★★★ Designed by Greg Wilson http://www.gregwilson.la Engineered in Germany",
    "descriptionHTML": "Ranger is a military style watch face for your Android Wear device. Discover the urban ranger in you.<br><br>This watch face features a special night mode design for ultimate readability in low light situations. Military engineering combined with unparalleled precision and reliability creates an iconic watch face ready to meet your most demanding challenges<br><br>This analog watchface will make your Android Wear device even more iconic: <br><br>&#x2605; Military watch with special night mode<br>&#x2605; Multiple customization features <br>&#x2605; Adventurous spirit and exclusive design<br>&#x2605; Multiple functions in small dials <br>&#x2605; Works for round and squared watches <br><br><b>Android Wear 2.0 complications</b><br><br>This is a super flexible way to customize the information you see on this gorgeous watch face. In order to choose third party complications, please open the settings of the watch face on the smartwatch. Choose complications and select third-party complications. Now you can choose between a large selection of complications data providers. <br><br><b>Watch face customization options:</b><br><br>- Weather<br>- Second time<br>- 24h military time<br>- Compass <br>- Step tracker<br>- Battery level indicators <br>- Date and day of week<br><br><b>How to access the customization settings:</b><br><br>- Open Android Wear companion app<br>- Select watch face in the selection<br>- Then you will see a settings icon on top of the watch face <br>- Press on the settings icon on top of watch picker <br>- Now you can customize your watch face<br><br><b>Supported devices</b><br><br>- Works on all Android Wear 2.0 devices <br>- Supports round (e.g. Moto 360 and LG G Watch R) and rectangular smartwatches (e.g. Samsung Gear Live and LG G Watch). <br>- Does NOT work on Samsung Gear and smartwatches using other operating systems <br><br><b>More watch faces</b><br><br>- Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4<br>- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. <br>- Weather information is provided by http://openweathermap.org<br><br>&#x2605;&#x2605;&#x2605;&#x2605;&#x2605;<br><br><b> Designed by Greg Wilson http://www.gregwilson.la<br> <br>Engineered in Germany</b>",
    "histogram": {
        "1": 315,
        "2": 167,
        "3": 488,
        "4": 1809,
        "5": 4363
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/vlVrL95tUygLaoIOEiuHJmeDx6Z6MSTEyLFOo_DnxD3pXmwwC3c3TjjR0OYCYZU2Tw=h310",
        "//lh6.ggpht.com/fYzq8a8sBS99XKkHWrPL7TWPfLjaLXIngE7TM06UyBHyg4e6fCqwjc6I_639B6FuTQ=h310",
        "//lh4.ggpht.com/9j-k8885hi1gA1qZrXAaKMi80OZY9r0F-1rkhxPajdSVqbGOyXWReilUCQWR2zcEog=h310",
        "//lh4.ggpht.com/ay0FZMd0gtexiOFAVnIT31kShSg2MCZFH_TaToKopH_--vAXppAYBCL5SaCcTMZyiwzl=h310",
        "//lh4.ggpht.com/JNtgiwrdu2dlfM-ZHTGedyhwITvm9yQRFF2v_01c_vSVzsYpTcXBjEMrpHJYmeCMNR85=h310",
        "//lh6.ggpht.com/p7NLTswI1dzHpXFVpVyFqsOXUO3jumtbCYjGZKW0GMRY8NNtIzuysqz9IRN8w983jtxt=h310",
        "//lh6.ggpht.com/d1_SDKNqYCFYlOD_FT3LsZoA5pRXnaWzk4vLvasQ5papC41Bxh36n-zP7qszHT1iKtQ=h310",
        "//lh3.googleusercontent.com/EWLU36v7Bit5oIlGTcDt5rt66Dw5CroHWTYX6M3upRHnARfWQt84PClPUmv2v6mvQA=h310",
        "//lh3.googleusercontent.com/mHTpWzmSwBNq-H0FFaYuDVTOKO9w1sxKDJNzaFXl0JQOQLzsrnTTOErReUFs1Fpgw4g=h310",
        "//lh3.googleusercontent.com/pT-hZOCcYCuqu9DvXKp8BefFSknXb66TTEG5edRimTEL4LBw-Tjp5eZb_Ro_YbosYhk=h310",
        "//lh3.googleusercontent.com/hTG-kNVZUwNc1o-3CTgMJ2LuydIoYyjJGyzL2tg4xIln1Bq2HPUOPL5ijmJ610rf1sw=h310",
        "//lh3.googleusercontent.com/gcoOfr2jgYh9f1t8Xy_GNl5exWHYCfcFyVx4jtjqZL63avAHrKPRkNZGurniSpNngw=h310"
    ],
    "comments": [
        "I really didn't start enjoying my Android Wear watch until I installed the Ranger watch face. First of all, it has a custom square face that fits my watch precisely. It truly is always on unlike most watch faces. In addition to the time in regular and 24 hour format, it provides not only the day and the date, but also the temperature, the weather, and the status of your watch or phone batteries. Other watch faces seem limited in comparison.",
        "A nice watch face and would have given it 5 starts but it lost one as to my mind the settings are too easy to accidentally change. I'm forever finding the watch had gone into settings mode and more than once I've accidentally changed what complications are shown just by the watch brushing against things. It might be an Android Wear issue too but adding the ability to lock down your configuration would help a lot.",
        "(I should have read the short review by Mr. Austin before buying it.)  Its a beautiful watch face. Really nice looking and presents data perfectly.  But...  The compass and battery complications (while extremely useful and one of the reasons I bought it) will burn through battery like there's no tomorrow.  Disable these and you'll be fine.  But then, of course, your phone stock face will probably do the job equally well (with a much less \"cool\" quotient of course), for $1 less.  Buy it to show off/use, once in a while. Not for regular use.",
        "Great watch face with an original and attractive night mode but it slurped my battery from full to 30% in 8 hours. Wish I hadn't bothered. Will not buy a watch face which doesn't have a free trial or free basic face again. It was cheap but it's money wasted. Shame. I would have given it 5 otherwise.",
        "Best watch face I could find. I like the three complications shown and the grey/white night mode.  Most people don't know it is a smart watch.   I hope that Ranger can defeat the 2.0 problem of accidental screen modification.",
        "If the integration with Google Fit and weather were better, this would be one of the best watch faces. Doesn't seem to sync properly with Google Fit: steps & time seriously differ, don't sync consistently. Weather seems to be 5°-11° difference than Weather Bug and Google Weather."
    ],
    "recentChanges": [
        "Android Wear 2.0 improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.smartwatchface.watch.face.ranger.military&hl=en&gl=us",
    "appId": "co.smartwatchface.watch.face.ranger.military"
}