{
    "title": "World Timer Watch Face",
    "summary": "From Berlin to New York to Tokyo. View the time zones around the world.",
    "icon": "//lh3.googleusercontent.com/e158J61muwsRZnpE2LoWgCpVYcJLVzgCiLbTahmNg_bnS9SnNp9By0UFgk0UDAtCZCTW=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.9,
    "reviews": 216,
    "developer": "Zuhanden",
    "developerId": "Zuhanden",
    "developerEmail": "mobile@zuhanden.de",
    "developerWebsite": "http://www.zuhanden.de",
    "developerAddress": "Seehauser Str. 14\n81379 Munich\nGermany",
    "updated": "August 20, 2015",
    "version": "1.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "World Timer watch face helps you to keep track of various time zone around the world. It is the first worldtimer watch which automatically adjusts to daylight saving time. Unique features:- 24 timezones around the world- Automatic adjustment of daylight savings time- Earth view dial shows current view from sun- Battery indicator and date fields - Color customization possibilities Interactive watch face:You can zoom in on the earth dial or open a specific favorite app by simply tapping on the watch face. Please open settings to customize interactivity options.IMPORTANT: Interactive watch faces require the latest version of Android Wear, which is rolling out over the next few weeks. Hang tight for the update!Watch face dialsThis Android Wear watch face shows current local time and the 24-hour ring makes it easy to read off all 24 time zones and corresponding cities. You can select a reference city which is located at the 12 o’clock position of the dial. The earth dial gives you a spectacular view on our planet as it is currently seen from the sun. Or in other words, what parts of the earth is lit by the sun.The battery indicator at the 8 o’clock position shows you the battery levels of your smartwatch and the calendar date is situated at the 3 o’clock position.How to access settings of the watch face:- Open Android Wear Companion app- Select World Timer watch face - Tap on the settings icon, which is on top of the watch picker- Custom your watch face in the settings tabSupported devices- This Worldtime clock works on all Android Wear devices - Supports round (Moto 360) and rectangular smartwatches (Samsung Gear Live and LG G Watch). - The watchfaces do NOT work on Samsung Gear and smartwatches using other operating systems- The data of the earth view is greatly provided by https://www.fourmilab.ch/cgi-bin/Earth More watch faces- Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. Finest watchmaking made in Germany",
    "descriptionHTML": "World Timer watch face helps you to keep track of various time zone around the world. It is the first worldtimer watch which automatically adjusts to daylight saving time. <br><br><b>Unique features:</b><br><br>- 24 timezones around the world<br>- Automatic adjustment of daylight savings time<br>- Earth view dial shows current view from sun<br>- Battery indicator and date fields <br>- Color customization possibilities <br><br>Interactive watch face:<br><br>You can zoom in on the earth dial or open a specific favorite app by simply tapping on the watch face. Please open settings to customize interactivity options.<br><br>IMPORTANT: Interactive watch faces require the latest version of Android Wear, which is rolling out over the next few weeks. Hang tight for the update!<br><br><b>Watch face dials</b><br><br>This Android Wear watch face shows current local time and the 24-hour ring makes it easy to read off all 24 time zones and corresponding cities. You can select a reference city which is located at the 12 o&#x2019;clock position of the dial. <br><br>The earth dial gives you a spectacular view on our planet as it is currently seen from the sun. Or in other words, what parts of the earth is lit by the sun.<br><br>The battery indicator at the 8 o&#x2019;clock position shows you the battery levels of your smartwatch and the calendar date is situated at the 3 o&#x2019;clock position.<br><br><b>How to access settings of the watch face:</b><br><br>- Open Android Wear Companion app<br>- Select World Timer watch face <br>- Tap on the settings icon, which is on top of the watch picker<br>- Custom your watch face in the settings tab<br><br><b>Supported devices</b><br><br>- This Worldtime clock works on all Android Wear devices <br>- Supports round (Moto 360) and rectangular smartwatches (Samsung Gear Live and LG G Watch). <br>- The watchfaces do NOT work on Samsung Gear and smartwatches using other operating systems<br>- The data of the earth view is greatly provided by https://www.fourmilab.ch/cgi-bin/Earth <br><br><b>More watch faces</b><br><br>- Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4<br>- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. <br><br><b>Finest watchmaking made in Germany</b>",
    "histogram": {
        "1": 22,
        "2": 7,
        "3": 33,
        "4": 59,
        "5": 95
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/bqEO9-qa8zkwUaklmkJTp1xrmqBgT34DSD8X1mpaqcHe03YKL0ZW4cUjP5RSD51FRfIj=h310",
        "//lh3.googleusercontent.com/GJJueONchatloaOc6m8CTwcQQsqSHCzrsv7ezLYTLghx2aQAdTU4B4GmxnUbeFvWEQo=h310",
        "//lh3.googleusercontent.com/YrJUdMBMyqZgiCjAAugnxefHeR81bNRhqc3bWZlD4hmZ1L_lT-t5xL3pfM_nKrz_uhA=h310",
        "//lh3.googleusercontent.com/BqqRrSvO5d8O3J0T_wrLpdiOUWP2xaaFz4kR53CmLwz98GzKN-aaznWZoJBmKzm_U3bM=h310",
        "//lh3.googleusercontent.com/FUSm9bU_KZebPEUXTiCy8XySgztL1DiiF01tL08ZnyJCVYHkrGw6ZQ5dwx7Sjk5fHq4=h310",
        "//lh3.googleusercontent.com/r-NYinyA5Qh5gveVgdLBU3f1rXfNZBCyCgvZ2NXOznQpqEPmcwZ-KGl-_GkTQ652dOU=h310",
        "//lh3.googleusercontent.com/z3B1bH96nVTmdrjaqJACbc3tBvkzR6IcNeQ20Zs9Of-eHzfnQ44iMe40XoM6thtsbvI=h310",
        "//lh3.googleusercontent.com/QhZa9oYTvj82KTnvdHN_VS5ISCByATXCU4DXckBxd6SdABi-Z3xt301XpYcsC3LBuqEe=h310"
    ],
    "comments": [
        "A TON OF REVIEWS POINT THE SAME FLOOR ... The timezone ring needs to be LEGIBLE! FIX IT AND LOTS OF REVIEWS WILL BE 5* It's not legible in the pics. Grey and black! SHOULD BE BLACK AND WHITE AND BIGGER.",
        "Remove cities from dial? I really like this watch face. But one drawback I've found is: Although I can add cities to the dial, I can't seem to remove them - including the cities I've just added. If the developer could fix this I'd be happy to add another star to my rating",
        "Beautiful face Wear 2.0 not supported!  This is good looking and provides me with the required world time functionality. More customization would be appreciated: enlarge earth face, place a day and month in addition to date etc. Thank you!",
        "Most of my issues are specific to my use From the NYC time zone Japan will be unreadable because of the flat spot on the Moto 360. On a 42mm dial the font is just too small to read comfortably.  I'd prefer some multifunctional use to the \"globe\" such as local weather or detailed battery info. The existing battery life dial just looks awkwardly placed even though I know it is similar to an actual watch.  But given the price and the value I don't regret buying it.",
        "Truly enjoy this watch face but 2 SUGGESTIONS This watch face is simply beautiful. The 2 things I wish the dev would add:1)The ability to slightly change the font size or separately change the color/brightness intensity of the  city names and reference 24 hour ring fonts. 3) The ability to change the \" worldtimer\" logo wprding to whatever customized wording the user wishes (for example- Name, company name, etc). Add these and this watch face would be perfect.",
        "I would rate 5 stars if you can highlight/Slightly enlarge the selected city hour. Hard to read.."
    ],
    "recentChanges": [
        "Added interactivity to watch face:",
        "You can now zoom in on the earth dial or open a specific favorite app by simply tapping on the watch face. Please open settings to customize interactivity options.",
        "IMPORTANT: Interactive watch faces require the latest version of Android Wear, which is rolling out over the next few weeks. Hang tight for the update!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.smartwatchface.watch.face.world.timer&hl=en&gl=us",
    "appId": "co.smartwatchface.watch.face.world.timer"
}