{
    "title": "Odyssey Watch Face",
    "summary": "Odyssey transforms your Android Wear device into a futuristic time machine",
    "icon": "//lh3.ggpht.com/h0r6HCLO06PTEuk0k3S0pBsO7xvvm1SDalYVVY3xuBi9Gqza8t15cn2IYROKo-PN574=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.4,
    "reviews": 5763,
    "developer": "Zuhanden",
    "developerId": "Zuhanden",
    "developerEmail": "hans@smartwatchface.co",
    "developerWebsite": "http://www.smartwatchface.co",
    "developerAddress": "Seehauser Str. 14\n81379 Munich\nGermany",
    "updated": "August 4, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "This watch face for Android Wear takes elements of classic pilot watches and combines them with futuristic design. Travel through space and time with this modern piece of watchmaking. Features of the watch face:★ Date, day and month★ Second time ★ Weather information ★ Wear battery indicator★ Phone battery indicator This watchface works on circular watches and rectangular watches made for Android Wear.Android Wear 2.0 complications:This is a super flexible way to customize the information you see on this gorgeous watch face. In order to choose third party complications, please open the settings of the watch face on the smartwatch. Choose complications and select third-party complications. Now you can choose between a large selection of complications data providers. Interactive watch face: You can now customize how the watch face behaves when tapping on it (e.g. different color options or opening an app of your choice). Please choose between different options in the settings of the watch face.IMPORTANT: Interactive watch faces require the latest version of Android Wear, which is rolling out over the next few weeks. Hang tight for the update!More Android Wear watch faces- Visit our exclusive collection on the Play Store - Also please let us know if you like to have any other watchfaces to be added to our selection. - You can choose between two weather information providers http://openweathermap.org or http:// worldweatheronline.comFuturistic design by Florian Cordier",
    "descriptionHTML": "This watch face for Android Wear takes elements of classic pilot watches and combines them with futuristic design. Travel through space and time with this modern piece of watchmaking. <br><br><b>Features of the watch face:</b><br><br>&#x2605; Date, day and month<br>&#x2605; Second time <br>&#x2605; Weather information <br>&#x2605; Wear battery indicator<br>&#x2605; Phone battery indicator <br><br>This watchface works on circular watches and rectangular watches made for Android Wear.<br><br>Android Wear 2.0 complications:<br><br>This is a super flexible way to customize the information you see on this gorgeous watch face. In order to choose third party complications, please open the settings of the watch face on the smartwatch. Choose complications and select third-party complications. Now you can choose between a large selection of complications data providers. <br><br>Interactive watch face: <br><br>You can now customize how the watch face behaves when tapping on it (e.g. different color options or opening an app of your choice). Please choose between different options in the settings of the watch face.<br><br>IMPORTANT: Interactive watch faces require the latest version of Android Wear, which is rolling out over the next few weeks. Hang tight for the update!<br><br><b>More Android Wear watch faces</b><br><br>- Visit our exclusive collection on the Play Store <br>- Also please let us know if you like to have any other watchfaces to be added to our selection. <br>- You can choose between two weather information providers http://openweathermap.org or http:// worldweatheronline.com<br><br>Futuristic design by Florian Cordier",
    "histogram": {
        "1": 205,
        "2": 154,
        "3": 387,
        "4": 1564,
        "5": 3453
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/xiu8F7x-Tu6TRS0SlvTzf-uUqTD1JJehI8odbymj-ZxMoJNV2YCCJjC_s_3jho_XWZc=h310",
        "//lh3.ggpht.com/BqDBZEitF1HwTKm2HmmG-dA0DSUCXzixuCPLx-_6GNMQoZ117zgYKv_bY2r3B8GdJrIc=h310",
        "//lh6.ggpht.com/RMgNBUsPuFF_WE8mfY7E9GBBN4vwpswwp2jETOQD4UV84sitChL2Eycz0xxE_0TM2EM=h310",
        "//lh5.ggpht.com/HyWiJsv9i3T9OEukM_E3DG54StbEgrpRBl5Xa9HSpdr090UCgmIdSdu06Um9up9N8Ds=h310",
        "//lh6.ggpht.com/bEY1chqRg1qaQRh822MB9yLe3RccgNzlxXpFKI6ekZFcDi0H_Jc4IZLqSVimxR8scQ=h310",
        "//lh3.googleusercontent.com/ZkksQqVD1Xxax-tqbg56l-HgezAAeORN-FCMEqgHzBAR01ICeSDyliismmIGvdfbFq_Q=h310",
        "//lh3.googleusercontent.com/zSNSelvoSFwE0I9jZxtaDA57750JselHASLfDD29WV_6oXbqwZNo4Js5rcqeDiD_loU=h310",
        "//lh3.googleusercontent.com/v4jvyy7QEecNB1xO7-3iOhfVhuy52JFgh4V0c0AEK3GJL8_PbVgBVOxcM4_pkbKYUD0=h310",
        "//lh3.googleusercontent.com/sbEDzmWRJvChvYOseXBaehHWjRMXyq-H0ytw6zTdA9NIkv16dqm5_E3xjEaVL0PNMw=h310",
        "//lh3.googleusercontent.com/4kCcXx57zH7tMI3q0q8psEUp4xOWEC9KWOz7_Gl2pfJ7GNfRrPmNtAPaTbVA7e_Vex8=h310"
    ],
    "comments": [
        "A quality face with plenty of options... Months later:  As best I can tell this face was changed for  Android wear 2.  It isn't the same and lacks features previously available. Difficult to read in various light levels without setting it to max. I am abandoning it.",
        "It says it is installed but does not show up on Android Wear 2.0. This was my favorite watch face but now is useless.",
        "My favourite watch face but now I can't reinstall it on Moto 360.  edit workaround: set interactivity to app which then asks you to pick app on watch, after picking an app both the wear app and watch can see it again. :)",
        "Been looking, but I can't find a watch face that I like better. I just keep coming back to this one. Beautifully done.",
        "I just bought it and it works great with my Ticwatch E! Please dev just add a Notification Reminder always on if its possible on the app settings! Not all the notification works if i don't read something and i don't get a reminder that i have a notification in the background! Also for the steps it takes some time to show the exact steps i made,sometimes it takes even 5 minutes to refresh! Thanks for you work and for your time!  Danke schön liebe Dev 😊",
        "This is my #1 favorite watch face. I've gotten complements on it in clubs, before people realize it's a smartwatch.  Seems to have decent battery life.  I really have nothing negative to say about it. Maybe a better selection of weather providers would be nice?  But that hasn't negatively impacted me."
    ],
    "recentChanges": [
        "Android Wear 2.0 adaptations"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.smartwatchface.odyssey.watch.face&hl=en&gl=us",
    "appId": "co.smartwatchface.odyssey.watch.face"
}