{
    "title": "Watch Face - Modern Classics",
    "summary": "Modern Classics watch face is true eye-candy on your smartwatch.",
    "icon": "//lh3.ggpht.com/Z3E9e_YpKAwrbaGZrDWucMvN1pDCgHo9K-YV5OlZD3IzDf-3gEbbrshJUwCoQ5ah3w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 2366,
    "developer": "Zuhanden",
    "developerId": "Zuhanden",
    "developerEmail": "mobile@zuhanden.de",
    "developerWebsite": "http://www.smartwatchface.co",
    "developerAddress": "Seehauser Str. 14\n81379 Munich\nGermany",
    "updated": "April 9, 2015",
    "version": "1.5.6",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Modern Classics watch face is true eye-candy on your smartwatch.This watch face is a stylish interpretation of a classic watchface combined with modern functions of Android Wear.  Key custom features:-Ultimate readability-Clean and simplistic look-Battery indicator -Date information-Weekday display-Weather information This watch face is for rectangular smartwatches such as the Samsung Gear Live and round watches such as the Moto 360.Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4.  Also please let us know if you like to have any other watch faces to be added to our selection of watch faces.NOTE: This watch face is exclusively made for Android Wear and does not work on smartwatches with another operating system, e.g. the Samsung Gear watch.Weather information is provided by http://openweathermap.orgManufactured with style in Germany.",
    "descriptionHTML": "Modern Classics watch face is true eye-candy on your smartwatch.<br><br>This watch face is a stylish interpretation of a classic watchface combined with modern functions of Android Wear.  <br><br>Key custom features:<br><br>-Ultimate readability<br>-Clean and simplistic look<br>-Battery indicator <br>-Date information<br>-Weekday display<br>-Weather information <br><br>This watch face is for rectangular smartwatches such as the Samsung Gear Live and round watches such as the Moto 360.<br><br>Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4.  Also please let us know if you like to have any other watch faces to be added to our selection of watch faces.<br><br>NOTE: This watch face is exclusively made for Android Wear and does not work on smartwatches with another operating system, e.g. the Samsung Gear watch.<br><br>Weather information is provided by http://openweathermap.org<br><br>Manufactured with style in Germany.",
    "histogram": {
        "1": 232,
        "2": 126,
        "3": 323,
        "4": 621,
        "5": 1064
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/rl1MGFELoeoPvuSShyWxXtNPQFebaESdS1iGq-f5k6PpBvHA2RpVY-7W41BKlamd13A=h310",
        "//lh6.ggpht.com/WqKYGZmhUOmHaAjosa8ZQ0DuSMQEpK73t933WBsnzXaIzmtaICHm3wXnB0qNa_nkqzU=h310",
        "//lh3.ggpht.com/yo-Hso5NHXSRBeSDTy9FfQURdQU_NYFdw6LNUYl0UZt2yET56o_Lduy-vYxQIyV5gQ=h310",
        "//lh4.ggpht.com/IFhLuH9vzfFCwquOHQ6lvpb8pa5fHGkgV6B9qJsI8-9nGp9Lx_BM_UzQESREXx5RCqA=h310",
        "//lh5.ggpht.com/T4j2mVrSlxpt7yJRg-nxoQhqKvaj8jX_clamuvb2xj0Xi44TPjY9qV8BbyOi8yfQuns=h310",
        "//lh6.ggpht.com/ET0EDEaM1Fr_kNnwOdgzbpMBiJ5NB4O36_uKOsoYc1zFsiZ1FMGtDM0FpW4Ue10Omzs=h310"
    ],
    "comments": [
        "One of the most elegant watchfaces out there This would have been a 5* if there wasn't the problem with the voice input on the Huawei Watch. The other items could also benefit from some interactivity. Edit: downgraded to 1*, as no feedback from developer on the Huawei mic issue. I could provide log files if required.",
        "Only one criticism A truly beautiful watch face that's not power hungry! My only one criticism is the battery metre requires a higher contrast or two colours (red / green) between charge left and charge used. If this can be updated 5 Stars all the way :-)",
        "Decent Decent watch face for the 360. Played around with it for a bit but eventually went back to my other faces. I like the sweeping hand. Please add an option to change the ticks to hours instead of seconds for a stop watch. I don't want to use it as a stop watch so seeing the 60 seconds is useless.",
        "Problem with watch face size This is a really good watch face. The only problem I have is that the watch face isn't taking up all the space on my LG Watch Urbane. I have a thick black border around the watch face that I don't have with other watch faces.",
        "RIt deducted money for in app purchase but did not enable the purchased feature. Not sure if this is one off technixal issue or fraudulent business.  Further update: Refunded the money. So changed rating from 1 to 4.  A good looking but less featured watch face.",
        "My favorite watchface. Unfortunately the voice activation button doesn't work on the Huawei Watch (or on the new version of Android Wear?) It was working on my previouse watch the GWR. Would love to see it fixed again!"
    ],
    "recentChanges": [
        "Updated to new API"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.smartwatchface.modern.classics.android.wear.face&hl=en&gl=us",
    "appId": "co.smartwatchface.modern.classics.android.wear.face"
}