{
    "title": "Speeds Watch Face",
    "summary": "Speeds turns your Android Wear watch into a sporty time machine.",
    "icon": "//lh3.ggpht.com/4Y-DipryCO1inEwjgG_tgrErnu6gymQD4FXkeZ7os1Lfhi3uRtmPFT94BRMGhlaw4__L=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 5813,
    "developer": "Zuhanden",
    "developerId": "Zuhanden",
    "developerEmail": "mobile@zuhanden.de",
    "developerWebsite": "http://www.smartwatchface.co",
    "developerAddress": "Seehauser Str. 14\n81379 Munich\nGermany",
    "updated": "September 23, 2015",
    "version": "2.0.8",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "“Speeds” watch face turns your Android Wear watch into a sporty time machine.This free analog watch face unites classic sportive design with modern smartwatch functionality. It is an iconic custom watchface and a speedometer app at the same time.★ Sports watch with superb readability★ Easy to use companion speedometer app★ Adventurous spirit and exclusive design★ Customizable Android Wear watch face ★ Works for round and squared watches Watch face functions:- Classic Wear watch face - Battery level indicator - Date numerical- Day of the weekAlso check Speeds Pro Version:- Link to Pro Version: http://goo.gl/j1Wf57- Speed information- Compass - Step tracker- Weather- Second time- Battery level indicator - Date and day of weekSpeedometer wear app (how to):- Tap on the watch face- Select start menu- Choose Speeds App- Speedometer will be opened- GPS and speed tracking will be activated Why does watch face always show 6 mph?- Please open the integrated speedometer app to get accurate speed information - The speed element shown on the watch face is just for design purposes - Constant GPS tracking would drain too much battery- Please be aware that the speedometer app relies on the quality of the GPS signal of your smartphone.  - Please do not rely on the displayed information. Supported devices- Works on all Android Wear devices - Supports round (Moto 360) and rectangular smartwatches (Samsung Gear Live and LG G Watch). - Does NOT work on Samsung Gear and smartwatches using other operating systems More watch faces- Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. Engineered with love in Germany",
    "descriptionHTML": "&#x201C;Speeds&#x201D; watch face turns your Android Wear watch into a sporty time machine.<br><br>This free analog watch face unites classic sportive design with modern smartwatch functionality. <br><br>It is an iconic custom watchface and a speedometer app at the same time.<br><br>&#x2605; Sports watch with superb readability<br>&#x2605; Easy to use companion speedometer app<br>&#x2605; Adventurous spirit and exclusive design<br>&#x2605; Customizable Android Wear watch face <br>&#x2605; Works for round and squared watches <br><br><b>Watch face functions:</b><br><br>- Classic Wear watch face <br>- Battery level indicator <br>- Date numerical<br>- Day of the week<br><br><b>Also check Speeds Pro Version:</b><br><br>- Link to Pro Version: http://goo.gl/j1Wf57<br>- Speed information<br>- Compass <br>- Step tracker<br>- Weather<br>- Second time<br>- Battery level indicator <br>- Date and day of week<br><br><b>Speedometer wear app (how to):</b><br><br>- Tap on the watch face<br>- Select start menu<br>- Choose Speeds App<br>- Speedometer will be opened<br>- GPS and speed tracking will be activated <br><br><b>Why does watch face always show 6 mph?</b><br><br>- Please open the integrated speedometer app to get accurate speed information <br>- The speed element shown on the watch face is just for design purposes <br>- Constant GPS tracking would drain too much battery<br>- Please be aware that the speedometer app relies on the quality of the GPS signal of your smartphone.  <br>- Please do not rely on the displayed information. <br><br><b>Supported devices</b><br><br>- Works on all Android Wear devices <br>- Supports round (Moto 360) and rectangular smartwatches (Samsung Gear Live and LG G Watch). <br>- Does NOT work on Samsung Gear and smartwatches using other operating systems <br><br><b>More watch faces</b><br><br>- Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4<br>- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. <br><br><b>Engineered with love in Germany</b>",
    "histogram": {
        "1": 706,
        "2": 263,
        "3": 643,
        "4": 1370,
        "5": 2831
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/afhj2RyGZMScKQ1sM0YzCdod8j4L2Tu-ewgGR9i2s_Xv2OSKYib75llTwtT0G2WikDVw=h310",
        "//lh4.ggpht.com/yFdVRwl7-5-Wt2rdt72qPzrgzAYjv1dByPjqbtEpqh7SUSeetVwVpF5i3dTjxnJDYA=h310",
        "//lh5.ggpht.com/x2FaDQg62EL9RP9ad0k4vqK8J30iHeopJB1iT105ErRYlGo8MiNmCjfWX9ju1YhHp_PH=h310",
        "//lh4.ggpht.com/-Tyr2iEhVbgeuulOl8DQIMVUvo4-YSjKX-z_0aeVbRE0CW6yX9DgP9_b2GjPpRUkPEw=h310",
        "//lh5.ggpht.com/rQg6zcv-4EOo_0tXO22OhGNZW-yXszlMhU24abTWXCjEUe928eT3pVv_tQ99XT5xQw=h310",
        "//lh4.ggpht.com/r1NEN7u3D40_P6tWngjSJIQJy4Fxu3JdP_3sN-XTDuA_0cUyTbMPH1mRY05FaDr362U=h310"
    ],
    "comments": [
        "Works great for a lifted OlllllO! We have a Jeep that is lifted with huge tires that has caused the odo to be off. I was using my smart phone to see the speed usually when a police car was behind us. Now, Using this face on my Moto is just a flick of the wrist to make sure we are in compliance. This face has saved our butts a ticket! Thanks :)",
        "nice design but should have speed shortcut very nice design but speed doesn't work with Urbane 2nd Edition. It is weird that the speed app is not linked to the watch face. I see interactive faces with other watch faces. I would replace the number \"6\" with something fun like 99 so it is obvious it is not live ... well maybe for you slow pokes out there ;) Here is an idea. It would be cool that if it was designed that if you touch the speed area it would activate the speed and keep the screen live until it is touched again",
        "A great if cluttered face. If you like exactly what you see, go for it. Want any customization? Want to turn some stuff off? 2 bux please. Integration with a phone-based speedometer is a cool idea, though. Kudos to the author!",
        "Nice watch face. But being a speedometer app,  it lacks a very crucial feature. There is no option to change the speed units from mph to km/h",
        "Beautiful, but it crashes a lot for me. The speedometer is for show only, the functionality is activates with purchase of the full version. I would give it 5 stars if it didn't crash.",
        "Great face even in standby Not that bothered by the speedo. I just like the watch face. Smart and sophisticated. When in standby mode it still looks similar and nice instead if changing the look completely to something basic and ugly!"
    ],
    "recentChanges": [
        "2.0.8 Minor bug fixes",
        "2.0.7 Fixes to speed tracking functionality"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.smartwatchface.watch.face.speedometer.android.wear&hl=en&gl=us",
    "appId": "co.smartwatchface.watch.face.speedometer.android.wear"
}