{
    "title": "Skymaster Pilot Watch Face",
    "summary": "Skymaster watch face turns your Android Wear device into an advanced pilot watch",
    "icon": "//lh4.ggpht.com/QTwvklHwRTNeNLn6iFEu2bUWMLy8dJw55tS99507N8k1tp8WIK8U0lQJb6YJKHLObrxo=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 5968,
    "developer": "Zuhanden",
    "developerId": "Zuhanden",
    "developerEmail": "mobile@zuhanden.de",
    "developerWebsite": "http://smartwatchface.co",
    "developerAddress": "Seehauser Str. 14\n81379 Munich\nGermany",
    "updated": "July 5, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "In the pioneering days of aviation, most pilots had to navigate with the help of watches. These aeronautic watches needed to be legible, accurate, reliable and at the same time spectacular when rolling up the sleeves of a flight jacket. This analog Android Wear watch face (fka as Aviator) unites the character of an aeronautic watch with modern smartwatch functionality. Custom featuresThe iconic customized watchface features:★ Aviator watchface with superb readability★ Battery indicator ★ Date and day of week★ Weather conditions★ Advanced and luxury design ★ Interactivity and custom complications Android Wear 2.0 complicationsThis is a super flexible way to customize the information you see on this gorgeous watch face. In order to choose third party complications, please open the settings of the watch face on the smartwatch. Choose complications and select third-party complications. Now you can choose between a large selection of complications data providers. More watch faces- Visit our luxury watch face collection for Android Wear on the Play Store http://goo.gl/QOsOu4- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. - Weather information is provided by http://openweathermap.orgDesigned by Florian Cordier. Engineered in Germany.",
    "descriptionHTML": "In the pioneering days of aviation, most pilots had to navigate with the help of watches. These aeronautic watches needed to be legible, accurate, reliable and at the same time spectacular when rolling up the sleeves of a flight jacket. <br><br>This analog Android Wear watch face (fka as Aviator) unites the character of an aeronautic watch with modern smartwatch functionality. <br><br><b>Custom features</b><br><br>The iconic customized watchface features:<br><br>&#x2605; Aviator watchface with superb readability<br>&#x2605; Battery indicator <br>&#x2605; Date and day of week<br>&#x2605; Weather conditions<br>&#x2605; Advanced and luxury design <br>&#x2605; Interactivity and custom complications <br><br><b>Android Wear 2.0 complications</b><br><br>This is a super flexible way to customize the information you see on this gorgeous watch face. In order to choose third party complications, please open the settings of the watch face on the smartwatch. Choose complications and select third-party complications. Now you can choose between a large selection of complications data providers. <br><br><b>More watch faces</b><br><br>- Visit our luxury watch face collection for Android Wear on the Play Store http://goo.gl/QOsOu4<br>- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. <br>- Weather information is provided by http://openweathermap.org<br><br><b>Designed by Florian Cordier. <br>Engineered in Germany.</b>",
    "histogram": {
        "1": 274,
        "2": 159,
        "3": 404,
        "4": 1418,
        "5": 3713
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/fUUeqms61h629tIKajkGmW-LAsphZttkmAxzmGpTmqSIdnBT7_KHG9bG4j7uIGxvKg=h310",
        "//lh6.ggpht.com/cPJDIkMwPQT41D5K2Xww9d8IBR3sRkSw_IdRp6uAR7FLOo-lwB5XcdZBDtc5UvXWL24=h310",
        "//lh3.ggpht.com/D0brCi3olAIeLxeikHvK8be6hhrpsdPkLeDO2KAeZAbwfxML4luWpyYT7HexAemJbbI=h310",
        "//lh3.ggpht.com/EjUrIeTs_hQnsm2UUY9j-2wN2nUFCWarvUxVoo-PZXW3X5aiyZ07QfJt7ZpuExhDNznY=h310",
        "//lh4.ggpht.com/Nz1yDFSoM4hE3a1ST8xDXqP5xoD0UcxIck_7O2CY0E0xnUrEOAlUjhnh2VbS_kUrTgkz=h310",
        "//lh4.ggpht.com/Rqe-ujEKH7O-3M8dvjHNdR5jxQ_h--TwdH_yiwvw7_7hz4AUJNM-lliJU3I87W4aw4P4=h310",
        "//lh3.ggpht.com/SPFhiQHsH4YSKhBj9t1NibdWNcJEgDmJN3VuLzszJO4Eqh4ymzk0M0LaJ6XDWmTJen0=h310",
        "//lh3.ggpht.com/yxRU3vKwDTlVi2rZufVXmGF_Y1VlIPfAYGT13oPDQxlosiMdG6vfdQSoDv-di5kk1ic=h310",
        "//lh3.googleusercontent.com/oWURRQFbhS1pwM_CVWw9-G4pdT4OzbeDrqQA3uBZPJnvwxwXysu_rJsWNC5uvIlr8PQ=h310",
        "//lh3.googleusercontent.com/PA0eGEAjHIj14AR5jG07QBK-xuEIeXVqu_XAMRmaTHjutisCvaFnJL2m32Kycse1KCqY=h310",
        "//lh3.googleusercontent.com/Pl0Bzfedt-j_2UkPC7UTRX94PXV0FnlnpJozYZPomZ8RV6oD1IgJ_lIiHIvuZhTQ1w=h310",
        "//lh3.googleusercontent.com/ejbDieepvv6RQIe8wO8NF3_5MKGBXwvG6pCDVwLPepr3L04CpHNpdcjoWIUUZi9j7-s=h310",
        "//lh3.googleusercontent.com/hYgh5MKx5UB_RdoO5WE71vDdfsSPlrAlNVGiAvVx0rmCHHNFR8KsUzlQq20vZqhxHg=h310",
        "//lh3.googleusercontent.com/9EmKyIWqtazglo0i6B0hJtYoyRfFfRvfWINZA2pi6ZDLzwNUsOo8m7nD4bLDDC2NJKs=h310",
        "//lh3.googleusercontent.com/YlMUl_oXNBeIfjYEqR-K0yGvTydBOLb0gif3DbW_zQvYtkO9XfnzEMVhbgGuI650RTk=h310"
    ],
    "comments": [
        "My favorite looking watch face, my only problem is with the recent Android 2.0 update. Previously status indicators (dnd, disconnection, charging) appeared near the middle of the face, now they are appearing at the top of the screen, which is making it difficult to tell when my watch is disconnected or in DND mode. Is there any way to fix this?",
        "I love the look of this face, but the battery drain is horrible. My battery is dead after 8 hrs with only this face...16 hours otherwise. Even if I disable everything and go to the lowest screen brightness, it buys me another hour. Its a shame because I really want to use it otherwise.",
        "Very nice and elegant but after AW2 it's becoming very old and not useful. The developer doesn't answer or make any effort to improve it. Only complications works as icons and you cannot actually go to the application from it. No widgets as well. It is a shame as this is one of the best designed watchface. Hope the developer will start listening to the feedback.",
        "Overall, one of my favorite watch faces.  I love the day and dual battery dials, but the weather dial is useless.  It's always wrong.  It will be raining, and it will say it's clear, or vice-versa, as if the location is wrong. Fix the weather, and 5 stars.  Also, I wish there was an option to put voicemail and unread sms message count in one of the circles.",
        "The weather is no longer working for me. It is one of the major reasons I have the watch face. It now shows it as 70 degrees Fahrenheit and raining no matter the weather and location. Any way to fix this?",
        "I love this watch face , One of the best. The only problem I have is that When I choose third party complication such as google fit or AccuWeather , Nothing appears in the watch face , total blank .   Also , I will appreciate it if you can add option for digital time as a complication or as a replacement for the classic clock.   Thank you for this great watch face."
    ],
    "recentChanges": [
        "Improvements related to Android Wear 2.0"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.smartwatchface.watch.face.aviator.android.wear&hl=en&gl=us",
    "appId": "co.smartwatchface.watch.face.aviator.android.wear"
}