{
    "title": "Speeds Pro Watch Face",
    "summary": "Speeds turns your Android Wear watch into a sporty time machine.",
    "icon": "//lh4.ggpht.com/R1mxQso_me6r_g9c-WT68vub0tURWG__OlQdUqQ09rEJ-nXOx5RGkVAZkqp0I67Wj7I=w300",
    "price": "$2.14",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.3,
    "reviews": 1399,
    "developer": "Zuhanden",
    "developerId": "Zuhanden",
    "developerEmail": "mobile@zuhanden.de",
    "developerWebsite": "http://www.smartwatchface.co",
    "developerAddress": "Seehauser Str. 14\n81379 Munich\nGermany",
    "updated": "October 6, 2015",
    "version": "1.0.14",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Speeds Pro watch face turns your Android Wear watch into a sporty time machine.This analog watch face unites classic sportive design with modern smartwatch functionality. This Pro Version of Speeds offers a variety of customization options, so you can adapt the watch face to your personal style and preference.It is an iconic custom watchface and a speedometer app at the same time.★ Sports watch with superb readability★ Easy to use companion speedometer app★ Adventurous spirit and exclusive design★ Customizable Android Wear watch face ★ Works for round and squared watches Watch face customization options:- Speed information- Compass - Step tracker- Weather- Second time- Battery level indicator - Date and day of weekSpeedometer wear app (how to):- Tap on the watch face- Select start menu- Choose Speeds App- Speedometer will be opened- GPS and speed tracking will be activated Supported devices- Works on all Android Wear devices - Supports round (Moto 360) and rectangular smartwatches (Samsung Gear Live and LG G Watch). - Does NOT work on Samsung Gear and smartwatches using other operating systems More watch faces- Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. - Weather information is provided by http://openweathermap.orgEngineered with love in Germany",
    "descriptionHTML": "Speeds Pro watch face turns your Android Wear watch into a sporty time machine.<br><br>This analog watch face unites classic sportive design with modern smartwatch functionality. This Pro Version of Speeds offers a variety of customization options, so you can adapt the watch face to your personal style and preference.<br><br>It is an iconic custom watchface and a speedometer app at the same time.<br><br>&#x2605; Sports watch with superb readability<br>&#x2605; Easy to use companion speedometer app<br>&#x2605; Adventurous spirit and exclusive design<br>&#x2605; Customizable Android Wear watch face <br>&#x2605; Works for round and squared watches <br><br><b>Watch face customization options:</b><br><br>- Speed information<br>- Compass <br>- Step tracker<br>- Weather<br>- Second time<br>- Battery level indicator <br>- Date and day of week<br><br><b>Speedometer wear app (how to):</b><br><br>- Tap on the watch face<br>- Select start menu<br>- Choose Speeds App<br>- Speedometer will be opened<br>- GPS and speed tracking will be activated <br><br><b>Supported devices</b><br><br>- Works on all Android Wear devices <br>- Supports round (Moto 360) and rectangular smartwatches (Samsung Gear Live and LG G Watch). <br>- Does NOT work on Samsung Gear and smartwatches using other operating systems <br><br><b>More watch faces</b><br><br>- Visit our exclusive wearface collection for Android Wear on the Play Store http://goo.gl/QOsOu4<br>- Also please let us know if you like to have any other watch faces to be added to our selection of watch faces. <br>- Weather information is provided by http://openweathermap.org<br><br><b>Engineered with love in Germany</b>",
    "histogram": {
        "1": 51,
        "2": 40,
        "3": 97,
        "4": 396,
        "5": 815
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/WgVm0AN5FkjowlykXXVTR-zpc2AKJ0wafDaPQUY4KnJdKDj6sWIHVuEwe93OBgFPQZ4=h310",
        "//lh5.ggpht.com/IkSVrSQ1rxkARkJt86F9pg1FkXwr_G8vm2rdxoNKyQXGOgBjLdguETYnKyVLbqJyaQ=h310",
        "//lh5.ggpht.com/lxelBWg8ENHP48XSjOJ52LGPrjUrXv6yBdKWEw2llUTRIY7rBZH6MQbM31EHPBBMOw=h310",
        "//lh4.ggpht.com/x1H6_1V_nIeWQKXwWfQF5smGhnt2pXmHbhij-CP7ZUPM3USNSHtXTbDNe46MhpCdTcZ3=h310",
        "//lh3.ggpht.com/umBoIW8iiob35KfRq1lHGbMMSqX0CCmEee3Bvw0TWKkA3EKPJLNmojz8o6yiDoDlXk4=h310",
        "//lh3.ggpht.com/PaRVwMRi9bTk0bcI82pBuAcq05dtPGOpxUuy69NaGBCv1CAhX5GeRDkMxIrwx1jvND4=h310",
        "//lh5.ggpht.com/ygqDVVSmx6Y9t1EO4H4fEthzKS8vgUhy22BcKrnd2L3WaUUzwMt3x6FuN792QGiYmsE=h310",
        "//lh3.googleusercontent.com/fWGMY8YHI9iE9fcl5PyF0xAmhdzX1MbmMDniq675bPXsMEsYuXSf387tpZcBrijTWpQ=h310",
        "//lh3.googleusercontent.com/hO0MD8IQajMGx9pz_NzQCgNG4J9XOT_KgRx9skSPYISuMUyBD7Zuv_NQKbvKP2xLNKc=h310",
        "//lh3.googleusercontent.com/4mroVBCgbNOQ_7RcCcG-ZNwWKrb3-eTnaHC_DEAlqYMTBoCTPKdzxD3Hq67UfA5fQQha=h310",
        "//lh3.googleusercontent.com/qlLmkN5UYSgwKRUTiXUO8OdM8UP7F5Mn3skTaRD7l2672iQcVjUMUUoFmFPBO__XXtAv=h310",
        "//lh3.googleusercontent.com/Aw9Lu5WhdsGwI6acHXkB9Di4ukzlBZFIhbB7QlpvwKxKiCTNCven9gWDBohiPMkbgW8=h310",
        "//lh3.googleusercontent.com/UOsQOi-1P3KwrU9Id3kCWQV1IPUnq7oHFCieQn67jAx8u69K1Q5tzL6VBvfGUzQc7ArE=h310"
    ],
    "comments": [
        "Awesome face! Would like to be able to lengthen the time the watch remains in bright mode. 5 seconds is just too short. Other than that, the watch is near perfect. Add this suggestion and I'll up it to 5-stars! 10/14/16 Update: A year later and we still can't adjust the amount of time the face remains bright. Reducing rating to 3-stars.",
        "Current favorite This is my current favorite watchface by Zuhanden. Of course all of his watchfaces are amazing. I started with Ranger but I have switched to Speeds because I find it even clearer and easier to read. I also like the date indicator. The only thing I don't like is that it's a bit less customizable.",
        "♤ Bold ♢ Informative ♤ Attractive ♡ One pays for what one gets with this watch app - undeniably the best-of-breed. Efficient, functional & Informative SPEEDS cleverly packages most of a smart watch's classical information display into an attractive package while not getting an overcrowded look. Though some (unnecessary) elemental color/shape variables are lacking, the watch's SETTINGS are simple to activate, comprehensive and a pleasure to use.  KUDOS to ZUHANDEN.",
        "Great watch for moto 360 UPDATED 12/5/16: 1 Star because it won't stop asking me to rate it continuously the past year or two even though I have already. Please Stop!Orignal: Great watch and use it as my daily face setting for my 360. Had to take 2 stars off as it was completely relentless in asking for a rating. Seemed like every hour since install it kept asking me to rate it. Not an attractive feature when I   keep looking at my watch notifications and it's always taking up the screen asking me to rate it. Dial it down please...",
        "Awesome, but not perfect Would like more hand options, current hands are quite thick and at certain times block widgets. Also center circle that \"connects\" hands disappears in ambient mode. A white center circle in ambient mode would be great.",
        "Great watch face, would be perfect if more customizations were offered. This watch face does everything I want except allow customization of the self-branding that says 'Speeds' and 'Smart Watch Face Company' which unnecessarily clutters the display. I have the pro version and it would be great to remove or customize this text."
    ],
    "recentChanges": [
        "- Battery improvements",
        "- Minor bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.smartwatchface.speeds.pro.watch.face&hl=en&gl=us",
    "appId": "co.smartwatchface.speeds.pro.watch.face"
}