{
    "title": "Despicable Watch Face",
    "summary": "CHECK OUT THE TIME…&amp; THE MOOD OF THE MINIONS!",
    "icon": "//lh5.ggpht.com/nRxRYmGwJ3AKopJxawU1ikXbAZ744oKtH8aNzj27I3i1fK_12J22gb8Ld4K5JBEj_g=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 477,
    "developer": "Illumination",
    "developerId": "Illumination",
    "developerEmail": "dpgunipics@gmail.com",
    "developerWebsite": "http://www.illuminationentertainment.com",
    "developerAddress": "100 Universal City Plaza Suite 7C\nUniversal City, CA 91608",
    "updated": "December 11, 2014",
    "version": "1.0.6",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "NOTE: Please make sure your watch is running Android Wear 5.0. The update is rolling out now but may take a few days. Thank you for your patience.From Illumination and Universal Pictures, the team that brought you the DESPICABLE ME franchise and the upcoming film MINIONS, comes a Despicable new way to wear a watch. Now, you can experience the subversive Minions on your wrist and get an exclusive glimpse into their world:•\tCheck the time & find out your Minion's mood! Some are confused, others happy but they're always mischievous•\tBrand new style & unique Minion animations from the acclaimed Illumination team  HOW DOES IT WORK?You’ll see different Minions throughout the day as you check the time, some angry, some sad, some happy but all mischievous. Every once in a while, you’ll actually catch the Minions moving around causing trouble on your watch.______________________________Despicable Me and all related marks and characters are trademarks and copyrights of Universal Studios.  Licensed by Universal Studios Licensing LLC.  All Rights Reserved.______________________________See More Minions on Facebook:https://www.facebook.com/DespicableMe",
    "descriptionHTML": "NOTE: Please make sure your watch is running Android Wear 5.0. The update is rolling out now but may take a few days. Thank you for your patience.<br><br>From Illumination and Universal Pictures, the team that brought you the DESPICABLE ME franchise and the upcoming film MINIONS, comes a Despicable new way to wear a watch. Now, you can experience the subversive Minions on your wrist and get an exclusive glimpse into their world:<br><br>&#x2022;\tCheck the time &amp; find out your Minion&apos;s mood! Some are confused, others happy but they&apos;re always mischievous<br>&#x2022;\tBrand new style &amp; unique Minion animations from the acclaimed Illumination team  <br><br>HOW DOES IT WORK?<br>You&#x2019;ll see different Minions throughout the day as you check the time, some angry, some sad, some happy but all mischievous. Every once in a while, you&#x2019;ll actually catch the Minions moving around causing trouble on your watch.<br><br>______________________________<br>Despicable Me and all related marks and characters are trademarks and copyrights of Universal Studios.  Licensed by Universal Studios Licensing LLC.  All Rights Reserved.<br>______________________________<br>See More Minions on Facebook:<br>https://www.facebook.com/DespicableMe",
    "histogram": {
        "1": 32,
        "2": 15,
        "3": 50,
        "4": 117,
        "5": 263
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh6.ggpht.com/Kv7y5OuuCTrZhzBEvntsaIkLrsUI0yS2da4CY5jPtEgk9nsxX5gpT9ynKqHYvubE-g=h310",
        "//lh5.ggpht.com/UBbI5s-qEVIPHgx016xyZojFyyONEk6pRP3ch9j8oalRLElnwrALA-Ail38ThQmClvw=h310",
        "//lh6.ggpht.com/kdys3b73IRGq9_lmbX5UK0EyBA-pmd4Thu7zj-UAzsvzHvjRchbAPp8MXaB8_ypcW8g=h310",
        "//lh6.ggpht.com/kK6XpNGtORQHQwn5NsiJyaKklBjHwOmeNuR6fdnWQsnFtnWGK_7Ph3Q7CkMBSwC75X1B=h310",
        "//lh6.ggpht.com/R8xR0I_fzS1KkIi5o7QxMEiMzK4xPF0JiywSmGFecU0ADNXMomda7whio0Po9_bCy30=h310"
    ],
    "comments": [
        "Its okay You would figure that if you paid for an app that there would be a companion app installed on your phone to at least give you the illusion that you have some control over the the settings of said app. But the developers apparently figured that they were smarter than me and I am at their mercy. Being some who usually NEVER pays for apps, I am genuinely disappointed.",
        "Date and transitions Please add an option to display the date. It looks Esther bad the way it just jumps from one minion to another most of the time when coming from the black and white ambient mode. The change needs to be animated so it's not so jarring or change it only once per hour or something.",
        "It's good Installed with no problem on Sony Smartwatch 3.  Sorry can't help with install as it was just there after about 30 to 40 seconds, I know some times you need to disconnect your watch and re connect it to get things to work; have had to do this on other apps . If it had the date and steps would give it 5. Perhaps a new update soon with more minions?? Please",
        "Looks nice but no customization It looks nice and the animations are cool. But there's nothing you can customize. And the time is placed at roughly the same spot as where \"OK Google\" appears (on a round watch). Which makes it difficult to see the time.",
        "Puts a smile on my face. Works great on Samsung Gear Live. The animations are great. The numerals for time, although quite small, are still legible both in awake and ambient modes. Minions turn into line drawings in ambient mode to save battery.   I wish it showed the date!",
        "Moody Minions so fun! Love having the Minions on my Moto 360. It''s just a tad ever so slightly laggy but I bet it will be fixed in the next update. Hoping to see the developers release even more of these guys. Favorite is the coffee hyped minion!"
    ],
    "recentChanges": [
        "Icon update"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.touchlab.wear.despicable.watch&hl=en&gl=us",
    "appId": "co.touchlab.wear.despicable.watch"
}