{
    "title": "fit•hub",
    "summary": "fit•hub works as a hub for you and your fitness devices!",
    "icon": "//lh3.googleusercontent.com/CfkThpuEY2mm530tD8BAz4JAi9dkjH2uc23otrnXnkFetc0kzOmrbfmzBWh-J9cjgH8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.5,
    "reviews": 392,
    "developer": "Marcus Vinicius Andreo Gabilheri",
    "developerId": "Marcus+Vinicius+Andreo+Gabilheri",
    "developerEmail": "marcusandreog@gmail.com",
    "developerWebsite": "http://www.gabilheri.com",
    "developerAddress": "1619 N La Brea Av. Apt 206\nHollywood, CA",
    "updated": "November 6, 2016",
    "version": "3.2.1",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "fit•hub was one of the Grand Prize winners of the Google Fit Developers Challenge!! It has recently been completely redesigned. fit•hub works with the following accounts:  * Android Wear  * Fitbit  * Jawbone  * Misfit  * MovesIt does NOT work with:* Mi band (I would love to add support for this band. But... There is no support offered from Xiaomi to allow 3rd party developers app for Mi Band)* Garmin (There is no Open platform for developers to develop for Garmin Connect. I talked to their market system but they do not partner with small developers... So I will not be able to add support for Garmin) fit•hub works as a hub for you! No more having to look through all of your fitness apps to see your data.No more asking your friends with different devices how many steps they have today, be social and add friends to your list independent of their fitness tracker choice.fit•hub lets you sync multiple accounts into one single dataset or view them individually. Note that fit•hub can only read data from the official apps and can not be used in substitution of them. NOTE: If you are using a Custom ROM and are having troubles signing in to Google or authenticating Facebook, Google Fit, etc.. That is on your own. You should contact the developer of the ROM that you are using. Note2: If you are using Google fit it requires location. Check that location is enabled in your phone otherwise linking and syncing with Google Fit may not work.Note3: If you are using the Watchface and the weather is not being updated is because Location is not ON either. Go into Settings -> Enable location.fit•hub permissions explained:   *Internet: Access the data from the different fitness providers, sign in, check friends notifications.   * Run at start up and prevent from sleeping are necessary for the app to start the sync service when the device is restarted.   * Read Contacts is used to suggest you contacts to add to your friend list through their email address.   * Access WIFI and Network state is used to determine if the application has access to the internet or not.   * Find and use accounts on the device is necessary in order to Sign In with Google. This application was developed very fast by a college student (me) for the Google Fit challenge. for any bug report or feature request please contact me at: contact@gabilheri.com.Thank you.",
    "descriptionHTML": "fit&#x2022;hub was one of the Grand Prize winners of the Google Fit Developers Challenge!! <br><br>It has recently been completely redesigned. <br><br>fit&#x2022;hub works with the following accounts:<br>  * Android Wear<br>  * Fitbit<br>  * Jawbone<br>  * Misfit<br>  * Moves<br><br>It does NOT work with:<br>* Mi band (I would love to add support for this band. But... There is no support offered from Xiaomi to allow 3rd party developers app for Mi Band)<br>* Garmin (There is no Open platform for developers to develop for Garmin Connect. I talked to their market system but they do not partner with small developers... So I will not be able to add support for Garmin) <br><br>fit&#x2022;hub works as a hub for you! <br>No more having to look through all of your fitness apps to see your data.<br>No more asking your friends with different devices how many steps they have today, be social and add friends to your list independent of their fitness tracker choice.<br><br>fit&#x2022;hub lets you sync multiple accounts into one single dataset or view them individually. <br>Note that fit&#x2022;hub can only read data from the official apps and can not be used in substitution of them. <br><br>NOTE: If you are using a Custom ROM and are having troubles signing in to Google or authenticating Facebook, Google Fit, etc.. That is on your own. You should contact the developer of the ROM that you are using. <br><br>Note2: If you are using Google fit it requires location. Check that location is enabled in your phone otherwise linking and syncing with Google Fit may not work.<br><br>Note3: If you are using the Watchface and the weather is not being updated is because Location is not ON either. Go into Settings -&gt; Enable location.<br><br>fit&#x2022;hub permissions explained:<br>   *Internet: Access the data from the different fitness providers, sign in, check friends notifications.<br>   * Run at start up and prevent from sleeping are necessary for the app to start the sync service when the device is restarted.<br>   * Read Contacts is used to suggest you contacts to add to your friend list through their email address.<br>   * Access WIFI and Network state is used to determine if the application has access to the internet or not.<br>   * Find and use accounts on the device is necessary in order to Sign In with Google. <br><br>This application was developed very fast by a college student (me) for the Google Fit challenge. for any bug report or feature request please contact me at: contact@gabilheri.com.<br><br>Thank you.",
    "histogram": {
        "1": 61,
        "2": 39,
        "3": 60,
        "4": 92,
        "5": 140
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/zCv3G0bZJI-zGTbB14c8YXA1AexhdumovBAj3eXrtcrQAmqLyfU-6MN5ViPUDxGrTBE=h310",
        "//lh3.googleusercontent.com/OtHbukOSHpEnn7FMB2Yo07nrGKpxVWUYP1ltgMOKZFO2m7F9N1mU2TFUxgjFC3D66XCD=h310",
        "//lh3.googleusercontent.com/gqHrSHkMgbkoRnoFWpIClful23faWq3OoOINkPFsq2OQS6Ca7CmamUZNXdj0aL4DTKU=h310",
        "//lh3.googleusercontent.com/D5ODOeiPDnv-sNTe70EDA5HTFBzWVBWkHwQevscXQgTsEGAJ1ZvetYlwBmV-8amoBw=h310",
        "//lh3.googleusercontent.com/faGQRyeQ056ddp4Fq0YpDp0cXC43LWzo6tyGpS0qxHc35qV95cOzJt96X0bU8H4iNgqg=h310",
        "//lh3.googleusercontent.com/ljKZB20mkBecA9scOMDOHsNaQkZ7utmX2KceM2YMHBq44knMncY6a2b25-nqilaFIfYg=h310",
        "//lh3.googleusercontent.com/QRKbBGOUflHjc1g1pCJVMs-f4tuMQJ0_wb0NVz4IjxtcgR4-mpy4vLk0M5XDE49h0gI=h310",
        "//lh3.googleusercontent.com/suzvAIuS8FdHCXYwqYas77o1StYYslUVt92Vl0vvG9d5U8QtcsRF0CzAXsBlLG5-Rg=h310",
        "//lh3.googleusercontent.com/j4IV_P_wPT-oLtK8Ja98PzVxzPC2Glkx8GytSPvmpH_MwmyoLn13j381yMu5hCVqQQ=h310",
        "//lh3.googleusercontent.com/z2nEOPdbVbEzx0yq7A1lpkPX9k4bK08ok7sv-d8WsgqJMAwxiVKnePsktq2MPeFa72HY=h310",
        "//lh3.googleusercontent.com/jotd2pn09Zs0V-XcwfH8bW8bQexsyG9EbVmK8JlRH77Jj4fy5h9GCrTrLyHqhHAwR1Q=h310",
        "//lh3.googleusercontent.com/Y4pZJgL6T6Hq5p_DiZzuc_y-rOvyjRsB-NHPtBDKsSTHQXeqxCmUBnwr7ufPundu5Q=h310",
        "//lh3.googleusercontent.com/DLCr-nwmyc4aKqWIwZDFeRodX-4Q_uhnK4dvut6j6TLCvnuYc4C789m5_VZeBkMLbPE=h310"
    ],
    "comments": [
        "Perfect! Does what it's super to do and dies it better than the rest of them at play store.  @Marcus, is there any progress on the iOS app you started on a while back? That will make the app complete as I have to rely on Pacer app for the social experience ( Pacer does not do data sync with Google Fit but does with apple health and has no Android wear support) which is not so good on Android as it is on iOS. Will really appreciate a response.",
        "Excited to find this app because it promises to sync data from FitBit and Google Fit to name just a couple of apps/accounts. I have FB and GF authenticated, but steps don't seem to be populating into the app or displaying on my phone (Huawei Watch 2). Also cannot figure out how to access any available options for the watch face (assuming there are any). The issues could also be with the watch since it keeps losing Wi-Fi connectivity. Hoping it's not defective. The steps on my FitBit are greater than what the app is showing, so I still need to figure out what is going on. Other than that this app has an awesome design and is full of information with great potential. Thanks Marcus!",
        "Love this app! I really love being able to compete with my friends who have FitBits (I use Google Fit). My only complaint is the frequency with which it gets my data from Google Fit. My sister's FitBit updates constantly throughout the day, but mine only seems to update once at the end. Still a great app that I was missing for the longest time!",
        "So far, I have installed the app and tried to connect both Google Fit and Moves accounts, both separately and one at a time, and I always receive \"Error syncing data\" message.  Additionally receive  \"Error fetching location\" when trying to enable location, even though location is enabled in the phone.  I would really like to try the app, if it was actually working.  Edit:gave it a second chance.  Tried to log in with both Facebook and android.  Both told me I had logged in, but I was unable to move on from that screen.",
        "Like this app, but sleep has never synced got me, and most recent update broke it on Pixel XL on 7.1.2. All just force crashed, so I uninstalled and re installed, now it won't even connect to my Google account. Hope it will be fixed soon.",
        "The app that I have been searching for - to connect my Fitbit data to Google Fit. Simple interface. One time quick connection between each account of Fithub. The only issue I have is the syncing interval between Fitbit to Fithub - it does not allow manual syncing and it only syncs at the end of the day. So far I have no syncing issue with Fithub to Google Fit."
    ],
    "recentChanges": [
        "3.2.1",
        "* Small fixes",
        "3.2.0",
        "* Switched Google Fit from SDK to rest",
        "* Bug fixes on Watch face",
        "* Added app shortcuts",
        "3.1.8 ~ 9",
        "* Another attempt of fixing Google Fit syncing...",
        "3.1.7",
        "* Updated Play Services to 9.6.1",
        "3.1.5",
        "* Bug fixed when phone location was not on",
        "3.1.4",
        "* Bug fixes",
        "* Added Watchface!",
        "3.1.3",
        "* Implemented pagination for leaderboard",
        "* Small fixes on sync",
        "* Overall bug fixes",
        "3.1.2",
        "* Bug fixes",
        "* Added Profile to Drawer menu"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.gabilheri.fithub&hl=en&gl=us",
    "appId": "com.gabilheri.fithub"
}