{
    "title": "Levels Watch Face",
    "summary": "A minimalistic, moving watch face perfect for both round and square faces.",
    "icon": "//lh6.ggpht.com/-CGoHo9Fn2lWPTyHPh9In11Wbh9_igLKnWhxhS-lnUAZMTi1UDcRZ90EtPSEX8X-Ws0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.2,
    "reviews": 118,
    "developer": "Rory.games",
    "developerId": "Rory.games",
    "developerEmail": "rory@rorywebdev.com",
    "developerWebsite": "http://rorywebdev.com",
    "developerAddress": "Rory.games\nUnit 6605\nPO Box 7169\nPoole\nBH15 9EL\nUnited Kingdom",
    "updated": "January 1, 2015",
    "version": "1.1",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "As featured on the Android: Wear what you want advertThe Levels Watch Face is a minimalistic, moving watch face perfect for both round and square faces.Please note that this is for watches running Android Wear 5.0+MOVEMENTBoth levels rise and fall as time passes. The seconds rise to meet the top of the new minute.FULL CUSTOMISATIONAn array of customisation options allow you to change every colour on the watch, along with a number of extra visual items such as level shape and the representation of seconds.You can also choose whether to use 12 or 24 hours, as well as the option to rise to 12 or 24 hours.Please note it will take a short while for the watch face and settings app to initially sync between your phone and watch.Tested on LG G Watch R and both Round and Square Android Wear Emulators.",
    "descriptionHTML": "<b>As featured on the Android: Wear what you want advert</b><br>The Levels Watch Face is a minimalistic, moving watch face perfect for both round and square faces.<br>Please note that this is for watches running Android Wear 5.0+<br><br><b>MOVEMENT</b><br>Both levels rise and fall as time passes. The seconds rise to meet the top of the new minute.<br><br><b>FULL CUSTOMISATION</b><br>An array of customisation options allow you to change every colour on the watch, along with a number of extra visual items such as level shape and the representation of seconds.<br>You can also choose whether to use 12 or 24 hours, as well as the option to rise to 12 or 24 hours.<br><br>Please note it will take a short while for the watch face and settings app to initially sync between your phone and watch.<br>Tested on LG G Watch R and both Round and Square Android Wear Emulators.",
    "histogram": {
        "1": 5,
        "2": 5,
        "3": 15,
        "4": 34,
        "5": 59
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/8Zsi28UjZvSCwQey54SNPpzYtVrnCVQj4WmJqX2mrXHuUL1gJpU4c4jSnfugZOErnjg=h310",
        "//lh5.ggpht.com/5DDVs6f3SN5AB6eAdt7Fh0I-NJyMM_xGEsA022aopDsld8V4LE40pfkDYSjG6D3xQYA=h310",
        "//lh5.ggpht.com/jdYh1AAbi0rSIl0mUa73JGXScRJMXe1ZEOCj5Q2Vumk14dKIyEHfRmIUrmag8dsGkA=h310",
        "//lh6.ggpht.com/nWQ0YIyoBqujL7eo6n45Hu5JPitzBtGGF4v_EkW8-fKEWRKk10ZWNDdkQMzjmLIeqUc0=h310",
        "//lh3.ggpht.com/HD1_YvdBKcxWcOH2YAsglGxYikPOd4juw1nArBXn-0WKztiKrk7B0rjYWa0xfR__2Ng=h310",
        "//lh6.ggpht.com/161PVR1MSUCQmFF2UYq3P8Xp79a_jOJxbiebPd4rvAK3VJ-1cRI-3QEh3_KpfiU0q_0=h310"
    ],
    "video": "https://www.youtube.com/embed/Ybg5klCxQGA",
    "comments": [
        "Ambient mode needs options This is a great looking face and I love the customization options. The only problem is that ambient mode can look bad especially on a square face because it is naturally unbalanced. Adding different outline options or different ways of abstracting the main watch face on ambient mode would be great. For instance you could flip the first bar so that it shows the two faces in the middle of the watch face to keep it balanced.",
        "Nice minimalist face. I have two complaints. It doesn't show the date and day. Secondly, while charging, it seems to toggle between the night watch and the levels watchface.",
        "Nice! This is a very nice Watch Face. I tried with my Moto 360 and was impressed with colors and the animations.   Only thing I miss maybe is a level for battery life, that will be a great addition.",
        "Suggestion U should be able to save different custum watch faces that u make so u don't have to take a long time to make them constantly.",
        "Needs date added I love the look of the watch face but it needs to have the date somewhere even if it's just the top of the screen",
        "Great design This face looks nice and works well."
    ],
    "recentChanges": [
        "NEW OPTIONS APP (found through the Android Wear phone app)",
        "- Change every colour of the watch",
        "- Background",
        "- Top of the levels",
        "- Side of the levels",
        "- Ambient mode",
        "- Circular Levels",
        "- 12/24 Hours timing",
        "- 12/24 Hours level rising",
        "FIXES",
        "- Fixed bold text being removed on first ambient",
        "Please note it will take a short while for the watch face and settings app to initially sync between your phone and watch."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.rorywebdev.watch.level&hl=en&gl=us",
    "appId": "com.rorywebdev.watch.level"
}