{
    "title": "Retro Led Watchface Free",
    "summary": "Pixel design watchface",
    "icon": "//lh3.googleusercontent.com/kheq-sBIYYUa4J9BAeCb_6xlyn1gxst80DtMM3E86eIfTWNyBixj2lW5fcU9gZtGoWlq=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3,
    "reviews": 314,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "November 23, 2015",
    "version": "1.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Bring back the 70’s and let’s go retro. Retro Dot matrix Led watchface is the next best chic thing for your smart wear. With the cool color combo, pixel font, retro design this watchface will be among your top favorites. Stay updated with watch battery, time and date all on your wrist packed in a sleek design and it’s FREE. FrillRoid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:-• Classic retro Design• Ultimate readability • Clean and simplistic look with cool combo• Watch battery updatesThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, LG watch Urbane, Sony smartwatch 3, Asus Zenwatch and Samsung Gear Live. Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?It’s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Bring back the 70&#x2019;s and let&#x2019;s go retro. Retro Dot matrix Led watchface is the next best chic thing for your smart wear. With the cool color combo, pixel font, retro design this watchface will be among your top favorites. Stay updated with watch battery, time and date all on your wrist packed in a sleek design and it&#x2019;s FREE. <br><br>FrillRoid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br>Key custom features:-<br><br>&#x2022; Classic retro Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look with cool combo<br>&#x2022; Watch battery updates<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, LG watch Urbane, Sony smartwatch 3, Asus Zenwatch and Samsung Gear Live. Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br>How it works?<br>It&#x2019;s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 96,
        "2": 49,
        "3": 32,
        "4": 37,
        "5": 100
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/iDOh3hyrO50DNxQUtWAFZe5GyKG9gwHWwR2IB8JrDqJFs1-JGmQf0vdJnMGIUiip66A=h310",
        "//lh3.googleusercontent.com/eMOFFdrN1i4VTWVfUlTr7rzaDj2fgZ_ka5GOv_sPWQECEqkTxBaBgQyGCPCDudtHPg=h310",
        "//lh3.googleusercontent.com/XMvh3Jdk0gKQjPNA8nG6RGzz_5ce5fOGW9B8y4-RVlHMu0Sx8ol84bi0oiyWr5nlYtA=h310",
        "//lh3.googleusercontent.com/JYIMdM31WBw7zBMtq1OHnuZmvz_2w_r5kbNpd5hCk56QtvLyMWOUa4gU1-ueNcVfkhy1=h310",
        "//lh3.googleusercontent.com/shPHu_CI3I0e7icKRX7Ej8OQC1gw9cRFwg9CFlegKtt5Q1ppD1joPqugVEcHxMFen0P4=h310",
        "//lh3.googleusercontent.com/PXDsh0vcfLqsfsglZkfwU2VjxsvzDfch0meGtYoDR-oGJ828RLRdGUW998R4GRiWdw=h310",
        "//lh3.googleusercontent.com/HlGcEPJjB-6CjCuZMNFo8G7-jnrKQuZSc0xlWkpuMyu16L2P6eDdSsBGVExtV4WY0Q=h310",
        "//lh3.googleusercontent.com/qI7gAYu-gVIwoQxflOaXFrdKDkdXkNERGb1p4btRoqN3AZLzO4IS-Y1UVSSKeulcJFRO=h310",
        "//lh3.googleusercontent.com/KUMIkc4Z-CYJDBl4f5i1sxsSTYVVFQdf7Vrd9noNu9VwlXe7zI0eOJRU-XXnRzL0Dw=h310"
    ],
    "comments": [
        "The layout is very nice, however unless you have an amoled screen this will eat your battery alive in a very short amount of time.  I had to uninstall it from my moto 360 to stop my battery from draining at a phenomenal rate.",
        "Such a shame I was so excited to install this watch face on my smartwatch 3 because of how clean and elegant it looked but I got the shock of my life when the battery drained from 70% to 3% in 1 hour! 😰. Please fix the battery drain issue. It's colossal.",
        "WARNING. do not install. This face stopped my watch from charging. it drained to nothing and would not charge. took 3 days to get 2% battery into the watch. quickly changed face and it charged fine. this face almost made my moto 360 useless. DO NOT INSTALL........",
        "Charging issues When I'm using this watch face my moto 360 won't charge properly. It stucks at 60% or somewhere around that amount. Please fix it. It really looks good.",
        "Almost Put in a Square Trade Service Ticket Apparently this app is the culprit of draining of draining my battery to almost in operable condition. On top of that it keeps coming up with this annoying notification to sync.  A shame I have to uninstall because it is by far one of the best design I come across .it looks way better in person than it does looking at a picture",
        "Nice layout Only thing I didn't like was the fixed Fahrenheit display & locked up customisation option. I always end up doing the opposite to purchasing in such cases."
    ],
    "recentChanges": [
        "Bugs Fixed"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.retro.led.watch.face.free.D42&hl=en&gl=us",
    "appId": "com.frillroid.retro.led.watch.face.free.D42"
}