{
    "title": "Porsche Watch Face",
    "summary": "Keep your eyes on the track while keeping track of time in style.",
    "icon": "//lh4.ggpht.com/BFwdMeGJWi9UJvROlJ5e0iqazMOGuHaar0Qsa9pG3QO9oQWlg0OtmGRi6KJKeCCj7kA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.8,
    "reviews": 1746,
    "developer": "Dr. Ing. h.c. F. Porsche AG",
    "developerId": "Dr.+Ing.+h.c.+F.+Porsche+AG",
    "developerEmail": "contact@porsche.de",
    "developerWebsite": "http://www.porsche.com",
    "updated": "December 11, 2014",
    "version": "1.0.7",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Inspired by the definitive Porsche aesthetic of tradition and innovation, its sleek and minimal design transforms with the race season’s racing days, synchronizing Porsche fans around the world. Designed exclusively for Android Wear.",
    "descriptionHTML": "Inspired by the definitive Porsche aesthetic of tradition and innovation, its sleek and minimal design transforms with the race season&#x2019;s racing days, synchronizing Porsche fans around the world. Designed exclusively for Android Wear.",
    "histogram": {
        "1": 207,
        "2": 125,
        "3": 231,
        "4": 406,
        "5": 777
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/pKae2Tgj5kBrAcIW-rxZa5dEE3sATX1ZyeDFKhZquPrjQH17AQvVZGsXoX3NFJA0s_VZ=h310",
        "//lh3.ggpht.com/8yiIe2p1VcUpzxj1NreS_cRLB0Y6nFHEyDErW-4E-VP5W7tqBefjwlFgrG0ngJ52CA=h310",
        "//lh3.ggpht.com/cTn8wGsNk7daqpZPqAlStYgYTfQu83toteL7VeFGmSDy_C6eTbxo-KizaB8qldwOnw=h310"
    ],
    "comments": [
        "Works fine on Moto 360 Once the software update arrived on December 17, 2014 and my Moto 360 updated to Android Wear Lollipop, this watch face appeared. Nice, clean design. I haven't seen the race circuit background, but I guess this only appears on days when the Porsche factory team is racing?",
        "Does not look good. Moto 360 2nd Gen. Has a black quadrant at the right hand side that \"matches\" the one the 360 always has at the bottom. This makes the bottom/right of the face square while the rest is round. Must surely be a bug rather than a design feature. Will not be using this face as it stands.",
        "Alignment is wrong on Moto 360 I had been using this face and loving it as my primary watchface since it came out. Unfortunately after the recent 5.1.1 OS update, the alignment of the time and notifications is no longer correct. Dropping my rating from five stars to two stars until this watchface gets updated to work properly with 5.1.1.",
        "A good start As simple as it is and as many problems as people have,its really nice to see big companies like this embracing new technology. Once watch makers realize they can actually make money from designing smart watches well all benefit. keep it up, Porsche. Love the watch face.",
        "Rubbish Seriously Porsche??? It does not display properly on the Huawei Watch (or the Moto360 judging by other comments).  Fix it or stick to making cars!",
        "Graphic issue This worked great on my older Urbane, but my new Nixon has an issue with part of the graphic cut off on the right and the bottom cut off as well. Otherwise looks great!"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.porsche.watchface&hl=en&gl=us",
    "appId": "com.porsche.watchface"
}