{
    "title": "Ted Baker - Watch Face",
    "summary": "A watch face made to complement your Ted style, tailored for ladies and gents.",
    "icon": "//lh3.googleusercontent.com/7irY198YECYmbFiuNuSaE-fnfJ7SBCvCyLdmUBFbvrPRlOpF5Yqs502047-8LQMF9eM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 900,
    "developer": "Ted Baker. No Ordinary Designer Label",
    "developerId": "Ted+Baker.+No+Ordinary+Designer+Label",
    "developerEmail": "dl-pr@tedbaker.com",
    "developerWebsite": "http://tedbaker.com",
    "updated": "December 30, 2015",
    "version": "1.2.1",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Match your smartwatch to your ensemble with this superbly stylish Ted Baker-designed watch face. A must for modern ladies and tech-savvy gents, each face boasts a pair of Ted’s beautiful prints, where delightful detail is revealed with each passing moment. To liven things up, simply tap the face to invert the patterns.",
    "descriptionHTML": "Match your smartwatch to your ensemble with this superbly stylish Ted Baker-designed watch face. A must for modern ladies and tech-savvy gents, each face boasts a pair of Ted&#x2019;s beautiful prints, where delightful detail is revealed with each passing moment. To liven things up, simply tap the face to invert the patterns.",
    "histogram": {
        "1": 102,
        "2": 51,
        "3": 66,
        "4": 161,
        "5": 520
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/6GKlfaVajym9xQeBothxXpHSBVcTQO03D_Dw1v9Bw8CimZTycsFoZqXOkSARHK_P6V0=h310",
        "//lh3.googleusercontent.com/s9RCBGaSo1KrtL5iDPtrisHv9dbxLQLuLrHyZXmauWuasgyewNrpcr4jkN0w6gyTJyE=h310",
        "//lh3.googleusercontent.com/UvMESBbIfPbvSDHp0sGffHUabqdQJ1TKXBZDQIEoPqPDc2wPSn3rwgd3MPJ8Lx0x4ss=h310",
        "//lh3.googleusercontent.com/tzrcfzsFPpyCbEQu60NiOxW8gDvc-ZRmwjG19tdlOu1qXVy6LyFYOZrc_uWh5OfICw=h310",
        "//lh3.googleusercontent.com/fALpK6XY-ZebIn4Y6nhBurm00-6gjm3V_rwviKFz-5Q6wAQWhXBnINVOGrOLHxNKRMvL=h310",
        "//lh3.googleusercontent.com/A-scLAW7ZB2cJ3GwAAH_VkwdQNrU42QbcP6E1yaA80TdQ4Umx0qSDErB8ZuESyoOimc=h310",
        "//lh3.googleusercontent.com/kjkyvU6oOjdOytAN75lDXZjCnn-KKGpLt11pLr_7K29ROaZ169bvn-vm6DvaPEUhEzE=h310",
        "//lh3.googleusercontent.com/-XJ9IiXqjPauRhCAtSl4tEaTDlYZ9cyrTAkBHJ6530lGFeCeKXwi1Im-R-g-_fyb3g=h310",
        "//lh3.googleusercontent.com/N8zWt5dNz9FtYiLUMzxazJyuAPwKQdSHm8QBuYC_jrVNcvNll0DtepEI9EeUZNXQBsRO=h310",
        "//lh3.googleusercontent.com/ObFFNajjYsAudbZ0_YCEoHvX5r37daBge8jZnKPBiwwVR7U6-dudwZoEXQly65G4Vhc=h310",
        "//lh3.googleusercontent.com/1EOZTslxO4JNsQ3ki0hg1Mfo8yR2FeEQeTgNMI6u9h-890A_OkxdJwUpmN-d9cLCMgr8=h310",
        "//lh3.googleusercontent.com/dUOJbup2BKIjeuaSYHoX2DDT34tIb9pzS9INAltWfOh15XcsXClL_z0XKC1OF57TDA=h310"
    ],
    "comments": [
        "Update: This app works now. I still want the option to add widgets, but it's as beautiful as ever.  Currently IMO, Ted Baker has most beautiful faces available for Android Wear. I love them. I wish there were a way to add a couple of discreet widgets. Also, I'm not sure why they're separated into male/female categories.... For the most part, the faces are gender neutral.   Unfortunately, after the latest update, this app shuts down on launch. For reference, I have a brand new Zenwatch 2. Will update my review when it works.",
        "Beautiful Beautiful, even if limited, designs. I like the minimalist look. My only problem with this app is that when I go into the settings, I can't figure out how to select \"male\" vs \"female\". I think I've finally figured it out, but it is not at all intuitive, and it's not very responsive so it takes a while to actually get into the watch faces to see if I had done it right. I would love to see more watch face options - but only because they are beautiful and I love staring at them! :)",
        "Beautiful simplicity I don't know why people are negatively reviewing this but all you have to do to make the last update work on your watch is uninstall and then reinstall. It looks like they've patched it anyway so people who can't seem to simply troubleshoot can get their watch working again",
        "Android Wear 1.0: This is a great face that goes really well with suits/shirts.  Android Wear 2.0: Wear face didn't appear anywhere?. Reinstalled and it goes through full install process but again, no watch face. Uninstalled again and it's working though it's slow. Far better on Android 1",
        "Great faces but there's a problem The app works fine except for one small but pretty annoying detail. no matter what face I use, the second hand always stays light blue. Please try to fix, then this will be perfect",
        "Watch face selection difficult On a moto 360 the watch face selection page markers are hidden by the bottom part, so it's not obvious how to change faces."
    ],
    "recentChanges": [
        "- Bug fixed with new update"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mediamonks.watchface.tedbaker&hl=en&gl=us",
    "appId": "com.mediamonks.watchface.tedbaker"
}