{
    "title": "MyPlate Calorie Tracker",
    "summary": "MyPlate Calorie Tracker - Your Diet &amp; Fitness Calorie Counter for Better Health",
    "icon": "//lh3.googleusercontent.com/3oSoo3ulm-3gZJb77cuJb66TwzdGrSfmQG8KqYuc6OxUPaKYUZEQkh3LT-FAlHfb=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 20397,
    "developer": "LIVESTRONG",
    "developerId": "LIVESTRONG",
    "developerEmail": "support@livestrong.com",
    "developerWebsite": "http://www.livestrong.com",
    "developerAddress": "1655 26th St\nSanta Monica, CA 90404",
    "updated": "September 5, 2017",
    "version": "3.2.0(0)",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Tracking calories works! Join the millions who have lost weight with LIVESTRONG.COM’s MyPlate Calorie Tracker — the most user-friendly way to track your calories and stay fit on your Android Phone.LIVESTRONG.COM makes tracking calories EASY.- Browse a comprehensive food database with over 2 million items- Use our handy bar code scanner to find and track food easily- Create custom foods and meals- Get a personalized daily calorie goal based on your profile information- Keep track of your weight and progress over time- Review detailed data and create custom daily goals for your nutritional intake of protein, fat, carbs, fiber, sugar, sodium & more - Easily keep track of your water intake- Get real-time, 24/7 support from members of our motivational community and others on a similar journey- Set meal-time reminders to keep you on track- Integrate with Google Fit app to automatically track daily walking, running and biking activity- Log workouts from our extensive exercise tracking database- Create custom exercises or enter calories burned – helpful when using exercise equipment or heart-rate monitors- Sync with the Calorie Tracker via the LIVESTRONG.COM website at http://www.livestrong.com/myplate/ - Get full support for use on Android mobile devices and Android Wear Why choose MyPlate Calorie Tracker?* MACRONUTRIENTS MADE SIMPLE *A daily snapshot of protein, carbs and fat grams and percentages is prominently displayed, making it easy to monitor your macronutrient consumption and manage your desired ratio.* ROBUST PROGRESS SECTION *The extensive Progress section includes easy-to-read charts that give you a quick summary of your data including Calories, Weight, Carbs, Protein, Fat and much more. Easily view your progress for the week, or take a deeper dive and view progress over weeks, months and 1 year.* REAL-TIME COMMUNITY SUPPORT! *Looking for motivation or advice? Our active community message boards are filled with thousands of members offering each other support and advice, sharing recipes and tips and just sharing a laugh. It’s a great place to connect with like-minded people who share similar health and fitness goals.* EVEN MORE ON LIVESTRONG.COM *Check out our FREE companion tool on LIVESTRONG.COM with additional features such as meal plans, workout videos and the latest news and information about healthy eating, exercise ideas and much, much more. And did we mention that’s all FREE??* UPGRADE TO A LIVESTRONG.COM GOLD MEMBERSHIP *Choose between three price tiers and periods (1 month for $9.99, 6 months for $29.99 or 1 year for $44.99). The price will be shown in the app before you complete the payment. The subscription automatically renews at the end of every period you choose. Subscriptions are easily managed from the My Apps screen in the Play Store app. A Gold Membership includes:- Advanced statistics, including daily averages, trends and more- Exclusive access to the private Gold Members board in the community- Our Clean Eating Guide, including 21 recipes and tips for eating clean- A special Gold member badge in the community- Priority support from our customer support teamYour subscription will be processed by Google Play using Google payments. View or cancel your subscription at any time via the My Apps screen in the Play Store app. If you cancel your subscription in the middle of a billing period your premium membership will not be removed until the end of the current billing cycle",
    "descriptionHTML": "Tracking calories works! Join the millions who have lost weight with LIVESTRONG.COM&#x2019;s MyPlate Calorie Tracker &#x2014; the most user-friendly way to track your calories and stay fit on your Android Phone.<br>LIVESTRONG.COM makes tracking calories EASY.<br><br>- Browse a comprehensive food database with over 2 million items<br>- Use our handy bar code scanner to find and track food easily<br>- Create custom foods and meals<br>- Get a personalized daily calorie goal based on your profile information<br>- Keep track of your weight and progress over time<br>- Review detailed data and create custom daily goals for your nutritional intake of protein, fat, carbs, fiber, sugar, sodium &amp; more<br> - Easily keep track of your water intake<br>- Get real-time, 24/7 support from members of our motivational community and others on a similar journey<br>- Set meal-time reminders to keep you on track<br>- Integrate with Google Fit app to automatically track daily walking, running and biking activity<br>- Log workouts from our extensive exercise tracking database<br>- Create custom exercises or enter calories burned &#x2013; helpful when using exercise equipment or heart-rate monitors<br>- Sync with the Calorie Tracker via the LIVESTRONG.COM website at http://www.livestrong.com/myplate/ <br>- Get full support for use on Android mobile devices and Android Wear<br><br> Why choose MyPlate Calorie Tracker?<br><br>* MACRONUTRIENTS MADE SIMPLE *<br><br>A daily snapshot of protein, carbs and fat grams and percentages is prominently displayed, making it easy to monitor your macronutrient consumption and manage your desired ratio.<br><br>* ROBUST PROGRESS SECTION *<br><br>The extensive Progress section includes easy-to-read charts that give you a quick summary of your data including Calories, Weight, Carbs, Protein, Fat and much more. Easily view your progress for the week, or take a deeper dive and view progress over weeks, months and 1 year.<br><br>* REAL-TIME COMMUNITY SUPPORT! *<br><br>Looking for motivation or advice? Our active community message boards are filled with thousands of members offering each other support and advice, sharing recipes and tips and just sharing a laugh. It&#x2019;s a great place to connect with like-minded people who share similar health and fitness goals.<br><br>* EVEN MORE ON LIVESTRONG.COM *<br><br>Check out our FREE companion tool on LIVESTRONG.COM with additional features such as meal plans, workout videos and the latest news and information about healthy eating, exercise ideas and much, much more. And did we mention that&#x2019;s all FREE??<br><br>* UPGRADE TO A LIVESTRONG.COM GOLD MEMBERSHIP *<br><br>Choose between three price tiers and periods (1 month for $9.99, 6 months for $29.99 or 1 year for $44.99). The price will be shown in the app before you complete the payment. The subscription automatically renews at the end of every period you choose. Subscriptions are easily managed from the My Apps screen in the Play Store app. <br><br>A Gold Membership includes:<br><br>- Advanced statistics, including daily averages, trends and more<br>- Exclusive access to the private Gold Members board in the community<br>- Our Clean Eating Guide, including 21 recipes and tips for eating clean<br>- A special Gold member badge in the community<br>- Priority support from our customer support team<br><br>Your subscription will be processed by Google Play using Google payments. View or cancel your subscription at any time via the My Apps screen in the Play Store app. If you cancel your subscription in the middle of a billing period your premium membership will not be removed until the end of the current billing cycle",
    "histogram": {
        "1": 511,
        "2": 258,
        "3": 584,
        "4": 4409,
        "5": 14635
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/IDBi3S4qaLSgxjjZzwc5eO-l8kpWtoyqCJz48MXnT082Qk7EQGbkpCshF2PUyWjXCA=h310",
        "//lh3.googleusercontent.com/IvVWyxZ68V3KAgV4rP_6JkY1tryBeAyZ1-TVDp0hyWr3jhcujzBSj695RT8ktsMhwiU=h310",
        "//lh3.googleusercontent.com/NF3eopAp8iWaTuWEOGW5_lFTJWXnts1XHEMUnbT01Asbx5x_6xqK2_yV1GJIks8Sr0Q=h310",
        "//lh3.googleusercontent.com/M7vcS8TMFJQEKQVZtRv36mkSVwBrovVe04iR2WsV1F2dW6nXpuh4Tv1WmXC5NN0BtK7i=h310",
        "//lh3.googleusercontent.com/g1682hPYXaIk8ExyC97HzFhuW8Js7mf-uh7YLBz3Rs0sE9OcEIxJqIley8NTZfTV2g=h310",
        "//lh3.googleusercontent.com/yyK8MM5AMfk9KkJcB_zXEvrCNlnLCW6GzbcBPhoG5XFyLnoHU_P-UAhyIBFFByEJNQ=h310",
        "//lh3.googleusercontent.com/Q6kR2vMKWsCUy66ZVTg4rSlleZ8dLhI2I_E0l7TsWOQ3EpBAvR92S351lk8fqA6L5Oc=h310",
        "//lh3.googleusercontent.com/1t4RZi6zz-SDz0rcPM_-rM4Z6wrh5wBsimveXhy0zE323gDxWyn6MbqTqbGrRyV7rPA=h310",
        "//lh3.googleusercontent.com/0rHNh3RbLReASgdaqtH9ZYTJY9xhoY-BCD2U6Ayz7Z5aQtJd-X59BTvx2tTK5uG77LI=h310",
        "//lh3.googleusercontent.com/woTHZcD6c4xL3od-4vTo5FMRIgK_GGJYePPTCozvsTmJ82SftxosI_LTPl_fwk5WKg=h310",
        "//lh3.googleusercontent.com/IFc0XOFRAcFKAavFaEoPQly3UveCJWEzOIDy5HMYbIMq-P_zq1Ru0qqB1c-VNdpFxg=h310"
    ],
    "comments": [
        "There was an app similar to this called the daily plate by livestrong...it was much easier to find more specific items on the other app I.e. \"Starbucks venti nonfat butterscotch frappe\"  with no problem.. in this one I find myself having to scan everything, but all in all it does what it's supposed to...helps you track cals in vs cals out and stick to your intake/outtake goals.",
        "Using web version for years and always missed having a good android app. This improved app is surely a wow with useful features like add + button, barcode and intuitive recent list. Just improve the search - it does not search keywords within 'my meals' and 'recent' items on app do not sync with 'frequently used'  on Web version. Sometimes you lose  saved items - does it say 'saved changes' too soon?",
        "over all this app is smooth however if one is truely a work out person with knowledge then this app won't cut it. We need to be eatting smaller meals 5 to 6 times per day perhaps even more. This app fails to allow us to add more then 3 meal slots. I'll be heading back to a different app",
        "Signup was too complicated, there doesn't seem to be any way to delete food from a meal if you accidentally add it, and to set your age is beyond ridiculous! Unless you're 22, you'll have to click backwards through the calendar to get to your birth date. Trust me, I was clicking a long time. Such a simple feature to let you type in your date, too. I don't know why they don't have it. Used it for 1 day and uninstalled.",
        "Cant use app. Need to have a Fakebook account, which I dont have or go through process of signing up with an email (what if the app sucks and i went to the trouble for nothing). Instead ill give you a negative review because - get with the times this is Andriod, why cant we just use Google account login?!",
        "I really like this app. I've only been using it for a few days now so I haven't really seen any results in terms of weight loss but it is wonderful being able to monitor what I put into my body. My only problem is the barcode scanner. I not surprised it doesn't work for me since I'm in Iceland. It makes sense that the app doesn't have a lot of the stuff available here as I'm sure there aren't a lot of users from Iceland, but so far I've only been able to use the scanner once. I expected the app to at least have some of the imported stuff."
    ],
    "recentChanges": [
        "New Motivational Wallpapers!",
        "Because we want you to “Slay all day,” we’ve chosen some of our favorite motivational quotes for you to set as your background. Each motivation is hand-drawn and hand-painted by our super talented designer Gracie Wilson. These wallpapers are free for all users. “Embrace the Journey!” with your favorite motivational wallpaper.",
        "New Partnership",
        "We’ve partnered with Del Monte® to inspire you to make smarter choices without sacrificing convenience."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.livestrong.tracker&hl=en&gl=us",
    "appId": "com.livestrong.tracker"
}