{
    "title": "Flip Clock Watch Face",
    "summary": "Flip Clock Watch Face for Android Wear. Animated and Customizable.",
    "icon": "//lh3.googleusercontent.com/ryyk2yXWGo_SbOfwkjHqWKDNjtQSCh7lydIX8e05h5q9u6YNHb5iYoHLXfynU7XUq90=w300",
    "price": "$1.49",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 1246,
    "developer": "Studio eXtreme",
    "developerId": "7274979146896532847",
    "developerEmail": "academyextreme@gmail.com",
    "developerWebsite": "http://academyextreme.com",
    "developerAddress": "41-909 Bytom, Krotka 7\nPoland",
    "updated": "January 17, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Flip Clock Watch Face for Android Wear.Sentimental return to the Retro Style.Compatible with round and square watches.Flip Clock is a battery friendly, animated watch face with a wide range of color options as well as many novel and original customizations.Now with Presets (create, save, share, import) and with full spectrum (over 40) of interactive functions!NOVEL FEATURES★ LITTLE WORLDS OPTIONallowing you to create, change and upload “WORLDS” visible at the bottom of your watchCheck out the multitude of Little Worlds on Google+ community: http://goo.gl/vv8WB3 and get inspired!★ CHAMELEON THEMES OPTIONallowing you to apply some specially designed skins such as carbon, wooden, tiled, leather and reptile skin to the background of your watch as well as the flaps. Look for Themes in Watch section.★ OUTLINE NUMBERS OPTION for the SUPERB BATTERY EFFICENCY AND BURN PROTECTIONNow you can use your watch longer, activating the elegant OUTLINE NUMBERSKEY FEATURES ★ USER FRIENDLY SETTINGS PANELthe settings panel (accessible via Android Wear application)  on the phone or tablet allows you to navigate all the options of Flip Clock with ease★ BATTERY EFFICENCY Flip Clock is a battery friendly watch face that was thoroughly tested by a wide group of testers.★ GOOGLE FIT STEPS - use custom text tags to display your FIT data (steps)★ INTEGRATION with Tasker - interactive watch face functions now with 'Run Tasker Task' option!★ WEATHER FORECAST DISPLAY  - choose your weather provider - define your weather time update - customize your weather display: use an icon or a text★ FONTS AND TEXT - enjoy a wide range of fonts  - use special TAGS inside custom text - add EMOJI in custom text lines★ COLORED OR BLACK&WHITE DIM MODE - enjoy freedom: full colored or black & white DIM mode★ VARIETY OF DATE FORMATS - play with a date format and customize it to your needs, use either full or shortened names of the days and months, start with a year, month or day – everything is up to you★ BATTERY INFO DISPLAY have access to the battery use info on your watch and phone ★ CUSTOMIZATION OF THE NOTIFICATION CARDS - set the size of the notification cards  - turn on the translucent notification cards option★ CONTROL over the \"ok Google\" position- decide where the “ok Google” appears ★ ANIMATIONS - Flip Clock is a fully animated watch face with a sequenced time change. All flaps animate separately.  - You can control the flaps speed.★ Designed for Android Wear System only★ COMPATIBLE WITHAsus ZenWatch (all models)Fossil Q (all models)Huawei WatchLG Watch SportLG Watch StyleLG G Watch R ( lgwr )LG G Watch W100 ( lgwg )LG Urbane ( lgwu )LG Urbane 2 LTEMoto 360Moto 360 2015Nixon ( The Mission )Samsung Gear LiveSony Smartwatch 3 ( sw3 )TAG HeuerJoin our beta community and be the first to familiarize with all new features: https://goo.gl/uDutMr★ FAQ, problem solutions and guides: http://goo.gl/5b83SbThank you very much for your interest in our application.If you find our watch faces inspiring and outstanding, familiarize with our unique collection on: http://goo.gl/gF3W1f★ Additional Permissoins for Interactive Version:Camera: for flashlight controlMicrophone: for voice note recording function",
    "descriptionHTML": "<b>Flip Clock Watch Face for Android Wear.<br>Sentimental return to the Retro Style.<br>Compatible with round and square watches.</b><br><br>Flip Clock is a battery friendly, animated watch face with a wide range of color options as well as many novel and original customizations.<br><br><b>Now with Presets (create, save, share, import) and with full spectrum (over 40) of interactive functions!</b><br><br><b>NOVEL FEATURES</b><br><br>&#x2605; <b>LITTLE WORLDS OPTION</b><br>allowing you to create, change and upload &#x201C;WORLDS&#x201D; visible at the bottom of your watch<br>Check out the multitude of Little Worlds on&#xA0;Google+ community:&#xA0;http://goo.gl/vv8WB3 and get inspired!<br><br>&#x2605; <b>CHAMELEON THEMES OPTION</b><br><br>allowing you to apply some specially designed skins such as carbon, wooden, tiled, leather and reptile skin to the background of your watch as well as the flaps. Look for Themes in Watch section.<br><br>&#x2605; <b>OUTLINE NUMBERS OPTION for the SUPERB BATTERY EFFICENCY AND BURN PROTECTION</b><br>Now you can use your watch longer, activating the elegant OUTLINE NUMBERS<br><br><b>KEY FEATURES</b><br> &#x2605; <b>USER FRIENDLY SETTINGS PANEL</b><br>the settings panel (accessible via Android Wear application)&#x2028; on the phone or tablet allows you to navigate all the options of Flip Clock with ease<br><br>&#x2605; <b>BATTERY EFFICENCY</b><br> Flip Clock is a battery friendly watch face that was thoroughly tested by a wide group of testers.<br><br>&#x2605; <b>GOOGLE FIT STEPS</b><br> - use custom text tags to display your FIT data (steps)<br><br>&#x2605; <b>INTEGRATION with Tasker</b><br> - interactive watch face functions now with &apos;Run Tasker Task&apos; option!<br><br>&#x2605; <b>WEATHER FORECAST DISPLAY <br> - choose your weather provider<br> - define your weather time update<br> - customize your weather display: use an icon or a text</b><br><br>&#x2605; <b>FONTS AND TEXT</b><br> - enjoy a wide range of fonts <br> - use special TAGS inside custom text<br> - add EMOJI in custom text lines<br><br>&#x2605; <b>COLORED OR BLACK&amp;WHITE DIM MODE</b><br> - enjoy freedom: full colored or black &amp; white DIM mode<br><br>&#x2605; <b>VARIETY OF DATE FORMATS</b><br> - play with a date format and customize it to your needs, use either full or shortened names of the days and months, start with a year, month or day &#x2013; everything is up to you<br><br>&#x2605; <b>BATTERY INFO DISPLAY</b><br> have access to the battery use info on your watch and phone <br><br>&#x2605; <b>CUSTOMIZATION OF THE NOTIFICATION CARDS</b><br> - set the size of the notification cards <br> - turn on the translucent notification cards option<br><br>&#x2605; <b>CONTROL over the &quot;ok Google&quot; position</b><br>- decide where the &#x201C;ok Google&#x201D; appears <br><br>&#x2605; <b>ANIMATIONS</b><br> - Flip Clock is a fully animated watch face with a sequenced time change. All flaps animate separately. <br> - You can control the flaps speed.<br><br>&#x2605; <b>Designed for Android Wear System only</b><br><br>&#x2605; <b>COMPATIBLE WITH</b><br>Asus ZenWatch (all models)<br>Fossil Q (all models)<br>Huawei Watch<br>LG Watch Sport<br>LG Watch Style<br>LG G Watch R ( lgwr )<br>LG G Watch W100 ( lgwg )<br>LG Urbane ( lgwu )<br>LG Urbane 2 LTE<br>Moto 360<br>Moto 360 2015<br>Nixon ( The Mission )<br>Samsung Gear Live<br>Sony Smartwatch 3 ( sw3 )<br>TAG Heuer<br><br><b>Join our beta community and be the first to familiarize with all new features:</b> https://goo.gl/uDutMr<br><br>&#x2605; <b>FAQ, problem solutions and guides:</b>&#xA0;http://goo.gl/5b83Sb<br><br><b>Thank you very much for your interest in our application.</b><br>If you find our watch faces inspiring and outstanding, familiarize with our unique collection on:&#xA0;http://goo.gl/gF3W1f<br><br>&#x2605; Additional Permissoins for Interactive Version:<br>Camera: for flashlight control<br>Microphone: for voice note recording function",
    "histogram": {
        "1": 34,
        "2": 33,
        "3": 89,
        "4": 320,
        "5": 770
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/6S0lhJXK32_eMgf43OUuIGEYY4MpKFE7FhMmdl2UATYvB_ljdMlegnsYLN1C6EAFLQ=h310",
        "//lh3.googleusercontent.com/SYK8GWs1f8jhcIw5vcauT1os2aZw3nKw8K48bRdzGT6xS1zR9w2FCjNuiQRHTsxIWBo=h310",
        "//lh3.googleusercontent.com/iOlN9GdzymvRehSaSYuxPPoqD7vrvWq9zh8bdCWuT9Dnkwx-5UvfLIkclqM7pgQuuQ=h310",
        "//lh3.googleusercontent.com/ZDeJpbG3SZpLIxBK7vEx31cRVd_jwC87AnrbC61szJmS6b1hrDykKtCg_l1bpE1teGo=h310",
        "//lh3.googleusercontent.com/CsEqxeKmDEDYtfNgxIBhQAY4I1LItV3S94g1Gagh9yj9bzb-vPSNa91xrkVyKoetUHr4=h310",
        "//lh3.googleusercontent.com/5OPCBgtu8YH9Tu3I4iTpgDliando-GYGw9rGKrCgzUzLQYmMIoifULK3j3AVbkPUNspQ=h310",
        "//lh3.googleusercontent.com/PbVJ9A_CH1sVca-r4vPNRBW1-ksM7E3HwrHvD5Tn4_iXmSkY_zKzwD9R8Hb6FgdBlEQ=h310",
        "//lh3.googleusercontent.com/wF8R1k5uHvtfRZiq52kBwV3jzB7PUIY8FtG_jQ6xPg5ycDVKTPBzCesiqTdchh33UHY=h310",
        "//lh3.googleusercontent.com/KcaQAE2rjTo_JPQpCNJITw1sXhGAO5otSXQ29IzA5TJTVLDlBPolOTqjLAKW2JXdBA=h310"
    ],
    "comments": [
        "Great Looking but it won't install on my Fossil Q Founder  Updated since first install I have more knowledge of my Fossil and now find this app really amazing, it looks great and performs very well! I am really enjoying it. 😁",
        "Looks amazing on my Huawei watch and is fun to customize!  Edit: I have the same watch but a new phone. Custom tags worked when I  had the LG phone  but aren't working with my Samsung S8. Would that make a difference?  Edit2: I didn't see the big blue checkmark to set my changes.  It's all good now!!",
        "Love the face but wont stop asking for permissions and it wont let you set them .. such a shame pls fix. Lg g watch r & edge 7  wear 2.0 i think UPDATE: for anyone having the same issue i had whereby the watch locked on the permissions screen... uninstall from both watch and phone then reinstall and it works second time round :)",
        "I keep going back to this face set up the interactives and it's all good.",
        "Great watch.  Great customization.",
        "Its a nice watch face. Only thing that annoys me a little, is the date format doesn't seem to be changeable, or if it is, it's hidden in a horribly busy config app"
    ],
    "recentChanges": [
        "Android Wear Compatibility update"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.stmp.flipclock&hl=en&gl=us",
    "appId": "com.stmp.flipclock"
}