{
    "title": "Round Planets Digital Face",
    "summary": "Planet has been spotted swirling around its surface makes this face futuristic",
    "icon": "//lh4.ggpht.com/bhreG-WnzI3_gD3i5G1QKWEz29lv98dGYL_nHacFZPZ5MjrF96MNmJ0mBbseBcHFCnSp=w300",
    "price": "$1.03",
    "free": false,
    "minInstalls": 10,
    "maxInstalls": 50,
    "score": 2.7,
    "reviews": 3,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "April 7, 2015",
    "version": "1.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Designed with the magic of the universe. Beautiful rotating planet highlight the model’s Artistic design Style. With built-in features like ambient mode, and battery status.Frillroid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable. Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Designed with the magic of the universe. Beautiful rotating planet highlight the model&#x2019;s Artistic design Style. With built-in features like ambient mode, and battery status.<br><br>Frillroid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable. <br><br><b>Key custom features:-</b><br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><b>How it works?</b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 0,
        "4": 0,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/paOr2T-Z-PSWO36VEGN1Ht38CmuKWKd0F8w1wQYN0XIsZyYgC9OpciNpkEHgpWQG1ps=h310",
        "//lh3.googleusercontent.com/eS8d3XFetyL5SEK2JqcLa0Ai7BDw3U5D_NvwXNzrmPfBmTKbVCEbzUa88OF38r9gdg=h310",
        "//lh3.googleusercontent.com/DJx9Nlq9Iy1ZrqjreFivIHuptiPEQOuhuCnpCFo071d747vIU_Leo0TFjGDDAoKln3Gs=h310"
    ],
    "comments": [
        "Never appeared I've tried and purchased many watchfaces without issues at all but this one just refuses to appear on the Android Wear app no matter what I try.",
        "didn't install on watch 😢 ..was really wanting planets with day of week too"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.round.planets.digital.face.D10&hl=en&gl=us",
    "appId": "com.frillroid.round.planets.digital.face.D10"
}