{
    "title": "Absolute 3D Watch Face",
    "summary": "Absolute 3D Watch Face might make you forget it&#39;s digital.",
    "icon": "//lh3.ggpht.com/nauWTRxoJEdxBO6zjVJA3JzLo7dvcRz7Hupo7X8UoIaH_0LYR2l3FcDmcqdkNmmhTw=w300",
    "price": "$1.00",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.5,
    "reviews": 13,
    "developer": "Orbit Watches",
    "developerId": "Orbit+Watches",
    "developerEmail": "orbitwatchfaces@gmail.com",
    "developerAddress": "1909 Tindaro Dr.\nApopka, FL. 32703",
    "updated": "February 15, 2015",
    "version": "1.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Absolute 3D Watch Face will accentuate your smart watch with its beautiful design and luxurious style. The metallic texturing and light sheen were produced to give your modern Android Wear the classic look of a high end time piece.  The lively light and shadow also make the watch face react more realistically to the movement of your arm. With this watch we included a date window, so you are not only getting the time at a glance, but also the date.  Upgrade your digital timepiece today and explore a new dimension of time.",
    "descriptionHTML": "Absolute 3D Watch Face will accentuate your smart watch with its beautiful design and luxurious style. <br><br>The metallic texturing and light sheen were produced to give your modern Android Wear the classic look of a high end time piece.  <br><br>The lively light and shadow also make the watch face react more realistically to the movement of your arm. With this watch we included a date window, so you are not only getting the time at a glance, but also the date.  <br><br>Upgrade your digital timepiece today and explore a new dimension of time.",
    "histogram": {
        "1": 1,
        "2": 4,
        "3": 1,
        "4": 2,
        "5": 5
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/Oiv3mp0gXwz3bUjl7bF1vfsPC8dgVbOLUq5cVeg6YoUt651WUrs_t5UysnzaRDkD1b0=h310",
        "//lh5.ggpht.com/kTOTGxBJfW5v27j4GQIZwTKwubkIudsanQY-ivGCvZGSLSHVofHf7EMkwD7MsXYKm39s=h310",
        "//lh3.ggpht.com/N1_DVieAGllmZZLfTAhd8JIzQAoTrZQnyHwCCB5_EqIU0VQkEEZ2urJYTBFwpR26kuU=h310",
        "//lh3.ggpht.com/InU2XpLwGChLUkYl4p9SpqALOrY3zFLUE3bDIe-2IDy3nvHCN2PbzZGWPZdDhukgTaw=h310",
        "//lh3.ggpht.com/l9obNKZhJcTt_93ki9mUGuHBLqJlmQ98FQFUo8zhFiAPTEITJ7xQkC04dINgPBQt5A=h310"
    ],
    "video": "https://www.youtube.com/embed/_3YdhN4DDWA",
    "comments": [
        "Not good for battery life Nice looking but drained my battery super fast. Had to switch back to my previous watch face.",
        "loved it",
        "This is the one. The screen off version of this watch face is just perfect. Super clean but still cute.",
        "Was not full circle moto 360 It would not fill the full circle of my moto 360 v2 watch, was very nice and would heep it if it would, looked oblong in shape, installed and reinstalled three times always the same"
    ],
    "recentChanges": [
        "• Fixed bug where the hands would occasionally remain white when coming out of ambient mode."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.orbitwatches.absolute&hl=en&gl=us",
    "appId": "com.orbitwatches.absolute"
}