{
    "title": "Runkeeper - GPS Track Run Walk",
    "summary": "Track, measure, and improve your fitness.",
    "icon": "//lh3.googleusercontent.com/7q8KiZP649giyVOkcPpZMc0btkybaS0jbuSsHxbYJyE5PFxQvs-DfbF50EK5BxOyBXo=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.5,
    "reviews": 488478,
    "developer": "ASICS Digital, Inc.",
    "developerId": "ASICS+Digital,+Inc.",
    "developerEmail": "support@runkeeper.com",
    "developerWebsite": "http://runkeeper.com",
    "developerAddress": "ATTN: CFO or CEO\nOne Winthrop Square, Floor 5\nBoston, MA 02110",
    "updated": "February 14, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Everyone. Every run. Join the community that helps people get out the door and stick with running forever! Track exercise, set goals, sweat, and see progress along the way. Whether you’re working your way up to tracking a 5K goal or deep into marathon training, use the GPS app trusted by 50 million users and counting.OVERVIEW• Track Workouts - Go for a run, walk, jog, bike, or any activity really. With GPS, you’ll get a clear view of your training in real time.• Set Goals - Have a race, weight, or pace in mind? We can coach you to get there. • Follow a Plan - We have personalized routines to fit into your busy schedule. And helpful reminders, just in case.• Stay Motivated - Join challenges, snag exercise rewards, and share achievements with your friends.• See Progress - This whole running thing works. You’ll see the sweat and we’ll show you the numbers to prove it!TOP FEATURES• Running Groups - Create a custom challenge, invite friends, track each other’s progress, and use the chat to cheer each other on. • Audio Cues - A motivating voice that you can customize to relay your pace, distance, and time.• Training Plans - Make major progress by following a plan. We’ll be here for you every step of the way.• Routes - Save, discover, and build new routes with GPS.• Challenges - Stay motivated with exclusive workout experiences and rewards.• Partner Apps - Keep moving with the music you love with our Spotify integration. Connect with other top health apps like Fitbit, MyFitnessPal, and more.• Bluetooth Connectivity - Wireless headphones and heart rate monitors make great workout companions. Also, sync Android Wear, Pebble, and Garmin watches in seconds.• Stopwatch Mode - Easily add indoor cardio (treadmill, cycling) and gym workouts to keep full exercise log all in one place.• Social Sharing - Upload your activities and more with your friends on Facebook and Twitter.RUNKEEPER GO (Premium)• Prescribed Workouts - Get a weekly workout schedule tailored to you.• Progress Insights - See how your runs stack up to each other and get a full view of your fitness journey.• Live Tracking - Whether it’s training day or race day, share your location with family and friends.",
    "descriptionHTML": "Everyone. Every run. Join the community that helps people get out the door and stick with running forever! Track exercise, set goals, sweat, and see progress along the way. Whether you&#x2019;re working your way up to tracking a 5K goal or deep into marathon training, use the GPS app trusted by 50 million users and counting.<br><br>OVERVIEW<br>&#x2022; Track Workouts - Go for a run, walk, jog, bike, or any activity really. With GPS, you&#x2019;ll get a clear view of your training in real time.<br>&#x2022; Set Goals - Have a race, weight, or pace in mind? We can coach you to get there. <br>&#x2022; Follow a Plan - We have personalized routines to fit into your busy schedule. And helpful reminders, just in case.<br>&#x2022; Stay Motivated - Join challenges, snag exercise rewards, and share achievements with your friends.<br>&#x2022; See Progress - This whole running thing works. You&#x2019;ll see the sweat and we&#x2019;ll show you the numbers to prove it!<br><br>TOP FEATURES<br>&#x2022; Running Groups - Create a custom challenge, invite friends, track each other&#x2019;s progress, and use the chat to cheer each other on. <br>&#x2022; Audio Cues - A motivating voice that you can customize to relay your pace, distance, and time.<br>&#x2022; Training Plans - Make major progress by following a plan. We&#x2019;ll be here for you every step of the way.<br>&#x2022; Routes - Save, discover, and build new routes with GPS.<br>&#x2022; Challenges - Stay motivated with exclusive workout experiences and rewards.<br>&#x2022; Partner Apps - Keep moving with the music you love with our Spotify integration. Connect with other top health apps like Fitbit, MyFitnessPal, and more.<br>&#x2022; Bluetooth Connectivity - Wireless headphones and heart rate monitors make great workout companions. Also, sync Android Wear, Pebble, and Garmin watches in seconds.<br>&#x2022; Stopwatch Mode - Easily add indoor cardio (treadmill, cycling) and gym workouts to keep full exercise log all in one place.<br>&#x2022; Social Sharing - Upload your activities and more with your friends on Facebook and Twitter.<br><br>RUNKEEPER GO (Premium)<br>&#x2022; Prescribed Workouts - Get a weekly workout schedule tailored to you.<br>&#x2022; Progress Insights - See how your runs stack up to each other and get a full view of your fitness journey.<br>&#x2022; Live Tracking - Whether it&#x2019;s training day or race day, share your location with family and friends.",
    "histogram": {
        "1": 16725,
        "2": 11393,
        "3": 23635,
        "4": 116461,
        "5": 320264
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FnrH5LftzVWypuW2WiolELxiZ8l9M0MBumZMyiWJg36CkCBUpdOsLQj7HlP5SDUPyo4=h310",
        "//lh3.googleusercontent.com/4O-HFT0yEWvUJACB3iZwXl6taNx1Q6nV-tk5AhFFXrOjgEMsvhEm9K1L_gbdMjUiby8=h310",
        "//lh3.googleusercontent.com/uK1K40NoZYU5k7nalqpZTYYKVJ4SlzZ9cUCY18cp8HvhgQT1Xk52xrjsQT0YpEnCog=h310",
        "//lh3.googleusercontent.com/4Fzk5sAQ4OReF51coXJNp_K2QRDr8g2DJl81r-vXVa_cP0XN6UwMeE5HhrioXGumJ88=h310",
        "//lh3.googleusercontent.com/brAi43rYXUBmYtlce9A2xWqLlOC2bk_GMScY100JFJYSy3uUH4pk24uJ3ygoDBvq9to=h310",
        "//lh3.googleusercontent.com/thwJXTeMGko2VxlBEZeQVk9c8GcQJhJ2pKzwt4rDOCZ1jV6SQkRKBvnx36aSeBa-KsE=h310",
        "//lh3.googleusercontent.com/JXuE2rlZa-8pDD1gwX6RNeG73hTtdu7o-KxTlICSydhMDexiXMTh97_9M6jhq2kQzabt=h310",
        "//lh3.googleusercontent.com/UJhAy-MscLbIj1KGVvazRYED2miXVg48_AGw6E8OjHo2Vnfp3F3WKevNiyxdjlML0kyf=h310",
        "//lh3.googleusercontent.com/3ItKXNBlSWbC7Vy4_sWB_WQAXAIJJ5x1eWqwq7ZnGVrXhH6BADGQv68MqfdQ-PIIlbo=h310",
        "//lh3.googleusercontent.com/bCNrGVIsN1lFkL5dbG6DzkXdoaim_sBnoqH_5nEvV1JabLxZ9d6v5hlpZogJa-wW_M8=h310",
        "//lh3.googleusercontent.com/H6OqfdkceEOOIgmK-g09mFLlCfInBInSnzCtdgayIY8u0b-5ZF1B3wx9Eo2zPYSEbO4=h310"
    ],
    "comments": [
        "Paid for yearly subscription but DOES not reflect that on the app. It still keeps asking me to pay. Uninstall and installed without much success. Very frustrating. What better way to flatten your resolution to start running?  ***********  It took them a few days to get back to me but once connected, they were quick in restoring the subscription. I love the fact that I got some of the workout history back from the trial before. So far, very happy.",
        "I love how this app helps to keep you accountable and motivated to get out! The only problem I have seen is that if I pause a run and re-start, sometimes the timer keeps going but it won't track distance traveled. Even with this issue occasionally, it is the best running app I have used!",
        "It's a well rounded app. I've been using it since 2012, so I've got a fair amount of experience with it. The app has great features like audio pass through when listening to music, and updates on your pace and distance. Some downsides include that if you forget to hit stop, your data for the run is essentially null and void, you have to way to adjust your time after a run. A cool rectification for this would for it to auto stop after a certain distance. Another downside isn't really the apps fault, but phone location tracking isn't always 100% accurate, so a measured 5km run, may only work out to be about 4.8km after you use your GPS.",
        "Very good app. I have been using it now for over 5 years and only have problems when trying to pair with a polar heart rate monitor. It's accurate, easy to use, and it has helped motivate me to Run. I upgraded to the Pro version so I can track progress.",
        "I have used this app for years and loved it but after the recent update the GPS tracking is so bad it's not worth using.  Lots of people are complaining about this issue but as yet no resolution.  This morning my run was inacurrate by more than 2k! I am successfully using other GPS apps on my phone and they're fine so this is definately a Runkeeper issue - Please sort it or roll-back the app to a version which works!",
        "Very poor GPS tracking. Lovely informative graphs, but no use if they only capture part of your data. This morning I set out to try for my longest run but got no GPS for the entire 15km run. It was out in the open and I had GPS on other apps, but not Runkeeper. Very frustrating Needs fixing."
    ],
    "recentChanges": [
        "Introducing a brand new Android Wear 2.0 experience! Leave your phone at home. You can now track a run with a GPS-enabled watch alone.",
        "All stats tracked with your watch will sync with the app on your phone. That means you’ll be able to see mapped routes after you save."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.fitnesskeeper.runkeeper.pro&hl=en&gl=us",
    "appId": "com.fitnesskeeper.runkeeper.pro"
}