{
    "title": "Watchface Editor",
    "summary": "The most advanced watchface editor for Android Wear smartwatches.",
    "icon": "//lh3.googleusercontent.com/pH4HK771Wn1muQTd19pVgM4fIMLBeUVjzd87xS7TMLsmgLpimbu9vYgVyKUjTope9uA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 2.7,
    "reviews": 27,
    "developer": "Blukz",
    "developerId": "Blukz",
    "developerEmail": "watchfaceeditor@gmail.com",
    "developerWebsite": "http://www.watchfaceeditor.com/",
    "developerAddress": "115 Conistone Way,\nN7 9DE\nLondon\nUnited Kingdom",
    "updated": "December 4, 2015",
    "version": "0.0.11",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "The most advanced watchface creation platform for Android Wear. Be creative, design your own watchfaces and customize them for free. To create the best watchfaces with our web based watchface generator and share them with your friends, visit http://www.watchfaceeditor.com. Use Watchface Editor app to browse through a big selection of watchfaces and install them on your smartwatch! Download now!Use our mobile app to preview watchfaces and install them on your smartwatch. We offer a few watchfaces that you can inspect and see how our app works, but its up to you to use the tools we offer to build the largest collection of watchfaces the world has ever seen. Feel free to share your work and spread the word. Take full advantage of our platform by creating your own user account on our website. Your saved watchfaces will then always be accessible on your mobile device if you visit the \"My workshop\" screen in our Watchface Editor app. No more trying to create your masterpiece on a small touchscreen. On our website you are able to create watchfaces comfortably on a big screen, with your mouse and keyboard. What you see is what you get. Test your work on Watchface Editor website and our system will make sure your watchface looks the same on your smartwatch. Use a familiar tag based system to animate elements of your watchface. Don't try to learn weird three letter named programming languages to create a complex watchface. We support scripting with an easy to learn javascript scripting language.Featuring: Custom fonts, simple image importing, advanced layering functions, straightforward javascript scripting, optimized for low battery drain and high performance. Want to be sure your watchface uses as little battery as possible? Customize the frame rate when you are creating your watchface on our website. Test our watchface engine on your smartwatch and see just how well it performs, even when you add a ton of elements. If you can create a watchface that makes our engine sweat, share it with us and we will try our best to optimize our engine even further.Tags: Our watchface engine supports a large collection of tags for displaying location, weather, phone status and off course time, with many more coming soon.Watchface Editor platform is designed by a dedicated team of developers. We are constantly adding new features and optimizing our watchface engine, so be sure to follow our progress.",
    "descriptionHTML": "The most advanced watchface creation platform for Android Wear. Be creative, design your own watchfaces and customize them for free. To create the best watchfaces with our web based watchface generator and share them with your friends, visit http://www.watchfaceeditor.com. Use Watchface Editor app to browse through a big selection of watchfaces and install them on your smartwatch! Download now!<br><br>Use our mobile app to preview watchfaces and install them on your smartwatch. We offer a few watchfaces that you can inspect and see how our app works, but its up to you to use the tools we offer to build the largest collection of watchfaces the world has ever seen. Feel free to share your work and spread the word. Take full advantage of our platform by creating your own user account on our website. Your saved watchfaces will then always be accessible on your mobile device if you visit the &quot;My workshop&quot; screen in our Watchface Editor app. <br><br>No more trying to create your masterpiece on a small touchscreen. On our website you are able to create watchfaces comfortably on a big screen, with your mouse and keyboard. What you see is what you get. Test your work on Watchface Editor website and our system will make sure your watchface looks the same on your smartwatch. Use a familiar tag based system to animate elements of your watchface. Don&apos;t try to learn weird three letter named programming languages to create a complex watchface. We support scripting with an easy to learn javascript scripting language.<br><br>Featuring: Custom fonts, simple image importing, advanced layering functions, straightforward javascript scripting, optimized for low battery drain and high performance. Want to be sure your watchface uses as little battery as possible? Customize the frame rate when you are creating your watchface on our website. Test our watchface engine on your smartwatch and see just how well it performs, even when you add a ton of elements. If you can create a watchface that makes our engine sweat, share it with us and we will try our best to optimize our engine even further.<br><br>Tags: Our watchface engine supports a large collection of tags for displaying location, weather, phone status and off course time, with many more coming soon.<br><br>Watchface Editor platform is designed by a dedicated team of developers. We are constantly adding new features and optimizing our watchface engine, so be sure to follow our progress.",
    "histogram": {
        "1": 13,
        "2": 2,
        "3": 1,
        "4": 1,
        "5": 10
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/bQKwJH4jzz1aJA_iMAQ00yeHilQYfSRhhY1AB08y80plQEmcFUWBqFdYUOyujSE7Ew=h310",
        "//lh3.googleusercontent.com/NvAcE7PlsgVF76uIiGLJUPVibVKqflDglaqu6XimPQBwv-ZNckYkyFtjzA93_LSDTA=h310",
        "//lh3.googleusercontent.com/HYU5qrtSNb3Sb8_nyN6bYMYIC5TlQP1TFNZvznKmh8_btxdLfr2buuxt8MzmSUl1gnw=h310",
        "//lh3.googleusercontent.com/lZoYUncj94hEcmDsB5Rj8qZuZrTxktgz5JdEhgMTQsx6tsKOFnZcc3G0eF7W8WhX5AFl=h310",
        "//lh3.googleusercontent.com/_4ev2Vg5oFUEgUThuoFFnItms08anhCU3mDhx6aYtA_5Apyq7LFz32szgSuiGxsoBw0=h310",
        "//lh3.googleusercontent.com/8TKf4yn1vHe6NLd91Jpc14Lxcuth7lP336RIlLF2A16Uh9i9dM7Oyk7zCr5Aqf4_Jpw=h310",
        "//lh3.googleusercontent.com/otecEq9i4vIG2KGkSHV37s8tq3GpYUkoAzognd85fhIWuKL5lHEu1n9jmllT3BnvsQ=h310",
        "//lh3.googleusercontent.com/wf1zrm2Uaj_bcC_BO9otyPcI_y2RiWZoU0R3fo73TAoT4ox2Ge71hOHsKErORTIVFw=h310"
    ],
    "comments": [
        "Junk. Login failed, registration failed. 1000+ downloads?? I'm calling \"bullshit!\"",
        "No longer available.  This app is 2 years old and needs to be removed by Google.",
        "dead. don't bother. servers are gone. developer's website for sale.",
        "Just ok 2stars"
    ],
    "recentChanges": [
        "Added About section, 3 selectable loading screens, caching settings and bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.blukz.wear.watchfacegenerator&hl=en&gl=us",
    "appId": "com.blukz.wear.watchfacegenerator"
}