{
    "title": "Raw Vegan Blonde Watch Face",
    "summary": "Add a little zest to your wrist piece with AMBA’s fresh arrangements.",
    "icon": "//lh4.ggpht.com/xXBmA0si55s_81pybuH_cx4eWaVoC7QHHz7r6FNyG2EeBEATU57JXh4b2f14-6M48oBH=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4,
    "reviews": 360,
    "developer": "AMBA Living",
    "developerId": "AMBA+Living",
    "developerEmail": "info@ambaliving.com",
    "developerWebsite": "http://www.ambaliving.com",
    "updated": "August 10, 2016",
    "version": "1.0.8",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Stylize your watch face with Amber Locke’s carefully crafted ‘veg art’ themed designs – inspired by the beauty of natural foods. With an elegant pattern for every day of the week and a fruitful feature that switches the face into an ambient state, this watch face is ripe and ready for your Android Wear.",
    "descriptionHTML": "Stylize your watch face with Amber Locke&#x2019;s carefully crafted &#x2018;veg art&#x2019; themed designs &#x2013; inspired by the beauty of natural foods. With an elegant pattern for every day of the week and a fruitful feature that switches the face into an ambient state, this watch face is ripe and ready for your Android Wear.",
    "histogram": {
        "1": 36,
        "2": 18,
        "3": 39,
        "4": 68,
        "5": 199
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4W and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/BfE39hjLgyjl1qp_-r0h8jMgf8KpmgwZJf31mMl1t75utVRB4vaUb5sS0r-A91qMypv0=h310",
        "//lh5.ggpht.com/_QlYe5u7QyOeiy248gcaHn7klAFRNQiZlvpehaPokxmIQV3AWYLY7_oCxHn358kY0sI=h310"
    ],
    "comments": [
        "Gorgeous watch face Love this!!!",
        "Very Nice",
        "You Don't Need to be a Vegan to Enjoy These Watchfaces! Beautiful, colorful and fun watchfaces that even a carnivore could love. Seven (7) watchfaces are bundled in; one for each day of the week. You can manually choose which watchface you want or let it automatically change each day of the week. Excellent!",
        "Cute! I love it!! I love that the photo changes automatically or I can set it to display a particular picture. Looks great on my Asus watch. Only one issue, the \"A\" in April isn't fully displaying when the screen is active. Other than that this app is flawless.",
        "Pretty and elegant I love this design!  It's very feminine and elegant.  Even the ambient face is pretty- I wouldn't mind having the ambient face as a stand alone face.  One of the best for girly designs.",
        "I really want to rate this five stars but since I updated my moto 360 to the latest OS the text and circles look out of alignment with the image?  edit;- emailed developer several times. not heard anything back within months. no bug fix. no stars. thanks."
    ],
    "recentChanges": [
        "- Bug fix implemented."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.amba.watchface&hl=en&gl=us",
    "appId": "com.amba.watchface"
}