{
    "title": "My Photo Watch Face",
    "summary": "Place any photo you choose as the background of your Android Wear watch face",
    "icon": "//lh3.googleusercontent.com/SpNXCCDSnoNc9t0hKRj0FYDWcc1k2H8boUYpHDOk7dZWAb26snuMGvZDuktpA9hB_8xC=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.3,
    "reviews": 11,
    "developer": "Raxilwear",
    "developerId": "Raxilwear",
    "developerEmail": "support@raxilwear.com",
    "developerAddress": "353 Preston St\nOttawa, ON Canada\nK1S 1V6",
    "updated": "March 31, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Raxilwear's My Photo app enables you easily set any photo you select as the background of your Android Wear watch face so you can gaze upon beautiful vistas or your loved ones every time you check the time. Just install and customize – select an image, select the appearance, and you're good to go!Features:- Very simple and easy to use!- Select any image from your device, or choose from any of our provided photos!- All photos are automatically resized to fit the Android Wear device- Optionally, crop it in-app (including the ability to crop square or rectangle)- Set the appearanceNote: Configuration of watch face must be done through the Android Wear app",
    "descriptionHTML": "Raxilwear&apos;s My Photo app enables you easily set any photo you select as the background of your Android Wear watch face so you can gaze upon beautiful vistas or your loved ones every time you check the time. Just install and customize &#x2013; select an image, select the appearance, and you&apos;re good to go!<br><br>Features:<br>- Very simple and easy to use!<br>- Select any image from your device, or choose from any of our provided photos!<br>- All photos are automatically resized to fit the Android Wear device<br>- Optionally, crop it in-app (including the ability to crop square or rectangle)<br>- Set the appearance<br><br>Note: Configuration of watch face must be done through the Android Wear app",
    "histogram": {
        "1": 3,
        "2": 1,
        "3": 1,
        "4": 2,
        "5": 4
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/i746cu6vfww8FbBNIF3AKLi-0tPfxi_KQDmz5GVSPUpg-j5OFwADYwvbMFoOsPeeiLk=h310",
        "//lh3.googleusercontent.com/h50PpLzPv2cFtQr2gqA8_eAuyvB7Hk6AyrTqUYnFAyUzwD5h3vLWCPYuEgAgWjOBPu2q=h310",
        "//lh3.googleusercontent.com/ocUpCeBQlCL1tErrdC5BOWwE_ZUjQsUXPSlugzE3x2TznLrBWQhFo5AW34AgRGEyKMcO=h310"
    ],
    "comments": [
        "Can't find it Can't even find it on my phone so I can use it. Where is it?? Does not work or show up on my phone. Give me back my dollar!!",
        "It works well Excellent app!  I'd really like day and date options, to make these faces more watch like. I'd love a slideshow capability. Also, fix bug - app doesn't handle extra wide photos properly.  Then 5  stars.",
        "Nice App, Could be Better I like this app to personalize my watch with my pics, but I would like to see two options added: 1) Please give me the option for a digital face, or at least some extra info during ambient like bat power and date. 2) I would have loved it if I could pick a few pics at a time and the watch will periodically switch the pics automatically. However, for a dollar, I recommend it.",
        "Love it I wish I had more options for the actual watch function, but the upside of getting to make my watch face any pic I want is worth it.",
        "Great does the job Would like to see digital added though",
        "Fantastic This is a great app!"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.raxilwear.custimg.myphoto&hl=en&gl=us",
    "appId": "com.raxilwear.custimg.myphoto"
}