{
    "title": "Secret Agent Watchface",
    "summary": "Add some class and danger to your Android Wear device!",
    "icon": "//lh3.ggpht.com/IKCmHN7F-llaob_IkBJ_fhnpGnJt89uCHmPoWFdp7jkm1yaarHPDjvqGAt0dujVX7Hk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 1572,
    "developer": "rmuk apps",
    "developerId": "rmuk+apps",
    "developerEmail": "rmukapps@gmail.com",
    "developerWebsite": "https://plus.google.com/communities/117958469539983695064",
    "updated": "January 23, 2015",
    "version": "1.4.5",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "This is a watchface for Android Wear devices.NOTE: The settings menu is no longer in your app drawer, you access the settings from inside the android wear app on your phone.For those updating to the new official API version, please make sure that you have re-synced the watchface.  After you update the app on your phone, it can take some time before your watch gets the update sent to it.Features:- Updated to support the official Watchface API!- Digital and Analog time readouts- The left bar represents your phone's remaining battery and the right bar is the watches battery. Each large chunk represents 16% and each little chunk is 10%- The mission status reflects how many events left you have in your calendar for the current day.  (If you have one or more left it will say \"incomplete.\")- Burn in protection for POLED screens (activates automatically)- Options    - Show the digital clock instead of the analog one in \"dim\" mode    - Increase the size of the date/time readouts    - Analog watch hand snapping (should the hour hands always point to the current hour or float between the current and next one)    - Disable the greyscale dim mode and allow for full color.- Beta Options!  (NOTE: These are experimental and may not be fully functional yet)    - Sound effects!  Choose a sound effect and it will play from your phone whenever you raise the watch up.You may need to re-sync your wear apps before it'll show.",
    "descriptionHTML": "This is a watchface for Android Wear devices.<br><br>NOTE: The settings menu is no longer in your app drawer, you access the settings from inside the android wear app on your phone.<br><br>For those updating to the new official API version, please make sure that you have re-synced the watchface.  After you update the app on your phone, it can take some time before your watch gets the update sent to it.<br><br>Features:<br>- Updated to support the official Watchface API!<br>- Digital and Analog time readouts<br>- The left bar represents your phone&apos;s remaining battery and the right bar is the watches battery. Each large chunk represents 16% and each little chunk is 10%<br>- The mission status reflects how many events left you have in your calendar for the current day.  (If you have one or more left it will say &quot;incomplete.&quot;)<br>- Burn in protection for POLED screens (activates automatically)<br>- Options<br>    - Show the digital clock instead of the analog one in &quot;dim&quot; mode<br>    - Increase the size of the date/time readouts<br>    - Analog watch hand snapping (should the hour hands always point to the current hour or float between the current and next one)<br>    - Disable the greyscale dim mode and allow for full color.<br>- Beta Options!  (NOTE: These are experimental and may not be fully functional yet)<br>    - Sound effects!  Choose a sound effect and it will play from your phone whenever you raise the watch up.<br><br>You may need to re-sync your wear apps before it&apos;ll show.",
    "histogram": {
        "1": 123,
        "2": 57,
        "3": 157,
        "4": 302,
        "5": 933
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/bj1ZZDBu8Snxzx-mWhdECW0vOn1-7Rd5XALr12usioXVW6twI_wuWpaxbFEZHACajQ=h310",
        "//lh6.ggpht.com/yxWOXYP88DM4_2b6sHg0Mf6v4DS0vLPTmyG5QjHQ8ZT1qtxisfqNbeSezgrjxOUp7Kw=h310",
        "//lh4.ggpht.com/MZlZHzyCxxSbp03hY1B8dbnA87VJwuRAkJSQMcWadsyoxGelGF8ZGA-KajMETqsFwTU=h310",
        "//lh5.ggpht.com/DYMLKmcID1pdrZEDMiW_UraElMoWz1-rvO87_6FxKz7UlEYcfONzyQ9uqBrctKb8RSk=h310",
        "//lh4.ggpht.com/n1I8FCxwZVF-qF4P0GqkvaHjyQa65eJTKni2Zrzkoxe-ZtOUOVAeKspQBpWx36NDaOU=h310",
        "//lh3.googleusercontent.com/fold_rEfzHyyWupAvBnXguame_VhiyUnFKbX_Q3LxCt06cvmRmWg2kD1fOzvY-pkFQ=h310",
        "//lh3.googleusercontent.com/wdrdqL5lKipnZsSLJImu_mIzYcEUUPPPqo3mzKP6QE-qL51Kq5ojcDncV_2W2PbLpkA=h310"
    ],
    "comments": [
        "Love it! This face has tons of nostalgic appeal plus it just looks great and actually provides useful functionality with the battery indicators. I would love to see more functionality added, a nicer transition into ambient mode and more ambient options. It also really works well with the moto 360 flat tyre as this can ruin most faces really.",
        "Love every second of it! Only one small problem I love this watch face a lot! It brings back so many memories, but the only thing is that I cannot get any sound effect to come through on my phone. I would love it of I could play a small sample of the in-menu music to GoldenEye when I raise my watch up but no matter how short I make it no sound ever comes through, BUT I understand that's still I'm beta so no stars subtracted. Great work!",
        "Nostalgia! When I glanced at the picture I realize that it was actually from Goldeneye on the Nintendo 64. Reminded me of hours upon hours of skipping class and playing 4 player with my suite mates. This watch face is awesome. Personalization is super easy and the \"health\" and \"body armor\" gauges show battery life of phone AND watch. Insane.  I will likely keep it on this for a looooong time. Thanks!!!",
        "A fantastic watch face. It's almost exactly like GoldenEye n64's version. Makes me smile every time I see this. I'm hoping the dev makes a more complex, contemporary or updated HD design watch face for this, then again I can't see how he can improve it! Best watch face so far.",
        "Love the face. But i do agree. I would pay for the ability to see weather and other things by scrolling L or R. And if there was a mission timer the said: complete or incomplete. Synced to you calender. Also i miss the flicker/flash... but so far this makes me super happy",
        "Good idea, but needs support for phone only as well This seems like a golden idea, but I happen to not have a watch. Could it be possible to have a seperate option for phones only? Say, the armor bar would show the second half of the remaining battery and vice versa. Thanks!"
    ],
    "recentChanges": [
        "- Switched to all-caps for text based sections",
        "- Added option for a smooth second-hand.",
        "- Updated screen re-draw rates to improve battery life (15fps with smooth second hand, 1fps without it, and 1fpm while dimmed)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.rmukapps.secretagent&hl=en&gl=us",
    "appId": "com.rmukapps.secretagent"
}