{
    "title": "Pip-Boy 3000 Watch Face",
    "summary": "Transform your Android Wear device into a Pip-Boy 3000!",
    "icon": "//lh3.googleusercontent.com/EuH4a8oW0ecn-c2_L3o4SkpZLhFwYCPHoWR0dfG_xtl_vNQ5iznT_Vn4cLGhoUw7tEi5=w300",
    "price": "$1.50",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.7,
    "reviews": 45,
    "developer": "kopirat",
    "developerId": "kopirat",
    "developerEmail": "regan.flow@gmail.com",
    "developerWebsite": "http://russellsoftworks.com/",
    "developerAddress": "7904 E Chaparral Rd\nSuite A110-199",
    "updated": "May 6, 2015",
    "version": "1.6",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Highly customizable fan-made Pip-Boy 3000 watch face for Android Wear. Designed to give your Android Wear device the unmistakable look and feel of a Pip-Boy 3000 without sacrificing good looks or style. Includes tons of customization options to let you tweak and tune your watch just to your liking, with settings like Analog/Digital faces, toggleable AM/PM indicator and date display, color schemes and much more, with new features being added regularly (and by request). If you're looking for a Pip-Boy watch face for your device that is fully configurable and that you can wear out of the house and still look fashionable with, this is the app for you.Note: Fallout, Fallout 3, Pip-Boy 3000 are all registered trademarks owned by ZeniMax. The author of this application is in no way affiliated with ZeniMax or Bethesda Softworks. This is a fan made application.",
    "descriptionHTML": "Highly customizable fan-made Pip-Boy 3000 watch face for Android Wear. Designed to give your Android Wear device the unmistakable look and feel of a Pip-Boy 3000 without sacrificing good looks or style. Includes tons of customization options to let you tweak and tune your watch just to your liking, with settings like Analog/Digital faces, toggleable AM/PM indicator and date display, color schemes and much more, with new features being added regularly (and by request). If you&apos;re looking for a Pip-Boy watch face for your device that is fully configurable and that you can wear out of the house and still look fashionable with, this is the app for you.<br><br>Note: Fallout, Fallout 3, Pip-Boy 3000 are all registered trademarks owned by ZeniMax. The author of this application is in no way affiliated with ZeniMax or Bethesda Softworks. This is a fan made application.",
    "histogram": {
        "1": 7,
        "2": 2,
        "3": 5,
        "4": 14,
        "5": 17
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/c_99k18qj6t1uSA26UEOke1SONbibwYaC8HgvEZ_zfh7gEmivYYlEhTF6k91tIW8fOU=h310",
        "//lh3.googleusercontent.com/BX-PBXalb5_nnmaeGWk4WMPco8LKEnw5papOMs_QBlAee0RQO43Wofhkti5PMXxA2lA=h310"
    ],
    "comments": [
        "Great watch face I love this face. The green looks fantastic with the black edge of my g watch r. The only thing missing is a battery percentage indicator. As it is, I can swipe down to view the battery, but it would be nice to just have it on the watch face. This is all that separates it from 5 stars for me",
        "This won't install Update: sorry that by no response i meant that when you emailed me and i wrote back, that had no response. And as for refunding. I tried to reinstall it giving you the benefit of the doubt. This apparently hinders refunds. As the product supplier you should vaguely specify what won't work. The gear watch line of devices are for Androids and wearable. But for 1.83$ you argue.WEEKS LATER  NOOO RESPONSE  NOO REFUND! !  DO NOT BUY   I paid for it, it won't install. And I can't refund it (minutes after buying).",
        "Fantastic! The scanning looks incredible and adds a very nice aesthetic touch on my G Watch. The settings are very nice and faithful to the Fallout games (color options being the same from games, etc.) and the fonts are all correct, making it a truly beautiful watch face well worth the price of any fan of the series.",
        "Perfect on my Moto 360! I love this watchface! Simple yet immersive enough to fit right in with any fallout fans fandom. Maybe think about adding some more customizations for those who want a few more options otherwise this is grade A watchface! :)",
        "A great looking minimalist watch face that draws on the classic aesthetic of Fallout's Pip-Boy that comes in both analog and digital flavors. It's not as busy as some other watch faces that try too hard to emulate the myriad of information the in game provides.",
        "So excited for this, but it's been hours since purchased and it won't show up at all. Can't use or customize. What's going on? Would rate higher if worked.. So excited for this, but it's been hours since purchased and it won't show up at all. Can't use or customize. What's going on?"
    ],
    "recentChanges": [
        "- Added YYYY/MM/DD date formatting by request.",
        "- Fixed 12AM displaying as 0AM in non-24 hour formats."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.russellsoftworks.pip_boy3000watchface&hl=en&gl=us",
    "appId": "com.russellsoftworks.pip_boy3000watchface"
}