{
    "title": "Nova Material Watch Face -Free",
    "summary": "Super Lumi nova material give the dial excellent readability qualities.",
    "icon": "//lh5.ggpht.com/-to2sYicB0wjEBWMSiBH_JV7-m3bhsPBSC2znUw9lUuPVGJz33jhOGgK5RHVbp_c5Uo=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.1,
    "reviews": 1059,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "April 5, 2015",
    "version": "1.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "This watch face was designed to give user all the required information in such a beautiful way that comprehends the beauty of Android Watch. Match Your Android watch with the color of your personality by customizing the watch through Mobile. Features(Pro-Version only) like Ambient mode, weather, sms notifications, email notifications, battery status. Frillroid focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. .Get this app now and provide us your feedback :)",
    "descriptionHTML": "This watch face was designed to give user all the required information in such a beautiful way that comprehends the beauty of Android Watch. Match Your Android watch with the color of your personality by customizing the watch through Mobile. Features(Pro-Version only) like Ambient mode, weather, sms notifications, email notifications, battery status. Frillroid focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br><b>Key custom features:-</b><br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br><b>How it works?</b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. .<br>Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 275,
        "2": 144,
        "3": 163,
        "4": 189,
        "5": 288
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Fhq4-rX2ODQ7TAXiUsa62CYfbw4OkE8GXJezwkWrOomNi7NJtdjO4JlXGOBYoOayv-E=h310",
        "//lh3.googleusercontent.com/JA_KY99Qt8cPCP8jQqx6HIYKNbxaKkE7jjS-ukCfiR7GHbHcFT0vbEOXryyfi64aBlA=h310",
        "//lh3.googleusercontent.com/14nEZTdtWnUDO5MJdtg5aJJjSFaRX_wbNlDCqgpfDFOyl68CgrrQF6drr0s3nPfJSw=h310"
    ],
    "comments": [
        "Nice, but: It's doesn't work as advertised. Doesn't display unread counts for email/sms. In addition, the settings menu fails to open. It will force close the app within seconds after attempting to open settings.",
        "It's  OK and works correctly Unfortunately the customizations listed on the paid verson's Web page do not indicate that it can change to a dark background.  So for my purposes it's just another one in the herd, and I'll  probably just delete it for now and revisit the site in a month or so to see whether a dark background becomes available.",
        "Overall favorite watch face... Would have 5 stars... Favorite watch face it's only downfall is that its supposed to display phone battery along with watch battery, phone battery constantly reads 0%...Any fix for that? Will give 5 stars when fixed",
        "Great watch face with annoying issue. I'm having the same problem with this watch face that a lot of people seem to be having.  Running a Nexus 6 on the latest version of  Android. Every time I try to access the settings, the watch face stops responding so setting can't be changed.",
        "Looks great but keeps crashing on the phone Keeps crashing within the wear app when trying to look at menu options. Plus it does not read the phone's battery. Love to rate much higher",
        "Force closing Force closes when trying to go to settings. Phone battery doesn’t show. If these things don't work on free version I am certainly not paying for it. Designed nicely but doesn't work."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.nova.free.watch.face.D08&hl=en&gl=us",
    "appId": "com.frillroid.nova.free.watch.face.D08"
}