{
    "title": "CLEARFACE watch face",
    "summary": "Probably the best watch face in GP ;)",
    "icon": "//lh3.googleusercontent.com/i0r_6Mg3zE7RIckqxUnOGbbcpcgwcyIZUNeCG8CvA_K6Q0MqK0UKYQK43pLrFs8d0U8=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 4.5,
    "reviews": 26,
    "developer": "RAMZES.design",
    "developerId": "RAMZES.design",
    "developerEmail": "ramzes@ramzes.design",
    "developerWebsite": "http://ramzes.design",
    "developerAddress": "RAMZES.design\nul. Rybnicka 59/18\n02-432 Warszawa",
    "updated": "October 2, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Let’s start the show! You can see, probably the most awesome watch face all over the Google Play. A lot of customisation options will let you start experimenting in terms of colors and screen division.  At the beginning you can choose 1 of 5 very eye-catching settings. If you want more, you can design your own screen. You can change colors of all the painting elements and fonts. If you want to arrange a background, here you are, you can do it. Choose your favorite color, you can also divide your screen, for instance: upside white, underside blue. That you are in charge: your watch, your screen. As you like, as you feel. Do you still want more effects? If yes, you can download your own bitmap. You can also draw inspiration from some of our bitmaps. We will regularly publish (free of charge) our case stories with the examples of made-up bitmaps. You would be able to use them by setting up your own preset, following our example. Show your hands to the public. You have CLEARFACE CLEARFACE setting options:• changing colors of all the painting elements and fonts• setting time of active mode• setting details of ambient mode• changing date format• setting preferred widgets (steps and calories*, weather**)• save / load your presets• uploading your own bitmaps from your phone into background• downloading bitmaps from online, still growing library• choosing weather providers***• setting names of days of the week (you can write down your version of those names, for example shortcuts or names in your language)You really should join to RAMZES.design G+ community and be up to date with our CLEARFACE and other watchfaces. G+ community gives you also additional information concerning our development plans  - CLEARFACE in particular. Don’t hesitate to suggest your own ideas there - We will do our best to put your ideas into action. * The watchface works with Google Fit where all your activity data come from. ** The weather option is a free addition to our watchface that can be changed in the future.***Currently two weather services are available: YR and Openweather.",
    "descriptionHTML": "Let&#x2019;s start the show!<br> <br>You can see, probably the most awesome watch face all over the Google Play.<br> <br>A lot of customisation options will let you start experimenting in terms of colors and screen division. <br> <br>At the beginning you can choose 1 of 5 very eye-catching settings. If you want more, you can design your own screen. You can change colors of all the painting elements and fonts. If you want to arrange a background, here you are, you can do it. Choose your favorite color, you can also divide your screen, for instance: upside white, underside blue. That you are in charge: your watch, your screen. As you like, as you feel.<br> <br>Do you still want more effects? If yes, you can download your own bitmap.<br> <br>You can also draw inspiration from some of our bitmaps. We will regularly publish (free of charge) our case stories with the examples of made-up bitmaps. You would be able to use them by setting up your own preset, following our example.<br> <br>Show your hands to the public. You have CLEARFACE<br> <br>CLEARFACE setting options:<br>&#x2022; changing colors of all the painting elements and fonts<br>&#x2022; setting time of active mode<br>&#x2022; setting details of ambient mode<br>&#x2022; changing date format<br>&#x2022; setting preferred widgets (steps and calories*, weather**)<br>&#x2022; save / load your presets<br>&#x2022; uploading your own bitmaps from your phone into background<br>&#x2022; downloading bitmaps from online, still growing library<br>&#x2022; choosing weather providers***<br>&#x2022; setting names of days of the week (you can write down your version of those names, for example shortcuts or names in your language)<br><br>You really should join to RAMZES.design G+ community and be up to date with our CLEARFACE and other watchfaces. G+ community gives you also additional information concerning our development plans&#xA0;&#xA0;- CLEARFACE in particular. Don&#x2019;t hesitate to suggest your own ideas there - We will do our best to put your ideas into action. <br><br>* The watchface works with Google Fit where all your activity data come from. <br>** The weather option is a free addition to our watchface that can be changed in the future.<br>***Currently two weather services are available: YR and Openweather.",
    "histogram": {
        "1": 1,
        "2": 0,
        "3": 1,
        "4": 6,
        "5": 18
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/KZ_kIq2_Q8YRTI8_jpxeDCkkdY1UAX39h3nddahqCGkKFyj3Gq22zN80VW0HMwWiFcS5=h310",
        "//lh3.googleusercontent.com/8yTO32N0akzENPEKsbqNLSs0wvVejMlFiyii_WjnNF32EymAC8CbXD9d-ydJqA6PBg=h310",
        "//lh3.googleusercontent.com/0jXNzEJsoPd3uehUAH-k8K_fM8tVsWLYcFyVcfD__vtgt8Vc9h1RBE6JBr_j8CFF3DQ=h310",
        "//lh3.googleusercontent.com/aoRAh8R6bdkN8x5IfatUdYdpfNokUyte4r2r24hQnjrcyT-1Ti5uf8ZP9vcjqlD5kqOH=h310",
        "//lh3.googleusercontent.com/Uxb8qTDVNj5nQVlOoFGhoaCcdmV322gmfAh6seCHZIX4h5DngghrICMcCJCuttRa5mQ=h310",
        "//lh3.googleusercontent.com/33EJDZWc_DYIsOmjs_qeA1zcJE15wz9SyGcefTeRJgPu0vJF6YKsqXRlDgi91WeJNg=h310"
    ],
    "comments": [
        "Best customizable available. Thanks for the awesome work",
        "It doesn't work on my huawei watch with Android 2.0. (huawei mate 8 with android 6.0).  It just doesn't appear.",
        "Nie wiem czy to kwestia jakichś ustawień u mnie (wyłączyłem nawet widgety​) ale strasznie zużywa baterię telefonu",
        "Nice watch - very clear and readable.  The weather is inconsistent and the F display has two decimal places - looks unusual.  Can you adjust?   Thanks",
        "Looking forward to full preset importing/exporting to share configurations.  This is a great looking watch face and a very well put together customizer app",
        "Nice, clean and very easy to read.   Runs great on my Huawei Watch(AW2.0 preview) and LG Watch Sport. Very customizable and one of my new favorites."
    ],
    "recentChanges": [
        "New (Seconds) widget added."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mattsulima.clearface&hl=en&gl=us",
    "appId": "com.mattsulima.clearface"
}