{
    "title": "Nova Premium Watch Face",
    "summary": "Super Lumi nova material give the dial excellent readability qualities.",
    "icon": "//lh6.ggpht.com/9pZEtPFDT-hp1bPa6Fvhbqvh8la-XyB4kuIMcD2N_qEuXjqM4ynmhhNkVPNRxzKzA9w=w300",
    "price": "$1.04",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 2,
    "reviews": 73,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "February 6, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "This watch face was designed to give user all the required information in such a beautiful way that comprehends the beauty of Android Watch. Match Your Android watch with the color of your personality by customizing the watch through Mobile. Features like Ambient mode, weather, sms notifications, email notifications, battery status. Frillroid focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "This watch face was designed to give user all the required information in such a beautiful way that comprehends the beauty of Android Watch. Match Your Android watch with the color of your personality by customizing the watch through Mobile. Features like Ambient mode, weather, sms notifications, email notifications, battery status. Frillroid focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br><b>Key custom features:-</b><br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br><b>How it works?</b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. <br>Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 42,
        "2": 10,
        "3": 6,
        "4": 7,
        "5": 8
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/dpc3QWZaigeKTAMJAkaAVzX8y8uJwNAHzNL3FZk0mOiEv-jDeKDtJfc4cvbVovqOR6Y=h310",
        "//lh6.ggpht.com/pzU5TVY9VJRD_VAlWBLf6AeUESgnOUOANbdcTcp3IKUDsEskG4R6LncoGpoQXflxzI6g=h310",
        "//lh3.ggpht.com/bSvBqgQFkG0FceJ8-KguH41Cj2gM-MGoSJVhAagowTb0_FSSWx4TsjpEglAHDxi0eXlh=h310"
    ],
    "comments": [
        "Read reviews before purchasing Read reviews before purchasing. The Watchfaces is well made. However, the notifications aren't accurate. Currently, all the app can do is change color on the fonts, but that's it. While the Watchfaces and concept is nice, everything else doesn't work as advertised. Do not waste money until the developer decides to take proper action towards these things.",
        "Only does half of what it claims SMS and email notifiers have never functioned. Number of SMS and emails have remained the same on watch face regardless of the number of notifications on my phone.  Watch and phone battery have been fairly accurate though.  Eagerly awaiting updates to fix the notifier issues",
        "NOT recommend I bought it, and the FIRST time I installed, the watch face installed correctly and appeared to run normally.  BUT I returned it because it wouln' customize as I needed.  Today a friend tried my watch & reinstalled it, even buying it.  It still won't customize & THIS TIME there's  no refund  A ho-hum  rip off",
        "Do not purchase! Wish I would have paid attention to the reviews. This watch looks great, but the notifications DO NOT WORK! I had hoped that buying the pro version would have active notifications, but that's not the case. I had also hoped that there would be more settings than just color change, also not the case. Save your money!!",
        "Looks great, but... Notification Icons always show 9 messages and 14 emails.  They never change.  Actually, the phone battery percentage doesn't work either.  And I don't know what location it's using for weather, but that is also wrong, so the only thing that works on this is the time and watch battery %.  I paid for this?!?!",
        "Doesn't work Installed free version. Wanted to change so I bought 'pro'. Doesn't show up even when I do resend. Only free version. Very disappointing."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.nova.premium.digital.watch.D06&hl=en&gl=us",
    "appId": "com.frillroid.nova.premium.digital.watch.D06"
}