{
    "title": "Material Weather Free",
    "summary": "Colored Weather Watch Face that adds a richness to your wear",
    "icon": "//lh6.ggpht.com/rgdRaTr60f0QUebunsbYhiBUpkzJVheJ2fln_hyZ_YD5iQx1KI-RCKFIH1YIsyuiRsU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 2.9,
    "reviews": 311,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "November 24, 2015",
    "version": "1.3",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "This Watch face is said to have inspired the Utility collection of which the weather is part, and while it has luxurious design. This watch face is secured with a slim line color combination that adds a richness.FrillRoid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable. Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "This Watch face is said to have inspired the Utility collection of which the weather is part, and while it has luxurious design. This watch face is secured with a slim line color combination that adds a richness.<br><br>FrillRoid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable. <br><br><b>Key custom features:-</b><br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><b>How it works?</b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 94,
        "2": 43,
        "3": 57,
        "4": 42,
        "5": 75
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/YdxyCgAhpFRBjvXhgi3NpbLu5MIRHuLLTt93E5RBl_jqn3qoRmQzXEKOaFtsfHz3d0UW=h310",
        "//lh5.ggpht.com/3ap0aDcwcvn8e0Gzjctr3j0jk9Dt5FSJ9Y4GNDaNFXbbtTbZnkgmj1SN8h1bYdMGebU=h310",
        "//lh3.ggpht.com/wwN_VmSdMwupAl_yTdwrUyTtKQbgdb6b9_kzFTCVisutj4BBz3zxRr9kNY_QyAa3rA=h310",
        "//lh5.ggpht.com/CqRrfFW4SrLI8rpftSFu7-vrFxLC3NowPQU_5_kdcT0x4xvVn_JJ2oHUI334YXS9-Oc=h310"
    ],
    "comments": [
        "Looks nice, but... Like everyone else, it crashes and I can't change any settings. Also, it won't sync data with android wear, so it is more or less useless (does still display the time...so not completely useless as a watch face, lol). Have to uninstall....",
        "Keep crashing No way to change settings as the app crashes.   Also likes to send notifications to Android wear that pops up, gets annoying.   I uninstalled within ten minutes",
        "crashes a lot no settings menus on watch, watch face crashes when using settings on wear app on the phone, always on display needs to be more minimal",
        "Needs to be fixed Can't send settings to device as it says check connection, when everything is connected?",
        "Keeps saying check internet connection Keeps saying to check internet connection so I cannot update the settings. Useless.",
        "Keeps crashing when opening settings to configure... Why!"
    ],
    "recentChanges": [
        "Bugs Fixed"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.material.weather.free.D15&hl=en&gl=us",
    "appId": "com.frillroid.material.weather.free.D15"
}