{
    "title": "Forza Watch Face",
    "summary": "Carbon look watch face",
    "icon": "//lh3.googleusercontent.com/Po4btLw95wHchyGlsC9K8jcs6GGevEtInqNiFlZnubT9rbv0JFnjur7tztzbGO0vuA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.7,
    "reviews": 512,
    "developer": "psk Studio",
    "developerId": "psk+Studio",
    "developerEmail": "contact.pskstudio@gmail.com",
    "developerAddress": "Bucuresti, Romania",
    "updated": "October 11, 2015",
    "version": "1.2.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Forza Watch is an Android Wear customizable watch face. With a dark carbon fiber background and big, visible indicators it is easy to read and sporty looking. You can unlock the app to have acces to the color settings and the small dials, or use it free, simple and lightweight.Designed with a round watch face in mind it looks great on the Moto 360 but is also compatible with all round and square Android Wear watches. Settings are available only in the Companion App. To acces them select the watch face in Android Wear app and a small settings gear will apear. Click the gear and the Config App will start.Make sure you always have the latest version.Watch Face Settings:✔ Show / Hide Hours✔ Show / Hide Minutes✔ Show / Hide Small Dials in ambinet mode (PLUS Version)✔ Enable / Disable Animations (PLUS Version)✔ Enable / Disable Smooth Seconds Hand✔ Select Red or Blue ThemeUnlock the PLUS version to have acces to all the watch configuration settings. The screen is divided in 4 customizable zones. For eah one of them you can choose the item you want from the list. PLUS Version Settings:✔ 4 Quick Select Theme Colors✔ Custom Colors (Long press on the color)✔ 24 Hour Watch✔ Day (current date option)✔ Date✔ Phone and Watch Battery ✔ Small Seconds Hand✔ Tap the Watch Face to cycle through the mini dialsInstalling:- Install from Play Store- The sync with the watch may take 30 seconds to 2 minutes.- If it takes to long run 'Resync app' on Android Wear App.KNOWN BUGS:- If you restart your phone the service responsible with phone battery update will stop and you'll have to start the config app again. Working on an update.- If you get the error Authentication requied. You need to sign in google play account. Try clearing the cache and data from the Play Store App.Your feedback is highly appreciated as well as improvements suggestions. If you would like some more items, like digital watch dial, or step counter, send your suggestions. if you encounter any problems please contact me and I will respond ASAP. contact.pskstudio@gmail.comHave a nice day and enjoy your watch face.",
    "descriptionHTML": "Forza Watch is an Android Wear customizable watch face. With a dark carbon fiber background and big, visible indicators it is easy to read and sporty looking. You can unlock the app to have acces to the color settings and the small dials, or use it free, simple and lightweight.<br><br>Designed with a round watch face in mind it looks great on the Moto 360 but is also compatible with all round and square Android Wear watches. <br><br>Settings are available only in the Companion App. To acces them select the watch face in Android Wear app and a small settings gear will apear. Click the gear and the Config App will start.<br><br><b>Make sure you always have the latest version.</b><br><br><b>Watch Face Settings:</b><br>&#x2714; Show / Hide Hours<br>&#x2714; Show / Hide Minutes<br>&#x2714; Show / Hide Small Dials in ambinet mode (PLUS Version)<br>&#x2714; Enable / Disable Animations (PLUS Version)<br>&#x2714; Enable / Disable Smooth Seconds Hand<br>&#x2714; Select Red or Blue Theme<br><br>Unlock the PLUS version to have acces to all the watch configuration settings. The screen is divided in 4 customizable zones. For eah one of them you can choose the item you want from the list. <br><br><b>PLUS Version Settings:</b><br>&#x2714; 4 Quick Select Theme Colors<br>&#x2714; Custom Colors (Long press on the color)<br>&#x2714; 24 Hour Watch<br>&#x2714; Day (current date option)<br>&#x2714; Date<br>&#x2714; Phone and Watch Battery <br>&#x2714; Small Seconds Hand<br>&#x2714; Tap the Watch Face to cycle through the mini dials<br><br>Installing:<br>- Install from Play Store<br>- The sync with the watch may take 30 seconds to 2 minutes.<br>- If it takes to long run &apos;Resync app&apos; on Android Wear App.<br><br><br><b>KNOWN BUGS:</b><br>- If you restart your phone the service responsible with phone battery update will stop and you&apos;ll have to start the config app again. Working on an update.<br>- If you get the error Authentication requied. You need to sign in google play account. Try clearing the cache and data from the Play Store App.<br><br>Your feedback is highly appreciated as well as improvements suggestions. If you would like some more items, like digital watch dial, or step counter, send your suggestions. <br>if you encounter any problems please contact me and I will respond ASAP. <br>contact.pskstudio@gmail.com<br><br>Have a nice day and enjoy your watch face.",
    "histogram": {
        "1": 53,
        "2": 46,
        "3": 83,
        "4": 139,
        "5": 191
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/7LZMf7nb65D2pnKrtjYFN4f4q-vLv7tEYL6Hs5wcqDpZGOKCQ9FxPx2-rcv6ThWyAYA=h310",
        "//lh3.googleusercontent.com/x_neFm4NC5qgSSfnfOiKGt1oIsPeaeFF0sjDSQR3MBeBzHo-dIs4btz2XIpcvh6JVYg=h310",
        "//lh3.googleusercontent.com/YyA6XXTTXnO7FJvqtUjOaS7MIzkjI0IFhr2j8YEInuo_eHnolKH2fSNUZk7DZeMb0Q=h310",
        "//lh3.googleusercontent.com/K-QWE6BIdvthAcUmKX5XBA5hSospPm-8cM4_dYOI94Wi3_Vl69DZ5JWMN2VXnKbDlAU=h310",
        "//lh3.googleusercontent.com/3xTLXFS-nwQa1fg6PrB-1NR0muKy5oTJg5uBwZI_WMFwaIjYuNBRJxLHCBs-iRG_2A8=h310"
    ],
    "comments": [
        "Great, but lags sometimes This is a great watch face and finally figured out how to upgrade to full paid version.  I did notice, as others have noted, that it makes Mini Launcher and ok Google, and other native android wear apps lag when watch face custumozatnions are added (e.g. day, date , and battery widgets.) so minus 1 star.  Other than that, an absolutely beautiful watch face.  (LG Urbane running latest Android wear on watch and HTC m7 stock phone). Will rate 5 stars when lagging issue resolved.",
        "Very nice anr clean design but poor implementation.  - Had to restart Android Wear to get the premium features after paying   - It crashed my watch  - The dimensions are not properly adoptive anr on my Tag watch the small dails overlap with Hours.   Very nice ambient mode though.",
        "Great design. Couple issues The face looks great,  I do think the dials need a lock feature as easily changed by tapping without realising and the phone battery indicator doesn't always update unless refreshed in the wear app",
        "Wasted my time Couldn't upgrade to access the full feature. Finally figured out to swipe screen left to access a different page. And i can't even get the refund!",
        "Good face I really liked the face and i went ahead and purchased  it.  I do feel the need to lock the dials on the face.. Since tapping the changes the dial type on the face.  Also a slightly more customization would been sweet.  Like changing the size of the numbers or changing them to bars.",
        "Buy before you try Unable to evaluate fully on the free version because most of the features are locked out. For the free version,  you get a plain dial with just time and the ability to select between red or blue lettering."
    ],
    "recentChanges": [
        "✔ Complete overhaul of the Forza Watch Face app",
        "✔ Updated to the latest Google source code version",
        "✔ Fix offset problems on the new high resolution watches (Moto 360 2015, Huawei Watch, Asus Zen 2)",
        "<b>Watch Face:</b>",
        "Suports animations",
        "Suports Tap events to change the mini dials",
        "Smaller size, better memory efficiency",
        "Better performance",
        "<b>Compagnion App:</b>",
        "Complete rebuild",
        "Color options in free version",
        "Custom Colors in PLUS version"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pskstudio.forzawatch&hl=en&gl=us",
    "appId": "com.pskstudio.forzawatch"
}