{
    "title": "Prime Watch Face for Moto 360",
    "summary": "Have a look at the first edition of FR-A04 Analgoue Watchface.",
    "icon": "//lh4.ggpht.com/BfGFIKUzMOasBY7Nj9uDycAyOCTlIjQz5eRleSWmDpNPYJCGnJbtxyeO7B-_qttG_MQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.8,
    "reviews": 303,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "January 14, 2015",
    "version": "1.6",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Model Number: FR-A04Have a look at the first edition of FR-A04 Analogue Watchface.Moto 360 Prime keeps you up to date without taking you away from the moment. If you are a fan of a classic and elegant analogue watch Prime Greyish Black is just made for you. This watch face is designed keeping in mind the classic look for you smart watch. It has analogue design and displays a various features.•\tAnalogue view of time and Date•\tBeautiful blue background•\tRemaining battery life of your device so you exactly know when to chargeThis greyish black Watchface is designed for all round and square display watches so you can use it with Moto 360, Smart watch 3, Samsung Gear Live.How it worksIt’s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen.",
    "descriptionHTML": "<b>Model Number: FR-A04<br><br>Have a look at the first edition of FR-A04 Analogue Watchface.</b><br><br>Moto 360 Prime keeps you up to date without taking you away from the moment. If you are a fan of a classic and elegant analogue watch Prime Greyish Black is just made for you. This watch face is designed keeping in mind the classic look for you smart watch. It has analogue design and displays a various features.<br><br>&#x2022;\tAnalogue view of time and Date<br>&#x2022;\tBeautiful blue background<br>&#x2022;\tRemaining battery life of your device so you exactly know when to charge<br><br>This greyish black Watchface is designed for all round and square display watches so you can use it with Moto 360, Smart watch 3, Samsung Gear Live.<br><br><b>How it works</b><br>It&#x2019;s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen.",
    "histogram": {
        "1": 28,
        "2": 29,
        "3": 36,
        "4": 99,
        "5": 111
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/nnpTaIREZJEPxRBpJyFVx_pnch_ZOzppEoM9CLl1v5EghJZ2QxtyLJ56suwWckw5Dg=h310",
        "//lh4.ggpht.com/m6kZkHIdCIfhixFJbo95TPuhBl4j42VT7h_kVMBxloLXs3t_OarEwdharyCPpG4BQ48=h310",
        "//lh5.ggpht.com/Kswn7piGgCNu_AWpxG9WCOLDK9_lmKWmYYfJpT7q5xCBLCwnLHD7wN6FR344R4u-BvIm=h310"
    ],
    "comments": [
        "Nice classic watch face Looks very nice on the Sony Smartwatch 3 with square display, but second hand doesn't work in ambiant mode. One way around this is to make the second hand disappear in ambiant mode. A couple of nice options would be to have the option of a transpatent background and to change the second hand colour.",
        "Sleek, but flawed LG G watch. Sleek, elegant, beautiful, BUT when watch goes subdued the second hand freezes in place and never disappears. When I wake it up the second hand jumps to the time where it should be. Be nice if the date was a bit larger... Eliminate the day maybe.",
        "Love the look, needs some settings changed Could you please remove this as an 'app' in the app drawer? Just move that screen to the watch face settings. I would pay $1 just to have it not in my app drawer. Also would be cool if you removed the second hand from the ambient mode. Maybe added some color options for it. Then this would be 5 stars.",
        "Moto 360 + Samsung Galaxy Note 3 I would like to have them, but when I download them, they only show their icon in apps menu, but in android wear, or motorola connect, or even on watch, I cant choose them, because they are not there :-(         *still doesnt work after update             *well done, finally working! 5*",
        "Nice but bugged This would be my most frequently used wtahcface ever if not for the fact that the screen goes yellow and freezes when my LG G watch R is in standby",
        "The ambient mode is really odd on the G watch, the seconds hand just stops"
    ],
    "recentChanges": [
        "Now compatible for All Size devices",
        "Fixed UI Bugs"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.fra04&hl=en&gl=us",
    "appId": "com.frillroid.fra04"
}