{
    "title": "Graphing Calculator",
    "summary": "The Simple Graphing Calculator",
    "icon": "https://lh6.ggpht.com/fx7ITQ6ZhxfcGRc-N9_wqQwrTavnau66iwrbUkCXxP6NIt9igK7ZLXVZHpEhJxRJPQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.9,
    "reviews": 12358,
    "developer": "Herbert Law",
    "developerId": "Herbert+Law",
    "developerEmail": "uclahklaw@gmail.com",
    "developerAddress": "PO BOX 2814\nCupertino, CA 95015",
    "updated": "March 31, 2016",
    "version": "1.17",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "I believe every student in the world should have free access to graphing calculator and learn the amazing math and science to the next level. Thanks for your support, Graphing Calculator recently got 1M+ downloads. A Simple Graphing Calculator- Added Basic Calculator- Added Scientific Calculator- Added Graphing Calculator- Pinch Zoom for Graphing Calculator- Take Screenshot of Graph- Added Tablet Screen Size Support- Improved User Interaction for Graphing Calculator- Scientific Notation- Radian vs Degree- InApp purchase to remove ads banner- copy and paste using clipboard- Added Calculator for Android WearPlease press Shift on the top left corner, if you don't find the operation key.- buttons like ln, sqrt, log, 1/x, sinh, sinh-1, cosh, cosh-1, tanh, tanh-1- abs means absolute value |x|",
    "descriptionHTML": "I believe every student in the world should have free access to graphing calculator and learn the amazing math and science to the next level. <br><br>Thanks for your support, Graphing Calculator recently got 1M+ downloads. <br><br>A Simple Graphing Calculator<br>- Added Basic Calculator<br>- Added Scientific Calculator<br>- Added Graphing Calculator<br>- Pinch Zoom for Graphing Calculator<br>- Take Screenshot of Graph<br>- Added Tablet Screen Size Support<br>- Improved User Interaction for Graphing Calculator<br>- Scientific Notation<br>- Radian vs Degree<br>- InApp purchase to remove ads banner<br>- copy and paste using clipboard<br>- Added Calculator for Android Wear<br><br>Please press Shift on the top left corner, if you don&apos;t find the operation key.<br>- buttons like ln, sqrt, log, 1/x, sinh, sinh-1, cosh, cosh-1, tanh, tanh-1<br>- abs means absolute value |x|",
    "histogram": {
        "1": 1342,
        "2": 690,
        "3": 1360,
        "4": 2966,
        "5": 6000
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "https://lh5.ggpht.com/ll0upPrtPN1f03n120Uvl0epLrJzY9-nKe3OdlpRdA0Vw4S4aUSX4zxOvrUdDVP4qkQ=h310",
        "https://lh6.ggpht.com/esCYPJ2eBghRfD-HRg18eTLs-VNhYGMS08rurXExk5t17wXEOurm9-Jt3h4qGFdXfDo=h310",
        "https://lh3.ggpht.com/ib2DtIeHbzaZGyt_Wwt_ySu1DIF83uiXvUhcXm-WH_FrH25v806aYfJMX6aaiiUQeQ=h310",
        "https://lh5.ggpht.com/-SFDGCmQwiBkbD_gizvfsDZeYnOGtI2L4LfUbnbcy02I51v_Ix2zixuapEm6pT5Obw=h310",
        "https://lh6.ggpht.com/ENOjrOnmMgUcNUGplfZxVsovu6gxeuuarayQ6_fDkDiloTn13iIElpUL4mj97jj55ZU=h310",
        "https://lh4.ggpht.com/vV7ih6o5iMo7RDQ4San58MUd9xbqvAwsZui48AHsIQAp0__aA1PTMz5yu5BBSpaPCVo=h310"
    ],
    "comments": [
        "It's decent I have used a better one that no longer works for me so I switched here.  The problem is ads pop to play store by themselves.  Fix that and there isn't much wrong.",
        "Decent functionality for a free app, but still leaves you frustrated and wishing you had a $15 calculator in your hand. Is it really impossible to make an app that gives a $700 smartphone the same functionality as the $15 calculator?  The graphing function of this app is all but useless.",
        "If I could rate zero I would Yea its a great calculator but an ad every two second is unacceptable. If you close out of them too quickly and don't let them load the app will close itself.",
        "Used to love this but it has become riddled with viruses. Every 3rd or 4th button I press opens up the play store and won't let me close it for a solid 15 seconds. This is the only app that has this problem, even others with ads in the same location on the phone. 1 start until fixed.",
        "Uses more data than Facebook Be aware that this may burn up your data. Why does a simple calculator need nearly 500 MB a month?",
        "Simple interface, a little outdated looking but that's really the least of my worries. It however, didn't work for my math problem to determine the line of fit for a table of numbers. That's what I installed it for, and it couldn't serve that purpose... Basically it needs more options."
    ],
    "recentChanges": [
        "1.17 update google play services"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.herbertlaw&hl=en&gl=us",
    "appId": "com.herbertlaw"
}