{
    "title": "Black Watch Face",
    "summary": "Black Watch Face",
    "icon": "//lh3.googleusercontent.com/Jf7Z3oJDL4wGsaZxCcSs4h5ZDA5uZ8aHygf7iFxZREqzK7gkTia6o1Al3TNu5OMx4C27=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 79,
    "developer": "OAJOO",
    "developerId": "OAJOO",
    "developerEmail": "contact@oajoo.com",
    "updated": "March 2, 2017",
    "version": "1.0.b2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "This is a nice and simple watch face. With this  minimal, black watch face you can change color of the hour and minutes but also for the day name, day, month and year.",
    "descriptionHTML": "This is a nice and simple watch face. <br><br>With this  minimal, black watch face you can change color of the hour and minutes but also for the day name, day, month and year.",
    "histogram": {
        "1": 7,
        "2": 2,
        "3": 7,
        "4": 13,
        "5": 50
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/tzU3RlhXQ4MGVBJ0HymT_AjAOLBviu_G9IJVfPoJpL0jmuas9BJRYViIgnXBdcDV-mXk=h310",
        "//lh3.googleusercontent.com/e9ibaaJRuvhRr7FXDLqgOwrJD6iyIIHuIT18vorRO0dkDOS2-hC_njV-3go8tRj2wpU=h310",
        "//lh3.googleusercontent.com/QoxkxNTI1m3t0IG0J8spjP4uSNCPJpjTptbSYzwH0mQA4NttLgEx7MnMzwClQAvaV9M=h310",
        "//lh3.googleusercontent.com/Y0sfMdHpJBivgOXlsS8zvG_98I5meZqSyStLasMkZVhNtcchWU-M14x85-tJX6GII1c=h310",
        "//lh3.googleusercontent.com/vP2uK7TBpGRcjGo4DetVhx0-CVM3wPO4PvOKdNabxbB9V0YvmPkQcY9ekBwUWyySW9U=h310",
        "//lh3.googleusercontent.com/kQXs9f-1CY--6WHGTXQpp8B0U4DD6A19sLWKs4mN4pDTr03cUHN_FusmjXDK-s22=h310"
    ],
    "comments": [
        "Looks lovely, it watch face unfortunately doesn't appear on way h if downloaded through Google play app store (same with other faces, seems to be a bug). Downloading through the Gears Store (Galaxy Store) probably solves it but finding it is a nightmare. Any suggestions what I can search for to find it (already tried any combo of: black watch face oajoo). Thanks!",
        "I really enjoy the simplicity of this watch face. Some faces have too much visual clutter. This one is right along  I what I look for in a watch face. I just wish that it had an option for 12 hour time as well as it's native 24 hour time. - LG Watch Sport",
        "I like the minimalistic approach. A small suggestion,can you fix the image preview on top and make the color editors scrollable? i can't see the preview when editing the last set of colors",
        "Nice watch face. Suggest that you put the instructions in the app description though, lots of people giving unfair ratings as it's not clear how to get the watch face onto the watch.",
        "I really love the simplicity of this watch face. I would love to one additional option to make it perfect for me and that would be to display a small font showing battery level.",
        "How to do you change the time from 24 hr to 12 hr instead? Why isn't it available in the first place?"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.oajoo.wear.faces.black&hl=en&gl=us",
    "appId": "com.oajoo.wear.faces.black"
}