{
    "title": "FitIt Wear for FitBit®",
    "summary": "Ultimate Android Widget for Fitbit SURGE, CHARGE HR, CHARGE, FLEX and more.",
    "icon": "//lh5.ggpht.com/0SN8p3h32pgq9dGQ70EbTRvWuLjrbew8jJnIZ9MNa-L033cM7GUI7IuNPSb1yKPY50w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 2.7,
    "reviews": 17,
    "developer": "Mountain Edge Inc",
    "developerId": "Mountain+Edge+Inc",
    "developerEmail": "mountainedgeinc@gmail.com",
    "developerWebsite": "http://www.mountainedge.com",
    "developerAddress": "820 Saddleback PL NE\nLeesburg, VA USA  20176",
    "updated": "November 27, 2014",
    "version": "1.0.1",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "FitIt Wear widget is built on top of our popular FitIt widget.  You have all the widgets on your Home screen plus now you can have notifications on your Android Wear smartwatch to display your progress. THIS WIDGET HAS LIMITED FEATURES WITH ADS.  FITIT-PRO IS MORE FEATURE RICH AND PERSONALIZED ( eg. 10 RESIZABLE WIDGETS, MORE SYNC OPTIONS, PERSONALIZED COLOR THEMES, etc.) TRY THE FITIT-PRO TODAY.The ultimate widget for FitBit android users to keep track of progress in the Home screen.   On Android device, you can place FitIt widget (Automatically rotates every 20 sec; tap this widget opens Settings)On Android Wear, you see the current Steps.WHAT'S NEW:- support Fitbit SURGE, CHARGE HR, CHARGE, FLEX and more.Installation setup: FitIt is a Widget.   Please tap on \"App\" button from Home screen and select 'WIDGETS' tab.   Drag & drop the FitIt Wear widget onto Home screen will initiate the installation process.   Please follow the instruction.Once linked, then your Fitbit data will be shown as notifications in your Android Wear smartwatch. Recommendation:- We recommend to have a good internet data connection at initial setup.  FitIt Wear widget may experience timeout due to poor connection and results to an incomplete setup.  If happens, then uninstall the FitIt Wear widget from Settings->Apps and wait few minutes before download the widget from Google Play.Note:  Some Android device manufactures modify the Home Screen so the widget tray may be hidden and hard to find.  Please consult your device's user guide for widgets.Note: If you don't see the FitIt Wear widget after installation, please uninstall and reinstall again.  Some devices, most notably Samsung devices, fail to register the FitIt widget at the first time.  It needs to be reinstalled to recognize the widgets.Disclaimer:No warranty is expressed or implied that the application or its author is liable in any manner for any direct, incidental, indirect or punitive damages arising out of your access, use or inability to use this application, or any errors or omissions in this information on this application.  Author shall not be liable to you or to any other third party for any additional, modification, suspension or discontinuance of the application.",
    "descriptionHTML": "FitIt Wear widget is built on top of our popular FitIt widget.  You have all the widgets on your Home screen plus now you can have notifications on your Android Wear smartwatch to display your progress.<br> <br>THIS WIDGET HAS LIMITED FEATURES WITH ADS.  FITIT-PRO IS MORE FEATURE RICH AND PERSONALIZED ( eg. 10 RESIZABLE WIDGETS, MORE SYNC OPTIONS, PERSONALIZED COLOR THEMES, etc.) TRY THE FITIT-PRO TODAY.<br><br>The ultimate widget for FitBit android users to keep track of progress in the Home screen.   <br><br>On Android device, you can place FitIt widget (Automatically rotates every 20 sec; tap this widget opens Settings)<br><br>On Android Wear, you see the current Steps.<br><br>WHAT&apos;S NEW:<br>- support Fitbit SURGE, CHARGE HR, CHARGE, FLEX and more.<br><br>Installation setup: <br>FitIt is a Widget.   Please tap on &quot;App&quot; button from Home screen and select &apos;WIDGETS&apos; tab.   Drag &amp; drop the FitIt Wear widget onto Home screen will initiate the installation process.   Please follow the instruction.<br><br>Once linked, then your Fitbit data will be shown as notifications in your Android Wear smartwatch. <br><br>Recommendation:<br>- We recommend to have a good internet data connection at initial setup.  FitIt Wear widget may experience timeout due to poor connection and results to an incomplete setup.  If happens, then uninstall the FitIt Wear widget from Settings-&gt;Apps and wait few minutes before download the widget from Google Play.<br><br>Note:  Some Android device manufactures modify the Home Screen so the widget tray may be hidden and hard to find.  Please consult your device&apos;s user guide for widgets.<br><br>Note: If you don&apos;t see the FitIt Wear widget after installation, please uninstall and reinstall again.  Some devices, most notably Samsung devices, fail to register the FitIt widget at the first time.  It needs to be reinstalled to recognize the widgets.<br><br>Disclaimer:<br>No warranty is expressed or implied that the application or its author is liable in any manner for any direct, incidental, indirect or punitive damages arising out of your access, use or inability to use this application, or any errors or omissions in this information on this application.  Author shall not be liable to you or to any other third party for any additional, modification, suspension or discontinuance of the application.",
    "histogram": {
        "1": 7,
        "2": 3,
        "3": 1,
        "4": 0,
        "5": 6
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/0PpKIvvY5e2uxWMqN8qzsAHZp6F8X1LbUJC8ynBnbdPFCEq00AV2EQOF9JH6lSUJinU=h310",
        "//lh5.ggpht.com/CvDrQntn6JwIvyO0WbVZSLE7jgrmMT0BV1XKcNYgMfPWv4xAbejIHb2WNGDms_yKMA=h310",
        "//lh4.ggpht.com/baybiuK9kWttOHtiv25P5Z6XWmKm0nmKvWj8vAyl_wWOSwRo9xSUjBv35Z8f0aMskbwv=h310",
        "//lh6.ggpht.com/IB1qtPUZQ9aNLlvlgQpYFeWN7VbP2VPXtd24iQzkF94e6egf9M2EbgnSAMfgPK2Qj5A=h310",
        "//lh6.ggpht.com/wVV-A5PnC-yhckf65g5jZD-7_pi7SSt3GOl0BxssSkJM8ns5vcannrLpBEgwqFtHdgs=h310",
        "//lh5.ggpht.com/sc8JstpWTsljsu92Tt69Fv46hYS9KZzeH9J6mhXFhHa5WSMIfiFIAtuCcnL6HI5nBw97=h310"
    ],
    "video": "https://www.youtube.com/embed/Jq2D4O1-oRg",
    "comments": [
        "Could be better If it had different size widgets i.e. smaller widgets, or no widget on the phone as this app says its for wear... Also if on the wear round display you could change the position of the step notification i.e. it says 'fitbit updates', you have to swipe it up to see the step count. Would be way better if you could just see the step count",
        "Wouldn't link to fitbit on phone. So it never did anything. So I don't know yet.",
        "Crashes! It is so stupid and is a waste of time!",
        "useless Doesn't do anything with Android Wear....",
        "It does not rotate every 20 seconds My app does not rotate every 20 seconds on my Samsung S5.  Please fix",
        "Also won't work on BLU R1 HD. Doesn't show up as an available widget."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mountainedge.fititwear&hl=en&gl=us",
    "appId": "com.mountainedge.fititwear"
}