{
    "title": "Elegant Binary Watch Face",
    "summary": "Binary watch face for Android Wear.Decimal digits are hinted in the background.",
    "icon": "//lh3.googleusercontent.com/8vlCVghWQSfCOdigy_WMHhoR7foA4sDzjvA0btSIT5V7k0A1L2KDwFKNm6XGdb3COw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.3,
    "reviews": 555,
    "developer": "Martin Halachev",
    "developerId": "4615655546644884332",
    "developerEmail": "mhalachev@gmail.com",
    "updated": "February 24, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Binary watch face for Android Wear. Decimal numbers are merely hinted in the background.Features• Date & battery level indicators• 12/24-hour format selection• Date format options, including Unix timestamp• Optional binary representation of seconds• Seconds ticks for additional hint to binary values• Colors, effects, themes and size customization• Ability to hide decimal numbers and hints• Color in ambient mode on supported devices*• Interactive watch face features**• Help topics for reading the binary watch.Accessing Watch face settings• Option 1, using the phone: Open the Android Wear app, and then tap the white gear icon in the center of the selected watch face.• Option 2, directly on watch: Tap and hold anywhere on the watch face, and then select the white gear icon.Using interactive actionsTap anywhere on the watch face to toggle background numbers on and off. Tap in the center of the screen to toggle bit numbers.**Reading the binary watchFor detailed information, select Help from the options menu of the Watch face settings companion app on the phone.Frequently asked questionsFeatured question: \"I have installed the app but cannot find out how to start it.\"Answer: The watch face is designed for use with Android Wear smartwatches. It is accessible via the Android Wear app instead of a stand-alone launcher icon as it is not for the smartphone itself.Read all frequently asked questions here: https://goo.gl/ncNIs8Requirements: Android Wear 5.0 or higher. Both square and round screen devices are supported.This app is intended exclusively for use with smartwatches and cannot be started on a smartphone.Disclaimer: The application is provided as is without liabilities or warranties of any kind, either express or implied.* Color in ambient mode is not supported by certain Android Wear devices. Actual colors may vary or may not be visible at all.** Interactive watch faces feature requires Android Wear Update 1.3 with Interactive Watch Faces support.",
    "descriptionHTML": "Binary watch face for Android Wear. Decimal numbers are merely hinted in the background.<br><br><b>Features</b><br>&#x2022; Date &amp; battery level indicators<br>&#x2022; 12/24-hour format selection<br>&#x2022; Date format options, including Unix timestamp<br>&#x2022; Optional binary representation of seconds<br>&#x2022; Seconds ticks for additional hint to binary values<br>&#x2022; Colors, effects, themes and size customization<br>&#x2022; Ability to hide decimal numbers and hints<br>&#x2022; Color in ambient mode on supported devices*<br>&#x2022; Interactive watch face features**<br>&#x2022; Help topics for reading the binary watch.<br><br><b>Accessing Watch face settings</b><br>&#x2022; Option 1, using the phone: Open the Android Wear app, and then tap the white gear icon in the center of the selected watch face.<br>&#x2022; Option 2, directly on watch: Tap and hold anywhere on the watch face, and then select the white gear icon.<br><br><b>Using interactive actions</b><br>Tap anywhere on the watch face to toggle background numbers on and off. Tap in the center of the screen to toggle bit numbers.**<br><br><b>Reading the binary watch</b><br>For detailed information, select Help from the options menu of the Watch face settings companion app on the phone.<br><br><b>Frequently asked questions</b><br>Featured question: <i>&quot;I have installed the app but cannot find out how to start it.&quot;</i><br>Answer: The watch face is designed for use with Android Wear smartwatches. It is accessible via the Android Wear app instead of a stand-alone launcher icon as it is not for the smartphone itself.<br>Read all frequently asked questions here: https://goo.gl/ncNIs8<br><br>Requirements: Android Wear 5.0 or higher. Both square and round screen devices are supported.<br>This app is intended exclusively for use with smartwatches and cannot be started on a smartphone.<br>Disclaimer: The application is provided <i>as is</i> without liabilities or warranties of any kind, either express or implied.<br>* Color in ambient mode is not supported by certain Android Wear devices. Actual colors may vary or may not be visible at all.<br>** Interactive watch faces feature requires Android Wear Update 1.3 with Interactive Watch Faces support.<br>",
    "histogram": {
        "1": 28,
        "2": 18,
        "3": 40,
        "4": 124,
        "5": 345
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/2ZcX47j6yZjTCeYmGx3E0abaqK3mdyVocnbh-BFQbR-BEs_-pClIdxaBmxOWtkSL5w8=h310",
        "//lh3.googleusercontent.com/raFn3ujanhlw0jb5Np7XqugzJxV7_ZaH6fOrnq3Pz8QkzkXevSpkXiXJP0HWjbralz8=h310",
        "//lh3.googleusercontent.com/pbfeoJrLNF_FjMlLHTSaiCT5U616dhvoPRkSzkN1G5nlTBLC8dbZzbTAukq84FaQBxI=h310",
        "//lh3.googleusercontent.com/qj5pP1dk76XExR-RwD4ywKwcXiwazzhfdOw2B0bPGG1mmccQc_HEoe0Pn-TFk7lyoKI=h310",
        "//lh3.googleusercontent.com/IVLit3ENxrv3BEqrMK8R8lI7T-YJg0CJ1hyiNJYFYxZ0HaM1cFAgfnrJGqOA_RYLbA=h310",
        "//lh3.googleusercontent.com/KJgOmPT6Rogf7imS1iO9Hg_yWvR37CMVTws-PCsoMGgF2W9Y8Zcs6Ig1GjbzDvO5oQ=h310",
        "//lh3.googleusercontent.com/DyN9RWdj34MdP4cbTNsDoZM9oLx3yrJwILzemGY0IGbFUlzqg-p1AVZshmgMELl_bRA=h310",
        "//lh3.googleusercontent.com/Wo1i4juKf5UHnc71rHLvmphJxf6cyGGgLgkRcNA6Ek8JG810CjJOjaapR7nwsZ9wFg99=h310"
    ],
    "comments": [
        "Downloaded, got notification on watch (Huawei 1) about 2 hours later that face was available. However next day still no sign of watch face on either phone or android app. Strange thing is only way I could uninstall was search for app in play store. No app in app folder on phone.  Shame as it looks good but given other reviews I'm not the only person to have issues.",
        "Amazing. Just one thing: can I have an option to make the dots bigger even with huge selected there's tones of wasted space and the dots are too small",
        "Very nice watchface! It took me some time though to find in the FAQ that I had to install it from my watch under Android Ware 2.0.",
        "Awesome face, but I can't put the wachface's style in vertical way. Just horizontal! Could u change it? Thx",
        "I have installed it 5 times already and still don't find it in my Android Wear watch faces or on my ZenWatch 3. Not sure what's wrong here? Help.",
        "Being a Computer Science major, I love this, especially if someone asks what time it is and I show them the answer in just plain binary format, and smile."
    ],
    "recentChanges": [
        "• Support for Android Wear 2.0",
        "• New date format: ISO notation",
        "• Performance improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.halachev.martin.android.wearable.binarywatchface&hl=en&gl=us",
    "appId": "com.halachev.martin.android.wearable.binarywatchface"
}