{
    "title": "Watch Face Collection RAF3078",
    "summary": "Multiple time zones pilot&#39;s watch face with UTC time support and DST indication",
    "icon": "//lh3.googleusercontent.com/SzkADtClwfXiipQfLc_Xo50C9S4HIz6HW4smXZ4336JKYk6ugjjJCphK2Sh7h4xKuDI=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 4.1,
    "reviews": 10,
    "developer": "Luna-78 Mobile",
    "developerId": "Luna-78+Mobile",
    "developerEmail": "luna.78.mobile@gmail.com",
    "developerWebsite": "http://mobile.luna-78.com/raf3078.html",
    "developerAddress": "198207, Tramvayniy pr. 1-78, St.Petersburg, Russian Federation",
    "updated": "October 18, 2015",
    "version": "1.0.3",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Premium collection of round watch faces for Android Wear.ATTENTION! This application is for Android Wear device (wrist watch). After installation you can find  customisation utility inside Google's \"Android Wear\" application, but wait couple of minutes until \"Android Wear\" app synchronizes data to your watch, or try to manually ask for \"Resync apps\" in \"Android Wear\" app.Please be informed of application requirements:For wearable device (watch): Android 5.x (Lollipop) or laterFor handheld device (phone or tablet): Android 4.3.x (Jelly Bean) or laterGoogle's \"Android Wear\" companion application need to be preinstalled on handheld device.Actually, it is not just premium watch face for your Android Wear device. It is rather a constructor of Russian air force pilot's style, functional watch faces with broadest customisation possibilities, multiple time zones support, Zulu (aka Greenwich Mean Time, GMT, UTC) time mode and daylight saving time indication. With this watch face you will never miss daylight saving time switching!Express yourself by constructing a personal collection of good looking, attractive photorealistic watch face premium layouts. Share your layouts with others. Supplement your collection with layouts, constructed and shared by others.You are welcome to join watch face community at: https://plus.google.com/u/0/communities/109287591730825379453Watch face features✔︎ 20 attractive modifiable premium watch faces in preinstalled collection to get you started✔︎ supports work on multiple Android Wear watches connected to single handheld device✔︎ low level of wear battery consumption✔︎ android wear device screen resolution independent; you can use this watch face on devices with ANY screen resolution because of vector nature of drawing engine✔︎ there is an option to force watch to display date and time in Coordinated Universal Time time zone (UTC; aka: Zulu time, Greenwich Mean Time (GMT), nautical time zone)✔︎ supports interactivity: by touching the watch screen it switches demonstrated time zone (please, see demo video here: https://www.youtube.com/watch?v=M7EDvcxuEiQ)✔︎ supports up to 10 different time zones (about 600 time zones in list to select)✔︎ there is indication that daylight saving time (DST) is in action for time zone✔︎ timezone's current time offset indication✔︎ time zone information can be shown on upper or lower hemisphere of watch face✔︎ 12-hour analog dial with 3 sub-dials: \"day of the week\", \"month\" and \"battery\", time zone label, time zone offset and daylight saving time indicator✔︎ big continuous \"day of the week\" sub-dial allows to easily determine part of the day (AM/PM periods) even on 12-hour analog dial✔︎ you can select any colour for any layout element (35 elements in interactive mode and 14 elements in ambient mode)✔︎ up to 7 editable inscriptions with customisable placement and appearance✔︎ sweep or discrete seconds hand movements in interactive mode✔︎ respects burn in protection (by proportionally scaling watch dial and elements; turnable option)✔︎ respects low-bit ambient mode (by customising layout elements colours for ambient mode)✔︎ allows to respect displays with \"chin\" (Hello, Moto)✔︎ you can share single layout or entire layouts collection✔︎ each hour mark is individually selectable from 8 different hour mark sets (may be increased in future updates), with customisable appearance✔︎ 4 switchable main hand sets (may be increased in future updates)✔︎ allows to show handheld battery level (turnable option)✔︎ companion app supports landscape screen orientation for tabletsApplication permissions and additional infoFor application permissions explaination and more detailed info please visit watch face web site: http://mobile.luna-78.com/raf3078.htmlFor any question regarding the application or in case of troubles please contact us by e-mail: luna.78.mobile@gmail.com",
    "descriptionHTML": "Premium collection of <b>round</b> watch faces for Android Wear.<br><br><br><b>ATTENTION!</b> This application is for <b>Android Wear</b> device (wrist watch). After installation you can find  customisation utility inside Google&apos;s <b>&quot;Android Wear&quot; application</b>, but wait couple of minutes until &quot;Android Wear&quot; app synchronizes data to your watch, or try to manually ask for &quot;Resync apps&quot; in &quot;Android Wear&quot; app.<br><br><br><b>Please be informed of application requirements:</b><br>For wearable device (watch): <b>Android 5.x (Lollipop)</b> or later<br>For handheld device (phone or tablet): <b>Android 4.3.x (Jelly Bean)</b> or later<br>Google&apos;s &quot;Android Wear&quot; companion application need to be preinstalled on handheld device.<br><br><br>Actually, it is not just premium watch face for your Android Wear device. It is rather a constructor of Russian air force pilot&apos;s style, functional watch faces with broadest customisation possibilities, multiple time zones support, Zulu (aka Greenwich Mean Time, GMT, UTC) time mode and daylight saving time indication. With this watch face you will never miss daylight saving time switching!<br><br><br>Express yourself by constructing a personal collection of good looking, attractive photorealistic watch face premium layouts. Share your layouts with others. Supplement your collection with layouts, constructed and shared by others.<br><br><br>You are welcome to join watch face community at: https://plus.google.com/u/0/communities/109287591730825379453<br><br><br><b>Watch face features</b><br>&#x2714;&#xFE0E; 20 attractive modifiable premium watch faces in preinstalled collection to get you started<br>&#x2714;&#xFE0E; supports work on multiple Android Wear watches connected to single handheld device<br>&#x2714;&#xFE0E; low level of wear battery consumption<br>&#x2714;&#xFE0E; android wear device <b>screen resolution independent</b>; you can use this watch face on devices with ANY screen resolution because of vector nature of drawing engine<br>&#x2714;&#xFE0E; there is an option to force watch to display date and time in Coordinated Universal Time time zone (UTC; aka: Zulu time, Greenwich Mean Time (GMT), nautical time zone)<br>&#x2714;&#xFE0E; supports interactivity: by touching the watch screen it switches demonstrated time zone (please, see demo video here: https://www.youtube.com/watch?v=M7EDvcxuEiQ)<br>&#x2714;&#xFE0E; supports up to 10 different time zones (about 600 time zones in list to select)<br>&#x2714;&#xFE0E; there is indication that daylight saving time (DST) is in action for time zone<br>&#x2714;&#xFE0E; timezone&apos;s current time offset indication<br>&#x2714;&#xFE0E; time zone information can be shown on upper or lower hemisphere of watch face<br>&#x2714;&#xFE0E; 12-hour analog dial with 3 sub-dials: &quot;day of the week&quot;, &quot;month&quot; and &quot;battery&quot;, time zone label, time zone offset and daylight saving time indicator<br>&#x2714;&#xFE0E; big continuous &quot;day of the week&quot; sub-dial allows to easily determine part of the day (AM/PM periods) even on 12-hour analog dial<br>&#x2714;&#xFE0E; you can select any colour for any layout element (35 elements in interactive mode and 14 elements in ambient mode)<br>&#x2714;&#xFE0E; up to 7 editable inscriptions with customisable placement and appearance<br>&#x2714;&#xFE0E; sweep or discrete seconds hand movements in interactive mode<br>&#x2714;&#xFE0E; respects burn in protection (by proportionally scaling watch dial and elements; turnable option)<br>&#x2714;&#xFE0E; respects low-bit ambient mode (by customising layout elements colours for ambient mode)<br>&#x2714;&#xFE0E; allows to respect displays with &quot;chin&quot; (Hello, Moto)<br>&#x2714;&#xFE0E; you can share single layout or entire layouts collection<br>&#x2714;&#xFE0E; each hour mark is individually selectable from 8 different hour mark sets (may be increased in future updates), with customisable appearance<br>&#x2714;&#xFE0E; 4 switchable main hand sets (may be increased in future updates)<br>&#x2714;&#xFE0E; allows to show handheld battery level (turnable option)<br>&#x2714;&#xFE0E; companion app supports landscape screen orientation for tablets<br><br><br><b>Application permissions and additional info</b><br>For application permissions explaination and more detailed info please visit watch face web site: http://mobile.luna-78.com/raf3078.html<br><br><br>For any question regarding the application or in case of troubles please contact us by e-mail: luna.78.mobile@gmail.com",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 1,
        "4": 0,
        "5": 7
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/qKwhfqa8exYT3xpJrmFhAQd7TN62fD_OmIWInvRH3QmlGtXrHSd46UDQqCvN286ifPNt=h310",
        "//lh3.googleusercontent.com/KDrXA-8uG6XiDzhfhu1dswP9WcvXUp1Uaie1M3Zv5XRGWg6UDq77M4mJYy4glrBaCXs=h310",
        "//lh3.googleusercontent.com/E1TAbgE_ieFuAaFFZ7W7-sVSCGmx8-_-d0rwCRFEny76rZB2XYKukwZndhQj4l6pT_76=h310",
        "//lh3.googleusercontent.com/nmePDBhDOudMlXAVFp35yLuCwwERyhsujpcegrATZKQmhZY75rHnKRjSeJqcQBHchpf6=h310",
        "//lh3.googleusercontent.com/PH2iFTMAwDBrxMiFjJMia64VIM9bjB3iEyH3XsLZ7WNh15DuvX2ttUGIgTK7eNY16OU=h310",
        "//lh3.googleusercontent.com/536JNBNwjjUqU9JrVdRam5TTQwv56vcGe-kEOFJe2ZWD4d7MmjN7Q1yYhgqCYcaFfBM=h310",
        "//lh3.googleusercontent.com/QOarykXgQ1E1YQ_pcPfwHCVmVIzktFBMC4UZ4-i4nHC5w4P9opfUXRTFOotYCwdQGpM=h310",
        "//lh3.googleusercontent.com/sxzN7rzKYx5MMuEe4_-gLMTCxWc3rNoAbj-eLF-8DsTRbtUtJmZ3ZYUkK4K7P3I5MoNy=h310",
        "//lh3.googleusercontent.com/ICfMWvLcOVJ5ElXqNhgqyFThFqx65NVdcc5N0oFW52scdcs-bROaBTlxm4lDgBnaxJs=h310",
        "//lh3.googleusercontent.com/ZmbT8yGdag3Vbmlnu9Uj4Ei-APUfT_1g9kFXO-s2ZeQA7WNdLXtfCIcjYBYwdWsaWXQ=h310",
        "//lh3.googleusercontent.com/EisFwSgDgGJzWar8y3XZzkUX85wuVvxFjgYDbzC-TDkYA9XcdIYBrmqkS2BAw6lNcWBR=h310",
        "//lh3.googleusercontent.com/PJc7HTho22HslggEVkZYsYUI_u5fx7-J0w0VWPATrgfuydkrAoRuV7Miy6p12zC7LzBB=h310",
        "//lh3.googleusercontent.com/7e9NsEGDWVTgSgrJvMv9teJu7AaB4prokfiTsoiSJLy_E6J2ZZHHJbB4CBVursVbMQ=h310",
        "//lh3.googleusercontent.com/2cIjXkbZjeqx5BWsosVjLsqe_75fqWiL3E1I26FYa0loC1ugabOZ8x5xe-TWYfvpFWhb=h310",
        "//lh3.googleusercontent.com/hgZZs7PJ2FWwuOJLR4rWIRxvHdea0_rQyHDC8dpeTQTyILrygbfxkg2JIvXrMO2vTd_9=h310",
        "//lh3.googleusercontent.com/SWC1gdKfrnKwWdV8DGX2gBdTT31AcVaktF9LeBKLWdHYJGKkWklE-PUMzUXKofLK7JI=h310",
        "//lh3.googleusercontent.com/6pEwJnvXQ4LA0eUF_ijawVDPZCgWgHz1aAYnRkPpLpMMYgZOPJNMhSLHZ77zlU9SExU=h310",
        "//lh3.googleusercontent.com/tlSvMsIr0C_MtaGatcUZNKxlCUYisQlHjGsVDVzI_IfvQPeTDLK1SPPwkKnOoxOiZKc=h310",
        "//lh3.googleusercontent.com/eNxIF8ouPjeUn3UDEH8RJbqT-k4z9uoWo9OFdfakET1DB3cQZ7oKnJwYg3yYwSEEu50=h310",
        "//lh3.googleusercontent.com/8jTZOPyr0RQ2vRIPPPtTNPr408jKxU0rqS1GyfqRNSBNBceWUrdr9cV73jRWn6iWWD0=h310",
        "//lh3.googleusercontent.com/VFSzkIi1cIoizkEvnFhwsmL8aeydm3maWw9QFgVTlKEkbbw83uayYnN32BJ26ok2vQ=h310"
    ],
    "video": "https://www.youtube.com/embed/ZN1HPrtBlzg",
    "comments": [
        "Ridiculously difficult I have had this app for over 24 hours and still have to figure out how to use the presets. I'm not the brightest crayon in the box, but I usually am able to navigate my way around a new app. Not this one, so incredibly difficult.  How about some written instructions?",
        "Needs more ambient options The interface is a little confusing and I want to be able to make ambient mode look just like the lit up mode. The background in ambient mode goes black and the hand out lines are black also. If this gets changed I'll update and give five stars.",
        "Brilliant watchface! Works great out of the box, but you can customize it endlessly, 20 built-in faces, all sorts of customizations, many time zones. Very happy with it.  Yeah, you do need an Android Wear watch, BTW. Mine in the great Moto-360 (v1).",
        "Tried it on Moto360, looks really promising! Way to go, guys!",
        "well done, definitely worth the money!"
    ],
    "recentChanges": [
        "Added code to allow open shared layout files from attachements in Google Mail client. Fixed some errors."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.luna_78.wear.watch.face.raf3078&hl=en&gl=us",
    "appId": "com.luna_78.wear.watch.face.raf3078"
}