{
    "title": "Fracty Digital Watch Face",
    "summary": "Bring the prism effect in your smart watch with ultimate readable design.",
    "icon": "//lh3.googleusercontent.com/iHada1l0QFHp7SiSWZfxAZt7FAxzoBajkH-wLJ2k25msajmIGTOPROdSUm-leONtst4=w300",
    "price": "$1.03",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 4.2,
    "reviews": 6,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "May 20, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Get the beautiful prism color effect on your screen with this beautiful Fracty watchface. With beautifully designed four colored themes this watchface will highlight your smart watch like none other. Loaded with numerous options this is the kind of watch face that is developed to stay on your screen. FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:- Multiple colored themes Digital dials with day and date display Unique design with Ultimate readability  Clean and simplistic look Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?It’s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Get the beautiful prism color effect on your screen with this beautiful Fracty watchface. With beautifully designed four colored themes this watchface will highlight your smart watch like none other. Loaded with numerous options this is the kind of watch face that is developed to stay on your screen. <br><br>FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br>Key custom features:-<br><br>&#xF0EC; Multiple colored themes<br>&#xF0EC; Digital dials with day and date display<br>&#xF0EC; Unique design with Ultimate readability <br>&#xF0EC; Clean and simplistic look<br>&#xF0EC; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br>How it works?<br>It&#x2019;s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 2,
        "4": 1,
        "5": 3
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/nTyHkhCEiAcSTPtFNQzIIncKy2aYcChxFk_1mEXmhYD8s3tAkV8tv8HFiu7voyawCnU=h310",
        "//lh3.googleusercontent.com/TIy3VoxQYPAGV0Dnhz_jPYFuehYAbvQ76z9a-vRO4r1lbgBwrChMchj_kvp0aLTs0A=h310",
        "//lh3.googleusercontent.com/TucJnKqsLU7K1Esqqr0sN5PZD5zb-BsBwXeSQ0xCazqXie65Fo0YIzy6sdooBK7bxH8T=h310",
        "//lh3.googleusercontent.com/TVXmdO7fAfgEEboXGeOkM2J19WYG9VvVhCXp4NHtUdoSg2lA-bN8Sb-gjV0FnPaXTnI=h310"
    ],
    "comments": [
        "Bit unstable and needs some more customisation! It crashes a fair bit when setting the face on my watch and also the phone app occasionally, however being persistent meant I got the face to stay. Also, for the moto 360, we need an option for the white to be replaced with black! It's a cool design but not quite there yet :)",
        "A smart and clean looking watch face with a choice of colours. I would however like to be able to move the text up slightly and make the text a little bigger for those times when my eyes are tired",
        "PLEASE MOVE THE TEXT UP PLEASE I PAYED FOR THIS"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.fracty.digital.watch.face.D25&hl=en&gl=us",
    "appId": "com.frillroid.fracty.digital.watch.face.D25"
}