{
    "title": "Adventure Analog Watch Face",
    "summary": "An analog watch face with outdoor potential and customizable color.",
    "icon": "//lh3.googleusercontent.com/0ndQRerjhnrCmmT_mwImN4J1gPQVw5iS_PY-xOdmB8RiBkCi_6G56pbsjUYboKYG81gG=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 2.8,
    "reviews": 6,
    "developer": "CritterMap Software LLC",
    "developerId": "CritterMap+Software+LLC",
    "developerEmail": "support@crittermap.zendesk.com",
    "developerWebsite": "http://www.backcountrynavigator.com/",
    "developerAddress": "Camas WA 98607",
    "updated": "August 14, 2015",
    "version": "1.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Use the analog watch face at home, in the office, or in the outdoors. This watch has adventure written right on it. At least the word adventure, in all capitol letters. For actual adventure, you need to have some adventures and take the watch with you. As you can see with the screenshot, the highlight colors are customizable. This is done on the phone side configuration, that you can find through the Android Wear app. Features:*Round Watch Face for watches like the Moto 360 or LG G Watch R or LG Urbane*Square Watchface for those like the Gear Live, LG G, Sony Smartwatch 3, Asus Zenwatch *Steps for the day as measured by watch*Weather conditions including temperature, relative humidity, and condition symbol. *Day of Week*Day of Month*Battery charge as a percentage *Low power, Ambient mode for extended battery lifeThis watch tells time in analog format. As part of the adventure, you have to decide if it is am or pm, if that is applicable to your country. It has an hour and minute hand and in active mode, even has a second hand. The date is displayed including the month, day of month, and an abbreviation for the day of week. A battery symbol is available to show you the strength of your battery. Even better than knowing the strength of your battery is preserving your battery. For this, the watch face displays a simpler view in ambient mode. For some, the weather influences your enthusiasm for adventure. For this we give you a reading on the weather. It includes an estimate of the current temperature (within about two hours) in celsius or farenheit, according to your preference. You will also see a somewhat mysterious percentage. If you are the type that reads descriptions, you have read this far, and know that the percentage is relative humidity. You will see a small symbol above the temperature that tells you the general weather conditions. Some variation of sun (or moon), a degree of cloudiness, showers, rain, storm, or snow. If you are truly an adventurous type, none of these things will discourage you from going outside. We use data from OpenWeatherMap.org, so the conditions are only as accurate as that data. If you want, you can set up your own weather station to help them improve their results. Yeah, I know, that's starting to sound like work. You can hope one of your neighbors does it instead.  Using this watch face, you can track your steps taken with the watch on, turning your Android Wear watch into a rather expensive pedometer. Steps are shown with a little gauge that turns a dial from 0 to 10000 steps. It also has a number that tells you the number of steps in case you exceed the range of the dial. In all, this analog watch face for Android Wear can be your companion for all your adentures. Get it today!",
    "descriptionHTML": "Use the analog watch face at home, in the office, or in the outdoors. <br><br>This watch has adventure written right on it. At least the word adventure, in all capitol letters. For actual adventure, you need to have some adventures and take the watch with you. <br><br>As you can see with the screenshot, the highlight colors are customizable. This is done on the phone side configuration, that you can find through the Android Wear app. <br><br>Features:<br>*Round Watch Face for watches like the Moto 360 or LG G Watch R or LG Urbane<br>*Square Watchface for those like the Gear Live, LG G, Sony Smartwatch 3, Asus Zenwatch <br>*Steps for the day as measured by watch<br>*Weather conditions including temperature, relative humidity, and condition symbol. <br>*Day of Week<br>*Day of Month<br>*Battery charge as a percentage <br>*Low power, Ambient mode for extended battery life<br><br>This watch tells time in analog format. As part of the adventure, you have to decide if it is am or pm, if that is applicable to your country. It has an hour and minute hand and in active mode, even has a second hand. <br><br>The date is displayed including the month, day of month, and an abbreviation for the day of week. <br><br>A battery symbol is available to show you the strength of your battery. Even better than knowing the strength of your battery is preserving your battery. For this, the watch face displays a simpler view in ambient mode. <br><br>For some, the weather influences your enthusiasm for adventure. For this we give you a reading on the weather. It includes an estimate of the current temperature (within about two hours) in celsius or farenheit, according to your preference. You will also see a somewhat mysterious percentage. If you are the type that reads descriptions, you have read this far, and know that the percentage is relative humidity. <br><br>You will see a small symbol above the temperature that tells you the general weather conditions. Some variation of sun (or moon), a degree of cloudiness, showers, rain, storm, or snow. If you are truly an adventurous type, none of these things will discourage you from going outside. <br><br>We use data from OpenWeatherMap.org, so the conditions are only as accurate as that data. If you want, you can set up your own weather station to help them improve their results. Yeah, I know, that&apos;s starting to sound like work. You can hope one of your neighbors does it instead.  <br><br>Using this watch face, you can track your steps taken with the watch on, turning your Android Wear watch into a rather expensive pedometer. Steps are shown with a little gauge that turns a dial from 0 to 10000 steps. It also has a number that tells you the number of steps in case you exceed the range of the dial. <br><br>In all, this analog watch face for Android Wear can be your companion for all your adentures. Get it today!",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 2,
        "4": 2,
        "5": 0
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/k1vuZax6bcJubLxBWxv9l99WfyGLqh8cqbtLdKj1MY852PpOOxrdElKg7Ut2X-ANrsrk=h310",
        "//lh3.googleusercontent.com/K8_oHSUNBCuifgLu9RfGg4NFuwPn-Sb57nQyuxI-6a1Nw-jmAObLyy7l7pcFEmI0cGU=h310",
        "//lh3.googleusercontent.com/60iLSTYFzSjIqKtmcBfHb_RSunfVgR8vKQxiZHHO6M4LK08CD7OMF0FQEppuKcwPPg=h310",
        "//lh3.googleusercontent.com/_ume4yC_gXectV-VyIpPEors1HgmZyPrBmi_8MW0CePmUCBCNJYeh7MOclJSHkWVUBs=h310",
        "//lh3.googleusercontent.com/UwQCNfj2OZcxEPpWT4EBat8CuLOvKeUtNys8NsUhjaCn1WkxRfEQ8CMtUT258S9FugP7=h310",
        "//lh3.googleusercontent.com/OF5oVthKf2mqs-gx5mPfrNsMHngtwjtojQ9ioX0C1YaQ_T62loCONqlSF_Xa5f4aTg=h310"
    ],
    "comments": [
        "Initially I had some difficulty getting the app to work, but contacted Critter and they got back to me very quickly and solved my problem.  Turns out it was just something I needed to do on my end.    I think the face has a lot of potential.  It's good looking and functional.  I look forward to seeing if any additional features or customization are added, but it is very good for a new face.  Having used BCN for a long time now, and knowing how great of an app it is, I definitely recommend the face!",
        "Does not work",
        "Works but low resolution UI Quality of the UI artwork is disappointing."
    ],
    "recentChanges": [
        "New density values for Android Wear 5.1.1"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.crittermap.watchface.adventure&hl=en&gl=us",
    "appId": "com.crittermap.watchface.adventure"
}