{
    "title": "Wear Interval Timer",
    "summary": "Wear Interval Timer is the best interval timer for your Android Wear watch.",
    "icon": "//lh4.ggpht.com/IVOtysTeBjO_QthLcD2hLldGedxaRSbL5HyMly7HzHV_YyhvifCoGJM21pG8wl3UDnet=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.6,
    "reviews": 183,
    "developer": "Aeus Tech, Inc.",
    "developerId": "Aeus+Tech,+Inc.",
    "developerEmail": "info@aeustech.com",
    "developerWebsite": "http://www.aeustech.com",
    "developerAddress": "Aeus Tech, Inc.\n2nd Floor, Emmanuel Business Center,\nSen. Benigno Aquino Avenue, Diversion Road., Iloilo City",
    "updated": "July 30, 2015",
    "version": "1.0",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Wear Interval Timer is the one and only interval training timer you need for your Android Wear smartwatch.Timing workouts using smartphones is a thing of the past. The best interval timer is always with you on your wrist where you can check your progress at a glance. This is a great timer for CrossFit training, high intensity interval training (HIIT), Tabata, running, cycling, boxing, martial arts and many others.FEATURES- vibrates during transition between workout and rest, no need to check your watch- customizable timer themes to suit your every mood- customizable workout and rest duration settings- customizable number of rounds with total time calculation for entire session- progress indicator for number of rounds- pause timer during interruptions- last custom settings are stored- option to beep your phone every transitionUSAGEOn your watch:From the timer view, swipe to the left to set workout durationFrom work duration view, swipe to the left to set rest durationFrom rest duration view, swipe to the left to customize the timer's appearance by selecting a custom themeSwipe to the right to go back to previous viewsTo dismiss the app, in the timer view, swipe to the rightOn your phone:Select a custom theme and tap on buy to unlock that theme and use it in your watchCOMPATIBLE ANDROID WEAR DEVICES:Samsung Gear Live, LG G Watch, LG G Watch R, Sony Smartwatch 3, Asus ZenWatch and/or Moto 360 running Android 4.3 or higherDesigned / Developed by AEUS TECH Inc.Say hello at: info@aeustech.com",
    "descriptionHTML": "Wear Interval Timer is the one and only interval training timer you need for your Android Wear smartwatch.<br><br>Timing workouts using smartphones is a thing of the past. The best interval timer is always with you on your wrist where you can check your progress at a glance. <br><br>This is a great timer for CrossFit training, high intensity interval training (HIIT), Tabata, running, cycling, boxing, martial arts and many others.<br><br>FEATURES<br>- vibrates during transition between workout and rest, no need to check your watch<br>- customizable timer themes to suit your every mood<br>- customizable workout and rest duration settings<br>- customizable number of rounds with total time calculation for entire session<br>- progress indicator for number of rounds<br>- pause timer during interruptions<br>- last custom settings are stored<br>- option to beep your phone every transition<br><br>USAGE<br><br>On your watch:<br><br>From the timer view, swipe to the left to set workout duration<br>From work duration view, swipe to the left to set rest duration<br>From rest duration view, swipe to the left to customize the timer&apos;s appearance by selecting a custom theme<br>Swipe to the right to go back to previous views<br>To dismiss the app, in the timer view, swipe to the right<br><br>On your phone:<br><br>Select a custom theme and tap on buy to unlock that theme and use it in your watch<br><br>COMPATIBLE ANDROID WEAR DEVICES:<br>Samsung Gear Live, LG G Watch, LG G Watch R, Sony Smartwatch 3, Asus ZenWatch and/or Moto 360 running Android 4.3 or higher<br><br>Designed / Developed by AEUS TECH Inc.<br>Say hello at: info@aeustech.com",
    "histogram": {
        "1": 22,
        "2": 20,
        "3": 29,
        "4": 58,
        "5": 54
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/ilHXf-4lTTmseFJpFvgRPQHvq5nl4kpxbqHLkDgjFfuP1Upl7tlJZ0JvyfVtBVRWs7k=h310",
        "//lh6.ggpht.com/FI-pcDcZPrUfm9jdenKN4wRQYQmKhRKBzdO8u4hwa6NM5sBUc84d17HMLtEE0jKsEHE=h310",
        "//lh6.ggpht.com/uJDtnrc4GMbtWX_0wwpMwfIYLhYvAG4c-cl55PBNdHyAvYdOSgMyJOcwsC-msBRSJnHv=h310",
        "//lh3.ggpht.com/rXfNrmFRjjeHHzFQruACtnoaI6J7VGm-ixK5DdhBO5gNmHR4mU9HtQzOgdId4kQwBp9U=h310",
        "//lh6.ggpht.com/Ihb54UHU-xkQHnQfgmhL4A2OWo3DS_kqLkOe9azOIqHiGLGO5wq0pppsZs26K8hi7Yk=h310",
        "//lh5.ggpht.com/oPBxXXJy8PJVsZAAixOs8Xig_pf8x14mFJFM5W8kXsqo4-weSYEgHIC0YsQNLIaOeeY=h310",
        "//lh6.ggpht.com/nvaVs2BC10-A0RUcIjc7PhsxdCBf2N3dvsf0KvFy6daFRZ8OVStTZ5B9FmipWxdePreT=h310",
        "//lh5.ggpht.com/O_yM8UXsq_wDejlhRRFYpe1pkbzhm92FGgoV1QHsFNjYYxG7BaZ2QsPmRyXOaVsowsA=h310",
        "//lh6.ggpht.com/BZZVAJkHGMG6WlD1hE9a2O73YrvU1XnhDZYDf-ZiWP10XNoyY0S-KSTp6zJHWJ5mIQ=h310",
        "//lh4.ggpht.com/8j2PmAHVYHjz955OoYRNfQCnTo0CgEW0FzPxx3WG0Jxd8nUe78a1hkaPTQPQNYDk7YU=h310",
        "//lh5.ggpht.com/IQh0UUQOesBCyxMAg4rwgyWG0nXOVqKxcNKtym2OJ9rgRpAcbg7JObY1O5GXz3PfGQ=h310",
        "//lh5.ggpht.com/e_MzDmgQElz3q10B7-diKO0iL794O_ox7nbCLtQJZom7c1hb25tx75mAT5ADfoY40kE=h310",
        "//lh4.ggpht.com/mWIfrXuP3iP_07L2jDQuUOYhxyOk8ULU8hQMlxYmlOWqw7z1aRHkTcymrefivW9nFfk=h310",
        "//lh3.ggpht.com/0gIJkiKvafKwuUWiLyEb-qsEb73J0lzHxXRA-dJFisqA6Z7rO_eZKFIwPaw6avSz27g=h310",
        "//lh4.ggpht.com/BUWAGuM7ItXsO1TCPfUj7CGf_srgPLCMNB8-ZphXZAuebu1gZ5d5VhPipzgVreqaEdPQ=h310"
    ],
    "video": "https://www.youtube.com/embed/sPQgNTscByE",
    "comments": [
        "Nice looking but its missing an critical feature.  When doing interval training such as Sprints, there is a warm up and cool down phase.  Most other phone timers include this as part of the cycle.  It's really not usable without this.",
        "Missing key features Don't really see the user of this. Unless I'm missing something. It doesn't vibrate when intervals are over, or change color woken intervals are over so you have to keep reading the watch. The only notification odd a beep through the phone, do you might as well just use a phone app. Needs to focus more on function, not design.",
        "Simple nice app The app is very simple and useful and is exactly what I was looking for. The only thing I would change is to make the alarm customizable. It only vibrates 5 sec before the time and I need to be notified 10 sec before the lap is ending.",
        "Too little Nice look but missing too much. Can't see remaing time over 1 minute. Can't see how many reps are completed or remaining. No ringsound in my blutooth headset. No way to set a warning buzzer time.",
        "Works well It would be nice if you could hide it from the phone's app drawer. There is no need to see it there. It's just clutter.",
        "Decent enough if it's running in the foreground, but not in sync and doesn't always vibrate if the watch goes into ambient mode. What's the point of a vibrating notification if you have to keep the app in the foreground all the time for it to work properly?"
    ],
    "recentChanges": [
        "v1.0.8",
        "- Android Wear 5.1.1 compatibility updates",
        "v1.0.7",
        "- you can now say 'Ok Google, Open Interval Timer' to start the app on your watch",
        "- added support for Android 4.3 devices",
        "- fixed app crashing bug for several devices",
        "v1.0.6",
        "- support for Moto 360 and other round face Android Wear watches",
        "- fixed bug that won't let the user set the workout/rest time to 1:00, 2:00, etc.",
        "- improved companion app theme store layout",
        "Thanks for your feedback!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.aeustech.wearintervaltimer&hl=en&gl=us",
    "appId": "com.aeustech.wearintervaltimer"
}