{
    "title": "Neon Blue Watch Face",
    "summary": "Make a neon blue smart watch with this watch face design software!",
    "icon": "//lh3.googleusercontent.com/QEqSS-TTkeHaFx90jzOqWYBf-RBVvRfUEPtYBHgfmB4ie4v5Lo29zbuXuGloMWLdEsY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.8,
    "reviews": 595,
    "developer": "Thalia Photo Art Studio",
    "developerId": "7938158485537087527",
    "developerEmail": "thaliasandracorner@gmail.com",
    "updated": "January 17, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Shine bright with the help of our newest free app - Neon Blue Watch Face! We are glad to offer you the opportunity to change custom watch faces for astonishing neon blue themes. What makes this smart watch app so special is the fact that you can choose a preset skin from the watch face collection we prepared, or combine the elements according to your own taste. Wear a simple watch face or choose from the neon blue smart watch faces which will look as if they glow in the dark! Wouldn't you like the idea that you can have an elegant watch face for a while, and then a sport version of it in the matter of seconds? Thanks to this fascinating watch face maker the hands of your smart device can become all neon blue, it's up to you which style and design you will choose. Turn into the best watch face creator and express your creativity with Neon Blue Watch Face!***How to set your watch face?***● Download smart watch application to your phone! ● Find the icon and simply click on it! ● Choose among beautiful preset skins and sync to your smartwatch!● Or design your own watch face!● Choose all watch face elements separately!● Choose a background, different hand styles, markers and widget styles! ● See the preview of each element combination!● Choose what you want to be shown when your watch face is in ambient mode!  ● When you're done, sync the app with your device! ● Both round and square watch faces supported! ***Where to find the watch face you've chosen?*** ● You can either find the Android Wear application on your phone and select our watch face from the list.● Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.● Wait a few seconds for the app to synchronize, be patient!Gear up with Neon Blue Watch Face, download the app to your phone and then sync software for smart watch.***Compatibility!***Make sure that your device runs on Android Wear operative system, otherwise you won't be able to use our application. Neon Blue Watch Face is compatible with all of the latest Android Wear devices including:  Moto 360 1Moto 360 2nd genHuawei WatchAsus Zen Watch 1 ,2 & 3 LG Watch UrbaneLG Watch Urbane 2nd EditionLG Watch R™LG G WatchFossil Q FounderCasio WSD-F10Tag HeuerSony Smartwatch 3Note: On occasion it takes some time for a watch face app to synchronize with your device. In case you're having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you're enjoying our watch faces we wouldn't mind getting a positive review. Thank you for understanding, enjoy using our app!Contact us on: watchfacessupport@webelinx.comDisclaimer: Android™ is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "descriptionHTML": "Shine bright with the help of our newest free app - Neon Blue Watch Face! We are glad to offer you the opportunity to change custom watch faces for astonishing neon blue themes. What makes this smart watch app so special is the fact that you can choose a preset skin from the watch face collection we prepared, or combine the elements according to your own taste. Wear a simple watch face or choose from the neon blue smart watch faces which will look as if they glow in the dark! Wouldn&apos;t you like the idea that you can have an elegant watch face for a while, and then a sport version of it in the matter of seconds? Thanks to this fascinating watch face maker the hands of your smart device can become all neon blue, it&apos;s up to you which style and design you will choose. Turn into the best watch face creator and express your creativity with Neon Blue Watch Face!<br><br><br>***How to set your watch face?***<br><br>&#x25CF; Download smart watch application to your phone! <br>&#x25CF; Find the icon and simply click on it! <br>&#x25CF; Choose among beautiful preset skins and sync to your smartwatch!<br>&#x25CF; Or design your own watch face!<br>&#x25CF; Choose all watch face elements separately!<br>&#x25CF; Choose a background, different hand styles, markers and widget styles! <br>&#x25CF; See the preview of each element combination!<br>&#x25CF; Choose what you want to be shown when your watch face is in ambient mode!  <br>&#x25CF; When you&apos;re done, sync the app with your device! <br>&#x25CF; Both round and square watch faces supported! <br><br><br>***Where to find the watch face you&apos;ve chosen?*** <br><br>&#x25CF; You can either find the Android Wear application on your phone and select our watch face from the list.<br>&#x25CF; Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.<br>&#x25CF; Wait a few seconds for the app to synchronize, be patient!<br><br>Gear up with Neon Blue Watch Face, download the app to your phone and then sync software for smart watch.<br><br>***Compatibility!***<br><br>Make sure that your device runs on Android Wear operative system, otherwise you won&apos;t be able to use our application. Neon Blue Watch Face is compatible with all of the latest Android Wear devices including:  <br><br>Moto 360 1<br>Moto 360 2nd gen<br>Huawei Watch<br>Asus Zen Watch 1 ,2 &amp; 3 <br>LG Watch Urbane<br>LG Watch Urbane 2nd Edition<br>LG Watch R&#x2122;<br>LG G Watch<br>Fossil Q Founder<br>Casio WSD-F10<br>Tag Heuer<br>Sony Smartwatch 3<br><br>Note: <br><br>On occasion it takes some time for a watch face app to synchronize with your device. In case you&apos;re having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you&apos;re enjoying our watch faces we wouldn&apos;t mind getting a positive review. Thank you for understanding, enjoy using our app!<br><br>Contact us on: watchfacessupport@webelinx.com<br><br>Disclaimer: Android&#x2122; is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "histogram": {
        "1": 114,
        "2": 17,
        "3": 52,
        "4": 84,
        "5": 328
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/AwGWakA1hEVmsSOPB07K5McNuMEO9d1BUeRaABy-Miyl37L3eCjkqK4vhCo1bgM9FY4=h310",
        "//lh3.googleusercontent.com/97TsEe2on9xTRn5vTlcvI0B_XaJTmaKa4mQIlwvn-D-_p9cmKrkkHqABN5pTwlI9DQwV=h310",
        "//lh3.googleusercontent.com/sb3gGUmoBAfM44a3nBb4sQ7ZA4urULJy4iBWikuYbGb-qRMR6nnlcFZqeZ0E63enWtk=h310",
        "//lh3.googleusercontent.com/Af7P3hX6zUWMifDYcvfRlY2pxr2C-A0rBr2ocxmZrMmr-BxmFnhvEuEogLPZExOY5Q=h310",
        "//lh3.googleusercontent.com/WgmhGuLFvHx6Uiucc85mmrpvxgJPhcvkyzIqTW_b0_Lb0JiQxAAF6CPbZ_UOrScgkw=h310",
        "//lh3.googleusercontent.com/avO2PNrOzE8HMCSQgbPfi6jpQHDOwkIFSHgnR3aYx5RIyVedtm316LFY7s-zS3Ahpg=h310",
        "//lh3.googleusercontent.com/IorzHhuH0ntFJwL8L-dLJX8jmoHBMLXMN618XIZ5nancxgR7FGJ2tK8uLRGJahmq5ho=h310",
        "//lh3.googleusercontent.com/VDL6tQy_vggu2lV-7QrbtEfb4G2v5NTw9DG-KWH4C_SGl7pJh4f7Va8A9AJNh6vMYQ=h310",
        "//lh3.googleusercontent.com/rZgwxbZGnPurH3YkZ-y_dZchh9Wb5VcRDUdUVpNmZPh9rcywDrm_BVG5_4BnKL9nJgE=h310"
    ],
    "comments": [
        "Piece of cr@p, full of ads and junk. Not worth it.",
        "Not working",
        "Rubbish, just another marketing app with no substance. Never appeared on watch. Avoid this marketing ploy. Missed opportunity, could have been a good addition to my watch.",
        "I couldn't get it sync with my watch.  There's an ad between every switch of the screen.  Annoying and a waste of time to download.  I uninstalled it in less than 10 minutes.",
        "Just like other stated..  does not sync, just takes you to another download of a game or junk app. Not found in Android app either. Tried on LG Urbane",
        "Junk, when ever I try to sync it tries to get me to download another app"
    ],
    "recentChanges": [
        "- Minor enhancements",
        "- Performance improved"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tpas.neon.blue.watch.face&hl=en&gl=us",
    "appId": "com.tpas.neon.blue.watch.face"
}