{
    "title": "The Weather Network",
    "summary": "Local weather forecasts, storm alerts, weather radar, news and video, widgets",
    "icon": "//lh3.googleusercontent.com/rUOk030BXykFpC1cFt1TVa1UmH04HfnQN7cu4piK3QN4W4tbcabdc6xt3M6L0EdUTAM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 3.9,
    "reviews": 126881,
    "developer": "The Weather Network / MétéoMédia",
    "developerId": "8994920712470406363",
    "developerEmail": "feedbackmobile@pelmorex.com",
    "developerWebsite": "http://www.theweathernetwork.com/about-us/contact-us",
    "updated": "February 16, 2018",
    "version": "Varies with device",
    "genre": "Weather",
    "genreId": "WEATHER",
    "size": "Varies with device",
    "description": "Get your weather when it really matters™ with The Weather Network app for Android. This free app is accurate and easy-to-use, giving you the forecast at your fingertips with access to the most in-depth weather news and video. Stay ahead of storms with notifications, and watch the weather system with our satellite and weather radar maps.KEY FEATURES:• Detailed WEATHER FORECASTS including current observations and temperatures, short term (36 hours), long term (14 days) and hourly forecasts that are updated every 15 minutes to ensure accuracy and reliability• Severe weather and storm ALERTS to notify you when a storm is heading your way. See a red alert banner on the affected cities and regions and can click-through for more info (Available for Canada & U.S. locations)• Multiple MAP layers, including weather radar and satellite• PRECIPITATION START & STOP times within a 10 minute window• FOLLOW ME functionality to give you the most accurate forecast within 1 km (0.6 mi) of your current location• WIDGETS in multiple sizes so you can see the weather right from your home screen• ANDROID WEAR support with The Weather Network watch app that displays current conditions and alerts at a glance and a custom watch face that displays expected precipitation within the next hour• Discover our community’s PHOTOS & VIDEOS and upload your own to our gallery• Available in English and French, based on your device settingsTIPS:• Scroll down to access weather forecasts, news, videos and maps at a glance• Tap on the blue details button next to the current conditions to access yesterday’s high & low temperature and more details like wind speed and direction, humidity, cloud ceiling, and sunrise & sunset times• The menu icon on the top left provides access to all the content available on the app including notifications, app settings and FAQs• Add a location by tapping the city name at the top center of your screen• Tap on any of the at-a-glance cards in the main overview screen to access more details• Pull down to refresh for the most up-to-date weather dataWe’d love to hear from you! Please send feedback to feedbackapp@pelmorex.com. You can also visit our website at www.theweathernetwork.com and follow us on Facebook https://www.facebook.com/theweathernetworkCAN/ and Twitter https://twitter.com/weathernetwork The Weather Network - Your Weather When It Really Matters™.By installing this app, you agree to our Terms & Conditions and our Privacy Policy.  To learn more, visit: https://www.theweathernetwork.com/about-us/privacy-policy.",
    "descriptionHTML": "Get your weather when it really matters&#x2122; with The Weather Network app for Android. This free app is accurate and easy-to-use, giving you the forecast at your fingertips with access to the most in-depth weather news and video. Stay ahead of storms with notifications, and watch the weather system with our satellite and weather radar maps.<br><br>KEY FEATURES:<br><br>&#x2022; Detailed WEATHER FORECASTS including current observations and temperatures, short term (36 hours), long term (14 days) and hourly forecasts that are updated every 15 minutes to ensure accuracy and reliability<br><br>&#x2022; Severe weather and storm ALERTS to notify you when a storm is heading your way. See a red alert banner on the affected cities and regions and can click-through for more info (Available for Canada &amp; U.S. locations)<br><br>&#x2022; Multiple MAP layers, including weather radar and satellite<br><br>&#x2022; PRECIPITATION START &amp; STOP times within a 10 minute window<br><br>&#x2022; FOLLOW ME functionality to give you the most accurate forecast within 1 km (0.6 mi) of your current location<br><br>&#x2022; WIDGETS in multiple sizes so you can see the weather right from your home screen<br><br>&#x2022; ANDROID WEAR support with The Weather Network watch app that displays current conditions and alerts at a glance and a custom watch face that displays expected precipitation within the next hour<br><br>&#x2022; Discover our community&#x2019;s PHOTOS &amp; VIDEOS and upload your own to our gallery<br><br>&#x2022; Available in English and French, based on your device settings<br><br><br>TIPS:<br><br>&#x2022; Scroll down to access weather forecasts, news, videos and maps at a glance<br>&#x2022; Tap on the blue details button next to the current conditions to access yesterday&#x2019;s high &amp; low temperature and more details like wind speed and direction, humidity, cloud ceiling, and sunrise &amp; sunset times<br>&#x2022; The menu icon on the top left provides access to all the content available on the app including notifications, app settings and FAQs<br>&#x2022; Add a location by tapping the city name at the top center of your screen<br>&#x2022; Tap on any of the at-a-glance cards in the main overview screen to access more details<br>&#x2022; Pull down to refresh for the most up-to-date weather data<br><br>We&#x2019;d love to hear from you! Please send feedback to feedbackapp@pelmorex.com. <br><br>You can also visit our website at www.theweathernetwork.com and follow us on Facebook https://www.facebook.com/theweathernetworkCAN/ and Twitter https://twitter.com/weathernetwork <br><br>The Weather Network - Your Weather When It Really Matters&#x2122;.<br><br>By installing this app, you agree to our Terms &amp; Conditions and our Privacy Policy.  To learn more, visit: https://www.theweathernetwork.com/about-us/privacy-policy.",
    "histogram": {
        "1": 14738,
        "2": 8015,
        "3": 11287,
        "4": 34665,
        "5": 58176
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/cMifRGDXbIA9nqkh-jU46wJSTzg2k4lZbspWudBBc-kzX_deS7bnN85cpEyiPBSOs3E=h310",
        "//lh3.googleusercontent.com/c3Q7irrx0munWykUNZlTN9WlRLJ7ZcHGTlgdI9uOITNrMkJpDS7nxnCJzF30j4VvgQ=h310",
        "//lh3.googleusercontent.com/ES8B39Cb_XVStYD6rglAh2SzcvCzeS3gWnS7YIUW-hq_87j7chIYOGYuqiSI7Lgu1U5E=h310",
        "//lh3.googleusercontent.com/YIy4A4BE8ka8s28W797AX9ZhrmMgJRByL-YzgL9FMcYTCkBMTiZ0WXfuE6cax5b7rmU=h310",
        "//lh3.googleusercontent.com/XiXHK_XFchUm4QJv8pMpLVMMXbCOy7W5BzQQN5Sb_c1qM9q9r_awwuX6q-vT24Eb7bFd=h310",
        "//lh3.googleusercontent.com/LZD4oLgKGdLO8N0pHOY988gPQOj5NHgvEgdjIha3Of65dydJFxVYfK_wBgl0DNsBFpk=h310",
        "//lh3.googleusercontent.com/qHA5fyRKKbaBRxra1tTcNKVg81vxtevdDBc59dW8IY0x6YMsO2FBISvhemuxzfo6jhM2=h310",
        "//lh3.googleusercontent.com/P68AdwRxq5pKkUd1MbfC5fXBwyDlmkZRtT9WOnM59SsgjwDau2Jlne2kDC5BDlwKeQ=h310",
        "//lh3.googleusercontent.com/VgWr3brjcSZyhqsBgEGAR1OIine0KGWGA0eYLnFkkAn_Tv2yVKTV17z9ZF-5AOKSbhE=h310",
        "//lh3.googleusercontent.com/nnrvlr_ysRjAzjrKVM7ZkD0ecmnmjrs5llO1o6DSGiZ3CAIvgt4tWNZ3KIwynnSpXWM=h310",
        "//lh3.googleusercontent.com/7BbkaxOGQvg-0_8lk7T3ZJyv_bs492RNQt5w7R4KAHP8jBm6CAhRUyLiVYgNZsz-8sg=h310",
        "//lh3.googleusercontent.com/EKv0fVR6P3LD53j1dQLkqJVdCAftUXLQ1UE3S8qwfllBxh3KghZSP5ABYtyBQN0Z6g=h310",
        "//lh3.googleusercontent.com/2NtCU8WhLocexsOlq8bfqx_I3tavWOjEh2Lcgmd82-8WxTA28wzivrknuQ5FpLoV_Lc=h310",
        "//lh3.googleusercontent.com/afhYddNO7Nu_NIonEx24Siza6d2ZWVRVeB-9SG9otGTfLMmy8XlM2dkg-I6n0ukct04=h310",
        "//lh3.googleusercontent.com/WeU3mUEE7p2cmDUMJsWe30rT5djb6qsR7k-75D0tIejObSx4Ldj73Q4i5PZE3p05DQk=h310"
    ],
    "comments": [
        "It would be great if you could the hourly METAR / SPECI reports. Maybe even the Synoptic reports.   As a surface weather observer,  I would be alot more inclined to use it, if I didn't have to use this, then navigate environment Canada, when it really could just be together.   An easy 5 stars from me if this was done  Always selects wrong location   has proper permissions",
        "The app used to be a little more customizable. Now things that I had on the front page take several clicks to get to. Ui is pretty though. Edit: After the update that was supposed to improve navigation I am still disappointed with the navigation. The customizable layout that was previously used was still much more functional then the present layout. The accuracy of the app is still good.",
        "Ive been using this app for years and download it with every new phone I get.   Now with the changes, It takes longer to load often so long that I will sometimes close it before it even finishes opening because I've run out of time.    This past week i haven't been able to get it to fully load at all.",
        "So far it's not 2 bad. It did tell me it was raining outside and temp was 5 but actually it was snowing and temp was -2. Lol I think it's been corrected",
        "the fact that it has 4 widgets and none of them can provide information other than now, or in 1,2,3 hours....no information for a week forecast, or even the next 48h. just for that keeping installed is a waste of screen real estate",
        "I preferred the old format. Not sure why you guys feel the need to keep fixing things that aren't broken. Also I wish you people would realize there's more to Canada than the great lames region. EDIT: it has been about s year and it is still obnoxious."
    ],
    "recentChanges": [
        "Immersive Weather Layout - Full screen weather backgrounds with a natural look and feel",
        "Cleaner Weather Cards -  Periods are easier to read and better organized",
        "Please send us more feedback at feedbackapp@pelmorex.com."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pelmorex.WeatherEyeAndroid&hl=en&gl=us",
    "appId": "com.pelmorex.WeatherEyeAndroid"
}