{
    "title": "Where is my Train : Indian Railway & PNR Status",
    "summary": "Highest rated train app - Timetable &amp; Running status without internet - No Ads",
    "icon": "//lh3.googleusercontent.com/C9hFJJagXI83NsVzyhbwaaIsj0dGaqKzg6Uem7TgbKDoVCaQCfhQNDNWSrJvPiZDZQW3=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.7,
    "reviews": 252983,
    "developer": "🌟 Sigmoid Labs",
    "developerId": "%F0%9F%8C%9F+Sigmoid+Labs",
    "developerEmail": "feedback@whereismytrain.in",
    "developerWebsite": "https://whereismytrain.in/",
    "updated": "March 1, 2018",
    "version": "5.4.5",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "\"Where is my Train\" is a unique train app that gets live train status and up-to-date schedules from Indian Railways offline without needing Internet or GPS.  It is also packed with other useful features like quickly checking IRCTC seat availability, fares, PNR status tracking and setting destination alarms. It has a rapidly growing fan base among Indian train travelers and is the highest rated travel app in India. Thanks to all the users who made the app better every day by their feedbacks. Why this app is the highest rated train app? Spotting Train Accurately  Get live train status of Indian Railways anytime, anywhere. This feature can work without internet or GPS when you are travelling as it uses cell tower information to find the location. You can share current train location with your friends & family via the share feature. You can also set Alarm to wake you up at a fixed time before your railway station arrives.  Offine Train Schedules The train app has the complete Indian Railways and IRCTC timetable offline. You don't have to know train number or names. Smart search allows you to use train source & destination or partial train names even with spelling errors. Coach Layout and Platform numbers \tGet information on coach position and seat/berth layout before you board the train. Also shows platform numbers for boarding and intermediate stations wherever available. Seat Availability and Fares Check seat availability and fares of IRCTC. Shows seat availability and status for all coach classes for several trains simultaneously. The app covers Konkan Railway, Central Railway (CR), Northern Railway (NR), Southern Railway (SR), Eastern Railway (ER), Western Railway (WR) and all other Indian railway zones. Dynamic PNR status Check latest PNR status and predictions. You can either enter your PNR or app can automatically scan your SMS from IRCTC. You can then receive automated alerts on changes in PNR Status and train schedules. The train app also allows you to send your PNR status to your friends via the app with share feature. Super efficient in Battery, Data Usage and App size The main aspect of this app is that key features like finding train locations and schedules can work offline without Internet or GPS, and so it is very efficient both in battery as well as data usage. The app-size is also relatively small, though it has lots of Indian train information offline. Disclaimer: The app is privately maintained and does not have any affiliation whatsoever to Indian Railways or IRCTC.",
    "descriptionHTML": "&quot;Where is my Train&quot; is a unique train app that gets live train status and up-to-date schedules from Indian Railways offline without needing Internet or GPS.  It is also packed with other useful features like quickly checking IRCTC seat availability, fares, PNR status tracking and setting destination alarms. It has a rapidly growing fan base among Indian train travelers and is the <b>highest rated travel app in India</b>. Thanks to all the users who made the app better every day by their feedbacks.<br> <br><b>Why this app is the highest rated train app?</b><br> <br><b>Spotting Train Accurately</b> <br> <br>Get live train status of Indian Railways anytime, anywhere. This feature can work without internet or GPS when you are travelling as it uses cell tower information to find the location. You can share current train location with your friends &amp; family via the share feature. You can also set Alarm to wake you up at a fixed time before your railway station arrives. <br> <br><b>Offine Train Schedules</b><br> <br>The train app has the complete Indian Railways and IRCTC timetable offline. You don&apos;t have to know train number or names. Smart search allows you to use train source &amp; destination or partial train names even with spelling errors.<br> <br><b>Coach Layout and Platform numbers</b><br> \t<br>Get information on coach position and seat/berth layout before you board the train. Also shows platform numbers for boarding and intermediate stations wherever available.<br> <br><b>Seat Availability and Fares</b><br> <br>Check seat availability and fares of IRCTC. Shows seat availability and status for all coach classes for several trains simultaneously. The app covers Konkan Railway, Central Railway (CR), Northern Railway (NR), Southern Railway (SR), Eastern Railway (ER), Western Railway (WR) and all other Indian railway zones.<br> <br><b>Dynamic PNR status</b><br> <br>Check latest PNR status and predictions. You can either enter your PNR or app can automatically scan your SMS from IRCTC. You can then receive automated alerts on changes in PNR Status and train schedules. The train app also allows you to send your PNR status to your friends via the app with share feature.<br> <br><b>Super efficient in Battery, Data Usage and App size</b><br> <br>The main aspect of this app is that key features like finding train locations and schedules can work offline without Internet or GPS, and so it is very efficient both in battery as well as data usage. The app-size is also relatively small, though it has lots of Indian train information offline.<br> <br>Disclaimer: The app is privately maintained and does not have any affiliation whatsoever to Indian Railways or IRCTC.",
    "histogram": {
        "1": 3129,
        "2": 1797,
        "3": 10297,
        "4": 49259,
        "5": 188501
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/HRwhUIxYI0_fy1SOMtep_qr-ln5oVidliDMXT2itAcyRBhd5UC259_RYjUrrCd_XXA8=h310",
        "//lh3.googleusercontent.com/3OPyG5KZhzf57w1y_AAFBez2Z26cMjCH-t6NQ5L41pLCtOFv6xOfVlpFhboj0Nk0tTU=h310",
        "//lh3.googleusercontent.com/YUaKtYVOvpSD0K8KkQPqSgIuiayFJh5R8neIID-VHmr5TJQooGmraA3xVrIy_usnYGA=h310",
        "//lh3.googleusercontent.com/J1JQqqt6EPLN4UqlEB2dEJsEumZDcmc0YUAxXg6oKUyWzGlfGQVMHGBTbz_Eba0_4n58=h310",
        "//lh3.googleusercontent.com/ws5pzaab23FBEHPfKoHmTwCuXsNLF40nN8amJ7A0cJi8QZT6_kuW9ZXhqEK1BLq9rw=h310",
        "//lh3.googleusercontent.com/SNXgivHGHjhFfAvSN5RcQf6bRtkj_aba-sBO5iegxfUx9Qq0yLSU2QZ0P3OnJ-CQmTo=h310",
        "//lh3.googleusercontent.com/dUfEjA1_P1kPEQUsB6fTDY01nmW-rC9sV05yOqUNvOB_3_XwSg-HxGax57q0jVGBF0Y=h310",
        "//lh3.googleusercontent.com/eCzVGver01bcOj-fw4CDu6EY8ttHnwLHRcmgC-puWmn6onCvj3FMr2jbnd1GFLQj-5o=h310"
    ],
    "comments": [
        "I am giving 4 star because this app does not support Gujarati & Punjabi language. You could have covered entire India. Otherwise it deserves 5*s. Over all App is very good and usefull.  Must have App for a person traveling frequently like me. Previously I was using NTES but after this app I am getting my all the requirements on my finger tips. NO 1 APP IN ITS CATEGORY.",
        "Update timings in 5mins. interval. Its very useful to know the exact location of the train. Very nice and useful app.",
        "Khob valo app",
        "Nice app",
        "Absolutely amazing",
        "Good"
    ],
    "recentChanges": [
        "* You can filter the trains using the date filter",
        "* Live Station - You can see the station board in the app. Check the next 8 hours with live station.",
        "* New schedules",
        "Previous Release:",
        "* Find Trains will be blazing fast now (performance upgraded)",
        "* You can see your booked seats of pnr even from Tracking page now.",
        "* Ticket Confirmation prediction in PNR status and Seat Availability",
        "Thanks everyone for all the wonderful feedback and encouragement!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.whereismytrain.android&hl=en&gl=us",
    "appId": "com.whereismytrain.android"
}