{
    "title": "Watch Face LadyBling 840 Combo",
    "summary": "&quot;A real lady needs a serious bling watch!&quot; With animations and 840 combinations",
    "icon": "//lh4.ggpht.com/oJK1lQmUt2WWoGq8BbxcKY3Vi7yXIqOgViMKcBazrzP5bwRyZANVBUShMQdVw-vqENQ=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.4,
    "reviews": 8,
    "developer": "Scoon Design",
    "developerId": "Scoon+Design",
    "developerEmail": "scoondesign@gmail.com",
    "developerWebsite": "http://www.scoondesign.com",
    "developerAddress": "Dr. Plesmanlaan 156-160, 3601DE, Maarssen",
    "updated": "January 21, 2015",
    "version": "4.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "The LadyBling has 840 combinations that can be made by changing pieces of the watch to suit your individual taste. You can choose from romans or numbers and select different colors. Gold, silver, aquamarin, pink, diamonds, and stylish black metal. You know what you want and we make it for you.The LadyBling is hand crafted and all diamonds are positioned one by one. The piece in the middle functions as a second hand to give you that exclusive look.  You can change the styles on your mobile by going into the Android Wear app and selecting our watch face. In the settings is a menu for changings styles. It might take some time before our watch face shows up on your smart watch. All the diamonds need to get in there one by one so be patient for the bling to load. This watch is tested on Moto360 and LG Watch RoundWe need your positive rating. Please support us and we will make you more lady watches. You can find us on www.scoonwear.com for al Scoon watches. #scoonwear #moto360 #LGR #wear #watchface #watch #LadyBling",
    "descriptionHTML": "The LadyBling has 840 combinations that can be made by changing pieces of the watch to suit your individual taste. You can choose from romans or numbers and select different colors. Gold, silver, aquamarin, pink, diamonds, and stylish black metal. You know what you want and we make it for you.<br>The LadyBling is hand crafted and all diamonds are positioned one by one. The piece in the middle functions as a second hand to give you that exclusive look.  <br><br>You can change the styles on your mobile by going into the Android Wear app and selecting our watch face. In the settings is a menu for changings styles. It might take some time before our watch face shows up on your smart watch. All the diamonds need to get in there one by one so be patient for the bling to load. <br>This watch is tested on Moto360 and LG Watch Round<br><br>We need your positive rating. Please support us and we will make you more lady watches. You can find us on www.scoonwear.com for al Scoon watches. <br><br>#scoonwear #moto360 #LGR #wear #watchface #watch #LadyBling",
    "histogram": {
        "1": 2,
        "2": 0,
        "3": 1,
        "4": 3,
        "5": 2
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/NsUwQsFJU4liccnESQ2vH_seuI5qLZZas4W_pz1OXv3DUAaVccGS2E6gX3-eH18UBs8=h310",
        "//lh5.ggpht.com/gB7MpmG9q1_5gLn0l7aJs4W1mrDn4cAoaESauoGhIo5wIUiEU0ehzAyfEUS7JAyeDQJm=h310",
        "//lh3.ggpht.com/ZeEH1ZwFJX5SJ1i7L5poYe2-E-gJ7Ax1qdnIIQM3FU30Y6aclguYMA5TkSQFpi-3qzQ=h310",
        "//lh5.ggpht.com/M6AcFLa8P2m-8FpoDM9NVVJbjabLjtDDljVTZtKnm3243LcQg929IO10PTgaqW6RyEQc=h310",
        "//lh5.ggpht.com/O7zc-td38q8eNqbnkVDhXsQhbnshvicKh_bq5RFFOWxNcQZrf2iIC-mo1gVxVDSWeg=h310",
        "//lh3.ggpht.com/xU2pOByf2Acx1tIQRAeXfg418Izr7QZvUJuRAjp9WXcm6DC8c5jmcj9c1snazgeerJu1=h310",
        "//lh3.ggpht.com/JyaMRdVNY8RiZWPDAPQEic7nhVhKdBHN4MIrPITZivI7XzsBX3ICKVrE5AUuDx3gprVY=h310",
        "//lh6.ggpht.com/VZircJw_1C7BmwxqujYEgR4By20qxHbZ-LacgtC5jbQDTHLmfLjIvpIThWvqID9Mmh4m=h310"
    ],
    "video": "https://www.youtube.com/embed/RmI4N3stiSs",
    "comments": [
        "Downloaded this and it just doesn't hope and work on my huawei phone and smartwatch, waste of money, won't allow me to get a refund",
        "I love all of your watch faces! I love this watch face and I love the multitude of settings as I do on all of your watches.",
        "Love the Feminine looks of these watch faces.  You can change them to match your outfit",
        "Difficult to use.",
        "A watch for the ladies! Nice design and attention to detail by a great team.  Lots of customization options you can create so many different looks.",
        "Pretty I like it.   Would like the option to change the text on the watch face to either custom text or blank."
    ],
    "recentChanges": [
        "4.2 - added swipe indicator for accessing settings on mobile companion app.",
        "4.1 - updated to fix more watches button on about screen",
        "4.0-updated black dial date and battery windows to enhance digit visibility."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.scoonwear.ladybling&hl=en&gl=us",
    "appId": "com.scoonwear.ladybling"
}