{
    "title": "Weather Time for Wear",
    "summary": "Weather watch face and forecast for Android Wear devices.",
    "icon": "//lh3.googleusercontent.com/Jl3GlgjtafdC8_QTpL6Ex0B2-d2mlICHO86Pl83wYK-MTpXXIVSPMjU7g0Yv6SOS1Occ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 3405,
    "developer": "Anderson Solutions Inc.",
    "developerId": "Anderson+Solutions+Inc.",
    "developerEmail": "andersonsolutionsinc@gmail.com",
    "developerAddress": "11484 Wildwood Ridge Dr.\nColorado Springs, CO 80921",
    "updated": "April 8, 2017",
    "version": "Varies with device",
    "genre": "Weather",
    "genreId": "WEATHER",
    "size": "Varies with device",
    "description": "**Marshmallow Users**: To get watch face to install to watch, open the Weather Time app on your watch and accept all permissions. Also make sure all permission are accepted in the phone app (Settings->Apps->Weather Time->Permissions)**Huawei Phone Owners**: Be sure to add Weather Time as a protected app in the Battery ManagerA watch face app for your android wear smart watch that beautifully and simply displays current weather conditions along with the time and date.Supports all smart watches running Android Wear including but not limited to✔ Motorola Moto 360✔ LG G Watch, R, Urbane✔ Fossil Q Founder✔ TAG Heuer Connected✔ Huawei Watch✔ ASUS ZenWatch 1,2,3✔ Samsung Gear LIVE✔ Sony SmartWatch 3The watch face will automatically install to your android wear device after installing the companion app on your handheld device. It may take a couple minutes for it to appear on the watch due to the number of high resolution images. After the installation is complete, open the handheld app to customize the look of your watch face. Then set the Weather Time watch face on your watch.Free Features and Options✔ Analog or Digital Clock✔ 3 different weather providers to choose from✔ Weather data for current location or fixed location✔ 7 fixed background images and colors✔ Color picker to choose any background color✔ Color picker to choose any background color for ambient mode✔ Color picker to choose any foreground shadow color✔ Color picker to choose separate foreground colors for the clock, seconds, date, weather display and battery indicators✔ Color picker to choose separate ambient foreground colors for the clock, date, weather display and battery indicators✔ Display temperature in Fahrenheit or Celsius✔ Change units for wind speed (mph, kph, mps, knots, beaufort)✔ Change units for pressure (inHg, mmHg, mb)✔ 10 different clock formats (new options for seconds)✔ 11 different date formats✔ Change clock/date size✔ Change size of the seconds independent of the clock size✔ Adjust top padding of the clock✔ Option to display a black background in ambient mode to preserve watch battery life (recommended)✔ Choice between 5 fonts and 3 font styles✔ Choose between short and variable height notification cards✔ Option for translucent notification cards✔ Option to hide notification cards in ambient mode✔ 5-10 day forecast (depending on chosen weather provider)Premium Features and Options (Requires 1 time in app purchase)★ Interactive settings to open agenda, forecast, flashlight, timer, stopwatch or alarm★ Animated scrolling backgrounds★ Animated backgrounds that automatically change with weather conditions and time of day ★ Set any image on your phone as your watch background★ Random photo backgrounds★ Set how long the screen stays awake before dimming or entering ambient mode★ Background images that automatically change with the weather★ Change weather icon pack★ Set the weather refresh interval★ Option to display current phone battery level★ Option to display current watch battery level★ Option to vibrate watch on temperature change★ Option to vibrate watch on phone disconnect so you never forget your phone★ Option to vibrate watch on the hour★ Option to vibrate when watch battery is low★ Do not Disturb option to silence watch face vibrations during selected times★ Display current temp with location★ Display current temp with step count★ Display current temp with next calendar event★ Display current temp with wind, pressure, and humidity★ Display current temp with wind direction and speed★ Display high/low, short term forecast, or upcoming forecast along with current temp★ Customize look of analog clockImprovement IdeasIf you would like to request a new feature or you are experiencing any issues, use the menu options in the handheld app to troubleshoot or contact us and we will respond promptly.",
    "descriptionHTML": "**Marshmallow Users**: To get watch face to install to watch, open the Weather Time app on your watch and accept all permissions. Also make sure all permission are accepted in the phone app (Settings-&gt;Apps-&gt;Weather Time-&gt;Permissions)<br><br>**Huawei Phone Owners**: Be sure to add Weather Time as a protected app in the Battery Manager<br><br>A watch face app for your android wear smart watch that beautifully and simply displays current weather conditions along with the time and date.<br><br><b>Supports all smart watches running Android Wear including but not limited to</b><br>&#x2714; Motorola Moto 360<br>&#x2714; LG G Watch, R, Urbane<br>&#x2714; Fossil Q Founder<br>&#x2714; TAG Heuer Connected<br>&#x2714; Huawei Watch<br>&#x2714; ASUS ZenWatch 1,2,3<br>&#x2714; Samsung Gear LIVE<br>&#x2714; Sony SmartWatch 3<br><br><br>The watch face will automatically install to your android wear device after installing the companion app on your handheld device. It may take a couple minutes for it to appear on the watch due to the number of high resolution images. After the installation is complete, open the handheld app to customize the look of your watch face. Then set the Weather Time watch face on your watch.<br><br><br><b>Free Features and Options</b><br>&#x2714; Analog or Digital Clock<br>&#x2714; 3 different weather providers to choose from<br>&#x2714; Weather data for current location or fixed location<br>&#x2714; 7 fixed background images and colors<br>&#x2714; Color picker to choose any background color<br>&#x2714; Color picker to choose any background color for ambient mode<br>&#x2714; Color picker to choose any foreground shadow color<br>&#x2714; Color picker to choose separate foreground colors for the clock, seconds, date, weather display and battery indicators<br>&#x2714; Color picker to choose separate ambient foreground colors for the clock, date, weather display and battery indicators<br>&#x2714; Display temperature in Fahrenheit or Celsius<br>&#x2714; Change units for wind speed (mph, kph, mps, knots, beaufort)<br>&#x2714; Change units for pressure (inHg, mmHg, mb)<br>&#x2714; 10 different clock formats (new options for seconds)<br>&#x2714; 11 different date formats<br>&#x2714; Change clock/date size<br>&#x2714; Change size of the seconds independent of the clock size<br>&#x2714; Adjust top padding of the clock<br>&#x2714; Option to display a black background in ambient mode to preserve watch battery life (recommended)<br>&#x2714; Choice between 5 fonts and 3 font styles<br>&#x2714; Choose between short and variable height notification cards<br>&#x2714; Option for translucent notification cards<br>&#x2714; Option to hide notification cards in ambient mode<br>&#x2714; 5-10 day forecast (depending on chosen weather provider)<br><br><b>Premium Features and Options (Requires 1 time in app purchase)</b><br>&#x2605; Interactive settings to open agenda, forecast, flashlight, timer, stopwatch or alarm<br>&#x2605; Animated scrolling backgrounds<br>&#x2605; Animated backgrounds that automatically change with weather conditions and time of day <br>&#x2605; Set any image on your phone as your watch background<br>&#x2605; Random photo backgrounds<br>&#x2605; Set how long the screen stays awake before dimming or entering ambient mode<br>&#x2605; Background images that automatically change with the weather<br>&#x2605; Change weather icon pack<br>&#x2605; Set the weather refresh interval<br>&#x2605; Option to display current phone battery level<br>&#x2605; Option to display current watch battery level<br>&#x2605; Option to vibrate watch on temperature change<br>&#x2605; Option to vibrate watch on phone disconnect so you never forget your phone<br>&#x2605; Option to vibrate watch on the hour<br>&#x2605; Option to vibrate when watch battery is low<br>&#x2605; Do not Disturb option to silence watch face vibrations during selected times<br>&#x2605; Display current temp with location<br>&#x2605; Display current temp with step count<br>&#x2605; Display current temp with next calendar event<br>&#x2605; Display current temp with wind, pressure, and humidity<br>&#x2605; Display current temp with wind direction and speed<br>&#x2605; Display high/low, short term forecast, or upcoming forecast along with current temp<br>&#x2605; Customize look of analog clock<br><br><br><b>Improvement Ideas</b><br>If you would like to request a new feature or you are experiencing any issues, use the menu options in the handheld app to troubleshoot or contact us and we will respond promptly.",
    "histogram": {
        "1": 227,
        "2": 160,
        "3": 329,
        "4": 919,
        "5": 1770
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/hcAXX8Zk3HbYf8WJcAFgUtXSdPfZEdVLJzsz5gt5EgRmdOp8SUnUiklybtXmhpf0gbKw=h310",
        "//lh3.googleusercontent.com/gSlpDtzPhA4VLwfU3IJbp1u733RgZBd4XVDtkBXhMFt4BTrvSwWH1SnOZbaQiV6IpTk=h310",
        "//lh3.googleusercontent.com/UVR0XhFL2f5Dp1YGYV1R43IEOjFUYteDt_qL-oUmOTFySTA0afXDHp86weLzBALFrw=h310",
        "//lh3.googleusercontent.com/IpTrdqNvV6bwv0SYxblZAWYS4AqPOm1im0DcoUZd1qksoYwM_LFPKXOq_hc5-wlt5rM=h310",
        "//lh3.googleusercontent.com/XH9TgXkCjJL4tBVtLOj3cvd6cOAsgJh3hwwhk0E0-rGX9VznzkeBWijfKIneEPxRxms=h310",
        "//lh3.googleusercontent.com/vXsfsHlUEK3nhCfDi2lK8Ir7r6GLuXApMqJu-fkkT8C64d6OVtlfhCNE7uhaDykKglI=h310",
        "//lh3.googleusercontent.com/H93UybCOpPzFUdkdZRx9l-A2f5QEyYYCoID5nXjsFRjZmiErXvgX4qfaV5Oo6wEkgkY=h310"
    ],
    "comments": [
        "The app itself is very good, but being unable to adjust any settings on my iPhone for the app on my Fossil Q Explorer is frustrating, and very limiting. If the developers would just release this in the app store for iPhone, I'd be a much happier user. I'd love to be able to make the adjustments that android users are capable of making...",
        "Most settings are not available for free but you can still adjust the digital font's size and position to some degree. No click actions for free through. No wear 2.0 complications support. Works well on LG Urbane.  Font selection and size limited even on paid version.",
        "I have download several other watch faces to try and always come back to this one. The amount of personalization you can do is amazing. It's clean and efficient. LOVE IT!",
        "Just perfect! The ambient options are excellent! I've gotten many compliments from strangers on my watch (ambient is always on). Looks very high tech with black background and blueish/greenish digits....",
        "Free version is one of the best watch faces I've used. The extension allowing you to look at a detailed weekly forecast is also very useful. This is exactly the sort of information that belongs on the face of a smartwatch.",
        "This has been the best watch face I have found so far. Great battery life. I can assign each info display a referral and tap it and open another app I use a lot without having to go to other menus. I can also display only what I want in ambient mode without a bunch of other info. Has become my newvall time watch face."
    ],
    "recentChanges": [
        "3.5.4.1",
        "*New font choice"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.andersonsolutions.weathertime&hl=en&gl=us",
    "appId": "com.andersonsolutions.weathertime"
}