{
    "title": "Elegant Watch Face",
    "summary": "Free smart watch sync software with stylish watch faces!",
    "icon": "//lh3.googleusercontent.com/8s0V3wHfInLc9tgtPCOdDr8fyMqhIo5FvyDIxWTqnVGxdxiu554ipMzG-EX8TGNug1DA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.1,
    "reviews": 24,
    "developer": "Thalia Premium Photo Montage",
    "developerId": "7125614350471173442",
    "developerEmail": "thaliamaka@gmail.com",
    "updated": "January 24, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Define the finest watch face for your smart device using our newest free app - Elegant Watch Face! This unique smart watch sync software allows you to synchronize it with your phone and design your own minimal and elegant watch face. You are offered the option to choose ready made skins or select the widgets on your own. It is suitable for both round and square smart watches, just choose the  background and the style of elements, and make your smart watch face minimal elegant and unique. Finally there is no need to spend a great amount of money on an expensive urbane watch face. Beside being free and easy to use, this smart watch app allows you to combine the parts and design the minimal & elegant watch face according to your own taste. Having all this in mind, we have no other assignment for you but to download  Elegant Watch Face and enjoy its pleasant interface!***How to set your watch face?***● Download smart watch application to your phone! ● Find the icon and simply click on it! ● Choose among beautiful preset skins and sync to your smartwatch!● Or design your own watch face!● Choose all watch face elements separately!● Choose a background, different hand styles, markers and widget styles! ● See the preview of each element combination!● Choose what you want to be shown when your watch face is in ambient mode!  ● When you're done, sync the app with your device! ● Both round and square watch faces supported! ***Where to find the watch face you've chosen?*** ● You can either find the Android Wear application on your phone and select our watch face from the list.● Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.● Wait a few seconds for the app to synchronize, be patient!Gear up with Elegant Watch Face, download the app to your phone and then sync software for smart watch.***Compatibility!***Make sure that your device runs on Android Wear operative system, otherwise you won't be able to use our application. Elegant Watch Face is compatible with all of the latest Android Wear devices including:  Moto 360 1Moto 360 2nd genHuawei WatchAsus Zen Watch 1 ,2 & 3 LG Watch UrbaneLG Watch Urbane 2nd EditionLG Watch R™LG G WatchFossil Q FounderCasio WSD-F10Tag HeuerSony Smartwatch 3Note: On occasion it takes some time for a watch face app to synchronize with your device. In case you're having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you're enjoying our watch faces we wouldn't mind getting a positive review. Thank you for understanding, enjoy using our app!Contact us on: watchfacessupport@webelinx.comDisclaimer: Android™ is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "descriptionHTML": "Define the finest watch face for your smart device using our newest free app - Elegant Watch Face! This unique smart watch sync software allows you to synchronize it with your phone and design your own minimal and elegant watch face. You are offered the option to choose ready made skins or select the widgets on your own. It is suitable for both round and square smart watches, just choose the  background and the style of elements, and make your smart watch face minimal elegant and unique. Finally there is no need to spend a great amount of money on an expensive urbane watch face. Beside being free and easy to use, this smart watch app allows you to combine the parts and design the minimal &amp; elegant watch face according to your own taste. Having all this in mind, we have no other assignment for you but to download  Elegant Watch Face and enjoy its pleasant interface!<br><br><br>***How to set your watch face?***<br><br>&#x25CF; Download smart watch application to your phone! <br>&#x25CF; Find the icon and simply click on it! <br>&#x25CF; Choose among beautiful preset skins and sync to your smartwatch!<br>&#x25CF; Or design your own watch face!<br>&#x25CF; Choose all watch face elements separately!<br>&#x25CF; Choose a background, different hand styles, markers and widget styles! <br>&#x25CF; See the preview of each element combination!<br>&#x25CF; Choose what you want to be shown when your watch face is in ambient mode!  <br>&#x25CF; When you&apos;re done, sync the app with your device! <br>&#x25CF; Both round and square watch faces supported! <br><br><br>***Where to find the watch face you&apos;ve chosen?*** <br><br>&#x25CF; You can either find the Android Wear application on your phone and select our watch face from the list.<br>&#x25CF; Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.<br>&#x25CF; Wait a few seconds for the app to synchronize, be patient!<br><br>Gear up with Elegant Watch Face, download the app to your phone and then sync software for smart watch.<br><br>***Compatibility!***<br><br>Make sure that your device runs on Android Wear operative system, otherwise you won&apos;t be able to use our application. Elegant Watch Face is compatible with all of the latest Android Wear devices including:  <br><br>Moto 360 1<br>Moto 360 2nd gen<br>Huawei Watch<br>Asus Zen Watch 1 ,2 &amp; 3 <br>LG Watch Urbane<br>LG Watch Urbane 2nd Edition<br>LG Watch R&#x2122;<br>LG G Watch<br>Fossil Q Founder<br>Casio WSD-F10<br>Tag Heuer<br>Sony Smartwatch 3<br><br>Note: <br><br>On occasion it takes some time for a watch face app to synchronize with your device. In case you&apos;re having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you&apos;re enjoying our watch faces we wouldn&apos;t mind getting a positive review. Thank you for understanding, enjoy using our app!<br><br>Contact us on: watchfacessupport@webelinx.com<br><br>Disclaimer: Android&#x2122; is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "histogram": {
        "1": 3,
        "2": 2,
        "3": 1,
        "4": 1,
        "5": 17
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/8cQe3zUWd-9zD6OVsDvwsWC9L9YIccEUCQkwYBl5gQVtP9J8oaKGrPH0zRvuRzUUo9M=h310",
        "//lh3.googleusercontent.com/LqMlvtY2ZpdbuekRwbLz1aYhSfhIm-5SXZn4YY3x4VWF5G_AVQqBApyOAVX1s4ZUCEk=h310",
        "//lh3.googleusercontent.com/pBrkBVZkBug9mvYOWcajaFY7TsRn0V9_GIMyMQ4kuJskdQqzTefIk5QNkKKhzPPPIQ=h310",
        "//lh3.googleusercontent.com/Mg5i3y77WFqRWtttgSDdpNXsYPCX1brA4zS7Dbj8W7vCNxpIr_sTKGeP8OjGwGPTsQc=h310",
        "//lh3.googleusercontent.com/iDn75Cc6LBdhVaEgha26t0SUpFvgP14zfSUEOVxo5u15SCboSHGpCe06kX8yjak81hM=h310",
        "//lh3.googleusercontent.com/b31Io96NOPRrOZcH8Nc6TvHKvmge2i1k1CHKYmVmhaVvE4k_unlQm-m-OK24HJgZyW96=h310",
        "//lh3.googleusercontent.com/e1MXYhD3MfZJeUq5wVlYUNDoSeyZSlbSSUkf9zewkasnBXMTECHY-30T7a2_WtzmbA=h310",
        "//lh3.googleusercontent.com/u5gKGCBhGM_KwJEDEg8uw6lVVZt8HYiVH0eu_VFfMDWeXlo_dc4pzlFKFdYbHVYkng=h310",
        "//lh3.googleusercontent.com/JXQ0jcYNGGVhWTLAyxz8HpxqWry5KB6RMFKyUoVXyTYCW9DbFUclsNggVedYhBN6YrQ=h310",
        "//lh3.googleusercontent.com/JldfR6mp9nYj5nP1su2n5UqPNTiK7KfeZSUGZYxMWK21odOaeLCDN0QjfH-HC28fBpI=h310",
        "//lh3.googleusercontent.com/99zoGHOMonbUAakjNRTWZAF-1rtBZuPzzrFhuEglZnK6q66G0TaCFnfzHXi3UYPBJ6GK=h310",
        "//lh3.googleusercontent.com/uP9EZ8cHHXR3qzCTTDHaiAlh66S9-ve7Bsqs59ob2vOCsq9HjOb2QLICptmX-Fye-84=h310"
    ],
    "comments": [
        "And again a Copycat by Thalia :-( Title and texts are \"borrowed\" from other, successful watchface \"minimal and elegant\", a well designed and stuffed with tons of possibilities original. Make your decision. Will you get an original, with updates nearly every week, or will you just install a poor copy of it with less functionality?",
        "Nope",
        "فعلانظری ندارم"
    ],
    "recentChanges": [
        "- Minor enhancements",
        "- Optimized for Android Wear 2",
        "- Thank you for your feedback"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tppm.elegant.watch.face&hl=en&gl=us",
    "appId": "com.tppm.elegant.watch.face"
}