{
    "title": "Athletica WatchFace Free",
    "summary": "Minimal, black and white WatchFace with steps, sensors, sunrise and sunset times",
    "icon": "//lh3.googleusercontent.com/b5utU3ZVH-Di0bNDfMdJDOeP3Juef0UKVpJutXVCgyeutiWwYz4L92vsOIzhDiIulw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.6,
    "reviews": 39,
    "developer": "Dimitrios Kanellopoulos",
    "developerId": "Dimitrios+Kanellopoulos",
    "developerEmail": "jimmykane9@gmail.com",
    "developerWebsite": "http://dimitrioskanellopoulos.com",
    "developerAddress": "Tretjakovlaan 108\n1064 PR Amsterdam\nNetherlands",
    "updated": "July 7, 2016",
    "version": "3.3.4",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "\"Athletica is an OpenSource WatchFace designed for simplicity, efficiency and minimal battery consumption...\"\"Can easily with a tap switch and monitor most of the available sensors on your watch.\"\"Create a custom digital dashboard with just the information you need.\"Get the Pro version here: https://goo.gl/XljndF Main Features:- Black and White - An elegant style using icons powered by Font Awesome- Black on white - Invert the colors and get a new feel on your watch- Time - Choose between Am/Pm or 24h display- Date - Choose names for days and months or just numbers- Sunrise and Sunset times - If there is a location sunrise and sunset times are displayed- Daily Steps - Choose to see your daily steps- Realtime Sensor Data - See realtime data from the supported sensors- Battery Level Indicator - Icon and percentage- Interlacing - Enable interlacing for enhanced battery savings and Burn in ProtectionAdditional Features- Tap and Switch Sensor - With a simple tap on screen you can switch to the next available sensor- Average Sensor Data - Every 10 minutes get an average of 10 samples for the visible sensor (no battery cost almost), get the steps etc. - Heart Rate Alarm - Vibration alert for HR above 180bpm- Low Battery Consumption - Does nothing when inactive or in ambient. Unregisters all actions when not visible!- Ambient Mode Savings - When in ambient there is no antilaiasing and only the essential info is shown- Burn in Protection - Never worry for stuck or burned pixels when Athletica uses advanced techniques to handle that- Interlaced - Old times effect and battery saver- Day to Night mode - When it's night the colors you have chosen for day will automatically InvertSupported Sensors- HeartRate - Your HR at realtime (requires permission)- Pressure - Pressure in hPa- Pressure Altitude - Altitude in meters from pressure- Temperature - The temperature in Celsius- Light - The current light intensity in lux- Magnetic Field - The magnetic field in uT- Relative Humidity - The relative humidity in percentage- Accelerometer - The acceleration for x-axis, y-axis, z-axis in m/s^2- Google Fit Steps - How many step according to Google Fit. Tested Devices (all should be supported)- Polar M600- Motorola Moto 360- Motorola Moto 360 v2 2015- Motorola Moto 360 Sport- Sony Smartwatch 2- Sony Smartwatch 3- Huawei Watch- Asus Zenwatch - LG G Watch - LG G Watch R- LG Watch Urbane- TAG Heuer Connected- CASIO Watch WSD-F10Permissions explained- Location: For showing sunrise and sunset. The calculation needs a coarse location. Nothing is sent to nowhere.- Body Sensors: For accessing sensors such as heart rate.- Vibration: For vibrating when switching sensors- Stay Awake: It's a watch face and needs to run as a wallpaper Suggestions? Please email me at: jimmykane9@gmail.comSource on Github: https://github.com/jimmykane/Athletica/Beta: goo.gl/BPJQAH",
    "descriptionHTML": "&quot;<i>Athletica is an OpenSource WatchFace designed for simplicity, efficiency and minimal battery consumption...</i>&quot;<br>&quot;<i>Can easily with a tap switch and monitor most of the available sensors on your watch.</i>&quot;<br>&quot;<i>Create a custom digital dashboard with just the information you need.</i>&quot;<br><br><b>Get the Pro version here:</b> <u>https://goo.gl/XljndF</u><br> <br><b><u>Main Features:</u></b><br><br>- <b>Black and White</b> - An elegant style using icons powered by <i>Font Awesome</i><br>- <b>Black on white</b> - Invert the colors and get a new feel on your watch<br>- <b>Time</b> - Choose between Am/Pm or 24h display<br>- <b>Date</b> - Choose names for days and months or just numbers<br>- <b>Sunrise and Sunset times</b> - If there is a location sunrise and sunset times are displayed<br>- <b>Daily Steps</b> - Choose to see your daily steps<br>- <b>Realtime Sensor Data</b> - See realtime data from the supported sensors<br>- <b>Battery Level Indicator</b> - Icon and percentage<br>- <b>Interlacing</b> - Enable interlacing for enhanced battery savings and Burn in Protection<br><br><b><u>Additional Features</u></b><br><br>- <b>Tap and Switch Sensor</b> - With a simple tap on screen you can switch to the next available sensor<br>- <b>Average Sensor Data</b> - Every 10 minutes get an average of 10 samples for the visible sensor (no battery cost almost), get the steps etc. <br>- <b>Heart Rate Alarm</b> - Vibration alert for HR above 180bpm<br>- <b>Low Battery Consumption</b> - Does nothing when inactive or in ambient. Unregisters all actions when not visible!<br>- <b>Ambient Mode Savings</b> - When in ambient there is no antilaiasing and only the essential info is shown<br>- <b>Burn in Protection</b> - Never worry for stuck or burned pixels when Athletica uses advanced techniques to handle that<br>- <b>Interlaced</b> - Old times effect and battery saver<br>- <b>Day to Night mode</b> - When it&apos;s night the colors you have chosen for day will automatically Invert<br><br><br><b><u>Supported Sensors</u></b><br><br>- <b>HeartRate</b> - Your HR at realtime <i>(requires permission)</i><br>- <b>Pressure</b> - Pressure in hPa<br>- <b>Pressure Altitude</b> - Altitude in meters from pressure<br>- <b>Temperature</b> - The temperature in Celsius<br>- <b>Light</b> - The current light intensity in lux<br>- <b>Magnetic Field</b> - The magnetic field in uT<br>- <b>Relative Humidity</b> - The relative humidity in percentage<br>- <b>Accelerometer</b> - The acceleration for x-axis, y-axis, z-axis in m/s^2<br>- <b>Google Fit Steps</b> - How many step according to Google Fit. <br><br><b><u>Tested Devices (all should be supported)</u></b><br>- Polar M600<br>- Motorola Moto 360<br>- Motorola Moto 360 v2 2015<br>- Motorola Moto 360 Sport<br>- Sony Smartwatch 2<br>- Sony Smartwatch 3<br>- Huawei Watch<br>- Asus Zenwatch <br>- LG G Watch <br>- LG G Watch R<br>- LG Watch Urbane<br>- TAG Heuer Connected<br>- CASIO Watch WSD-F10<br><br><b><u>Permissions explained</u></b><br><br>- <u>Location</u>: For showing sunrise and sunset. The calculation needs a coarse location. Nothing is sent to nowhere.<br>- <u>Body Sensors</u>: For accessing sensors such as heart rate.<br>- <u>Vibration</u>: For vibrating when switching sensors<br>- <u>Stay Awake</u>: It&apos;s a watch face and needs to run as a wallpaper <br><br><b><u>Suggestions?</u></b><i> Please email me at: jimmykane9@gmail.com</i><br><b><u>Source on Github:</u></b> https://github.com/jimmykane/Athletica/<br><b><u>Beta:</u></b> goo.gl/BPJQAH",
    "histogram": {
        "1": 0,
        "2": 2,
        "3": 0,
        "4": 9,
        "5": 28
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/4nsdR21eH-DAmIndBYazMSOVUPDbMXOP0ZRNLxq603LTqzb0TQgduCfTCxbnQWlEKpQ=h310",
        "//lh3.googleusercontent.com/iDJyz6xuWZgoAr8uzJU9UiU-DFPsexju6QhV8j-r74yb14dUk4VYB1NY8Klh6JuGDjAq=h310",
        "//lh3.googleusercontent.com/jC2pl2u7zSJLSsoBNnBMrpXwkPDk9yfXRAQnTh4azAnBoK1EP0mSmMO46rNtWRdtfA=h310",
        "//lh3.googleusercontent.com/MGqedoON9aNuRxMfWr1dyb4czO8OJNXujdf_CWzBZCImsGEG_19cpMP9QySp9QpVvC4=h310",
        "//lh3.googleusercontent.com/An2_0rJZbxqjGYSB-C6XgFhMZkii4EsYcqKAdVSMaxq_kYez7MD3ipkr6hGlsXnTKidt=h310",
        "//lh3.googleusercontent.com/FC9JC2J1-8Gnh8Gpb_YwhOMHqeb-e9uYgD5tIW0LHOA2mnWPArqcaSKuhVu-RHm7CQ=h310",
        "//lh3.googleusercontent.com/1sC92yu92UhjntIjZ57o8jk9Kt1Wq3qSQTuas0URaGOhLM7zPNcgFhpVbPJ9-wbFogA_=h310",
        "//lh3.googleusercontent.com/X0p8GubmU6yVaVBE2Ms9xKmMaXpZRqgdBbksXzwQt06eFLg_Zd-5hxcgjqZS7xky21Nr=h310",
        "//lh3.googleusercontent.com/44v8-R0bkTeFqLwMXL-UdMskg8_y5v5cRfPIfgDsfWoEVQdRFe8DnqLYJ_ljdbI8tzs=h310",
        "//lh3.googleusercontent.com/ZqE2beUcFFZNIMwh5flwMp3mS8LpGOFkaV20tmEUPQ0AKr3zDt_4Xad7PLftN98dzA=h310",
        "//lh3.googleusercontent.com/YokooxgDswqkXalOgEkNX25oxd2Sc_EBewIwu3s0o2c3kG4FN5GTsefTMnzo9N4O4I0=h310",
        "//lh3.googleusercontent.com/F1bJ8LA68iUfb25I4N3svZo71hf974-4d36wKvO7sv7HVqWLTVuIjhsliEykfQSImQ=h310",
        "//lh3.googleusercontent.com/aKfIBJpb0Xyeo951atQZ5PrCrmGic-OBKVqBS01SBpmpM2K6_kbQRCliD1dxgQzy4Q=h310",
        "//lh3.googleusercontent.com/c1ODq5wbQTFpopMqn147HnYSwkfQCB06oo2153_VRAqgxkCdjQfJJwdOelxNa1WonkPz=h310",
        "//lh3.googleusercontent.com/nrQRATHmtlfeXS5aqO5BrzD-g5cEVEdNgJ2FL03ys51fpINHNuqNBh2kNVfmWuE1yI76=h310",
        "//lh3.googleusercontent.com/XcJ-ehm8meNDrjoBfVbai9llWS8V-AUsaus9HA5LxBz6VtFOf4PHDIe-euv57Qwt9o0=h310"
    ],
    "comments": [
        "Loved it (Problem solved) Please help, ive bought the pro version too, but nothing shows up in my phone or watch. NOTE 5 & MOTO360.",
        "Impressive. Simple watchface with good features.",
        "Phone battery Great work Dev! The only thing missing from this face is phone battery percentage - Update 6/12 thanks for responding Dev! Will buy the pro version to support your efforts",
        "Great app! Very detailed work. It is obvious that it the developer is a runner, as it covers simple things for the amateur athlete. Thanks!!",
        "Very handy It doesn't confuse you with unnecessary extras. Very smart!! Great job!",
        "Simple and easy If you want your smart watch to work as a watch plus some info from the sensors you have to install it. Ideal for office clerks that they want to keep the battery until the evening workout ;)"
    ],
    "recentChanges": [
        "v3.3.4",
        "- Antialias fixes",
        "Note: If you like what I am doing please consider buying or using one of the promo codes for the pro version. It's not about money but for a steady future in the PlayStore market.",
        "Pro Version here: https://goo.gl/XljndF",
        "-= 100 PROMO CODES for the PRO version =-",
        "Link: https://goo.gl/ocgG6g"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.dimitrioskanellopoulos.athletica&hl=en&gl=us",
    "appId": "com.dimitrioskanellopoulos.athletica"
}