{
    "title": "Watch Face - YSAR Piano Man",
    "summary": "YSAR watch faces are made to satisfy the needs of most exigent smartwatch owners",
    "icon": "//lh3.ggpht.com/sqw5i8Z2enm1otdSnjFMOA1v7m33jaBVSlphLIVD899_gf-1bgbtCB7p3PFuuPXlxlt3=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.7,
    "reviews": 26,
    "developer": "YSAR Design",
    "developerId": "YSAR+Design",
    "developerEmail": "ysarwatches@gmail.com",
    "developerWebsite": "http://ysarwatchface.com",
    "developerAddress": "City of London\nLondon, EC4V3EJ\nUnited Kingdom",
    "updated": "March 15, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Get improved version of this watch face here - https://play.google.com/store/apps/details?id=com.pianoman improvements include: - Better readability- Better compatibility with square smartwatches - Fixed bugsYSAR watch faces are specially made to satisfy the needs of most exigent smartwatch owners, who got used to wearing stylish watches. Our luxurious and elegant faces powered with battery indicator, calendar and analog time zone watch will add significant value to any android smartwatch.Custom features:-  Battery indicator-  Date-  Analog time zone watch-  Advanced and luxury design with superb readabilityOur watch faces are available in settings right after you download from store and are simple in being set up. YSAR watch faces do not require much energy, so your smartwatch will operate for almost the same period of time as usual.",
    "descriptionHTML": "Get improved version of this watch face here - https://play.google.com/store/apps/details?id=com.pianoman <br>improvements include: <br>- Better readability<br>- Better compatibility with square smartwatches <br>- Fixed bugs<br><br>YSAR watch faces are specially made to satisfy the needs of most exigent smartwatch owners, who got used to wearing stylish watches. Our luxurious and elegant faces powered with battery indicator, calendar and analog time zone watch will add significant value to any android smartwatch.<br><br>Custom features:<br><br>-  Battery indicator<br>-  Date<br>-  Analog time zone watch<br>-  Advanced and luxury design with superb readability<br><br>Our watch faces are available in settings right after you download from store and are simple in being set up. YSAR watch faces do not require much energy, so your smartwatch will operate for almost the same period of time as usual.",
    "histogram": {
        "1": 6,
        "2": 1,
        "3": 2,
        "4": 3,
        "5": 14
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/4QXiToEK8exVzY-x8Vi2dLk4dX99w6AYpu0v5JkH5aAPla8QeqplQhDFqUCe3R00IXk=h310",
        "//lh3.ggpht.com/rdJ6tj5DKoIsCAl7BQ7Pil8_2jaXRvqBZk2jg7gPwvG1k-fCPZgsJPZEagko-JNpmUU=h310",
        "//lh6.ggpht.com/ui-2GavZddqOhNlVOJ84LXK-hNO-KxYXEAj5T7UOQoJ0kNAX1veLIu7c5Jh3V91z5g=h310",
        "//lh3.ggpht.com/5vaAnpTKn8anvkrXvh-DLSl8-DQzWRKv9yitZy8nMRkQoTlEz7g7u16RRqoncOiekOld=h310",
        "//lh3.googleusercontent.com/wS3CEJ4tXBT4hszsN9-Rmo7bkllBb-_bp_p7CvxtMuAuo31yO--SZLWWF1qficJRTNw=h310",
        "//lh3.googleusercontent.com/rIHUX8V10_DGtm5nQZE7t6hzeTV-3g0Bqjtu-WEmpxIIL8R2W9nz9mLlCSRfRIXklRE=h310",
        "//lh3.googleusercontent.com/xUmn4PJGlxHV0atD4_doQfwN6VXQgant04LcqfBL-Db9XkrZEV-3TosdMAhkwlRA3w=h310"
    ],
    "comments": [
        "It's Great I have to say this watch face looks beautiful. It looks great on my LG G Watch. It's a must try. This face is crisp and clear. It's great.  If the resolution is increased somehow it'll look superb. So that's why 4 stars",
        "Nice watchface... Its a really nice watch face but its really choppy and pixelated on my moto 360...need an update to fix that other than that its really cool looking.",
        "Very elegant and stylish! Great watch face!",
        "Awesome! Great face..."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pianoMan&hl=en&gl=us",
    "appId": "com.pianoMan"
}