{
    "title": "Eixample Blue - Watch Face",
    "summary": "Turn your Android Wear into a first class looking watch (square and round shape)",
    "icon": "//lh3.ggpht.com/WftfYa-Mq_PLSzBkF6RchUHtC3iR_MdYMrm4xXP8qBAxa8GdWTou75K7uDhtEYoCFGNk=w300",
    "price": "$1.11",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.1,
    "reviews": 108,
    "developer": "OMITSIS",
    "developerId": "OMITSIS",
    "developerEmail": "android@omitsis.com",
    "developerWebsite": "http://omitsis-barcelona.com",
    "developerAddress": "Casp 162 2nd floor (Fain building), 08013 Barcelona, Spain",
    "updated": "January 8, 2015",
    "version": "2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Let your watchface look like a real watchOmitsis presents the most carefully designed watch face for Android Wear. ‘Eixample’ is the beginning of a series of watch faces created by T. Hugo, a professional watch designer based in Berlin, Germany. Eixample [əˈʃampɫə]:Inspired by this stunning quarter of Barcelona with its wide avenues, its famous grid of apartment blocks and its cosmopolitan way of life. This is the extraction of one of the most intense urban places in Europe.Tags: smartwatch, Face, wear, androidwear, watchface, watch face, smartwatchface, watch, blue, luxury, elegantCompatible watches: LG G Watch, Samsung Gear Live, Motorola 360 (Moto 360).",
    "descriptionHTML": "Let your watchface look like a real watch<br><br>Omitsis presents the most carefully designed watch face for Android Wear. &#x2018;Eixample&#x2019; is the beginning of a series of watch faces created by T. Hugo, a professional watch designer based in Berlin, Germany. <br><br>Eixample [&#x259;&#x2C8;&#x283;amp&#x26B;&#x259;]:<br>Inspired by this stunning quarter of Barcelona with its wide avenues, its famous grid of apartment blocks and its cosmopolitan way of life. <br>This is the extraction of one of the most intense urban places in Europe.<br><br>Tags: smartwatch, Face, wear, androidwear, watchface, watch face, smartwatchface, watch, blue, luxury, elegant<br><br>Compatible watches: LG G Watch, Samsung Gear Live, Motorola 360 (Moto 360).",
    "histogram": {
        "1": 6,
        "2": 5,
        "3": 12,
        "4": 35,
        "5": 50
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/dRzuNnYJRCrO94xMWm09-Fkw2yKDFbRVovtoKVeIB3lYplYon86JianboW9mO1KcqCvT=h310",
        "//lh3.ggpht.com/hQ5OkpPbLa-RNYuhXHzdlwY9FR01tCcIRdPinIOhV3N5J6YDy5Ummnp6hGEaiM25RkU=h310",
        "//lh3.ggpht.com/JEXHIOuIvxnisK3VEoxcAc7hHntcGzdfSd4umOD1gTFMhb3iTNqDvFKcYYOXnUanpw=h310"
    ],
    "video": "https://www.youtube.com/embed/KtQgcheD7tg",
    "comments": [
        "Ambient mode is awful Like many other developed do, let us device if want ambient or not.  Don't give me a great looking face that dissappears after 5 seconds.  I do t care how fast the battery drains. I've got that covered.",
        "Hate the Dimmed Mode I love the ambient mode for this watch face, but HATE the dimmed mode!  There needs to be an option to turn dimmed mode on/off.  Then 5 stars.",
        "Solid Watchface Lit up, this watchface has a surprisingly realistic look on my Sony Smartwatch 3. Interestingly enough, it doesn't look as good on my LG Watch Urbane - The colours are over saturated and cartoony. What IS sorely lacking is a day/date add on. It would take this from good to gravy.",
        "UI is pixelated With the new update, some of the UI elements are pixelated on my LG G watch. Thanks for the fix,  great work!",
        "Ambient mode a let down Nice looking watch face but I no longer use as the ambient mode looks dreadful.",
        "Nice looking but with some flaws The watch face is very beautiful and looks like a real, expensive and well-designed watch But there are some negatives I found: 1. Too quickly goes to energy saving mode, I'd like to show off my 'real' watch 2. As others reviewers mentioned, no date display, I think it could fit the design scheme without spoiling it - most of the expensive watches have it anyway 3. In the energy-saving mode, the digits are too close to the center. I understand, that they are on the same position as in the 'normal' face, but still it leaves huge empty space between the numbers and the bezel, and since this mode is used most of the time, makes the otherwise expensive looking watch, look cheap and funny 4. The orange 'minutes/seconds' ring, around the white hours ring duplicates the physical ring around the display of the LG G Watch R - there could be an option to remove it, and make the hour numbers closer to the bezel  But the biggest problem is, that the normal watch face doesn't use the whole display, there are around 10 pixels in each direction, that the face doesn't use ?!?  LG G Watch R here"
    ],
    "recentChanges": [
        "Issues with textures solved"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.omitsis.eixample&hl=en&gl=us",
    "appId": "com.omitsis.eixample"
}