{
    "title": "Blue Carbon Analog Watch Face",
    "summary": "Simple and refined analog watch face with a blue metallic glow.",
    "icon": "//lh3.googleusercontent.com/9dYeOHYrOKxqpiatTlyYXRJZpnQ29lC2ZGc504F4Wc0VZqnl-WRB6hxmGr2mkHjGIeA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 150,
    "developer": "CritterMap Software LLC",
    "developerId": "CritterMap+Software+LLC",
    "developerEmail": "support@critttermap.zendesk.com",
    "developerWebsite": "http://www.backcountrynavigator.com/",
    "developerAddress": "Camas WA 98607",
    "updated": "April 23, 2015",
    "version": "1.3",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "This watch face will give you at least one of the things you expect from a watch face: the time. The time is offered in both analog and digital formats. It includes the month and day of month for greater precision about the moment in which you are standing. To see how much time you have before your watch can no longer tell time without being charged, it also features the battery life as a percentage of full. To preserve that battery life, we have a simpler design in ambient mode that gives you the essential information without wasting precious pixels or drops of battery life. This works on both round and square screens. Do you prefer round screens or square screens for your Android Wear watch? Make that decision when you buy your watch, and this watch face will work on either. Blue Carbon was named for the tint of blue you will discover in the inner rim, and for the carbon that is contained in steel that would be in the dial and hands if they weren't just made from pixels. Looking for a way to reduce your carbon footprint?Well, this watch face won't make any difference. We have no affiliation with the blue carbon project that attempts to offset carbon emissions through oceanic vegetation. Enjoy the metallic glow of your Blue Carbon watch face today.",
    "descriptionHTML": "This watch face will give you at least one of the things you expect from a watch face: the time. <br><br>The time is offered in both analog and digital formats. <br>It includes the month and day of month for greater precision about the moment in which you are standing. <br><br>To see how much time you have before your watch can no longer tell time without being charged, it also features the battery life as a percentage of full. <br><br>To preserve that battery life, we have a simpler design in ambient mode that gives you the essential information without wasting precious pixels or drops of battery life. <br><br>This works on both round and square screens. Do you prefer round screens or square screens for your Android Wear watch? Make that decision when you buy your watch, and this watch face will work on either. <br><br>Blue Carbon was named for the tint of blue you will discover in the inner rim, and for the carbon that is contained in steel that would be in the dial and hands if they weren&apos;t just made from pixels. <br><br>Looking for a way to reduce your carbon footprint?<br>Well, this watch face won&apos;t make any difference. We have no affiliation with the blue carbon project that attempts to offset carbon emissions through oceanic vegetation. <br><br>Enjoy the metallic glow of your Blue Carbon watch face today.",
    "histogram": {
        "1": 12,
        "2": 3,
        "3": 17,
        "4": 30,
        "5": 88
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/LKVTQmv37L29eTficnWJJ-IPUf6P5AQgnDGhGDqfU9bc_vzZeYcbul00IBPxxVsfe6o=h310",
        "//lh3.googleusercontent.com/iSai92QtofnEBz8n_5S9965mOqmuoKwr-HbXRsoS6Nd69adUyOE9fkHP8b2p4yCLnmQ=h310",
        "//lh3.googleusercontent.com/jA9AMAdQBUszAAUCUIF-aJN9t8fXWDQGWwvCtbKdoMt7BZg8I0EmXWq59VdsQmELR4yb=h310",
        "//lh3.googleusercontent.com/QH9RzehFcYwDE_myuoKKjp1W1ZX_tTGhRa_Ovu5DjTcp4_SuxLO-Pu46PQZ4sef2PA=h310",
        "//lh3.googleusercontent.com/sfNYS_c3omHta-xi1nir6P84TtQgJaEZ4-_ku5IUvUoPH3796PnXBuwTMrCGGXaBWk3_=h310",
        "//lh3.googleusercontent.com/e5Ul7Fw3W4Aq_zgmroO_N881tqQGlAMDKksx-Y6rVOuyS81eSVKYszFJpbnEBkg2ALM=h310",
        "//lh3.googleusercontent.com/cV33vexYj-mFwEB7joLiC0IXSx_4AUTMgKHZEm5-RqG9RTTrzdUb-9te-FwqF9wtjf0=h310",
        "//lh3.googleusercontent.com/aOyzOVEj3DE4PSYeXSu-w2wNN_LPnhO5GyDkp77JDjFfJRDphwJGALemGxBzo2ZMFg=h310",
        "//lh3.googleusercontent.com/9qtTA7sw3kQ7OqAbnn1K3HsJX-1c5V1qPSO0YP3OO_0py4r7K9euI9cqFL0BCrZk4Ss=h310",
        "//lh3.googleusercontent.com/3vODDH581c4y9kGEJnlG31GI8oOR0dhZ-8z-rcVGvNB_pwB8TrVEwm2EvwTCG8LzWpY=h310",
        "//lh3.googleusercontent.com/N_prxxZIhNWnAbH6DazuhVvEXS5g_xsiUwzzH-g1GrYxdJc3-YOJVkrYWZ7l4Ob3Ow=h310",
        "//lh3.googleusercontent.com/UkUBSqQhxdPjGgUbGX3HHxRgf9VeZqePVZShnpB1-MEBWqSsyQBoyhLVlo-bDnvFZpw=h310"
    ],
    "comments": [
        "Good, but low visibility when ambient Nice bold style, but ambient display makes hands look too hollow, decreasing their visibility.",
        "Nice My favourite watch faces hope need a big size of digital clock and put it on top",
        "ممنون خیلی عالی است",
        "Need better low bit ambient mode on Zenwatch 2",
        "خوبه بدک نیست",
        "Hydrocarbon. زیبابودممنون."
    ],
    "recentChanges": [
        "Smoother watch hands",
        "Patch for issue with Moto 360."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.crittermap.watchface.bluecarbon&hl=en&gl=us",
    "appId": "com.crittermap.watchface.bluecarbon"
}