{
    "title": "Glow by Stephanie Carls",
    "summary": "Snap a photo and design your own personalized watch face to match your outfit!",
    "icon": "//lh3.googleusercontent.com/dz7gfEyYSxSCiLDoP9LU02o1L58psKgxajltSm56SxwK_NPui2D2k293TjYJSM6KGkM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.2,
    "reviews": 55,
    "developer": "Hyperflow Labs",
    "developerId": "4917639793357291896",
    "developerEmail": "support@hyperflowstudios.com",
    "developerWebsite": "http://www.hyperflowstudios.com",
    "developerAddress": "213 Emerillon Ridge\nOttawa, ON\nK4A 0R5",
    "updated": "August 12, 2016",
    "version": "1.0.62",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Glow - A Watch Face by Stephanie CarlsGlow is a bold digital watch face created exclusively for Android Wear and designed by Stephanie Carls of My Savvy Live. Stephanie Carls is an Android Wear enthusiast and features the latest in tech on her YouTube channel, My Savvy Life. This weekly series focuses on consumer tech trends and helping technology work for you. Her creativity in videos has landed features in The New York Times, NBC News and Huffington Post.Glow Overview:Change the color of your watch face at any time to match your outfit. Snap a photo, choose your colors and create a custom watch face. Glow let’s you tap into your own creativity by designing a personalized look. Glow Features:- Take a photo of your outfit- The Glow app will select multiple colors from your outfit for you- Select 2 colors and create a custom watch face background gradient that matches your outfit- Change the watch face text to light or dark- The custom watch face is applied to your watch instantly - The watch face displays time as text as well as the current dateGlow is designed for both round and square Android Wear watches.",
    "descriptionHTML": "Glow - A Watch Face by Stephanie Carls<br><br>Glow is a bold digital watch face created exclusively for Android Wear and designed by Stephanie Carls of My Savvy Live. <br><br>Stephanie Carls is an Android Wear enthusiast and features the latest in tech on her YouTube channel, My Savvy Life. This weekly series focuses on consumer tech trends and helping technology work for you. Her creativity in videos has landed features in The New York Times, NBC News and Huffington Post.<br><br>Glow Overview:<br>Change the color of your watch face at any time to match your outfit. Snap a photo, choose your colors and create a custom watch face. Glow let&#x2019;s you tap into your own creativity by designing a personalized look. <br><br>Glow Features:<br>- Take a photo of your outfit<br>- The Glow app will select multiple colors from your outfit for you<br>- Select 2 colors and create a custom watch face background gradient that matches your outfit<br>- Change the watch face text to light or dark<br>- The custom watch face is applied to your watch instantly <br>- The watch face displays time as text as well as the current date<br><br>Glow is designed for both round and square Android Wear watches.",
    "histogram": {
        "1": 5,
        "2": 1,
        "3": 5,
        "4": 9,
        "5": 35
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/RYBkgouYA4EYP_6twwTpj6T6CfLagHKxc5sqIVkvf4ehPcgs1Pwd0Oyt0AUUpOPv1gk=h310",
        "//lh3.googleusercontent.com/6wUwZWLl2hOhwimf7RLwWceslfkJURqtkzLYiP9M7gI9uWCBF_ctHB6Syo8M9qWz8vCm=h310",
        "//lh3.googleusercontent.com/MY0zx0tBKphpWxofWcGNa6Eg6__R_LCkUXRq0m70Ohd6hHMJ4pThW9y8O52IFAGaFFM=h310",
        "//lh3.googleusercontent.com/P_YSwTPu2QR4ayzcGdwusU6eM0WkNXbuJcMoWpkfzvX1ypFMwclerN5pqYGq2oS1tN2o=h310",
        "//lh3.googleusercontent.com/yjRXgdgDQ2Fv8qrFe4dDJi1Z6-EYZE1ZSBRXf_V9urE-hXtTOwxoKJ5W3y0wZL1BUgo=h310",
        "//lh3.googleusercontent.com/cXAFtkMKfN4FLkk9xH8_PyFO885DiJGsfQUxiiaj9ENNH88rD5WyVOQa8wgKKCaw0Fk=h310",
        "//lh3.googleusercontent.com/yoNgiyPjKVEd_TXOKpPqRkiHb8nguZ4vDQz79cyKqkb1ugJbnJSt-XPQDuXVBaB3CeE=h310",
        "//lh3.googleusercontent.com/jYHTrT6VDdtGAnqYGEWMHVCw_jcaZma3F7XXTcIcrzGUi_anY7D5GVgYvsIF34la8ew=h310",
        "//lh3.googleusercontent.com/XnWcb6Ucq_usDYeCUfw2CQdESoMKHIhlTCd7dlE__CQ0WX9Ez142-LY3qAhEujwVjN63=h310",
        "//lh3.googleusercontent.com/ubzhaly8qsrrzVtdULvsr5cPCIglHVSQIi7dokM52zYrIVMakJc7mrE7ActXD91wuuM=h310",
        "//lh3.googleusercontent.com/Rqhz5xWSgeaPUlAxXHXGzjKoRYs0sC7rrfDfOfwxAJN_y9sHf-Ox8rAp5cqntVGR5zA=h310",
        "//lh3.googleusercontent.com/zl6jtz8DisI2ek0ZD3E3n9Ws94CTxuQAZCfE_d0GQs-Twy-lrhb6NCPqXoOzY-UiiF0=h310",
        "//lh3.googleusercontent.com/sv9eo2pXnWcGGYdrEW3kEwCSpnYEsT18VUPewBkIG2pZnnwrAXoIdcjbh078PSdxtA=h310",
        "//lh3.googleusercontent.com/wqa-DZxRAvdme0KllBPrcbxFrbPUQ92rb3kVqQ50zNIZyj3PXWLOELPInO_DK2wvq2k=h310",
        "//lh3.googleusercontent.com/kmGsnWmo7JvSt7QxeW0-ywQYrRJK0H7UAwrN9kli74qkj1I-TJii0pM_ccn8KNmQGCc7=h310",
        "//lh3.googleusercontent.com/OqqNEbEl9vVZ5jMxhqk3Va-imvQyBx5Q23_M_-TtMiFcC8BMlt-WGR3A0dKGhor7aoc7=h310"
    ],
    "video": "https://www.youtube.com/embed/4bFoIreDORw",
    "comments": [
        "This is a better watch face in similar series. Please improve with some more features.  1. Option to make the seconds mark to either tick or sweep 2. Remove \"ZERO\" comes in the middle. For ex. 10:05 shows as TEN ZERO FIVE. At least make this in settings so that people still need to see ZERO can enable in settings. 3. There was no black background in the available backgrounds. When I take a photo of a dark / black color, it throws an error. So I had to go for black with some other color combination. Please fix this.  Thank you.",
        "How about paid version? Love, love, love app but MULTIPLE LONGGGG VIDEO ads in between trying out various colors in one use = SUPER annoying, time consuming & loud. ZERO interest in COERCION to watch vids or add apps. Esp when changing watch faces in quiet setting. Plz consider! SGNote5 on VZW",
        "Awesome app. I love gradient backgrounds and now I can easily change it daily and have it match my clothes.  It would be nice if there was a bit more customization though. A digital clock option would be awesome because if you have a watch notification, the third line of the time is cut off. Other than that I think the app is great!",
        "Brilliant design Could you add the option to change the seconds circle to black when the text colour is changed to black? Thank you. Crashes every time I take a picture for a background colour.",
        "Love this app but the adverts are so annoying. I don't want to watch a 5 min video about something I don't care for when all I want to do is change my watch screen. Very disappointing aspect to a really lovely app",
        "seems broken after the latest update from android wear, tried uninstalling, reinstalling, factory reset the moto 360 and the app refuses to pick up the watch, i am thinking it needs an update"
    ],
    "recentChanges": [
        "Minor Updates"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.hyperflow.stephcarlswatchface&hl=en&gl=us",
    "appId": "com.hyperflow.stephcarlswatchface"
}