{
    "title": "Wear Dark Elegance Watch",
    "summary": "Premium watch face! Works with the new Android Wear Lollipop!",
    "icon": "//lh5.ggpht.com/TKBO0yJXqxT-NsSLGOF0fn3nJlo4776uUF5gnLiSVsTGmNlNeLkCJqA_HzI_Y_fJyb0q=w300",
    "price": "$1.05",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 3.7,
    "reviews": 24,
    "developer": "Daragon Technology",
    "developerId": "Daragon+Technology",
    "developerEmail": "android.support@curlball.co",
    "developerWebsite": "http://curlball.co",
    "developerAddress": "2301-1625 blvd de Maisonneuve, Montreal, QC, Canada, H3H 2N4",
    "updated": "January 7, 2015",
    "version": "1.1",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Enjoy this premium Dark Elegance watch face crafted by hand!Features:- Premium watch designed for you- Date and day of week shown- Professional and authenticOnly from Curlball Co.https://www.facebook.com/CurlballCo",
    "descriptionHTML": "Enjoy this premium Dark Elegance watch face crafted by hand!<br><br>Features:<br>- Premium watch designed for you<br>- Date and day of week shown<br>- Professional and authentic<br><br>Only from Curlball Co.<br>https://www.facebook.com/CurlballCo",
    "histogram": {
        "1": 3,
        "2": 3,
        "3": 3,
        "4": 5,
        "5": 10
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh4.ggpht.com/npSCHV6OP6UYcg61SJbw4lrd5DehooutBYp7t7Iz1LaWwbHGr1Cm56B9ZH8uxFc2Bg=h310",
        "//lh3.ggpht.com/yQfXjmxEm5YS2uin5xJ7bgnR-yE4bzPfWMgCAwn5zM8W-43hRH0Mgw50c3F2yWzHEKY=h310"
    ],
    "comments": [
        "Latest Version Broken Loved this face but latest update completely brakes it on LG R. Mailed dev 1 week ago and no reply or fix. Face launches and then crashes and gets replaced by a stock face. All my other faces work fine.  The bottom small dial also was always missing hands. Not very good service for a paid face.",
        "Watchface crashes (unusable) (Edit: I've been waiting on a nonexistent miracle. Dev has stopped supporting this watchface so it no longer works. Watchface is now unusable) I'm not one to buy apps but I just couldn't resist with this watch face. It truly is beautiful and simplistically amazing! Only change I would make is to update so the flat tire isn't as obvious like the special version of this watch face. Regardless 5-starts and thanks for the awesome watch face! (:",
        "Fix please Great and cool looking but broken on Urbane",
        "Sleep mode crash",
        "Best watchface from a technical standpoint. The face alone looks great. What im most impressed with, is the fact that this dev, nailed the performance issues that other developers have not figured out. No lag or changing of colors at all when the watch awakes from sleep. Keep up the good work and please make more watch faces! Im gonna buy all of your faces,  even the pink one for breast cancer month. :)",
        "Great The only watch face I saw that I'd pay for. The rest don't have the same simple style, so many over-do the options. Simple and elegant."
    ],
    "recentChanges": [
        "Added support for Android Wear Lollipop and Watch Face API"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.curlballco.darkelegance&hl=en&gl=us",
    "appId": "com.curlballco.darkelegance"
}