{
    "title": "Skinny Love Watch Face",
    "summary": "C&#39;mon skinny love just download this watch face!",
    "icon": "//lh6.ggpht.com/GopF5W_MIeEPMUOamyX_zs_VRG0AKaX1JnQGpIJMKWpXmeJCOsXNfB1yv_FswtSRaX4=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.1,
    "reviews": 110,
    "developer": "Shameron Studios",
    "developerId": "Shameron+Studios",
    "developerEmail": "cameron@shameronstudios.com",
    "developerWebsite": "http://www.shameronstudios.com",
    "developerAddress": "PO Box 1837\nTHOUSAND OAKS CA 91358",
    "updated": "July 12, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "This beautiful watch face features the time, date and day artfully displayed for any android wear device.  Show off your creative side with this unique clock. A ring of dots indicate the seconds while the hours and minutes are written out digitally. Now there are multiple watch faces! Holocene was specially designed for square watches and For Emma for round watches. As well as the classic Skinny Love Watch Face.This app has both light and dark versions for whatever atmosphere you're in at any time. If you're having trouble getting your watch face onto your Android Wear device, follow these instructions: http://apps.shameronstudios.com/how-to-setup-an-android-wear-watch-face/",
    "descriptionHTML": "This beautiful watch face features the time, date and day artfully displayed for any android wear device.  Show off your creative side with this unique clock. A ring of dots indicate the seconds while the hours and minutes are written out digitally. <br><br>Now there are multiple watch faces! Holocene was specially designed for square watches and For Emma for round watches. As well as the classic Skinny Love Watch Face.<br><br>This app has both light and dark versions for whatever atmosphere you&apos;re in at any time. <br><br>If you&apos;re having trouble getting your watch face onto your Android Wear device, follow these instructions: http://apps.shameronstudios.com/how-to-setup-an-android-wear-watch-face/",
    "histogram": {
        "1": 9,
        "2": 4,
        "3": 10,
        "4": 30,
        "5": 57
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/ANozZf8iTlGLrRAMp8UN8LDbkh6Tk378MaPZJx76w_guw5vL_McKDpsWdfChVadeudE=h310",
        "//lh3.googleusercontent.com/136_5FaCdjivnhOoHoHmPtVlvs3O55mDhAMbNJv_A9l8D0dV2XuPOq3B6EmOpdwDLyWU=h310",
        "//lh3.googleusercontent.com/Q5_5KzFsyT0FFht7MV3hzBZyCRR_WS5k2RC_dkoTbTngxb51Lk0XFNhJkYW_eLVy1Q=h310",
        "//lh4.ggpht.com/omso9ym0wdSIozRPo9ZQb4YQDPJE4HWD3oSDDL7xu9sus3Jd1w-FJENYNPp7aLFb-KKr=h310",
        "//lh4.ggpht.com/nRqkRmK_obiRZQQzrZyq6-SGXOmOloWLgPOlHzlnstWi-csdMnrqV3k8b5g7o8l1Wmm1=h310",
        "//lh6.ggpht.com/urw24lJZO7vsvRGCev_hc5QdbrcvH5ZUZBqIIFJZdYojGaHIaKjqZmZ6vdMKiGbKiow=h310",
        "//lh3.googleusercontent.com/4SaOt6tIDO_1Tnz58vFj0U64c0DFxP3s_8BbhbF8_x7DjTMkHPiwh6snZa7lrpK0NUk=h310",
        "//lh3.googleusercontent.com/nMi4B9BmZEcJlekSWmmAnctKAs4xU7NzGifHtH53koRYi6ClKS8y-SqNr462STP1BCEV=h310"
    ],
    "comments": [
        "Super Cute watch face! I love it!",
        "Absolutely love it!!! Crossing for my fingers for more background colors in the future :)",
        "Love the design, but would like a \"second hand\" on the square version",
        "Very cute! Love it with the black design",
        "Lovely designs",
        "Less is marvelous Simple and fun. This watch face has been tempting me for awhile. Finally, downloaded and am in love. Holocene isn't my favorite as it looks wonky on my round watch which is too bad... So cute.  Skinny Love and For Emma look great!"
    ],
    "recentChanges": [
        "v3.0 - Colors! Select colors from our list for all three watch faces.",
        "v2.3 - New configuration picker on the watch. Allows you to select all possible configurations directly on the watch. Also, adds support for Android Wear 2.0",
        "Removed unnecessary permissions and added better defaults.",
        "Added a new date format and language support.",
        "24 Hour mode is now supported! Check the configuration options in the Android Wear app on your phone to change it."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.shameronstudios.arrowwatch&hl=en&gl=us",
    "appId": "com.shameronstudios.arrowwatch"
}