{
    "title": "Elegant Watch Face - Moto 360",
    "summary": "FR-D01 is an Elegant &amp; Clean Digital Wear Watchface With Amazing Readability.",
    "icon": "//lh6.ggpht.com/H2JJj2zrnaerhsI4M_c97NI73CgVbniF_fAL87rjm2XdfMujDllKr_d_rQ0IperuWxk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4,
    "reviews": 1068,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "April 8, 2015",
    "version": "3.4",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Model Number: FR-D01Modern Classics Watchface truly a Marvellous glimpse for your Smart Watch.This watch face is elegant and classic combined with modern functions of Android Wear.Key custom features:-• Ultimate readability• Clean and simplistic look • Date information• Accurate Time info• Remaining battery life of your device so you exactly know when to chargeThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watchface collection for Android Wear on website www.frilldroid.com.How it works?It’s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen.",
    "descriptionHTML": "<b>Model Number: FR-D01<br><br>Modern Classics Watchface truly a Marvellous glimpse for your Smart Watch.</b><br><br>This watch face is elegant and classic combined with modern functions of Android Wear.<br><br><b>Key custom features:-</b><br>&#x2022; Ultimate readability<br>&#x2022; Clean and simplistic look <br>&#x2022; Date information<br>&#x2022; Accurate Time info<br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br><br>Visit our exclusive Watchface collection for <b>Android</b> Wear on website <b>www.frilldroid.com.</b><br><br><b>How it works?</b><br>It&#x2019;s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen.",
    "histogram": {
        "1": 105,
        "2": 45,
        "3": 137,
        "4": 226,
        "5": 555
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/nlQvRyhXEZ6MavpNWKjvP6RMAQKCAuuPXZT10mZQJ8anCr9zd7XiPR18yKPv3D5E07k=h310",
        "//lh6.ggpht.com/NYdub_ML52_EpzNDgXdu_PrkZ_zADJ-YD_lGoWDtL1QtA_epH8P72Juvp6ZUiCDa6jA=h310",
        "//lh4.ggpht.com/QGRoggcpWh9MEFKR11awVZynNRfPxB3Rp5RceyIMckvL2gvRTm3OjKYQdEfV3w32uSY=h310"
    ],
    "comments": [
        "Ambient mode mixing minute numbers Using on LG G Watch R. When in ambient mode, the minute numbers do not change, but are simply shown one over the other, so after a few minutes you can not tell the time. The face is amazing, so I am waiting for an update to fix this. Then it definitely will be a five star app.",
        "Nice but needs more customization This is a really nice watch face but it seriously needs more customization options. I don't like the date format as being Tuesday 22nd March so I want to be able to change that. Also more background & font options should be included. Make this happen & I will give a higher rating",
        "Great display. The battery % and date info are too small. The 3 tap enlarge feature doesn't always work and I need use a magnifying glass to see the charge % and the date info. Fix the 3 tap recognition problem. Then I'll give you 5 stars. Thanks Lawrence R.",
        "Nice face but... The problem is that as the time updates it writes over the top instead of replacing the number.  So I see two numbers in the same place.  Not good.  Update this and I'll use it.  This happens on the battery saver screen, not the live screen.  LG Urbane",
        "On my phone but not my watch.  How to make go to connected moto360.  It just sits on my phone.  Android wear can't see it.",
        "Can't see it on Moto360 I'm using the HTC M8 & Moto360, both updated to lollipop. When I download the watch face, I open it on my phone but there is no button to send it to the watch, so I assume it would already be there. I check on my watch and nothing."
    ],
    "recentChanges": [
        "Now compatible for all devices",
        "Fixed UI Bugs"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.andpercent.apps.digitalwatch&hl=en&gl=us",
    "appId": "com.andpercent.apps.digitalwatch"
}