{
    "title": "Weather Watch Face - Moto 360",
    "summary": "Have a look at the first edition of Moto 360 Weather Watchface FR-A07",
    "icon": "//lh6.ggpht.com/zaeEjVLsLEuuV77cOWdLoE65VMtCXggYeNv_TSzXHrONEodzyJ1GnHlYfdVadFy3WA=w300",
    "price": "$1.04",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 3.5,
    "reviews": 25,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "January 14, 2015",
    "version": "1.9",
    "genre": "Weather",
    "genreId": "WEATHER",
    "description": "Model Number: FR-A07Have a look at the first edition of Moto 360 Weather Watchface FR-A07If you are a fan of a Classic and Elegant Analogue watchface. Then this is the right app for you. Introducing FR-A07 Charcoal Black with Weather Updates. This watchface is designed keeping in mind the classic look your smart watch needs. It provides you weather updates of today, tomorrow and day after tomorrow in Fahrenheit and Celsius. Now you don't have take out your phone, or switch to any other app to see the weather updates, now its right on your phone with amazing readability and classic design.• Weather Updates and Forecast• Weather Units Choice• Battery Status• Customized for Round & Square Watches• Classic look• Amazing ReadabilityGet this app now and provide us your feedback :)",
    "descriptionHTML": "<b><br>Model Number: FR-A07<br><br>Have a look at the first edition of Moto 360 Weather Watchface FR-A07</b><br><br>If you are a fan of a Classic and Elegant Analogue watchface. Then this is the right app for you. Introducing FR-A07 Charcoal Black with <b>Weather Updates</b>. This watchface is designed keeping in mind the classic look your smart watch needs. It provides you weather updates of today, tomorrow and day after tomorrow in Fahrenheit and Celsius. <br><br>Now you don&apos;t have take out your phone, or switch to any other app to see the weather updates, now its right on your phone with amazing readability and classic design.<br><br>&#x2022; Weather Updates and Forecast<br>&#x2022; Weather Units Choice<br>&#x2022; Battery Status<br>&#x2022; Customized for Round &amp; Square Watches<br>&#x2022; Classic look<br>&#x2022; Amazing Readability<br><br>Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 5,
        "2": 2,
        "3": 1,
        "4": 9,
        "5": 8
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/dlScJOcV2xQw-9ElGt13nUqQrMX9m5kNoq3fSp4wuTOCkJivh-kyPGwIS_tCAFc6Kg=h310",
        "//lh5.ggpht.com/tEbXgn546DGQeUAN7_N3xhBhyB7s19LXytrgjQDStuiw7EGgjAmLQXeTwuI9HtA-RN9F=h310",
        "//lh4.ggpht.com/8dVm1Xy8mYFU4VD32t-CMpuelc_fgilV103zct054gkSw9gKjik6QtH7NR8Q94Cn_dZF=h310"
    ],
    "comments": [
        "I like it but has a few issues Second hand shouldn't freeze in place during ambient display. It should just disappear. Temperature doesn't seem to load immediately upon setting face.  Overall, very impressive and useful face.",
        "Can see Pixels on Moto 360 v2 Please update the watch face, the hour and second hands are pixelated as if it's low resolution. Otherwise a great looking watch face spoiled by the low resolution feel",
        "Not showing Tried a resync of apps, but nothing. Can't select the watch face.",
        "Looks good on Moto 360. Nice and clean and simple.",
        "Weather won't update I can't get the weather to update. Great design though.",
        "will not sync to my moto 360. only app PR face I have am issue with"
    ],
    "recentChanges": [
        "Reported UI Bugs Fixed",
        "Auto Weather Update",
        "Compatible with Wear"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.fra07&hl=en&gl=us",
    "appId": "com.frillroid.fra07"
}