{
    "title": "Behance Watch Faces",
    "summary": "Watch faces featuring art from the Behance community for Android wear 5.0",
    "icon": "//lh6.ggpht.com/I7uNkfNRISSfCHWvdnVTm13JesTQOe2kYZADzizJJMezwTEHODvvpsXHOO-F0KlOzWg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.8,
    "reviews": 1652,
    "developer": "Behance Inc.",
    "developerId": "Behance+Inc.",
    "developerEmail": "androidwatchfaces@behancenetwork.zendesk.com",
    "developerWebsite": "http://www.behance.com",
    "updated": "August 11, 2015",
    "version": "1.3.1",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Please make sure your watch is running Android Wear 5.0 or higher. After installing the app, it may take some time to sync to your watch. You can also try “Resync apps” in Android Wear settings.  - Select artwork from the Behance community to be used as watch face backgrounds- 6 unique watch faces: AG, Classic, Phrase, Pulse,Timecard and Window- Browse the full portfolio of featured artists on your Android device- Each watch face includes an alternate Ambient Mode- 24 Hour time option- Backgrounds featuring work from the Behance Portfolios of: Alberto Seveso, Andy Lee, Bjorg Elise Tuppen, Brendan Savage, Daniel Reed, Grigori Shevtsov, James Wignall, Jason Battersby, Jason Tessier, Jean-Christophe Saint-Dizier, Jonathan Calugi, Julieanne Kost, Julien Palast, Kerim Arslan, Laszlo Varga, Lucas Furla, Luke Choice, Marius Roosendaal, Mark Brooks, Martín Azambuja, MIMI.C, Nancy Wood, Paolo Todde, Riccardo Sabatini, Roby Dwi Antono, Serge Aleynikov, Serial Cut, Silvia G. Guerra, Vassilis Tangoulis, Won Kim, Yosman Botero.ABOUT BEHANCEBehance is the leading online platform to showcase & discover creative work and is part of the Adobe Family. Behance’s team of curators feature new work every day from top portfolios in the fields of design, fashion, illustration, industrial design, architecture, photography, fine art, advertising, typography, motion graphics, sound design, and many more. Leading creative companies find talent on Behance, and millions of visitors use Behance to track the latest and greatest creative talent.If you like the app, please give us a good rating. It really helps!If you have any issues or suggestions email us at BehanceMobile@Adobe.com",
    "descriptionHTML": "Please make sure your watch is running Android Wear 5.0 or higher. After installing the app, it may take some time to sync to your watch. You can also try &#x201C;Resync apps&#x201D; in Android Wear settings.  <br><br>- Select artwork from the Behance community to be used as watch face backgrounds<br>- 6 unique watch faces: AG, Classic, Phrase, Pulse,Timecard and Window<br>- Browse the full portfolio of featured artists on your Android device<br>- Each watch face includes an alternate Ambient Mode<br>- 24 Hour time option<br>- Backgrounds featuring work from the Behance Portfolios of: Alberto Seveso, Andy Lee, Bjorg Elise Tuppen, Brendan Savage, Daniel Reed, Grigori Shevtsov, James Wignall, Jason Battersby, Jason Tessier, Jean-Christophe Saint-Dizier, Jonathan Calugi, Julieanne Kost, Julien Palast, Kerim Arslan, Laszlo Varga, Lucas Furla, Luke Choice, Marius Roosendaal, Mark Brooks, Mart&#xED;n Azambuja, MIMI.C, Nancy Wood, Paolo Todde, Riccardo Sabatini, Roby Dwi Antono, Serge Aleynikov, Serial Cut, Silvia G. Guerra, Vassilis Tangoulis, Won Kim, Yosman Botero.<br><br>ABOUT BEHANCE<br><br>Behance is the leading online platform to showcase &amp; discover creative work and is part of the Adobe Family. Behance&#x2019;s team of curators feature new work every day from top portfolios in the fields of design, fashion, illustration, industrial design, architecture, photography, fine art, advertising, typography, motion graphics, sound design, and many more. Leading creative companies find talent on Behance, and millions of visitors use Behance to track the latest and greatest creative talent.<br><br>If you like the app, please give us a good rating. It really helps!<br><br>If you have any issues or suggestions email us at BehanceMobile@Adobe.com",
    "histogram": {
        "1": 171,
        "2": 111,
        "3": 249,
        "4": 397,
        "5": 724
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/ELldeqgZz45rYdii1dwJ8AMEiPesLPMVKC8boN62zprYHSnKie_4JxC6qbg4rg7imsg=h310",
        "//lh5.ggpht.com/rG_wHx2P3xg1WJlXeRGOzC2N0q7zg-UKnVbh0oLd2HTrBGvGq68lkwtc8Ii5xXQSrBVf=h310",
        "//lh5.ggpht.com/wU6CHfO2qkXSaIr4sANEctyqyZuchtvgskIgUq3KbwbIEZ7z7ZJ0HlCmMKkhHkSKxQ=h310",
        "//lh3.googleusercontent.com/febLikmvdJabQ9guPcNEdlGs8I7WG7w6b-SKOU4M3lNVCDPPLKfMe1P3QH4UAJDyZw=h310",
        "//lh3.googleusercontent.com/RxapXGxsH6McT22trAEw4pnWCFeE2h2LdhhOyLVk5JYjBiq4vDgW631wAein8cAl9jU=h310",
        "//lh3.googleusercontent.com/uZiarL4iuLFiY7WgIB0uoyXwlwIdLNf3b1gEusCzd60VqnIJI5Wh-UfA7AuUB7pICS0=h310",
        "//lh3.googleusercontent.com/kneL0H6LfIQrrMClhdJNcxUMWMD1aJbLUeLD716TuBVTMiIVohLb8PnGBaVChqdqcl4=h310",
        "//lh3.googleusercontent.com/ZpWuTj6623jeHj54msLfMd_zp-1bXH3O0q_yr_B0i0KmmG-8LnC8Me4qXze-OwO9wkE=h310",
        "//lh3.googleusercontent.com/E7GBw3lJoamVW6nKoULZww2_ImnSsAz_RWTzAZS6sitxHkbTxujcbHGwTyodey22QlA=h310",
        "//lh3.googleusercontent.com/2CII_3tiTxJIroSgOiBvIIlwrshCWcKC9P5tE6NFkvLWAGvdQOR1W4rZ-6pghexdW634=h310",
        "//lh3.googleusercontent.com/xEJMX7KuxrFw9C4Nvi2-uzpzocrdEU5JuJNX7wjOEen1t9moO04L0ckR0knySLojlDRN=h310",
        "//lh3.googleusercontent.com/bq3QucG8bjs6OANIpd58698ptsUhw9P0EutIdQ1eLxN9EsZlaB3MT_Ywc9dh-8J9AriU=h310"
    ],
    "comments": [
        "How long does it take to sync? Still can't see it or initiate it. It's been a whole week and I can't wait to see it in ise but nothing.. The wait is depressing",
        "Customization Its a beautiful looking app, but the inability to customize anything gets annoying. For example the watch face with the circle in the middle is by far my favorite, but since the date (and sometimes the minutes) is at the bottom, I cannot see it whenever a notification is up.",
        "So I was really looking forward to having a watch face a little different but sadly on my smart watch only the background can be changed and I'm stuck with the standard clock face. Can't see any reason why it wouldn't let me change it!?",
        "Good with annoying notifications Good looks but I dislike the constant notifications about the artist. It's like an ad that doesn't ever go away right on my watch.",
        "Im giving it 5 starts just for the watch face \"Phrase\" where the time is spelt out in words - love it!! Annoying notifications - but that can be easily blocked.",
        "Just a note that there is no such thing as Android Wear 5.0. I've got the most recent version of as of December 30, 2017 and it's Android Wear 2.7"
    ],
    "recentChanges": [
        "Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.behance.behancewatch&hl=en&gl=us",
    "appId": "com.behance.behancewatch"
}