{
    "title": "Speedy Torque Watch Face",
    "summary": "Simple and elegant watch for your daily use with battery meter.",
    "icon": "//lh3.googleusercontent.com/cUdhjIMACud_6zMnGBIKmvbKhS0Ef1eAPOl2o2AvbylgGqCYcjIovG9FH8cSKnBRFmU=w300",
    "price": "$1.03",
    "free": false,
    "minInstalls": 10,
    "maxInstalls": 50,
    "score": 0,
    "reviews": 0,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "May 20, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "How it works?It’s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen Speedy Torque is a simple yet an attractive watch face. It encompasses of all the quick features that you use frequently and keeping the analog design alive. It’s a fusion of analog and digital watch face as you can see the clock hands for minutes and hours additional digital counter for seconds.FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:- Analog Dials with digital seconds counter  Classic Design with Ultimate readability Clean and simplistic look  Remaining battery life of your watch  Remaining battery life of your device so you exactly know when to charge Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "How it works?<br>It&#x2019;s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen Speedy Torque is a simple yet an attractive watch face. It encompasses of all the quick features that you use frequently and keeping the analog design alive. It&#x2019;s a fusion of analog and digital watch face as you can see the clock hands for minutes and hours additional digital counter for seconds.<br><br>FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br>Key custom features:-<br><br>&#xF0EC; Analog Dials with digital seconds counter <br>&#xF0EC; Classic Design with Ultimate readability<br>&#xF0EC; Clean and simplistic look <br>&#xF0EC; Remaining battery life of your watch <br>&#xF0EC; Remaining battery life of your device so you exactly know when to charge<br>&#xF0EC; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br>This watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br>. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 0
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/DGX3eISC1Quu5X6AZilDQyx0AEFbQ5uWjdxBF06r9iBhKNgl9lKJ2IXTgzMON0l7Kw=h310",
        "//lh3.googleusercontent.com/QU7T0a__Y-jJhzDNatVdDFjcgzR8STEDBPRdJ3GpefU0_MvseeqvpOqzaotCS1KkqK8=h310",
        "//lh3.googleusercontent.com/A2Xh73ophJe1HmIxGGhYIf9aVvsQyV3Gbz9zV0v5kt7jbOLB49B3MmnO3dFV5vCsepY=h310"
    ],
    "comments": [],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.speedy.torque.analogue.watch.face.A26&hl=en&gl=us",
    "appId": "com.frillroid.speedy.torque.analogue.watch.face.A26"
}