{
    "title": "Photo Wear Android Watch Face",
    "summary": "PhotoWear lets you wear a gallery on your wrist!",
    "icon": "//lh3.googleusercontent.com/Dt5HQYl0oIcUKY5o6L7kkai7ma9I5D3cDB2Mk0FzX-n1xCK8K_Y_y-YelnBv8rE-Rkat=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 2093,
    "developer": "Sparkistic LLC",
    "developerId": "Sparkistic+LLC",
    "developerEmail": "support@sparkistic.com",
    "developerWebsite": "http://sparkistic.com",
    "developerAddress": "PO BOX 503691\nSAN DIEGO CA 92150-3691",
    "updated": "February 6, 2018",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Want to easily show off your best photos? With PhotoWear™, you can easily display any of your favorite nine photos right from your Android Wear watch!SIGN IN to Instagram and get your most recent or most liked photosor SELECT 9 of your favorite photos from your phone's galleryTOGGLE between photos right from your watch faceNOTE: PhotoWear is only compatible with Android Wear watches, and does not work with Tizen-based Samsung watches such as the Gear S2 or S3.☆☆☆ Highlighted Features ☆☆☆- Connect to Instagram to instantly get pictures- Crop your photos and apply photo filters- Change options like text font, battery indicator, and time position- Interactive watch face lets you select album view or tap to display any of 9 photos full screen- New beautiful analog watch face displays time in a unique circular styleHave feedback, feature requests, or want to participate in the beta release program? Check out or PhotoWear G+ Community: https://plus.google.com/communities/106211844126316152001Note: The permission \"read the contents of your USB/SD card\" is there so you can select existing photos from your gallery.Use of this app constitutes agreement with Sparkistic, LLC's END-USER LICENSE AGREEMENT.http://sparkistic.com/eula",
    "descriptionHTML": "Want to easily show off your best photos? With PhotoWear&#x2122;, you can easily display any of your favorite nine photos right from your Android Wear watch!<br><br>SIGN IN to Instagram and get your most recent or most liked photos<br>or SELECT 9 of your favorite photos from your phone&apos;s gallery<br>TOGGLE between photos right from your watch face<br><br>NOTE: PhotoWear is only compatible with Android Wear watches, and does not work with Tizen-based Samsung watches such as the Gear S2 or S3.<br><br>&#x2606;&#x2606;&#x2606; Highlighted Features &#x2606;&#x2606;&#x2606;<br>- Connect to Instagram to instantly get pictures<br>- Crop your photos and apply photo filters<br>- Change options like text font, battery indicator, and time position<br>- Interactive watch face lets you select album view or tap to display any of 9 photos full screen<br>- New beautiful analog watch face displays time in a unique circular style<br><br>Have feedback, feature requests, or want to participate in the beta release program? Check out or PhotoWear G+ Community: https://plus.google.com/communities/106211844126316152001<br><br>Note: The permission &quot;read the contents of your USB/SD card&quot; is there so you can select existing photos from your gallery.<br><br>Use of this app constitutes agreement with Sparkistic, LLC&apos;s END-USER LICENSE AGREEMENT.<br>http://sparkistic.com/eula",
    "histogram": {
        "1": 190,
        "2": 85,
        "3": 157,
        "4": 376,
        "5": 1285
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/XfBZ_11n0pvj7gjUw4DfLt9g3ZvcUfS7xC5MvAixdMR8GbV7OGQa_4OU9TJLKenTds4=h310",
        "//lh3.googleusercontent.com/ogQRF8GZy2jOOJrX1rl176JX1TRwuiYGdKafjjshLfmhR40C6cxcftdBtKBaMNbJbxU=h310",
        "//lh3.googleusercontent.com/CEJJT0L7mIpCNN1MhUuyTChfBCxRmnLElwWBkY9fPw0sYSp--_l0cmJfFHJaWuEUYns=h310",
        "//lh3.googleusercontent.com/CaRS7QbZPO07HbJCEZyabMDOA_KHiT22y9mHYFDbSBjiOSp0KyXs_xBi6iPHzA-AqKw=h310",
        "//lh3.googleusercontent.com/DVpVKP0fOwyvDeeStO7OSznbnduRYff9yhrNv8nhBEv_1Bn5b7RO-fHMhuWJKLnz5ur-=h310",
        "//lh3.googleusercontent.com/R6kAjXknfg7-vvEfsIqCLfZ4U_1k2iQoODeP6lXegeNUC7BPuvK8kJcDBc90BAL-E5Vi=h310",
        "//lh3.googleusercontent.com/BtK9XwSr3AKuZ4nscApoFSesjO5_NTW-79kVF09VYopCoXzf5WK4zaqZjyYeCy8BXMw=h310",
        "//lh3.googleusercontent.com/nmrNO2NfXa77yy8LQQBtEn-MulBqj1Qb8uhtLC3vKGxN6xc_KzwQWWV_bcsO5IMKFOM=h310",
        "//lh3.googleusercontent.com/W4j_EFIy4i9RdfYP9934Uve9ZkK69pdJA-wk5YSIbSOU8IoAitqz37AQa7I20OZue-Y=h310",
        "//lh3.googleusercontent.com/YY4TzVIKl3EzZsY-_3EPS_iEBPzlsPR97Sr8QYfVEo7gajB8HrvAwyOKVICDKAgslCs=h310"
    ],
    "video": "https://www.youtube.com/embed/Y2hiLxU07w0",
    "comments": [
        "I like this and I even got the pro version. However, it won't seem to let me switch between pictures once I had one set. I restarted both my watch and my phone, but still I see no option or ability to change pictures. Even adding new ones won't help. Once this is resolved, I'll give 5 stars. I have a Wear24 watch. Edit: I figured out how to change pictures from the watch. Still difficult, it's best to just keep my favorite picture in the middle slot. Now going with 4 stars. I'll rate it 5 IF it was super simple to switch pictures from the phone by tapping and choosing \"apply\" like with the Samsung Gear S3.",
        "Fails picture sync most of the time. Automatically refreshes the watch face to bring back one of its default images. Not worth spending money! Disappointed!",
        "This watchface awesome.....however, I do wish that it has a screen on duration time. Usually run my watch; tilt to wake off, always on off, so when I tap to wake, I want it to stay awake for 15-20 seconds at least.",
        "like the look of the app. unable to sync pictures to my huawei watch 2 sport. Advise for 5*",
        "Works awesome on my Fossil watch, not so much on my Moto. I love that it allows me to see my phone battery level on my watch I've been looking for that functionality forever.",
        "okay I thought the app was good but I only have one problem with it doesn't give you that freedom that you want you can't really do anything you only have to choose certain pictures you want and the whole frame it doesn't really like say you can choose one picture that you want and no it doesn't do that that's the problem I have with it"
    ],
    "recentChanges": [
        "4.0 - NEW! Long-press your watch face to change clock mode as well as add and edit Android Wear complications (Pro users only).",
        "4.0.4 - Minor bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sparkistic.photowear&hl=en&gl=us",
    "appId": "com.sparkistic.photowear"
}