{
    "title": "Material Flashlight 10 Supreme",
    "summary": "Light for the world and an LED Theme; It&#39;s the last Flashlight you&#39;ll ever need.",
    "icon": "//lh4.ggpht.com/qCwjriDvJt9OvsbqNPt7qiY1eEMnCdX8_CCCQdtLmyxftVOLwy4sZPxzPTlNS8lSxw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.2,
    "reviews": 225,
    "developer": "Banji Oyewole",
    "developerId": "7921136490805288329",
    "developerEmail": "enzoniummobile@gmail.com",
    "developerAddress": "4578 Wheelock Student Center\n98416-4578 Tacoma, WA",
    "updated": "June 8, 2016",
    "version": "7",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Introducing Material Flashlight 10 Supreme with camera preview.“Smooth as silk animations” - Five Star Rating Material Flashlight 10 Supreme offers, simplicity and utility wrapped into a beautiful user experience from end to end.Experience this stunning app today!It's coolest features:Camera Preview – See through your camera  for tough to reach places!We use the Camera flash and the camera to help you see places where your head does't go so nicelyAndroid Wear AppFlashlight StrobeFlashlight sound reactivity with dynamic sensitivity\tGreat for music!Minimalist, Fluid and fully animated UIEvery UI element changes color with a change in theme – Including those added with the Extended, and Windos  packagesAuto-Start on app entry18 Flashlight home screen and lock screen WidgetsTheme randomizer on App StartHow to UseWhat sets Material Flashlight 10 Supreme apart is its unique function being brought together with a truly inspired user experience. It's theme is centered around the inside of an LED, and the way the diode is structured. Toggling the Flashlight is as simple as tapping the screen, upon which you will be graced with this immersion into any of 9 colors backed by one of 3 backgrounds. Its Floating Action button lets us maintain our super clean UI. On Click, Four options become visible, Flashos, Windos, Themos and Settings. Settings – Taking the place of the plus, the Settings menu has over 300 combinations to make Material Flashlight 10 as individual as you.Flashos – Animates up the strobe and sound reaction part of Material Flashlight 10 SupremeWindos – Quick access to the view from the camera with LED Illumination toggle immediately at handThemos – Gives access to the Plus package, the Theme engine of Material Flashlight 10 SupremeMore InfoMaterial Flashlight 10 Supreme is compatible with devices running 4.0 or Higher, and is designed for 4.4+ devices and Android Marshmallow 6.0Material Flashlight 10 Supreme is designed for Nexus 6P class devices –1440p UHD displays with, Snapdragon 820 Soc, with support of a slew of other devices. Testing has been conducted on Nexus  5, Samsung Galaxy S6 Edge, Samsung Galaxy S7 EdgeKorean translation by Des Franco Spanish translation by Alvaro MartinezContact Enzonium Mobile if there's anything we can do to make a better flashlight not just for you, but for the android community as a whole.Material Flashlight 10 Supreme is in development, so we respond to emails very rapidly.We thank you for choosing Material Flashlight 10 Supreme!Widget background imagery by KovdevWe've tried to take something mundane, like a flashlight, and create something truly spectacular. A minimalist flashlight interface, with best in class performance and functionality. LED Flashlight 10 is our answer to uninspired core experience apps. Over the last year we've brought this application into the new age of brilliant design. Striking colors. Awe inspiring animations. And a fun user experience that delights us every day.We hope you Enjoy!",
    "descriptionHTML": "Introducing Material Flashlight 10 Supreme with camera preview.<br><br><b><i>&#x201C;Smooth as silk animations&#x201D;</i> - Five Star Rating <b><br><br>Material Flashlight 10 Supreme offers, simplicity and utility wrapped into a beautiful user experience from end to end.<br><br>Experience this stunning app today!<br><br><b>It&apos;s coolest features:</b><br><b><br>Camera Preview &#x2013; See through your camera  for tough to reach places!<br>We use the Camera flash and the camera to help you see places where your head does&apos;t go so nicely<br><br><br>Android Wear App<br><br>Flashlight Strobe<br><br>Flashlight sound reactivity with dynamic sensitivity<br>\tGreat for music!<br><br>Minimalist, Fluid and fully animated UI<br><br>Every UI element changes color with a change in theme &#x2013; Including those added with the Extended, and Windos  packages<br><br>Auto-Start on app entry<br><br>18 Flashlight home screen and lock screen Widgets<br><br>Theme randomizer on App Start<br></b><br><br><br><b>How to Use</b><br><br>What sets Material Flashlight 10 Supreme apart is its unique function being brought together with a truly inspired user experience. It&apos;s theme is centered around the inside of an LED, and the way the diode is structured. Toggling the Flashlight is as simple as tapping the screen, upon which you will be graced with this immersion into any of 9 colors backed by one of 3 backgrounds. <br><br>Its Floating Action button lets us maintain our super clean UI. On Click, Four options become visible, Flashos, Windos, Themos and Settings. <br><br>Settings &#x2013; Taking the place of the plus, the Settings menu has over 300 combinations to make Material Flashlight 10 as individual as you.<br><br>Flashos &#x2013; Animates up the strobe and sound reaction part of Material Flashlight 10 Supreme<br><br>Windos &#x2013; Quick access to the view from the camera with LED Illumination toggle immediately at hand<br><br>Themos &#x2013; Gives access to the Plus package, the Theme engine of Material Flashlight 10 Supreme<br><br><b>More Info</b><br><br>Material Flashlight 10 Supreme is compatible with devices running 4.0 or Higher, and is designed for 4.4+ devices and Android Marshmallow 6.0<br><br>Material Flashlight 10 Supreme is designed for Nexus 6P class devices &#x2013;1440p UHD displays with, Snapdragon 820 Soc, with support of a slew of other devices. Testing has been conducted on Nexus  5, Samsung Galaxy S6 Edge, Samsung Galaxy S7 Edge<br><br>Korean translation by Des Franco <br>Spanish translation by Alvaro Martinez<br><br>Contact Enzonium Mobile if there&apos;s anything we can do to make a better flashlight not just for you, but for the android community as a whole.<br><br>Material Flashlight 10 Supreme is in development, so we respond to emails very rapidly.<br><br>We thank you for choosing Material Flashlight 10 Supreme!<br><br>Widget background imagery by Kovdev<br><br>We&apos;ve tried to take something mundane, like a flashlight, and create something truly spectacular. A minimalist flashlight interface, with best in class performance and functionality. LED Flashlight 10 is our answer to uninspired core experience apps. Over the last year we&apos;ve brought this application into the new age of brilliant design. Striking colors. Awe inspiring animations. And a fun user experience that delights us every day.<br><br><br>We hope you Enjoy!</b></b>",
    "histogram": {
        "1": 19,
        "2": 11,
        "3": 15,
        "4": 40,
        "5": 140
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/8k8_oSCoOCdbOFKpSxQltDPANZO45BuwguZRXxgY-6AxeVRUViiXiuvOPAvZjpjy8jM=h310",
        "//lh6.ggpht.com/LtgBOwJE98oLg9PTLF1rGu8suon58gUwa5bUv8WtRVUnWiM3QmcVNKcZEMt912ctWls=h310",
        "//lh4.ggpht.com/p6dbG4JedUiGHQNqq3q0l2WrLQ3zFU0qfywazGHagHoHAunsdlx8IL6PXhfG_z8eEg=h310",
        "//lh3.googleusercontent.com/Vz2Aa0Q6kOrDbB2YC7hhu6YjLglVePWoz3Vrz0PI7EBQ3ASNc3HaPLHV-iZw6846oEw=h310",
        "//lh6.ggpht.com/OhdPUDxfXnkYmy1M_nkTN9gYKdDq0sB7JdUZ0BopzSB5Ph6p-yAq7L_M8MXn64ZZ3mg=h310",
        "//lh3.ggpht.com/fMgQw0FgrmssrMr9pd-Z9OMRdOFo4C6PY5YqZbEXmNv-OI2VqW4eFhnmcjbl6Kw8YQ=h310",
        "//lh3.googleusercontent.com/AniuniRZX2tPTaM9xtdLgkO8icQpRL3k7EpW0eaIjqd99VWGVHDiXEX_4FLw0H68Wdjt=h310",
        "//lh3.ggpht.com/KP_dTAdQVCkmYRh4wFAw74s72krxY7nJCJ2jUIfXQ9URGMLfOu3DuI4F_PZMnYV2P6s=h310",
        "//lh4.ggpht.com/dFKIEsXmPHNOqlmqnB1X1Il0VnCnC2gyPfrw9xR0oA4n4HdFDrNtL13FkQY0c5C5fow=h310",
        "//lh3.ggpht.com/UQct-tabwzsZDkZ3XIRzpMjI3dAaqPQ3iszG_iLulRBLgMzXcaBRm5WitXFQMR-2BMQ=h310",
        "//lh3.ggpht.com/ok13k2Iv-Bdj6OEtCfAIAEriQ7AQNmlGz8uSyqPxKw4yQNkX9DFDFnSMtLgZ3yGVww=h310",
        "//lh4.ggpht.com/o5iT0IBZY60p2av3HJUDggsBkVn5zipH8kQf3CvIbt-Tw6HcaPu1bGzFwoBovcImHQ=h310",
        "//lh6.ggpht.com/z57U4mhBeXJag1lRLTdwS6i0I5ahx-g0ykX9OPJ24lmEVNkv0ZU55qtqh6HHAlzZFiM=h310",
        "//lh4.ggpht.com/VNke8TS3BwnWlgQ7uqtU2VgjTMqOk2EunwgMhRVC1-4QRzO5MBetyAe99NF3ddmunYSt=h310",
        "//lh3.googleusercontent.com/S-hep_XgyFAu55LGLrLDFxaFdcDCdtejIa1QIk3Sk8S6Hqz2Gmzu3jcNLDki-R8n-LA=h310"
    ],
    "comments": [
        "Delayed. It takes a second or so between the widget button press and my LED coming on. Nice other themes available but very expensive for what it is.",
        "Great app Does what it should with no camera crashes.",
        "Design 😍 Does the job while looking nice",
        "Great Love the material design elements",
        "Ok Good",
        "Wear Android wear companion app would be appreciate. Also, Mabey a persistent flashlight notification card. 5 stars for the reply!"
    ],
    "recentChanges": [
        "Version 7 Supreme",
        "Windos Integration, WINDOS UI starts up to 60X faster.",
        "Widgets are now in a separate app.",
        "Some wear functionality disabled",
        "Notifications removed"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.enzonium.flashlite&hl=en&gl=us",
    "appId": "com.enzonium.flashlite"
}