{
    "title": "Omega Watch Face",
    "summary": "Stylish watch face with date, battery, schedule, weather, and health.",
    "icon": "//lh3.googleusercontent.com/rXuyL_e50aqwgmc9rzYBNvOwv3Aa3pYlgfn1tPcl03zYm-8qSZ2fRuN506oDOHJ0DyI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.8,
    "reviews": 247,
    "developer": "Kevin Broh-Kahn",
    "developerId": "4654453048954028942",
    "developerEmail": "kevin@broh-kahn.com",
    "developerWebsite": "http://kevin.broh-kahn.com",
    "developerAddress": "1415 N Taft St\nApt 878\nArlington, VA, 22201",
    "updated": "October 20, 2017",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Feel like the best secret agent while sporting the Omega watch face. You'll be able to leave your phone in your pocket as Omega will tell you every necessary detail you need to get through your day. By knowing your schedule with such details at a moment's glance, your friends might even think you to be a supernatural spy!Omega is the most complete watch face for your Android Wear device. When fully utilized, Omega will tell you the time, date, weather, battery level of your devices, and your current fitness data. What follows is a list of all of Omega's fully customizable features:DATE & TIME- Of courseBATTERY- Show battery from your watch and/or phone in the battery meters- Choose the interval at which to poll the battery level of your devices- Optionally show the exact battery life at the bottom of the screen*- Use the battery life monitors on the watch face to display approximate battery life (within 10% to 18%)- Optionally show only the current health block in ambient mode to reduce screen burn-in and brightnessWEATHER- Omega's handheld app will get current weather information from Dark Sky- Choose from a variety of details to show: the day's high & low, wind speed & direction, sunrise & sunset*- Use imperial / metric units- Note: Requires ACCESS_FINE_LOCATION and INTERNET permissionSCHEDULE- Omega's wearable app will read the calendars that are on your wear device to determine your next event- Choose the interval at which to check for new events- As soon as your current event has ended, Omega will look for the next event- Choose how long in the future you want to look: check for event in the next 2 hours or the next 1 week- Note: Requires READ_CALENDAR permissionHEALTH*- Omega's wearable and/or mobile app will read the Google Fit data from your device- Choose from a variety of retrieval methods: Google Fit data or sensor data from phone or watch- Choose the interval at which to update fitness data.- Note: May require BODY_SENSOR permissionEvery one of Omega's features/elements is completely optional and can be modified to your liking, here is what you can do to each element individually:- Show/hide element*- Change text size- Change font- Text color- Vertical position*- Text alignment- Toggle icon- Change icon side*Note: some elements require paid version. Purchase the paid version for only $1.99 for a limited time at https://play.google.com/store/apps/details?id=com.brohkahn.omegaApplication IssuesOur goal was to create a complete and fully functional, usable, power efficient watch face. If you do not think that our mission was a success, please send us an email at kevin@broh-kahn.com with your issues and we will get back to you as quickly as possible. If you have an issue with the application, please do not leave a negative review or uninstall the app; contact us and we will do our best to solve your issue within 3 days.Feature RequestsIf you have a small feature request (i.e. configuration change) for this watch face, please send us an email at kevin@broh-kahn.com and your request will be completed within 1 week, guaranteed. Larger requests may take more time. If you would like us to design a new watch face with all the functionality of Omega, please get in touch and we'll work with you to design a well-designed and functional watch faceNotice: Omega only works on Android and Android Wear devices",
    "descriptionHTML": "Feel like the best secret agent while sporting the Omega watch face. You&apos;ll be able to leave your phone in your pocket as Omega will tell you every necessary detail you need to get through your day. By knowing your schedule with such details at a moment&apos;s glance, your friends might even think you to be a supernatural spy!<br><br>Omega is the most complete watch face for your Android Wear device. When fully utilized, Omega will tell you the time, date, weather, battery level of your devices, and your current fitness data. What follows is a list of all of Omega&apos;s fully customizable features:<br><br>DATE &amp; TIME<br>- Of course<br><br>BATTERY<br>- Show battery from your watch and/or phone in the battery meters<br>- Choose the interval at which to poll the battery level of your devices<br>- Optionally show the exact battery life at the bottom of the screen*<br>- Use the battery life monitors on the watch face to display approximate battery life (within 10% to 18%)<br>- Optionally show only the current health block in ambient mode to reduce screen burn-in and brightness<br><br>WEATHER<br>- Omega&apos;s handheld app will get current weather information from Dark Sky<br>- Choose from a variety of details to show: the day&apos;s high &amp; low, wind speed &amp; direction, sunrise &amp; sunset*<br>- Use imperial / metric units<br>- <i>Note: Requires ACCESS_FINE_LOCATION and INTERNET permission</i><br><br>SCHEDULE<br>- Omega&apos;s wearable app will read the calendars that are on your wear device to determine your next event<br>- Choose the interval at which to check for new events<br>- As soon as your current event has ended, Omega will look for the next event<br>- Choose how long in the future you want to look: check for event in the next 2 hours or the next 1 week<br>- <i>Note: Requires READ_CALENDAR permission</i><br><br>HEALTH*<br>- Omega&apos;s wearable and/or mobile app will read the Google Fit data from your device<br>- Choose from a variety of retrieval methods: Google Fit data or sensor data from phone or watch<br>- Choose the interval at which to update fitness data.<br>- <i>Note: May require BODY_SENSOR permission</i><br><br>Every one of Omega&apos;s features/elements is completely optional and can be modified to your liking, here is what you can do to each element individually:<br><br>- Show/hide element*<br>- Change text size<br>- Change font<br>- Text color<br>- Vertical position*<br>- Text alignment<br>- Toggle icon<br>- Change icon side<br><br>*Note: some elements require paid version. Purchase the paid version for only $1.99 for a limited time at https://play.google.com/store/apps/details?id=com.brohkahn.omega<br><br><b>Application Issues</b><br>Our goal was to create a complete and fully functional, usable, power efficient watch face. If you do not think that our mission was a success, please send us an email at kevin@broh-kahn.com with your issues and we will get back to you as quickly as possible. If you have an issue with the application, please do not leave a negative review or uninstall the app; contact us and we will do our best to solve your issue within 3 days.<br><br><b>Feature Requests</b><br>If you have a small feature request (i.e. configuration change) for this watch face, please send us an email at kevin@broh-kahn.com and your request will be completed within 1 week, guaranteed. Larger requests may take more time. If you would like us to design a new watch face with all the functionality of Omega, please get in touch and we&apos;ll work with you to design a well-designed and functional watch face<br><br><i>Notice: Omega only works on Android and Android Wear devices</i>",
    "histogram": {
        "1": 38,
        "2": 14,
        "3": 28,
        "4": 44,
        "5": 123
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/7g9ISdUmkwTXCoX9ntX91YBr0OAXOt0qQfIcyKZvtnxw7lUh9RBdvxdgErkqU5trISE=h310",
        "//lh3.googleusercontent.com/G8JV9LTQXaZTkXTg1SSwK5LwysnNXM2CHe2faRhxoXgXI53AMX7papqQS0fJXWBSzA=h310",
        "//lh3.googleusercontent.com/PW-bCdimCiZyDzuxR-VY68fRp8GzfmLVM8aN0Z6YpuI4I09pqqmbI9rTCH2fkym3-tE=h310",
        "//lh3.googleusercontent.com/kpk7crujozBXP6wh581ngIa5DHR4r5lx0sGbfWCucQOP4p7Qrrd2BtHcVzliRqqj7UC1=h310",
        "//lh3.googleusercontent.com/KPojPthxsz5kzu9txzbwnOA_4KXWkOb_cW-ZQp1fzqaONB4wxguAlP0mzslqb_huzgE=h310",
        "//lh3.googleusercontent.com/kM5yrZ5O3NRqxz56OAvOBbdXxEMpaXM_GyhEcVdKzUM1L0j8zKnE2liTLChVlwt3Nw=h310",
        "//lh3.googleusercontent.com/dLQsJ65aZMDi5KE43Oyl_C4IrprM1ynndUF7gIOsTSy2UpilHQLS67HEV673dB9fjoQ=h310",
        "//lh3.googleusercontent.com/7tmSUWn5Hm26_8RosRkMc6vIHNmSeMtXoQ54yO6xjqxl6kgEYxAg_81Obm_pykC22SU=h310"
    ],
    "comments": [
        "I love this watch face. The customization is amazing, makes you feel like you actually own the app, worth the $1.99 upgrade to the pro. The only issue I have is that the step counter step up is all over the place. First it doesn't show anything, when it reads from Google Fit it doesn't read correctly, and reading from the watches sensors give me exacerbated readings. Other than that is really great! Huawei Watch 2",
        "I love the look of the face and the apparent customization. But I can't get any of the tap actions to work. I've tapped just about everywhere and I've tapped and held down and nothing happens. Idk if tap actions are like a paid feature or something but I'd really like to know.",
        "On moto 360 first edition this appears to break the battery gauge, so at the end of a day you're at 90 percent but the watch turns off around 85 percent. Also weather feature never works.",
        "The UI and design of this app is great. I recommend this to anyone looking for a highly customizable watch face.",
        "Works perfect. Had Problems first because my watch wasn't updated. Great Watchface.",
        "downloaded free version and couldn't get the face on my Zenwatch 3 with Android Wear.  Do I really have to purchase to have any features not just the *-ed ones?"
    ],
    "recentChanges": [
        "3.1.12",
        "- Fix new issue preventing weather update",
        "3.1.11",
        "- Fix stupid issue causing non-responsive app"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.brohkahn.omegawatchface&hl=en&gl=us",
    "appId": "com.brohkahn.omegawatchface"
}