{
    "title": "Personal Capital Budgeting and Investing",
    "summary": "Over 1.5 million people use Personal Capital to track over $400 billion.",
    "icon": "//lh3.googleusercontent.com/CT0AiKBMQ_HJ1YvwCo2V2j_2Fn5P4TJTHWOHNFqjXoJE_VumDb0I_8AxkhOqnhfKo9g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 2783,
    "developer": "Personal Capital Corporation",
    "developerId": "Personal+Capital+Corporation",
    "developerEmail": "support@personalcapital.com",
    "developerWebsite": "http://www.personalcapital.com",
    "developerAddress": "Personal Capital Corporation\n1 Circle Star Way\nSan Carlos, California 94063",
    "updated": "February 15, 2018",
    "version": "6.2.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Personal Capital is the smart way to track and manage your financial life. We combine award-winning financial tools that provide unprecedented transparency into your finances with personal attention from registered financial planners. The result is a complete transformation in the way you understand, manage and grow your net worth.THE MODERN WAY TO TRACK AND MANAGE YOUR NET WORTHOur unique combination of people and technology makes Personal Capital the smart choice because you can see all of your accounts in one place. Our app provides real-time data that uncovers trends and accurately reflects your cash flow. As fiduciaries, our advisors are legally bound to act in your best interest so we will never put our personal financial gain above yours. Let Personal Capital help ensure that you’re always moving towards your financial goals – at significantly less cost than traditional financial advisors, and with no hidden fees.PERSONAL CAPITAL: MILLIONS OF PEOPLE, BILLIONS IN ASSETS\"2017 Personal Best List\" - Kiplinger\"2015 & 2016 FinTech 50\" - Forbes\"2014 & 2015 CNBC Disruptor 50 List\" – CNBC\"Best 5 Free Apps to Invest Smarter\" – CNN\"Time Magazine's 50 Best Websites\" – Time\"Best Online Tool to Track Your Investments\" – Forbes\"Staff Pick\" (2013, 2014) – Google Play\"One of the top Registered Investment Advisors (RIA) in America\" - The Financial TimesSTART NOW FOR FREEWith the free Personal Capital app, you can easily and quickly link your accounts. We integrate with over 14,000 financial institutions, including Fidelity, Schwab, Wells Fargo and thousands of local and regional credit unions. You can be up and running in about a minute for a 360° view of your financial life.INTERACTIVE CASH FLOW TOOLSCreate and follow a budget. See if you’re spending more than you’re making. Monitor credit card balances. See detailed income and spending by category or payee. Review transactions in the last 24 hours with the Recent Transactions widget.TRACK YOUR INVESTMENTSWhat’s the market doing and how is it affecting your assets? Track the numbers by account, asset class or individual security. Compare your portfolio against major market benchmarks and stay on track to meet your investing goals.Install the Holdings widget to track daily market and individual holdings movement.PERSONALIZED INVESTMENT ADVICEPersonal Capital’s registered financial advisors provide customized advice tailored specifically to your goals. BUILT-IN INVESTMENT INTELLIGENCEWith Investment Checkup on tablet, you can compare your portfolio’s allocation to the ideal target allocation and see how well your investments are doing. Uncover opportunities for diversification, minimize risk, and pinpoint hidden fees to fine-tune and improve performance.UNCOVER HIDDEN FEESIs your portfolio working as hard as it could be? The Allocation Checkup feature on tablet could save you thousands on expensive mutual fund fees.PERSONAL CAPITAL FOR ANDROID WEARCheck how your portfolio is doing and view the top 5 gainers and losers at a glance from your Android Wear.BANK-LEVEL SECURITYYou can use the Personal Capital app with confidence. Our two-step remote authentication process builds in an extra measure of security to verify your identity and your device, so you can manage your money and finances knowing your data is safe.",
    "descriptionHTML": "Personal Capital is the smart way to track and manage your financial life. We combine award-winning financial tools that provide unprecedented transparency into your finances with personal attention from registered financial planners. The result is a complete transformation in the way you understand, manage and grow your net worth.<br><br><b>THE MODERN WAY TO TRACK AND MANAGE YOUR NET WORTH</b><br>Our unique combination of people and technology makes Personal Capital the smart choice because you can see all of your accounts in one place. Our app provides real-time data that uncovers trends and accurately reflects your cash flow. As fiduciaries, our advisors are legally bound to act in your best interest so we will never put our personal financial gain above yours. Let Personal Capital help ensure that you&#x2019;re always moving towards your financial goals &#x2013; at significantly less cost than traditional financial advisors, and with no hidden fees.<br><br><b>PERSONAL CAPITAL: MILLIONS OF PEOPLE, BILLIONS IN ASSETS</b><br>&quot;2017 Personal Best List&quot; - Kiplinger<br>&quot;2015 &amp; 2016 FinTech 50&quot; - Forbes<br>&quot;2014 &amp; 2015 CNBC Disruptor 50 List&quot; &#x2013; CNBC<br>&quot;Best 5 Free Apps to Invest Smarter&quot; &#x2013; CNN<br>&quot;Time Magazine&apos;s 50 Best Websites&quot; &#x2013; Time<br>&quot;Best Online Tool to Track Your Investments&quot; &#x2013; Forbes<br>&quot;Staff Pick&quot; (2013, 2014) &#x2013; Google Play<br>&quot;One of the top Registered Investment Advisors (RIA) in America&quot; - The Financial Times<br><br><b>START NOW FOR FREE</b><br>With the free Personal Capital app, you can easily and quickly link your accounts. We integrate with over 14,000 financial institutions, including Fidelity, Schwab, Wells Fargo and thousands of local and regional credit unions. You can be up and running in about a minute for a 360&#xB0; view of your financial life.<br><br><b>INTERACTIVE CASH FLOW TOOLS</b><br>Create and follow a budget. See if you&#x2019;re spending more than you&#x2019;re making. Monitor credit card balances. See detailed income and spending by category or payee. Review transactions in the last 24 hours with the Recent Transactions widget.<br><br><b>TRACK YOUR INVESTMENTS</b><br>What&#x2019;s the market doing and how is it affecting your assets? Track the numbers by account, asset class or individual security. <br>Compare your portfolio against major market benchmarks and stay on track to meet your investing goals.<br>Install the Holdings widget to track daily market and individual holdings movement.<br><br><b>PERSONALIZED INVESTMENT ADVICE</b><br>Personal Capital&#x2019;s registered financial advisors provide customized advice tailored specifically to your goals. <br><br><b>BUILT-IN INVESTMENT INTELLIGENCE</b><br>With Investment Checkup on tablet, you can compare your portfolio&#x2019;s allocation to the ideal target allocation and see how well your investments are doing. Uncover opportunities for diversification, minimize risk, and pinpoint hidden fees to fine-tune and improve performance.<br><br><b>UNCOVER HIDDEN FEES</b><br>Is your portfolio working as hard as it could be? The Allocation Checkup feature on tablet could save you thousands on expensive mutual fund fees.<br><br><b>PERSONAL CAPITAL FOR ANDROID WEAR</b><br>Check how your portfolio is doing and view the top 5 gainers and losers at a glance from your Android Wear.<br><br><b>BANK-LEVEL SECURITY</b><br>You can use the Personal Capital app with confidence. Our two-step remote authentication process builds in an extra measure of security to verify your identity and your device, so you can manage your money and finances knowing your data is safe.",
    "histogram": {
        "1": 197,
        "2": 144,
        "3": 228,
        "4": 660,
        "5": 1554
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/DveUippCbpL8sB0Of5D7flW0FUE4eIjaq7UG4-Uj09wst75phQRMTfxy991NKMjJRTA=h310",
        "//lh3.googleusercontent.com/Bq4WyMeFuxghUNNI5UukKP_cI6wsnk4NYa7s1iLgNAhHGVl9IyEyWi-PRfTYKxX-H8g=h310",
        "//lh3.googleusercontent.com/9I_gfFUKnDLb5W7JrAjRBzEllUpFKBIs4I4ffxIK5La2RxyfRHx3wIPJvmPNO9Syl5M=h310",
        "//lh3.googleusercontent.com/JEBlhpsGMZnYwdvfGZWj3RmC1eIRH3YPsjH98T0zTZ4scQ67NHrtlACVloY1nouYMA=h310",
        "//lh3.googleusercontent.com/a6_w-iUqdY1xg6MzdRxEGETX2bC7XEjC0N4RRuXqsYQCSMTQZhUZJL4AJZUYQszkaf8=h310",
        "//lh3.googleusercontent.com/iYQ80nwIg2SOdIsqpQ4Xw28UT_VkW74ymKVuSFXstGRdQdA7ARW9PETA3HnDC9lnQA=h310",
        "//lh3.googleusercontent.com/y6cCW542-qiub1bvVSl2OJkcATUqdKmn-umwxHNZszYjJjYe2OOR5Vzf_GxgR0OB1Q=h310",
        "//lh3.googleusercontent.com/DvbGf-D1YF8lOUHNg1V6jbUyuwMetbMclNzLW5uqysztIl-GrqpEqdBTCk9l4i1JTdA=h310",
        "//lh3.googleusercontent.com/Nmzf95jxpYC345IZgNhnxE5G7D_I_3AJQfj-IBvDcntzaVK37srL0PIi5vnlwmldDg=h310",
        "//lh3.googleusercontent.com/wfBwcH7ABvbyzZ_DKH_dU2Nu6Fo4O6_XdqHqEOr2J4ds_NJY0-PHmDgD9dHT8Nw-Sb8=h310",
        "//lh3.googleusercontent.com/k_9KbABBpxRkdN0GWKjBzhyvmGYWJQtnYn2VrwxoXIfPrS3_T_WfVW1ZvA5Qe8qME7eM=h310"
    ],
    "video": "https://www.youtube.com/embed/oUfYw-ZZHtg",
    "comments": [
        "This is really a referral service for their investment advisory business.  Once you install, you will get never-ending calls and voice-mails.  They rotate phone numbers so it's not possible to block them.",
        "Best mobile app imho.  Mint has issues with authentication with constant txt alerts when I sign in.  Or it loses my sign in and I have to reenter it.  The addition of creating your own transaction categories makes this on feature parity.",
        "Could you please add a feature so I can compare individual investment accounts against S&P instead of all of my portfolio?  Keep up the amazing work!",
        "The app is ok but the Android app on my tablet doesn't offer the retirement planner. My iPhone has a scaled back version of retirement planner in the app but nothing on the tablet which I find odd. Everyone once  snd z whiled I'll have an account that won't update but the issues usually resolve themselves in a couple days.",
        "Horrible support, good app. Have had a ticket open for over five months about an account display issue. No one cares.",
        "Does not work. Hangs up \"Loading data...\" and never finishes. I deleted it and reinstalled it, but still hangs up and all I can do is crash it. For me, it is useless. (Using Galaxy S7, Android 7 Nougat)"
    ],
    "recentChanges": [
        "Improved login design and performance.",
        "Enhanced our support center via Settings.",
        "Bug Fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.personalcapital.pcapandroid&hl=en&gl=us",
    "appId": "com.personalcapital.pcapandroid"
}