{
    "title": "Just A Minute: Wear Watch Face",
    "summary": "Just A Minute is a minute-forward watch face for Android Wear. Now with Weather!",
    "icon": "//lh3.googleusercontent.com/_AG9OB5uLdPMdVxn_ofm0tOAjgNrv1zqembr65_X3BcjYVT05Q2KOV0ADnJlFy_PKw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 1200,
    "developer": "Sparkistic LLC",
    "developerId": "Sparkistic+LLC",
    "developerEmail": "support@sparkistic.com",
    "developerWebsite": "http://sparkistic.com",
    "developerAddress": "PO BOX 503691\nSAN DIEGO CA 92150-3691",
    "updated": "May 23, 2017",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Just A Minute™ is a minute-forward watch face design for Android Wear.Stuck in meetings all day and wonder how many minutes are left? Waiting for the bus you know comes in a few minutes? Just glance at your watch to see the minutes past the hour! Snap2Wear - snap a photo of your clothes and match the colors on your watch to your outfit! Interaction - choose tap action to change the configuration of your watch face (or turn off tap).Tip: Enable \"Screen Always On\" under settings so you never miss another minute!Just A Minute - make every minute countNote: The new permission \"read the contents of your SD card\" was added so you can take new photos and select existing photos from your gallery.(Huge thanks to Bane Tech for the promo video - check out his channel at https://www.youtube.com/channel/UCZxBAKuwPeRv0cUqir1JNHw)Use of this app constitutes agreement with Sparkistic, LLC's END-USER LICENSE AGREEMENT.http://sparkistic.com/eula",
    "descriptionHTML": "Just A Minute&#x2122; is a minute-forward watch face design for Android Wear.<br><br>Stuck in meetings all day and wonder how many minutes are left? Waiting for the bus you know comes in a few minutes? Just glance at your watch to see the minutes past the hour! <br><br>Snap2Wear - snap a photo of your clothes and match the colors on your watch to your outfit! <br>Interaction - choose tap action to change the configuration of your watch face (or turn off tap).<br><br>Tip: Enable &quot;Screen Always On&quot; under settings so you never miss another minute!<br><br>Just A Minute - make every minute count<br><br>Note: The new permission &quot;read the contents of your SD card&quot; was added so you can take new photos and select existing photos from your gallery.<br><br>(Huge thanks to Bane Tech for the promo video - check out his channel at https://www.youtube.com/channel/UCZxBAKuwPeRv0cUqir1JNHw)<br><br>Use of this app constitutes agreement with Sparkistic, LLC&apos;s END-USER LICENSE AGREEMENT.<br>http://sparkistic.com/eula",
    "histogram": {
        "1": 62,
        "2": 43,
        "3": 106,
        "4": 344,
        "5": 645
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/9u1Gbn1JBuMg7L9tDgjSl6b_ye75IpsUYqj2gOIrCGAEUQR9mfqrSD11RfP6y61ktA=h310",
        "//lh3.googleusercontent.com/vJp_3oVSeSDnsiXHdSJnntSejYNmS4w1AppZ5Y1DnE09ncPq-0FAA3unSaObrWx4dQU=h310",
        "//lh3.googleusercontent.com/cCHCztjGtXp3FRCmZaUV4fY8lIHKFXcljE_BkswxKcQW0ZVbsVttP-Z7RIEdpemkQZs=h310",
        "//lh3.googleusercontent.com/wWliivCmZm844v3xRNf0HOTYW4JWS6VuqzRggkqGI6ZdJ07frt6hkrA7eVVh-rlOEoY=h310",
        "//lh3.googleusercontent.com/nGa1qm143TeeSrOFuSyuUzo-WrBYpLy3NmheZg1GaK9gk7wXrjjzUknLD-zFonWFcgE=h310",
        "//lh3.googleusercontent.com/lS6n3kY-4xu3hWwtuGJ033IDtn3SFRDUi8c-adc8fs4WLGOepT9m6mSFLbwb_5tTSQ=h310",
        "//lh3.googleusercontent.com/WtvinIDj8VAVv_LgmxnX6zBDYwHlAe6YomQsFkUSlqJoK1sdGCoKlGhyuHAkkvxB8ck=h310"
    ],
    "video": "https://www.youtube.com/embed/7WjSINRiMZg",
    "comments": [
        "Yes! 24hr mode has been added as an option. I was waiting for this and now the watch face has it, I've purchased Pro after being a free user for a good while.  Pleased with the customisable options which accompany the purchase. The only thing which saves the face getting a full 5 stars is subscription weather. I hear what the dev says about the quality, but could we not at least have the option of a no cost (but not as accurate) setting? Echo others in hoping complications are on route also.  Nice, clean, usable face - thanks.",
        "This is growing to be my favorite watchface, but the unfortunate lack of an option for translucent peek cards is steering me away from it (since I cannot see the date / battery and even the hour sometimes when I have a notification compared to other face watches). Would certainly love having this feature on my Moto 360!",
        "It's great. Please add option to display Realfeel temperature and current temperature on watch face not just condition. I hope complications are coming soon. Thank you",
        "My favorite watchface so far. I hope complications are on the roadmap!",
        "App caused screen ghosting (dead unfixable pixes). Otherwise loved it. Have both versions.",
        "Feature Request: I like your app very much, but I've request that please add an option in which we can place hour in place of minutes and vice versa, I'll give you 5 stars indeed. Thanks"
    ],
    "recentChanges": [
        "** 3.5 - nowcast and temp on main watch face",
        "** 3.2 - new options: background color selection, battery percent dropdown, day-only display option",
        "** 3.1 - new options: show battery percentage, three-day weather forecast, and seconds arc",
        "** 3.0.7 - three new fonts",
        "NEW - Just a Minute 3.0 Release!",
        "* Now you can see the current weather on your watch face!",
        "* Questions or problems? E-mail us! support@sparkistic.com"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sparkistic.justaminute&hl=en&gl=us",
    "appId": "com.sparkistic.justaminute"
}