{
    "title": "Split Screen Watch Face",
    "summary": "Contrasting shades of numerals and colors makes your watch look wonderful.",
    "icon": "//lh5.ggpht.com/nB3nxR7UH2y2CTyBoXWzty-MpKdcNIq3yBb3wgPDzX7MYHpn4Y_WUR0jZ_-d9fOBLtQ=w300",
    "price": "$1.04",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.4,
    "reviews": 8,
    "developer": "Watch 360",
    "developerId": "8780140914012654870",
    "developerEmail": "sportswearapps@gmail.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37- A, Civic Centre, Bahria Town, Islamabad",
    "updated": "February 6, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Brilliantly designed watch face focus on rich user experience splits the useful information in to two half’s without confusing the weather with time. Customize your watch in style with the changing backgrounds and foreground colors. If you are not a fan of changing backgrounds and still want to keep your watch simple just select the solid background. Select between a wide range of Colors to set as background. Watch 360 focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look  • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Brilliantly designed watch face focus on rich user experience splits the useful information in to two half&#x2019;s without confusing the weather with time. Customize your watch in style with the changing backgrounds and foreground colors. If you are not a fan of changing backgrounds and still want to keep your watch simple just select the solid background. Select between a wide range of Colors to set as background. Watch 360 focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br><b>Key custom features:-</b><br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look  <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br><b>How it works?</b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. <br>Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 2,
        "4": 2,
        "5": 2
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh4.ggpht.com/V3wl2rTJgonRwoCXLF1frl-ex_1CtUxZy0Dhq8io45RMfNZ5iLp8SGdCghQIMIP5pQ=h310",
        "//lh6.ggpht.com/eOUSyAg6-lWqqOV0MDAxRLsh_NbYzFoxY5I9vWkHmr57YZ7KeTXUMAOvCCXYv8Egwvg=h310",
        "//lh4.ggpht.com/PL8dUOkiHYy6Ov9Gak8u_Y9k97DNRxkPSvz5hBgBEGYkWWgqx06lyx1juE1bKvG83A=h310"
    ],
    "comments": [
        "App crashes when trying to change colour give my refund back now.",
        "Decent looking watch face, but... Decent looking watch face, but every time I turn my watch off the face colour resets to green... Please fix!",
        "Good but... Very nice design but weather doesn't seem to update. Samsung gear live."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.watch360.material.split.watch.face.D01&hl=en&gl=us",
    "appId": "com.watch360.material.split.watch.face.D01"
}