{
    "title": "Street Art watch face",
    "summary": "Look street smart with these amazing street art watch faces",
    "icon": "//lh3.ggpht.com/iHjBw2HFzscb-HvPDOZhqzxcsdlFQEmFgp87Kp-dPqm9rR2mPkWgKNz46hp9oq8Brg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4,
    "reviews": 3206,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "ci-feedback@google.com",
    "developerWebsite": "https://www.google.com/culturalinstitute/",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "December 4, 2017",
    "version": "1.1",
    "genre": "Education",
    "genreId": "EDUCATION",
    "description": "A collection of beautiful street art watch faces from Google Art Project featuring the work of Aitch, Andre Fernandes Trindade, Cheko, DRAW, Drawing Jesus, Erik Otto, Gemeniano Cruz, God Mess, Hugo Lucas, Katch, L Is Not An Artist aka Luísa Cortesão, Mariana Dias Coutinho, Mercedes deBellard, Mercedes deBellard & Cheko, Nark, Nicolae Negura, Paulo Arraiano, Pedro Batista, Phibs, Reach, Samina, Slap, Sublinismo & Cheko, Tamara Alves & José Carvalho, The Empty Belly, Tinta Crua, and Will Barras.",
    "descriptionHTML": "A collection of beautiful street art watch faces from Google Art Project featuring the work of Aitch, Andre Fernandes Trindade, Cheko, DRAW, Drawing Jesus, Erik Otto, Gemeniano Cruz, God Mess, Hugo Lucas, Katch, L Is Not An Artist aka Lu&#xED;sa Cortes&#xE3;o, Mariana Dias Coutinho, Mercedes deBellard, Mercedes deBellard &amp; Cheko, Nark, Nicolae Negura, Paulo Arraiano, Pedro Batista, Phibs, Reach, Samina, Slap, Sublinismo &amp; Cheko, Tamara Alves &amp; Jos&#xE9; Carvalho, The Empty Belly, Tinta Crua, and Will Barras.",
    "histogram": {
        "1": 298,
        "2": 140,
        "3": 404,
        "4": 700,
        "5": 1664
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/DxLNaqAgFXiJJJueT2h2gyNM_6JPKX5EZaw0_aPrlBs2mi7dshGxrWE9fs-VajwrTxk=h310",
        "//lh3.ggpht.com/w5zOyDg2oAnSzRPMKo84-6s2L3bh6HhtkEonZecN4zHH1HWAVlj2gu2_1g3rmTFKRd0=h310",
        "//lh4.ggpht.com/1HCOmr4UEKvMMNbWTkcoUFHbRS5ifgSNdk47Nuwc7jAGSN2zQZUB0QvSj2UPDYNa0TQ=h310",
        "//lh4.ggpht.com/Fm8vDDBI4-3p9CD3Wr5DjY5IJa3MHJa93x5htlVdd2aQVIVwtVcyRz4I9cdg1pE-PQ=h310",
        "//lh5.ggpht.com/HvvsIvQNp3eJj8Vw2Lnpg0miGQlKWzHzDn5Th2djLU8d0wwjEQzEgmnpmNrZkLRWcHGU=h310",
        "//lh6.ggpht.com/tvgJlS7V8v2LUYgtveBHtghU2pKl13SvPK7j-fT6WB8C13Je4JD_Dko7yq0hXOdJjQ=h310",
        "//lh4.ggpht.com/SAS9XEXvBPa-SazlVTLPQ3B6Sl6_437JMOmzovNmt273VrCCta1qM-nrnVCaqfxaH1Y=h310",
        "//lh6.ggpht.com/_X8ObkN0JJhgMVAgMX439czba8WC_n0dXP_q_7YnpWdPj263BfleDz7WRQMspER4=h310",
        "//lh5.ggpht.com/ylWwcEqZQh-oMufIwbAw3HHNbEPVFcKQc4ajaOHSmVnyck-THcpTgbh_TBuGbzL7KA=h310",
        "//lh4.ggpht.com/we2iplw5RnGUUe-LqHZuNDzTHDyDJoPjLKpDCThs5tgSvOOZFJj8vikC3FmZKQrZuCI=h310"
    ],
    "comments": [
        "Reminds me of my favorite city I love Lanzhou in Gansu province China because there is street art all over the old downtown university district.  Street art is people art and it is lovely!  Lifts your spirit in celebration of human creativity!  Now it is on my watch!  Couldn't be happier.  Get a big old life-affirming jolt whenever I check the time.  Hoping for a refresh every now and then with new art, but don't want to lose my favorites.  It is on the watch FOR GOOD!",
        "Cool I love switching up my watch faces and I am not really comfortable with using the other popular apps for the mere face of battery life.  Some suck more juice than others.  This app is great, when folks notice my watch I always get \"WOW, that is cool\"!  Great app Google, keep up the good work!  For those that don't see the new watch face, I thought the same thing also, it takes a moment for it to sync to your phone after you download it.  I was about ready to call it junk and delete it also then BOOM, it showed up in the Android Wear app.",
        "Watch faces are cool, the Artist card is not so. I like the watch faces. I like the configuration on the phone. I'd prefer the digital time to be bigger.  I don't like the artist card being automatically displayed. I would not mind if the card was at the real bottom of my stack, so I could access the information if I wanted. I think that this would be the best behaviour, as the idea behind the watch and Google Now, is that the notifications are \"Pull Based\".  A simple configuration option regading the Artist Card where I could specify where the card appears, \"On Top\", \"On the Bottom\" or \"Disable the card\" appaeaing.",
        "Interesting and Colorful Some people aren't fond of the art label as a card, but I appreciate knowing the artist and identifying information. The colors on the watch numbers and hands are coordinated with the street art colors. The art changes frequently. What's not to like? Thank you, Google!",
        "Pretty but flawed Love the different and changing backgrounds,  they really are awesome. However they change so often that I have noticed a reasonable drain to battery over the course of a day. It would be great if there were options to limit the changes or just select one background rather than rotating every 15 minutes or so. Aside from that, it's good.",
        "My favorite watch face I really love the collection of art displayed and the frequency I get to see new pieces. I'd love an option to turn of the little cards that say the title of the work as they come up so often. The time a little higher on the Moto 360 would be nice as well. Lastly, the date isn't always very visible on some of the backgrounds but that's fine with me since I don't use it. More options!"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.apps.cultural.culturewear&hl=en&gl=us",
    "appId": "com.google.android.apps.cultural.culturewear"
}