{
    "title": "Microsoft OneDrive",
    "summary": "Access and share your photos, docs, and more from anywhere for free.",
    "icon": "//lh3.googleusercontent.com/fvcvos7yoV2ARXkiudyQlKEL8Hohf_o2juAu_fuY8KLmp5GMbdE4CISdRFGsWRE4PyU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.4,
    "reviews": 953767,
    "developer": "Microsoft Corporation",
    "developerId": "6720847872553662727",
    "developerEmail": "odrvhelp@microsoft.com",
    "developerWebsite": "http://answers.microsoft.com/en-us/windowslive/forum/skydrive?auth=1&tab=all",
    "developerAddress": "One Microsoft Way",
    "updated": "March 2, 2018",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Do more wherever you go with Microsoft OneDrive. Get to and share your documents, photos, and other files from your Android device, computer (PC or Mac), and any other devices you use. Use the Office mobile apps to stay productive and work together, no matter where you are. The OneDrive app for Android lets you easily work with your personal and work files when you’re on the go.• Quickly open and save OneDrive files in Office apps like Word, Excel, PowerPoint, and OneNote.• Easily find photos thanks to automatic tagging.• Get notifications when a shared document is edited.• Share albums of your favorite photos and videos.• Access your most important files offline.Notes: For you to sign in to OneDrive for Business, your organization needs to have a qualifying SharePoint Online or Office 365 business subscription plan. You cannot sign in with an account from an on-premises directory. Camera upload, search, sort, and the ability to add OneDrive for Business accounts are available only on devices running Android 4.0 or later.This app is provided by Microsoft. Data provided through the use of this store and this app may be accessible to Microsoft and transferred to, stored, and processed in the United States or any other country where Microsoft or its affiliates maintain facilities.",
    "descriptionHTML": "Do more wherever you go with Microsoft OneDrive. Get to and share your documents, photos, and other files from your Android device, computer (PC or Mac), and any other devices you use. Use the Office mobile apps to stay productive and work together, no matter where you are. The OneDrive app for Android lets you easily work with your personal and work files when you&#x2019;re on the go.<br><br>&#x2022; Quickly open and save OneDrive files in Office apps like Word, Excel, PowerPoint, and OneNote.<br>&#x2022; Easily find photos thanks to automatic tagging.<br>&#x2022; Get notifications when a shared document is edited.<br>&#x2022; Share albums of your favorite photos and videos.<br>&#x2022; Access your most important files offline.<br><br>Notes: <br>For you to sign in to OneDrive for Business, your organization needs to have a qualifying SharePoint Online or Office 365 business subscription plan. You cannot sign in with an account from an on-premises directory. Camera upload, search, sort, and the ability to add OneDrive for Business accounts are available only on devices running Android 4.0 or later.<br><br>This app is provided by Microsoft. Data provided through the use of this store and this app may be accessible to Microsoft and transferred to, stored, and processed in the United States or any other country where Microsoft or its affiliates maintain facilities.",
    "histogram": {
        "1": 42732,
        "2": 20614,
        "3": 56873,
        "4": 198930,
        "5": 634618
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/_M0uQX-UAMKcBfvLKKcmEgHpTkXWKwWOeQR9dCOjtc7Yn3f6Pl2nhuqQ42BtkYMTvw=h310",
        "//lh3.googleusercontent.com/Qn-roQ_ykXXgxTo4SSU6z4aJlnwvVJtXy1zErxfS20TccccQu0TMOwO_0MkPaZez-y4=h310",
        "//lh3.googleusercontent.com/NnniS44Asq9rqCAgf83MB3c9Ck_huk_Yed570sGWZJtDg2s9ige8tvKs9FvhodmucA=h310",
        "//lh3.googleusercontent.com/0ozXwUk127neHPdyNfc2hUpNMHcz3jlQA3pJM9aYjnNQYmboz27R5e5QBPzAPUyJMd4=h310",
        "//lh3.googleusercontent.com/s-oetWAz7YrcQQQtxJ5kZeVOeXmrK32m9XYQEry4w6F6kuwU2Lflu1eAoS5cGPKTCd0=h310",
        "//lh3.googleusercontent.com/5TkYgBmUBopv64ai0CQAWsM7F5KW47TJ7j-TJjcFO8qVe28Tr-STqa0Q7vQp-Lygvb3y=h310",
        "//lh3.googleusercontent.com/gbR0e--EPlZL_nyb0yxF_93NNRFcm9_AqaZ3OJBvy_Ey0uu9E79sUM6xXRBSks6zpsU=h310"
    ],
    "comments": [
        "No words, just great.",
        "I'm really tired of the issue with syncing folders which I've not chose to sync in the first place, looks like the app is acting on it's own. Am I really paying money for this kind of non sense? Please fix this issue. I don't want to spare any more of my money to this.",
        "You need to fix the sort folder because it keep changing evertime i   go in and out a folder and when you have lots of folder to deal with it, it become a pain trying repeat the same step sort to A-Z etc...you need to make the sort permanent not temporary. yes its a real pain i have repeat it every time i go in and out of folder...   Updates: i sort A-Z and when i go in and out of folder modified files it sort to oldest, its frustrating..i have to repeat everytime as mention on my previous comment. can you fix it please, make it a permanent sort thanks.",
        "BUGGY ++ Photos tab then Tags, then #People: thumbnails are all missing! Even if I leave app open for a long time, nothing changes. ++ I'd use the app every day if it had favorites so I could show off certain photos quickly.",
        "There are some bugs here and there. The sync is not instantaneous like dropbox and the app often struggles with large file upload. But the desktop app comes with windows 10 and works okay. I have office 365 and overall the experience is quite seamless.",
        "It is rubbish now when I go for upload a file it is not uploading. A msg give below \"turn on documents in setting&gt;installed app first\" what it is pls tell me what to do..."
    ],
    "recentChanges": [
        "Version 5.4:",
        "• Crop, rotate, and choose from new filters to digitize your physical world with our enhanced Scan feature",
        "• Quickly navigate and find photos from a long time ago in a place far far away with our new fast scroller in the Photo view",
        "• Save space on your phone by capturing photos and saving them directly to OneDrive within the app"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.microsoft.skydrive&hl=en&gl=us",
    "appId": "com.microsoft.skydrive"
}