{
    "title": "Angry Birds Aviator Watch Face",
    "summary": "Liven up your smartwatch with flying colours.",
    "icon": "//lh3.googleusercontent.com/2plCCr1VZo_p2LuOfOCs2DAIP60RyEgvkoOFkiIZQel0P_XgIC4kDq1VKJFneqwkTJo=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.6,
    "reviews": 3095,
    "developer": "Rovio Entertainment Corporation",
    "developerId": "9133452689932095671",
    "developerEmail": "support@rovio.com",
    "developerWebsite": "http://www.rovio.com",
    "developerAddress": "Rovio Entertainment Corporation\nKeilaranta 7,\nFI-02150 ESPOO\nFINLAND",
    "updated": "June 26, 2015",
    "version": "1.0.4",
    "genre": "Arcade",
    "genreId": "GAME_ARCADE",
    "description": "Liven up your smartwatch with flying colours.Pick your favourite Angry Birds character to style your smartwatch with vivid colours and the occasional angry outburst. If it’s a bad day, the birds get more angry. Wait for the clock hands to form an angry frown at 10:10.",
    "descriptionHTML": "Liven up your smartwatch with flying colours.<br><br>Pick your favourite Angry Birds character to style your smartwatch with vivid colours and the occasional angry outburst. If it&#x2019;s a bad day, the birds get more angry. Wait for the clock hands to form an angry frown at 10:10.",
    "histogram": {
        "1": 776,
        "2": 160,
        "3": 258,
        "4": 310,
        "5": 1591
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/5rqK2hRpjUWJzSblGIE6m8pfSO5kLjIlreNhQ00qG3IGs0cyxy07K6_k9owG5BRXA9o=h310",
        "//lh3.googleusercontent.com/CacRz0FpLQLdbeQkUdnqKlNdZjxXd1qOmqlK3LvHdiQPIgwwK9ig1Kfq77Y5EqDZNMk=h310",
        "//lh3.googleusercontent.com/QG2n9dblZvShZ78fFvSQfKfrRj_qk_Gik7x3YSRSJdluAG_1DBBQCri_ysZFcmczErQj=h310",
        "//lh3.googleusercontent.com/N3hPrstHs9YKo0qPzumdoPNDpH_SGVWRgSd19LYJWcTW10UXjBRNk4Lhf_095A9P9-s=h310",
        "//lh3.googleusercontent.com/LROkUSFGOJWBmXMFwosBXLVKfNmVccAJrFDIBLI9H36zB7G-Rav_GCsVCTdAPqxv7A=h310",
        "//lh3.googleusercontent.com/xXhpjw8m_cDsYgm3yxhKElSk4KN8dPrsjMOrFHyNANs-bcKYoyMqksoC7BQP5n3fdBQ=h310",
        "//lh3.googleusercontent.com/ev85OLnEUOXOYIXcPJo70wH4GxnX3-HYWcKQ25w1pGuc9cq_pqXSNm4i_YCKkYBBA4Lo=h310",
        "//lh3.googleusercontent.com/yXTkfleIFXN1_9bxUEfl4SL3QVheZ5YNlywbriaREk9ye-Qfm5uZ-dIq6hkjYJL8LpY=h310",
        "//lh3.googleusercontent.com/tRA_KgRkEc6hs1KvtMOYQd0YdFSLoNhIW97ZSF7e9TmlEofI0pmJsZv8Uj-zz7XLeQ=h310",
        "//lh3.googleusercontent.com/JFoPfFM1MoeehRFbP9woGhiMPkmVY6OrlZ_P_FZJ2I-lTNgvPBgdFtsK-q5H3r_qEg=h310",
        "//lh3.googleusercontent.com/PBX-2OW-MVRJdByqtFulgyMYOzoLboC5qpicyiD3nsLU1A5uzxFTaC74LEjlJ76Z52il=h310",
        "//lh3.googleusercontent.com/iyYj5gdey19kdOp2xbquUsMwhmQGVM8biI1OauK6ux6uG1nufvpBTSs0rYjLBgmchrg=h310"
    ],
    "video": "https://www.youtube.com/embed/nse6pQqSc8E",
    "comments": [
        "Actually a pretty good watchface After finally figuring out how to change the different watch face colours using the android wear app, it actually doesn't look bad on my Moto 360, very nice vibrant colours, and liking the way it looks as a whole on my wear watch! Only gripe I have, is that I can't change the shape of the watch hands, and the outer numbers around the clock, but other than that its looking rather good!",
        "OK watch face The watches are OK. Good on battery good readability. But ok on watch face. I would like to see the second hand represent the bird or pig character on the end of the second hand to give the illusion that the bird is flying like the game. Or a star wars version. You have room to improve.",
        "Huh. OK. So it works now. However, how does the \"angry meter\" work? And I really want to see the birds more often. What is the trigger for getting them to fly across the screen? More than a month with no updates or feedback.",
        "Good news for Wear users. This is very awesome to see a very acclaimed company like Rovio making a watch face or really several of them for Wear. It does have some kind of quirk about changing the different birds but it just took a couple of things to get it on whichever one I wanted. It's really polished looking down to the little details. I'm not sure if the anger meter is anything but random so it would be nice to have it hooked into something like heart rate or battery level. Nice to see the big boys making a free watch face!",
        "Works Install watch face. Ensure that it's installed on your phone by going to installed apps and verifying that you can uninstall it. Then go to Android Wear ensure that your watch is linked to your phone then review notifications on watch. review up to where Angry Birds watch face is shown as installed then tap and then it will be part of your selection of watch faces on the watch and on the phone",
        "love it so far but it seems stuck on the red watch face?  also, sometimes i get the flying bird animation, but i don't know what causes it.  would like to see it more often, but don't know what causes it.  i have it set to random faces, but only see the red face."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.rovio.angrybirds.aviator&hl=en&gl=us",
    "appId": "com.rovio.angrybirds.aviator"
}