{
    "title": "Popular Watch Face",
    "summary": "Funky watch design with 3 days weather and current battery update.",
    "icon": "//lh3.googleusercontent.com/n64cETebQekQs_FFRFb4zN23Bys4YcIBTjTkFsQ36rfSWA-XkF2dLdoYUFqmiarST-_b=w300",
    "price": "$1.03",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 1.9,
    "reviews": 9,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "May 20, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Add the colors to your life with this lively designed watch face for your smart wear. “Popular Watchface” is a funky watchface that has 7 multiple colored themes, weather report for three days i.e yesterday, today and tomorrow. With a large font, cool background and necessary options this watchface will be the best choice for you.  FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:- Multiple colored themes Digital dials with three days weather count watch and mobile battery meter Unique design with large font for easy reading Clean and simplistic look Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?It’s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Add the colors to your life with this lively designed watch face for your smart wear. &#x201C;Popular Watchface&#x201D; is a funky watchface that has 7 multiple colored themes, weather report for three days i.e yesterday, today and tomorrow. With a large font, cool background and necessary options this watchface will be the best choice for you.  <br><br>FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br>Key custom features:-<br><br>&#xF0EC; Multiple colored themes<br>&#xF0EC; Digital dials with three days weather count<br>&#xF0EC; watch and mobile battery meter<br>&#xF0EC; Unique design with large font for easy reading<br>&#xF0EC; Clean and simplistic look<br>&#xF0EC; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br>How it works?<br>It&#x2019;s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 4,
        "2": 2,
        "3": 3,
        "4": 0,
        "5": 0
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/9g57hAteeVjvbtOxdrpDELnzcRSxXTMkC4iWuSKsNgTi9Sca_b_vcwQqVmzRSRrmcEA=h310",
        "//lh3.googleusercontent.com/mFKtk9Uw9g7qPWLX1U89g3NPJ088AyGcjT5Nms65_lLL3qZ88cUYd9AH1NUvlApJ_w=h310",
        "//lh3.googleusercontent.com/Q-o6KGyogZ2K-OQnIztMwe3VuSmP16EjIBjVtoDcF1keXtLjPlYrE08r6lR7qlktX54=h310",
        "//lh3.googleusercontent.com/n8qhoU79MuMG_T_JdDWUryh_nooz3eYPEsssOQ-JZqr7btt-sqUf6_QM63CTFR0SfeU=h310"
    ],
    "comments": [
        "More functions please! I would like the addition of a date function and the option to show or hide the date,  show or hide the temperature,  show or hide the battery levels,  and make the battery level font larger so I can see it.  Thanks",
        "Same complaints as everyone else more options would raise it to a 5 star face",
        "Closes When You Open App Every time you go to edit watchface, it closes and says not responding.",
        "Needs more features 2 stars for now. When I can change °c to °f and/or change the color, I'll rate it again.... Side Note: Ppl that buy the pro version & send dev(s) an email.... It would be nice to respond.",
        "Paid wouldn't work Paid to unlock features but it wouldn't",
        "Options No Fahrenheit. No 24/12hr option."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.popular.digital.watch.face.D26&hl=en&gl=us",
    "appId": "com.frillroid.popular.digital.watch.face.D26"
}