{
    "title": "smartsays for Android Wear",
    "summary": "Memory action entertainment for smart people. It´s beautiful, fun &amp; challenging.",
    "icon": "//lh4.ggpht.com/eEv1e_Frv5yJ1oWItfVuNzzT__NsDQTXUStV9Or2Z4r9oT2cuzkFQZKcj_GmAdEJfA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.6,
    "reviews": 71,
    "developer": "Schlawinsky",
    "developerId": "Schlawinsky",
    "developerEmail": "info@smartsays.de",
    "developerWebsite": "http://www.smartsays.de",
    "updated": "February 3, 2015",
    "version": "1.1",
    "genre": "Casual",
    "genreId": "GAME_CASUAL",
    "description": "\"A Game! On Android Wear!\" androidpolice \"It’s the Final Frontier of Wrist Entertainment\" androidappsreview31 Best Android Wear Apps And Watch Faces. androidpolice \"Smartsays is all about giving you the ability to fulfill the need for quick, high-level memory training\" androidheadlines Do you think you are clever? A keen thinker? Treat yourself to a free, fun and unbelievably addictive brain workout exclusively released for your Moto 360 powered by Android Wear that will challenge your intelligence in the most entertaining way!  smartsays is designed to put your logic, memory and wit to the test through a series of free mini challenges. Enjoy each level while they become harder and harder or beat the ultra challenging genius mode and become a mastermind.  A scoring will measure how successfully you are solving the game and provide you with great achievements that show your cleverness. Equipped with high quality design and a detail orientated functionality, smartsays fulfills high aesthetic requirements and enables a sophisticated joy of use. Fans of the original Simon game will love the app as well as ambitious gaming friends born after the 70’s. Experience the heated “braintertainment” that will keep you on your toes! Highly recommended by players who enjoy Simon, Senso and brain teasers. Try it out, it´s free.Features:Enjoyable Gaming ModesChallenging DifficultiesMasterfully crafted ThemesTons of great AchievementsScore trackingComfortable pause modePlease note:smartsays is exclusively released for Moto 360.Make sure to pair your phone with the wearable device with help of the Android Wear App. This is still just the beginning – we can’t wait for everyone to join us! Do you have any suggestions or ideas for improvement? Any issues with the app? Please let us know. Feel the fun. Download it now.",
    "descriptionHTML": "<i>&quot;A Game! On Android Wear!&quot;</i> androidpolice <br><i>&quot;It&#x2019;s the Final Frontier of Wrist Entertainment&quot;</i> androidappsreview<br><i>31 Best Android Wear Apps And Watch Faces.</i> androidpolice <br><i>&quot;Smartsays is all about giving you the ability to fulfill the need for quick, high-level memory training&quot;</i> androidheadlines <br><br><br>Do you think you are clever? A keen thinker? Treat yourself to a free, fun and unbelievably addictive brain workout exclusively released for your Moto 360 powered by Android Wear that will challenge your intelligence in the most entertaining way! <br> smartsays is designed to put your logic, memory and wit to the test through a series of free mini challenges. Enjoy each level while they become harder and harder or beat the ultra challenging genius mode and become a mastermind. <br> A scoring will measure how successfully you are solving the game and provide you with great achievements that show your cleverness.<br> Equipped with high quality design and a detail orientated functionality, smartsays fulfills high aesthetic requirements and enables a sophisticated joy of use. Fans of the original Simon game will love the app as well as ambitious gaming friends born after the 70&#x2019;s.<br> Experience the heated &#x201C;braintertainment&#x201D; that will keep you on your toes! Highly recommended by players who enjoy Simon, Senso and brain teasers. Try it out, it&#xB4;s free.<br><br><br><b>Features:</b><br>Enjoyable Gaming Modes<br>Challenging Difficulties<br>Masterfully crafted Themes<br>Tons of great Achievements<br>Score tracking<br>Comfortable pause mode<br><br><br>Please note:<br><b>smartsays is exclusively released for Moto 360.</b><br>Make sure to pair your phone with the wearable device with help of the Android Wear App.<br> <br>This is still just the beginning &#x2013; we can&#x2019;t wait for everyone to join us! Do you have any suggestions or ideas for improvement? Any issues with the app? Please let us know.<br> <br>Feel the fun. Download it now.",
    "histogram": {
        "1": 16,
        "2": 1,
        "3": 9,
        "4": 11,
        "5": 34
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/q-Zq3RlwmpVdlk1s8b5zFBl5VujYdCsLms9qqXy5I8vsq1RP-Jy5ffYQE6Ombi7KMNA=h310",
        "//lh5.ggpht.com/mb8KxLGAY7QmtM6xG1XK0PGiKr9HSVb321AyrLmAFBXzATsm2NH4_op74yVQ-5Nix68=h310",
        "//lh6.ggpht.com/Y_huH1CbmL69HFCQkmQja4mGzEBHgS8YWD3VYAiRc7OIYGPafzlTtlXBmcLCh65DDQOq=h310",
        "//lh6.ggpht.com/0lSz1h3ntvflL1qXb7n2UZYuIQ-MW63sdMm1KyeP8dhKJzGiWYVQBtWLJF3NPuvlZwPa=h310",
        "//lh3.ggpht.com/Dzjo8XHBpntbKYI6DtF7tRAnGfOmpOzvQ9OnclHydUduvNEI3XW283DNVaDMCfeA8_I=h310",
        "//lh4.ggpht.com/Jh2c25GgEnqDF40V5uUoNLS92I9V-Yn-KkZ0cxQeR_y4SGbN_ms8rVTGbvfms1JqrwNj=h310",
        "//lh4.ggpht.com/-ftiJyziJFR-9Ag2gV4XjI9Lz6mGJmDbx1hwSkQaz7UOLbc5gjkQ_rdED5nAGVkOUQ=h310",
        "//lh6.ggpht.com/NNsoMB7kewLJihP9Em3rnvgqRGOQGiBzy5MNA14glsVlyXkf5Igct4PPsYzqZuRn_i77=h310"
    ],
    "comments": [
        "Fun and creative After reviewing this app again. I've found it has made a very clean and revamp of a classic game from the late 70's to 80's. One we all know and love. The redesign for my moto 360 had been done very well and looks very clean. Anyone who wants a game to play on there smartwatch should at least give this app a chance. There are a few bugs here and there. But no app is without them.",
        "Poor port It turns a screen on you watch which is weird, it doesn't fits screen, it's slow and unusable",
        "It will kill your time. It's a good time killer game. You will love it.",
        "It's challenging game! I enjoyed it a lot. Highly recommended for my friends.",
        "Just Great One of the best app for my Android wear. Very cool to use.",
        "I'm performing well in this game. It's definitely a good brain exercise game."
    ],
    "recentChanges": [
        "1. Skip sign in button added",
        "2. All Ads removed"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.schlawinsky.smartsays&hl=en&gl=us",
    "appId": "com.schlawinsky.smartsays"
}