{
    "title": "Watch Face TourbiBling Xtreme",
    "summary": "First watch face with complex gear animations. Impress everybody.",
    "icon": "//lh4.ggpht.com/fp7WY3sU99kNwduT8Jtncnqf4CK2ZM_RdU7bN7R_eudhRx70hYYV1QGkUFwK_eEX7xFs=w300",
    "price": "$1.06",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.6,
    "reviews": 12,
    "developer": "Scoon Design",
    "developerId": "Scoon+Design",
    "developerEmail": "scoondesign@gmail.com",
    "developerWebsite": "http://www.scoondesign.com",
    "developerAddress": "Dr. Plesmanlaan 156-160, 3601DE, Maarssen",
    "updated": "February 26, 2015",
    "version": "1.5",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "The TourbiBling is the ultimate smart watch face for Moto 360, LG Watch Round and other Google Wear smart watches. A square version is included. Hundreds of hours have been spent tuning TourbiBling. With the menu in the Google Wear app you can make all kind of combinations. Gold, Black or Steel metal parts. You can set the rotation speeds and combine metal colors. Please rate us positive if you like our work!Why the TourbiBling is the most awesome smart watch face:★ It has transparent animations and features an transparent power hand ★ All gears turn in a complex way to give you that realistic look★ It has the ultimate \"bling\" factor★ You can make 1728 combinations. You are getting a lot of watches in this app.★ You can choose between romans and numbers★ premium metals have been used to create the best apearance★ Many hours are invested in this design. It is the most complex watch face app today available.★ Future improvements and updates will follow...How to change/ build your ultimate TourbiBling:- buy and download our app and wait till the watch face shows up in your watch- select the TourbiBling by long clicking your watch face and then swiping to the left to see it. Or set it in the Android Wear app on your phone- when activated on your watch go to the settings of TourbiBling in the Android Wear app of your phone- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone- if our watch face doesn't show up in your watch please try to restart your watch. It can take some time to load this complex watch- pull your sleeve up so everybody asks what awesome watch you have on your wristSupport us and follow us on http://www.facebook.com/scoonwearhttp://plus.google.com/+scoondesignhttp://www.scoonwear.comMore complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "descriptionHTML": "The TourbiBling is the ultimate smart watch face for Moto 360, LG Watch Round and other Google Wear smart watches. A square version is included. Hundreds of hours have been spent tuning TourbiBling. With the menu in the Google Wear app you can make all kind of combinations. Gold, Black or Steel metal parts. You can set the rotation speeds and combine metal colors. <br><br>Please rate us positive if you like our work!<br><br>Why the TourbiBling is the most awesome smart watch face:<br>&#x2605; It has transparent animations and features an transparent power hand <br>&#x2605; All gears turn in a complex way to give you that realistic look<br>&#x2605; It has the ultimate &quot;bling&quot; factor<br>&#x2605; You can make 1728 combinations. You are getting a lot of watches in this app.<br>&#x2605; You can choose between romans and numbers<br>&#x2605; premium metals have been used to create the best apearance<br>&#x2605; Many hours are invested in this design. It is the most complex watch face app today available.<br>&#x2605; Future improvements and updates will follow...<br><br>How to change/ build your ultimate TourbiBling:<br>- buy and download our app and wait till the watch face shows up in your watch<br>- select the TourbiBling by long clicking your watch face and then swiping to the left to see it. Or set it in the Android Wear app on your phone<br>- when activated on your watch go to the settings of TourbiBling in the Android Wear app of your phone<br>- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone<br>- if our watch face doesn&apos;t show up in your watch please try to restart your watch. It can take some time to load this complex watch<br>- pull your sleeve up so everybody asks what awesome watch you have on your wrist<br><br>Support us and follow us on <br>http://www.facebook.com/scoonwear<br>http://plus.google.com/+scoondesign<br>http://www.scoonwear.com<br><br>More complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "histogram": {
        "1": 3,
        "2": 1,
        "3": 0,
        "4": 2,
        "5": 6
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/t0i9-py40ngLp8O2_YEV0vnsOpND9E5-lLlD728QwHgRRt7ba_hTujRE3QosKWC2taw=h310",
        "//lh5.ggpht.com/F3ROOZvo3Wi3cPmxO_ASca6rmJ4ubN1epAErfFnmQENdyClgMEZm3VKnxovKbHgR4A=h310",
        "//lh5.ggpht.com/YIPXcWML-AgMMQKDouy_ZCE_42FnOcnAzZaO3_RJBLSauhqNIZIyz3IDkcbO_8-rTfBm=h310",
        "//lh4.ggpht.com/lVTtdO8nRV2OeP9mZY-WcKninSIUx6ZtLwAl0KO5577rQFwRei0u3_KcCXZHozh4-1Q=h310",
        "//lh5.ggpht.com/lSyt0jlNm2ZW7OSllBxQI2jUHAD_HoXLh30m-vXoyxOWBmo7XakZe8oeY0bfwaUgcdE=h310",
        "//lh5.ggpht.com/-1ywV2bluJsjj9GlX0k5hJxaEkdcZAPEIUT_TDT6nXBf6cZPEdRF2YoaTgAzy8faCyhG=h310"
    ],
    "video": "https://www.youtube.com/embed/r_nuf4LGuOw",
    "comments": [
        "This my personal fav If you like beautifully designed skeleton watch faces with tons of movement, and highly configurable, then this is the face for you. What's more, you can actually adjust the time until the watch face dims, even up to 30 seconds. Amazing! You can keep the full design, with color  (but no movements)  visible in dim mode. The only downsides are that the watch is a little hard to read (like all skeletons) and it may use a little extra battery power.",
        "Battery drained within 2 hrs.Due to this app. I purchased this app couple hrs. ago. Two hrs later my moto 360 is at 9%. Please fix this issue. Never had this issue with any app. Thank you.",
        "Paid for it but does not show up in my phone and neither in my watch.ges I got conned",
        "Great",
        "Lol Charging for it? Fine. Personal advertising? No thanks, also laggy, refunded. - LG G Watch R"
    ],
    "recentChanges": [
        "v1.5 Fixed lag problem and added back in the animated power hand.",
        "v1.4 - Lag mitigated",
        "v1.3 - added option to increase watch screen timeout. On your phone, go to",
        "> Android Wear App",
        "> select Scoon Tourbibling as the active watch face",
        "> click on gear (for tourbibling settings)",
        "> scroll right to settings page",
        "> scroll to the bottom of the settings and select your desired watch screen timeout setting",
        "v1.1 - Reduced APK size"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.scoonwear.tourbibling&hl=en&gl=us",
    "appId": "com.scoonwear.tourbibling"
}