{
    "title": "Thunder Speed Aviator Watch",
    "summary": "Turn your Android wear into sporty time machine.",
    "icon": "//lh5.ggpht.com/SVvQ_4VXuFVdAK0_IuVQI2FLtXQPzvvhFkKdYPvGRs9LNtx4u0yvpPRvzStEJ-o2oQ=w300",
    "price": "$1.04",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 0,
    "reviews": 0,
    "developer": "Watch 360",
    "developerId": "8780140914012654870",
    "developerEmail": "sportswearapps@gmail.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37- A, Civic Centre, Bahria Town, Islamabad",
    "updated": "April 7, 2015",
    "version": "1.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Typical colors, such as black, green, beige and grey, highlight the model’s military-style design. Retaining the simple dial design with striking color contrasts and luminescent materials, the watch provides excellent legibility by day and night. Additionally, the small indicator at the top resembles a speedo meter defines mobile battery. Every feature is the result of the designer’s subtle ideas. Everything about this watch makes its wearers feel as if they are seated in the Thunder speed aircraft or Sports Car. Other than the dial and awesome design patterns this watch comes with Ambient Mode, Email Notification, Watch and Mobile battery indicator. Watch 360 focus on creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look • Military / police / Aviator Watch Face • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Typical colors, such as black, green, beige and grey, highlight the model&#x2019;s military-style design. Retaining the simple dial design with striking color contrasts and luminescent materials, the watch provides excellent legibility by day and night. Additionally, the small indicator at the top resembles a speedo meter defines mobile battery. Every feature is the result of the designer&#x2019;s subtle ideas. Everything about this watch makes its wearers feel as if they are seated in the Thunder speed aircraft or Sports Car. Other than the dial and awesome design patterns this watch comes with Ambient Mode, Email Notification, Watch and Mobile battery indicator. Watch 360 focus on creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br><b>Key custom features:-</b><br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Military / police / Aviator Watch Face <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br><b>How it works?</b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. <br>Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 0
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh3.ggpht.com/JxOxwahk38KRWc9o-fCT5HOVCd64oV9yq-OgUGv_LfA5UFhpgVVLmJ0n25Kq5mCwL-8=h310",
        "//lh5.ggpht.com/oS9Ncb1cB56Tkva2P00KrbXOX-F3Jtq3LiXhldcy-iKFNbV6RLvYXA03RQiKxlIgU3Yj=h310",
        "//lh6.ggpht.com/kZVj2jkaNLZeJ_ivFPtpKk0HKO6opT_xpuUweAMV_RvgFNaGubBQJ2Go_gZASprjyg=h310",
        "//lh6.ggpht.com/fpvuaFk10n14Wl6vRNzwFp1H4Szb7JNhI0Fb2ue14hc_OVBjoniCmDuVQ-p66UV4ySc-=h310",
        "//lh5.ggpht.com/l9bxBkxdhVs_O9z4bNmVFk4al6nzerKuV-E3zNtPThFdm2ywr9sFJWLWNITrpMZhaQ=h310"
    ],
    "comments": [],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.watch360.speed.aviator.watch.face.A01&hl=en&gl=us",
    "appId": "com.watch360.speed.aviator.watch.face.A01"
}