{
    "title": "Sunrise Sunset Watch Face",
    "summary": "See sunrise or sunset on a 12 hour clock with twilight periods highlighted.",
    "icon": "//lh3.googleusercontent.com/s2zl_NIHEXuyiWdGnh0eVwxI0IFcESel3_GyhFfDGjJpL0gYC_YDmZAn3n7tIasDkaQ=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.8,
    "reviews": 83,
    "developer": "CritterMap Software LLC",
    "developerId": "CritterMap+Software+LLC",
    "developerEmail": "support@crittermap.zendesk.com",
    "developerWebsite": "http://www.backcountrynavigator.com/",
    "developerAddress": "Camas WA 98607",
    "updated": "March 21, 2016",
    "version": "1.6",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "This Watch Face for Android Wear allows you to see the sunrise and sunset times for the day,as well as twilight periods.  You can see at a glance the daylight you have left  and when to expect the sunrise or sunset. Sunlight Watch Face is meant for an Android wear smartwatch such as Asus ZenWatch, LG G, Sony Smartwatch 3, Moto 360, Samsung Gear Live. To choose the new Watch Faces, choose it in the Wear app on your phone, or Long Click on the watch face on the watch. You should see \"Sunrise Sunset\" as one of the choices. Please allow some time after downloading for it to show up there. It is not intended for those that are not Android Wear watches, such as Gear 2 or Gear S or Pebble.  It does not have any widget for phone or tablet, but a similar watch, Sunlight Watch Face and Widget, does. The daylight clock shown is calculated based on your rough location, current time, and a great deal of math. No need for constant retrieval from the internet or sunset calendar. Think of it as a sunrise and sunset calculator in graphical form. The following information is shown on the watch:-The time in analog format-The time in digital format-The Day of the week-The Date-A battery symbol showing the battery life left on your watch. Color highlights around the edge of the dial illustrate the solar day. It includes: -The daylight hours highlighted in light blue-Civil Twilight Period - yellow preceding sunrise and orange following sunset-Nautical Twilight Period - dark blue before or after Civil Twilight-Astronomical Twilight - shown in purple. -Nighttime hours- shown as dark. There are three common subcategories of twilight, represented on the sunrise sunset clock (summarized from Wikipedia):Civil Twilight is a time when the sun is below the horizon, but there is generally enough light to carry out outdoor activities without artificial light. The brightest stars become visible as this ends. In Nautical Twilight, the horizon is indistinct, and general outlines of land features can be seen,  It is considered to end when navigation by the horizon at sea is no longer possible. Astronomical Twilight may appear to be fully dark. Point sources of light such as stars are easily observable at its beginning, but dimmer sources, like distant galaxies, are only visible as it ends. Now that your Android Wear watch tells you sunrise and sunset times, you can use that information to support your outdoor activities. Use it to determine hunting times, fishing times, hiking times, or photography times.  Any activity which relies on a certain amount of sunlight should be enhanced. Recommended for Landscape photography. Use to find the time of a great sunset or the time of a great sunrise. Take pictures or simply enjoy the rising or setting of the sun. Watch the sunset or sunrise. The watch face has an alternate face for dim/ambient mode to save battery life. This is a 12 hour clock face depicting sunrise in the morning and sunset in the evening.Before noon, it will be a sunrise calculator, and after noon, a sunset calculator.Get this Sunrise Sunset Watch Face for Android Wear today!",
    "descriptionHTML": "This Watch Face for Android Wear allows you to see the sunrise and sunset times for the day,as well as twilight periods. <br> <br>You can see at a glance the daylight you have left  and when to expect the sunrise or sunset. <br><br>Sunlight Watch Face is meant for an Android wear smartwatch such as Asus ZenWatch, LG G, Sony Smartwatch 3, Moto 360, Samsung Gear Live. <br><br>To choose the new Watch Faces, choose it in the Wear app on your phone, or Long Click on the watch face on the watch. You should see &quot;Sunrise Sunset&quot; as one of the choices. <br>Please allow some time after downloading for it to show up there. <br><br>It is not intended for those that are not Android Wear watches, such as Gear 2 or Gear S or Pebble.  It does not have any widget for phone or tablet, but a similar watch, Sunlight Watch Face and Widget, does. <br><br>The daylight clock shown is calculated based on your rough location, current time, and a great deal of math. No need for constant retrieval from the internet or sunset calendar. Think of it as a sunrise and sunset calculator in graphical form. <br><br>The following information is shown on the watch:<br>-The time in analog format<br>-The time in digital format<br>-The Day of the week<br>-The Date<br>-A battery symbol showing the battery life left on your watch. <br><br>Color highlights around the edge of the dial illustrate the solar day. It includes: <br>-The daylight hours highlighted in light blue<br>-Civil Twilight Period - yellow preceding sunrise and orange following sunset<br>-Nautical Twilight Period - dark blue before or after Civil Twilight<br>-Astronomical Twilight - shown in purple. <br>-Nighttime hours- shown as dark. <br><br>There are three common subcategories of twilight, represented on the sunrise sunset clock (summarized from Wikipedia):<br>Civil Twilight is a time when the sun is below the horizon, but there is generally enough light to carry out outdoor activities without artificial light. The brightest stars become visible as this ends. <br>In Nautical Twilight, the horizon is indistinct, and general outlines of land features can be seen,  It is considered to end when navigation by the horizon at sea is no longer possible. <br>Astronomical Twilight may appear to be fully dark. Point sources of light such as stars are easily observable at its beginning, but dimmer sources, like distant galaxies, are only visible as it ends. <br><br>Now that your Android Wear watch tells you sunrise and sunset times, you can use that information to support your outdoor activities. <br><br>Use it to determine hunting times, fishing times, hiking times, or photography times.  Any activity which relies on a certain amount of sunlight should be enhanced. <br><br>Recommended for Landscape photography. <br><br>Use to find the time of a great sunset or the time of a great sunrise. Take pictures or simply enjoy the rising or setting of the sun. Watch the sunset or sunrise. <br><br>The watch face has an alternate face for dim/ambient mode to save battery life. <br>This is a 12 hour clock face depicting sunrise in the morning and sunset in the evening.<br>Before noon, it will be a sunrise calculator, and after noon, a sunset calculator.<br><br>Get this Sunrise Sunset Watch Face for Android Wear today!",
    "histogram": {
        "1": 11,
        "2": 4,
        "3": 13,
        "4": 21,
        "5": 34
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/5lZu3GV71hLB3uG2zudsGHnkzJce7JaGYAhgXetirPs6h9YCEXGtf4PMahYbbreeyzM=h310",
        "//lh3.googleusercontent.com/b_dQerv090o9AbSm7IfNcNKfMz5UpW_wMonOz35C7AABNOa8IfbHQIt8KMdb0fLVDnLr=h310",
        "//lh3.googleusercontent.com/BxRrCVSm3zwr7VbVHKpq5DQOpwHdF57WTDdN_X1SFS6H-oyeRZVUt2VNikEk4oXOevg=h310",
        "//lh3.googleusercontent.com/x-HkEgMleJKrEBDhT2jJSVb-ZP-f_qLoKN-URFrrUSlrwwEyfU-dmirVVRb-fPB73LOA=h310",
        "//lh3.googleusercontent.com/achs_C_v1NZGibkIEunKY0kKB-tUXienogbrh_xWaU-kpwj8FFIfqAZtGl340-KGKHA=h310",
        "//lh3.googleusercontent.com/4b01pepLJDOxv95i6wT57lTzdBjWO5CYK_eznq0lA5I2oGWb29lihvv0OfNgtRvQdYne=h310",
        "//lh3.googleusercontent.com/gcy8Q-ZzLszRx76u7ATC67eXERWiNpSrgMsOCF7KEOO5V6Wi3OI_RjKHp4wsLKoT8Q=h310",
        "//lh3.googleusercontent.com/pqLKc7oMZXxFGD_xSOBNigCbLdwkexZvS_VRv0bJ6jiEKCac6AdGw9mO2iS53JhrPGk=h310",
        "//lh3.googleusercontent.com/jVzfop0sSTKO7J6tTH7zFKUW9G2LvAd03XMTOxTtNre7EHuLM2B3jVRYVACQXgr54VQ=h310",
        "//lh3.googleusercontent.com/BULFvfXkq-EruvZsrjLDAgLYQPH5GUfE4IQk3WthvG_ZAyJNxqXM8l5Kt8p50Fq72vdq=h310",
        "//lh3.googleusercontent.com/u4zi1MwwMJZk4SnSDEh1ZLuFGDUGLstokLea28zT1WVtWjBibdiOPBJNZglBEHO7XuQ=h310",
        "//lh3.googleusercontent.com/0Pmi1_pIu-avchWdUHVW4J0fuCareFqtaxu8rfd92PcMFLaJ5a7BjEy50oyMG7IGapn7=h310"
    ],
    "comments": [
        "Simple yet awesome This watch face is perfect is artistic yet simple and accurate it looks good but at the same time entirely functional with a purpose and very accurate this is a must buy!!!",
        "Looks great on my Huawei Watch",
        "I hoped this watch face would tell me when it was going to get dark (and eventually light) at my location.  Apparently there are several definitions for what dark is and this one displays them all, sacrificing clarity for quantity of information.  It isn't configurable so you're stuck with all three \"darks\".",
        "Simple yet elegant I love this watch face! The only thing I would add is battery monitor for the phone.",
        "Doesn't work on moto 360 sport, constantly crashes on watch.",
        "Doesn't work on moto 360 2nd gen"
    ],
    "recentChanges": [
        "Fix for issues seen with 6.0+ Android Wear Watches.",
        "Request location permission on watch.",
        "Fixed: toggle Day of Week on and off.",
        "Ability to toggle items off in phone side configuration.",
        "More distinct hands in ambient mode.",
        "Eliminate dividing lines in ambient mode.",
        "Fine tuning for different densities"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.crittermap.watchface.sunrisesunset&hl=en&gl=us",
    "appId": "com.crittermap.watchface.sunrisesunset"
}