{
    "title": "Floral - Watch Face",
    "summary": "~ A new Cute Watchface to face every moment of your day :) ~",
    "icon": "//lh3.googleusercontent.com/LTJLZFYEtWNObKkMj_35Ta1W9zTsM1-VYEf4OhLYqagJqml-YswT8D6PKZWoQ84rdqLq=w300",
    "price": "$1.05",
    "free": false,
    "minInstalls": 10,
    "maxInstalls": 50,
    "score": 2.7,
    "reviews": 3,
    "developer": "MhzDev",
    "developerId": "6985403505057651878",
    "developerEmail": "quantumdust.mobile@gmail.com",
    "developerWebsite": "http://www.mhzdev.com",
    "developerAddress": "Rome (RM) - 00010\nItaly",
    "updated": "April 30, 2015",
    "version": "1.3",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Floreal is a simple and beautiful WatchFace for your Smartwatch.Floral has a digital interface plus a smooth second hand, you can choose between five beautiful floral backgrounds to face every moment of your day.This Watchface is compatible with all Android Wear Smartwatches (Moto 360, G Watch R, Asus Zenwatch, etc.)Features:✔ Support both round and square displays✔ Different background that can be changed every time you want✔ Displayed additional information like numeric date and analog second✔ Customizable date and theme✔ Intregrated configurations options (Both Watch and Phone)How to use:● Once you install the app, the watchface will be automatically transferred to your watch. (may take a few minutes)● Select the watchface by long press your current watchface and select the one that you have installed.● The customization options are accessible by long pressing the watch face, or directly from the Android Wear app.● Enjoy your new beautiful Watchface!Note:● If you’re not satisfied, you can get a refund within 15 minutes from the purchase.● If you have a problem, before express a bad rating, please give us a chance to help you, Send a feedback to  quantumdust.mobile@gmail.com● Like this watchface? Check out our other cool watchfaces! http://goo.gl/3onPw7Follow MhzDev on Google+: http://goo.gl/Uo9KEE",
    "descriptionHTML": "<b>Floreal</b> is a simple and beautiful WatchFace for your Smartwatch.<br>Floral has a digital interface plus a smooth second hand, you can choose between five beautiful floral backgrounds to face every moment of your day.<br><br>This Watchface is compatible with all Android Wear Smartwatches (Moto 360, G Watch R, Asus Zenwatch, etc.)<br><br><b>Features:</b><br>&#x2714; Support both round and square displays<br>&#x2714; Different background that can be changed every time you want<br>&#x2714; Displayed additional information like numeric date and analog second<br>&#x2714; Customizable date and theme<br>&#x2714; Intregrated configurations options (Both Watch and Phone)<br><br><b>How to use:</b><br>&#x25CF; Once you install the app, the watchface will be automatically transferred to your watch. (may take a few minutes)<br>&#x25CF; Select the watchface by long press your current watchface and select the one that you have installed.<br>&#x25CF; The customization options are accessible by long pressing the watch face, or directly from the Android Wear app.<br>&#x25CF; Enjoy your new beautiful Watchface!<br><br><b>Note:</b><br>&#x25CF; If you&#x2019;re not satisfied, you can get a refund within 15 minutes from the purchase.<br>&#x25CF; If you have a problem, before express a bad rating, please give us a chance to help you, Send a feedback to  <b>quantumdust.mobile@gmail.com</b><br>&#x25CF; Like this watchface? Check out our other cool watchfaces! http://goo.gl/3onPw7<br><br><b>Follow MhzDev on Google+:</b> http://goo.gl/Uo9KEE",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 0,
        "4": 0,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/IpB4MDnsEm0qQl5YAZ9pLNnfQzBw3yzDI0zETe_n6ezoE3bLrbUWsUBd_05IbonIT6c=h310",
        "//lh3.googleusercontent.com/QIX59Tp6It2-rRCebwHMAJhJhxYHSj1Gwi9IXbjxTvO8jC3Zs2ra9sPNNgzByNhLGLyu=h310",
        "//lh3.googleusercontent.com/L0Esk9uUKeQpymS_xoB6Vg4iGSE_OL0StCFUqAu3gCLYYWXfmnoN0i31zfRYBMdbvBA=h310"
    ],
    "comments": [
        "Only 24 hr? I think I had it on 12 hr at one point but now it's definitely on 24hr again. So am I crazy or is there a way to switch it that I unconsciously discovered? Anyway, I can't do it again if there is. I have emailed about this and gotten no response. Ugh.",
        "12 hour needed! Would like better if 12 hour was selectable"
    ],
    "recentChanges": [
        "- Minor Bugfixing"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mhzdev.watchface.floral&hl=en&gl=us",
    "appId": "com.mhzdev.watchface.floral"
}