{
    "title": "Brown Watch Face for Moto 360",
    "summary": "Have look on the First Edition of Frillroid&#39;s Classic Brown Watchface FR-A03",
    "icon": "//lh6.ggpht.com/HyLGuG7ICEinAXWJuTBy01LePoE5FInQco62Od0TbNizIQSNF5XJLQDqS6ungbicrFQ=w300",
    "price": "$1.03",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 5,
    "reviews": 2,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "January 14, 2015",
    "version": "1.6",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Have look on the First Edition of Frillroid's FR-A03Keep up with the times with this futuristic and fashionable analogue watch design. This watch face combines high precision with style and elegance. This Watchface provide lot of features as below•\tAnalogue view of time and Date•\tBeautiful blue background•\tRemaining battery life of your device so you exactly know when to chargeThis elegant design provides both date and time information along with the remaining battery information and supports Motorola Moto 360, LG G Watch, LG G WATCH R, Samsung Gear LIVE (not for Gear or Gear 2)How it works?It’s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen.",
    "descriptionHTML": "<b>Have look on the First Edition of Frillroid&apos;s FR-A03</b><br><br>Keep up with the times with this futuristic and fashionable analogue watch design. This watch face combines high precision with style and elegance. This Watchface provide lot of features as below<br><br>&#x2022;\tAnalogue view of time and Date<br>&#x2022;\tBeautiful blue background<br>&#x2022;\tRemaining battery life of your device so you exactly know when to charge<br><br>This elegant design provides both date and time information along with the remaining battery information and supports Motorola Moto 360, LG G Watch, LG G WATCH R, Samsung Gear LIVE (not for Gear or Gear 2)<br><br><b>How it works?</b><br>It&#x2019;s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen.",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 2
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/rivh9iRiZO10uyOEuvKzAMbstKvsTiPDj10AZR7LE5HVGx67lbX_VW8Y441J6lmmZQ=h310",
        "//lh4.ggpht.com/6eWIRt97BXTGZzHrqvdYOpfdRivBp86B8vftLnpvE7-o9aK42U85BQgoqUM_NozLWQ=h310",
        "//lh5.ggpht.com/deZKT2ajwP5lQTyBpsbkbUNX9Tef7OVTxdeiQUo5DCZvsIVahOdUrPmq0ZOI8akWuyxv=h310"
    ],
    "comments": [
        "Nice design. Very simple, thin, overall nice design. You've earned my dollar. Any way to remove the battery indicator though?",
        "wow brown is my fav colors,  i like it"
    ],
    "recentChanges": [
        "Now compatible for all devices",
        "Fixed UI Bugs"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.fra03&hl=en&gl=us",
    "appId": "com.frillroid.fra03"
}