{
    "title": "Plainpalais Index - Watch Face",
    "summary": "Make your smartwatch a REAL looking watch (square and round shape)",
    "icon": "//lh3.ggpht.com/i1n6gl5OcR6JB2BUOtuDN-eHTbudDwovjtOKIgo6wwvbdP_cu_p0TtIiI4goK7bFfw=w300",
    "price": "$1.11",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.7,
    "reviews": 16,
    "developer": "OMITSIS",
    "developerId": "OMITSIS",
    "developerEmail": "android@omitsis.com",
    "developerWebsite": "http://omitsis-barcelona.com",
    "developerAddress": "Casp 162 2nd floor (Fain building), 08013 Barcelona, Spain",
    "updated": "March 29, 2016",
    "version": "2.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Let your watchface look like a real watchOmitsis presents the most carefully designed watch face for Android Wear. ‘Plainpalais ’ is the second of a series of watch faces created by T. Hugo, a professional watch designer based in Berlin, Germany.Plainpalais IndexPlainpalais – A homage to one of the epicentres of watchmaking, This is a place where reading the time is a philosophy. Tags: smartwatch, Face, wear, androidwear, watchface, watch face, smartwatchface, watch, white, luxury, elegantCompatible watches: LG G Watch, Samsung Gear Live, Motorola 360  (Moto 360).",
    "descriptionHTML": "Let your watchface look like a real watch<br><br>Omitsis presents the most carefully designed watch face for Android Wear. &#x2018;Plainpalais &#x2019; is the second of a series of watch faces created by T. Hugo, a professional watch designer based in Berlin, Germany.<br><br>Plainpalais Index<br><br>Plainpalais &#x2013; A homage to one of the epicentres of watchmaking, This is a place where reading the time is a philosophy. <br><br>Tags: smartwatch, Face, wear, androidwear, watchface, watch face, smartwatchface, watch, white, luxury, elegant<br><br>Compatible watches: LG G Watch, Samsung Gear Live, Motorola 360  (Moto 360).",
    "histogram": {
        "1": 2,
        "2": 2,
        "3": 2,
        "4": 3,
        "5": 7
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/mkn34qb5nN5Gd3D7GvmyaCr4v5lcv_qHraRKDn1pTGs80XOc9ui9e9k0z6T38DJZEw=h310",
        "//lh3.ggpht.com/FjUa3Pv847P-puaGGtYfAHzToaL2oE49Pw1OKO-5l5eDCc8NiPOUXY6t8i3GQu8inwI=h310",
        "//lh4.ggpht.com/Nr3D1AMBNYeoUa3y59dpfdVSiaLUmb4rTwRbVL1EQJTVV_aJ_DtIbH-DUwBkplnmqRe8=h310"
    ],
    "comments": [
        "Excellent Quite likely the most beautiful face I've seen for square watches.",
        "Great Watch Face But, it's a battery drainer on the LG watch R",
        "How to install I paid for this and it said installed but I can't figure out how to make it appear on the moto 360 watch. Someone help please",
        "Beauty in a watch face Love the look of this,  nicer to have an option for the date",
        "The nicest round face i own! It looks so so nice in my MOTO 360!  all the people keeps staring at it :) That face became my favorite!",
        "Chris Chang It'd be great if you had the option of having a black face color all the time.  It would be a much smoother and less noticeable transition from active to standby and it would give the option for smoother blending with the edges of the watch (I use the Gear Live, which has a black frame)."
    ],
    "recentChanges": [
        "The pivot point of the second hand is now centered"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.omitsis.pocket.index&hl=en&gl=us",
    "appId": "com.omitsis.pocket.index"
}