{
    "title": "Watch Face The Tourbinator",
    "summary": "Most complicated animated watch face in the world. With accelerometer &amp; weather!",
    "icon": "//lh3.ggpht.com/XSK7KEFQsNU2zIHq-A7WnC3Gkwc2-zBror3KaBt8BZ3wOpbrI2YRwYyWVafZ9dFG46k=w300",
    "price": "$1.35",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.5,
    "reviews": 93,
    "developer": "Scoon Design",
    "developerId": "Scoon+Design",
    "developerEmail": "scoondesign@gmail.com",
    "developerWebsite": "http://www.scoondesign.com",
    "developerAddress": "Dr. Plesmanlaan 156-160, 3601DE, Maarssen",
    "updated": "December 22, 2015",
    "version": "2.08",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "You want a watch that would cost 1.5 million USD in real life. This watch face is unique and no copy. The Tourbinator is the most complicated watch face available at this moment. It took hundreds of hours to make these complex animations to work. The whole complex gears animation rotates as a whole when tilting wrist because of the programmed accelerometer. You can change settings live and on the watch. No need to do this in your mobile phone.This watch is made for Android Wear watches like the Motorola 360 and the LG G Watch Round. It includes a square dial so it can be used on square watches like the LG ZenWatch.Please rate us positive if you like our work! Don't give a bad rating too soon. We see that some users don't know to find a setting. We can help you with that. Setting the second hand to \"tick\" will halt all animations. This setting is only for a slower watchWhy the Tourbinator is the most fantastic smart watch face:★ It has complex transparent animations★ Weather information is available★ You can set options live on the watch by swiping and ticking★ All gears turn in a complex way to give you that realistic look★ It has the ultimate millionairs factor★ You can make 1280 combinations. You are getting a lot of watches in this app.★ You can choose for skeleton look or set beautiful dials★ premium metals have been used to create the best apearance★ Many hours are invested in this design. It is the most complex watch face app today available.★ You can set date and power indicators and their location★ You can choose analog or digital indicators★ You can choose modern style or classic hands★ Also features a square design★ Future improvements and updates will follow... How to change/ build your ultimate Tourbinator:- buy and download our app and wait till the watch face shows up in your watch- select the Tourbinator by long clicking your watch face and then ticking the gear symbol below. Or set it in the Android Wear app on your phone- when activated on your watch go to the settings of Tourbinator in the Android Wear app of your phone- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone- if our watch face doesn't show up in your watch please try to restart your watch. It can take some time to load this complex watch- change your preferences by long clicking the watch face. Then swipe up. Swipe and tick to select.- pull your sleeve up so everybody asks what awesome watch you have on your wristSupport us and follow us on http://www.facebook.com/scoonwearhttp://plus.google.com/+scoondesignhttp://www.scoonwear.comMore complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "descriptionHTML": "You want a watch that would cost 1.5 million USD in real life. This watch face is unique and no copy. <br>The Tourbinator is the most complicated watch face available at this moment. It took hundreds of hours to make these complex animations to work. The whole complex gears animation rotates as a whole when tilting wrist because of the programmed accelerometer. You can change settings live and on the watch. No need to do this in your mobile phone.<br><br>This watch is made for Android Wear watches like the Motorola 360 and the LG G Watch Round. It includes a square dial so it can be used on square watches like the LG ZenWatch.<br><br><b>Please rate us positive if you like our work! Don&apos;t give a bad rating too soon. We see that some users don&apos;t know to find a setting. We can help you with that. Setting the second hand to &quot;tick&quot; will halt all animations. This setting is only for a slower watch</b><br><br>Why the Tourbinator is the most fantastic smart watch face:<br>&#x2605; It has complex transparent animations<br>&#x2605; Weather information is available<br>&#x2605; You can set options live on the watch by swiping and ticking<br>&#x2605; All gears turn in a complex way to give you that realistic look<br>&#x2605; It has the ultimate millionairs factor<br>&#x2605; You can make 1280 combinations. You are getting a lot of watches in this app.<br>&#x2605; You can choose for skeleton look or set beautiful dials<br>&#x2605; premium metals have been used to create the best apearance<br>&#x2605; Many hours are invested in this design. It is the most complex watch face app today available.<br>&#x2605; You can set date and power indicators and their location<br>&#x2605; You can choose analog or digital indicators<br>&#x2605; You can choose modern style or classic hands<br>&#x2605; Also features a square design<br>&#x2605; Future improvements and updates will follow... <br><br>How to change/ build your ultimate Tourbinator:<br>- buy and download our app and wait till the watch face shows up in your watch<br>- select the Tourbinator by long clicking your watch face and then ticking the gear symbol below. Or set it in the Android Wear app on your phone<br>- when activated on your watch go to the settings of Tourbinator in the Android Wear app of your phone<br>- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone<br>- if our watch face doesn&apos;t show up in your watch please try to restart your watch. It can take some time to load this complex watch<br>- change your preferences by long clicking the watch face. Then swipe up. Swipe and tick to select.<br>- pull your sleeve up so everybody asks what awesome watch you have on your wrist<br><br>Support us and follow us on <br>http://www.facebook.com/scoonwear<br>http://plus.google.com/+scoondesign<br>http://www.scoonwear.com<br><br>More complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "histogram": {
        "1": 19,
        "2": 10,
        "3": 8,
        "4": 14,
        "5": 42
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/zFgDgtNYI9BTnJ4r5UlHaOzZ-oMDBqUYR7JcpMpnOX4uhmJAe05UdYABd97jwfQojQoP=h310",
        "//lh5.ggpht.com/CGbAB5xjc4V7HQzbXRPScYBo_VDm99c3e8yPCpY06hl9XPWqToS1DoXzU3JGFiKgAg=h310",
        "//lh3.ggpht.com/5UfCrkl11RoImSSz7G2akr0JJhhGozcbYQJcPCGULm6NIz21qI2JlEnKP93UyzWSh80=h310",
        "//lh6.ggpht.com/o_nxPuca4FcoKz2DyIKIMfmMjFtmz19AQ1I5XDJXYbKIaMNuD13elEsU3Zs3HIfGgRM=h310",
        "//lh5.ggpht.com/4J8c9vk8pVyPOVGRjOKTX5aCK3dwLEvGQZATCtQk8tBklX9PDOcojHh4Oq6L2KXrsQ=h310",
        "//lh3.ggpht.com/Sh5OTGHm08tKohu9xVlxE5sBy9aplbnj_BCifLy4UJf-1bCSjuE20kaWsFMFAmdM31Qi=h310",
        "//lh4.ggpht.com/WhltS4lptMOpegny7Oy-RvM4oLVXEBsglB_NRTxw82luJIfKFh0GkZ345dOxJ-fA2jzk=h310",
        "//lh3.ggpht.com/52KfTkQULCZvIb4ovVTKKlTicNJxQeY0u7P5pKa9JmI1vsFxSrb31W6-mUxdC_iB3g=h310",
        "//lh3.ggpht.com/8PqAWXmF6jqO6FR7WI3HaEUFFqfjO1y6dCcDt0lrDhfU0FWXH-pOEZtBpzwXjQ9TtA=h310",
        "//lh3.ggpht.com/q_esda4xwY6ph2f-_4eTTNUqa_hy6XRpNlIB0veyM_u8CvYb9zhRJDsKu3bZ67wRL4I=h310",
        "//lh4.ggpht.com/zcZT5mTfovwJxoDK65F12CMdmaJrIMIw7Zp6Nxev5-7qw-XeW03iFUnQEWaFurw7W5Op=h310",
        "//lh3.ggpht.com/4WVCcyAeGgltCyy20hpiQTslmXJNAqy9YhEnyN3rL51vSl92qhBtHMgkVWarjgpzIQ=h310",
        "//lh4.ggpht.com/2rF9khYpBrTeqYa6tbFeQks3IXkwe8O2pn8u0kYLjDdiqB9yVfPhlpfgWiL1ZZyloPM=h310",
        "//lh5.ggpht.com/fh9y9Sqw9D8_2hGT4kmcCd0-OjUNZpDAfJFE8ex19MaNDmVI8kewRFFOQYWfqOxyX98Y=h310",
        "//lh3.ggpht.com/BN98WHFFO5BkED6KklWvHtAZ2UNATUuXXEHQxggRQ8PYmt4RZrGpqpIL4B_wHOn84j0=h310",
        "//lh3.googleusercontent.com/ptnB2TaPGbh6AODKQ6qpheiGbqc8hZXzR1koAXlgEjuaDLqUwddPFMeKcssjrGZvDqc=h310"
    ],
    "video": "https://www.youtube.com/embed/aGdHiSdsj5Q",
    "comments": [
        "Good try poor execution Face will crash occasionally if I set the display time to anything other than 5 seconds. Also both passive mode faces look really really bad. Should have stuck with simple full size hands.",
        "Waste of space Too busy and cluttered to make out.   Nice Idea, but poorly designed.",
        "I never got to use it one time. I was billed for it but never once seen anything. Poor business Must be a rip off",
        "Paid for a what I thought was a cool watch face turns out to be the disappearing watch face never made it to phone or watch.....so basically I gave away my hard earned money, guess that's the way it works disappointment is the word for this one, no refund button either.",
        "Ok Thought it'd be better but still ok 👌",
        "Settings dont work Have tried to make watch face setting changes on both the watch and phone. No changes to the watchface."
    ],
    "recentChanges": [
        "V2.08",
        "-adjusted widget placement and text sizes for higher res screens like the Huawei Watch.",
        "V2.07",
        "-changed weather provider URL for more reliable weather updates",
        "V2.06",
        "-fixed date widget not having a \"top\" position",
        "V2.05",
        "-Bug Squashing",
        "V2.04",
        "-Phone Battery Widget!",
        "-added redundancies for weather data",
        "-added redundancies for location checking for weather data (fine location permission required for this, only used to put lat/lon in url that returns weather data)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.scoonwear.tourbinator&hl=en&gl=us",
    "appId": "com.scoonwear.tourbinator"
}