{
    "title": "Cockpit Aviator Watch Face",
    "summary": "A classic timepiece for keeping close track of time.",
    "icon": "//lh3.ggpht.com/LfYy39u8g87tyzakXYgFCqkmkP4KF-4dENoBZQ6CEkJ6ZXqT35nyS_U71aoqU1Q3ock=w300",
    "price": "$1.01",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.7,
    "reviews": 7,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "February 6, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "CockPit Aviator Watch Face was created by aviation enthusiasts with the goal of creating professional pilot watch faces using the highest quality of Color Combination. With Cockpit Aviator watch face featuring Watch Battery status, Ambient Mode, Temperature, and Needles Color Change which makes the watch face look brilliant and makes the display in military format. Frillroid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.  Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look • Military / police / Aviator Watch Face • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frilldroid.com. How it works? Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face.Get this app now and provide us your feedback :)",
    "descriptionHTML": "CockPit Aviator Watch Face was created by aviation enthusiasts with the goal of creating professional pilot watch faces using the highest quality of Color Combination. With Cockpit Aviator watch face featuring Watch Battery status, Ambient Mode, Temperature, and Needles Color Change which makes the watch face look brilliant and makes the display in military format. Frillroid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable. <br><br><b> Key custom features:-</b><br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Military / police / Aviator Watch Face <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frilldroid.com.<br><b> How it works? </b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face.<br>Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 0,
        "4": 2,
        "5": 3
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/V3s56cLXNjlqzjJfRUm9xN3t8gVkolxVNPDTd3akxF9atgixEkv1l7Y99QjQu8fPtw=h310",
        "//lh4.ggpht.com/CoW917gboylHWMEyv9IPrUSKNcQPDOEspjFYqXtSszwztW_R9BP7uMhOmPrWjOKmvOP6=h310",
        "//lh5.ggpht.com/13EJBrITF9V1I8yx4sLcDAjk_Z3CCsnZbOcKjoLmxBWeNr-UveJ4n5j_9F5XEDc13kn7=h310",
        "//lh3.ggpht.com/kmPAYcSW3mzlwDktw1hg7OOpBYVBsxJInMnrDlfZjUkR8k73bEE8XY3T-ifZD4UdQrA=h310",
        "//lh6.ggpht.com/E8oqewvLaluwxy0mm5YvgeZ5vjmnFRxeZDgIG0U0znS-Yj3lZgTSegDj72xdvK2Dgppo=h310"
    ],
    "comments": [
        "Weather doesn't work",
        "I like this face."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.cockpit.aviator.watch.face.Ar10&hl=en&gl=us",
    "appId": "com.frillroid.cockpit.aviator.watch.face.Ar10"
}