{
    "title": "Fall Fashion Watch Faces",
    "summary": "Five fashion watch faces for Android Wear by designers from around the world.",
    "icon": "//lh3.googleusercontent.com/A18I71DRLFB92Pt7n_8W7DvWDZOL1yeeRivwjVuhXKAUTwoHRt34lnoEskp1PueYajA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.9,
    "reviews": 268,
    "developer": "Fat Russell",
    "developerId": "4948350704947456352",
    "developerEmail": "virginia@fatrussell.com",
    "developerWebsite": "http://www.fatrussell.com",
    "developerAddress": "428 Braddock Street\nJohnstown, PA 15905",
    "updated": "January 15, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "A collection of fashion watch faces curated by Android Wear and PAPER, as well as Cynthia Rowley, Jenné Lombardo, and Ty Hunter. The watch faces work on all Android Wear watches - square or round.Choose from five designs:•  Daylight: the soft-colored design evolves throughout the day.•  Keyaki: events unfold and nature changes around a beautiful tree.•  Textile: a fashion show on your wrist - each day has a special fabric.•  Flamingo: bubbles escape from the flamingo, which dissolves as your battery goes down.•  Vertigo: move, dance, do a handstands - you can always read the time with this unique design.#wearwhatyouwantAndroid Wear watch faces designed by Andrea G, Ron N, Andrea M, Dave K, and Marco A.-Please note: These faces may take some time to appear on your watch. Be patient, they will show up!",
    "descriptionHTML": "A collection of fashion watch faces curated by Android Wear and PAPER, as well as Cynthia Rowley, Jenn&#xE9; Lombardo, and Ty Hunter. The watch faces work on all Android Wear watches - square or round.<br><br><br>Choose from five designs:<br><br>&#x2022;&#x2003; <b>Daylight:</b> the soft-colored design evolves throughout the day.<br>&#x2022;&#x2003; <b>Keyaki:</b> events unfold and nature changes around a beautiful tree.<br>&#x2022;&#x2003; <b>Textile:</b> a fashion show on your wrist - each day has a special fabric.<br>&#x2022;&#x2003; <b>Flamingo:</b> bubbles escape from the flamingo, which dissolves as your battery goes down.<br>&#x2022;&#x2003; <b>Vertigo:</b> move, dance, do a handstands - you can always read the time with this unique design.<br><br><b>#wearwhatyouwant</b><br><br>Android Wear watch faces designed by Andrea G, Ron N, Andrea M, Dave K, and Marco A.<br><br>-Please note: These faces may take some time to appear on your watch. Be patient, they will show up!",
    "histogram": {
        "1": 44,
        "2": 10,
        "3": 24,
        "4": 47,
        "5": 143
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ZyIFhFqD9R-_VOIVplByRPbzkJrcverf4tr8MM7YOKmpdiuWCmt6fT4UlxoLCgDB0g=h310",
        "//lh3.googleusercontent.com/rdGiqxUdxTmN4I2KmGjW7YWGRUQWJPq3Dc3i2xVMdiXoRA9s4dIRUEkQ3SbGLjXHfwY=h310",
        "//lh3.googleusercontent.com/yHGhz10C9_mj64KN1QiGJDu0jcb6yBKlx0DYAxNVf88QEElIVZ3j6kU_-Ec1HDZlRQ=h310",
        "//lh3.googleusercontent.com/Jqsng_Z5ASG7svs-yAW5R53RVNWMuNMXa1sUztnZ8gmAKA1WQjw9Q03oVoBsuZT9rw=h310",
        "//lh3.googleusercontent.com/WBmL2jCZb0xyxXYrfxED16jnTbLbQiXtvqRw1NShNuR3wl1xcRzH2N8gKRUqehmiDRA=h310",
        "//lh3.googleusercontent.com/z8b3ZqOCOMLYMpg8hdp_YtQvRlkEIyja_73-v1Gq13iORw--r1vcTeG3-m_x_hIvgI96=h310"
    ],
    "comments": [
        "I absolutely love textiles and am in desperate need of a text based watch face, so when I saw the Textile watch face, I fell in love with it! It works great! I just wish there were an option to change the wording to be Ten O' Three instead of Ten Zero Three. And for there to be clock hands in the background to go with the time, but you can't have everything, so I still love it! :)",
        "Its not working. Updated android wear to 2.0 but still not showing anywhere.",
        "These fall fashion faces are different than most of the faces I've seen out there on the play store. There is a lot of variety in this pack, so you don't feel like you have just a bunch of \"one type\" of style of watch faces to choose from. I personally find it good to have lots of different faces to choose from to fit my outfit or my mood or both!!!! I recommend you download these.",
        "Hi. After several tries it still won't show up.. I've tried reinstalling and re-syncing. Still doesn't work. Hoping for help.  Phone: One plus one (Cyanogen mod 14.1) Watch: Motorola 360",
        "Won't show up I reinstalled it and it never showed up in my apps to use.  I think several hours is long enough.  I'm using the fossil q founder.                                             I tried resyncing and still nothing.",
        "Not working Doesn't appear in app or watch, Moto g4 play and lg g watch w100. No it didn't work and still not showing everything g else works but this apl"
    ],
    "recentChanges": [
        "1.0.2-w2 Public Release",
        "- Addressed formatting issues on certain watches",
        "- Updated to be stand-alone for Wear 2.0 release"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.fatrussell.watchface.fashionweek&hl=en&gl=us",
    "appId": "com.fatrussell.watchface.fashionweek"
}