{
    "title": "Bluenote - notes and lists",
    "summary": "Bluenote is a minimalist yet powerful notepad app for your Android device.",
    "icon": "//lh4.ggpht.com/Jvl4mOZRaMk6JYIAdDen1Z8IUbXjPHFyuCHOTxpHgiUmSMXniwM9htf7dm4AqtL02xOx=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 434,
    "developer": "abhinav khanger",
    "developerId": "abhinav+khanger",
    "developerEmail": "metacortexlab@gmail.com",
    "developerAddress": "9 utkrsh estate , indore ,india",
    "updated": "January 1, 2015",
    "version": "0.9.1",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Bluenote is a minimalist yet powerful notepad app for your Android device.With Bluenote you can quickly write notes,to-do lists and write down all your ideas and reminders.Get organized• Organize your notes by tags and color to keep track of all your  to-do lists, lecture and meeting notes, vacation plans, or anything you want to organize or remember. Always up-to-date• Synchronize your notes and to-do lists on multiple devices with Dropbox Reminders • Add reminders to notes and lists.Android Wear Support* Pro Features *• Ad Free• Night Mode• Calendar view.* Features * • Note widget.• Markdown Preview• Export notes as text to SD• Import / Export notes to SD• Search notes• Sort notes and lists* Icon is by Jovie Brett Bardoles.Check out his work at http://dribbble.com/bretbardolees",
    "descriptionHTML": "Bluenote is a minimalist yet powerful notepad app for your Android device.With Bluenote you can quickly write notes,to-do lists and write down all your ideas and reminders.<br><br><b>Get organized</b><br>&#x2022; Organize your notes by tags and color to keep track of all your  to-do lists, lecture and meeting notes, vacation plans, or anything you want to organize or remember. <br><br><b>Always up-to-date</b><br>&#x2022; Synchronize your notes and to-do lists on multiple devices with Dropbox <br><br><b>Reminders</b><br> &#x2022; Add reminders to notes and lists.<br><br><b>Android Wear Support</b><br><br><br>* Pro Features *<br>&#x2022; Ad Free<br>&#x2022; Night Mode<br>&#x2022; Calendar view.<br><br>* Features * <br>&#x2022; Note widget.<br>&#x2022; Markdown Preview<br>&#x2022; Export notes as text to SD<br>&#x2022; Import / Export notes to SD<br>&#x2022; Search notes<br>&#x2022; Sort notes and lists<br><br><br><br>* Icon is by Jovie Brett Bardoles.Check out his work at http://dribbble.com/bretbardolees",
    "histogram": {
        "1": 22,
        "2": 22,
        "3": 41,
        "4": 111,
        "5": 238
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/hkKThH7EfOjzOGVHSmxOp_RTVA_IRKiczxcWO1b2U2H7tGhtvTsBCRAihKf1p5V1fXI=h310",
        "//lh3.ggpht.com/2_Nm3sGlyJ0S_UM97rZt259HR9jsW7b1aVP3o6T-Iv226T4rlNZ8n62esWuZEqBwzg=h310",
        "//lh4.ggpht.com/iD3KxlFZCeSesvhnTtP9qS5IFjRS8MdfWH3vlZgoa7zAajk8HYcfylMygvT6zwBRTQ=h310",
        "//lh6.ggpht.com/mZVcRpH7BZUH_8Z_E5-_-EDqITyOThJNaFbUVF8dy72A_8ub6frgg1Dhcwj-n8yEau4=h310",
        "//lh6.ggpht.com/1QdPZAieacqn3FizU_X14ICzZGPDm5ty6N1qTLrrZCFZ3WMk3x9nXMq_POcDV2ero_w=h310",
        "//lh4.ggpht.com/4HEvxe_uZ3TspJJ5o_LhqP50iwhu-Q-tAT6pIV6hsISZBqJtUfzXu8qo39gleyTZc1o=h310",
        "//lh6.ggpht.com/xtp_RcgWCJ472eOU-wzjiH-QzYF4QMDZ9no1BWh50RhnJc4JAgSE8JlHbziUp9z1pSs=h310",
        "//lh3.ggpht.com/0hdnGF58QWz5vtQuhquKCh5ji-nyACWSFyZ9mCHA7n_-L7ktvevhU59j5qncPj4vKw=h310"
    ],
    "comments": [
        "So far I am loving this app I searched for 2 days to find a good note and then i found this. I am greatful! Man, the search was very tiring!! I hope you guys do well in the future. In fact, the app is good! Just a little suggestion, can you guys make a thumbnail view of the notes? It would be awesome since some people love squares/rectangles (I love it). The tagging is good but I think foldrs/ntbks is muchmuch better. It would be great if u can enable/disable the time and dates displayed on the notes. And themes. And fonts too.",
        "It's one of the bests note taking apps... I'm rating it 2 stars though, because it has dealbreaker bugs for me (I bought premium)... Calendar doesn't save notes! (this is the main premium feature, so it NEEDS to be fixed asap). It also as a bug where tag synchronizations between two devices doesn't occur (save one tag in a phone, it doesn't show up in your tablet). Really nice app, anyway: material design, beautiful transitions, tags, CALENDAR... I mean, what else could you ask? Please please fix it",
        "Exactly what I need. A simple and neat note taking app I know the competition is tough out there, but I hope it doesn't mean you'll give up. People look for alternatives all the time. I hope there would be a folder/category view alongside tags. I would be sold. Also Google Drive sync would be much neater. When clicking on a note it should open in view mode with a FAB button for editing.",
        "Simple - that's good Very professional minimal design.  Needs two things: sync across android and full white background for a resized widget even if the widget is not full. Like the Google mail widget. If both of these can be done, it's better than Keep.",
        "Need more automatic list feature 1. In list note, we only can add new list item from buttom, the problem is, if we create many item list, when we open, start from the top. We have to scroll down. 2. The checked list item can't move automaticaly. 3 need spesific note item on widget",
        "Favorite note/list/Todo app on android I love this note taking app. It's my go to note and list app and I use it every day for work. I love the simplicity and also the material design. I find it so much faster to use Bluenote to jump in and create a quick list or note as opposed to something like Evernote which has so many options and setting that it just becomes over complicated."
    ],
    "recentChanges": [
        "V0.9.1",
        "* Settings and About moved to Navigation drawer",
        "* Bug fixes",
        "V0.9.0",
        "* Initial Android Wear support",
        "* Minor UI changes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.abhi.bluenote&hl=en&gl=us",
    "appId": "com.abhi.bluenote"
}