{
    "title": "Scoon Carbonium",
    "summary": "Complex animated watch face with carbon dials in 6 colors. Highly customizable!",
    "icon": "//lh4.ggpht.com/ovcS8Fk_153tjpTjeKxeEHZ_bck-sJ3oBG_h7vjaiyjCI_zUKRNtzFmOtc-l6yxBNw=w300",
    "price": "$1.64",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.9,
    "reviews": 15,
    "developer": "Scoon Design",
    "developerId": "Scoon+Design",
    "developerEmail": "scoondesign@gmail.com",
    "developerWebsite": "http://www.scoondesign.com",
    "developerAddress": "Dr. Plesmanlaan 156-160, 3601DE, Maarssen",
    "updated": "December 22, 2015",
    "version": "1.03",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "For Android Wear Original design exclusive watch faceMillions of combinationsThis watch face is unique and no copy. The Scoon Carbonium one of the most complicated watch face available at this moment. It took hundreds of hours to make these complex animations to work. The gear covers can be hidden or set to  rotate when tilting wrist  by using your watches accelerometer. The Image of the watch winder will realistically simulate gravitational effects right on your wrist. You can change settings live and on the watch. No need to do this in your mobile phone.This watch is made for Android Wear watches like the Motorola 360 and the LG G Watch Round. It includes a square dial so it can be used on square watches like the LG ZenWatch.Please rate us positive if you like our work! We see that some users don't know to find a setting. We can help you with that or finding other functions.Why the Carbomium is the most fantastic smart watch face:★Millions of combinations can be created to suit any mood.★ It has complex transparent animations★ Accelerometer effects are implemented★ Weather information is available★ You can set options live on the watch by swiping and ticking★ All gears turn in a complex way to give you that realistic look★ You can set the Tourbillon or disable it.★ It has the ultimate millionair factor★ You can make numerous combinations. You are getting a lot of watches in this app.★ You can choose for skeleton look or set beautiful dials★ premium metals have been used to create the best apearance★ Many hours are invested in this design. It is the most complex watch face app today available.★ You can set date and power indicators and their location★ You can choose analog or digital indicators★ You can choose modern style or classic hands★ Also features a square design★ Future improvements and updates will follow... How to change/ build your ultimate watch:- buy and download our app and wait till the watch face shows up in your watch- select the Carbonium by long clicking your watch face and then ticking the gear symbol below. Or set it in the Android Wear app on your phone- when activated on your watch go to the settings of Carbonium in the Android Wear app of your phone- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone- if our watch face doesn't show up in your watch please try to restart your watch. It can take some time to load this complex watch- change your preferences by long clicking the watch face. Then swipe up. Swipe and tick to select.- pull your sleeve up so everybody asks what awesome watch you have on your wristSupport us and follow us on http://www.facebook.com/scoonwearhttp://plus.google.com/+scoondesignhttp://www.scoonwear.comMore complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "descriptionHTML": "<b>For Android Wear</b> <br><b>Original design exclusive watch face</b><br><b>Millions of combinations</b><br><br>This watch face is unique and no copy. <br>The Scoon Carbonium one of the most complicated watch face available at this moment. It took hundreds of hours to make these complex animations to work. The gear covers can be hidden or set to  rotate when tilting wrist  by using your watches accelerometer. The Image of the watch winder will realistically simulate gravitational effects right on your wrist. You can change settings live and on the watch. No need to do this in your mobile phone.<br><br>This watch is made for <b>Android Wear</b> watches like the Motorola 360 and the LG G Watch Round. It includes a square dial so it can be used on square watches like the LG ZenWatch.<br><br><b>Please rate us positive if you like our work! We see that some users don&apos;t know to find a setting. We can help you with that or finding other functions.</b><br><br>Why the Carbomium is the most fantastic smart watch face:<br>&#x2605;Millions of combinations can be created to suit any mood.<br>&#x2605; It has complex transparent animations<br>&#x2605; Accelerometer effects are implemented<br>&#x2605; Weather information is available<br>&#x2605; You can set options live on the watch by swiping and ticking<br>&#x2605; All gears turn in a complex way to give you that realistic look<br>&#x2605; You can set the Tourbillon or disable it.<br>&#x2605; It has the ultimate millionair factor<br>&#x2605; You can make numerous combinations. You are getting a lot of watches in this app.<br>&#x2605; You can choose for skeleton look or set beautiful dials<br>&#x2605; premium metals have been used to create the best apearance<br>&#x2605; Many hours are invested in this design. It is the most complex watch face app today available.<br>&#x2605; You can set date and power indicators and their location<br>&#x2605; You can choose analog or digital indicators<br>&#x2605; You can choose modern style or classic hands<br>&#x2605; Also features a square design<br>&#x2605; Future improvements and updates will follow... <br><br>How to change/ build your ultimate watch:<br>- buy and download our app and wait till the watch face shows up in your watch<br>- select the Carbonium by long clicking your watch face and then ticking the gear symbol below. Or set it in the Android Wear app on your phone<br>- when activated on your watch go to the settings of Carbonium in the Android Wear app of your phone<br>- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone<br>- if our watch face doesn&apos;t show up in your watch please try to restart your watch. It can take some time to load this complex watch<br>- change your preferences by long clicking the watch face. Then swipe up. Swipe and tick to select.<br>- pull your sleeve up so everybody asks what awesome watch you have on your wrist<br><br>Support us and follow us on <br>http://www.facebook.com/scoonwear<br>http://plus.google.com/+scoondesign<br>http://www.scoonwear.com<br><br>More complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "histogram": {
        "1": 2,
        "2": 0,
        "3": 3,
        "4": 2,
        "5": 8
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/QqUXtrMDqrXPHboz5kQLo2BFuFksByQDzYjUkBy5ELAxw4Z8bMvwlTGLP5UT5JTz7A=h310",
        "//lh3.googleusercontent.com/mWl_pPl6YswuztjJeRStXxxdU0tCiWA-IKPjW8scAh8sreLsmCPKeuUNU-tnllBhsw=h310",
        "//lh3.googleusercontent.com/hyDEfYpTw8ZzZ1TkDRC6ail2GjSwU09pfrcR5X0XYS5Gx7sQsrvL1rXtSrCmnvQGtEMZ=h310",
        "//lh3.googleusercontent.com/bGVWwjvcKddSiCqvGUvsSb6w5r_0FMolBs8xW_RuqpEzGeEYQOej2AdXzxfsj8Wysg=h310",
        "//lh3.googleusercontent.com/v7_eYqqCLRn8XmsLjbn2HGgAES6nL4Dl_xyZjxJifiZAmC47dZbsF2R4EZEJpkLjiw0_=h310",
        "//lh3.googleusercontent.com/OpaM-BCBSN6t_M-y97hw2FLzAzLPGczXWJ3SR-FyaNTwdcmRfQH95ZqusO-hps0FI29P=h310",
        "//lh5.ggpht.com/lK_W6_Xr-AzPHNk9E9FfyS0Mc8xbrrEarfxJMXH2hfclu09vp5u4ePYLlRA5bGGkKA=h310",
        "//lh3.googleusercontent.com/5tWLdCw0ssCUHhNts6yOrjqeLZgk3VQi2R-OF92hG1OraWyG8CTP83vHtDXqtjeYFw=h310",
        "//lh5.ggpht.com/wmKBCXPubry17bsciVz620e0arharHdyuT_0LvmSCVgpjeuWbtReud-3bayUaOvntDYc=h310",
        "//lh6.ggpht.com/J_F7-VzYKBWgPQ3BKaEHwZkUh807KsMr-2kqCDOUAW92dqjFPVarxKbVedqkedRWBqlr=h310",
        "//lh3.googleusercontent.com/9jDcGtSiaiS5jekIgcsiwFWYCp2rVfVGLUQ5D2s8NZBiqJrz_fwLIq8LYZ-3kTNqYjw=h310",
        "//lh3.ggpht.com/EC2imShHhqGYUnvGIdym-RwWoMb5-tRe50ldgp7HRTsE4sHOn-SatwetU-c5JNwsKA=h310",
        "//lh3.googleusercontent.com/7j6y5pijSnAB0uJrfSpOefDIqZsV_7G-BeiS6O_FSsWoF059OptOumuCbhEcbhUyqeo=h310",
        "//lh3.googleusercontent.com/VUO1zr81XcvxajlWLwJhsCZ3wUjbOR8Sx5rylcsJxsG0u3CbR9yMbhuPKB2ifFWj4BY=h310"
    ],
    "comments": [
        "Needs companion app! Customising the watch face on my Urbane is a complete pain! The changes hardly ever take affect and takes ages to edit again. A companion app where you could store presets would be a better option...",
        "Great animated mechanical face Tons of options. Sumptuous design. Amazing animated tourbillon and gears. A rotor that actually rotates as your wrist turns, just like real one!  And, wonderfully,  you can choose the timeout interval up to 30 sec!",
        "Says installed but is not It will download and install but the app will not be on the phone. Have tired multiple times to download and install an always end up with same results and it charged me two times for the purchase.",
        "love it,but unrealistic",
        "Request Can you add the option to change the dim colors? Also instead of preset color why not a full range color wheel thingy?"
    ],
    "recentChanges": [
        "v1.03",
        "-Updated to support higher res screens like the 400x400 Huawei watch",
        "v1.02",
        "-fixed rotated ambient dial ticks",
        "-changed weather provider url to provide more reliable weather service",
        "v1.01",
        "-Added Digital 12hr and 24hr options",
        "-Choose color and Opacity of digital clock from color picker."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.scoonwear.carbonium&hl=en&gl=us",
    "appId": "com.scoonwear.carbonium"
}