{
    "title": "RUGGED2 Watch Face",
    "summary": "RUGGED2 has an unique style, that can stand out you from the others people",
    "icon": "//lh3.googleusercontent.com/BE_W7YlyvNrcF9OvKDNeVF82JSqCY1WW2YEBA6vyS4SX8TxpzKpMUVwnPK1--0w5VCQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.4,
    "reviews": 1239,
    "developer": "FACE4.watch",
    "developerId": "FACE4.watch",
    "developerEmail": "contact@face4.watch",
    "developerWebsite": "http://face4.watch",
    "developerAddress": "Dębowica 77, 21-404 Trzebieszów",
    "updated": "January 17, 2017",
    "version": "2.0.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "RUGGED2 is inspired by our first face - RUGGED.However, this version is more extensive and better designed to take the advantages of watches with higher resolution.RUGGED watch faces line is an original project, that allow you to stand out from the others and emphasize your individual style.RUGGED – it's awesome! :)You have to try our PRO version of this watch face. Do it, download and check what the word 'awesome' really means.In PRO version you can customize design of your watch face, including:• choose from unique skins• choose colors for all elements (time, date, day etc.)• set time of active modeand much, much more.. (and this is not the end)- ABOUT US -FACE4.watch as a brand was created in the end of 2015.Our purpose is to create awesome faces to your watches.We have a lot of experience in designing and creating faces for other platforms, this allow us to belive, that soon everyone will find something suitable for their watch.It just the beginning, and RUGGED2 is our second child in Google Play. But, we have a lot of projects of new faces that are waiting to realize them!",
    "descriptionHTML": "RUGGED2 is inspired by our first face - RUGGED.<br>However, this version is more extensive and better designed to take the advantages of watches with higher resolution.<br><br>RUGGED watch faces line is an original project, that allow you to stand out from the others and emphasize your individual style.<br><br>RUGGED &#x2013; it&apos;s awesome! :)<br><br>You have to try our PRO version of this watch face. Do it, download and check what the word &apos;awesome&apos; really means.<br>In PRO version you can customize design of your watch face, including:<br>&#x2022; choose from unique skins<br>&#x2022; choose colors for all elements (time, date, day etc.)<br>&#x2022; set time of active mode<br>and much, much more.. (and this is not the end)<br><br>- ABOUT US -<br>FACE4.watch as a brand was created in the end of 2015.<br>Our purpose is to create awesome faces to your watches.<br>We have a lot of experience in designing and creating faces for other platforms, this allow us to belive, that soon everyone will find something suitable for their watch.<br><br>It just the beginning, and RUGGED2 is our second child in Google Play. But, we have a lot of projects of new faces that are waiting to realize them!",
    "histogram": {
        "1": 84,
        "2": 26,
        "3": 74,
        "4": 220,
        "5": 835
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/_qkhNnjbOxgzTbkZoFGIQfz7wvIeyBETnipGDXNNX2_qijB8B7BALLBCtIDvLKpKoqYb=h310",
        "//lh3.googleusercontent.com/CVF583WCUxp3zayCl7WBvZvgDUgSUDc_ZkfxHjIf4OjK-Bb24jC1BqI2wZy3OIXmLA=h310",
        "//lh3.googleusercontent.com/V--3p3vb-1eVuk5Qp4KiFmitgDdHIPyw2X5elXQ2F8JUHjcNs7KAe7ujkEX34bVtrAw=h310"
    ],
    "comments": [
        "I really like the look of this app and was going to buy the pro version but that version based upon the reviews doesn't seem to be Wear 2.0 compatible. I noticed both versions haven't been updated since January and February so that might explain why there are problems on 2.0. The diagonal look of this face is wonderful but I wish there was a way to rotate the diagonal 90 degrees. I'd rather the hour be towards the top-right rather than the top-left.",
        "I was so exited when I saw the latest update. After all the complaints about 12 hour format. I thought that change was the new feature. I don't really know if there is a plan to create another version (not free). But most of us had it and we loved, so now it's disappointing, that's why my rating changed.",
        "People who are having issues installing it as your facewatch.  Please check your watch after installing this on the phone. Goto google play store and at the bottom you should see a list of apps that can be installed. Yes you have to install separately on watch again via play store. Thanks for the awesome watch face",
        "Used to be a favorite until changed to 24 hour format. I want 12 hour format back.  And looking at even the paid PRO version feature list, looks like that doesn't have a 12 hour format option anymore either.  USELESS AND IM UNINSTALLING",
        "Is a really good design and works perfectly but drains my phone battery for some reason I have tested it and cant understand why this drains it so much if it can be fixed I will definitely reinstall and continue to use",
        "Why did the makers removed 12 hour format? Give customers an option to choose 24 or 12 hr format.  Reduced the rating to 2 stars for removing 12 hrs format. It practically makes it useless for me. Not using this watch anymore :("
    ],
    "recentChanges": [
        "Version 2.0",
        "- a lot of changes, mainly in configuration",
        "- new design and a lot of optimization",
        "Version 1.4",
        "- fixed some bugs (battery etc)",
        "Version 1.3",
        "- allow to change color of ambient (from black, through grey, to white, final effects may vary on different watches, because of difference in ambient modes on watches)",
        "Version 1.2",
        "- allow to set style of ambient (filled/outline)",
        "Version 1.1",
        "- set time of active mode",
        "- choose date format from DD.MM and MM.DD"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.qext.rugged2&hl=en&gl=us",
    "appId": "com.qext.rugged2"
}