{
    "title": "Atlantica Watch Face",
    "summary": "YSAR watch faces are made to satisfy the needs of most exigent smartwatch owners",
    "icon": "//lh3.googleusercontent.com/gOobjx3KeGotfmgG2LRdRTbCBfxnFfxPNlvIVmPxvcE8qYIA8zu5KVTHawH5uLMwatQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 2.7,
    "reviews": 63,
    "developer": "YSAR Design",
    "developerId": "YSAR+Design",
    "developerEmail": "ysarwatches@gmail.com",
    "developerWebsite": "http://ysarwatchface.com",
    "developerAddress": "City of London\nLondon, EC4V3EJ\nUnited Kingdom",
    "updated": "September 15, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Upgraded Watch Face - Atlantica- Better readability- Improved calendar - Better compatibility with square smartwatches - Fixed bugsYSAR watch faces are specially made to satisfy the needs of most exigent smartwatch owners, who got used to wearing stylish watches. Our luxurious and elegant faces powered with battery indicator, calendar and 2nd time zone watch will add significant value to any android smartwatch.Watch faces by YSAR Design are compatible with both round and square android wear smartwatches: Moto 360, Asus ZenWatch, LG G Watch R, LG G Watch, LG Watch Urbane, Samsung Gear Live, Sony Smartwatch 3, Huawei Watch etc...Custom features:-  Battery indicator-  Date-  Analog time zone watch-  Advanced and luxury design with superb readabilityOur watch faces are available in settings right after you download from store and are simple in being set up. YSAR watch faces do not require much energy, so your smartwatch will operate for almost the same period of time as usual.",
    "descriptionHTML": "Upgraded Watch Face - Atlantica<br><br>- Better readability<br>- Improved calendar <br>- Better compatibility with square smartwatches <br>- Fixed bugs<br><br>YSAR watch faces are specially made to satisfy the needs of most exigent smartwatch owners, who got used to wearing stylish watches. Our luxurious and elegant faces powered with battery indicator, calendar and 2nd time zone watch will add significant value to any android smartwatch.<br><br>Watch faces by YSAR Design are compatible with both round and square android wear smartwatches: Moto 360, Asus ZenWatch, LG G Watch R, LG G Watch, LG Watch Urbane, Samsung Gear Live, Sony Smartwatch 3, Huawei Watch etc...<br><br>Custom features:<br>-  Battery indicator<br>-  Date<br>-  Analog time zone watch<br>-  Advanced and luxury design with superb readability<br><br>Our watch faces are available in settings right after you download from store and are simple in being set up. YSAR watch faces do not require much energy, so your smartwatch will operate for almost the same period of time as usual.",
    "histogram": {
        "1": 26,
        "2": 7,
        "3": 5,
        "4": 8,
        "5": 17
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/YazweyTU4S6D0U0KQviDA9PKN8SsMCwLKsWSgTWWpCLvFPkaJrdhwrSGJWC-9Fc0Hmg=h310",
        "//lh3.googleusercontent.com/OtA6AwVJwP-oUt4BzmjAVr3YjDjteZxT7rqwlCHtCwTtjLvip75aMRUVj-Z2rrXmUQ=h310",
        "//lh3.googleusercontent.com/ELVkyYPQ0qP-7HE91RkKCS31nAwElzOQz4DQNCHRCoaoKTKjJ6tAFZlkTjuBudSS1uAz=h310",
        "//lh3.googleusercontent.com/Nc1XJZj5P7w-2EEtv-sQPNVqMvry7QxRRXpoQ08DmS37uouStmZyvNOVAJ7vAcjE_Gk=h310",
        "//lh3.googleusercontent.com/zc_RGWRwQBPk5TdxEILxtmOvMhbtqrzuPew1ljoguCZHkFJEmWpg67QfU5J-RHoI0w=h310",
        "//lh3.googleusercontent.com/r8qQG9wv31L8dz7BesmHUG0czouDrBDQubpF0belNWltGdxKJbqXU8PeVk7dI3dJV3rt=h310",
        "//lh3.googleusercontent.com/u64KLpUSh6MgwkwsKwrbb0nQQf1PpEzOMxcAO6opayP3d7jQlayjAQ_hLOwswb17reW-=h310",
        "//lh3.googleusercontent.com/0Wg_oXFoFeAnyt_1swWwzz_aW3pBceKXTt7lT91KkOnkm80fbuRUE6wgRGNQjBw-lSDD=h310",
        "//lh3.googleusercontent.com/qsoiv3zYKiCkBivH3VzyYJiwhRhXee3U4sEVegV8_mCf6Ca55tw_4p6cL9tTgofLpyM=h310",
        "//lh3.googleusercontent.com/S6lSCSg5jDa_QbIPMUwZKMG6W0cfQaKp7A0A3NzKs09vh_p-fZEiIZlRyWuRHa4hJ7_W=h310",
        "//lh3.googleusercontent.com/_pHJN6ovvJZwnIL7lyUmVFRxtbse9K9CYuAOv1f3BshHSoeq_j5QZAf_l0-Ik3UiPz-d=h310",
        "//lh3.googleusercontent.com/cFAwEs2CqiOv1hAJx3W94958oIsc-um2FwjySuNd5wZ7D6wr4Y3rVo1Mkyh0IrGsFnI=h310"
    ],
    "comments": [
        "Support based star rating. Gear S2 owner. It appears support for Samsung is limited to only \"Gear live\".  I rated this face set on merely device support. If your device support is updated, I can then experience this face set and raise stars accordingly. I have a Samsung Gear S 2, currently are there plans of updating? I would really like the opportunity to try this face set out. Thank you for your time.    Regards,    Daniel R. Sullivan",
        "Could be 5* The problem with this is the hands. They are in the wrong order. Also the second hand is terrible. It would be better without it. It's just too thin. At first I thought it didn't have one Anyone knows the hour hand is at the bottom, then the minute hand and last, on top the second hand. This is back to front and looks stupid. Put it right and its 5*instead of laughable. I'll stick with my pixel Perfect B&R1 I made. Google needs to make Them show the real face. Not mockups and photoshop.This lot use 3d print",
        "Terrible No support, does not work. Looks like a 5 year old made ir",
        "Hands of the smaller dials are in the wrong places. They look like they've fallen off. Uninstalled straight away.",
        "It doesn't look right It looks horrible on my huawei watch. The hands are in the wrong places (not in the middle) and the time is off, but that can be fixed somehow",
        "Looks cool. I like the color and style"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.atlantica_new&hl=en&gl=us",
    "appId": "com.atlantica_new"
}