{
    "title": "Dual Aviator Watch Face",
    "summary": "The all new Dual Aviator Watchface with Weather Updates.",
    "icon": "//lh3.ggpht.com/ktolp7v0TVkTMzDPFmkjFU2G406AKsFI9Ezuw0jFHcPwdu4A5fmFGTrAA51DCxzNSWc=w300",
    "price": "$1.05",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 2.1,
    "reviews": 27,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "January 22, 2015",
    "version": "1.3",
    "genre": "Weather",
    "genreId": "WEATHER",
    "description": "Model Number: FR-A08Wear your smart watch like you mean it ! The all new Dual Aviator Watchface with WeatherAviator Watchface is the modern look for your Smart Watch with multiple dials style and functionality. Stay updated with everything that you require right on your hand with the custom display. Its a Dual Style Watch, which supports Analogue as well as Digital time styleAviator Watchface is loaded with variety of options to suit your need. Along with the accuracy of date and time get information about current weather and temperature and remaining battery life.You can choose the Color theme for your watch from various Color options to change it every day to compliment your new dresses. Also you have the option to choose between the options of using the digital or analogue type Watchface.This watch face is happening and combined with modern functions of Android Wear.Key custom features:-• Its Dual, Analogue as well Digital• Latest Weather updates• Change complete watch theme• Ultimate readability • Clean and simplistic look • Date and time information • Remaining battery life of your device so you exactly know when to chargeThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live.Visit our exclusive Watchface collection for Android Wear on website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Select from variety of Colors to change the overall theme of the watch and also choose if you want a digital or analogue type watch.Get this app now and provide us your feedback :)",
    "descriptionHTML": "<b>Model Number: FR-A08<br>Wear your smart watch like you mean it ! The all new Dual Aviator Watchface with Weather</b><br><br>Aviator Watchface is the modern look for your Smart Watch with multiple dials style and functionality. Stay updated with everything that you require right on your hand with the custom display. <br><br><b>Its a Dual Style Watch, which supports Analogue as well as Digital time style</b><br><br>Aviator Watchface is loaded with variety of options to suit your need. Along with the accuracy of date and time get information about current weather and temperature and remaining battery life.<br><br>You can choose the Color theme for your watch from various Color options to change it every day to compliment your new dresses. Also you have the option to choose between the options of using the digital or analogue type Watchface.<br><br>This watch face is happening and combined with modern functions of Android Wear.<br><br><b>Key custom features:-</b><br><br>&#x2022; Its Dual, Analogue as well Digital<br>&#x2022; Latest Weather updates<br>&#x2022; Change complete watch theme<br>&#x2022; Ultimate readability &#x2022; <br>Clean and simplistic look <br>&#x2022; Date and time information <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live.<br><br>Visit our exclusive Watchface collection for Android Wear on website <b>www.frillroid.com.</b><br><br><br><b>How it works?</b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Select from variety of Colors to change the overall theme of the watch and also choose if you want a digital or analogue type watch.<br><br>Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 14,
        "2": 4,
        "3": 5,
        "4": 0,
        "5": 4
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/0R1VFpUx5vN0kzz7YJ-Png3Pl9jQ3Fr4QpSiWhuAbNE0rMh9Qm2bdqnrJj41WtIkaPM=h310",
        "//lh3.ggpht.com/axdMCXyALtS-jmqz5ES-b_e_ZdKZRV1_MPsfTWDz3Eh6hQIFamKurbV-zhLB5rXlMQg=h310",
        "//lh5.ggpht.com/1o9xtq9rfaxSp9-CWK3JgHs-P5rZebBST17VAe_fjZdWfeztZhzKGFKXCsJOxycalpg=h310",
        "//lh4.ggpht.com/SMQssXuj9S1HrEVEc6kdBkeVHo9AmFUDy2lq272ZcjaPNO071nmrP14XGEAaDF5hhV0=h310"
    ],
    "comments": [
        "Update: now working! Small problems are that the second hand doesn't do the sweeping 5 ticks per second of an automatic movement like the preview site shows. And the watch face is different from the preview and pictures. Currently the 5min markers are the accent color instead of white.",
        "Would give 5 stars... If there was an option for Fahrenheit weather instead of just Celsius... Am I missing something? Or is this not an option? Should be.",
        "Help I like this app. could u have an update for samsung gear s soonest ? I couldnt sync it with the watch with the current version. Thks",
        "No fahrenheit? Apparently there is no setting to switch to fahrenheit.",
        "Doesn't work Moto 360 I'm on 5.1 and it loads a totally different watch face to my watch even tho it shows as the right one on the face menu on the watch and wear app :s",
        "doesnt work on moto 360 5.0.1 doesnt seem to work on my Moto 360 on 5.0.1, cant enable it :( Will update review if watchface gets updated to work."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.fra08&hl=en&gl=us",
    "appId": "com.frillroid.fra08"
}