{
    "title": "Plants vs. Zombies™ Watch Face",
    "summary": "There’s a zombie on your watch! Keep time with PvZ and Android Wear.",
    "icon": "//lh5.ggpht.com/_f7KE1uOCrNcto3QZQEyYgg7OyIaoQVUYWMBFv6K-NI6c3YH0yzwfnLO5JehDMh_EGWy=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.5,
    "reviews": 32276,
    "developer": "ELECTRONIC ARTS",
    "developerId": "6605125519975771237",
    "developerEmail": "help@eamobile.com",
    "developerWebsite": "http://support.popcap.com/mobile/android",
    "developerAddress": "Geneva, Switzerland",
    "updated": "February 2, 2015",
    "version": "1.0.5",
    "genre": "Casual",
    "genreId": "GAME_CASUAL",
    "description": "NOTE: Please make sure that your watch is running Android Wear 5.0. The update is rolling out to all Android Wear watches, but may take a few days. Thank you for your patience.Whether you're time traveling through zombie-infested worlds in Plants vs. Zombies™, or just tending your garden of battle-ready plants, you'll know when it's “go” time with the Plants vs. Zombies Watch Face companion on your Android Wear device.Requires acceptance of EA’s Privacy & Cookie Policy and User Agreement.",
    "descriptionHTML": "NOTE: Please make sure that your watch is running Android Wear 5.0. The update is rolling out to all Android Wear watches, but may take a few days. Thank you for your patience.<br><br><br>Whether you&apos;re time traveling through zombie-infested worlds in Plants vs. Zombies&#x2122;, or just tending your garden of battle-ready plants, you&apos;ll know when it&apos;s &#x201C;go&#x201D; time with the Plants vs. Zombies Watch Face companion on your Android Wear device.<br><br>Requires acceptance of EA&#x2019;s Privacy &amp; Cookie Policy and User Agreement.",
    "histogram": {
        "1": 8509,
        "2": 2043,
        "3": 2773,
        "4": 3409,
        "5": 15542
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/C53YnVDR63Sxypflp-9jMJL4mvTnWu6srnJUwkQaamrA64QRFh9k-F0u7TSsIrGK_GEa=h310",
        "//lh4.ggpht.com/E_8FCT7xmjS11kFNfz7YYm_hFvztl_9luIUctJ0Q90x1Bgt3gxFcNRb43n2JcXqSjA=h310"
    ],
    "comments": [
        "there are people who know what it is and also some that don't know what it is 50 50 get it/don't get it's for a watch and not a game i mean do you really think there would be a game called PLANTS VS ZOMBIES WATCH FACE!!! anyway I don't have one of those fancy android watches but I'm sure it's cool to have",
        "Awesome nostalgic Watch face. I wish thr zombie make the walk movement like in the game. And I'm surprised by the number of people who rate one star, because it's not a game. Read the title... If you don't know what's a watchface. Google it. Or google moto360 Nice WATCHFACE. Not a game because the TITLE said so. Many one star rater clearly illiterate.",
        "Get lost !!! 1 star people This is not an app to play on phone......cause it is not made for playing but it is a watch face for the smart watches like moto360 samsung wear etc... So people please read the whole description and app name too!!! You will get to know its not for your android",
        "THIS IS NOT A FRICKIN GAME For all you people who don't know how to use your brain, let me help you. This is a goddamn watch face. Not a game. Does Plants vs Zombies Watch Face sound like a game??? It is a watch face for android wear. A game would take much more space than 3MB. If you want a game, go get go get Plants Vs Zombies. Not this. This is a watch face. Use your F***ing brain. Geez.",
        "I am with other (*) (*) (*) (*) (*)  reviews! There is a reason why this \"app\" doesn't work- It's not an app at all! Seriously, LEARN HOW TO READ! It says \"watch face\" in the title! How illiterate ARE people these days???If you are one of these people, then, like I said, learn how to read! It is not for phones!",
        "LMFAO Oh my God the stupidity is real some. I'm sorry but half of the people  that downloaded this app must illiterate. Common sense  really isn't that common."
    ],
    "recentChanges": [
        "Improved experience for devices using low-ambient mode."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ea.watchface.pvzzombie&hl=en&gl=us",
    "appId": "com.ea.watchface.pvzzombie"
}