{
    "title": "Luxury Watch Face",
    "summary": "Download our smart watch faces and get a set of luxury watches!",
    "icon": "//lh3.googleusercontent.com/2Lr-COc3yMPfmAjRhUYa_8ByOjNavWofO1X_MrnA9NuCOgj3aIB9POPrJoBD5B2lkwM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.8,
    "reviews": 30,
    "developer": "Thalia Premium Photo Montage",
    "developerId": "7125614350471173442",
    "developerEmail": "thaliamaka@gmail.com",
    "updated": "January 24, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "To be a person of style doesn't necessarily mean that you need to have a lot of money; at least if your favorite fashion gadgets include luxury watches. All you need to have is a smartphone and our app Luxury Watch Face, and you're ready to make your smartwatch as luxurious as you wish! It is easy to become the watch face maker number one now when you can combine the stylish elements and change your smart watch faces every single day! Have a different one on every occasion, and enjoy the luxury which we provide you with. Synchronize your smart watch app with your phone and handle it easily. You will be able to choose some of the preset luxury watch faces or make one on your own. Also, this luxury watch app is suitable for both round and square devices. Follow the latest trends, and show off with your good taste. Download now and wear your Luxury Watch Face with style!***How to set your watch face?***● Download smart watch application to your phone! ● Find the icon and simply click on it! ● Choose among beautiful preset skins and sync to your smartwatch!● Or design your own watch face!● Choose all watch face elements separately!● Choose a background, different hand styles, markers and widget styles! ● See the preview of each element combination!● Choose what you want to be shown when your watch face is in ambient mode!  ● When you're done, sync the app with your device! ● Both round and square watch faces supported! ***Where to find the watch face you've chosen?*** ● You can either find the Android Wear application on your phone and select our watch face from the list.● Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.● Wait a few seconds for the app to synchronize, be patient!Gear up with Luxury Watch Face, download the app to your phone and then sync software for smart watch.***Compatibility!***Make sure that your device runs on Android Wear operative system, otherwise you won't be able to use our application. Luxury Watch Face is compatible with all of the latest Android Wear devices including:  Moto 360 1Moto 360 2nd genHuawei WatchAsus Zen Watch 1 ,2 & 3 LG Watch UrbaneLG Watch Urbane 2nd EditionLG Watch R™LG G WatchFossil Q FounderCasio WSD-F10Tag HeuerSony Smartwatch 3Note: On occasion it takes some time for a watch face app to synchronize with your device. In case you're having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you're enjoying our watch faces we wouldn't mind getting a positive review. Thank you for understanding, enjoy using our app!Contact us on: watchfacessupport@webelinx.comDisclaimer: Android™ is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "descriptionHTML": "To be a person of style doesn&apos;t necessarily mean that you need to have a lot of money; at least if your favorite fashion gadgets include luxury watches. All you need to have is a smartphone and our app Luxury Watch Face, and you&apos;re ready to make your smartwatch as luxurious as you wish! It is easy to become the watch face maker number one now when you can combine the stylish elements and change your smart watch faces every single day! Have a different one on every occasion, and enjoy the luxury which we provide you with. Synchronize your smart watch app with your phone and handle it easily. You will be able to choose some of the preset luxury watch faces or make one on your own. Also, this luxury watch app is suitable for both round and square devices. Follow the latest trends, and show off with your good taste. Download now and wear your Luxury Watch Face with style!<br><br><br>***How to set your watch face?***<br><br>&#x25CF; Download smart watch application to your phone! <br>&#x25CF; Find the icon and simply click on it! <br>&#x25CF; Choose among beautiful preset skins and sync to your smartwatch!<br>&#x25CF; Or design your own watch face!<br>&#x25CF; Choose all watch face elements separately!<br>&#x25CF; Choose a background, different hand styles, markers and widget styles! <br>&#x25CF; See the preview of each element combination!<br>&#x25CF; Choose what you want to be shown when your watch face is in ambient mode!  <br>&#x25CF; When you&apos;re done, sync the app with your device! <br>&#x25CF; Both round and square watch faces supported! <br><br><br>***Where to find the watch face you&apos;ve chosen?*** <br><br>&#x25CF; You can either find the Android Wear application on your phone and select our watch face from the list.<br>&#x25CF; Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.<br>&#x25CF; Wait a few seconds for the app to synchronize, be patient!<br><br>Gear up with Luxury Watch Face, download the app to your phone and then sync software for smart watch.<br><br>***Compatibility!***<br><br>Make sure that your device runs on Android Wear operative system, otherwise you won&apos;t be able to use our application. Luxury Watch Face is compatible with all of the latest Android Wear devices including:  <br><br>Moto 360 1<br>Moto 360 2nd gen<br>Huawei Watch<br>Asus Zen Watch 1 ,2 &amp; 3 <br>LG Watch Urbane<br>LG Watch Urbane 2nd Edition<br>LG Watch R&#x2122;<br>LG G Watch<br>Fossil Q Founder<br>Casio WSD-F10<br>Tag Heuer<br>Sony Smartwatch 3<br><br>Note: <br><br>On occasion it takes some time for a watch face app to synchronize with your device. In case you&apos;re having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you&apos;re enjoying our watch faces we wouldn&apos;t mind getting a positive review. Thank you for understanding, enjoy using our app!<br><br>Contact us on: watchfacessupport@webelinx.com<br><br>Disclaimer: Android&#x2122; is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "histogram": {
        "1": 5,
        "2": 3,
        "3": 0,
        "4": 7,
        "5": 15
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/n5T1sbukvXnJCdfi7tmsGEiB0KcUyZ3UIc-nepkOsBfz_XvQQJRDZl5CSuAL44fQiw=h310",
        "//lh3.googleusercontent.com/-gCkHA5tjOPG86c9TrltBzIWHOaJsAtGtPEkNxK-RpR9z6qmHmvDJS4SJP_OG8sY1A=h310",
        "//lh3.googleusercontent.com/l83YZIMZczr1XhP0TIcHRorRlYNkIo2ymrl8os8J-6meAjoQ-edia_CA6IzOI0DHfTg=h310",
        "//lh3.googleusercontent.com/UrYr9vZi3C3QIAm2iOfLeEmbiA7Bz-hGI7eqJCyQkMdwT1HJ4sh4irxR-TAwXd44W0c=h310",
        "//lh3.googleusercontent.com/iup8ACqJWBNB2QKcj2_vy_9wM2odCNqf3a10jCRG_YatwxDYzjDlA5c_oIIquviCTkY=h310",
        "//lh3.googleusercontent.com/7EVMik724Gmiy1R4l5jOP_c985UgJNIIHSVvY0CNTYVj7xDxVKX5RtK3EzDk5iTrnigN=h310",
        "//lh3.googleusercontent.com/5E3Z5MhhT8yxeAGsmZt5L6YcclfoAEHHvvGY9Oo9Z9uBOd31RWhEgOjW6VdsbO0WIlE=h310",
        "//lh3.googleusercontent.com/z9lcb02HfbbnMZrs6tY6dihYsL4gXPhHHRusuPL5KTXrn2Cm4dV15XzSCog2yDiNcYo=h310",
        "//lh3.googleusercontent.com/lulMnMt8tgCpOKFYYCyWLC25yOyJ0s1dId0W06smcKd6H99zxBUgHToBAqLAMYhi9sT5=h310",
        "//lh3.googleusercontent.com/A7bwI4HorkqQ5TYa7cWqdmWmaWFPyWj3P8CSh87jfDTg_yrEwqWcw5CFF2TngCUZQejR=h310",
        "//lh3.googleusercontent.com/gaL5ovQSdTghwW07K64wI5RViCaIUt-4m6o9uXaR2qVNAxUBqUJo6_S0ZPIk58gACmE=h310"
    ],
    "comments": [
        "Ok",
        "Love it",
        "Hi"
    ],
    "recentChanges": [
        "- Performance improved",
        "- Optimized for Android Wear 2",
        "- Enjoy the update and keep the feedback coming!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tppm.luxury.watch.face&hl=en&gl=us",
    "appId": "com.tppm.luxury.watch.face"
}