{
    "title": "Tech Ops - U Sony SmartWatch 3",
    "summary": "Tech Ops Ultra is the ultimate watchface that you want for your smart watch.",
    "icon": "//lh3.googleusercontent.com/TNABbt7IuA8rLufYMQYhToXZGgRtR5sVJ-woD27zayrT4HgqSMpzrDcsTXnier_xjz6N=w300",
    "price": "$1.01",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 1.8,
    "reviews": 5,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "October 1, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Have you ever envied the secrets agents and militants with super gadgets and watches? If you had then don’t envy anymore, TOU (Tech Ops Ultra) is the ultimate watchface that you want for your smart watch. With the cool design, various features and option to modify colors you will feel like a super-agent.It is laden with features like mobile and watch battery health, missed calls and unread messages notification, weather updates, forecast, time and date. You can also change the foreground color to modify the app just like you want. It has all you need. FrillRoid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:-• Mobile and watch battery health.• Missed calls and unread messages notification.• Weather updates.• Weather forecast• digital military design.• Faster recognition with percentages and icons.• Glow design with dark background.• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular/square smart watches such as the LG G Watch, Samsung Gear Live, Sony smartwatch 3, Asus Zenwatch and Samsung Gear Live. Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.",
    "descriptionHTML": "Have you ever envied the secrets agents and militants with super gadgets and watches? If you had then don&#x2019;t envy anymore, TOU (Tech Ops Ultra) is the ultimate watchface that you want for your smart watch. With the cool design, various features and option to modify colors you will feel like a super-agent.<br><br>It is laden with features like mobile and watch battery health, missed calls and unread messages notification, weather updates, forecast, time and date. You can also change the foreground color to modify the app just like you want. It has all you need. <br><br>FrillRoid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br>Key custom features:-<br><br>&#x2022; Mobile and watch battery health.<br>&#x2022; Missed calls and unread messages notification.<br>&#x2022; Weather updates.<br>&#x2022; Weather forecast<br>&#x2022; digital military design.<br>&#x2022; Faster recognition with percentages and icons.<br>&#x2022; Glow design with dark background.<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br>This watch face is for rectangular/square smart watches such as the LG G Watch, Samsung Gear Live, Sony smartwatch 3, Asus Zenwatch and Samsung Gear Live. Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.",
    "histogram": {
        "1": 4,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Td33VcJCdwZD5SmTiMP4fMrkA1CtixwDcMci_QoweFnPjVMjWHfeVmobD7qaI_5TOT4=h310",
        "//lh3.googleusercontent.com/uSAqYumlLjt442qhgsk4OGgC3XSZjbWXPPrSQnSZDC-OjH6mRMB-OvZVUGOXnw23AcM=h310",
        "//lh3.googleusercontent.com/9ipOWW-J1g-_fXvaM2Lla3Qxg_gAGcpU5WXyvsabymLHeA1WvwSIRYYM8PSWJVS-Bg=h310",
        "//lh3.googleusercontent.com/ARFnFVi_8wjPBLmJnY-RMPE4I-7MY8eHSwAcVbOZyZPS6aefEN5t0yvHVibAm8Le0w=h310",
        "//lh3.googleusercontent.com/cpnwrWHElllgiQXWQ4f6W2PVXJ9pFRuEFlNeswRRiZUg3XkX_KCoBIXaITyVlkYw0hQ=h310"
    ],
    "comments": [
        "Play says it is installed, but can't find the app or any evidence of it on the phone. No instructions & can't see any reviews, so nothing good I can say about it now. Android wear doesn't work either. Says it can't find the device (which is already paired and working fine)."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.tech.sony.watch.face.FR40&hl=en&gl=us",
    "appId": "com.frillroid.tech.sony.watch.face.FR40"
}