{
    "title": "First - a Calendar Watchface",
    "summary": "• Calendar arcs for agenda/events• Complications support• Highly customizable",
    "icon": "//lh3.googleusercontent.com/HSTMcUPs-_MkF_6hMN7_CPGL8cubWRTxVVwktmHX3dnrwSoIaCE3G8oBsMWA2Wxa1rc=w300",
    "price": "$1.49",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.6,
    "reviews": 42,
    "developer": "RJR Apps",
    "developerId": "RJR+Apps",
    "developerEmail": "rjrapps.llc@gmail.com",
    "developerAddress": "Wisconsin\nUnited States",
    "updated": "December 10, 2017",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "*** IMPORTANT: If you have Android Wear 2.0 and you install this on your Android phone, you will need to go to the Google Play Store on your watch to install it there. Scroll all the way down on the front page of the store, and you will see all the watch apps on your phone that you can manually install. *** FirstDesigned specifically for Android Wear 2.0, First is a calendar-focused watch face with a clean, minimal design. Featuring calendar arcs to show your agenda, Complications (on Android Wear 2.0), a powerful set of options for rich customization, and dark & bright screens for ease of viewing in all situations, First can bring your smartwatch to life.Calendar DisplayUsing arcs colored from the event colors on your Google Calendar, First displays your agenda of meetings, events, and all-day events in a stylish and functional manner. First is designed to handle events even as long or longer than 12 hours with grace.ComplicationsWatch face Complications are available to use for those with Android Wear 2.0, with the same level of customization as the rest of the features!Dark & BrightOn AMOLED screens, the dark screen is not only clean and minimal, but saves battery too. For bright daylight situations, or when in need of a quick flashlight, the screen can be tapped to show a bright version of the watch face. Watch face options can be customized for each screen independently via the Advanced Settings menu, for a completely customizable experience.Deep, Rich CustomizationFirst features a powerful set of options to allow you to set it up exactly how you like it. Six pre-set option bundles allow for quick setup; or if you prefer, the Advanced Settings menu lets you choose each option individually.Compatibility- First is fully compatible with Android Wear 1.x (without Complications).- First was designed to be compatible with round watches, square watches, and \"flat-tire\" watches.- First has been tested and confirmed to work when paired with iOS devices, but calendar event colors are unavailable, and will instead show a default color. Arc colors may be chosen manually in the Advanced Settings menus for the dark and bright screens.- On iOS, First will work with the Apple Calendar if the calendar cards are set to \"Apple Calendar Event Cards\" in the Android Wear iOS app. To use your Google Calendar, set it to \"Google Calendar Event Cards\", and make sure the \"Your Feed\" option is enabled.ContactI use this watchface every day, so if issues arise, I usually see them pretty quickly. But if you have any issues, suggestions, or comments, please don’t hesitate to contact me at rjrapps.llc@gmail.com!",
    "descriptionHTML": "<b><i>*** IMPORTANT: If you have Android Wear 2.0 and you install this on your Android phone, you will need to go to the Google Play Store on your watch to install it there. Scroll all the way down on the front page of the store, and you will see all the watch apps on your phone that you can manually install. *** </i></b><br><br><b><u>First</u></b><br>Designed specifically for Android Wear 2.0, <b>First</b> is a calendar-focused watch face with a clean, minimal design. Featuring calendar arcs to show your agenda, Complications (on Android Wear 2.0), a powerful set of options for rich customization, and dark &amp; bright screens for ease of viewing in all situations, <b>First</b> can bring your smartwatch to life.<br><br><b><u>Calendar Display</u></b><br>Using arcs colored from the event colors on your Google Calendar, First displays your agenda of meetings, events, and all-day events in a stylish and functional manner. First is designed to handle events even as long or longer than 12 hours with grace.<br><br><b><u>Complications</u></b><br>Watch face Complications are available to use for those with Android Wear 2.0, with the same level of customization as the rest of the features!<br><br><b><u>Dark &amp; Bright</u></b><br>On AMOLED screens, the dark screen is not only clean and minimal, but saves battery too. For bright daylight situations, or when in need of a quick flashlight, the screen can be tapped to show a bright version of the watch face. Watch face options can be customized for each screen independently via the Advanced Settings menu, for a completely customizable experience.<br><br><b><u>Deep, Rich Customization</u></b><br>First features a powerful set of options to allow you to set it up exactly how you like it. Six pre-set option bundles allow for quick setup; or if you prefer, the Advanced Settings menu lets you choose each option individually.<br><br><b><u>Compatibility</u></b><br>- First is fully compatible with <b>Android Wear 1.x</b> (without Complications).<br>- First was designed to be compatible with round watches, square watches, and &quot;flat-tire&quot; watches.<br>- First has been tested and confirmed to work when paired with <b>iOS devices</b>, but calendar event colors are unavailable, and will instead show a default color. Arc colors may be chosen manually in the Advanced Settings menus for the dark and bright screens.<br>- On iOS, First will work with the <b>Apple Calendar</b> if the calendar cards are set to &quot;Apple Calendar Event Cards&quot; in the Android Wear iOS app. To use your <b>Google Calendar</b>, set it to &quot;Google Calendar Event Cards&quot;, and make sure the &quot;Your Feed&quot; option is enabled.<br><br><br><b><u>Contact</u></b><br>I use this watchface every day, so if issues arise, I usually see them pretty quickly. But if you have any issues, suggestions, or comments, please don&#x2019;t hesitate to contact me at rjrapps.llc@gmail.com!",
    "histogram": {
        "1": 2,
        "2": 0,
        "3": 1,
        "4": 5,
        "5": 34
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/UKNIb00KtXU0OI3SkR21f9z2dJz0pijdmr5E5a_U4a4jgVIlyGNH-hdergiqP72Afg=h310",
        "//lh3.googleusercontent.com/pnV1Yjx7GeOpIPm6vf1p3ueOi3UPF0Ki_MkQFxrIMJ96L9N9LUpnLXJg-6rIwFZX0w=h310",
        "//lh3.googleusercontent.com/feX1aOfzLyA7SkUi5eqpzAQTqv7CNJhoovSZS54he2506421GjuIk6G59E-Rkux9Ntxs=h310",
        "//lh3.googleusercontent.com/foBdQfdB2WUHQG2EKKASjAqcPcEqIjjmNHy5f8pJtctypoqE_ss_VJLZBq31QXta0l8=h310",
        "//lh3.googleusercontent.com/88jbpdGZrXaRHn4eAcJhQp8SZPrcSu_ph1RPGHTCEj3jQzsEUp7JpA69_D8t5HCfRac=h310",
        "//lh3.googleusercontent.com/VLp5mVRWGuETs44Jb3im2OusC_9_BFAuKO4N_zFuqQJ8-Bca4lVc21K4tua29loNyJs=h310",
        "//lh3.googleusercontent.com/_7NCxpagJDXkHA8hF6aD006cYOe6ovXXCWtHhfidOFucELL4nipbR-iv7B_8K4j5rTKI=h310"
    ],
    "comments": [
        "I was using the outlook app watch face but found this one. This is now my main watch face. Only thing I can't work out is how to get complications working whilst calendar events are showing... Maybe I'm missing something. Great watch face though.",
        "I love this face! I wish there was a way to turn off the tap for bright face, though. I keep accidentally changing it to white.  Edit: I'm a dumb man who can't read. Found it in the advanced settings, thanks!",
        "This is the best watch face I used. It is simple, supports complications and shows agenda.",
        "5 stars for an excellant app and for responding to an issue so quickly! I am now a satisfied customer. :)",
        "Way more options then shown in the screen-shots. Very nice! Using it on a Fossil Q Explorist.",
        "Really love this watch face. Can it also be set to show reminders as well as calendar events?"
    ],
    "recentChanges": [
        "12/10/2017 -> version 1.1.5",
        "- Fixed an issue with the last few items in the Advanced Settings menu not working properly",
        "---------------",
        "12/10/2017 -> version 1.1.4",
        "- Changed default event display to match Google Calendar's functionality, by showing events longer than 12 hours as All-Day Events",
        "- Added a toggle switch in the Advanced Settings menu to shut that feature off",
        "---------------",
        "11/5/2017 -> version 1.1.3",
        "- Fixed issues with installing on phones"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.rjr.apps.first_watchface&hl=en&gl=us",
    "appId": "com.rjr.apps.first_watchface"
}