{
    "title": "Pujie Red - Wear Watch Face",
    "summary": "Modern red accented watch face with animated battery and date indicator.",
    "icon": "//lh3.ggpht.com/N2Ngrt-2MYb8zqWgniXMCqfT3YgWsiSgORcFpdul6aHwMxYSrKdSlPat4QjWkssVsEw=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.2,
    "reviews": 37,
    "developer": "Pujie",
    "developerId": "7780011900367662392",
    "developerEmail": "pujiemails@gmail.com",
    "developerAddress": "1e J v/d Heijdenstr. 52A,1072 TW Amsterdam",
    "updated": "December 23, 2014",
    "version": "2.0.3",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Modern red accented watch face with animated battery and date indicator for Android Wear.The watch face contains:✔ analog watch hands (hour, minutes, seconds)✔ battery indicator, displaying colored ring. (red when lower than 20, orange when lower than 50, green otherwise)✔ date indicator, displaying colored ring denoting the month progress✔ highly visible watch hands✔ black ambient state on devices with an Amoled or Oled screen✔ animations from ambient to interactive state✔ responds to peek cards by moving the indicators to the top sectionTo install:1. After install run 'Resync app' on Android Wear App.2. Long press your android wear watch and choose Pujie Red as you watch faceCompatible with Moto360, LG G Watch R, LG G Watch, Samsung Gear Live, Sony Smartwatch 3 & Asus ZenWatch.Check out my other watchfaces too at: http://goo.gl/OxiezW!! Please contact me if you have any trouble installing the app !!",
    "descriptionHTML": "Modern red accented watch face with animated battery and date indicator for Android Wear.<br><br>The watch face contains:<br><br>&#x2714; analog watch hands (hour, minutes, seconds)<br>&#x2714; battery indicator, displaying colored ring. (red when lower than 20, orange when lower than 50, green otherwise)<br>&#x2714; date indicator, displaying colored ring denoting the month progress<br>&#x2714; highly visible watch hands<br>&#x2714; black ambient state on devices with an Amoled or Oled screen<br>&#x2714; animations from ambient to interactive state<br>&#x2714; responds to peek cards by moving the indicators to the top section<br><br><br>To install:<br>1. After install run &apos;Resync app&apos; on Android Wear App.<br>2. Long press your android wear watch and choose Pujie Red as you watch face<br><br>Compatible with Moto360, LG G Watch R, LG G Watch, Samsung Gear Live, Sony Smartwatch 3 &amp; Asus ZenWatch.<br><br>Check out my other watchfaces too at: http://goo.gl/OxiezW<br><br>!! Please contact me if you have any trouble installing the app !!",
    "histogram": {
        "1": 1,
        "2": 2,
        "3": 8,
        "4": 5,
        "5": 21
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/7BOOjVEs98L8VkhnvYlzVVwvyfyaf_cJcfTxEGNO3pqhPgFUrYLl4qr-CVAXYhYYqIc=h310",
        "//lh6.ggpht.com/MpxfMMJ3WnswAIkYFouo9hxLgC7Nd8ETpAzdjoMChUDe1M9wbprzyGy4Jp-y-1rngU8=h310",
        "//lh6.ggpht.com/SavEUydIPSWdOoOPyrmPRHdkmLJILlN94R6mtRRSX1R285eY1fjD905ERVZMgi_-ng=h310",
        "//lh5.ggpht.com/-W5F6hFPYQzxQPrt7oVYKWfle30vV5g8ht88FgMbXXkpgr7NTVRrtvDmLHcWZbHuTT-F=h310"
    ],
    "comments": [
        "Not what I expected I have your other watch face and I gave a great review, however this face has no customisations and that is a shame. Please add some options such as colours and position of features and the ability to resize elements and I will push this to 5 stars.",
        "Beautiful Face I own both the red and blue variant of this watch face and they both look great on my G Watch.",
        "Nice but... No custom ability. I bought the other app and it has a lot of adjustments and tweaks. None of that here. I'll stick with it in hopes that it gets an update or 2",
        "Great watch face I love this watch face. It has cool animations when the screen lights up. Only thing I would like is the option to change the face saying Pujie on it. Thanks,",
        "Striking Watch Face Very good looking watch face, runs well on my moto 360. Love that it displays the battery status and the date! And very easy to install since it requires no additional apps. Keep up the good work!",
        "Bad Ambient Mode The ambient mode doesn't read well at all"
    ],
    "recentChanges": [
        "v 2.0.3",
        "- Android Wear 5.0 Support!",
        "- Indicators move up when peek card is visible",
        "- Black ambient mode on devices with Oled or Amoled screens"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pujie.wristwear.pujier&hl=en&gl=us",
    "appId": "com.pujie.wristwear.pujier"
}