{
    "title": "NAVI - Watch face",
    "summary": "Enjoy this signature watch face collection for Android Wear by Tha PHLASH",
    "icon": "//lh3.googleusercontent.com/0ZDjVeKVSL_CXSRb9VFSL6PLMgb9qzablRFDKAAaIKfLS824pgi4ha90JGTnSGgftA=w300",
    "price": "$1.99",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 1268,
    "developer": "Tha PHLASH",
    "developerId": "7767184822845969254",
    "developerEmail": "thaphlash@gmail.com",
    "developerWebsite": "http://tha-icon.com",
    "developerAddress": "Tha PHLASH\n4651 Rue Clanranald\nMontreal, QC\nH3X2R7",
    "updated": "February 29, 2016",
    "version": "31.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "NAVI is a modern analog watch face for Android Wear with tiny details that will fill your hearts with joy. Futuristic Interface with many settings and a clean look. The customization options are accessible by long pressing the watch face, or directly from the Android Wear app simply click the \"gear icon\".Compatible with Moto360, Moto 360 2nd gen (42mm, 46mm), LG G Watch R (lgwr), LG G Watch W100 (lgwg), LG G Watch, LG Watch Urbane (lgwu), Samsung Gear Live, Sony Smartwatch 3 (sw3), Asus ZenWatch, Asus ZenWatch 2, Huawei Watch.If it uses android wear, i'm on it.Take note:Sometime there's a delay getting the watch face on the watch from your phone, i recommend a bit of patience if its not instantaneous for you . This is not caused by the watch face, but rather Android Wear app.If the Application doesn't appear:- uninstall the face- restart phone- restart watch- connect watch and phone- install the watch faceYou can get more info by checking out my FAQ here: http://www.tha-icon.com/help/ LET'S HOOK UPWebsite: http://www.tha-icon.comTALK ABOUT ITG+: http://google.com/+PhlashTha",
    "descriptionHTML": "NAVI is a modern analog watch face for Android Wear with tiny details that will fill your hearts with joy. <br><br>Futuristic Interface with many settings and a clean look. The customization options are accessible by long pressing the watch face, or directly from the Android Wear app simply click the &quot;gear icon&quot;.<br><br><b>Compatible with</b> <br>Moto360, Moto 360 2nd gen (42mm, 46mm), LG G Watch R (lgwr), LG G Watch W100 (lgwg), LG G Watch, LG Watch Urbane (lgwu), Samsung Gear Live, Sony Smartwatch 3 (sw3), Asus ZenWatch, Asus ZenWatch 2, Huawei Watch.<br><br>If it uses android wear, i&apos;m on it.<br><br><b>Take note:</b><br>Sometime there&apos;s a delay getting the watch face on the watch from your phone, i recommend a bit of patience if its not instantaneous for you . This is not caused by the watch face, but rather Android Wear app.<br><br>If the Application doesn&apos;t appear:<br>- uninstall the face<br>- restart phone<br>- restart watch<br>- connect watch and phone<br>- install the watch face<br><br>You can get more info by checking out my FAQ here: http://www.tha-icon.com/help/ <br><br><b>LET&apos;S HOOK UP</b><br>Website: http://www.tha-icon.com<br><br><b>TALK ABOUT IT</b><br>G+: http://google.com/+PhlashTha",
    "histogram": {
        "1": 76,
        "2": 61,
        "3": 142,
        "4": 296,
        "5": 693
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/YFTnLVN_Voue32ZeU6cQPKiWvB7kxHtEFnZ_8S1nV4zBudUT83WFehsk8xShiGDKETQ=h310",
        "//lh3.googleusercontent.com/h73HwX1BvOBv2KOz44PmNT0bs5vuzP0_cfD2apm2nOf-6zKmwzM8jCu1lvFsdYYlSjMO=h310",
        "//lh3.googleusercontent.com/vP2MrA4wgEBU7rsSCFOLDdZz6AwoulEAxDu70WgjbSbXt0kuq2GSOHLvMwJErmdpSw=h310",
        "//lh3.googleusercontent.com/F2R3lvrE0qpnIpcTnnV2XAb6uLGn7hsV3tQUVl-3IJtQCGKH0_iEI7xnJMoDAz8P-PE=h310",
        "//lh3.googleusercontent.com/gwyqDRFlRr0W7QTjmhxlqzDn1MNSMcehTNdTPwNzR57zAg0rnfeMf6Q817y50VnFdQ=h310",
        "//lh4.ggpht.com/AjpjBcqWW1idDlSShyX5lVNEMi_8VEbQ9kx_tAMpd-ds8tPykiq7Ju7D3ltG4wLzkR4=h310",
        "//lh4.ggpht.com/zQwPu5S5lVo5uGJHhg6_2Q5gBKFdRZlPCH-fan8ssc9m9BiB4IK5VgYCxcDuf6XJSw=h310",
        "//lh5.ggpht.com/8BZlmH5uuKm1bRkHACbIQFkOViVHJMaUTqLGP3bY8qNCbwtT8P7zp281yX_k7hyRjE4=h310",
        "//lh5.ggpht.com/N7c6bmd8d6sENYkK341YPbvwpljHWIfhrgjlahYCGmgbxlR_zBq2_3K6-d2TqfhRSA=h310",
        "//lh4.ggpht.com/NlfKmLwUdrKKS2DVduPuXP79lKelu0TkkCJA_HNG5cxK4ePPqarOKpASPavggFujcw=h310",
        "//lh3.googleusercontent.com/N3xU7QnEQrKWOSbbfRKNUPUtBumhT8e2ZAjuCtLnqCYrja0Z0tvtHcdMOnbjhi0pXmV-=h310",
        "//lh3.googleusercontent.com/TjOhWgPalzDhO2auajvCnvioLu33yStUTZEkOntDIeyCFqfOTMdT-_D2q1hPkrZe1HE=h310",
        "//lh3.googleusercontent.com/Xe968rxVLDSR2bLveN-1jwTNI1jE6WDHDenW7m5Xgm9XsZOqKY_xoxNsRXM0oDQOCk9k=h310",
        "//lh3.googleusercontent.com/SRio7NuNRLzG_RE2ht-msBSCq7fNK_EdshroKDSoLvbO6Ug8R9JIbONgoLmzH_YGmvQ=h310",
        "//lh3.googleusercontent.com/z7xVgEuOs21FgVvomlgdCSM-zfmB1VHHAVPWmBPnqqfhh33cAkxp5WjxggBmUWLH-081=h310",
        "//lh3.googleusercontent.com/MM5PRVaCKRX5mP2B_R1bja_pGwxtGwTwBYuSpxG5H-MaA_Kf81YM1vzo0xCf-V7Ppon4=h310",
        "//lh3.googleusercontent.com/JOQAYhrQm_TLjjIRknGxyPSFBtyBq8gCIDa2NBCBjJmw0WyuvOZqHaSRlqkT-SCbsbsN=h310",
        "//lh3.googleusercontent.com/YYksVJiim8EScZ3nckEEtj3t6UElDuSOjkS04AdpHxdmDwhX9Nt9rXa8M25VnAti6aQ=h310",
        "//lh3.googleusercontent.com/kNO4UY249-guw01Mx9ryst7VDBYhLr5jtv0jOJ5yPk54KHngbHqfSH5AjEtqWcVEs-A=h310"
    ],
    "video": "https://www.youtube.com/embed/l3CECF2nYeM",
    "comments": [
        "This was the third (of many now) watch faces I've scooped up made by Tha PHLASH. Mad futuristic style... many props.   Wear 2 folks, install to phone and it'll pop up on watch.   He has so many incredible designs. I can't help myself and switch them up constantly. If you have issues check his website/instructions first... if that doesn't work he is an EXTREMELY responsive developer. Two thumbs up and a Word Up to Tha PHLASH for some awesome designs.",
        "Great face I like the watch, reason I downloaded it was because reviews and other people having zenwatch 2 issues. I have had issue with other faces and I believe it's because of that. But Gary Shook has a good suggestion to add steps counter in place of the battery percentage. Since the bars on the side show both phone and watch battery or if they do not perhaps label them respectively allow for that. It's a great watch face very pleased with it. Like the look of it very futuristic. Thanks.",
        "Good looking but lags I can't really rate this yet because I've not been able to use it. Stock Nexus 6P on Android N Developer Preview 3, Moto 360 1st generation. It's just not installing and don't see in options of Android wear or watch. It's like it doesn't exist. Once I can get using it I can review it. I appreciate it!                          EDIT: I was able to get it to install but it lags somewhat. Keep in mind I am using Android N so it may not be an issue with the watch face. It is highly customizable and nice function",
        "Love the default view/color scheme of the watch face. At this point it's a lost cause for me, since my watch (Ticwatch2) isn't supported, but I love this too much to justify not having it.  =]    Current issue I have, is changing any actual settings either from my watch, or from my phone; neither of which work.  =[  I'm having the same issue with your other watch faces.",
        "Totally awesome!! Only problem is that I can't open the app from my phone. Works great on the watch though. I love the app but need to get to the options from my phone. Any suggestions? I have a Samsug Galaxy S5. Thanks, best dial I have ever seen. I have been a timepiece fanatic for decades(particulary automatics) and love now that I can replicate anything I want with software and LCD. Your app is what prompted me to buy a smart watch. I just came across the app randomly and was immediately sold. Thanks! Any help appreciate",
        "Downloaded it and its no where to be found.  Does this not work with Wear 2.0?  Not seeing it as an option in any menu.  edit*  Changed to 4 stars, had to restart both devices and allow access from the actual watch once both were reconnected.  Would be 5 stars without that hassel, the face looks good and is highly customizable."
    ],
    "recentChanges": [
        "- Weather refresh button.",
        "- Fine tuned the preset colors.",
        "- New Tap function. Simply tap the watch face to cycle tru all 8 presets (this option has to be enabled in the settings)",
        "- Tap the battery % to switch between Phone and watch battery indicator.",
        "- Battery indicator get a little \"W\" for Watch and \"P\" for Phone to identify them faster.",
        "- Navi Text can now be curved with new font size, and switched to the top 5 trending google search topic of the hour.",
        "- Many many other overall fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.thaphlash.watch.navi&hl=en&gl=us",
    "appId": "com.thaphlash.watch.navi"
}