{
    "title": "Illustration Watch Faces by VA",
    "summary": "Choose from FIVE faces: &quot;Octopus&quot;, &quot;Owl King&quot;, &quot;Skull&quot;, &quot;Elephant&quot; and &quot;Giraffe&quot;",
    "icon": "//lh3.googleusercontent.com/X5XM2jy1rZCVx083UkqJxrKcHrFy5t7w9U3IDf93SWORp9mP7jYVFAEZ8frNRUS8Hg=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.5,
    "reviews": 127,
    "developer": "Fat Russell",
    "developerId": "4948350704947456352",
    "developerEmail": "virginia@fatrussell.com",
    "developerWebsite": "http://www.fatrussell.com",
    "developerAddress": "428 Braddock Street\nJohnstown, PA 15905",
    "updated": "January 14, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Illustration Watch Faces by VAChoose from five watch faces for Android Wear: \"Octopus\", \"Owl King\", \"Skull\", \"Elephant\" and \"Giraffe\", each with unique customizations. Change colors, tick marks and more using the Android Wear app! Add some fun illustrations to your Android Wear watch! All designs created by VA work on circular and square watches. •   Octopus: Choose from set colors to control the octopus illustration, background and accents.•   Owl King: Custom pick the owl king illustration and background color.•  Skull: Custom pick the background color, choose black or white for the skull illustration and choose tick mark style.•   Elephant: Choose from set colors for the elephant illustration, accents and background.•   Giraffe: Choose from set colors to control the giraffe illustration, background and accents.12 and 24 hour options included with the \"Owl King\", \"Elephant\" and \"Giraffe\" designs.To access the customization settings:•   Open the Android Wear app (on the phone or tablet paired with your Wear device)•  Select your VA Illustration watch face•  After selected, click the gear icon over the watch face preview•  Customize your watch face!Add some fun and unique imagery to your Android Wear watch face!",
    "descriptionHTML": "<b>Illustration Watch Faces by VA</b><br><br>Choose from five watch faces for Android Wear: &quot;Octopus&quot;, &quot;Owl King&quot;, &quot;Skull&quot;, &quot;Elephant&quot; and &quot;Giraffe&quot;, each with unique customizations. Change colors, tick marks and more using the Android Wear app! <br><br>Add some fun illustrations to your Android Wear watch! All designs created by VA work on circular and square watches. <br><br>&#x2022;&#x2003;  <b>Octopus:</b> Choose from set colors to control the octopus illustration, background and accents.<br><br>&#x2022;&#x2003;  <b>Owl King:</b> Custom pick the owl king illustration and background color.<br><br>&#x2022;&#x2003; <b>Skull:</b> Custom pick the background color, choose black or white for the skull illustration and choose tick mark style.<br><br>&#x2022;&#x2003;  <b>Elephant:</b> Choose from set colors for the elephant illustration, accents and background.<br><br>&#x2022;&#x2003;  <b>Giraffe:</b> Choose from set colors to control the giraffe illustration, background and accents.<br><br>12 and 24 hour options included with the &quot;Owl King&quot;, &quot;Elephant&quot; and &quot;Giraffe&quot; designs.<br><br>To access the customization settings:<br>&#x2022;&#x2003;  Open the Android Wear app (on the phone or tablet paired with your Wear device)<br>&#x2022;&#x2003; Select your VA Illustration watch face<br>&#x2022;&#x2003; After selected, click the gear icon over the watch face preview<br>&#x2022;&#x2003; Customize your watch face!<br><br>Add some fun and unique imagery to your Android Wear watch face!",
    "histogram": {
        "1": 3,
        "2": 1,
        "3": 12,
        "4": 19,
        "5": 92
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/0yrVzrTuSBCnOh1Z7pNeDApC-6FOzQaauXz_dYOKf3frKluL3AZuRKqbdI7KSkd5E98=h310",
        "//lh3.googleusercontent.com/aOzJPWJMarPoNtR8TgWEbW-1cNMNki38Lctm03rrgeSHZEtUM_owm4oYzw4PrJd_aX51=h310",
        "//lh3.googleusercontent.com/oGZG_YpYpptykgRfq3Kk2jAIiMJ_8JqCLjSrRnlgkUYjvQN64hkBoSA3xsefGqh8fA=h310",
        "//lh3.googleusercontent.com/e2kXEo6UmVD961SErphNF1rePnLRWAo85GApSl_jUjhins1IkQH8xxULiaCoypc-IT0=h310",
        "//lh3.googleusercontent.com/t959tlu4w7aazxvonQcD5R_f7Vf_K-JVAyAUai3CLoYKwcUqVD0YEKncetbHcDs72TY=h310",
        "//lh3.googleusercontent.com/EL8AM3niYqdYkcsHAIM2P6uCAbzY9A4-mOKMMIRjb5MbbmGURLeLsFHuRz_zxeMicFUK=h310",
        "//lh3.googleusercontent.com/OJs72OUJF5HtXqRr07vl3pFbP6J_YGYdjnDqNEGb6fbbz3ocMdX6u8eh7foKE--kwSw=h310"
    ],
    "comments": [
        "Amazingly customizable!!!!! Even the limited ones you have full choice of the colors given. I wanna buy all these watch faces now",
        "Great and beautiful designs. I really want to use the owl design but when I'm listening to music the card with the artist and play/pause button comes up higher on the watchface (and coversn up the time) then it does on the other watch faces. A fix to this would be greatly appreciated!",
        "Awesome watch faces. Really hoping for an update with more illustrations. I'd love to see an otter in one. Or any other nice images.",
        "Nice! But could you add more setting like more colors and settings? Thanks!",
        "Fantastic faces! Very customizable and fun! Very happy with this purchase. :)",
        "Amazing Simple and elegant"
    ],
    "recentChanges": [
        "2.0 Release for Wear 2.0",
        "- Now available as a stand-alone app for iPhone users!",
        "- Due to the emerging HUGE popularity of Giraffes, we knew we had to add a Giraffe illustration watch face,  Enjoy",
        "- Updated Owl King face with an easier to read font",
        "- Added an option to remove tick marks from Skull watch face",
        "- Updated all ambient modes to include more information and to avoid collisions with peek cards",
        "- Bug fixes, platform updates and stability updates"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.fatrussell.watchface.illustrationsonewatchface&hl=en&gl=us",
    "appId": "com.fatrussell.watchface.illustrationsonewatchface"
}