{
    "title": "Quick Apps",
    "summary": "Launch Any App On Your phone from anywhere even your watch",
    "icon": "//lh3.ggpht.com/2MVN-FzVyo_FxxmcapDZPMkj5Z90VCTnhB0HM6wPpWPrmPkNsKrEspVy9jqHQgIe_F6t=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.4,
    "reviews": 21,
    "developer": "Eunan Hardy",
    "developerId": "Eunan+Hardy",
    "developerEmail": "Support@mobilemoji.com",
    "developerAddress": "Rasharkin\nCounty Antrim\nNorthern Ireland",
    "updated": "October 19, 2014",
    "version": "1.7",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": " What is QuickApps QuickApps gives users the power to have their favorite apps in one easy to use place. QuickApps will launch a simple little widget onto your screen that will allow you to access your most frequently used apps without the hassle of menus (See below for full features).QuickApps similar to other apps created by Mobile Moji, uses a sleek design that is easy on the eye and won’t draw your attention away from what is happening on the screen. If you are fed up with navigating through menu after menu to find your apps then QuickApps is the app for you! Full Feature Set - Select two different apps for quick access - Tap widget to access 1st QuickApp- Double tap widget to access 2nd QuickApp- A sleek minimal user friendly interface - Support for a broad range of devices- Full Android Wear SupportUpdate (1.1)-Redesigned QuickApps widget after user feedbackUpdate(1.2)- Full Android Wear Support- Launch Your Favorite Apps From A Tap on Your New Smartwatch- Bug Fixes - New Higher Res Icons- Redesigned Icons - Redesigned Splash Screen Update (1.4)-Bug Fixes-Sorted App ListsUpdate (1.4.5)-Bug Fixes-Removed Sorted App Lists (Sadly this broke the application will be put back in at a later date)Update (1.6)-Bug Fixes- Volume Control widget now available Update (1.7)-Bug Fixes-Updated for Material DesignNotice: - This is suppose to be trial version of the app, the full version can be unlocked via in-app purchase.- We Recommend that any users looking to take advantage of the Wear functionally of this app be running Google play services 5.0 or higher as this has been known to case bugs.   Known Bugs: - Wear Users must re-enabled wear integration within the app whenever changing Quick app Applications.- Some users have encountered problems with Qucikapps showing up on hardware devices Please note that this is most likely a bug with Google play services but we are looking into it as a possible issue with app as well.  If you have any problems or find any bugs please contact me through the email listed below.",
    "descriptionHTML": "<b> What is QuickApps </b><br><br><br>QuickApps gives users the power to have their favorite apps in one easy to use place. QuickApps will launch a simple little widget onto your screen that will allow you to access your most frequently used apps without the hassle of menus (See below for full features).<br><br>QuickApps similar to other apps created by Mobile Moji, uses a sleek design that is easy on the eye and won&#x2019;t draw your attention away from what is happening on the screen. If you are fed up with navigating through menu after menu to find your apps then QuickApps is the app for you!<br><br><b> Full Feature Set </b><br><br>- Select two different apps for quick access <br>- Tap widget to access 1st QuickApp<br>- Double tap widget to access 2nd QuickApp<br>- A sleek minimal user friendly interface <br>- Support for a broad range of devices<br>- Full Android Wear Support<br><br><b>Update (1.1)</b><br>-Redesigned QuickApps widget after user feedback<br><br><b>Update(1.2)</b><br>- Full Android Wear Support<br>- Launch Your Favorite Apps From A Tap on Your New Smartwatch<br>- Bug Fixes <br>- New Higher Res Icons<br>- Redesigned Icons <br>- Redesigned Splash Screen <br><br><b>Update (1.4)</b><br>-Bug Fixes<br>-Sorted App Lists<br><br><b>Update (1.4.5)</b><br>-Bug Fixes<br>-Removed Sorted App Lists (Sadly this broke the application will be put back in at a later date)<br><br><b>Update (1.6)</b><br>-Bug Fixes<br>- Volume Control widget now available <br><b>Update (1.7)</b><br>-Bug Fixes<br>-Updated for Material Design<br><br><b>Notice:</b> <br>- This is suppose to be trial version of the app, the full version can be unlocked via in-app purchase.<br>- We Recommend that any users looking to take advantage of the Wear functionally of this app be running Google play services 5.0 or higher as this has been known to case bugs.   <br><br><b>Known Bugs:</b> <br><br>- Wear Users must re-enabled wear integration within the app whenever changing Quick app Applications.<br>- Some users have encountered problems with Qucikapps showing up on hardware devices Please note that this is most likely a bug with Google play services but we are looking into it as a possible issue with app as well.  <br><br>If you have any problems or find any bugs please contact me through the email listed below.",
    "histogram": {
        "1": 3,
        "2": 3,
        "3": 5,
        "4": 2,
        "5": 8
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/B94aqgctDNs4CMO9WaafzQms4miVXTKUrecuLhb6F3A3PxTGjol_PeEoYRyY6Bl_YA=h310",
        "//lh6.ggpht.com/NrXrl9y0FNSce11fv1YXZdN-ezQW0UXnmsbMtEYJo-kPHAq4_IHHTh1KBFc0EN8fjrw=h310",
        "//lh4.ggpht.com/6ltjdJQ0jzu1ZZKXFQYVdGdZiaSnQr4avBOwT9zW5630C_RXxnJCe7TjTSE_UO9AJlTH=h310"
    ],
    "video": "https://www.youtube.com/embed/ESEXLkef1jM",
    "comments": [
        "Doesn't do anything Doesn't work my phone nor my watch!? Update... Talk to the Dev for 20 minutes as he tried to help with issues. Was not able to get it working, but was offered a refund. Very nice guy. I'll just be waiting for an update to see if that fixes the issues I'm having.",
        "Does not work on Android Wear... Did not work on my Samsung Gear Live.  Has a floating button to launch apps quickly, but the card does not show up on my Wear device.  Talked to the dev and it was only working in the emulator.  Hopefully he gets this fixed soon. Otherwise the app works as a quick app launcher.",
        "Very cool and useful"
    ],
    "recentChanges": [
        "-Bug Fixes",
        "-Updated for Material Design"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.hardy.quickapps&hl=en&gl=us",
    "appId": "com.hardy.quickapps"
}