{
    "title": "Analog Aviator Watch Face",
    "summary": "The Best Looking Timekeeper Ever Designed for Android Wear.",
    "icon": "//lh4.ggpht.com/oZLXnnanLsvt-JM1zsDnDBIVQOU9z4AFxwU_eUG6kcpLUCxZOHbDoRP3LxLKSHnZQw=w300",
    "price": "$1.03",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.8,
    "reviews": 8,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "March 10, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Wearing a great watch is as important to your well-being as taking your vitamins, because a hand-crafted timepiece is about more than just telling time. Some might call this watch geek. We prefer to call it Timepiece Brilliance, because this design is everlasting. Other than brilliant design this watch face comes with awesome features like battery indicator for both watch and mobile. Frillroid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable. Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Wearing a great watch is as important to your well-being as taking your vitamins, because a hand-crafted timepiece is about more than just telling time. Some might call this watch geek. We prefer to call it Timepiece Brilliance, because this design is everlasting. Other than brilliant design this watch face comes with awesome features like battery indicator for both watch and mobile. <br>Frillroid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable. <br><br><b>Key custom features:-</b><br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><b>How it works?</b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 1,
        "2": 0,
        "3": 2,
        "4": 2,
        "5": 3
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/0pnBI1zjKDIRrqvH0UrvBEMyKq4aa3OG5_JE1c_n3MTEg2_gn222XCTMwWl_n0Dk6Nw=h310",
        "//lh5.ggpht.com/ddqTlWQvbEejufBtRLRvqCSVLEQ5cCR11xpithHogWZhhVTMHr6vETGe0TEXjfbj5w8=h310",
        "//lh6.ggpht.com/9ibMpMpK0IH0V3PPQerE-uFxdebrCo8N2mA2e3PqRSXYfsX7HFS5LsNmJ9fs2QA46bxr=h310",
        "//lh5.ggpht.com/yQjTfD3DM34tE852fQMc_aMnNxeH3cRwve7H3_p3HFat6oTkRb7uEtsVgNvqPsvDFw=h310",
        "//lh3.ggpht.com/IXm_VHMix7sHt-xc1UORv0rRT3kGwRzqGDunKuHkJtErZc_0rhU7M3-w5Dh4CECP2fY=h310"
    ],
    "comments": [
        "E.Liew Not bad watch face. The watch face could have been maximise to a slightly bigger face. It's a bit small & cramp in my G Watch R. The hour & minute hands show correct time in idle mode. Too bad no small face & lack of customisation...",
        "Early days... With much more customisation... This could be one of the best"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.analog.aviator.watch.face.A16&hl=en&gl=us",
    "appId": "com.frillroid.analog.aviator.watch.face.A16"
}