{
    "title": "Watch Face for Christmas",
    "summary": "Celebrate holidays with the Christmas watch face from this smart watch app!",
    "icon": "//lh3.googleusercontent.com/hZOjKvR8AJBvymHGv3ahIYXbSyGVRFTuICRi_7aptzWu0VkypFX10hzzEnDeE6pPdg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 2.7,
    "reviews": 12,
    "developer": "Thalia Premium Photo Montage",
    "developerId": "7125614350471173442",
    "developerEmail": "thaliamaka@gmail.com",
    "updated": "January 18, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "❄*❄*❄ Ho, ho, ho! ❄*❄*❄ Watch Face for Christmas is here to bring the mood of festivity to your smart device and fill your heart with warmth! Quickly download our new Christmas watch face and decorate your smart device easily! This animated smart watch app can serve as a Christmas watch face maker as it offers you the option to choose the design of the hands, background and other elements as you wish. Synchronize with your phone, and you are ready to have the best smartwatch for Christmas! If you have a Christmas wallpaper on your smartphone, it would be amazing to have matching Christmas watches during the holidays! These specially designed custom watch faces are completely free of charge, follow the instructions below and get the best present, Watch Face for Christmas! Celebrate love, joy and family traditions using one of the best Christmas apps!❄❄❄ ☃ ☃ ☃ ❄❄❄***How to set your watch face?***● Download smart watch application to your phone! ● Find the icon and simply click on it! ● Choose among beautiful preset skins and sync to your smartwatch!● Or design your own watch face!● Choose all watch face elements separately!● Choose a background, different hand styles, markers and widget styles! ● See the preview of each element combination!● Choose what you want to be shown when your watch face is in ambient mode!  ● When you're done, sync the app with your device! ● Both round and square watch faces supported! ***Where to find the watch face you've chosen?*** ● You can either find the Android Wear application on your phone and select our watch face from the list.● Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.● Wait a few seconds for the app to synchronize, be patient!Gear up with Watch Face for Christmas, download the app to your phone and then sync software for smart watch.***Compatibility!***Make sure that your device runs on Android Wear operative system, otherwise you won't be able to use our application. Watch Face for Christmas is compatible with all of the latest Android Wear devices including:  Moto 360 1Moto 360 2nd genHuawei WatchAsus Zen Watch 1 ,2 & 3 LG Watch UrbaneLG Watch Urbane 2nd EditionLG Watch R™LG G WatchFossil Q FounderCasio WSD-F10Tag HeuerSony Smartwatch 3Note: On occasion it takes some time for a watch face app to synchronize with your device. In case you're having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you're enjoying our watch faces we wouldn't mind getting a positive review. Thank you for understanding, enjoy using our app!Contact us on: watchfacessupport@webelinx.comDisclaimer: Android™ is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "descriptionHTML": "&#x2744;*&#x2744;*&#x2744; Ho, ho, ho! &#x2744;*&#x2744;*&#x2744; <br><br>Watch Face for Christmas is here to bring the mood of festivity to your smart device and fill your heart with warmth! Quickly download our new Christmas watch face and decorate your smart device easily! This animated smart watch app can serve as a Christmas watch face maker as it offers you the option to choose the design of the hands, background and other elements as you wish. Synchronize with your phone, and you are ready to have the best smartwatch for Christmas! If you have a Christmas wallpaper on your smartphone, it would be amazing to have matching Christmas watches during the holidays! These specially designed custom watch faces are completely free of charge, follow the instructions below and get the best present, Watch Face for Christmas! Celebrate love, joy and family traditions using one of the best Christmas apps!<br><br><br>&#x2744;&#x2744;&#x2744; &#x2603; &#x2603; &#x2603; &#x2744;&#x2744;&#x2744;<br><br>***How to set your watch face?***<br><br>&#x25CF; Download smart watch application to your phone! <br>&#x25CF; Find the icon and simply click on it! <br>&#x25CF; Choose among beautiful preset skins and sync to your smartwatch!<br>&#x25CF; Or design your own watch face!<br>&#x25CF; Choose all watch face elements separately!<br>&#x25CF; Choose a background, different hand styles, markers and widget styles! <br>&#x25CF; See the preview of each element combination!<br>&#x25CF; Choose what you want to be shown when your watch face is in ambient mode!  <br>&#x25CF; When you&apos;re done, sync the app with your device! <br>&#x25CF; Both round and square watch faces supported! <br><br><br>***Where to find the watch face you&apos;ve chosen?*** <br><br>&#x25CF; You can either find the Android Wear application on your phone and select our watch face from the list.<br>&#x25CF; Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.<br>&#x25CF; Wait a few seconds for the app to synchronize, be patient!<br><br>Gear up with Watch Face for Christmas, download the app to your phone and then sync software for smart watch.<br><br>***Compatibility!***<br><br>Make sure that your device runs on Android Wear operative system, otherwise you won&apos;t be able to use our application. Watch Face for Christmas is compatible with all of the latest Android Wear devices including:  <br><br>Moto 360 1<br>Moto 360 2nd gen<br>Huawei Watch<br>Asus Zen Watch 1 ,2 &amp; 3 <br>LG Watch Urbane<br>LG Watch Urbane 2nd Edition<br>LG Watch R&#x2122;<br>LG G Watch<br>Fossil Q Founder<br>Casio WSD-F10<br>Tag Heuer<br>Sony Smartwatch 3<br><br>Note: <br><br>On occasion it takes some time for a watch face app to synchronize with your device. In case you&apos;re having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you&apos;re enjoying our watch faces we wouldn&apos;t mind getting a positive review. Thank you for understanding, enjoy using our app!<br><br>Contact us on: watchfacessupport@webelinx.com<br><br>Disclaimer: Android&#x2122; is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "histogram": {
        "1": 6,
        "2": 1,
        "3": 0,
        "4": 1,
        "5": 4
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/wS1u9xULAiscy5_-wJ_Nw-0nJqkJ5399Kea4L5Kci8G6ERJsMyrEQjp9k282XfkxPXZb=h310",
        "//lh3.googleusercontent.com/ASpIyqfsz4Z6aP8lsijYF7DeBKUYBKP4Vaj6ugfin-Su7iE8_N3xWsOP0sYtOBiWzQ=h310",
        "//lh3.googleusercontent.com/aXKqDp4CTaUT7iIOysWMpAbbcGKM9QwmuvlMs8Hl6QYjXbAXd9Y-aRFp0tdTfltNhAoe=h310",
        "//lh3.googleusercontent.com/q6It8YrE-ehQ4iTGZvAEjVAxmUex-4Jy5qILmRYvrEWYlzT8_Upl_ne_xfkPYxYN5eg=h310",
        "//lh3.googleusercontent.com/sDhXf1L3j-z_--6yPgzY2FQfZqsFgtNBX_jhy_TlJBHkRi5-xkluEGb5KrEFJTzZaWY=h310",
        "//lh3.googleusercontent.com/IGLc3z3C9yprW2W3REhvVMG5bNVtKcAnMCdkb4fOifMzIB0UgWuLS9ehxsWu44KZkQ=h310",
        "//lh3.googleusercontent.com/90yETCq3_PlWumqi2ISaz5wtww6DqmhVmMYItysMApxvKuQG9LU-yGfjg2KzqwxUtA=h310",
        "//lh3.googleusercontent.com/Io-oqP2SCYE13pes5EKtL4Kg2oAHS3hh43c7GJQOK_cC0-8QCT9vmOPWWAAVnARiyA=h310",
        "//lh3.googleusercontent.com/Zdc0n3iR20dM6KJtcbbCRTfLlkhJk3Xwpgxyy72QvS_UtPrGyPy8XAPuWRM8Rqvx1Bw=h310"
    ],
    "comments": [
        "Too much ads. Lots of customization choices and nice images, but needs an option to disable the animations. Ads are massively intrusive."
    ],
    "recentChanges": [
        "- Minor enhancements",
        "- Performance improved",
        "- Optimized for Android Wear 2"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tppm.watch.face.christmas&hl=en&gl=us",
    "appId": "com.tppm.watch.face.christmas"
}