{
    "title": "Social Diabetes",
    "summary": "Keep your diabetes under control and drop your HbA1c",
    "icon": "//lh4.ggpht.com/agHQaeumjjyvx-KqXa_GOzkZzvG82edUI3Uu86T9m7cbHzp3s99yhcO2Nf7_jkS44OU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 2325,
    "developer": "SocialDiabetes",
    "developerId": "SocialDiabetes",
    "developerEmail": "support@socialdiabetes.com",
    "developerWebsite": "https://www.socialdiabetes.com",
    "developerAddress": "Rosello 198\n08008 Barcelona",
    "updated": "February 26, 2018",
    "version": "4.2.7",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "description": "Tired of your paper logbook? SocialDiabetes App can help you improve your diabetes with its easy to use interface and awesome features. With SocialDiabetes you can manage your type 1 or type 2 diabetes right from your phone:  keep track of your diet, adjust your insulin dose based on what you eat and test your glucose levels afterwards. All of this information is kept at a digital logbook, that can be accessed and shared at any moment. ★ SocialDiabetes App is licensed by Abbott Diabetes Care to use the readings of  the FreeStyle Libre™ sensor. ★ SocialDiabetes is a EC healthcare device, Directive  93/42/EEC,  that complies with the most demanding security and quality requirements.★ SocialDiabetes App is licensed by Menarini Diagnostics to use the measurements from it’s GlucoCard SM and Glucomen Areo 2K glucometers. ★ SocialDiabetes has been recognized by UNESCO-WSA as the best health App and won the International Mobile Premier Award at the Mobile World Congress in Barcelona.FEATURES:-HbA1c estimation-Bolus calculator to adjust rapid insulin doses before every meal (only available in the EU)-Automatic readings of blood glucose levels when using integrated meters -Carbohydrate calculator-Food database-Charts-Digital Diary - that stores historical data including food pictures!-Exportable reports (pdf, csv)-Alerts and recommendations-Connection with your physician or nurse practitioner (premium users)-Invite your physician to manage your diabetes remotely and keep track of your evolution in real time. Your HCP can adjust your insulin and carb needs online and get automatic notifications.  -SocialDiabetes App works in multiple devices. Access your account from the comfort of your PC through our web platform.INTEGRATIONS- Compatibility with Accu-Check Aviva Connect, Freestyle Libre, Contour Next ONE, Glucocard SM, CareSens Dual, GlucoMen AREO 2k- Steps, blood pressure, weight , Apple Watch notifications, Fitbit.OUR USERS“Amazing.The best app for monitoring your diabetes. At first you have to provide some info, but then using it is extremely simple. Congrats to the developer.”“Wonderful I love this app. Easy to use. I like the fact I can keep track of my sugars with just a click. I can also send my reading to my Doc so without having an appointment we can make adjustments.”“Good thing I like this app because it's really been a great help with keeping me on track and disciplined in tracking my numbers. Makes managing my diabetes a lot less stressful.”SUPPORTFor product-related questions, issues or suggestions please contact us at support@socialdiabetes.com. Your feedback is very important so we can keep improving our product! ★ SocialDiabetes Premium: 15-day trial period. When upgrading to SocialDiabetes Premium you will not be charged until the 15 day period is up. In the event that you don’t cancel your plan during this trial period, once exhausted, the fee will be charged automatically and will not be reimbursed. Your plan will stay active for one year and is renewed automatically. Your auto-renewal and cancellation options can be managed in your Account Settings in Play Store at any time after the upgrade.★ SocialDiabetes has to be used with responsibility. In order for SocialDiabetes to be 100% effective and fit your needs as a person with diabetes, don't forget to always use it under your healthcare professional’s supervision.   www.socialdiabetes.com/enwww.facebook.com/socialdiabeteswww.twitter.com/socialdiabetes",
    "descriptionHTML": "Tired of your paper logbook? SocialDiabetes App can help you improve your diabetes with its easy to use interface and awesome features. <br><br>With SocialDiabetes you can manage your type 1 or type 2 diabetes right from your phone:  keep track of your diet, adjust your insulin dose based on what you eat and test your glucose levels afterwards. All of this information is kept at a digital logbook, that can be accessed and shared at any moment. <br><br>&#x2605; SocialDiabetes App is licensed by Abbott Diabetes Care to use the readings of  the FreeStyle Libre&#x2122; sensor. <br><br>&#x2605; SocialDiabetes is a EC healthcare device, Directive  93/42/EEC,  that complies with the most demanding security and quality requirements.<br><br>&#x2605; SocialDiabetes App is licensed by Menarini Diagnostics to use the measurements from it&#x2019;s GlucoCard SM and Glucomen Areo 2K glucometers. <br><br>&#x2605; SocialDiabetes has been recognized by UNESCO-WSA as the best health App and won the International Mobile Premier Award at the Mobile World Congress in Barcelona.<br><br>FEATURES:<br><br>-HbA1c estimation<br><br>-Bolus calculator to adjust rapid insulin doses before every meal (only available in the EU)<br><br>-Automatic readings of blood glucose levels when using integrated meters <br><br>-Carbohydrate calculator<br><br>-Food database<br><br>-Charts<br><br>-Digital Diary - that stores historical data including food pictures!<br><br>-Exportable reports (pdf, csv)<br><br>-Alerts and recommendations<br><br>-Connection with your physician or nurse practitioner (premium users)<br><br>-Invite your physician to manage your diabetes remotely and keep track of your evolution in real time. Your HCP can adjust your insulin and carb needs online and get automatic notifications.  <br><br>-SocialDiabetes App works in multiple devices. Access your account from the comfort of your PC through our web platform.<br><br>INTEGRATIONS<br><br>- Compatibility with Accu-Check Aviva Connect, Freestyle Libre, Contour Next ONE, Glucocard SM, CareSens Dual, GlucoMen AREO 2k<br><br>- Steps, blood pressure, weight , Apple Watch notifications, Fitbit.<br><br>OUR USERS<br><br>&#x201C;Amazing.The best app for monitoring your diabetes. At first you have to provide some info, but then using it is extremely simple. Congrats to the developer.&#x201D;<br><br>&#x201C;Wonderful I love this app. Easy to use. I like the fact I can keep track of my sugars with just a click. I can also send my reading to my Doc so without having an appointment we can make adjustments.&#x201D;<br><br>&#x201C;Good thing I like this app because it&apos;s really been a great help with keeping me on track and disciplined in tracking my numbers. Makes managing my diabetes a lot less stressful.&#x201D;<br><br>SUPPORT<br><br>For product-related questions, issues or suggestions please contact us at support@socialdiabetes.com. Your feedback is very important so we can keep improving our product! <br><br>&#x2605; SocialDiabetes Premium: 15-day trial period. When upgrading to SocialDiabetes Premium you will not be charged until the 15 day period is up. In the event that you don&#x2019;t cancel your plan during this trial period, once exhausted, the fee will be charged automatically and will not be reimbursed. Your plan will stay active for one year and is renewed automatically. Your auto-renewal and cancellation options can be managed in your Account Settings in Play Store at any time after the upgrade.<br><br>&#x2605; SocialDiabetes has to be used with responsibility. In order for SocialDiabetes to be 100% effective and fit your needs as a person with diabetes, don&apos;t forget to always use it under your healthcare professional&#x2019;s supervision.   <br><br>www.socialdiabetes.com/en<br>www.facebook.com/socialdiabetes<br>www.twitter.com/socialdiabetes",
    "histogram": {
        "1": 107,
        "2": 42,
        "3": 157,
        "4": 574,
        "5": 1445
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/DjeV6ow7eALP3ypqB6Uh524i9ANum3Ar2F_mkzPKABp1nmlDuntSGbhDkkeB_PULwQ=h310",
        "//lh3.googleusercontent.com/iO0s_jn6eYJ_MO-IpUlus2CbaTiQoCWgAeR0CgSQopTX6hX7hjHeRB0Bep17nhu_Wi8=h310",
        "//lh3.googleusercontent.com/0Q1UKnt4608pBi-wg6lOpzI-_t2gik81rS26QGQWgIzvMWGr5LN0dKb1N5RrLH7Hspev=h310",
        "//lh3.googleusercontent.com/31vksVTWPObD4l65I80IQf7OSkUYmOSSpqVgiRuGXrI0DiPlV4bO8kFxN2_hQy3YJm_U=h310",
        "//lh3.googleusercontent.com/PqxN_o4Uqz14b-MODe3HZmSZkbGoMXGGxEgEqUK1ftOekm-S8a5vgtW71prrvllap4QO=h310",
        "//lh3.googleusercontent.com/LzET46kaxwM9QDY4BcEvNdf3AucynSPEIHEE3_KUW9wTmk106QjoMat_OnNKz7wsgw=h310"
    ],
    "video": "https://www.youtube.com/embed/sZNPpWL3XqQ",
    "comments": [
        "It used to be the best app for diabetes logging and control. But now it crashes all the time. Even the development team gave up on fixing it. Now I am giving up on this app :(",
        "It's a logging app. Only a couple of meters which I've never seen are listed on the Connections page. The Freestyle Libre isn't although it says it is reading it, nothing shows up.  Otherwise there's a UK food database (in Spanish) of carbohydrate, and a simple calculator.   There doesnt appear to be a way of getting reports out of it. Given the Libre app does the basics better, Im not sure what the purpose of the app is. There are lots of useful things it could do to improve diabetes care; just that logging isnt one of them.",
        "Good way to talk with friends!",
        "Freestyle Libre Can't get my readings into the app :-(",
        "Can't get through setup The app ends up in an endless loop while requesting app permissions. Even though I grant access to photos, media, and files and to location, the app continues to request these permissions.",
        "Just entered a bunch of my data and noticed that there is no FASTING category and also the Nightly Testing (before bed) is not showing on the reports.  I looked at the same data online and it does not match up - Nightly Testing is showing as before Breakfast which is not true."
    ],
    "recentChanges": [
        "We work constantly to improve our application. Each new version contains bug fixes and improvements, and often new features to take advantage of all the benefits."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.socialdiabetes.android&hl=en&gl=us",
    "appId": "com.socialdiabetes.android"
}