{
    "title": "To-do tasks & reminders - midu",
    "summary": "An all-in-one personal assistant: Tasks planner, place + time reminders &amp; notes",
    "icon": "//lh3.googleusercontent.com/8PPMl_I9LG_8zNZ0P57JCITrBA3NOkQt2O8avoK64pSKejNLtWOHCm2_N4AFCxADRYs=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 447,
    "developer": "miduapp",
    "developerId": "miduapp",
    "developerEmail": "support@miduapp.com",
    "developerWebsite": "http://www.miduapp.com",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "You are busy. You are constantly running, trying not to be late, trying to make the most out of your day. midu Android app and watch face is your life changer - a top notch personal assistant that helps you run errands, complete your daily tasks, organize your to-do tasks, set reminders to yourself or to friends and family and stay ahead of your schedule. ★ Enjoy smart reminders that pop up not only at the right time but at the right place (e.g. “When am I leaving home”). Send reminders to anyone, asking them to buy something, be somewhere, or complete a task. ★ Easily navigate your day - midu is the ultimate calendar-like time management tool. Think of it as a brilliant task-manager, helping you organize tasks and to-do lists, in a ‘post paper notes’ world. ★ Supercharge your day - when it comes to busy Android users, time management apps are a productivity key. midu is an all-in-one personal assistant that works with both time and location. midu to-do lists and task manager functionalities will help you get more out of your day, schedule tasks, and ensure you never forget a thing and always ahead of time! ★ midu uses GPS signal to allow you set reminders for when you are driving or when you’ve arrived at a specific place. ★ Forget old post-it note apps, midu makes the most out of your smart Android phone and wear.  ★ Automate and optimize your tasks to boost your productivity. midu is, designed to increase efficiency. ★ One place for all your to-do tasks, personal notes, automatic reminders, and time-related alerts. Get “leave now” alerts, based on real-time traffic, via push notifications, and send reminders to friends and family via push notifications or SMS.  ★ Set reminders to call someone, be somewhere, complete a task in a certain place, shop for something, and more.  ★ Using an android wear watch? With the midu Android Wear watch face, you can also take quick actions on the go. Personalize your watch face experience with several different colors, and choose between an analog and digital display. *Midu's Android Wear watch face is compatible with Asus ZenWatch, Fossil Q, Huawei Watch, LG G Watch R, LG G Watch, LG Watch Urbane, Michael Kors Access Collection, Moto 360, Samsung Gear Live, Sony Smartwatch, and TAG.★ Daily, weekly, or monthly planner – In today’s world, calendar is just not enough. A calendar is only based on time, but your tasks are optimized based on location as well! midu task and to do manager considers both time and GPS location and by that allows you to make a lot more out of your day. NEW! Join our Midu power users community. To join go to our group page \"Midu Powerusers\" on Facebook: https://www.facebook.com/groups/729833497177455/FAQs: https://midu.zendesk.com/hc/en-us",
    "descriptionHTML": "You are busy. You are constantly running, trying not to be late, trying to make the most out of your day. <br><br>midu Android app and watch face is your life changer - a top notch personal assistant that helps you run errands, complete your daily tasks, organize your to-do tasks, set reminders to yourself or to friends and family and stay ahead of your schedule. <br><br>&#x2605; Enjoy smart reminders that pop up not only at the right time but at the right place (e.g. &#x201C;When am I leaving home&#x201D;). Send reminders to anyone, asking them to buy something, be somewhere, or complete a task. <br><br>&#x2605; Easily navigate your day - midu is the ultimate calendar-like time management tool. Think of it as a brilliant task-manager, helping you organize tasks and to-do lists, in a &#x2018;post paper notes&#x2019; world. <br><br>&#x2605; Supercharge your day - when it comes to busy Android users, time management apps are a productivity key. midu is an all-in-one personal assistant that works with both time and location. midu to-do lists and task manager functionalities will help you get more out of your day, schedule tasks, and ensure you never forget a thing and always ahead of time! <br><br>&#x2605; midu uses GPS signal to allow you set reminders for when you are driving or when you&#x2019;ve arrived at a specific place. <br><br>&#x2605; Forget old post-it note apps, midu makes the most out of your smart Android phone and wear.  <br><br>&#x2605; Automate and optimize your tasks to boost your productivity. midu is, designed to increase efficiency. <br><br>&#x2605; One place for all your to-do tasks, personal notes, automatic reminders, and time-related alerts. Get &#x201C;leave now&#x201D; alerts, based on real-time traffic, via push notifications, and send reminders to friends and family via push notifications or SMS.  <br><br>&#x2605; Set reminders to call someone, be somewhere, complete a task in a certain place, shop for something, and more. <br> <br>&#x2605; Using an android wear watch? With the midu Android Wear watch face, you can also take quick actions on the go. Personalize your watch face experience with several different colors, and choose between an analog and digital display.<br> <br>*Midu&apos;s Android Wear watch face is compatible with Asus ZenWatch, Fossil Q, Huawei Watch, LG G Watch R, LG G Watch, LG Watch Urbane, Michael Kors Access Collection, Moto 360, Samsung Gear Live, Sony Smartwatch, and TAG.<br><br>&#x2605; Daily, weekly, or monthly planner &#x2013; In today&#x2019;s world, calendar is just not enough. A calendar is only based on time, but your tasks are optimized based on location as well! midu task and to do manager considers both time and GPS location and by that allows you to make a lot more out of your day. <br><br>NEW! Join our Midu power users community. To join go to our group page &quot;Midu Powerusers&quot; on Facebook: https://www.facebook.com/groups/729833497177455/<br><br>FAQs: https://midu.zendesk.com/hc/en-us",
    "histogram": {
        "1": 19,
        "2": 15,
        "3": 28,
        "4": 97,
        "5": 288
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/vjGNP42-gZB2jmIELYhWsAtbXKldiTgss9tjVOfW5ECGWETg-ko4GKepoGV1pFXAsHk=h310",
        "//lh3.googleusercontent.com/Py8O8T05SN6baEA4Mc2mr69OhmjgpJ9SD8NfIK4Oa-boPjVwJhxOjM4vpcl32Ule9BQ=h310",
        "//lh3.googleusercontent.com/5Dsfi557GAzfxTRnjWRCdGGy53ljn2ijqiy69gkLNItoy-lm5g7chURBCpircuHXEz0=h310",
        "//lh3.googleusercontent.com/EYfzE_1EkM3TG3GS9xlH9n-pCaLDwzq_INEhv1qwwaBup52OpYYY5gKDrMgcYmxKRcc=h310",
        "//lh3.googleusercontent.com/-eNcXTOPV-IMIpgRfQj7XMQoKcDtX7oL3nbIf1UEnhsIGqQVPtBmXcz4wks8U9rPqU9u=h310",
        "//lh3.googleusercontent.com/4g8krm2lZV_jPE5-8Dhl-JZ2bUTqxN6V3Ak7YyxwiyJ2alz4QCMFBl4SQsmjKWgMIzid=h310",
        "//lh3.googleusercontent.com/p3EOdUBi5zILHe488cRvQHVT4ESMCOzxF59y4NY0W-cdm2j3TcYmMj_HJR9Tj2GDZQrV=h310",
        "//lh3.googleusercontent.com/sjSiX3tAMisY-wndgXt3Ak52ZKuAGqR1j-N0OMppQMlu0gxItJMVopwQ0UmKgQDCHv8=h310",
        "//lh3.googleusercontent.com/yg0ObgrGpLX74afBjr0TN8bZAXPJzq9kxlGwjh3VnD-0pDj8C-mLmAspAmtDlM-lprE=h310",
        "//lh3.googleusercontent.com/p62pOE1342nXP38oWxz-cPjcUuwynKO3UouW5J4QlNXlPSB6otBCQkqrsUvWRSF2c58=h310",
        "//lh3.googleusercontent.com/8FCdUQek0_ZP-lEB9wKKQn7tZfUGqHzGUF19l-QgtFsO0X0Nz_URr0RmntxLJ_jqwW5d=h310",
        "//lh3.googleusercontent.com/EZN7Oc_Fc2xf3t3dJ30z0BuVY10YjmLXArvqwGdj49fAY3WHJsb3qp-zA8yyN1JUle8=h310",
        "//lh3.googleusercontent.com/9UEtd7ZvM9ur6QV2bR-y2y0lmEszjEoCXcjHbt00S_voGrWmo9ZHXmTpHDUwabH5WV0=h310",
        "//lh3.googleusercontent.com/BTmzqBGsJihLIn_jRqBM097b_5HnsKZj1Hc6CgYmHeeOOYW1xOsuI1Va5EAkLRBmiJk=h310"
    ],
    "comments": [
        "I love it. The only thing I would like is to change a map event, or maybe I don't know how. But it totally deserves 5 ★",
        "It boogies my mind that I can't schedule a task for a specific time. However, the location and calendar integration is great if you need to be many different places in a day. Just got a suggestion to add a task based on an sms message, which was a little creepy but spot on and useful.",
        "I love the app it is just missing galaxy s2/3 reminders",
        "I like it",
        "Cool app I do really like it only problem I had is I mainly got it to use on my watch but when I look to download it on my watch nothing comes up like it doesn't have it and that kind of irritated me since I got it for that reason.",
        "This is the best new app I've tried in years.  I especially love the remind me when I'm in the car feature.  Love it!"
    ],
    "recentChanges": [
        "Tried out the new “when I wake up” reminder? Now you can also set it for waking up on a specific day and also as a recurring reminder.",
        "We’ve also added more improvements and bug fixes based on your feedback.",
        "Have any more feedback & suggestions? Just hit the “feedback” button.",
        "Don’t forget to join the midu powerusers Facebook group to learn about new features and special midu tips."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.intel.wearable.tlc&hl=en&gl=us",
    "appId": "com.intel.wearable.tlc"
}