{
    "title": "Neo Watch Face",
    "summary": "Personalize your Android watch with the most beautiful watch face",
    "icon": "//lh3.googleusercontent.com/KpNm6NORBIV_ZG5nVJOpZJnGxrIuS_CaXiQvI5tWg9KEs_-fhUWRtc_LvqgGPfcwtUw=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 10,
    "maxInstalls": 50,
    "score": 3.7,
    "reviews": 3,
    "developer": "Digital Prodigee",
    "developerId": "Digital+Prodigee",
    "developerEmail": "DigitalProdigee@gmail.com",
    "developerAddress": "2020 Millerton Ave Charlotte NC 28208",
    "updated": "June 1, 2016",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Personalize your Android Watch Wear with the most beautiful and cool watch face – Neo. Neo Watch Face is a unique watch face styled as a mechanical analog watch. This is the best way to improve the look of your Android Watch. This app works with all watches running \"Android Wear\" and suits watches with both round and square screens.Compatible Android Wear Watches Include -Moto360, Moto 360 2nd gen (42mm, 46mm), LG G Watch R (lgwr), LG G Watch W100 (lgwg), LG G Watch, LG Watch Urbane (lgwu), Samsung Gear Live, Sony Smartwatch 3 (sw3), Asus ZenWatch, Asus ZenWatch 2, Huawei Watch, Tag Hauer Connected.It is a part of DigitalProdigee cogs watch faces lineup. It has separate dials for hours and minutes and is filled with small details. Also it has a cool animation — everything is spinning and moving. The best way to personalize your android wear and make it look cool. This analog watch face is suitable for those who use both 12 and 24 hour mode.Pay attentionSometimes there may be a delay with getting the watch face on the watch from your phone, it is recommended to have a bit of patience if you are not in an urgent need of your watch. This is not caused by the watch face, but rather Android Wear app.If the Application doesn't appear:- Uninstall the face- Restart phone- Restart watch- Connect watch and phone- Install the watch faceSo, are you ready to make your android wear look cool, get started by downloading this watch face right now.In case of any problems, do write to us on digitalProdigee@gmail.com and we will help you to solve the issue. If you have any suggestions to make the face better, do write to us. If you have liked the watch face, do rate us 5 stars and share this with your friends.",
    "descriptionHTML": "Personalize your Android Watch Wear with the most beautiful and cool watch face &#x2013; Neo. <b>Neo Watch Face</b> is a unique watch face styled as a mechanical analog watch. This is the best way to improve the look of your Android Watch. This app works with all watches running &quot;Android Wear&quot; and suits watches with both round and square screens.<br><br><b>Compatible Android Wear Watches Include -</b><br>Moto360, Moto 360 2nd gen (42mm, 46mm), LG G Watch R (lgwr), LG G Watch W100 (lgwg), LG G Watch, LG Watch Urbane (lgwu), Samsung Gear Live, Sony Smartwatch 3 (sw3), Asus ZenWatch, Asus ZenWatch 2, Huawei Watch, Tag Hauer Connected.<br><br>It is a part of DigitalProdigee cogs watch faces lineup. It has separate dials for hours and minutes and is filled with small details. Also it has a cool animation &#x2014; everything is spinning and moving. The best way to personalize your android wear and make it look cool. This analog watch face is suitable for those who use both 12 and 24 hour mode.<br><br><b>Pay attention</b><br>Sometimes there may be a delay with getting the watch face on the watch from your phone, it is recommended to have a bit of patience if you are not in an urgent need of your watch. This is not caused by the watch face, but rather Android Wear app.<br><br><b>If the Application doesn&apos;t appear:</b><br>- Uninstall the face<br>- Restart phone<br>- Restart watch<br>- Connect watch and phone<br>- Install the watch face<br><br>So, are you ready to make your android wear look cool, get started by downloading this watch face right now.<br><br>In case of any problems, do write to us on digitalProdigee@gmail.com and we will help you to solve the issue. If you have any suggestions to make the face better, do write to us. If you have liked the watch face, do rate us 5 stars and share this with your friends.",
    "histogram": {
        "1": 1,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 2
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/RDYdcmZ8FPuU7sAcEiTdijMSPSk0MPrRsCziuT5Bc5e0Mx8w51WPWfZXiW2dsVuR4Jib=h310",
        "//lh3.googleusercontent.com/wmSPfs0JF9dczY1bZHltoOZDcWTw6Eg56cXLxezshVS-9bOpZGPmxmvNMkXPGlHrytw=h310",
        "//lh3.googleusercontent.com/4S-BzVaKZuk9ZmIWjpA2rNZELqf7atzUly5oS1Kh9jvbaZJx5fyfKZqAPXpD3wrP=h310",
        "//lh3.googleusercontent.com/YrSdRW1f4xq6CcyVUjShVupU1XUapojBbZvKlebIjSxCeMTDHzGEoPi2PNCzwFlT2g=h310"
    ],
    "comments": [
        "Won't Show Up Have purchased, refunded, re-purchased, uninstalled, and re-installed twice and still won't show up in my Wear App or on my watch. Have numerous other faces that have shown just fine within seconds after attempting this one. Please Fix!!!",
        "Love it Can't wait to see more designs.",
        "Hot! I really like this look!"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.digitalprodigee.neo&hl=en&gl=us",
    "appId": "com.digitalprodigee.neo"
}