{
    "title": "chomp SMS",
    "summary": "Want a souped-up ultra-customizable replacement for the dull stock SMS app?",
    "icon": "//lh4.ggpht.com/G1jalUvzKDBMEwP2iYSjWZKVwwN0WHJpFyzh9DOo-Jlnwclqft37T88w4DRMjpLD3ls=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.3,
    "reviews": 334004,
    "developer": "Delicious",
    "developerId": "Delicious",
    "developerEmail": "help@chompsms.com",
    "developerWebsite": "http://chompsms.com",
    "developerAddress": "Suite 40, Upper Deck\nJones Bay Wharf\n26-32 Pirrama Road\nPyrmont NSW 2009\nAustralia",
    "updated": "November 26, 2017",
    "version": "7.18",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Join the chomp revolution now at 10+ million strong!Create your own unique look, or choose from 100's of FREE themes / skins. Lots of cool features like passcode app lock, privacy options, scheduled SMS sender (reminders, birthday wishes), stop a text while sending, pin favs to top, backup, blacklisting / SMS blocker, signatures, text snippets, quick reply popup (even on lock screen), multi-select picture gallery, dual sim, better MMS and GROUP messaging and much more....Plus unlimited customisation options for notification icons, LED colors, ringtones, vibrate patterns, screen colors, font types, font sizes and background wallpapers. Go on give it some bling! Plus the latest 1600+ Android, Twitter, Emoji One & iOS style emojis including diversity (skin tone). Just pick your preferred emoji style, easy!Give chomp SMS a try today! It's pretty special.Compatible with Yappy, Pushbullet and MightyText for desktop notifications and replying.",
    "descriptionHTML": "Join the chomp revolution now at <b>10+ million strong!</b><br><br>Create your own unique look, or choose from 100&apos;s of FREE themes / skins. <br><br>Lots of cool features like passcode app lock, privacy options, scheduled SMS sender (reminders, birthday wishes), stop a text while sending, pin favs to top, backup, blacklisting / SMS blocker, signatures, text snippets, quick reply popup (even on lock screen), multi-select picture gallery, dual sim, better MMS and GROUP messaging and much more....<br><br>Plus unlimited customisation options for notification icons, LED colors, ringtones, vibrate patterns, screen colors, font types, font sizes and background wallpapers. Go on give it some bling! <br><br>Plus the latest <b>1600+ Android, Twitter, Emoji One &amp; iOS style emojis</b> including diversity (skin tone). Just pick your preferred emoji style, easy!<br><br>Give chomp SMS a try today! It&apos;s pretty special.<br><br>Compatible with <b>Yappy</b>, <b>Pushbullet</b> and <b>MightyText</b> for desktop notifications and replying.",
    "histogram": {
        "1": 15517,
        "2": 10388,
        "3": 26505,
        "4": 74178,
        "5": 207416
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/dpQA-NsADxFl7pxdcgJc1bjS80noFVmVJOauS2l5fDOJckEJv64CA7VJwzLmPKnbppc=h310",
        "//lh3.googleusercontent.com/WXqv5W3S_nECcTCTq2p7oaIiUxR2S9fR5WT0BOq_HpOznQSGMoW_MfrRR96C_KCssw=h310",
        "//lh3.googleusercontent.com/GoS_Di4YiKOY4epwTT4-JLxiT2VQqu0QA06zDM7RlH_Dkj971bOxHQHfIz8BizmdISM=h310",
        "//lh3.googleusercontent.com/e8Xvcw2SXuQKIaEkuzaQQlrBWwV_WzJiOMDnR-2zrMLKKWAKpqetEoquQ3mSQ1R7DA=h310",
        "//lh3.googleusercontent.com/hvEVblhFQ8-40WbWmDsYtE--27So3LtnCjtjeP79TrPV6kOmRQyYSSv5OUld6K_sT8hi=h310",
        "//lh3.googleusercontent.com/oyrDYcT0YY_CS14FZqSQj711PkvE07XTIJgXMSpf1ZBUmsgnpHOozCjNmAkELlDDSA=h310",
        "//lh3.googleusercontent.com/A8BYpG5_C-8SUgoBtkHd7Xx57EmZkh6nlsSDqjcqpjXKSmrP6zGjysi2G95JUbOBAJFX=h310"
    ],
    "comments": [
        "better than textra IMO though wish they had minor cosmetic details. for example screen animations, emoji animation support (like mood and messenger) and the read/receive checks to be smaller. overall pretty by good.  edit: actually just noticed group messaging option to \"mute\" is NOT AVAILABLE. feel this is quite an oversight and might make me switch back soon",
        "Love Chomp!! Been using it a very long time now, on several devices. It is the only decent texting app out there! So feature-filled, and devs really design it according to actual user realities, no grandstanding, just honest excellent development. Many thanks, you are truly the greatest text app of all time!",
        "Chomp is hands down the best texting app I've used. Highly customizable and no annoying habits like the others. I really like not having to show the avatars (contact pictures).   If you don't like the ads buy the pro version. It's the last texting app you'll ever buy.   Chomp gives you a clean functioning interface. ðŸ‘  It's dark mode is awesome!  If I had to nic-pic to find something I don't like,  it would be it's full immersive mode behavior. It's not as seamless as other apps.",
        "I tried many messenger apps, and this one the easy to use and custumize. As I really am only using it as SMS app I haven't searched if it has any other features like video calling/group video calling, group messaging (saw MMS but haven't used it yet),  or other features some other messenger apps have. So if you want a easy to use messenger app that focus on texting and allows you to custumize with easy with all the gimmicks this the app for you. Even the ads unlike some apps don't get in the way.",
        "I have used a dozen SMS apps. And found this is best app... for dual sim mobiles as well as single one.  It contains a lot of other options one can wish for.... best thing is that it is perfect ....no bugs... no issues.... Even adds are in a very sober style and don't irritate at all. I have changed many cell phones and after using built-in SMS app I have to switch to this app. Because it is very handy and no bugs at all.",
        "Fabulous Cell Text App. There are many options and choices which I love. Thought it was all pretty self explanatory as I went through the settings. The only thing that stumped me was the new message counter (or badge) not being a choice in settings for the home screen icon. Went to FAQ and found my solution....put the Chomp Widget on home screen. It will show the new message count. Love Chomp, works great!"
    ],
    "recentChanges": [
        "âœ” Added support for animated GIFs. Including when selected from the Google Keyboard (Gboard).",
        "âœ” Added support for 2700+ (all) of the very latest (Unicode 10) Android (Blob and Oreo), iOS, Emoji One and Twitter emojis.",
        "âœ” Added support for in-app notification ringtones. See Settings > Notifications > In App Ringtone.",
        "âœ” Improved icon badging support for Sony phones.",
        "âœ” Bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.p1.chompsms&hl=en&gl=us",
    "appId": "com.p1.chompsms"
}