{
    "title": "Watch Face Commando 54 combo",
    "summary": "The Scoon Commando. Get the ultimate tough look!For Android Wear",
    "icon": "//lh5.ggpht.com/QDMYVos7wQSXKrAosXC59DmKADD5_lF4f7m4uUHqJX0YoHBLKKJ17TwqNoyXAPYaQQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4,
    "reviews": 85,
    "developer": "Scoon Design",
    "developerId": "Scoon+Design",
    "developerEmail": "scoondesign@gmail.com",
    "developerWebsite": "http://www.scoondesign.com",
    "developerAddress": "Dr. Plesmanlaan 156-160, 3601DE, Maarssen",
    "updated": "January 29, 2015",
    "version": "1.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "The Scoon Commando is the ultimate tough watch face for Moto 360, LG Watch Round and other Google Wear smart watches. A square version is included. Hundreds of hours have been spent tuning Scoon Commando. With the menu in the Google Wear app you can make all kind of combinations. Carbon, Steel or Stars and Stripes. You can set the rotation speeds and combine metal colors. Please rate us positive if you like our work! Get some of our premium watches to support us.Why the TourbiBling is the most awesome smart watch face:★ The face is tested in real live and gives that commando look★ It has animations to give nice effects★ It has the ultimate tough factor★ You can make 54 combinations. You are getting a lot of watches in this app.★ Premium metals have been used to create the best apearance★ Many hours are invested in this design.★ Future improvements and updates will follow...How to change/ build your ultimate Commando watch:- buy and download our app and wait till the watch face shows up in your watch- select the Commando watch face by long clicking your watch face and then swiping to the left to see it. Or set it in the Android Wear app on your phone- when activated on your watch go to the settings of Scoon Commando in the Android Wear app of your phone- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone- if our watch face doesn't show up in your watch please try to restart your watch. It can take some time to load this complex watch- pull your sleeve up so everybody asks what awesome watch you have on your wristSupport us and follow us on http://www.facebook.com/scoonwearhttp://plus.google.com/+scoondesignhttp://www.scoonwear.comMore complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "descriptionHTML": "The Scoon Commando is the ultimate tough watch face for Moto 360, LG Watch Round and other Google Wear smart watches. A square version is included. Hundreds of hours have been spent tuning Scoon Commando. With the <b>menu in the Google Wear app</b> you can make all kind of combinations. Carbon, Steel or Stars and Stripes. You can set the rotation speeds and combine metal colors. <br><br>Please rate us positive if you like our work! Get some of our premium watches to support us.<br><br><b>Why the TourbiBling is the most awesome smart watch face:</b><br>&#x2605; The face is tested in real live and gives that commando look<br>&#x2605; It has animations to give nice effects<br>&#x2605; It has the ultimate tough factor<br>&#x2605; You can make 54 combinations. You are getting a lot of watches in this app.<br>&#x2605; Premium metals have been used to create the best apearance<br>&#x2605; Many hours are invested in this design.<br>&#x2605; Future improvements and updates will follow...<br><br>How to change/ build your ultimate Commando watch:<br>- buy and download our app and wait till the watch face shows up in your watch<br>- select the Commando watch face by long clicking your watch face and then swiping to the left to see it. Or set it in the Android Wear app on your phone<br>- when activated on your watch go to the settings of Scoon Commando in the Android Wear app of your phone<br>- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone<br>- if our watch face doesn&apos;t show up in your watch please try to restart your watch. It can take some time to load this complex watch<br>- pull your sleeve up so everybody asks what awesome watch you have on your wrist<br><br>Support us and follow us on <br>http://www.facebook.com/scoonwear<br>http://plus.google.com/+scoondesign<br>http://www.scoonwear.com<br><br>More complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "histogram": {
        "1": 8,
        "2": 5,
        "3": 11,
        "4": 17,
        "5": 44
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/F2mlX-DA-M90ngjbwCkV4wqhVwJ3ZEVt-adsUMlDJarUyGt6cPsXaVS4fCHBQvDhTIk=h310",
        "//lh3.ggpht.com/q5dcs5_QnfJmUjBqvewwUNYnpzh6qlFaoC8iYTqNcc6soQQf7nZZBUeupOkrttcTCLs=h310",
        "//lh4.ggpht.com/LZ9Y6ZglTOmHD2wz6YDRF-YQHvK35_wkKhcYaeYOrbRuXGxA7oVF4JsO5IUrr0SGrHs=h310",
        "//lh4.ggpht.com/3fsUbF5O9Q7fZX-AIx8Uq2eEdZyfV9qTNzehz0_p_YkY2QqZyGurn4qB6norDBD5mQ=h310",
        "//lh4.ggpht.com/pGsQjumsgXsVUY0LAGIAvrSM9omYdU-r5gdWBb0SnbyOUr91kBQxAfdfHVfNq_-E24I=h310",
        "//lh3.ggpht.com/nWDb6fOpx_6YN2w8WqXBct9PteD45ILADzE_sTr3qlthRBaZ_WI5Z0vfFMYG5w6W9EHa=h310",
        "//lh4.ggpht.com/CZVEd7xiHulwwNm_fgK4UItCa2UXfSWOgDVW26XWBzlJez3ydKF2nq9pqO5yhEUBDEI=h310"
    ],
    "comments": [
        "Not bad Nice design, nice customization. Just hate that the watch arms hide half the skull. Would also be nice to be able to change the back ground to other solid colors. Black background with the rest set to steel would look better than carbon.",
        "I really like the customizable face.  It makes my LG G Watch R really pop. One small critique, is that the face is just slightly off center.  It needs pushed to the left just a bit.",
        "Please fix this problem does not fit on my moto 360 2nd gen",
        "Plus Minus symbols with sword handle in it What is it telling you when the sword handle is in between the plus in minus symbols? Excellent watch face by the way!.",
        "Love it I would love to see integration of camouflage",
        "Beautiful design"
    ],
    "recentChanges": [
        "v1.2",
        "-Reduced apk size",
        "- Added option to increase watch screen timeout. On your phone, go to",
        "> Android Wear",
        ">select Scoon Commando as the active watch face",
        ">click on gear (for Commando settings)",
        ">scroll right to settings page",
        ">scroll to the bottom of the settings and select your desired watch screen timeout setting",
        "v1.1-Initial Release"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.scoonwear.commando&hl=en&gl=us",
    "appId": "com.scoonwear.commando"
}