{
    "title": "Gold Alloy Analog Watch Face",
    "summary": "Gold, Steel, or Chrome watch faces for a metallic look on Android Wear",
    "icon": "//lh3.googleusercontent.com/WR42uyvWMor0HDWn07m4UXNq8jLH1gmA-EzpcBCHM_4-9iHYYUTYCRn52VJDoQRDVQ3x=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 4.2,
    "reviews": 4,
    "developer": "CritterMap Software LLC",
    "developerId": "CritterMap+Software+LLC",
    "developerEmail": "support@crittermap.zendesk.com",
    "developerWebsite": "http://www.backcountrynavigator.com/",
    "developerAddress": "Camas WA 98607",
    "updated": "August 14, 2015",
    "version": "1.4",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "You don't need to buy the expensive Apple Watch to get a Gold watch. This app has the bonus of three metallic watch faces with one install: Gold, Steel, and Chronium.Watch face features:•Time in both analog and Digital Formats•Date•Watch battery power•Phone battery powerDesign is for Round and Square ScreensIncludes Ambient Mode for power saving. Get this precious metal watch today for a glitter on your wrist!In the spirit of an Apple presentation, it is good to say a few words about metals and try to make it sound exciting.  GoldGold is a bright, slightly reddish yellow, dense, soft, malleable and ductile metal. Gold occurs as nuggets or grains, in rocks, in veins and in alluvial deposits. It occurs in a solid solution series with the native element silver (as electrum) and also naturally alloyed with copper and palladium. Most of the gold present in the early Earth probably sank into the planetary core. Most of the gold that is present today in the Earth's crust is thought to come from asteroid impacts Gold has been a valuable and highly sought-after precious metal for coinage, jewelry, and other arts since long before the beginning of recorded history. SteelSteels are alloys of iron and carbon, widely used in construction and other applications because of their high tensile strengths and low costs. Carbon, other elements, and inclusions within iron act as hardening agents that prevent the movement of dislocations that otherwise occur in the crystal lattices of iron atoms. The carbon in typical steel alloys may contribute up to 2.1% of its weight. Chrome Chrome is the name given to alloys of the element chronium. It is a steely-gray, lustrous, hard and brittle metal which takes a high polish, resists tarnishing, and has a high melting point.(Credit to wikipedia for information on metals). Get this Gold Watch today and let your wrist shine!",
    "descriptionHTML": "You don&apos;t need to buy the expensive Apple Watch to get a Gold watch. This app has the bonus of three metallic watch faces with one install: Gold, Steel, and Chronium.<br><br><b>Watch face features:</b><br>&#x2022;Time in both analog and Digital Formats<br>&#x2022;Date<br>&#x2022;Watch battery power<br>&#x2022;Phone battery power<br><br>Design is for Round and Square Screens<br>Includes Ambient Mode for power saving. <br><br>Get this precious metal watch today for a glitter on your wrist!<br><br>In the spirit of an Apple presentation, it is good to say a few words about metals and try to make it sound exciting.  <br><br><b>Gold</b><br>Gold is a bright, slightly reddish yellow, dense, soft, malleable and ductile metal. Gold occurs as nuggets or grains, in rocks, in veins and in alluvial deposits. It occurs in a solid solution series with the native element silver (as electrum) and also naturally alloyed with copper and palladium. <br><br>Most of the gold present in the early Earth probably sank into the planetary core. Most of the gold that is present today in the Earth&apos;s crust is thought to come from asteroid impacts <br><br>Gold has been a valuable and highly sought-after precious metal for coinage, jewelry, and other arts since long before the beginning of recorded history. <br><br><b>Steel</b><br>Steels are alloys of iron and carbon, widely used in construction and other applications because of their high tensile strengths and low costs. Carbon, other elements, and inclusions within iron act as hardening agents that prevent the movement of dislocations that otherwise occur in the crystal lattices of iron atoms. The carbon in typical steel alloys may contribute up to 2.1% of its weight. <br><br><b>Chrome</b> <br>Chrome is the name given to alloys of the element chronium. It is a steely-gray, lustrous, hard and brittle metal which takes a high polish, resists tarnishing, and has a high melting point.<br><br>(Credit to wikipedia for information on metals). <br><br>Get this Gold Watch today and let your wrist shine!",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 1,
        "4": 1,
        "5": 2
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/a6zJgu526Xbkk6Re5PBbGr1vxK8kJLVN0LjF8CgL4-yGcQgTqKY-FdYHXjdNaS1cjgA=h310",
        "//lh3.googleusercontent.com/Ktbs6p6sw8wYn8i_t9Iorx2_ax8w3Do55uU0lIPtGAbkjbEgZhkybDAfU3hSOBRQcA=h310",
        "//lh3.googleusercontent.com/KnWP5eJEGJ98Hl5hFSjA45jxz8pL5MyBI_s4fErWnpRzXQBb_HNnmzkAVfJ7MOj1AWMn=h310",
        "//lh3.googleusercontent.com/PEoksq8SXUDh_uT4jv39czkysXyDKLrSv6eTkOXwmmXkGwXZ_pBGBiNEs2tycbYcs6M=h310",
        "//lh3.googleusercontent.com/9-B0sHf6AsHPDrfcxK0mVOdyP7ORjS-DnkSrC6VCdielg3c2Ul4EeKbIThxtewedCGk=h310",
        "//lh3.googleusercontent.com/ipdX7ds5E-sRgErUOPCmYSYONNw5ZL_Dv2_D3j8KFuUdX-Vhkepv2tUK2sM6YGTPJNQ=h310",
        "//lh3.googleusercontent.com/PdjZ2SgsVOcHlnzSfLAC9N0iMv1o7FePqkZLWwcC8z5U8j_bCK35YHKI-HDtyLRZpwc=h310",
        "//lh3.googleusercontent.com/EgRoS9qFuy4BSnfY0siw5LCQOLMGFxFSVRWNUzZfFueaB8fSshmjYNfY5g5q9Wqr3A=h310",
        "//lh3.googleusercontent.com/vEIQk-srcbc3mrzTnXkmcFvqGqfaUkYxXSBfrecA_tq1W9-dagzG5rxDjhN2aPTiK3Ql=h310"
    ],
    "comments": [
        "Great Design complimenting your wrist for any occasion At first didn't know how to change through all 3 watch faces but the developer responded promptly and you access them in the android wear app not directly on the watch. Would be nice if the graphics of the watch face were more \"HD\" as some others I've purchased. I love it and maybe updates will help in future. Ambient mode is very nicely done!"
    ],
    "recentChanges": [
        "New density values for Android Wear 5.1.1",
        "24 hr mode - auto or manual."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.crittermap.watchface.dualface&hl=en&gl=us",
    "appId": "com.crittermap.watchface.dualface"
}