{
    "title": "Agenda12h Watch Face",
    "summary": "Analog watch face with calendar events, sun events and phase of the moon.",
    "icon": "//lh3.googleusercontent.com/y6hv6OHpJut5XWHsHIagtEiJHwEGkH7bv9z34TRF_B6ebzL_vsl4-uLpAOYtYZY77A=w300",
    "price": "$2.49",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 3.9,
    "reviews": 14,
    "developer": "Tobotec AB",
    "developerId": "Tobotec+AB",
    "developerEmail": "tobotecdev@gmail.com",
    "developerWebsite": "http://www.tobotec.com",
    "developerAddress": "Astrakanvägen 3\n13932 Värmdö\nSverige",
    "updated": "February 5, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "The appearance of this watch face is controlled by your calendar events, the sun and the current phase of the moon. This means that it changes everyday. Description• Why not use the possibility to change the watch face itself now that it's possible?• This watch face is very much alive, to start with the hour markers change depending on time. The current phase of the moon is also shown and is automatically calculated with regards if your position is on the northern or the southern hemisphere.• Add full display of your calendar events the next 12 hours and sunrise/sunset as well as blue hour and golden hour. All calendars you can see in the Android Wear app can be synchronized to Agenda12h.• Photographers will appreciate the sun events which helps them to be prepared for the legendary blue hour and golden hour shots.• Note that sun events and current moon phase are calculated entirely from within the watch face. No data is read from external providers, it only needs current time and GPS-position to show these data.• In summary, Agenda12h is a watch face focused on time, your calendar, our sun and our nearest planet the moon!Instruction• If your watch runs Android Wear 2.0 and you bought Agenda12h on your phone you have to download it manually on the watch. Just open the Google Play Store and it should be listed as a downloadable app if you scroll down to the list at the end. • Android Wear 1.x: If Agenda12h doesn't appear after purchase you need to synchronize apps to the watch: Android Wear app -->Settings-->Watch-->Synchronize apps• After installation be sure to tap on watch face to grant calendar permission and coarse location permission. • Control which calendars to show on the watch with the app Android Wear. Point at the cog wheel and then on Calendar settings. Make sure Syncronize calendars is activated and that the calendars you are interested in are selected.• Tap on the side of the watch face to open todays agenda, the selected event is shown. Tap even more and you will se notes and location too.Features• Hour markers change in order to reflect the next 12 hours• Current time is shown in digital form positioned at the current hour marker• The current moon phase is shown as background image• Todays date is shown in big font in the background• Automatic 12/24 hour mode• All calendar events that are active the next 12 hours are shown as segments/arcs with event title texts• Full day events are shown thinner and with smaller font • Multiple events at the same time is handled• Current event is highlighted• It calculates sunrise, sunset, blue hour and golden hour based on your current location. • When a sun event is active the center dot and the seconds hand change color to the currrent sun event• Circular and square watch faces are supported, circular watch faces with chin too (Moto 360 for instance)• The watch face shrinks in case a notification is shown so the time is never obscured (Android wear 1.x)• In ambient mode no calendar events are shown, this is to preserve battery• Options are reached by a long tap on the watch face and then tap the cog. If you are running Android 1.x the settings are also available from the Android Wear app on the companion device.If you experience an error please submit a bug report, this makes it much easier for me to find what's wrong.Instructions to capture Android Wear bug report from Android Wear:-1. Settings -> System -> About -> Tap on Build Number for 7 times2. Settings -> Developer Options -> Enable \"Bug report in menu\"3. Go to Apps menu -> Click on \"Take Bug report\"4. Send to tobotecdev@gmail.comHomepage: http://www.agenda12h.comRatings and reviews are important so please don't forget to do that!",
    "descriptionHTML": "The appearance of this watch face is controlled by your calendar events, the sun and the current phase of the moon. This means that it changes everyday. <br><br><b>Description</b><br>&#x2022; Why not use the possibility to change the watch face itself now that it&apos;s possible?<br><br>&#x2022; This watch face is very much alive, to start with the hour markers change depending on time. The current phase of the moon is also shown and is automatically calculated with regards if your position is on the northern or the southern hemisphere.<br><br>&#x2022; Add full display of your calendar events the next 12 hours and sunrise/sunset as well as blue hour and golden hour. All calendars you can see in the Android Wear app can be synchronized to Agenda12h.<br><br>&#x2022; Photographers will appreciate the sun events which helps them to be prepared for the legendary blue hour and golden hour shots.<br><br>&#x2022; Note that sun events and current moon phase are calculated entirely from within the watch face. No data is read from external providers, it only needs current time and GPS-position to show these data.<br><br>&#x2022; In summary, Agenda12h is a watch face focused on time, your calendar, our sun and our nearest planet the moon!<br><br><b>Instruction</b><br>&#x2022; If your watch runs Android Wear 2.0 and you bought Agenda12h on your phone you have to download it manually on the watch. Just open the Google Play Store and it should be listed as a downloadable app if you scroll down to the list at the end. <br><br>&#x2022; Android Wear 1.x: If Agenda12h doesn&apos;t appear after purchase you need to synchronize apps to the watch: Android Wear app --&gt;Settings--&gt;Watch--&gt;Synchronize apps<br><br>&#x2022; After installation be sure to tap on watch face to grant calendar permission and coarse location permission. <br><br>&#x2022; Control which calendars to show on the watch with the app Android Wear. Point at the cog wheel and then on Calendar settings. Make sure <i>Syncronize calendars</i> is activated and that the calendars you are interested in are selected.<br><br>&#x2022; Tap on the side of the watch face to open todays agenda, the selected event is shown. Tap even more and you will se notes and location too.<br><br><b>Features</b><br>&#x2022; Hour markers change in order to reflect the next 12 hours<br><br>&#x2022; Current time is shown in digital form positioned at the current hour marker<br><br>&#x2022; The current moon phase is shown as background image<br><br>&#x2022; Todays date is shown in big font in the background<br><br>&#x2022; Automatic 12/24 hour mode<br><br>&#x2022; All calendar events that are active the next 12 hours are shown as segments/arcs with event title texts<br><br>&#x2022; Full day events are shown thinner and with smaller font <br><br>&#x2022; Multiple events at the same time is handled<br><br>&#x2022; Current event is highlighted<br><br>&#x2022; It calculates sunrise, sunset, blue hour and golden hour based on your current location. <br><br>&#x2022; When a sun event is active the center dot and the seconds hand change color to the currrent sun event<br><br>&#x2022; Circular and square watch faces are supported, circular watch faces with chin too (Moto 360 for instance)<br><br>&#x2022; The watch face shrinks in case a notification is shown so the time is never obscured (Android wear 1.x)<br><br>&#x2022; In ambient mode no calendar events are shown, this is to preserve battery<br><br>&#x2022; Options are reached by a long tap on the watch face and then tap the cog. If you are running Android 1.x the settings are also available from the Android Wear app on the companion device.<br><br><i>If you experience an error please submit a bug report, this makes it much easier for me to find what&apos;s wrong.<br>Instructions to capture Android Wear bug report from Android Wear:-<br>1. Settings -&gt; System -&gt; About -&gt; Tap on Build Number for 7 times<br>2. Settings -&gt; Developer Options -&gt; Enable &quot;Bug report in menu&quot;<br>3. Go to Apps menu -&gt; Click on &quot;Take Bug report&quot;<br>4. Send to tobotecdev@gmail.com</i><br><br>Homepage: http://www.agenda12h.com<br><br><i><b>Ratings and reviews are important so please don&apos;t forget to do that!</b></i>",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 2,
        "4": 5,
        "5": 5
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Gs-D1nEca0-A6aAwcrONz-B86JkjD5yNrli6_K7UqevSPfZlGHQu9iSkqSHsn9SThg=h310",
        "//lh3.googleusercontent.com/AkVqOuh5pt3l2_jqXrxMIckl2XuguNQPat-xibz_YFyf9N-ooBw9m4jmEL2s_UnEK84=h310",
        "//lh3.googleusercontent.com/w8O1P9Yvz8r13LrIScG516Y9-qCpiO8L986VFvQJUVmkqI9CCCEj5GDGz0goZZRdGJr9=h310",
        "//lh3.googleusercontent.com/pKrwGPhtPiv5Or4sw4k3cXR7-RW5hF5GeD5LgwvdfK9fKSbAoP4dBiu7y5bm1ccUCus0=h310",
        "//lh3.googleusercontent.com/cb91lBb0du8ol9RsmFe62AbLnbPxBzBi79APXM-2TpgYS5-nyY2jOrHJ69Ipj9FMxJk_=h310",
        "//lh3.googleusercontent.com/Fo1TXSmsFnBZ4_N0sIFOO04suJ43hhaYbp9vpnyr818WZqtkT85UZhakPjJtCrU4D-jL=h310",
        "//lh3.googleusercontent.com/KoYq1yKIc-C0s_VRrCFNeeBE1IdeDWQgRgidTKg9I2ji2nV0cMlVqDoI7uQAYgpiOQ=h310",
        "//lh3.googleusercontent.com/GL8DK6g8MEfqh2PC_IcrBjN7EYVFFOLn87XEHGmIkGG97empstcskmdA2efxOAJvCwk=h310"
    ],
    "comments": [
        "I have been using if for few days and this is just the perfect face to go through you working day. The creator also added calendar view on ambient more few days after I suggested it which is nice and terribly practical to quickly see how your day look like. I use it with my business calendar synched to my phone from Outlook. By default event color was red but I used the app 'calendar color' to change it to a less stressful color.",
        "Pretty darn good! If options to   tweak a few more things were there, it'd be perfect. I still use it for my daily watchface though.",
        "Great concept. Would like ambient mode to be all digital no analog.",
        "Does exactly what says it does.  A few suggestions to make it even better:  Maybe make it free and then add in a pro paid version where people have more options. People are much more likely to buy an upgrade when they can try it for free first.  Would be nice to have an app on the phone and to be able to change some things like font size, colors, etc. Especially if you could change where it shows the date because in practice it's not easy to see at a glance.  Since it grabs your location anyway, maybe change then background to show the weather? Like clouds over the sun or whatever. Doesn't need to move or be interactive or anything complicated like that.  Would be amazing and perfect if you could put what I think are called \"complications\" where you an add in weather or sync with Google fit for your step count.",
        "Calendar events are not showing correctly, but they are in other watch faces. Other than that, looks very good but ambient could use a bit more agenda information and a digital clock too. Also, in general, option to hide minute and hour markers and some countdowns until next event and remaining for current event."
    ],
    "recentChanges": [
        "Fix:",
        "- Revamped settings on both watch and phone/tablet",
        "- Bigger font in agenda view",
        "- Improved shadow for calendar events",
        "- Uses new way to read location",
        "- Bugfix for sub menus",
        "New:",
        "- Option to show/hide calendar events in ambient mode",
        "- Option to show/hide calendar event texts in ambient mode",
        "- Option to show/hide sun events in ambient mode",
        "- Option to show/hide hand texts in ambient mode",
        "- Option to change screen timeout",
        "- Color on digital time in ambient mode if device supports it"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tobotec.wearable.agenda12hwatchface&hl=en&gl=us",
    "appId": "com.tobotec.wearable.agenda12hwatchface"
}