{
    "title": "Connected",
    "summary": "BECOME THE MASTER OF YOUR TIME",
    "icon": "//lh3.googleusercontent.com/8JsHwiaA9SetlH54WAQ4sQkL_C5tV8UXkfdAjHEQLQGc_l9LW1hbRo7qK5lLFuh7aA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.8,
    "reviews": 940,
    "developer": "TAG Heuer",
    "developerId": "TAG+Heuer",
    "developerEmail": "support@tagheuerconnected.com",
    "developerWebsite": "http://www.tagheuerconnected.com/",
    "updated": "January 25, 2018",
    "version": "Varies with device",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "size": "Varies with device",
    "description": "TAG Heuer Connected makes every moment of your day exceptional. Pioneering technology meets decades of Swiss watchmaking craft, to create a watch that transforms time. Combine your TAG Heuer Connected watch with this app and realise its full potential. Browse your curated collection of authentic TAG Heuer watch faces. Become a master watchmaker and craft your own custom watch face – down to the finest details – in the TAG Heuer Studio. Upload a photo to create a watch face that keeps those special memories close. TAG Heuer Connected is not just a watch – it is every watch – for every occasion.------If you’re a customer of the first TAG Heuer Connected, you may notice that our partners’ themed watch faces (Golfshot, ViewRanger, RaceChrono, Formula E etc) are no longer available. You’ll soon receive a major Android Wear update, which will open up a whole new collection of watch faces. As well as some new themes from our exclusive partnerships, you’ll also have access to a new interactive theme – a classic TAG Heuer watch face that you can transform with live data from your favourite applications. Or for a truly custom design, you will be able to create your own watch face through the TAG Heuer Studio.",
    "descriptionHTML": "TAG Heuer Connected makes every moment of your day exceptional. Pioneering technology meets decades of Swiss watchmaking craft, to create a watch that transforms time. Combine your TAG Heuer Connected watch with this app and realise its full potential. <br><br>Browse your curated collection of authentic TAG Heuer watch faces. Become a master watchmaker and craft your own custom watch face &#x2013; down to the finest details &#x2013; in the TAG Heuer Studio. Upload a photo to create a watch face that keeps those special memories close. <br><br>TAG Heuer Connected is not just a watch &#x2013; it is every watch &#x2013; for every occasion.<br><br>------<br><br>If you&#x2019;re a customer of the first TAG Heuer Connected, you may notice that our partners&#x2019; themed watch faces (Golfshot, ViewRanger, RaceChrono, Formula E etc) are no longer available. You&#x2019;ll soon receive a major Android Wear update, which will open up a whole new collection of watch faces. As well as some new themes from our exclusive partnerships, you&#x2019;ll also have access to a new interactive theme &#x2013; a classic TAG Heuer watch face that you can transform with live data from your favourite applications. Or for a truly custom design, you will be able to create your own watch face through the TAG Heuer Studio.",
    "histogram": {
        "1": 169,
        "2": 56,
        "3": 89,
        "4": 141,
        "5": 485
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/gWXdMOhx8m7Xs1iMuaA-MRp5py2SGsn8gIsTpnIXMIGtnDFnS9B6ovf1nZrsHdkKf0RI=h310",
        "//lh3.googleusercontent.com/ZfkIvRLsV5yiwpFk5X8ffS6i22S_-hqdk-J4U25juuXx28HUjmhTebZR_2XPm9zn_tc=h310",
        "//lh3.googleusercontent.com/ySnEm_cSj0G3ieMkQmmA6eSUwagvfmgReOSLIs0dbeTwL44lAfXpNwzsCmT_HJuEUo0=h310",
        "//lh3.googleusercontent.com/6h6RQLzvPb4iTXASxPU6uP2OzuaKf4nhFuvDrLYEH7YJlQci5h1hRqim2ghfmq2iwpoY=h310",
        "//lh3.googleusercontent.com/Xh5U_yEsEKNWc57cdANiP0FMF6S0QVQtDcZ1y29NxWp1NqzqM1Yq8RCDrNS4nCdMfw=h310",
        "//lh3.googleusercontent.com/Hx63YmhHrDuANES4T8zoUFQSJhq6d_qt2k7iM_SF364AkiSqw7fEk5tpwYivpEiMCQ=h310",
        "//lh3.googleusercontent.com/3ACx4964S8vT1vLCd2bRQwqCBZUU0Bll37WzDeIhke2517YYXhcYzo9nbVwLbcJSww=h310"
    ],
    "comments": [
        "Hate my connected as it was sold to me on a lie (sabrina).  Avoid  buying from the \"flagship\" store in Pitt Street mall Sydney.",
        "You can't actually do anything more than chosing your watchface, something you can do with the android wear app by default.",
        "Awesome watch. Though it's a wear 2.0 but it is really nice. The apps are interactive  No complaint.",
        "Useless. I own a Tag Heuer Connect 45. After the update, \"Alway On\" watch face change to basic style which look cheap. Please provide instructions to revert this useless update.",
        "This use to be wonderful with connected 46 but when connected 45 launched the watch face become limited can't find the old watch and there is one more issue every time i open the app it ask me to register again there is one  more  thing  that watch face is not available  any more  for conneced 46 what  is the reason",
        "I also own a connected 45, why do you throw away my watch details every time you upgrade the app. Also why do you forget my login details every time you upgrade - this is not the type of security I need for my bank account. Just make it easier to use!"
    ],
    "recentChanges": [
        "- Various bug fixes and UI improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tagheuer.wear&hl=en&gl=us",
    "appId": "com.tagheuer.wear"
}