{
    "title": "Bitdefender Mobile Security & Antivirus",
    "summary": "Give your mobile devices TOTAL protection from viruses and privacy “intruders”",
    "icon": "//lh3.googleusercontent.com/WF5HgLU5UEk0hV05liPcYe4MMEAHIQXUfux_eHxxRgP9W6aBsQE3OLH-m9x6GIgxOfk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 112628,
    "developer": "Bitdefender",
    "developerId": "7546785038481225913",
    "developerEmail": "bms@bitdefender.com",
    "developerWebsite": "http://m.bitdefender.com",
    "developerAddress": "BITDEFENDER GMBH\n\nAddress:\nTechnologiezentrum Schwerte\nLohbachstraße 12\nD-58239 Schwerte\nGermany",
    "updated": "February 22, 2018",
    "version": "3.2.112.319",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "The most advanced cybersecurity app for Android gives your devices absolute protection against viruses and malware.\nTo protect your Android after the 14-day trial is over subscribe to Bitdefender Mobile Security.\nNEW! VPN AddedSurf the web anonymously & unlock geo-IP restricted content with VPN.Free - 200 MB traffic / day. Upgrade to PREMIUM VPN and you get:-Unlimited traffic-Multiple virtual locations from all over the world including US, UK, IT, AU!\nFeatures at a glance:✔ Malware Scanner - 100% detection rate✔ New: VPN - hide your IP & unlock geo-restricted content✔ Account Privacy - verify whether your email account has been breached or not✔ App Lock - lock your sensitive apps with a PIN code✔ Web Security - real-time protection for the most popular browsers✔ Anti-Theft - lock, track, and wipe your phone✔ Privacy Advisor - see which apps may leak your private information✔ WearON - extend Bitdefender Mobile Security to your smart watch\nMalware ScannerWith an independently proven 100% detection rate, Malware Scanner is always up to date with the latest intel on viruses and automatically scans apps for malware as you install them.\nAccount PrivacyHow safe is your email address?Now you can find out whether your account details have been leaked or not by simply running a check with Bitdefender Mobile Security.\nSmart UnlockWhen you're using a trusted Wi-fi such as your home hub, Smart Unlock grants you direct access to your apps by disabling the PIN.\nFingerprint Sensor SupportUnlock secured apps with the tip of your finger.\nPIN Timeout30-second timeout after 5 consecutive incorrect attempts to access your PIN protected apps.\nWeb SecurityWeb Security detects malicious content and keeps your browsing safe for the most popular browsers.\nAnti-TheftLock, geo-locate, sound an alarm, and wipe your Android from any Internet connected device.Anti-Theft even allows you to listen in on your phone, and send out SMS commands.It will also alert you in case the SIM card has been changed.\nSnap PhotoYour phone will snap a mugshot of any person who tries to tamper with your phone in your absence.\nPrivacy AdvisorFind out if any of your apps peek into your private data and leak it online.\nWearONExtend Bitdefender Mobile Security to Android Wear devices.Don’t lose your device with the help of  and .(Android 4.3 and up required)\nPlease Note!This app requires device admin permission.\nThis app uses Accessibility services.",
    "descriptionHTML": "<p>The most advanced cybersecurity app for Android gives your devices absolute protection against viruses and malware.</p><br><p>To protect your Android after the 14-day trial is over subscribe to Bitdefender Mobile Security.</p><br><p><b>NEW! VPN Added</b><br>Surf the web anonymously &amp; unlock geo-IP restricted content with VPN.<br>Free - 200 MB traffic / day. <br>Upgrade to PREMIUM VPN and you get:<br>-Unlimited traffic<br>-Multiple virtual locations from all over the world including US, UK, IT, AU!</p><br><p><b>Features at a glance:</b><br><br>&#x2714; <b>Malware Scanner</b> - 100% detection rate<br>&#x2714; <b>New: VPN</b> - hide your IP &amp; unlock geo-restricted content<br>&#x2714; <b>Account Privacy</b> - verify whether your email account has been breached or not<br>&#x2714; <b>App Lock</b> - lock your sensitive apps with a PIN code<br>&#x2714; <b>Web Security</b> - real-time protection for the most popular browsers<br>&#x2714; <b>Anti-Theft</b> - lock, track, and wipe your phone<br>&#x2714; <b>Privacy Advisor</b> - see which apps may leak your private information<br>&#x2714; <b>WearON</b> - extend Bitdefender Mobile Security to your smart watch</p><br><p><b>Malware Scanner</b><br>With an independently proven 100% detection rate, Malware Scanner is always up to date with the latest intel on viruses and automatically scans apps for malware as you install them.</p><br><p><b>Account Privacy</b><br>How safe is your email address?<br>Now you can find out whether your account details have been leaked or not by simply running a check with Bitdefender Mobile Security.</p><br><p><b>Smart Unlock</b><br>When you&apos;re using a trusted Wi-fi such as your home hub, Smart Unlock grants you direct access to your apps by disabling the PIN.</p><br><p><b>Fingerprint Sensor Support</b><br>Unlock secured apps with the tip of your finger.</p><br><p><b>PIN Timeout</b><br>30-second timeout after 5 consecutive incorrect attempts to access your PIN protected apps.</p><br><p><b>Web Security</b><br>Web Security detects malicious content and keeps your browsing safe for the most popular browsers.</p><br><p><b>Anti-Theft</b><br>Lock, geo-locate, sound an alarm, and wipe your Android from any Internet connected device.<br>Anti-Theft even allows you to listen in on your phone, and send out SMS commands.<br>It will also alert you in case the SIM card has been changed.</p><br><p><b>Snap Photo</b><br>Your phone will snap a mugshot of any person who tries to tamper with your phone in your absence.</p><br><p><b>Privacy Advisor</b><br>Find out if any of your apps peek into your private data and leak it online.</p><br><p><b>WearON</b><br>Extend Bitdefender Mobile Security to Android Wear devices.<br>Don&#x2019;t lose your device with the help of  and .<br>(Android 4.3 and up required)</p><br><p><b>Please Note!</b><br>This app requires device admin permission.</p><br>This app uses Accessibility services.",
    "histogram": {
        "1": 5548,
        "2": 1999,
        "3": 4719,
        "4": 17675,
        "5": 82687
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/7O9ECUEsrg3Yu6hDtxombEe0ijHmysBz_n3hxqydaeA_zucjV0AhA-xZ0hy8nXnRYY4=h310",
        "//lh3.googleusercontent.com/DAveAcam3cu5ZwWS5ydW4oR8MRUtIv5zNpLdorXNY4tXbg0QGxzFv1EUhdprazQsEA=h310",
        "//lh3.googleusercontent.com/y898mom7wSkCBLa98gHQ9M8rZ3icl9yJYjO3sqzkIQBVz-rdsoqi3A3wy3hOdBLghg=h310",
        "//lh3.googleusercontent.com/L1G8cbZ8U8gL0WWD1pjhyTgOayEF2X6doZyCzr8KiWV6dyOTbstcvsbvmwUGOJV7AT4=h310",
        "//lh3.googleusercontent.com/RSrlfiF7waKPF6CF4lVjG4Vf2YcJ9-QEuTaf0kR06PT_30OJq4pO4DMOzGWTEH1tnQ=h310",
        "//lh3.googleusercontent.com/RcIT7P_LjT6ipy_jnLO4u4lZhyeZtGUQBWbELUBbkNwwpTOhget3RKzZq2_SU43y3w=h310",
        "//lh3.googleusercontent.com/MUsb2ffIIhxpmKAWcYtrY3ARBeIR3eBE1tQyB3EWX2vH5CJv6ysLZnKEhhUcWXkmHwY=h310",
        "//lh3.googleusercontent.com/KyFJqQ_EqVERJiiZSPZPsENx1JmmlYN4pnSh7uqwSajw2dFTvjEdbDgcKv2PO6Wg4w=h310",
        "//lh3.googleusercontent.com/0BE7wjL_ASlDzJ2lMa0wB9lIQa7tQs2CZ06dkt2nVlQEUV766G1wnvy9TKpSIn88vg=h310",
        "//lh3.googleusercontent.com/C8R6TTjapaBWyqEQ2lCgqFUVFd5HNgxKL7eN7pm6CoyD5GAEyqepTvKDeG8HYxBJesU=h310",
        "//lh3.googleusercontent.com/tdeuwxOESVYdUq6FBKZn1-UnR0BXAfdkmEVT5E6xP1_v76dnxVInllxkpsgp2oHQZ-0=h310",
        "//lh3.googleusercontent.com/nqm2-qYCP98p6azb4lAlyvxj3OOThWcHUH644dkhykfgfpUoQh7Wa_z_ZBzu0QSspko=h310"
    ],
    "comments": [
        "There  isn't option to lock this app with \"app lock\" function?!? What is the point to lock other apps and if someone take the phone and just be able to cancel all locks?!?... Also this app has quite a big power consumption... Before to install this app my phone reaches around 35-40hrs \"stand by\" and 7 hrs \"SoT\", now - 25-30hrs \"stand by\" and  5 hrs SoT... And also I don't want app scan my divice every day automatically without option to disable it!",
        "Stop bugging me about VPN. I dont want it. If I want advertising notifications I would have kept AVG. It would be nice if it would allow me to tell it to stop warning about some apps. I know that messenger and allo have access to my contacts. The wearon feature got annoying very quickly when my phone was switched off. I had to block it.",
        "Amazing antivirus with a small footprint. Would have really like it if they stopped bugging me with the VPN offer. After paying this much you would expect them to atleast throw in the VPN for free. Will give it 5 stars if an when this is resolved.",
        "Hi, issue I've noticed on Moto g5s plus, if accessibility for web security turned on then volume controls take 20 seconds to hide themselves instead of usual 2 or so. Minor inconvenience but would love to have it fixed. Cheers",
        "I have loved this app up until the last update. It uses almost no battery and I assume it works. Never had any security issues. The last update keeps \"nagging\" to activate the web security. I don't want it but when I got tired of the constant notifications, I tried to activate it and it won't activate. ARG! It's too bad. I did like the app but I'll try and fond another.",
        "Excellent product...Had this product for several years and I've never had a problem. They have now added the 2nd generation box and VPN both of which are excellent options to add to surf the Web and have all your smart equipment protected as well."
    ],
    "recentChanges": [
        "New! Bitdefender Mobile Security now includes VPN",
        "Enable the VPN whenever you need a safe, encrypted connection, or wish to surf the web anonymously."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bitdefender.security&hl=en&gl=us",
    "appId": "com.bitdefender.security"
}