{
    "title": "Watch Face Laserslime - Star Wars lightsaber style",
    "summary": "Animated lightsaber watch face with 17 backgrounds and exclusiv powersaving mode",
    "icon": "//lh3.googleusercontent.com/p5S184qZdm4ZF-rXrmJa4HSthXUWrs4TDeOP51QyL5OJqtD7r3s5B7C5_7Akbc-QPMA=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 4.4,
    "reviews": 13,
    "developer": "OptimusByte",
    "developerId": "7949736410564838746",
    "developerEmail": "support@optimusbyte.com",
    "developerWebsite": "http://OptimusByte.com",
    "developerAddress": "OptimusByte\nGertrud-Bollenrath-Weg 1\n50765 Köln",
    "updated": "March 28, 2015",
    "version": "1.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Laserslime is an animated, futuristic, hybrid action-watchface with 17 different backgrounds, 2 ambient faces, our exclusive Optimus energy saving mode, glowing lightsaber-like pointers and animated special effects, like rotating flares, an extendable second hand, gyros, animated seconds strokes and much more. Perfect for starwars watchface fans. Together with the battery indicator and date display all informations are directly visible. For the ambient-mode we created a special energy saving design for this watch face. That’s not all! Trough a adapted behaviour linked to the actual battery status the watchface automatically throttles down into an even more battery saving mode as soon as the battery status reaches 20% or less. You are looking for a spectacular watch face getting the best out of your wearable battery but still have an extraordinary animation mode? Then you should check this OptimusByte Laserslime watch face! Check out our original exclusive Optimus Mode. All graphics are high quality and professionally designed and you even can change the look and feel of your Laserslime (aka Laserlime). Fully configurable cool watchface.The key features of Laserslime Watch Face are:✔ Optimized for round and square smartwatches✔ 17 different backgrounds in Regular Mode✔ Exklusive energy saving mode, optimizes the battery life of your smartwatch✔ Adjustable 24h and 12h mode✔ Battery indicator✔ Ready to use, no configuration necessary to use the watch face✔ Animated, lightsaber-like pointer✔ Rotating spot lights, flares and a gear✔ Additional color changing edge streaker✔ Digital and analog display in one✔ Highly optimized Ambient mode for extended battery life✔ Decent ambient, animated and colorful regular mode✔ Date and seconds indicator✔ The second hand moves out like a light saber, when switching to regular mode**Please review our watch face and give us feedback, you're missing a feature? Only through your feedback, we can optimize our OptimusByte wearable watch faces for an even better experience on your smart watch!**FAQQuestion: How can i change the settings of the watch face?Answer: Simply hold your watch face down. Then you will see the watchface change mode where you can push the settings icon (gear) below our watch face and adjust the settings.All android wear watches are supported, f.ex.: Moto 360, LG G Watch R, LG G Watch, Sony Smartwatch 3, Samsung Gear Live, Asus ZenWatch, Huawei Watch, Fossil Q Founder, Casio WSD-F10 and Tag Heuer Connected. Watchfaces by Optimusbyte Wearable Apps More OptimusByte Apps:https://goo.gl/So0Y8aWebsite:http://optimusbyte.com/Optimusbyte on Google+:https://plus.google.com/+Optimusbyte",
    "descriptionHTML": "<b>Laserslime</b> is an animated, futuristic, hybrid action-watchface with <b>17 different backgrounds</b>, 2 ambient faces, our <b>exclusive Optimus energy saving mode</b>, glowing lightsaber-like pointers and animated special effects, like rotating flares, an extendable second hand, gyros, animated seconds strokes and much more. Perfect for starwars watchface fans. Together with the battery indicator and date display all informations are directly visible. For the ambient-mode we created a special energy saving design for this watch face. That&#x2019;s not all! Trough a adapted behaviour linked to the actual battery status the watchface automatically throttles down into an even more battery saving mode as soon as the battery status reaches 20% or less. You are looking for a spectacular watch face getting the best out of your wearable battery but still have an <b>extraordinary animation mode</b>? Then you should check this <b>OptimusByte Laserslime watch face</b>! Check out our original exclusive <b>Optimus Mode</b>. All graphics are high quality and professionally designed and you even can change the look and feel of your Laserslime (aka Laserlime). Fully configurable cool watchface.<br><br>The key features of <b>Laserslime Watch Face</b> are:<br>&#x2714; <b>Optimized for round and square smartwatches</b><br>&#x2714; <b>17 different backgrounds</b> in Regular Mode<br>&#x2714; Exklusive energy saving mode, optimizes the battery life of your smartwatch<br>&#x2714; Adjustable 24h and 12h mode<br>&#x2714; Battery indicator<br>&#x2714; Ready to use, no configuration necessary to use the watch face<br>&#x2714; Animated, lightsaber-like pointer<br>&#x2714; Rotating spot lights, flares and a gear<br>&#x2714; Additional color changing edge streaker<br>&#x2714; Digital and analog display in one<br>&#x2714; Highly optimized Ambient mode for extended battery life<br>&#x2714; Decent ambient, animated and colorful regular mode<br>&#x2714; Date and seconds indicator<br>&#x2714; The second hand moves out like a light saber, when switching to regular mode<br><br>**Please review our watch face and give us feedback, you&apos;re missing a feature? Only through your feedback, we can optimize our OptimusByte wearable watch faces for an even better experience on your smart watch!**<br><br><b>FAQ</b><br>Question: How can i change the settings of the watch face?<br>Answer: Simply hold your watch face down. Then you will see the watchface change mode where you can push the settings icon (gear) below our watch face and adjust the settings.<br><br>All android wear watches are supported, f.ex.: <br>Moto 360, LG G Watch R, LG G Watch, Sony Smartwatch 3, Samsung Gear Live, Asus ZenWatch, Huawei Watch, Fossil Q Founder, Casio WSD-F10 and Tag Heuer Connected. <br><br>Watchfaces by <b>Optimusbyte Wearable Apps</b> <br><br>More OptimusByte Apps:<br>https://goo.gl/So0Y8a<br><br>Website:<br>http://optimusbyte.com/<br><br>Optimusbyte on Google+:<br>https://plus.google.com/+Optimusbyte",
    "histogram": {
        "1": 0,
        "2": 1,
        "3": 2,
        "4": 1,
        "5": 9
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/eQEags-uubMbygBUD_wzcxHmxzBWfabc6bdKs3I8hy8Ops3EllbpDS9AKbKQa7x-G9A=h310",
        "//lh3.googleusercontent.com/bKLVf2CivUi6lDYA2WnyGkMLMyRk1ZgRmnWrXdajYTQnDl-TBac3vBv5KPBRLW3_1NQ=h310",
        "//lh3.googleusercontent.com/qyd0PHTxiSFqJWLRaMoOQhnvFh43jMrjykA1umLnezdwBeu10o0xhLoBZQsFgOSxD48=h310",
        "//lh3.googleusercontent.com/ajFy5cx2RfaCTvxHInSNjM6pyxfmki2EBGMFKCLKOP61L499p_L-e02j5EpMNWQQFL4=h310",
        "//lh3.googleusercontent.com/-zMj9aOmrgmCklkGEYwE-s---OaSC5YAiMR2CyqE7_pGG40Rxgp_bfNZ_XkcXyUjvqbL=h310",
        "//lh3.googleusercontent.com/lmMmVnh51MoPxdMW3tWan3xTQKO1qCdciIkXRdqnPUllmlylarsIWdu3TmTXzhXj9w=h310",
        "//lh3.googleusercontent.com/RXHXG6waA3ltvnJWuH4_L-TZxgOS99PDp5bMqqCQdwZStZEuxGRves7ylExXZaYvLg=h310"
    ],
    "video": "https://www.youtube.com/embed/4UlhCigbqzM",
    "comments": [
        "Beautiful One of the best looking watchface I have seen.  Absolutely gorgeous on my moto 360",
        "Very nice watch face Beautiful watch face awesome."
    ],
    "recentChanges": [
        "- optimized for round and square smartwatches",
        "- 17 different backgrounds in regular mode",
        "- 1 new ambient face",
        "- Introducing the exclusive Optimus Mode: \"Auto\"",
        "As soon as your battery level reaches 20% or lower the regular mode will be optimized for an even better battery saving, your wearable will have a longer runtime. Further options are: \"Off\" and ever \"On\". For more information look the manual",
        "- Ambient mode can be  set off",
        "- 24h/12h mode",
        "- Battery level display in regular- and ambient-mode"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.optimusbyte.android.watchfaces.laserslime&hl=en&gl=us",
    "appId": "com.optimusbyte.android.watchfaces.laserslime"
}