{
    "title": "Glow Meter Watch Face",
    "summary": "Glow in the dark with Glow meter watch design. Quick access to date, time etc.",
    "icon": "//lh3.googleusercontent.com/vQD9iPjIDGvpHWnLilHIYZObJurG0dSpik5boTrgYr0s0p47PqB3t3-HbBEJKZvC1zo=w300",
    "price": "$1.03",
    "free": false,
    "minInstalls": 50,
    "maxInstalls": 100,
    "score": 2.3,
    "reviews": 3,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "May 20, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Bring the glow to your life with this beautiful watch face “Glow Meter”. Glow meter is designed to enhance the look of your smart watch. It illuminates the boundary of the watch and meters circle in yellow and green keeping background black.FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:- Analog Dials with Date  Classic Design with Ultimate readability Clean and simple look Current location temperature Remaining battery life of your watch  Remaining battery life of your device so you exactly know when to charge Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?It’s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Bring the glow to your life with this beautiful watch face &#x201C;Glow Meter&#x201D;. Glow meter is designed to enhance the look of your smart watch. It illuminates the boundary of the watch and meters circle in yellow and green keeping background black.<br><br>FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br>Key custom features:-<br><br>&#xF0EC; Analog Dials with Date <br>&#xF0EC; Classic Design with Ultimate readability<br>&#xF0EC; Clean and simple look<br>&#xF0EC; Current location temperature<br>&#xF0EC; Remaining battery life of your watch <br>&#xF0EC; Remaining battery life of your device so you exactly know when to charge<br>&#xF0EC; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br>This watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br>How it works?<br>It&#x2019;s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 2,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/74KUNiXCfYBSWVZ7EPbOuCzwR5o4STwhDbchzmm0MXTOxFi7cG-C4C4Tg33Tez0vLw=h310",
        "//lh3.googleusercontent.com/G3MjPrbwwJx_reLQ49IaO_BmjepmElk4HDI6C-GCBLF96e2fW7VQUr5s5_M9tw5ByA=h310",
        "//lh3.googleusercontent.com/S757YbBuC0kIOOKN_SFN82xlAdzkAZtQC7owe51GxZq5y5ba3oGV0QjC6nGZt-IK=h310",
        "//lh3.googleusercontent.com/adrinBmapxk01ITiJQNZunHVqzfRWlFZDaEsNFVRQMOafKusd_eIpCO91HLEgHY58EM=h310"
    ],
    "comments": [
        "Stops working I cant move non of the settings it closes app. Bad app dont work. Dont recomend"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.glow.meter.analogue.watch.face.A27&hl=en&gl=us",
    "appId": "com.frillroid.glow.meter.analogue.watch.face.A27"
}