{
    "title": "Wearable Widgets",
    "summary": "Put any home screen widget from your phone onto your smartwatch.",
    "icon": "//lh5.ggpht.com/hNrlpwk3hn9uDkvGgyEfRnwHn2xxH4XsEHDFpJ3inKoftKKIwrOyA2PELyJ0LraMhos=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.7,
    "reviews": 1464,
    "developer": "Udell Enterprises, Inc",
    "developerId": "6589881289812568831",
    "developerEmail": "wearable@udellenterprises.com",
    "developerWebsite": "http://wearablewidgets.com",
    "developerAddress": "1338 Grand Ave\nGlenwood Springs, CO 81601\nUSA",
    "updated": "July 16, 2017",
    "version": "Varies with device",
    "genre": "Tools",
    "genreId": "TOOLS",
    "size": "Varies with device",
    "description": "Widgets you can wear. Put virtually any homescreen widget from your phone onto your smartwatch or Google Glass™. Supports Android Wear, Samsung Gear (except Fit/2), and Sony SmartWatch (all models).NOTE: You MUST have one of these devices (Glass or a supported smartwatch) to use this app! See below for device-specific instructions; lots more info is available at http://wearablewidgets.com.If you have any difficulties, please email us, or stop by our community on Google+: http://goo.gl/dbZ1d0. Please do not just leave a complaint as a comment here: this is an app store, not a support forum.---Wearable Widgets creates a bridge from your phone to your wearable device for the thousands of widgets available on Android. You don't need to wait for developers to support smartwatches or Glass; get your apps on your wearable now, in a format that the developer has already designed for a small screen. Now, please adjust your expectations…• This free app supports unlimited usage of one widget at a time. Multiple widget support for smartwatches is available as a small, one-time in-app purchase: please confirm that your favorite widgets are compatible with your watch before buying.• Tapping and swiping on widgets does work, but keep in mind that the widget is still running on your phone, not your watch. So tap actions on a widget are also going to happen on your phone - not your watch!• Related: you’ll find that taps and swipes on your wearable device aren't quite as nifty as when you interact directly with your phone; there’s some unavoidable lag in the connection between devices.• Some widgets lend themselves better than others to the screen size on wearable devices. Please use common sense.• There are also some known compatibility issues with a few specific widgets, including Wink, Feedly, and some clocks. If you're having trouble with one, you can find more info at http://wearablewidgets.com/widgets.htmlUsing with Android WearWith your watch paired to your phone, just install and run this app, and select a widget or two. Then just launch WW from the app list on the watch. (Or if you prefer, you can say to your watch, \"Ok Google, start widgets!\")You can also set Wearable Widgets as your watch face, giving you instant access to any widget you've chosen.Using with Tizen GearFirst, install and run this app on your phone to configure your widgets. Then open the Samsung Gear app, and in the Gear Apps store, search for “Wearable Widgets” to install the watch component. It's available both as a clock face and as an interactive app.Please note that using older Tizen watches (Gear S and earlier) with non-Samsung phones is not supported.Also, this app will only generate the Gear series' native \"widgets\" on the Gear S3. Older Gear watches use a different technology for this, and so are not supported in this way.Using with Sony SmartWatch 1 and 2You’ll need Sony's Smart Connect app (http://goo.gl/4JDnN) installed and configured on your phone. Then just run Wearable Widgets, and select a widget from the list that pops up. To see it on your wrist, simply tap our “W” icon on the watch's home screen.Using with Google GlassTo show a widget on Glass, you’ll need this app installed on your phone, plus a small second app on Glass. You can find the Glassware download (plus more instructions) at our website, http://widgets.glass. Run the phone app to set up your widget, then just say, \"OK Glass… Show widgets\".Unfortunately, multiple widgets are not supported on Glass; see http://wearablewidgets.com/glass#multiple for info.---Widget images are used with the permissions of their respective developers.Portions of the screenshots are reproduced from work created and shared by the AOSP and used according to terms described in the CC 2.5 Attribution License.Smart Connect extension for SmartWatch 2LiveWare™ extension for SmartWatch",
    "descriptionHTML": "<b>Widgets you can wear</b>. Put virtually any homescreen widget from your phone onto your smartwatch or <b>Google Glass</b>&#x2122;. Supports <b>Android Wear</b>, <b>Samsung Gear</b> (except Fit/2), and <b>Sony SmartWatch</b> (all models).<br><br>NOTE: You MUST have one of these devices (Glass or a supported smartwatch) to use this app! See below for device-specific instructions; lots more info is available at http://wearablewidgets.com.<br><br>If you have any difficulties, please email us, or stop by our community on Google+: http://goo.gl/dbZ1d0. <i>Please do not just leave a complaint as a comment here: this is an app store, not a support forum.</i><br><br>---<br><br>Wearable Widgets creates a bridge from your phone to your wearable device for the thousands of widgets available on Android. You don&apos;t need to wait for developers to support smartwatches or Glass; get your apps on your wearable now, in a format that the developer has already designed for a small screen. <br><br>Now, please adjust your expectations&#x2026;<br><br>&#x2022; This free app supports unlimited usage of one widget at a time. Multiple widget support for smartwatches is available as a small, one-time in-app purchase: please confirm that your favorite widgets are compatible with your watch before buying.<br><br>&#x2022; Tapping and swiping on widgets <b>does</b> work, but keep in mind that the widget is still running on your phone, not your watch. So tap actions on a widget are also going to happen on your phone - not your watch!<br><br>&#x2022; Related: you&#x2019;ll find that taps and swipes on your wearable device aren&apos;t quite as nifty as when you interact directly with your phone; there&#x2019;s some unavoidable lag in the connection between devices.<br><br>&#x2022; Some widgets lend themselves better than others to the screen size on wearable devices. Please use common sense.<br><br>&#x2022; There are also some known compatibility issues with a few specific widgets, including Wink, Feedly, and some clocks. If you&apos;re having trouble with one, you can find more info at http://wearablewidgets.com/widgets.html<br><br><b>Using with Android Wear</b><br><br>With your watch paired to your phone, just install and run this app, and select a widget or two. Then just launch WW from the app list on the watch. (Or if you prefer, you can say to your watch, &quot;Ok Google, start widgets!&quot;)<br><br>You can also set Wearable Widgets as your watch face, giving you instant access to any widget you&apos;ve chosen.<br><br><b>Using with Tizen Gear</b><br><br>First, install and run this app on your phone to configure your widgets. Then open the Samsung Gear app, and in the Gear Apps store, search for &#x201C;Wearable Widgets&#x201D; to install the watch component. It&apos;s available both as a clock face and as an interactive app.<br><br>Please note that using older Tizen watches (Gear S and earlier) with non-Samsung phones is not supported.<br><br>Also, this app will <b>only</b> generate the Gear series&apos; native &quot;widgets&quot; on the Gear S3. Older Gear watches use a different technology for this, and so are not supported in this way.<br><br><b>Using with Sony SmartWatch 1 and 2</b><br><br>You&#x2019;ll need Sony&apos;s Smart Connect app (http://goo.gl/4JDnN) installed and configured on your phone. Then just run Wearable Widgets, and select a widget from the list that pops up. To see it on your wrist, simply tap our &#x201C;W&#x201D; icon on the watch&apos;s home screen.<br><br><b>Using with Google Glass</b><br><br>To show a widget on Glass, you&#x2019;ll need this app installed on your phone, plus a small second app on Glass. You can find the Glassware download (plus more instructions) at our website, http://widgets.glass. Run the phone app to set up your widget, then just say, &quot;OK Glass&#x2026; Show widgets&quot;.<br><br>Unfortunately, multiple widgets are not supported on Glass; see http://wearablewidgets.com/glass#multiple for info.<br><br>---<br>Widget images are used with the permissions of their respective developers.<br>Portions of the screenshots are reproduced from work created and shared by the AOSP and used according to terms described in the CC 2.5 Attribution License.<br>Smart Connect extension for SmartWatch 2<br>LiveWare&#x2122; extension for SmartWatch",
    "histogram": {
        "1": 211,
        "2": 122,
        "3": 193,
        "4": 316,
        "5": 622
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Vk_0wz7QsdWJZQkYVD5u6vsoIMwhUwiUc0ArWO_i8sUAIDJbjhpIgBic21IrSvmAc0RM=h310",
        "//lh3.googleusercontent.com/vvmvKfsfVm5coL607d9nlgGZehVgCbi8vsmd1f9CLTiFiKNeU5iANkxPOL8e8nRefg=h310",
        "//lh3.googleusercontent.com/M_8U19hR0NxlBCDech1W5IWgCFR8Wr5y_MY7YPXA4MazDycjPDGSbXBaaRB7v3iZSg=h310",
        "//lh3.googleusercontent.com/9Riisc9sE0SZUs9dX5W1viNs1X-DQpyFcNCIaAVH-ykmnhHTnPD2O_S8_4ZybNNyzA=h310",
        "//lh3.googleusercontent.com/xjXR19Ijuw0TuKgcIp_5o0JOuAAW6CqhL-gaOjjAojntcSU4bUdOANgokHCUrxa573Lu=h310",
        "//lh4.ggpht.com/dRb9_KghpEbzF3RuldhIyJKg6O00GHGm6uNWddQOfRse_N6aGrGbAoSulO68_A9NGYI=h310",
        "//lh4.ggpht.com/edkfhsa3JvagYQ1Nq2FjJZa-ChfnKfOnWBHnks2m5zOULCuzAEYmvbwH11GlqyIIyQ=h310"
    ],
    "video": "https://www.youtube.com/embed/2bjLImDsFvI",
    "comments": [
        "Very useful! A little harder on both batteries, but tolerably. Using for (your) full moon widget, WOL, and some otherwise impossible remote phone controls. Shame about the multiple-widget bug, and I wish I could alter the update interval for those too, but this app is a keeper.",
        "I finally got some widgets on my watch. When I get widget on the phone in wearable widget app they are interactive. But most are not. Most are simply a screen shot of the phone widget. What good is this app if mostly just gives a picture of a widget.  For example the gmail widget scrolls in the wearable widget phone app, but not workable on the watch. On the watch I just see a picture of what is a widget, not workable.  Another example the callendar doesn't update. The weekly calendar scrolls on the phone WW app, but not the watch. Just a picture of the app on the watch.  Now the widget on the watch is just blank black screen. No phone widget. I still say it is useless.",
        "It does not work when the phone is asleep. I wanted to use it for Wake On LAN apps. If the phone screen is at least lit up, it will work. If the phone is asleep, and I tap the app on the watch, I can hear the phone doing the tap sound, but nothing happens. I have tried multiple wol apps, but nothing works, they all do the same thing. I cannot tell if it is the app on the phone, or the app on the watch, or an Android issue altogether.",
        "Fantastic and absolutely essential app for non-Android wearables (like my Gear S3). I use it for Gmail and National Rail widgets.  One glitch (hence 4 stars) is that when having multiple 'Wearable Widgets', they often revert to the same app / widget (e.g. 2x Gmail widgets), therefore I have to touch below one of the duplicate widgets and scroll (once again) to the correct app / widget (e.g National Rail). Hopefully this can be fixed.",
        "Don't make the mistake of paying for the full version like I did. You're supposed to be able to add multiple widgets, but when you try to add a second one, you don't get a choice of which one you want to add, it just keeps adding the first one over and over again. $1.99 later, I can add multiple widgets to my phone that I can't do anything with. And no option for a refund because it was an in app purchase. Rediculous!",
        "Sadly this can only be set up as a watch face on your Samsung gear. I would prefer it to be configured as a standard widget on the watch. Otherwise the app is a great idea."
    ],
    "recentChanges": [
        "Phone app:",
        "• Fix some widget-specific rendering bugs",
        "• Improve appearance of navigation menu and About screen",
        "• Update Samsung accessory library",
        "Android Wear app:",
        "• Add support for rotary input",
        "• Remove Bluetooth permission"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.wearablewidgets&hl=en&gl=us",
    "appId": "com.wearablewidgets"
}