{
    "title": "Star Wars",
    "summary": "The Star Wars App is your official mobile connection to a galaxy far, far away.",
    "icon": "//lh3.googleusercontent.com/XGQzo00WzL4Icoftl_cpogskee7YMnEMmJufCmL7Gntr-MlReH8VJA9V3vVsauNjSDVS=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 16773,
    "developer": "Disney",
    "developerId": "Disney",
    "developerEmail": "help@starwars.com",
    "developerWebsite": "http://help.starwars.com/STAR-WARS-App",
    "developerAddress": "500 South Buena Vista Street\nBurbank, CA 91521-0105\nUnited States",
    "updated": "February 2, 2018",
    "version": "2.5.1.390",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "description": "The Star Wars app is your official mobile connection to a galaxy far, far away.With a dynamic interface, the Star Wars app immerses you in breaking news, rich media, social updates, special events, and interactive features. Here’s where the fun begins:● Find The Force: Celebrate Force Friday and unlock characters from Star Wars: The Last Jedi in Augmented Reality!● Get instant notifications on big announcements, including trailer releases and movie news● Theme your app with Light Side, Dark Side, or Droid interfaces, each containing different designs, sounds, and animations ● Unlock 3D Star Wars characters, ships and special quizzes in our Augmented Reality features● Immerse yourself in Jakku Spy, a first-of-its-kind serialized Google Cardboard Virtual Reality (VR) feature that ties directly to Star Wars: The Force Awakens.● Take and share a Star Wars “selfie” in various iconic costumes and settings, including Jedi, Princess Leia (with hair buns), Han Solo’s carbon freeze, and more● Get Star Wars-themed weather and five-day forecasts, featuring original art and parallax effects of in-universe planets and locales ● Wield a lightsaber and hone your skills against a training remote, as seen in Star Wars: A New Hope● Play classic sound clips and sound effects from your favorite Star Wars characters, creatures, weapons, vehicles, and scenes● Follow official Star Wars social channels via aggregated, customizable feeds from Facebook, Instagram, YouTube, Tumblr, Google+, and Twitter● Watch official Star Wars videos, including movie trailers, The Star Wars Show, Rebels Recon, behind-the-scenes featurettes, and more● Read official Star Wars news and blogs from StarWars.com, including creator interviews, and more● Count down to theatrical releases and exciting fan events with an always-running timer● Share Emojis and animated GIFs with your friends and family● Discover behind-the-scenes fun facts with This Day In Star Wars History● Sign up for Star Wars ID and join the growing Star Wars fan communityAlways in motion is the future. This app will continue to grow, evolve, and become more powerful than you can possibly imagine. NOTE: This app requires Android 4.2 and above. Headphones are suggested, especially for Jakku Spy and Force Trainer. Gyroscope required. Use Wi-Fi if experiencing connection or loading difficulties. This app contains advertising messages as well as advertising for The Walt Disney Family of Companies.Privacy Policy – http://disneyprivacycenter.comTerms of Use – http://disneytermsofuse.com LEGAL DISCLAIMER: Before you download this experience, please consider that this app contains social media links and content, registration to create or sign in using a Star Wars ID account, and push notifications to let you know when have updates like breaking news, additional content or new features.Please note that this is an English language app.  Some versions include regional social feeds in the local language.To download and access some high resolution features and content, this app requires allocating some large media files to external storage on your device. This app also requires permission to access your camera for photo and augmented reality features. This app uses location services to give weather updates.",
    "descriptionHTML": "The Star Wars app is your official mobile connection to a galaxy far, far away.<br><br>With a dynamic interface, the Star Wars app immerses you in breaking news, rich media, social updates, special events, and interactive features. Here&#x2019;s where the fun begins:<br><br>&#x25CF; Find The Force: Celebrate Force Friday and unlock characters from Star Wars: The Last Jedi in Augmented Reality!<br>&#x25CF; Get instant notifications on big announcements, including trailer releases and movie news<br>&#x25CF; Theme your app with Light Side, Dark Side, or Droid interfaces, each containing different designs, sounds, and animations <br>&#x25CF; Unlock 3D Star Wars characters, ships and special quizzes in our Augmented Reality features<br>&#x25CF; Immerse yourself in Jakku Spy, a first-of-its-kind serialized Google Cardboard Virtual Reality (VR) feature that ties directly to Star Wars: The Force Awakens.<br>&#x25CF; Take and share a Star Wars &#x201C;selfie&#x201D; in various iconic costumes and settings, including Jedi, Princess Leia (with hair buns), Han Solo&#x2019;s carbon freeze, and more<br>&#x25CF; Get Star Wars-themed weather and five-day forecasts, featuring original art and parallax effects of in-universe planets and locales <br>&#x25CF; Wield a lightsaber and hone your skills against a training remote, as seen in Star Wars: A New Hope<br>&#x25CF; Play classic sound clips and sound effects from your favorite Star Wars characters, creatures, weapons, vehicles, and scenes<br>&#x25CF; Follow official Star Wars social channels via aggregated, customizable feeds from Facebook, Instagram, YouTube, Tumblr, Google+, and Twitter<br>&#x25CF; Watch official Star Wars videos, including movie trailers, The Star Wars Show, Rebels Recon, behind-the-scenes featurettes, and more<br>&#x25CF; Read official Star Wars news and blogs from StarWars.com, including creator interviews, and more<br>&#x25CF; Count down to theatrical releases and exciting fan events with an always-running timer<br>&#x25CF; Share Emojis and animated GIFs with your friends and family<br>&#x25CF; Discover behind-the-scenes fun facts with This Day In Star Wars History<br>&#x25CF; Sign up for Star Wars ID and join the growing Star Wars fan community<br><br>Always in motion is the future. This app will continue to grow, evolve, and become more powerful than you can possibly imagine.<br> <br>NOTE: This app requires Android 4.2 and above. Headphones are suggested, especially for Jakku Spy and Force Trainer. Gyroscope required. Use Wi-Fi if experiencing connection or loading difficulties. <br><br>This app contains advertising messages as well as advertising for The Walt Disney Family of Companies.<br><br>Privacy Policy &#x2013; http://disneyprivacycenter.com<br>Terms of Use &#x2013; http://disneytermsofuse.com<br> <br>LEGAL DISCLAIMER: Before you download this experience, please consider that this app contains social media links and content, registration to create or sign in using a Star Wars ID account, and push notifications to let you know when have updates like breaking news, additional content or new features.<br><br>Please note that this is an English language app.  Some versions include regional social feeds in the local language.<br><br>To download and access some high resolution features and content, this app requires allocating some large media files to external storage on your device. This app also requires permission to access your camera for photo and augmented reality features. This app uses location services to give weather updates.",
    "histogram": {
        "1": 1382,
        "2": 744,
        "3": 1583,
        "4": 3643,
        "5": 9421
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/DyOTh7oBoESWHZRfZdQxIenrsnx6zd7GUjLLGUwODnwJuXtU2-sKXEDBJTAcPzsqk3c=h310",
        "//lh3.googleusercontent.com/FmtBaYk56jUjVa6QOQGxIgocJTKqXX737QfKd2kOAlQU1HGv8thAz2F4NkbksdAmWQ=h310",
        "//lh3.googleusercontent.com/FXlpsIKYRPMFil6XofvtEsK5N6X2jnM16g6f7xdU-iUbzY3deloOXQQFQgdsZ6SyC_k=h310",
        "//lh3.googleusercontent.com/pWT2IXomLXVMB9A4C5Yv8BBROGkLydzvAPHT6pHZBkSPD5WwcOQtgHK0sqV98UGwufeV=h310",
        "//lh3.googleusercontent.com/FMnChZe57zsALWKmv9OjmuX50AS_34sBVu100Pmc1xa9KPg2-p9YTIX_MzCgRLwKLkDo=h310",
        "//lh3.googleusercontent.com/rQ8d19WA8CXR-w7qjHMCQ9FGenTk3yElABIC83w4jQvizxXf7J5-YtV8QzGpl7cyABA=h310",
        "//lh3.googleusercontent.com/4mYEiqHItfko1DARq1NzHkX_2nx8GYUuhISTkan60vHKg_PKVBmReFmk4PDPF6XdFA=h310",
        "//lh3.googleusercontent.com/SH9-fxB-GN1DwMoRxl3P6PK54QRiVFu9xXLjMPkNBnME-XYWxE3ALI0qcLGB-gI4Rw=h310",
        "//lh3.googleusercontent.com/-ul97cEsdFoNNUSvyhoJDHZIkrYKJ5kN7lA1m0SQvEKGScsQ3c9fzOkhvE5DYFSTpQ=h310",
        "//lh3.googleusercontent.com/9sAiB8yQOmiHUDHPtVZ2iGMIkA_jRtoKQ8uG1gR6_QO-xYoL5zSctigYy449HOR2hqI=h310",
        "//lh3.googleusercontent.com/SX4DSLp39skf1zJVYDYtW6cXstT4ObNsQ5hNtQ43a9Xbm6bo_HLc7v7bYcrxqPtVEVro=h310",
        "//lh3.googleusercontent.com/e0YC9jvDm3e3tS2NxYL89VBo8yeDWVZnl626g7RqaBrEKpt89ZocZ8SnfAxrnxTciVzS=h310",
        "//lh3.googleusercontent.com/S8ZXDPxeYY0mR-yPLT7ai4ebMkIkuY33q-GjpYXdabJl9A0jbiwLS4nI20j-hJTRjEI=h310",
        "//lh3.googleusercontent.com/ThbojeBP5GPgYJWfCV8fqhAjo1sPzsa4PTNO800Uvk0ayu1lQYkGFd2KD-T6agb6xfN5=h310",
        "//lh3.googleusercontent.com/s9hTafKPrNr-wEIDqhgyAYMJPbariW3h9SIs46BI3l5rfN8ULkoy1I5cnIOrSs979l0=h310"
    ],
    "video": "https://www.youtube.com/embed/QoUPWG3KhV4",
    "comments": [
        "It's fun it gives everything a cool Star Wars overhaul I have had a lot of fun messing with the selfies feature and now I have a use for my General Mills QR codes. My favorite aspect is the weather. I live in a cold place so it says I am on Hoth. And it would be a good day to stay inside. Haha I agree!",
        "I was able to use this once to add some stickers to a pic, which I think looked great! But now it keeps crashing, ironically every time it asks me to rate the app. So fine, I will rate it: pretty looking app, very unstable! Useless after first use, because of popups that crash the app.",
        "It's got a lot of Star Wars trivia built into it, so that makes it worth right there! I love the weather app and how it will compare the weather/temperature to a planet in the Star Wars universe. The only thing that has disappointed me, is that to unlock certain features, you have to scan the movie posters, which I don't have access to.",
        "A lot of the functions do not work. The Force trainer was fun, but it doesn't work anymore. And the Stickers cause a fatal error every time.",
        "It's simple, easy to use, and provides a great database on all Star Wars related media. Plus, the activities and mini-games are fun to play.",
        "I love this app alot cause it tells u the weather but In different planets in starwars! And also u can have fun playing with starwars voices."
    ],
    "recentChanges": [
        "This update includes new sound clips from Star Wars: The Last Jedi along with minor enhancements and bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.disney.starwarshub_goo&hl=en&gl=us",
    "appId": "com.disney.starwarshub_goo"
}