{
    "title": "Weather Watch Face",
    "summary": "Weather Watch Face for your Android Wear.",
    "icon": "//lh5.ggpht.com/XRa56GIO__HknCbHJtYYpHp_HwVTIsWGcjx2HUAhZDFPoDTS2Jrd6QH_-ruS8v0W4A=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 3.8,
    "reviews": 5827,
    "developer": "Pizza Entertainment",
    "developerId": "8434384259107564209",
    "developerEmail": "weather.watchface.support@pizzaentertainment.com",
    "developerWebsite": "http://www.pizzaentertainment.com/",
    "developerAddress": "83 Roseville Road\nOffice 20 Suite: #99589\nLeeds, West Yorkshire\nLS8 5DT",
    "updated": "April 30, 2016",
    "version": "4.1.6",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Best Weather Watch Face for your Android Wear device.Supported devices:Motorola Moto360, LG G Watch, LG G WATCH R, Asus ZenWatch, Sony SmartWatch 3, Samsung Gear LIVE (not for Gear or Gear 2)To get the most out of it please read till the endAfter installing please open the application \"Weather Watch Face\" on your phone at least once, this is important to start the weather updater.By installing this you'll get the watch face on your wrist and a companion app on your mobile device which will let you configure the watch face in every part (Few of the options are only for PRO users).Some of the options and features are:  ✔ Many different watch faces to meet your taste ✔ Battery Percentage indicator for Phone/Wear ✔ 3 Day forecast / Pressure - Humidity ✔ 2 Weather providers (for now): Yahoo and OpenWeather ✔ Ability to set the weather refresh interval ✔ 3 Different watch vibration modes ✔ Option to let your wrist vibrate every hour like a cuckoo clock ✔ Option to let your wrist slightly vibrate every time you receive a weather update ✔ 24 and 12 hour format ✔ Celsius and Fahrenheit support ✔ Phone disconnection vibration ✔ and much moreNever leave your phone behind ANYMORE!!!With a single tap you can enable the option to let your wrist vibrate whenever the connection between your phone and your android wear device gets disconnected.Let your phone vibrate at each climate changeOnce woke up take a look at your wrist and decide accordingly how to dress for the day. Easy, fast and reliable.No more surprises with the battery indicatorWorried about the remaining battery? Yes Android Wear devices lacks this information. With just one look you've the precise amount of juice remaining.Have an idea on how to improve the app? Let us know by contacting us and we'll do our best to make you happy.",
    "descriptionHTML": "Best Weather Watch Face for your Android Wear device.<br><br><b>Supported devices:</b><br>Motorola Moto360, LG G Watch, LG G WATCH R, Asus ZenWatch, Sony SmartWatch 3, Samsung Gear LIVE (not for Gear or Gear 2)<br><br><b>To get the most out of it please read till the end</b><br><br>After installing please open the application &quot;Weather Watch Face&quot; on your phone at least once, this is important to start the weather updater.<br><br>By installing this you&apos;ll get the watch face on your wrist and a companion app on your mobile device which will let you configure the watch face in every part (Few of the options are only for PRO users).<br>Some of the options and features are: <br> &#x2714; Many different watch faces to meet your taste<br> &#x2714; Battery Percentage indicator for Phone/Wear<br> &#x2714; 3 Day forecast / Pressure - Humidity<br> &#x2714; 2 Weather providers (<u><i>for now</i></u>): Yahoo and OpenWeather<br> &#x2714; Ability to set the weather refresh interval<br> &#x2714; 3 Different watch vibration modes<br> &#x2714; Option to let your wrist vibrate every hour like a cuckoo clock<br> &#x2714; Option to let your wrist slightly vibrate every time you receive a weather update<br> &#x2714; 24 and 12 hour format<br> &#x2714; Celsius and Fahrenheit support<br> &#x2714; Phone disconnection vibration<br> &#x2714; and much more<br><br><br><b>Never leave your phone behind <u>ANYMORE</u>!!!</b><br>With a single tap you can enable the option to let your wrist vibrate whenever the connection between your phone and your android wear device gets disconnected.<br><br><b>Let your phone vibrate at each climate change</b><br>Once woke up take a look at your wrist and decide accordingly how to dress for the day. Easy, fast and reliable.<br><br><b>No more surprises with the battery indicator</b><br>Worried about the remaining battery? Yes Android Wear devices lacks this information. With just one look you&apos;ve the precise amount of juice remaining.<br><br><b>Have an idea on how to improve the app?</b> Let us know by contacting us and we&apos;ll do our best to make you happy.",
    "histogram": {
        "1": 766,
        "2": 438,
        "3": 742,
        "4": 1315,
        "5": 2566
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/19oc8wcOhaYZuCJ8hsEiv0mlU1_XuhzjGGlOvSVEL66MIAqf824B32d8Cl1bXm9Iygp-=h310",
        "//lh5.ggpht.com/wbu2vfnga5119Xuy3Va8oV1gpR0ODCy7LbOYmUgYSWjXY16CXGn9HY1vWviEI0Jnt__e=h310",
        "//lh3.ggpht.com/ElwMg8bubiVB33euotYaD_mpKxSrr7SXTsrMwamk3_SRZx1VYkqVT8-HvkQDqXvLWw=h310",
        "//lh6.ggpht.com/2j2QZqBbh473-2B3PfyQzv3TgnFEp_dO_WNyqqTgptNIg7dlHmBsX2c0k7IkNg4LmeY=h310",
        "//lh3.ggpht.com/XjVKlnESsjx8OiC2yeckOxajuimqwkaxaDKq_xpoUyZyYFMHmg896clh5uZn5Dz9Hg=h310",
        "//lh5.ggpht.com/BL3QfBu_gNIwAGYI2anKW-PRDSeXyHB4HHElZKOS-tSFehExRv8YTbuiryWYXQ4DN2Q=h310",
        "//lh6.ggpht.com/GS7XwKTngPVLyUxlDdHLjrMrUZS_aXBtO1O40uj1wuLmLLxGe1wGRMEpAi6IeoPovGo=h310",
        "//lh4.ggpht.com/f12bAfH6tFmG9m6-TiZWu6XvaHl1zwJOUFnm_qUkyj9JMusOHK863xDShK-I4nbflXM=h310",
        "//lh3.googleusercontent.com/wOhHXKN4gyK5-sJoghVk5Fir_tR_5bG0WXIsOgU_2YmIMNDYJiH3pLzYEI6D5XGRhA=h310",
        "//lh3.googleusercontent.com/amq3_RX7o7vRJp789nVTz5WqJx0AGSwBKscHnezuFQpyDSahZ1LK2WcRzTAPeS8c_g=h310"
    ],
    "video": "https://www.youtube.com/embed/AiS4V5NFOic",
    "comments": [
        "Used to like it but now doesn't work I paid for the pro version when I first got my Samsung gear live smart watch and this app worked great and looked great, but now I can't switch faces, the weather says 999 degrees, and the battery info doesn't update at all.  Pretty disappointing. I have tried uninstalling and re-installing but still have the same issues. Will change 1 star rating when app starts working how it's supposed to again.",
        "Nice watch face...just don't use OpenWeather I like the look of this watch face.  And I love all of the info it gives me right on the face itself. I originally had some issues with the weather not updating.  But once I switched the weather provide from OpenWeather to Yahoo,  everything was fine.  Would love to see more face options, otherwise a great app.",
        "Constant sync problem for weather update. Purchased pro version & only problem is weather. A MAJOR bug since it's a weather watchface. Must go into settings, change weather source, update weather then close out, then weather is ok. Tried clearing cache, reinstalling, same issues. On a positive note, the time is correct. I like the watchface but am very preturbed the weather problem is still an issue.",
        "Good watch face, weather sync bug This is a good watch face with a lot of customization options - if you pay. The only issue I've run across is the weather does not update coming off the charger. I have to go into the settings and change the update tome - then it updates fine. HTC 10 / Moto Sport",
        "I love the way this watch face looks. It's so clean and I love the color and customization options. I am having trouble figuring out if there's a way to update the weather on demand. So far I only see an option for the weather to update every hour. When I'm about to head out to do something I would love to be able to see what the temperature is and if it's raining.",
        "I really like this watch face, and I'd give it a full five stars but for one glitch that I see constantly. The face provides all the relevant and current weather information. It also provides battery meters for both the watch and the phone. Unfortunately, when the temperature exceeds 100F (which it does often here in Phoenix, AZ), the degrees symbol overlaps the watch icon. It's not a functional problem, but it does mess up the aesthetics of the face."
    ],
    "recentChanges": [
        "v4.1.5:",
        "❤ Improved App compatibility",
        "V4.1.3:",
        "❤ Improved App Stability",
        "V4.1.1:",
        "Improved Sync between Watch/Phone",
        "Improved Weather update from Yahoo/OpenWeather",
        "v4.1.0:",
        "❤ 2 New watchfaces",
        "❤ Weather Fix"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pizzaentertainment.weatherwatchface&hl=en&gl=us",
    "appId": "com.pizzaentertainment.weatherwatchface"
}