{
    "title": "Halloween Smart Watch App",
    "summary": "Download a rich watch face collection and design your own smartwatch skin!",
    "icon": "//lh3.googleusercontent.com/HeBDXuVptr3Mp05CAY7qAPlDStbbcB7fXqLo52BfUc1fjFTrhng8bom_y4s2F5zhRjpV=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4,
    "reviews": 35,
    "developer": "Thalia Photo Art Studio",
    "developerId": "7938158485537087527",
    "developerEmail": "thaliasandracorner@gmail.com",
    "updated": "January 16, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "If you are interested in technological innovations and want to design a watch face for your new smart device, we are glad to inform you that our brand new creation – Smart Watch App – allows you to create urbane skins which will suit your taste. A great collection of specially designed smart watch faces is at your disposal, wear a new design of your watch face free every single day! What makes our smart watch application unique is the fact that you can combine the elements the way you like and build innumerable unique skins for your smart watch. Style doesn't have anything to do with money, so get your watch faces for Android Wear™ for free and show your taste! Don't you think that it is a great idea to have a different wearable watch face on every occasion? Try it out now, and we are sure that you will immediately fall in love with our Smart Watch App! Download instantly!***How to set your watch face?***● Download smart watch application to your phone! ● Find the icon and simply click on it! ● Choose among beautiful preset skins and sync to your smartwatch!● Or design your own watch face!● Choose all watch face elements separately!● Choose a background, different hand styles, markers and widget styles! ● See the preview of each element combination!● Choose what you want to be shown when your watch face is in ambient mode!  ● When you're done, sync the app with your device! ● Both round and square watch faces supported! ***Where to find the watch face you've chosen?*** ● You can either find the Android Wear application on your phone and select our watch face from the list.● Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.● Wait a few seconds for the app to synchronize, be patient!Gear up with Smart Watch App, download the app to your phone and then sync software for smart watch.***Compatibility!***Make sure that your device runs on Android Wear operative system, otherwise you won't be able to use our application. Smart Watch App is compatible with all of the latest Android Wear devices including:  Moto 360 1Moto 360 2nd genHuawei WatchAsus Zen Watch 1 ,2 & 3 LG Watch UrbaneLG Watch Urbane 2nd EditionLG Watch R™LG G WatchFossil Q FounderCasio WSD-F10Tag HeuerSony Smartwatch 3Note: On occasion it takes some time for a watch face app to synchronize with your device. In case you're having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you're enjoying our watch faces we wouldn't mind getting a positive review. Thank you for understanding, enjoy using our app!    Contact us on: watchfacessupport@webelinx.comDisclaimer: Android™ is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "descriptionHTML": "If you are interested in technological innovations and want to design a watch face for your new smart device, we are glad to inform you that our brand new creation &#x2013; Smart Watch App &#x2013; allows you to create urbane skins which will suit your taste. A great collection of specially designed smart watch faces is at your disposal, wear a new design of your watch face free every single day! What makes our smart watch application unique is the fact that you can combine the elements the way you like and build innumerable unique skins for your smart watch. Style doesn&apos;t have anything to do with money, so get your watch faces for Android Wear&#x2122; for free and show your taste! Don&apos;t you think that it is a great idea to have a different wearable watch face on every occasion? Try it out now, and we are sure that you will immediately fall in love with our Smart Watch App! Download instantly!<br><br><br>***How to set your watch face?***<br><br>&#x25CF; Download smart watch application to your phone! <br>&#x25CF; Find the icon and simply click on it! <br>&#x25CF; Choose among beautiful preset skins and sync to your smartwatch!<br>&#x25CF; Or design your own watch face!<br>&#x25CF; Choose all watch face elements separately!<br>&#x25CF; Choose a background, different hand styles, markers and widget styles! <br>&#x25CF; See the preview of each element combination!<br>&#x25CF; Choose what you want to be shown when your watch face is in ambient mode!  <br>&#x25CF; When you&apos;re done, sync the app with your device! <br>&#x25CF; Both round and square watch faces supported! <br><br><br>***Where to find the watch face you&apos;ve chosen?*** <br><br>&#x25CF; You can either find the Android Wear application on your phone and select our watch face from the list.<br>&#x25CF; Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.<br>&#x25CF; Wait a few seconds for the app to synchronize, be patient!<br><br>Gear up with Smart Watch App, download the app to your phone and then sync software for smart watch.<br><br>***Compatibility!***<br><br>Make sure that your device runs on Android Wear operative system, otherwise you won&apos;t be able to use our application. Smart Watch App is compatible with all of the latest Android Wear devices including:  <br><br>Moto 360 1<br>Moto 360 2nd gen<br>Huawei Watch<br>Asus Zen Watch 1 ,2 &amp; 3 <br>LG Watch Urbane<br>LG Watch Urbane 2nd Edition<br>LG Watch R&#x2122;<br>LG G Watch<br>Fossil Q Founder<br>Casio WSD-F10<br>Tag Heuer<br>Sony Smartwatch 3<br><br>Note: <br><br>On occasion it takes some time for a watch face app to synchronize with your device. In case you&apos;re having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you&apos;re enjoying our watch faces we wouldn&apos;t mind getting a positive review. Thank you for understanding, enjoy using our app!    <br><br>Contact us on: watchfacessupport@webelinx.com<br><br>Disclaimer: Android&#x2122; is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "histogram": {
        "1": 7,
        "2": 0,
        "3": 1,
        "4": 5,
        "5": 22
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/KwIbKArjLlpevWKTJ0TrT3haQX9w5k5kcCk4DI5dltKksEC7oh79ytt70zKvKVxb9yY=h310",
        "//lh3.googleusercontent.com/yjpuSESLIo-1NsopAfHhG5ZKvDQ2Jw6SORXYnVAfKsU7QslFxoIelPP465BzjkqQoTh6=h310",
        "//lh3.googleusercontent.com/x7uZwnzXD--z27mVKR-8SdQb29kihMCMj06tD6dDh14o7ZtgtpXUHP8ETsG4f-EGJNI=h310",
        "//lh3.googleusercontent.com/j5-Tim0rMa8MQJWl4rR3pZej2rbwif7SXicL3XQFErRDJI0oWlBDDIthbSblPYwWOPY=h310",
        "//lh3.googleusercontent.com/0fgO0pa5RYsDj43VQlnKpErRFVXUGM3HylgnN2EVoUe9rd5PAypiJFMk3d4nDuem5CJa=h310",
        "//lh3.googleusercontent.com/7EsPSJWkGHK-XWb9qopUx1gp89ja17tDsuJfKttlnTSpaTbJ4yg7YT7I-LeW_taBohg=h310",
        "//lh3.googleusercontent.com/k0AljjwuUy0cB2CprutRR3cUYdZfJnshHWjgMt87iuuIM-yhnsEDQVjmJz9U-3sC0r4=h310",
        "//lh3.googleusercontent.com/Y-BShnC7-nmtmmHlw-TRgbMTnECSV7KgjS740t4Ilx-ReQD7dUkgUGCXe5bOtmTHmg=h310",
        "//lh3.googleusercontent.com/cZLJCAqktH9xdCGYFOpkwaJqlTlqRHJDFXlBSlHWmlH57FVGT4PKZaXFDe80HzxGHYCg=h310",
        "//lh3.googleusercontent.com/Rt_TlQNfVvATMoCuhhpm8EapYjn-xQ2yFrRwv1SydZ2CjSOQNCGh_E3v2Vaje96QNGg=h310",
        "//lh3.googleusercontent.com/kmtpV0pClxo_tUSsvUkOpDbf4SGxjTg-RZ09n0uln7i1xROOaNGdeSK5Adx1yddSkA=h310",
        "//lh3.googleusercontent.com/HwO-saflyRwiINSbQilzX4Ue79aw0HxwqyQaCe9p8QYC_YDWt2nuypm9hzx-5wkxPr4=h310"
    ],
    "comments": [
        "OK with me Greatly enjoyed the new watch app",
        "Just cool. Not a bunch of frills, but cool features and nice customization, especially for a free app. I think I'll look forward to what else this dev has to give. A pleasant surprise.",
        "The ads kill this app. A few ads are ok,  but there are to many apps on the phone."
    ],
    "recentChanges": [
        "- Minor enhancements",
        "- App optimized",
        "- Thank you for your feedback"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tpas.halloween.smart.watch&hl=en&gl=us",
    "appId": "com.tpas.halloween.smart.watch"
}