{
    "title": "Active Fitness",
    "summary": "Active Fitness is a fitness, health and GPS tracking app and social network.",
    "icon": "//lh5.ggpht.com/y7UEc_7n8431loftkDIL9LMhzvUb-gzbKMouXFMeB6J93OhALfdMn100WoljxjocowK_=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.9,
    "reviews": 184,
    "developer": "SEGBIT",
    "developerId": "SEGBIT",
    "developerEmail": "sdcpartnerlen@outlook.com",
    "developerWebsite": "http://activefitness.co",
    "developerAddress": "905 W Middlefield Rd\nMountain View, CA 94043",
    "updated": "July 27, 2017",
    "version": "5.9.1",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Active Fitness is a fitness, health and sport GPS tracking app and social network of more than a million users. Great for running, walking, cycling, hiking, mountain biking, skiing, snowboarding, urban sports, such as skateboarding, scooter and hundreds of other activities. Active Fitness motivates you by providing ways for sharing your activities with your buddies and friends. Active Fitness has leaderboards for any sports and activities and includes professionally designed training plans. Enjoy and stay fit! FEATURESTRACK YOUR RUNNING, CYCLING AND OTHER SPORTS The app will automatically track your runs, speed, goals and achievements, and present it in beautiful charts. You can share your stats with your friends.FRIENDS AND SOCIALConnect with your buddies through our social network.SET TRAINING GOALSSet workout goals to keep you motivated and compete with other members.BECOME A LEADERWatch stats and connect with the leaders with leaderboards.AUDIO AND VOICE COACHINGProvides audio cues and coaching.TRAINING PROGRAMSImprove your workouts with exclusive training programsINTERVAL TRAININGImprove your endurance with interval trainingSTATISTICSExtensive sports statistics and analyticsWATCHFACE AND ANDROID WEARCheck your runs on your wrist: includes support for Android Wear smart watches and a beautiful watchface.",
    "descriptionHTML": "Active Fitness is a fitness, health and sport GPS tracking app and social network of more than a million users. Great for running, walking, cycling, hiking, mountain biking, skiing, snowboarding, urban sports, such as skateboarding, scooter and hundreds of other activities. Active Fitness motivates you by providing ways for sharing your activities with your buddies and friends. Active Fitness has leaderboards for any sports and activities and includes professionally designed training plans. Enjoy and stay fit! <br><br>FEATURES<br><br>TRACK YOUR RUNNING, CYCLING AND OTHER SPORTS <br>The app will automatically track your runs, speed, goals and achievements, and present it in beautiful charts. You can share your stats with your friends.<br><br>FRIENDS AND SOCIAL<br>Connect with your buddies through our social network.<br><br>SET TRAINING GOALS<br>Set workout goals to keep you motivated and compete with other members.<br><br>BECOME A LEADER<br>Watch stats and connect with the leaders with leaderboards.<br><br>AUDIO AND VOICE COACHING<br>Provides audio cues and coaching.<br><br>TRAINING PROGRAMS<br>Improve your workouts with exclusive training programs<br><br>INTERVAL TRAINING<br>Improve your endurance with interval training<br><br>STATISTICS<br>Extensive sports statistics and analytics<br><br>WATCHFACE AND ANDROID WEAR<br>Check your runs on your wrist: includes support for Android Wear smart watches and a beautiful watchface.",
    "histogram": {
        "1": 27,
        "2": 12,
        "3": 15,
        "4": 30,
        "5": 100
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/1XcGUhu3_ehqtyqplXG2BQPbLt85fvW-FqvLV1TGGm5QXc9ZbmgOX72JgjnPzrgxfz4=h310",
        "//lh6.ggpht.com/rc2WGEYlIBYoX40mc5XINU6WsLqhUi4ykAcb-xbW64I2Oyacct8wDK6KdgWrubj1OADc=h310",
        "//lh4.ggpht.com/zq4hsChUJBIgbbyCCjUNSLaitVfbC4NpSB7jSpjS7vgJBA-NHZScrnUut44z47NZeg=h310",
        "//lh3.ggpht.com/pRiA7FyU3F7KzOrLS26tGaWixLE3PjUBp6PSeAG0w3t0vdDtaXGoxpQpaLJyRYEuPA=h310",
        "//lh5.ggpht.com/qKnq3eYqiiwwTEAN3Ci5Fpw9nmeIkYbE5P-7gpaXsMy9_WRTySwo0jKDfIGnZKJQvk8=h310",
        "//lh4.ggpht.com/dYj9SM3Y6Y7pT4bpZSWvtjvpsuqc8ObVbqCSsVk3YKg1_Qbx0IX1rWcgMNHEWkuyJ88=h310",
        "//lh3.googleusercontent.com/718b021qr2BzHcXWC-zcJpIIJoGcs853HUnnIOFW6jmm6-baa7OSTkcTloVI-5Iv9iOr=h310"
    ],
    "video": "https://www.youtube.com/embed/WsjuGPJCTyY",
    "comments": [
        "Thanks for keeping regular updates. Very good app for fitness.",
        "Great app",
        "Its a great app. 10/10 would run again.",
        "Great new update adds many features and improves performance. Weight tracker, maps, trail and photos have been updated.",
        "Last fixes are great. Active Fitness is my new companion app for running.",
        "Bloody thing keeps saying sorry ACTIVE FITNESS HAS STOPPED"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sdc.activefitness&hl=en&gl=us",
    "appId": "com.sdc.activefitness"
}