{
    "title": "JUMIA Online Shopping",
    "summary": "The online shop you can trust.",
    "icon": "//lh3.googleusercontent.com/dgBbcnrdX9rwpVADx8WczhKGlnVRd9y886uzUKGZfwerao83vvhvfWXmCe-RT5w6hIKK=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.2,
    "reviews": 118542,
    "developer": "JUMIA",
    "developerId": "8194392026252557243",
    "developerEmail": "android@jumia.com",
    "developerWebsite": "http://www.jumia.com",
    "developerAddress": "9 RUE DE MILAN PARIS 75009",
    "updated": "December 23, 2017",
    "version": "4.4.6",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "Looking for a safe and convenient means to shop? Download the Jumia Online Shopping App today for the best shopping experience. Great discounts, hassle free payment options, easy returns and 100% genuine items guaranteed!From fashion to electronics, find anything you need on Africa’s largest online shopping store. Enjoy a large selection of international and local brands to choose from  and shop 100% genuine products only at Jumia! Discover Africa's ultimate online shopping experience which combines convenience with safety and quality products at  the best prices.Payment made easy with secure payment options such as cash on delivery,  mobile money or pay using your credit card with our secured payment system Jumia Pay.Thanks to the Jumia App you will never miss out on sales and deals on mobile phones, fashion, electronics & many more every day! With the Jumia Shopping App, you get Customized shopping experience with a personalized feedBuyer protection Cross-platform shopping, whether on a smartphone, a tablet or even on a desktop, Jumia app will keep all the products on your cart as long as you are logged in to your account.No additional fee for MTN users in 15 countries while using Jumia AppOrder management from our call center, our call center will call you to inform about the status of your orderComplete security for all your credit card and bank transfers for a worry free shopping experience.Notifications on latest deals, flash sales and coupons (Look out for more than 10 annual sales!)Largest selection of products in Africa, over 2 millions items to shop for!International shopping experience from brands like  Apple, Canon, HP, Pampers, moulinex, L’Oreal, Samsung, Tefal and many more!Language and SupportOperating in more than 23 markets in Africa, the Jumia Online Shopping Application is available in Arabic, English and French. Our in house customer service strives hard to provide you with impeccable service to all your questions in English, French, Arabic or the respective regional languages of the countries.Your feedback is valuable:We always look forward to provide the best customer experience,  share your feedback with us to help us achieve that goal.Contact us :Nigeria ==> https://www.jumia.com.ng/contact/Ghana ==> https://www.jumia.com.gh/contact/Maroc ==> https://www.jumia.ma/contact/Egypt ==> https://www.jumia.com.eg/contact/Kenya ==> https://www.jumia.co.ke/contact/Côte d'Ivoire ==> https://www.jumia.ci/contact/Cameroon ==> https://www.jumia.cm/contact-us/** DISCLAIMER **We have been informed that our app is fraudulent advertised by third-party advertisers, mostly in the form of fake vouchers or offers. These ads are published without our consent and we condemn this behavior.If you encounter any of these issues, please help us and copy the page URL found and report it to mobile.apps@jumia.com.ng with subject \"Fraudulent Ad\" so that we can take the ad down.Keywords:jumia, online, shopping, africa, ecommerce, store, buy, shop, sale, mall, shoe, phone, fashion, discounts, online shopping, shopping mall, online shopping mall, online fashion, online fashion shopping, gadgets",
    "descriptionHTML": "Looking for a safe and convenient means to shop?<br> <br>Download the Jumia Online Shopping App today for the best shopping experience. Great discounts, hassle free payment options, easy returns and 100% genuine items guaranteed!<br><br>From fashion to electronics, find anything you need on Africa&#x2019;s largest online shopping store. Enjoy a large selection of international and local brands to choose from  and shop 100% genuine products only at Jumia! <br><br>Discover Africa&apos;s ultimate online shopping experience which combines convenience with safety and quality products at  the best prices.<br><br>Payment made easy with secure payment options such as cash on delivery,  mobile money or pay using your credit card with our secured payment system Jumia Pay.<br><br>Thanks to the Jumia App you will never miss out on sales and deals on mobile phones, fashion, electronics &amp; many more every day! <br><br>With the Jumia Shopping App, you get <br>Customized shopping experience with a personalized feed<br>Buyer protection <br>Cross-platform shopping, whether on a smartphone, a tablet or even on a desktop, Jumia app will keep all the products on your cart as long as you are logged in to your account.<br>No additional fee for MTN users in 15 countries while using Jumia App<br>Order management from our call center, our call center will call you to inform about the status of your order<br>Complete security for all your credit card and bank transfers for a worry free shopping experience.<br>Notifications on latest deals, flash sales and coupons (Look out for more than 10 annual sales!)<br>Largest selection of products in Africa, over 2 millions items to shop for!<br>International shopping experience from brands like  Apple, Canon, HP, Pampers, moulinex, L&#x2019;Oreal, Samsung, Tefal and many more!<br><br><br>Language and Support<br>Operating in more than 23 markets in Africa, the Jumia Online Shopping Application is available in Arabic, English and French. Our in house customer service strives hard to provide you with impeccable service to all your questions in English, French, Arabic or the respective regional languages of the countries.<br><br>Your feedback is valuable:<br>We always look forward to provide the best customer experience,  share your feedback with us to help us achieve that goal.<br><br><br>Contact us :<br><br>Nigeria ==&gt; https://www.jumia.com.ng/contact/<br>Ghana ==&gt; https://www.jumia.com.gh/contact/<br>Maroc ==&gt; https://www.jumia.ma/contact/<br>Egypt ==&gt; https://www.jumia.com.eg/contact/<br>Kenya ==&gt; https://www.jumia.co.ke/contact/<br>C&#xF4;te d&apos;Ivoire ==&gt; https://www.jumia.ci/contact/<br>Cameroon ==&gt; https://www.jumia.cm/contact-us/<br><br><br>** DISCLAIMER **<br><br>We have been informed that our app is fraudulent advertised by third-party advertisers, mostly in the form of fake vouchers or offers. These ads are published without our consent and we condemn this behavior.<br><br>If you encounter any of these issues, please help us and copy the page URL found and report it to mobile.apps@jumia.com.ng with subject &quot;Fraudulent Ad&quot; so that we can take the ad down.<br><br>Keywords:<br>jumia, online, shopping, africa, ecommerce, store, buy, shop, sale, mall, shoe, phone, fashion, <br>discounts, online shopping, shopping mall, online shopping mall, online fashion, online fashion shopping, gadgets",
    "histogram": {
        "1": 10800,
        "2": 3386,
        "3": 11183,
        "4": 20967,
        "5": 72206
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/aO2FEs840JtvcfBP2Q3UbetKe4mbDoY2WZS3oEUWOWOXTpYJgOTvsKUH7x1j8YjKig=h310",
        "//lh3.googleusercontent.com/grjPjsdIvClDtIQqvxXMF8hts5Zc8EX-7UBogvG2mbxOULoVEADVLzoAfcTxcvkiPxM=h310",
        "//lh3.googleusercontent.com/H8fN76L2BE0PFUaHJmmG3SQVtWpKMpykRrOplxYaq__FlDGKDPItvpdJjNlIC9unbM0=h310",
        "//lh3.googleusercontent.com/i1y6-RPIqB0yFrBtXcMXUiGap5Fhfsm2Cr6CEB27mA-geFXpbovsoThRaSiZjZkP-Q=h310",
        "//lh3.googleusercontent.com/Fd0Gxq0ds1PYNORbOHOv93u-vbroxnMqIeKReZ3vTQsBwAzO9ThlcZv3AgZ3_h_Wxj8C=h310",
        "//lh3.googleusercontent.com/UfXNAPputndFrqisgLQtEkRCe6OKBsmBN16efxsJEmmiUMDiQm_vD8mFpJwEf4BQbA=h310",
        "//lh3.googleusercontent.com/JeQj3PsPOx4XMv4lhDJ8nlG-9V_17JmFObS9HpeP-0-HHSZLVZjfP2vEF2xfMpR21CA=h310",
        "//lh3.googleusercontent.com/jtL6AnDEjvvNxqHmQ1GHnw6On7JNN5sgQTYgDGZADX4ZHsfdGX0yO5Y0UoYCwAlqW5k=h310",
        "//lh3.googleusercontent.com/R7t1O7FhIy4NWzpAUehdim7FWW42P8pcYTNbJVO02zGG14HVkbS1IWQK6welJTx4Q6pn=h310",
        "//lh3.googleusercontent.com/h81HBld5Dr7FaQdAtlibCISHFhjoGm4oJUPnB8yiNMd43I_KrKkNnYL3WoCYkkDUeyw=h310"
    ],
    "video": "https://www.youtube.com/embed/qXV65qxx05Y",
    "comments": [
        "The App is good, easy to use and products are fairly priced. However there is need to work more on the delivery of goods as some of the dispatch riders do not measure up. My goods were returned by one of them to the store and my order cancelled while I was still awaiting delivery and refund is yet to be received after two months, it's really frustrating sometimes.",
        "JUMIA KENYA have just become thieves or extortionist. How can you charge delivery cost more than a shipped item? Why did you change delivery Costs? That's y i simply look for an item on jumia, check specs,check prices, then i simply go to any best shop selling the same item and bargain downwards. Hence don't pay those hefty delivery charges. I have used jumia for 5yrs. But starting 2018 have changed tact.",
        "Great App for easy shopping experience. Though it needs to be permanently installed in my phone. I don't know why the App will always disappear back to play store.  That I have to always go back to play store, search for it, activate and open it before using. Kindly help me to know why this is always the case with me. And I use a very good Android phone bought from Jumia.",
        "Ben Nigeria! Well so far so good! Jumia is doing well for me, whenever I make order, I get response immediately and in short while I got it well parked.... Its an amazing experience for me.... D last order i made from jumia was brought by ZOOM, another company i guess, which left me with doubt, not untill I saw dat d package was truely from jumia..... Just think u should stop dat for security reason... Thanks Jumia for saving me from stress of getting stuffs .. I love Jumia",
        "Jumia is very reliable and I've known this online market to be very affordable but recently the shipping fees on Junia has really gone high, even when shopping for a single item, and some items are not even up to the shipping fee. This is not encouraging at all, I really love this app but one thing is, people consider shipping fees before  shopping and I really don't know what happened. Still the best shopping app though but I like the old Jumia.",
        "Hello am Mutaturu and just want to thank you for this innovative idea. At first I was doubting but came to have confidence when my placed order was fulfilled successful. Another thing is that I found Picking chargers to be a bit high especially when ordered for 3 items,last but not least THANK YOU JUMIA."
    ],
    "recentChanges": [
        "Hello Jumia Fans!",
        "We've worked on improvements on Login so that you can have a better shopping experience while buying on Jumia.",
        "Also we've done some performance improvements and bug fixing to improve our Jumia App!",
        "If you like these changes, please let us know by rating and reviewing us in the Google Play Store!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.jumia.android&hl=en&gl=us",
    "appId": "com.jumia.android"
}