{
    "title": "Dark Analog Watch Face",
    "summary": "Enjoy this watch face on your Android Wear. With more colors and options!",
    "icon": "//lh3.googleusercontent.com/YcZaqwxQsOzmgGgSPL8ryaKpjIl_xJ4P12jJ47QLLm7yXRmMfYkFmDfFaec4cOLqZA=w300",
    "price": "$2.70",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.3,
    "reviews": 6,
    "developer": "i3wear developers, S.L.",
    "developerId": "i3wear+developers,+S.L.",
    "developerEmail": "i3weardevelopers@gmail.com",
    "developerAddress": "C/ Travessera de Gràcia, nº 60, 2-1\n08006 Barcelona\nBarcelona",
    "updated": "July 1, 2015",
    "version": "1.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "A watchface with many possibilities. Dark Analog lets you modify the appearance of the screen. Inspired by Material Design of Google, this watchface will look great on your wearable with round or square screen of any density (LG Watch Urbane, LG G Watch R, Motorola Moto 360, Sony Smartwatch 3, Asus ZenWatch, Samsung Gear Live, …). If you know Dark Analog Free, you will feel the personalization experience more intensely. Dark Analog it includes a companion app for your smartphone (accessible from the Android Wear official application). Use it to configure your watch face. Choose from 8 selected colors! Whatever you like: Roman numerals (I, II, III, IV, ...).Add the date display (day and day of the week -abbreviated in the language you have set on your device associated with the watch-).Two styles of seconds hand: Long and together with the other needles, or small and in a separate area. You can also hide it.Emphasizes the design of the minute hand.If you already have your watch dials, or simply prefer, you can modulate the amount of indicators (complete, pointing only hours, or without).Give a different air disabling shadows or darkening the background, resulting in a more vibrant finish.Or try a brighter result selecting white background (the letters appear in black).If you use the ambient mode you can also choose between analog time and digital time. FEATURES  • 20 colors to customize the detail (ie, the color of the second hand and the dials).  • Shows the date on the screen.  • Add emphasis on the minute hand.  • Two styles of seconds hand.  • Enable / disable the shadows.  • Additional Roman numerals.  • Three contrast settings (dark, black or white).  • Choose the number of dials shown in interactive mode.  • Choose between watching digital or analog time in the ambient mode (pending notifications if any to read). All our watch faces are made with the latest development tools (API of Google and Android Wear). If you prefer to see how it looks on your device Analog Dark, try the Free version available on Google Play. DEVICE SPECS  • Smartphone: Android 4.3 (Jelly Bean) or higher.  • Wearable: Android 5.0 (Lollipop) or higher. IMPORTANTAfter installation expected to Android Wear application has loaded the new watch face. This process may take a few moments. For any questions or suggestions please contact us at the following email address: i3weardevelopers@gmail.com Your opinion is very important. If you have been satisfied with our design, we would appreciate a positive assessment of our application. ",
    "descriptionHTML": "A watchface with many possibilities. Dark Analog lets you modify the appearance of the screen. <br><br><br>Inspired by Material Design of Google, this watchface will look great on your wearable with round or square screen of any density (LG Watch Urbane, LG G Watch R, Motorola Moto 360, Sony Smartwatch 3, Asus ZenWatch, Samsung Gear Live, &#x2026;). <br><br><br>If you know Dark Analog Free, you will feel the personalization experience more intensely. Dark Analog it includes a companion app for your smartphone (accessible from the Android Wear official application). Use it to configure your watch face. Choose from 8 selected colors! <br><br><br>Whatever you like: Roman numerals (I, II, III, IV, ...).<br>Add the date display (day and day of the week -abbreviated in the language you have set on your device associated with the watch-).<br>Two styles of seconds hand: Long and together with the other needles, or small and in a separate area. You can also hide it.<br>Emphasizes the design of the minute hand.<br>If you already have your watch dials, or simply prefer, you can modulate the amount of indicators (complete, pointing only hours, or without).<br>Give a different air disabling shadows or darkening the background, resulting in a more vibrant finish.<br>Or try a brighter result selecting white background (the letters appear in black).<br>If you use the ambient mode you can also choose between analog time and digital time. <br><br><br><b>FEATURES</b><br>  &#x2022; 20 colors to customize the detail (ie, the color of the second hand and the dials).<br>  &#x2022; Shows the date on the screen.<br>  &#x2022; Add emphasis on the minute hand.<br>  &#x2022; Two styles of seconds hand.<br>  &#x2022; Enable / disable the shadows.<br>  &#x2022; Additional Roman numerals.<br>  &#x2022; Three contrast settings (dark, black or white).<br>  &#x2022; Choose the number of dials shown in interactive mode.<br>  &#x2022; Choose between watching digital or analog time in the ambient mode (pending notifications if any to read). <br><br><br>All our watch faces are made with the latest development tools (API of Google and Android Wear). <br><br><br>If you prefer to see how it looks on your device Analog Dark, try the Free version available on Google Play. <br><br><br><b>DEVICE SPECS<b><br>  &#x2022; Smartphone: Android 4.3 (Jelly Bean) or higher.<br>  &#x2022; Wearable: Android 5.0 (Lollipop) or higher. <br><br><br><b>IMPORTANT</b><br>After installation expected to Android Wear application has loaded the new watch face. This process may take a few moments. <br><br><br>For any questions or suggestions please contact us at the following email address: i3weardevelopers@gmail.com <br><br><br>Your opinion is very important. If you have been satisfied with our design, we would appreciate a positive assessment of our application. <br></b></b>",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 1,
        "4": 1,
        "5": 2
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/lTtpO433IGBd1LA89UFX23C3PiYgQtNFG5duehJY_gkyoETMHOyrN2yISImK1dU5H9U=h310",
        "//lh3.googleusercontent.com/7nC69x8vtPkhvdUWDuTR6NaylhqbpMB65m4SQf5ZzU8v2aXJmXxk_6Qan_NhH5j9k_I=h310",
        "//lh3.googleusercontent.com/ccFTvipCaZebQHsVBhYjJpsFJHisPRjRQtglNG2e4K5F-8zYHBPy8F_pkAMfvNVO8w=h310",
        "//lh3.googleusercontent.com/DwkHoI3fKseeJ2Ow3mJCaTZ1D-Ps95AIUwWAn9iZ4MfTy-84dCt5TjsCC3SG9evm1E8=h310",
        "//lh3.googleusercontent.com/8TZe3C4mFbCWX3ktGbBeBVSyEvU2qzUoZysNPA8MXqtfHT8lFswjyyeExGMjS3N1Cc8=h310",
        "//lh3.googleusercontent.com/EsvRB6Y7DHGSAnKGfJQMp6wZRB9ND9VgGm2-YbBTo3w92xKyvqJGo2Bd20N9kI5ncA=h310",
        "//lh3.googleusercontent.com/l2WKBoK83bVxX_OF2WJSLmWfHpQKOw6a6Gq0ZWwipVeNRYTHVippjgccEmx1Lt7exg8=h310",
        "//lh3.googleusercontent.com/qfN_m0zIPqUNf6kVDEBaIrCuPm7U8E_3iH_00Rl5-_zq7WBSreeDjxv-wgczkBkxinlN=h310"
    ],
    "comments": [
        "Love the style but I get constant crashes after a week of use.",
        "Please add  battery indicators"
    ],
    "recentChanges": [
        "- Material Design in pre-lollipop devices!",
        "- Update for Google Play Services 7.5"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.i3wear.darkanalog&hl=en&gl=us",
    "appId": "com.i3wear.darkanalog"
}