{
    "title": "Orbicular Watch Face for Wear",
    "summary": "Orbicular is a modern analog face with fantastic on and off animation pattern",
    "icon": "//lh5.ggpht.com/XNhapANs_JARU4dOvosmkXL6JsqqSZth3T-wgW2jICMKCJNZl9v04vW0XD0a6lorHA=w300",
    "price": "$1.04",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 2.7,
    "reviews": 6,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "January 23, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": " Model Number FR-A09 Orbicular Watch Face is a modern analog hybrid watch face with a huge number of settings and a fantastic on and off animation pattern. It can be customized to be very information dense including the date, email and watch battery status. Or you can make it as simple as you like. Ambient mode and regular mode can be customized. Discover the orbicular nature in you.It also notifies you about the unread messages or emails and that you select to display right on your watch screen so you can know what’s left unread.This watch face is happening and combined with modern functions of Android Wear. Key custom features:- • Latest Weather updates• Unread messages/emails notification• Ultimate readability • Clean and simplistic look • Date and time information • Remaining battery life of your device so you exactly know when to chargeThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watchface collection for Android Wear on our website www.frilldroid.com. How it works? Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Select notification preferences to see the unread messages or emails. Also select the weather background as wallpaper or solid colors.Get this app now and provide us your feedback :)",
    "descriptionHTML": "<b> Model Number FR-A09 </b><br>Orbicular Watch Face is a modern analog hybrid watch face with a huge number of settings and a fantastic on and off animation pattern. It can be customized to be very information dense including the date, email and watch battery status. Or you can make it as simple as you like. Ambient mode and regular mode can be customized. Discover the orbicular nature in you.<br><br>It also notifies you about the unread messages or emails and that you select to display right on your watch screen so you can know what&#x2019;s left unread.<br>This watch face is happening and combined with modern functions of Android Wear.<br><b> Key custom features:- </b><br>&#x2022; Latest Weather updates<br>&#x2022; Unread messages/emails notification<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Date and time information <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watchface collection for Android Wear on our website www.frilldroid.com.<br><br><b> How it works? </b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Select notification preferences to see the unread messages or emails. Also select the weather background as wallpaper or solid colors.<br>Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 2,
        "2": 1,
        "3": 1,
        "4": 1,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/M3fVXj0E2ML4axEJBcJxq3gsdYYIzUbNzoo771r9In381_frFQ3JdHl8u_zcGOwiW_o=h310",
        "//lh6.ggpht.com/FceJFLTwjMBwRrqz9ryewjvshRdLwUbUHeva0yqkUjoq4ZURKCxHtHpQgXXRxfQm_LCI=h310",
        "//lh5.ggpht.com/y890LPb7et5sajWD4odl1A798p452NqTBSe4r4EdKOUAkylbTt8QIXdZWJ_fmGXcpA=h310",
        "//lh6.ggpht.com/fCgQTB3bgin0p_-WPYHa4mUhi63D7QndYa40HRbUcS4tvqRRSUIAcn6-r-uSwGYybDaY=h310",
        "//lh6.ggpht.com/XwuBDE38uUWIme9aqDOsDkN-kyFnP-HbvLj_C3C7b1vQK2EvhmK3cYjNo7tqrudt5b7e=h310",
        "//lh4.ggpht.com/wcOw2vvGEsE3OkY4ScGYGvxE3oTSkNhJbUI5JtEqJgvnqFD0gSAIhxpfz7ZcbrM9ITB0=h310"
    ],
    "comments": [
        "Looks great, but needs improvement. The watch face looks amazing, but there is some issues that need to be fixed: 1. The ambient mood keeps the color of the watch face so that's drain the battery faster. 2. Please give us the option for the weather unit F°/C° and it should update more often and that's apply to the mail icon as well.",
        "Force closes everytime"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.fra09&hl=en&gl=us",
    "appId": "com.frillroid.fra09"
}