{
    "title": "Facer Watch Faces",
    "summary": "The ultimate watch face customization platform for smartwatches",
    "icon": "//lh3.googleusercontent.com/S_uuQu2pL1-I3f5nv2lnv3DVSJQDlKpCjvgSl-_HtRa0IzaCF_R8dLp7AHpZAu7VsPk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 24205,
    "developer": "Little Labs, Inc.",
    "developerId": "5837919682648806204",
    "developerEmail": "facer-support@little-labs.com",
    "developerWebsite": "https://www.facer.io/",
    "developerAddress": "373 Rose Ave\nVenice, CA 90291",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Facer Watch Faces is the ultimate watch face customization platform for Android Wear & Tizen smartwatches. Facer offers everything you need to customize & personalize your Android Watch or Gear S2/S3, including 15,000 free and premium watch faces from leading brands and artists. You can even make your own watch faces and share them with the world using the creator tool. Don’t be default, Facer offers everything you’ll need to bring your personal style to your smartwatch. FACER NOW SUPPORTS GEAR S2 & S3 DEVICESInstallation tips for Gear S3 & Gear S2 users:*Download & Install “Facer” app from the Google Play App store*Make sure your Gear S3 or Gear S2 is connected with your smartphone through the “Samsung Gear” app & bluetooth is turned on for both your phone and smartwatch*Download & Install “Facer Companion for Gear S2 & S3” from the Samsung Galaxy App Store*Long press on your Gear S2/S3 smartwatch and scroll to select “Facer” as your chosen watchface*Open the Facer App from your phone and enjoy the full Facer experience with over 15,000 watchfaces or create your own using our world-renowned Facer Creator at www.facer.io/creator FEEDBACK & TROUBLESHOOTING*If you’re having any issues using our app & watch faces or are dissatisfied in any way, please give us a chance to fix it for you before expressing dissatisfaction through ratings.  *You can send feedback directly to facer-support@little-labs.com *If you are enjoying our watch faces, we always appreciate a positive review15,000 WATCH FACESThe largest single destination for free and premium faces, there is something for everyone in our vast collection.  Explore the newest & most popular watch faces or use the new search feature to discover the perfect watch face for your mood.TOP BRANDSFind hundreds of premium faces from the world’s leading brands like Tetris™, Star Trek, Garfield, Ghostbusters, American Dad and more. There are new brands being added all the time so keep an eye out for new watch faces.ORIGINAL DESIGNSFacer curates collections of original designs from talented watch face designers to bring you the most beautiful and dynamic faces available for Android Wear.PUBLISH YOUR WATCH FACE DESIGNS WITH FACER!Want to create your own watch face designs & publish them through Facer, reaching thousands of smartwatch users?  If so, we’re looking for talented artists to join our growing community of Facer-certified designers.  Find out more by contacting us at facerdesigners@little-labs.comMAKE YOUR OWN WATCH FACEMake your own watch faces with our powerful web-based editor at https://www.facer.io/creator (note: view on your laptop or desktop for full functionality). Facer Creator Features include:*Import and edit any image you’d like*Included free watch hands and weather icon collection*Large custom font collections*Numerous Time and Date layouts*Interactive and Animated Design capabilities*Weather Conditions with Fahrenheit and Celsius support*Battery Level, Step Counter, Wifi Indicator, and Dynamic BackgroundsCOMPATIBLE WITH ALL ANDROID WEAR WATCHESFacer watch faces are compatible with all of the latest Android Wear devices, including Nixon Mission, Polar m600, Michael Kors Smartwatch, Asus Zenwatch 3, Moto 360 Sport, Casio WSD-F10, Tag Heuer Smartwatch,  Moto 360 1 & Moto 360 2nd gen, Huawei Android watch, Asus Zen Watch 1 & 2, Sony Smartwatch 3, LG G Android watch, LG G R Android watch, LG Urbane smartwatch, Samsung Gear smartwatch and moreCONNECT*Facer Creator & Community: www.facer.io*Google+ Community: https://plus.google.com/communities/107456884368395361653*Twitter: https://twitter.com/GetFacer*Instagram: https://instagram.com/getfacer/",
    "descriptionHTML": "Facer Watch Faces is the ultimate watch face customization platform for Android Wear &amp; Tizen smartwatches. Facer offers everything you need to customize &amp; personalize your Android Watch or Gear S2/S3, including 15,000 free and premium watch faces from leading brands and artists. You can even make your own watch faces and share them with the world using the creator tool. Don&#x2019;t be default, Facer offers everything you&#x2019;ll need to bring your personal style to your smartwatch. <br><br><br><b>FACER NOW SUPPORTS GEAR S2 &amp; S3 DEVICES</b><br>Installation tips for Gear S3 &amp; Gear S2 users:<br><li>*Download &amp; Install &#x201C;Facer&#x201D; app from the Google Play App store<br></li><li>*Make sure your Gear S3 or Gear S2 is connected with your smartphone through the &#x201C;Samsung Gear&#x201D; app &amp; bluetooth is turned on for both your phone and smartwatch<br></li><li>*Download &amp; Install &#x201C;Facer Companion for Gear S2 &amp; S3&#x201D; from the Samsung Galaxy App Store<br></li><li>*Long press on your Gear S2/S3 smartwatch and scroll to select &#x201C;Facer&#x201D; as your chosen watchface<br></li><li>*Open the Facer App from your phone and enjoy the full Facer experience with over 15,000 watchfaces or create your own using our world-renowned Facer Creator at www.facer.io/creator <br><br><br><b>FEEDBACK &amp; TROUBLESHOOTING</b><br></li><li>*If you&#x2019;re having any issues using our app &amp; watch faces or are dissatisfied in any way, please give us a chance to fix it for you before expressing dissatisfaction through ratings.  <br></li><li>*You can send feedback directly to facer-support@little-labs.com <br></li><li>*If you are enjoying our watch faces, we always appreciate a positive review<br><br><br><b>15,000 WATCH FACES</b><br>The largest single destination for free and premium faces, there is something for everyone in our vast collection.  Explore the newest &amp; most popular watch faces or use the new search feature to discover the perfect watch face for your mood.<br><br><br><b>TOP BRANDS</b><br>Find hundreds of premium faces from the world&#x2019;s leading brands like Tetris&#x2122;, Star Trek, Garfield, Ghostbusters, American Dad and more. There are new brands being added all the time so keep an eye out for new watch faces.<br><br><br><b>ORIGINAL DESIGNS</b><br>Facer curates collections of original designs from talented watch face designers to bring you the most beautiful and dynamic faces available for Android Wear.<br><br><br><b>PUBLISH YOUR WATCH FACE DESIGNS WITH FACER!</b><br>Want to create your own watch face designs &amp; publish them through Facer, reaching thousands of smartwatch users?  If so, we&#x2019;re looking for talented artists to join our growing community of Facer-certified designers.  Find out more by contacting us at facerdesigners@little-labs.com<br><br><br><b>MAKE YOUR OWN WATCH FACE</b><br>Make your own watch faces with our powerful web-based editor at https://www.facer.io/creator (note: view on your laptop or desktop for full functionality). <br><br><br><b>Facer Creator Features include:</b><br></li><li>*Import and edit any image you&#x2019;d like<br></li><li>*Included free watch hands and weather icon collection<br></li><li>*Large custom font collections<br></li><li>*Numerous Time and Date layouts<br></li><li>*Interactive and Animated Design capabilities<br></li><li>*Weather Conditions with Fahrenheit and Celsius support<br></li><li>*Battery Level, Step Counter, Wifi Indicator, and Dynamic Backgrounds<br><br><br><b>COMPATIBLE WITH ALL ANDROID WEAR WATCHES</b><br>Facer watch faces are compatible with all of the latest Android Wear devices, including Nixon Mission, Polar m600, Michael Kors Smartwatch, Asus Zenwatch 3, Moto 360 Sport, Casio WSD-F10, Tag Heuer Smartwatch,  Moto 360 1 &amp; Moto 360 2nd gen, Huawei Android watch, Asus Zen Watch 1 &amp; 2, Sony Smartwatch 3, LG G Android watch, LG G R Android watch, LG Urbane smartwatch, Samsung Gear smartwatch and more<br><br><br><b>CONNECT</b><br></li><li>*Facer Creator &amp; Community: www.facer.io<br></li><li>*Google+ Community: https://plus.google.com/communities/107456884368395361653<br></li><li>*Twitter: https://twitter.com/GetFacer<br></li><li>*Instagram: https://instagram.com/getfacer/</li>",
    "histogram": {
        "1": 2539,
        "2": 1158,
        "3": 1643,
        "4": 5284,
        "5": 13581
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FVDGeIaUYAht2SApSi52PGXDN-m0lfKiX1X-aecWSjuAeJ0wwIOxUHOwGt1hr1SAovc=h310",
        "//lh3.googleusercontent.com/LYUkgXj2yTjlBfud-x7RgmLIlPjz2xNxUALKqC0ipBRB9KJgMHuD1hui7D0UX6I4Eg=h310",
        "//lh3.googleusercontent.com/yeEuCKc06uFZMnvwhe19Pq4ZXIii4XNkeFTf3T9fGtJO7SZOOnUSgqxyUzylVsGRVtc=h310",
        "//lh3.googleusercontent.com/BAViK0_6z-Bpki96vgESRLsn1xbQUrIsBi-k_9KYtLYfriQVuU4RB4OiBaKoJSrLTmo=h310",
        "//lh3.googleusercontent.com/kquYmJMJ715NtXRnzHC-JFmoAZvEKdQbOg2DxXfaBKcKmPIycmIRTvxefNTRxgQXGQ=h310",
        "//lh3.googleusercontent.com/rOFuqfmZB4ZffBu9A_-M59QWTwJYk7-u2r-nOt4ZPI75q2eSiVyKfP0SENU9za3z5A=h310",
        "//lh3.googleusercontent.com/xZfZo4CjfJ8ZInGnE7wYTUH_KIFf1llr2gGO5XfsLxduXSuSJkBE8i9dJkcdHn54N1gv=h310",
        "//lh3.googleusercontent.com/DlpARGQIfzsRQhbu2UxigoWnyxGc7lsgfSVaOiMRI8_jW9OVeKq6uyMFh6OxWOfLRxE=h310",
        "//lh3.googleusercontent.com/6bt_fLmu0qDCRSPCKlrcddkgtotdUTrlEohIl8f41PGakWFYxLnVWdeOKWpkOI_v6CEF=h310",
        "//lh3.googleusercontent.com/bm8u8E3HSe4_RKUuWZasB4dxTFGPj70VWZy4nwu2CkvYh_2CCEJ_DUdShmPHTO9CS-M=h310",
        "//lh3.googleusercontent.com/VfAfa8cPxZKeGvI33YQVn6JOliXqfAesa4tstGNupxCpwq0WjT3W2JGHnmOo6pIBKY1q=h310",
        "//lh3.googleusercontent.com/YU6pdjpItgA7tZxUiTKyJK0vF2O-fPT3ZXLJiXMpq_yl5HAqIa2N6sXR6C6T5cR_duLG=h310",
        "//lh3.googleusercontent.com/HWFbsCMLkRposxV_N8qqNG7INbCXXTLF345Wz8MRNm99mSCxqX7_MLbHEzaHnsE2kdQ=h310",
        "//lh3.googleusercontent.com/WIgDCrcTazhW3omQAtChQc9JSFmcqUL5kOVotUGvUU88wzpiIl-GtEFVpJQj-CaI7DE=h310",
        "//lh3.googleusercontent.com/UEjPCoQ1gA2Zv1_9JGb3421i17YJ8Vnbs-NSdVe-bGB0F9Eo2Pwb7MXJpFLMeu-OwTY=h310"
    ],
    "video": "https://www.youtube.com/embed/6dFmzNnd0f8",
    "comments": [
        "Galaxy Gear S3 Frontier.  They really need to fix the syncing issue after the Tizen 3.0 update.  I have to uninstall and reinstall both the app and companion app everytime in order to get sync to work. Nothing else suggested works for me. And then it only works once.    If they fix this then it's a 5 star review.",
        "The faces are awesome... i love the Swiss like sweeping hands but with my gear s3 4g I CAN'T use it.... Anytime i type with the watch the watch face resets to facer logo and freezes up... Am i the ONLY ONE??",
        "This app has the BEST watch faces but they keep kicking me out of my Gear S3! This is a PAIN when the face goes back to one of the Galaxy faces! Thanks for the response, however it still kicks me back to the Samsung face. I'll upgrade the score because there are some GREAT faces but I would LIKE to USE them for extended time.",
        "+Very beautiful watchfaces. -The favorite section is only showes the last  250 favorited watches. -The shuffle mode is not working properly for the favorites section. -The Report an issue menuitem has removed from the Settings menu.",
        "Awesome app. I have never had  more fun changing watch faces! Huge selection of free faces and the paid ones are cheap and worth it.",
        "Can't rate watchfaces, no full-color ambient mode, doesn't vibrate hourly, must return to menu to go to next watchface, often doesn't vibrate when syncing watchfaces, poor business model/practices (paid for this, now it's free, no refund, rejected by Google, original dev, and current dev), spams you with unsolicited e-mails and notifications, and watchfaces often constantly blink indefinitely. Update 1: deducted 1 star because it lost all my watchfaces, can't re-import them, and support apparently is clueless and just ignores you."
    ],
    "recentChanges": [
        "- New: Trending searches!",
        "- New: Voice search!",
        "- More dynamic Top Charts section",
        "- More dynamic “featured designers” section",
        "- Direct link to sign up to the beta",
        "- Misc bug fixes and optimizations"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.jeremysteckling.facerrel&hl=en&gl=us",
    "appId": "com.jeremysteckling.facerrel"
}