{
    "title": "Stealth360 Watch Face",
    "summary": "Stealth360 is a very clean minimal watch face with a modern design and options.",
    "icon": "//lh3.googleusercontent.com/qBfC9Bw5uwNNjebtYPceuSQlgy1XeWx0tA8yu2cYEZxEweQBA8k5LiMwsqlYUe4CUNg=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.8,
    "reviews": 555,
    "developer": "FlyingRhinoCMG",
    "developerId": "7887614789099105897",
    "developerEmail": "flyingrhinodev@gmail.com",
    "developerWebsite": "http://flyingrhinocmg.com",
    "developerAddress": "11850 MLK St. N. St. Petersburg, FL 33716",
    "updated": "July 9, 2016",
    "version": "5.3",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Stealth360 watch face is a very clean minimal watch face with an accent of colorDesigned to make your smart watch minimal yet refined. FEATURES:• Different ambient modes (in watch settings)• Savable custom presets with backup to drive.• Interactive widget app shortcuts• Interactive tap to cycle option to turn off• 12 / 24 hour formats• New layout for easier customization• Hex color now available when choosing colors• Battery and Date indicator • Dark and Light themes• Blue, Red and Green color preset options• Change all element colors to color of your choice.• Tick and sweep second hand• Toggle battery and date widgets visibility• Google Fit compatible• Custom Text \"Logo\" • Live preview of settings on phoneSupport for square (G Watch, Gear Live, ZenWatch etc.) and round (Moto 360, G Watch R etc.) displays.INSTALL NOTES:This face is built to the latest google services if your not updated it triggers the update on your watch. The face will install on your watch after it finishes installing the updates.  You could have several updates pending. After installing the application, new styles of watches appear in the menu selection of watch faces in your Android Wear after 10-20 seconds. If you encounter problems with the installation of watch faces on Wear, please go to the android wear app -> Settings and \"Resync apps\". *** Please contact me directly if you have any questions about this watch face. Thanks!",
    "descriptionHTML": "<b>Stealth360 watch face is a very clean minimal watch face with an accent of color</b><br>Designed to make your smart watch minimal yet refined. <br><br><b>FEATURES:</b><br>&#x2022; Different ambient modes (in watch settings)<br>&#x2022; Savable custom presets with backup to drive.<br>&#x2022; Interactive widget app shortcuts<br>&#x2022; Interactive tap to cycle option to turn off<br>&#x2022; 12 / 24 hour formats<br>&#x2022; New layout for easier customization<br>&#x2022; Hex color now available when choosing colors<br>&#x2022; Battery and Date indicator <br>&#x2022; Dark and Light themes<br>&#x2022; Blue, Red and Green color preset options<br>&#x2022; Change all element colors to color of your choice.<br>&#x2022; Tick and sweep second hand<br>&#x2022; Toggle battery and date widgets visibility<br>&#x2022; Google Fit compatible<br>&#x2022; Custom Text &quot;Logo&quot; <br>&#x2022; Live preview of settings on phone<br><br><i>Support for square (G Watch, Gear Live, ZenWatch etc.) and round (Moto 360, G Watch R etc.) displays.<br><br><b>INSTALL NOTES:</b><br><br>This face is built to the latest google services if your not updated it triggers the update on your watch. The face will install on your watch after it finishes installing the updates.  You could have several updates pending. <br><br>After installing the application, new styles of watches appear in the menu selection of watch faces in your Android Wear after 10-20 seconds. If you encounter problems with the installation of watch faces on Wear, please go to the android wear app -&gt; Settings and &quot;Resync apps&quot;. *** Please contact me directly if you have any questions about this watch face. Thanks!</i>",
    "histogram": {
        "1": 52,
        "2": 37,
        "3": 82,
        "4": 162,
        "5": 222
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/zEc33G4yv3jqk1J7fJyph1ZtotaHvPmvB_QKjrCFjXGomdPq_7tuB2MFFleA-YE3uqQ=h310",
        "//lh3.googleusercontent.com/fIzbWEBQ9OvciOBhFA00QE6tnJ5-s84L6OhtyrvKPP7D4BLaKCPyHufc19Vrm55eag=h310",
        "//lh3.googleusercontent.com/xCBB4fmW2pG1lvo4Qi6ebZNnBJTrxd1LW4vmuictqxLrO6MVQBGmLz3PtsVXQcgEAz0=h310",
        "//lh3.googleusercontent.com/tsEQmevj7nPh7TI5wSNswQ4T2W6i6wI1b41SLXn1fmLXRT-DgUmyxrEiUMWXz5GFe6k=h310",
        "//lh3.googleusercontent.com/2O4EgKwuUnDAuJRlj5Zg0CxSgVvA4LJU1bKbIpJyUOSlWn1c-CL32RlMv2_MeiOe6315=h310",
        "//lh3.googleusercontent.com/P0T26XDIdxIEpnu700w5UVlqCz8sKvGafVSXN-eetYrHxtpYmh4ddaYkV7NxAJEN2nP3=h310",
        "//lh3.googleusercontent.com/qkJLz8ukLnv0lfzXRjodx8yFn0v3n0Zbc4suiB7rH1rASUg-rYFzuw0CYygFQn6cQrM=h310"
    ],
    "comments": [
        "Favorite watch face, when it used to appear... This was one of the best watch faces I had used. Loved the customization with colors, widgets, and the power saver mode made for great battery life! However when I switched to a new phone and everything from the watch to the app and android wear updated & upon trying to pair no matter how many times I reinstall and repair and resync everything the watch face doesn't appear in android wear :( . This is on the Moto 360 2 but I think the issue is with either Android Wear or this watch face app.",
        "Doesn't Show In App Drawer / Unable To Open Or Use I originally couldn't use the face because my Huawei Watch was stuck on an old version of Google Play Services but Jose (the dev) helped me get it up to speed. Now I can use the face but the app isn't showing in my app drawer so I'm stuck with red. Hopefully there's a fix. Jose has veen very responsive so I have high hopes. If so I'll update this review.",
        "Great face.  My favorite thing about this face is I get absolutely stellar battery life while using it.  I've bought a lot of faces and I normally never get more than 30 hours on my Huawei watch and usually less than 30 but with this face I get over 40 hours and that's with using always on and max brightness. It's a great indoors face as well since it's dark.",
        "Getting worse with each update Much like the minimus360, each iteration of updates is making this watch face worse. So much more bugs now. Watch face doesn't load after watch has restarted/powered back on. Glitches with the colour scheme from time to time and battery life of the watch is now worse than before..",
        "Weather?? Love this and the easy simple customization exactly, what I wanted. But weather isn't working. Google now weather is on. Enabled on the watch. Downloaded other weather apps for my Huawei watch still won't show weather. Will update once I either figure it out or an answer is given................................. EDIT: got it to show weather. Using custom rom/kernel on my Huawei watch. Had to reflash everything clean and ensure the weather app was working and put watch face on working perfect now.",
        "Weather doesn't work I like the watch face and the custom options.  However the app is a little buggy and the weather does not work on my LG Urbane with OnePlus One phone.  It does work with other watch faces that I've used.  Going to try my first refund in play store.  If the weather works in the future, may try it again."
    ],
    "recentChanges": [
        "• Moto360 background fix"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.flyingrhinocmg.watchface_stealth360&hl=en&gl=us",
    "appId": "com.flyingrhinocmg.watchface_stealth360"
}