{
    "title": "Hindu Watch Face",
    "summary": "Daily changing Watch face that features beautiful images of Hindu Gods",
    "icon": "//lh3.googleusercontent.com/-8v1qkYFGE1bQTUdGnwj_EoXi9ujn3AMkVAc40ZXIxczwEApPOk6m5FcE3kfAGIw2ZY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.9,
    "reviews": 7,
    "developer": "KJSK Developers",
    "developerId": "KJSK+Developers",
    "developerEmail": "kjsk.developers@gmail.com",
    "updated": "September 23, 2016",
    "version": "1.5",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Begin your day with an exhilarating experience by seeking the blessings of the Almighty. Each of the seven days in a week has a special significance and is dedicated to one or more Hindu gods or goddesses. Through this app our aim is to pave the path of the divine for the devotees by bringing the beautiful images of gods on your smart watch and to begin each day with a purpose.Presenting \"Hindu Watch Face\" which is a unique and intelligent Smart Watch application that features beautiful watch faces with best in class User Interface for customization. The carefully crafted design of the app syncs up your mobile and your smart watch seamlessly and provides rich user experience making it simple and easy to use.The unique features of this Smart Watch app are:•\tWatch Face changes automatically every day of the week dedicated to a particular lord•\tMultiple images available for each day that can automatically change every hour, 2 hours, 4 hours etc. based on your preference•\tCompletely customizable to choose any Watch Face for any particular day or set as permanent for every day•       High Quality and Beautiful images of various Hindu Gods(Lord Shiva, Lord Ganesha, Lord Krishna, Lord Rama, Goddess Durga, Goddess Laxmi, Goddess Santoshi Maa, Lord Hanuman, Lord Surya Dev etc.) are available.Each day in a week has a specialty and apart from the special Vratas and Upvaas, there are numerous folklores associated with the fasting observed on the days of the week. MondayMonday is dedicated to Lord Shiva. Fulfils all your wishes and desires.TuesdayTuesday is dedicated to Lord Ganesha, Durga, Goddess Kali and Lord Hanuman. Overcomes all obstacles in your path. WednesdayWednesday is dedicated to planet Mercury and Lord Vithal, an incarnation of Krishna. The day is highly auspicious for starting new ventures and it is believed that those who observe the Vrat are bound to get blessed with fortunes. ThursdayThursday is dedicated to Lord Vishnu and his incarnations. Helps to attain good luck and prosperityFridayFriday is dedicated to Mother Goddess – Mahalakshmi, Santhosi Ma, Annapuraneshwari and Durga. Helps to attain wealth and prosperitySaturdaySaturday is dedicated to alleviating the bad influence of Lord Shani. Lord Hanuman is also worshipped on Saturdays. In the Ramayana, it is mentioned that Lord Hanuman frees the Navagrah Devatas from the captivation of Ravan. Pleased by this, Shani Deva gives a boon to Hanumanji that, whoever worships Hanumanji on Saturdays (the day attributed to Shani), will be saved from Shani's wrath.SundaySunday is dedicated to Lord Surya (Sun God). Make sure you offer water to the sun, and chant the Gayatri Mantra on Sunday morning.It must be noted here that the deity worshiped on a particular day might vary from region to region and community to community.So what are you waiting for? Download this special and unique app “Hindu Watch Face” and give your life a special meaning!!",
    "descriptionHTML": "Begin your day with an exhilarating experience by seeking the blessings of the Almighty. Each of the seven days in a week has a special significance and is dedicated to one or more Hindu gods or goddesses. Through this app our aim is to pave the path of the divine for the devotees by bringing the beautiful images of gods on your smart watch and to begin each day with a purpose.<br><br>Presenting &quot;Hindu Watch Face&quot; which is a unique and intelligent Smart Watch application that features beautiful watch faces with best in class User Interface for customization. <br>The carefully crafted design of the app syncs up your mobile and your smart watch seamlessly and provides rich user experience making it simple and easy to use.<br><br>The unique features of this Smart Watch app are:<br>&#x2022;\tWatch Face changes automatically every day of the week dedicated to a particular lord<br>&#x2022;\tMultiple images available for each day that can automatically change every hour, 2 hours, 4 hours etc. based on your preference<br>&#x2022;\tCompletely customizable to choose any Watch Face for any particular day or set as permanent for every day<br>&#x2022;       High Quality and Beautiful images of various Hindu Gods(Lord Shiva, Lord Ganesha, Lord Krishna, Lord Rama, Goddess Durga, Goddess Laxmi, Goddess Santoshi Maa, Lord Hanuman, Lord Surya Dev etc.) are available.<br><br><br>Each day in a week has a specialty and apart from the special Vratas and Upvaas, there are numerous folklores associated with the fasting observed on the days of the week. <br>Monday<br>Monday is dedicated to Lord Shiva. Fulfils all your wishes and desires.<br>Tuesday<br>Tuesday is dedicated to Lord Ganesha, Durga, Goddess Kali and Lord Hanuman. Overcomes all obstacles in your path. <br><br>Wednesday<br>Wednesday is dedicated to planet Mercury and Lord Vithal, an incarnation of Krishna. The day is highly auspicious for starting new ventures and it is believed that those who observe the Vrat are bound to get blessed with fortunes.<br> <br>Thursday<br>Thursday is dedicated to Lord Vishnu and his incarnations. Helps to attain good luck and prosperity<br><br>Friday<br>Friday is dedicated to Mother Goddess &#x2013; Mahalakshmi, Santhosi Ma, Annapuraneshwari and Durga. Helps to attain wealth and prosperity<br><br>Saturday<br>Saturday is dedicated to alleviating the bad influence of Lord Shani. Lord Hanuman is also worshipped on Saturdays. In the Ramayana, it is mentioned that Lord Hanuman frees the Navagrah Devatas from the captivation of Ravan. Pleased by this, Shani Deva gives a boon to Hanumanji that, whoever worships Hanumanji on Saturdays (the day attributed to Shani), will be saved from Shani&apos;s wrath.<br><br>Sunday<br>Sunday is dedicated to Lord Surya (Sun God). Make sure you offer water to the sun, and chant the Gayatri Mantra on Sunday morning.<br><br>It must be noted here that the deity worshiped on a particular day might vary from region to region and community to community.<br><br>So what are you waiting for? Download this special and unique app &#x201C;Hindu Watch Face&#x201D; and give your life a special meaning!!",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 1,
        "5": 6
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/9Osgl-fFj9IllkTHdkWk0M2HaiXMbVKdWfGov8Gj5aAozR7FFdevX1QgHVjaK2Joaf4=h310",
        "//lh3.googleusercontent.com/R3RDJF6EPOTR3tKmLxe3Q9CPaeEZQIXwREGvngAA3s_5kAh41l8ggKP919GZ0ElVpA=h310",
        "//lh3.googleusercontent.com/5x4ZnPf8H-ZoeQNUbFM-Fnhr9SuFM-eJFy7zfZmCg2cWU7ilCdq8qcci0Qf5D1eN2FU=h310",
        "//lh3.googleusercontent.com/8P0C7F3BB7Sk3DmWgU_dXZieDdHUY_AevTHV17T1aX3lawBYXFKhVHAqqeOV10CED5E=h310",
        "//lh3.googleusercontent.com/FiMGPVHIRHSznWD0Kj_bkI0apuIrYl7Frt1k9hrDOX5Mh5w7fTrOtMfx-cFyOXOF51jB=h310",
        "//lh3.googleusercontent.com/sbX4bykMvCggyPsWlVIUkuy1IA1ktD_gH8Wl8w3uvfH07pXuY8wQJX8aO_9yW8GzHg=h310",
        "//lh3.googleusercontent.com/KcdSIWAsV5mz13HdZKauO6pY7LAc5Gnaw1E-E0DqYCh5xciGnMAuZIG59JfF-Z-BgFw=h310",
        "//lh3.googleusercontent.com/NkClZHx0EXVW4t46qBLWpvdwWjJaLE1JAD_yrGuiDnFty8eH-5uNXEFrEuhp4IHgdQ=h310",
        "//lh3.googleusercontent.com/EvEeC76TNTeNvd_V3v5xyjo5jnb9R0-gGO9o2xQSUFI_wH1DvRofrRvMyuNk-OMuEmk=h310",
        "//lh3.googleusercontent.com/jB7LjLoi946z1p3-55kMnUn0uPtzKp7f231GXSCZhuVHpNZXb6X05CzEg3uceSXIeV45=h310",
        "//lh3.googleusercontent.com/1t8_rk3ApprYXncSbiinnPSupfos9lwqFEeaReOzaDfHqPG9JiHD0gjcQPwqY0wMTCTn=h310",
        "//lh3.googleusercontent.com/pmBroBju_bHu1Emd6UOif5EYrz7P0stJOHslF0321TbQWrpIX6cqhW21u5oOT1R0c1I=h310"
    ],
    "comments": [
        "Good"
    ],
    "recentChanges": [
        "Performance and Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.kjsk.watchface.hindu&hl=en&gl=us",
    "appId": "com.kjsk.watchface.hindu"
}