{
    "title": "Weather Scenery Watch Face",
    "summary": "Mountain phase display and a date window that play a fascinating game.",
    "icon": "//lh4.ggpht.com/bMPq59C9AahiVR8pnxIFbAR28a2gH1m7tx3ccfV9xmuV4QGzTxG0cMq_9PFy74_jRv4=w300",
    "price": "$1.03",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 2.2,
    "reviews": 82,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "March 19, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Mountain phase display and a date window that play a fascinating game of Scenery around the timepiece without ever catching up with each other.FrillRoid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable. Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Mountain phase display and a date window that play a fascinating game of Scenery around the timepiece without ever catching up with each other.<br>FrillRoid Watch Faces focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable. <br><br><b>Key custom features:-</b><br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><b>How it works?</b><br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 45,
        "2": 13,
        "3": 4,
        "4": 6,
        "5": 14
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/vzGvSMBzfDugWiZj8CQzOtwEZafsh9-bXn9xgwz4EfhntZX08gV9vPn9xD6lpdSVYSY=h310",
        "//lh4.ggpht.com/uAsFUMyVHKYNg63BmFoGuEUm5P7O3tfIzRdDrrU2nTuw6N9WUEPfjF1DWNxvqJHXKXw=h310",
        "//lh6.ggpht.com/ocKra1SYMZyI7LaEs0cfv-a-orymTuo3KpPAX_7oCAz8F3khy5cyZJIHzVQ9JJ4kBHRV=h310",
        "//lh3.ggpht.com/ZFX-va1o5GO00sSOsBXE-4soTaY71p6pY3ANLt90UBKJ8w7C-C_CTyrLyAzXSVMZc0c=h310",
        "//lh5.ggpht.com/K6WK2pX2XGRiAYtZzkR6p9XyZpGFq9UD3T-gma9l783tWrwpTKQ25rvVIckdXP3tbjc=h310",
        "//lh4.ggpht.com/TRYNU9dw1G1CeWuMPlIF4Uz_DXdOtAWnb4Ih6uVs4B2KCZVdwzuLIzQUr0jNhcFBMCc=h310",
        "//lh3.ggpht.com/cNfjaizZWCVfqXXw-QsVLAMRgynlsirbtsR4Zp3nnXY6tfT4H0kzRiM9S5QxuaG7SpA=h310"
    ],
    "comments": [
        "Mostly There, Please Fix After messing with it for a little and restarting my moto 360, I got this mostly working except the broken HTML tag. As another reviewer said, you have to pick the paid watch face for the paid features. I had to download twice and I had to set for Fahrenheit twice as well. For the weather to I went to weather on the watch and synced then it showed my locations weather correctly. However it still shows my location as a broken HTML tag... this is just the cutest  watch face as far as aesthetics,  please fix..",
        "Does NOT refund! This is a terrible product with no representation of what it advertises! Refund my money!!!! I just purchased less than 3 mins ago on Nexus 6. Terrible devs! Go work for McDonald's.",
        "Great app, read if having issues! If you are having issues changing between F° and C° then read this. I had been having the same issue, but then I realized, the \"pro\" version is a different app entirely. When you buy it, you then have two versions of the same app, and the free version WILL NOT LET YOU GET THE PRO STUFF. You have to make sure that in the android wear app, when selecting the watch face, that you don't select \"scenery free\" if you've bought pro. You have to press the pro scenery option in order to get the pro settings.",
        "Read Reviews I too downloaded, then couldn't get it changed to Fahrenheit. I swear I will always read reviews",
        "Good looking but doesn't work Good looking but features don't work. 1 location doesn't work. 2 settings do not save. As long as you exit the wear app it goes back to defaults",
        "It's stuck on settings and can't customize anything after paying for premium. Too bad,I really liked the look of it"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.weather.scenery.watch.face.D20&hl=en&gl=us",
    "appId": "com.frillroid.weather.scenery.watch.face.D20"
}