{
    "title": "Eagle Police Aviator WatchFace",
    "summary": "Eagle police aviator ensure flawless precision and excellent performance.",
    "icon": "//lh3.ggpht.com/aR8yq8ECC5HmNDRs9pKEmgUx3nPN17DZGIB0cHScHcvvlKiPoA_UrWhgxr3245SzkCk=w300",
    "price": "$1.04",
    "free": false,
    "minInstalls": 10,
    "maxInstalls": 50,
    "score": 0,
    "reviews": 0,
    "developer": "Watch 360",
    "developerId": "8780140914012654870",
    "developerEmail": "sportswearapps@gmail.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37- A, Civic Centre, Bahria Town, Islamabad",
    "updated": "February 6, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Inspired by the modernity and streamlined elegance of the Aviator, This Eagle police aviator created the model that combines art-deco style with subtle echoes of the pocket watch design. The classical round case, elegant hands and numerals: all these attributes are the result of the graceful evolution of pocket watches. The simple case and the dial’s classical instrumental design make this watch look like an extension of a plane’s dashboard with eagle logo at the top. This Watch face comes with awesome built in features such as ambient mode, temperature, date, mobile and watch battery. Watch360 focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:-• Latest Weather updates• Classic Design• Ultimate readability • Clean and simplistic look • Military / police / Aviator Watch Face • Remaining battery life of your device so you exactly know when to charge• Ambient mode engineered with the latest wear Api makes your watch’s battery stronger than everThis watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Inspired by the modernity and streamlined elegance of the Aviator, This Eagle police aviator created the model that combines art-deco style with subtle echoes of the pocket watch design. The classical round case, elegant hands and numerals: all these attributes are the result of the graceful evolution of pocket watches. The simple case and the dial&#x2019;s classical instrumental design make this watch look like an extension of a plane&#x2019;s dashboard with eagle logo at the top. This Watch face comes with awesome built in features such as ambient mode, temperature, date, mobile and watch battery. Watch360 focus is in creating professional looking watch faces. Each Watch Face is engineered by high quality design and required keen concentration to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br>Key custom features:-<br>&#x2022; Latest Weather updates<br>&#x2022; Classic Design<br>&#x2022; Ultimate readability <br>&#x2022; Clean and simplistic look <br>&#x2022; Military / police / Aviator Watch Face <br>&#x2022; Remaining battery life of your device so you exactly know when to charge<br>&#x2022; Ambient mode engineered with the latest wear Api makes your watch&#x2019;s battery stronger than ever<br><br>This watch face is for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br>How it works?<br>Its simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. <br>Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 0
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh5.ggpht.com/kxv6RJeXx6T9X28DW8HrXqTuccwqHt5Oi2kBrOzBAYi6bQKTqveXx0MK2CH8N42ZgQ=h310",
        "//lh4.ggpht.com/w_YroQYOO6vRKH50WNnKiQZOpKv_KGK0kXZpTcdib3pNM_DMk9St6HbtHUQ3kMxM8Q=h310",
        "//lh3.ggpht.com/YMhbxOWNk-vFs_2fs9kEz4k7ncNGPZE9PKcTsR0JTxr47Fjmf7OYMTfLRiWkU-qZZZQ=h310",
        "//lh4.ggpht.com/I5W6nsvheWSFRnsMczX482YCKMil2DtUBpF7LsSIbYx-0nQcNkjnc4MCcSCRgEFg_YA=h310",
        "//lh5.ggpht.com/KrKUWPEu-4QcR-r8I9tY_uw-oOWBolrNoIJQACMTpz0BCPmX-cdlThXn9oHZndbpJbe9=h310",
        "//lh3.ggpht.com/hX0ZFA4UnSjKVTgKtj9o7fF582yOLleCkZr0AFX-gGLy2BKwHWvdUMY35lA1ikbjsc8=h310"
    ],
    "comments": [],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.watch360.eagle.police.aviator.watch.face.A02&hl=en&gl=us",
    "appId": "com.watch360.eagle.police.aviator.watch.face.A02"
}