{
    "title": "Watch Face Generator",
    "summary": "Find new watch face backgrounds in this free smart watch app!",
    "icon": "//lh3.googleusercontent.com/Ii-pDlcqGnjsvdhIlNiIsULXMZPD62EuiMJ_IR8cZ8St0htAnv-My033pduEpO4dYGM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.8,
    "reviews": 102,
    "developer": "Thalia Premium Photo Montage",
    "developerId": "7125614350471173442",
    "developerEmail": "thaliamaka@gmail.com",
    "updated": "January 17, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Please, give a warm welcome to Watch Face Generator, a completely new and free smart watch app which is here to help you customize your simple watch face and make one according to your wishes. Plenty of backgrounds, hand styles and other elements' designs are waiting for you to them out. Using this watch face maker you can either make a new face, or use the ones we already made for you in advance. Follow the instructions below, download our watch face app and synchronize your custom watch faces with your phone. This might be the best way to come into possession of the richest watch face collection which will provide you with the possibility to have a new design on your smart device every single day. So, if you need new smart watch faces, do not hesitate, but download Watch Face Generator and ensure that you get the best of the best!***How to set your watch face?***● Download smart watch application to your phone! ● Find the icon and simply click on it! ● Choose among beautiful preset skins and sync to your smartwatch!● Or design your own watch face!● Choose all watch face elements separately!● Choose a background, different hand styles, markers and widget styles! ● See the preview of each element combination!● Choose what you want to be shown when your watch face is in ambient mode!  ● When you're done, sync the app with your device! ● Both round and square watch faces supported! ***Where to find the watch face you've chosen?*** ● You can either find the Android Wear application on your phone and select our watch face from the list.● Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.● Wait a few seconds for the app to synchronize, be patient!Gear up with Watch Face Generator, download the app to your phone and then sync software for smart watch.***Compatibility!***Make sure that your device runs on Android Wear operative system, otherwise you won't be able to use our application. Watch Face Generator is compatible with all of the latest Android Wear devices including:  Moto 360 1Moto 360 2nd genHuawei WatchAsus Zen Watch 1 ,2 & 3 LG Watch UrbaneLG Watch Urbane 2nd EditionLG Watch R™LG G WatchFossil Q FounderCasio WSD-F10Tag HeuerSony Smartwatch 3Note: On occasion it takes some time for a watch face app to synchronize with your device. In case you're having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you're enjoying our watch faces we wouldn't mind getting a positive review. Thank you for understanding, enjoy using our app!Contact us on: watchfacessupport@webelinx.comDisclaimer: Android™ is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "descriptionHTML": "Please, give a warm welcome to Watch Face Generator, a completely new and free smart watch app which is here to help you customize your simple watch face and make one according to your wishes. Plenty of backgrounds, hand styles and other elements&apos; designs are waiting for you to them out. Using this watch face maker you can either make a new face, or use the ones we already made for you in advance. Follow the instructions below, download our watch face app and synchronize your custom watch faces with your phone. This might be the best way to come into possession of the richest watch face collection which will provide you with the possibility to have a new design on your smart device every single day. So, if you need new smart watch faces, do not hesitate, but download Watch Face Generator and ensure that you get the best of the best!<br><br><br>***How to set your watch face?***<br><br>&#x25CF; Download smart watch application to your phone! <br>&#x25CF; Find the icon and simply click on it! <br>&#x25CF; Choose among beautiful preset skins and sync to your smartwatch!<br>&#x25CF; Or design your own watch face!<br>&#x25CF; Choose all watch face elements separately!<br>&#x25CF; Choose a background, different hand styles, markers and widget styles! <br>&#x25CF; See the preview of each element combination!<br>&#x25CF; Choose what you want to be shown when your watch face is in ambient mode!  <br>&#x25CF; When you&apos;re done, sync the app with your device! <br>&#x25CF; Both round and square watch faces supported! <br><br><br>***Where to find the watch face you&apos;ve chosen?*** <br><br>&#x25CF; You can either find the Android Wear application on your phone and select our watch face from the list.<br>&#x25CF; Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.<br>&#x25CF; Wait a few seconds for the app to synchronize, be patient!<br><br>Gear up with Watch Face Generator, download the app to your phone and then sync software for smart watch.<br><br>***Compatibility!***<br><br>Make sure that your device runs on Android Wear operative system, otherwise you won&apos;t be able to use our application. Watch Face Generator is compatible with all of the latest Android Wear devices including:  <br><br>Moto 360 1<br>Moto 360 2nd gen<br>Huawei Watch<br>Asus Zen Watch 1 ,2 &amp; 3 <br>LG Watch Urbane<br>LG Watch Urbane 2nd Edition<br>LG Watch R&#x2122;<br>LG G Watch<br>Fossil Q Founder<br>Casio WSD-F10<br>Tag Heuer<br>Sony Smartwatch 3<br><br>Note: <br><br>On occasion it takes some time for a watch face app to synchronize with your device. In case you&apos;re having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you&apos;re enjoying our watch faces we wouldn&apos;t mind getting a positive review. Thank you for understanding, enjoy using our app!<br><br>Contact us on: watchfacessupport@webelinx.com<br><br>Disclaimer: Android&#x2122; is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "histogram": {
        "1": 24,
        "2": 3,
        "3": 2,
        "4": 15,
        "5": 58
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/iwTbiniumcELtnMprU3pAQJjt5YfOa4gEgH4kpqAkmiNHtXPQsZ6jj2C_MHRVTxHUnXQ=h310",
        "//lh3.googleusercontent.com/i-4qYi0_AvMILqJ0-sXdjmShsSgIayMCSZkP_IP--InzFZF56GPYbZCwPVXQmO5Gbsw=h310",
        "//lh3.googleusercontent.com/m6PX9wR_45gYCeuiVZvWRHapIJMUijbhvjsH0K7IxT0JA8ZyImjqXoQ8t_qzmhfk9Co=h310",
        "//lh3.googleusercontent.com/aS41hlSU1Bc088vbSuABNw5wynZDVpub0Lpo9xM452nRqxF_nXlkab0xfcwe1jAqtw=h310",
        "//lh3.googleusercontent.com/_r27Unn6mniqv9cee4XXnZasw-BYGClfflHAFPyOhLAuVP-d11u9hlf0tLh8REOdWA=h310",
        "//lh3.googleusercontent.com/fptkE2zxjlMFQlv7k-Y_KMZ-kmv3C2s2bOg3eI9LWNsqJ8Dcy9lx66YT7qAgs1Xz59Ex=h310",
        "//lh3.googleusercontent.com/q7QOC4ozD2Wc4lhaEV3vSEUwyOR3SSUn7zoj-WlcK95T4K_T_TMQcZfNYS-sqaM7hA=h310",
        "//lh3.googleusercontent.com/SqGhFQ4xfZjVeAkreoTtUjBseQ-QcsI4D8NWcbS8TnNp5881I0-uyxCioZM5KEBPE1Y=h310",
        "//lh3.googleusercontent.com/H8yHph8xKm1ok8EHI1nBrpXefUgSQbn2JAzkAxstZ8NkEN-kyGVOQ1r3KOwXfGYBxP8=h310"
    ],
    "comments": [
        "The only thing that works is the adds.",
        "Only thing working is the ads",
        "How does this thing work?",
        "This app is not working. Only looks are good but nothing works.",
        "Not Working , Only adds.",
        "Only ads"
    ],
    "recentChanges": [
        "- Minor enhancements",
        "- Performance improved",
        "- Optimized for Android Wear 2"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tppm.watch.face.generator&hl=en&gl=us",
    "appId": "com.tppm.watch.face.generator"
}