{
    "title": "Aquarium Watch Face",
    "summary": "Aquarium watch face is an android wear aquarium, customize your tank to suit you",
    "icon": "//lh3.googleusercontent.com/DlI2vLkrvSiBI2yfnTFokR_wPL5cV3VPao15hq983QXr984zG21n5YM1t7B1wMJ5t58=w300",
    "price": "$1.74",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.7,
    "reviews": 65,
    "developer": "Emerald Co.",
    "developerId": "5095192212763873633",
    "developerEmail": "callan102@gmail.com",
    "developerAddress": "130 Old Street\nLondon\nEC1V 9BD",
    "updated": "January 6, 2016",
    "version": "1.0.16",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "*** NOTE PLEASE READ BEFORE INSTALLINGIf you are having any problems with the app please read this FAQ before refunding.-------------FAQ---Q. I've installed the app, but it's not appearing on my watch! What should I do?A. You may need to upgrade your android wear device to the latest version. You can do this by following this guide:https://support.google.com/androidwear/answer/6321140?hl=en-GBQ. I'm still not seeing my app, what shall I do!?A. Rest assured, if the app has taken some time to install this is perfectly normal, the app has quite a large size because of all it's features; The app will definitely install at some point, we recommend waiting between 10-30 minutes. It is however not unheard of for this process to take longer in some cases, one of our customers reported it took him an hour and a half before he saw the app appear on his watch.We recommend user's don't try to uninstall and reinstall the app either as that can confuse android wear. Simply install the application and wait and eventually you will be able to see it. If not don't hesitate to contact us at callan@emerald.li---Q. I can't find the customisation options for the app, I want to change my aquarium, how can I do this?A. We've made the customisation options available for you from within the smart watch, we like to lower dependancy on the phone by making all functionality available straight on the watch. To access the customisation options for the aquarium, simply long press the watch to be taken to the watch face selection screen, from here navigate to the aquarium watch face. Underneath the face you will see a little gear icon.Press the gear icon to activate the aquarium options, you can change each fish in the tank as well as the tank itself. You can also choose whether or not to display the battery, date and you can also change the clock to 12 or 24 hour variants. ---Q. I'm having problems with my phone's connection, why?A. Sometimes on android wear the connection between devices encounters some problems. This is unfortunately an android wear issue and is therefore something that is unrelated to our product. Users can attempt to change the face and will probably see connection problems persist. We advise updating to the latest version of wear to avoid these issues.--Q. I've got a few suggestion I'd really like to see, would your developers implement them?A. We value our paying customers and we want to create the best product we can. Ideas are always welcomed and will help our app become better, users are encouraged to email their suggestions. You can email your suggestions to callan@emerald.li------------------------------------------------------Aquarium Watch Face is the first Aquarium for Android Wear.Now you can have the beauty of the sea right on your wrist. Aquarium Watch face allows you to customise your aquarium to the smallest detail, allowing you to change the tank, fish and more.Customise your aquarium by choosing fish with new fish added every month,  you can look forward to creating your own diverse and fully animated micro aquarium for android wear.The Aquarium watch face allows for customization of general settings too. You can switch between 12 and 24 hour clocks, change is the battery and date are displayed and even change the frame rate of the animations.The Aquarium Watch face has also been optimized to reduce battery usage, you can expect a significantly longer lasting battery in comparison with other animated watch faces. This is because we have taken considerable time and effort to program our watch faces using special power saving algorithms.The Aquarium watch face is a work in progress and is currently in beta. Please rate favourably and buy to support this project. We appreciate all the help we can get, in return we seek to create nothing short of the best aquarium watch face on the net. Email your suggestions to callan@emerald.li",
    "descriptionHTML": "*** NOTE PLEASE READ BEFORE INSTALLING<br><br>If you are having any problems with the app please read this FAQ before refunding.<br><br>-------------<br><br>FAQ<br><br>---<br><br>Q. I&apos;ve installed the app, but it&apos;s not appearing on my watch! What should I do?<br><br>A. You may need to upgrade your android wear device to the latest version. You can do this by following this guide:<br>https://support.google.com/androidwear/answer/6321140?hl=en-GB<br><br>Q. I&apos;m still not seeing my app, what shall I do!?<br><br>A. Rest assured, if the app has taken some time to install this is perfectly normal, the app has quite a large size because of all it&apos;s features; The app will definitely install at some point, we recommend waiting between 10-30 minutes. It is however not unheard of for this process to take longer in some cases, one of our customers reported it took him an hour and a half before he saw the app appear on his watch.<br><br>We recommend user&apos;s don&apos;t try to uninstall and reinstall the app either as that can confuse android wear. Simply install the application and wait and eventually you will be able to see it. If not don&apos;t hesitate to contact us at callan@emerald.li<br><br>---<br><br>Q. I can&apos;t find the customisation options for the app, I want to change my aquarium, how can I do this?<br><br>A. We&apos;ve made the customisation options available for you from within the smart watch, we like to lower dependancy on the phone by making all functionality available straight on the watch. To access the customisation options for the aquarium, simply long press the watch to be taken to the watch face selection screen, from here navigate to the aquarium watch face. Underneath the face you will see a little gear icon.<br><br>Press the gear icon to activate the aquarium options, you can change each fish in the tank as well as the tank itself. You can also choose whether or not to display the battery, date and you can also change the clock to 12 or 24 hour variants. <br><br>---<br><br>Q. I&apos;m having problems with my phone&apos;s connection, why?<br><br>A. Sometimes on android wear the connection between devices encounters some problems. This is unfortunately an android wear issue and is therefore something that is unrelated to our product. Users can attempt to change the face and will probably see connection problems persist. We advise updating to the latest version of wear to avoid these issues.<br><br>--<br><br>Q. I&apos;ve got a few suggestion I&apos;d really like to see, would your developers implement them?<br><br>A. We value our paying customers and we want to create the best product we can. Ideas are always welcomed and will help our app become better, users are encouraged to email their suggestions. You can email your suggestions to callan@emerald.li<br><br>------------------------------------------------------<br><br><br>Aquarium Watch Face is the first Aquarium for Android Wear.<br><br>Now you can have the beauty of the sea right on your wrist. Aquarium Watch face allows you to customise your aquarium to the smallest detail, allowing you to change the tank, fish and more.<br><br>Customise your aquarium by choosing fish with new fish added every month,  you can look forward to creating your own diverse and fully animated micro aquarium for android wear.<br><br>The Aquarium watch face allows for customization of general settings too. You can switch between 12 and 24 hour clocks, change is the battery and date are displayed and even change the frame rate of the animations.<br><br>The Aquarium Watch face has also been optimized to reduce battery usage, you can expect a significantly longer lasting battery in comparison with other animated watch faces. This is because we have taken considerable time and effort to program our watch faces using special power saving algorithms.<br><br>The Aquarium watch face is a work in progress and is currently in beta. Please rate favourably and buy to support this project. We appreciate all the help we can get, in return we seek to create nothing short of the best aquarium watch face on the net. Email your suggestions to callan@emerald.li",
    "histogram": {
        "1": 11,
        "2": 2,
        "3": 10,
        "4": 15,
        "5": 27
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Gc4HR9T-VqXjkX2m5mM-nPwq4pcjIn_PTmeGmdwepys4-cWvM9klirdOuSvYLluv58E=h310",
        "//lh3.googleusercontent.com/SNXtR-kLkmeOGyUShgSkZh8R-T2H29g5c6OL2T7qx82xtrtykEB_Resm_-RrGNWFP8Q=h310",
        "//lh3.googleusercontent.com/4SVKjwK9bQ01SS630aY3UeZuaztnCn5mTBoKesmX0By-WkOrIRNZLZOCLN34xqs9uUzT=h310",
        "//lh3.googleusercontent.com/BGQIIxaQlYgF9nDIBpRQfXNrz-WCHItDqxIAv9vazOJmJbZ8jfUEyBAJBMbcJvpAWhs=h310"
    ],
    "comments": [
        "Doesn't work Have had this app \"installed\" on my HTC m8 all day and there was never an icon to open the app and it never synced with my gear live or the gear live app. I installed/reinstalled before reading the commentary so now I can't get a refund...very frustrated, I was excited for this watch face. I installed multiple watch faces today and this is the only one that won't sync.",
        "Doesn't work Didn't show up after an hour so had to refund. Nexus 6P + Huawei Watch. Tried to install again after developer left feedback and it still doesn't work although other faces I tried at random all worked without issue.",
        "Install only took 30 seconds on a Zenwatch 2.  Such a gorgeous face.  I love staring at at.  The only problem is that when I power the watch off and on, the settings don't seem to stay, forcing me to always play with the settings when I turn my watch on at the start of my day.  This is not a problem for those that leave their watch on 24/7, but I turn it off at night.",
        "Been installed for 2 days and won't appear on the watch. Checked for updates on my watch and phone. All is up to date and nothing. Wasted $.99.....",
        "Really off center The face looks nice, installed without problem, and runs fairly smoothly. Unfortunately the date, time, and battery are noticeably off center even after a reboot. This is on a Huawei watch.",
        "Works and showed up after 2 minutes installing. Just one complaint, display of date and battery not at the center of my watch. LG G Watch R (1st edition)"
    ],
    "recentChanges": [
        "Fixed issues with newer devices, watch face should install on all devices in roughly 5-15 minutes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.emerald.callancarr.aquarium&hl=en&gl=us",
    "appId": "com.emerald.callancarr.aquarium"
}