{
    "title": "Winter Wear",
    "summary": "Have a merry christmast with Winter Wear Watchface with realistic snow animation",
    "icon": "//lh5.ggpht.com/_2NgTluAsIJoR0LpnI7olTJba7kALzaHGAjg-X3EDgq5BEi_fKUCA8Y75XVHYSP0-3U=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.2,
    "reviews": 92,
    "developer": "MaderDucker",
    "developerId": "MaderDucker",
    "developerEmail": "maderducker@gmail.com",
    "developerWebsite": "https://plus.google.com/u/103949179630970499718/103949179630970499718/about",
    "updated": "December 17, 2015",
    "version": "1.3.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Merry Christmast!! This winter don't get outside without our Watch Face, see the snowflakes fall with realistic snow animation. ¡You can configure it on settings!. The beautiful low poly snow landscape changes along the day, day and night, and you can chose between freeze or candy numbers. Change the options in realtime with preview in your smartphone.Features:- The best realistic snow animation you will see.- The sun moves along the day changing the low poly landscape, you can see sunset, day and night.- Full customization with real time preview in your smartphone, snow animation settings like number of snowflakes or wind.- Winter is coming.. (Winter Wear is already here)- Dimmed screen- Candy & freeze numbersAndroid Wear Devices- Winter Wear supports all Android Wear devices, if you have questions in a specific device.",
    "descriptionHTML": "Merry Christmast!! This winter don&apos;t get outside without our Watch Face, see the snowflakes fall with realistic snow animation. &#xA1;You can configure it on settings!. The beautiful low poly snow landscape changes along the day, day and night, and you can chose between freeze or candy numbers. Change the options in realtime with preview in your smartphone.<br><br>Features:<br><br>- The best realistic snow animation you will see.<br>- The sun moves along the day changing the low poly landscape, you can see sunset, day and night.<br>- Full customization with real time preview in your smartphone, snow animation settings like number of snowflakes or wind.<br>- Winter is coming.. (Winter Wear is already here)<br>- Dimmed screen<br>- Candy &amp; freeze numbers<br><br>Android Wear Devices<br><br>- Winter Wear supports all Android Wear devices, if you have questions in a specific device.",
    "histogram": {
        "1": 7,
        "2": 2,
        "3": 8,
        "4": 22,
        "5": 53
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/p8wWeVg8iu3_-Qg4ttH6Uv-fpUfP81U09j-CrHaj_dIiusPHbLOA916Tz8gSKSfAD0k=h310",
        "//lh4.ggpht.com/rXhBAFO2lEzAk5NtMRy65ydyixNMtFgen1EX-8SJUwDpWyeSozyanCEawlxzkpU8d0w=h310",
        "//lh6.ggpht.com/ufh849Dsi95K2FFwFkeaw6C-L9lz8OYF1w2BfdNci8NR9AsdibWK0dPWucrj7e6-_g=h310",
        "//lh5.ggpht.com/OUh6kSg5VhEBKhtw-oRoQtYyJ7N5Y5DGYO3XlJ2mijVIhbu8nua66LEkPiZdg6PTyek=h310",
        "//lh4.ggpht.com/6FhQj-XNNfrkiOLarLwY2xSr_xoWvjWTT9Ie2B9lsREwsuFBKrn3iqzz4iTLhlJZ1Osr=h310",
        "//lh4.ggpht.com/ttVLWiOP0tMsDpp0wLQwLJ7VJJKuy7wxLjKYZzTXhXcrVmawPAPfnhZ1sY-gN11L6g=h310"
    ],
    "comments": [
        "Not A fan App stuck in 24 HR clock mode. When i reset in app, it does not save.",
        "It must be built for a square watch because it doesn't cover the right side or the bottom it's just aBlank Space nice idea but doesn't work with my new Asus zenwatch 3",
        "doesnt work for huawei watch",
        "Bug This looks great, love the options, but there is a black bar on the right side of the watch (Moto 360 v2) as if it is compensating for the flat tire on the right side. Every thing is shifted to the left. Please fix this because I really want to use it!",
        "Another black bar on the screen I love the interface and watchface but there is a problem on my 42mm Moto 360. There is another black bar on the right side of the screen which makes it unusable.",
        "Perfectly seasonal! Looks great on my phone, and after a few problems with syncing, it now looks great on the Moto 360."
    ],
    "recentChanges": [
        "New on 1.3 update:",
        "- Fixed crop image in some devices",
        "- Now is compatible with the new Android Wear devices",
        "- On dimmed Screen now does not display the seconds ticks",
        "Thanks all the users for report the issues"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.maderducker.android.winterwear.app&hl=en&gl=us",
    "appId": "com.maderducker.android.winterwear.app"
}