{
    "title": "FaceDesigner:watch face making",
    "summary": "Make the perfect watch face with style and functionality for your ASUS ZenWatch!",
    "icon": "//lh3.googleusercontent.com/vUdJbcdZq0ulXVDP8etd2sica5j-ukEKzU4H9r4TVMxB33AUU2yRYkWSGeb6tB85h5Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 1426,
    "developer": "ZenWatch, ASUSTeK Computer Inc.",
    "developerId": "6794897890411822139",
    "developerEmail": "zenui@asus.com",
    "developerWebsite": "http://www.asus.com/zenwatch",
    "developerAddress": "NO. 400, Sec. 7, Chende Rd., Beitou Dist., Taipei 112, Taiwan",
    "updated": "October 13, 2016",
    "version": "2.0.0.160923",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "ASUS FaceDesigner is compatible with ASUS ZenWatch only.Want to show off your one-of-a-kind watch face?ZenWatch FaceDesigner is an ASUS wearable application that's fully-compatible with Android Wear. It lets you create exclusive watch faces for your ZenWatch in three easy steps:1. Choose your watch face.2. Choose your clock type.3. Finish it up by choosing your information widget.Creating your own watch face has never been this incredibly fast and amazing!Aside from its simplicity, the ZenWatch FaceDesigner also offers a variety of options for you to choose from such as background image and color, tick, icon, text color, date info, weather info, battery info, missed call info, time zone info, tep count, burned calories, plus more. You can even pick your own favorite image as your watch's background or icon for a more personalized touch. Get creative and show the world your personality using your ASUS wearable!Be unique. Be you!Note: Android and Android Wear are trademarks of Google Inc.Related linksASUS ZenWatch 2https://www.asus.com/ZenWatch/ASUS_ZenWatch_2_WI501Q/ZenWatch Smart Assistant - FaceDesignerhttps://www.asus.com/Phone-Accessory/ASUS_ZenWatch_2_WI501Q/Smart-Assistant/ASUS ZenWatch – Always Within Reachhttps://www.youtube.com/watch?v=ttGns0zZKs4ASUS ZenWatch 2https://www.youtube.com/watch?v=dw5KKD0bdooSpecial features• Create the perfect watch face with style and functionality that's tailored to you.• 1-2-3 steps to easily create exclusive watch face. Press the \"Done\" button anytime to save your creation.• Activate the “Add” checkbox to display the component you choose. Press and hold it on emulated watch to move to suitable position.• Exclusive Zenny icons ONLY available to ZenWatchImportant reminders•Download and install ZenWatch FaceDesigner to apply your tailor-made watch face to ZenWatch.•ZenWatch FaceDesigner is compatible with ASUS ZenWatch Only.•Some features or content may vary among different ZenWatches.More informationFor more product information and videos, check out http://www.asus.com/ZenUI/Feedbacks and suggestionsWe’d love to hear from you! Send us your feedbacks via: zenui@asus.com",
    "descriptionHTML": "<b>ASUS FaceDesigner is compatible with ASUS ZenWatch only.</b><br><br>Want to show off your one-of-a-kind watch face?<br><br>ZenWatch FaceDesigner is an ASUS wearable application that&apos;s fully-compatible with Android Wear. It lets you create exclusive watch faces for your ZenWatch in three easy steps:<br><br>1. Choose your watch face.<br>2. Choose your clock type.<br>3. Finish it up by choosing your information widget.<br><br>Creating your own watch face has never been this incredibly fast and amazing!<br><br>Aside from its simplicity, the ZenWatch FaceDesigner also offers a variety of options for you to choose from such as background image and color, tick, icon, text color, date info, weather info, battery info, missed call info, time zone info, tep count, burned calories, plus more. You can even pick your own favorite image as your watch&apos;s background or icon for a more personalized touch. <br><br>Get creative and show the world your personality using your ASUS wearable!<br><br>Be unique. Be you!<br><br>Note: Android and Android Wear are trademarks of Google Inc.<br><br><b>Related links</b><br>ASUS ZenWatch 2<br>https://www.asus.com/ZenWatch/ASUS_ZenWatch_2_WI501Q/<br><br>ZenWatch Smart Assistant - FaceDesigner<br>https://www.asus.com/Phone-Accessory/ASUS_ZenWatch_2_WI501Q/Smart-Assistant/<br><br>ASUS ZenWatch &#x2013; Always Within Reach<br>https://www.youtube.com/watch?v=ttGns0zZKs4<br><br>ASUS ZenWatch 2<br>https://www.youtube.com/watch?v=dw5KKD0bdoo<br><br><b>Special features</b><br>&#x2022; Create the perfect watch face with style and functionality that&apos;s tailored to you.<br><br>&#x2022; 1-2-3 steps to easily create exclusive watch face. Press the &quot;Done&quot; button anytime to save your creation.<br><br>&#x2022; Activate the &#x201C;Add&#x201D; checkbox to display the component you choose. Press and hold it on emulated watch to move to suitable position.<br><br>&#x2022; Exclusive Zenny icons ONLY available to ZenWatch<br><br><b>Important reminders</b><br>&#x2022;Download and install ZenWatch FaceDesigner to apply your tailor-made watch face to ZenWatch.<br>&#x2022;ZenWatch FaceDesigner is compatible with ASUS ZenWatch Only.<br>&#x2022;Some features or content may vary among different ZenWatches.<br><br><b>More information</b><br>For more product information and videos, check out http://www.asus.com/ZenUI/<br><br><b>Feedbacks and suggestions</b><br>We&#x2019;d love to hear from you! <br>Send us your feedbacks via: zenui@asus.com",
    "histogram": {
        "1": 144,
        "2": 71,
        "3": 137,
        "4": 247,
        "5": 827
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/hpkuIa_ZnUXjEWv4ogQsnEQKmOo94T2m_24iJr1qhPeQ15MqALY1xfHSp3T1pe9KPg=h310",
        "//lh3.googleusercontent.com/S_c4L5HT9dBaZ-Ef8zJya5W6jpSnj_WhIhfajGlCCDYyrOSi2XJ81o2n0mE0rcW-K8U=h310",
        "//lh3.googleusercontent.com/da2giONkC8FnEtdpyGKQ7Pa2_NKUom5mqahSBYH3VOlJJYzKpLqNQXuEKvbyqzqrgiU=h310",
        "//lh3.googleusercontent.com/AJzsGJDw8nAe_IBIOv4ZoBisMLcTBfx4-71Jiw9HeYw9OwGrgssPyabu0frobN0P_kPm=h310",
        "//lh3.googleusercontent.com/wMmFZLiNEbyERBsdypjLvwIASAHQtV1fbtOQbi-ct6wQ-H7CKaNHOyKP43MD3CvAVeA=h310",
        "//lh3.googleusercontent.com/KUksgqDPNMXPrOq3dolIB9fmwYmdQDldgzKSUKUk0CNKix90z4F8vEmRbiy1Koz28rA=h310",
        "//lh3.googleusercontent.com/SNcRKlLcLCxNM7ImE_RZPzgTmg2yFy5AGyBdbzM5RravlYR3oe_zHtLtyTxnFOHZWw8=h310",
        "//lh3.googleusercontent.com/CILRh07aPozFLSpaBHldjbpN9XkcU1pdZ6zmaUkPVmPgunCCef9zeomlMeUa5rd66G0=h310",
        "//lh3.googleusercontent.com/P-SMq7SbfxEOp9l0Yenyks7Ftf-07HqE5LaiiCj6fXWui8yXnAT2NaCLgmd43ogTxVg=h310"
    ],
    "comments": [
        "I have an old Zenwatch 1 and it works great for that. It has a few built-in face backgrounds, dials, and hands that you can use to quickly build your own watch face. If you don't like the provided options you can use your own. I haven't tried using my own background, dials, or hands yet because I was satisfied just using the defaults. There are also widgets you can add for extra information like watch battery level, phone battery level, day, date, weather, steps, etc...  My only gripe is that the ambient screen is limited to just time. You can't put widgets on the ambient screen. You can't even put the day and date on the ambient screen. If they would allow widgets (or at least day and date) in the ambient screen I would raise my rating from 3 to 5.",
        "This would be awesome and 5 stars easily if it had more options. Such a tiny selection of \"ticks\" (analog face). Very few options for watch hands. You can theoretically import additional ones, but there's not a lot of options for finding that sort of thing online. Useful for wallpaper and not much else. Gave it 4 stars since there aren't any alternatives that do the same thing. After custom making my watch face, I don't like anyone else's.",
        "The functionality of this app could be improved with more choices of the building blocks. One major flaw is lack of AM/PM option for the digital clock (unless I am blind). You have hours, separator and minutes to configure, but AM/PM is missing for both clock and timezone options... What's up with that?",
        "I'm not sure why I can't add custom faces, but It simply won't have created a few, tried to upload, looks like it's trying... but nothing.   Same old face. There is no useful instructions, no way to see what the issue is, no error messages, nothing to give a hint to what the issue is.  Frustrating.",
        "Ambient mode and animated widgets. There's nothing except for the hands and tick showing in the ambient mode face, and I would like to have non animated widgets, like  the ones found on the Paul J. Pereira face. It would also be nice to be able to edit stock watch faces like the one explained above so I could have a nicely colored watch face.",
        "Ambient mode is worse than before I have lost \"thanks\" to new version all usefull information in ambient mode. How stupid is smartwatch now. Waking just does not work as needed. Can I go back to old version?"
    ],
    "recentChanges": [
        "↑ ★ ★ ★ ★ ★ ↑",
        "If you like ZenWatch FaceDesigner, please give us 5-stars to encourage us!",
        "v2.0.0",
        "★Allow to edit round watch faces for ZenWatch",
        "★Support to design watch face in ambient mode",
        "★Support to import, export, and share watch faces",
        "★Allow to switch different watch types in All watch face/My watch face page",
        "★Support ZenWatch 3"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.asus.facedesigner&hl=en&gl=us",
    "appId": "com.asus.facedesigner"
}