{
    "title": "Red Lava Analog Watch Face",
    "summary": "The stylish analog smartwatch &amp; interactive clock with luminous red watch face.",
    "icon": "//lh3.googleusercontent.com/V9Et2NR477hs21vhoshr0CSjriTKmus1s0ERnThywGmw2Sw6SqOLhSzAex9pn5d2Yg4m=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.9,
    "reviews": 176,
    "developer": "CritterMap Software LLC",
    "developerId": "CritterMap+Software+LLC",
    "developerEmail": "support@crittermap.zendesk.com",
    "developerWebsite": "http://www.backcountrynavigator.com/",
    "developerAddress": "Camas WA 98607",
    "updated": "August 14, 2015",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "The Red Lava Analog Watch Face is a luminous stylish watch that glows with its elegant design. From the Pacific Ring of Fire, comes a simple tic toc watch with a warm, soft glow that reminds you of dark summer nights gathered around an active lava flow to keep warm. Decorate your mobile phone screen with an awesome interactive clock face. If you like a cool smartwatch face on your phone wall that tells you the exact time, date & also work as a pedometer then you will be definitely amazed by this awesome luminous watch app.Download the amazing Red Lava Analog Watch Face on google play store at 0.99USD only. Once installed, check Android Wear app on your phone to find the Analog Stylish Clock and choose \"Red Lava\". Or long click on your watch to choose it from there.So simple to use, you may not need this description. You probably know all this information from looking at the picture already. Get it today & enjoy the analog tic toc watch.With amazing photo-realistic HD quality, Analog Clock Face will make your eyes glare. Our stylish watch app will transform your phone into envy-making item with Analog Smartwatch and Live Pedometer within the Luminous Clock Collection.Features of Red Lava Analog Watch Face:*Round Smartwatch Face for watches like the Moto 360 or LG G Watch R*Square Interactive Clock Face for those like the Gear Live, LG G, Sony Smartwatch 3, Asus Zenwatch *Warm, soft red glow of lava on the perimeter of each Luminous Clock *Day of Week*Day of Month*The Analog Clock Face shows the battery charge as a percentage*At low power, this specific Analog Smartwatch enters the Ambient mode for extended battery lifeTimeThis interactive clock face for Android Wear does what you've come to expect your analog smartwatch to do: tell time. This is done with an analog tic toc watch like those you have seen on the wall and may have learned to read in grade school. It has an hour, a minute hand, and when in active mode, shows a second hand that ticks.DayThis smartwatch face gives you the day of the month. Not just the day of the month, but also the day of the week in convenient three letter format. Not stopping there, it tells you which day just ended and which one is coming next. So hurry up & download this awesome interactive clock face now.BatteryWant to know how the battery of your Android Wear Smartwatch is holding up without additional clicks? See the battery gauge right on the interactive clock face, including both a percentage and a circle for emphasis.More important than knowing your battery life is conserving your battery life. For this reason, the stylish luminous clock shows a simpler view in ambient mode, which your tic toc watch is in most of the time you are not looking at it. This gives you the greatest chance of getting a full day or more of battery life from your Red Lava Analog Watch Face.To install on newer watches, look for Playstore on the watch and find the link that says \"Apps From My Phone\". When looking for an analog clock face with a red accent color, look no further.If you don't have an Android Wear Watch, move along. Otherwise, get this stylish tic toc watch and bask in its glow today.",
    "descriptionHTML": "<b>The Red Lava Analog Watch Face is a luminous stylish watch that glows with its elegant design. </b><br>From the Pacific Ring of Fire, comes a simple tic toc watch with a warm, soft glow that reminds you of dark summer nights gathered around an active lava flow to keep warm. Decorate your mobile phone screen with an awesome interactive clock face. If you like a cool <b>smartwatch face</b> on your phone wall that tells you the exact time, date &amp; also work as a pedometer then you will be definitely amazed by this awesome luminous watch app.<br><br>Download the amazing Red Lava Analog Watch Face on google play store at 0.99USD only. Once installed, check Android Wear app on your phone to find the Analog Stylish Clock and choose &quot;Red Lava&quot;. Or long click on your watch to choose it from there.<br><br>So simple to use, you may not need this description. You probably know all this information from looking at the picture already. Get it today &amp; enjoy the analog tic toc watch.<br><br>With amazing photo-realistic HD quality, Analog Clock Face will make your eyes glare. Our stylish watch app will transform your phone into envy-making item with Analog Smartwatch and Live Pedometer within the Luminous Clock Collection.<br><br><b>Features of Red Lava Analog Watch Face:</b><br>*Round <b>Smartwatch Face</b> for watches like the Moto 360 or LG G Watch R<br>*Square Interactive Clock Face for those like the Gear Live, LG G, Sony Smartwatch 3, Asus Zenwatch <br>*Warm, soft red glow of lava on the perimeter of each Luminous Clock <br>*Day of Week<br>*Day of Month<br>*The Analog Clock Face shows the battery charge as a percentage<br>*At low power, this specific Analog Smartwatch enters the Ambient mode for extended battery life<br><br><b>Time</b><br>This interactive clock face for Android Wear does what you&apos;ve come to expect your analog smartwatch to do: tell time. This is done with an analog tic toc watch like those you have seen on the wall and may have learned to read in grade school. It has an hour, a minute hand, and when in active mode, shows a second hand that ticks.<br><br><b>Day</b><br>This <b>smartwatch face</b> gives you the day of the month. Not just the day of the month, but also the day of the week in convenient three letter format. Not stopping there, it tells you which day just ended and which one is coming next. So hurry up &amp; download this awesome interactive clock face now.<br><br><b>Battery</b><br>Want to know how the battery of your Android Wear Smartwatch is holding up without additional clicks? See the battery gauge right on the interactive clock face, including both a percentage and a circle for emphasis.<br><br>More important than knowing your battery life is conserving your battery life. For this reason, the stylish luminous clock shows a simpler view in ambient mode, which your tic toc watch is in most of the time you are not looking at it. This gives you the greatest chance of getting a full day or more of battery life from your Red Lava Analog Watch Face.<br><br>To install on newer watches, look for Playstore on the watch and find the link that says &quot;Apps From My Phone&quot;. <br><br>When looking for an analog clock face with a red accent color, look no further.<br><br>If you don&apos;t have an Android Wear Watch, move along. Otherwise, get this stylish tic toc watch and bask in its glow today.",
    "histogram": {
        "1": 14,
        "2": 15,
        "3": 21,
        "4": 54,
        "5": 72
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FxxUKZ--jsRCwqf-AMCNxvwxbTtnFiFCOPumIQwSmyy27bD1KsUGrgu8FSMAKgNR5lQ=h310",
        "//lh3.googleusercontent.com/WxN35rT6PX6rnfbY_swfxAQWgqBWmhzDJquhfJ666kg9QynUXiN7HBaBgT7tfwKehlp9=h310",
        "//lh3.googleusercontent.com/e5rdi2WAb7bWqDIn7o4VscqyAGs0L9ZtpDpROkI-iMU4x7QKSoHi3ognPf_o2AgL_04=h310",
        "//lh3.googleusercontent.com/raQNN-Qq9A6uPFw-O7D5EXgMXq03v3sasZ35tpP6TexnviDGN73Aj7R2QM5BgZA9xQo=h310",
        "//lh3.googleusercontent.com/rzT02frCbDS9npa5OMW2behfh48IC-Bz0MC6e7x6MpvhCaU9LHcBJ61a2zXczcSGa6Q=h310",
        "//lh3.googleusercontent.com/LqktwLxdNwhxPIqsfhUB16cDzfiWbcw_940G-cVQVA97MHXPbtug5q_xJvo3tZFkgys=h310",
        "//lh3.googleusercontent.com/qVwFI3bBQpP6pHT3Eu1joAPpvOSQkwQTtX0tGYfdnXgOTX4-Cm2jzq5jr8Lnh7xwifY=h310",
        "//lh3.googleusercontent.com/TQ-JSK3DK6CLcykH3kBe3rVU9KH00slAtVX4oK2HBIyiR6kkr3f4sOa-Dk8qEKA9rxfm=h310",
        "//lh3.googleusercontent.com/bjEYgXwPY3ps3pSuQYERWRSaM6r0Su6tvrAM6nf_au65pgT4pg4BhCBqRs67KLggImQ=h310",
        "//lh3.googleusercontent.com/KwrIykGxvEWX1qdkw9MIaGzIrfmOqgoxTIXxfEzOpFaBMrIBdeBbXL1nSuKYUTVCDg=h310",
        "//lh3.googleusercontent.com/zWesRfci50MqU7HGKKfHFegkf1N-k6ZeP_JoZCF_VMcoPHZzz6lgXhG1o4IRvrhfxtdA=h310",
        "//lh3.googleusercontent.com/LQ5KBVqe0CyuG0u3-Hpguf3tv5PJCPtTBl1xvuVIu4wZ4A8ADr8J_WOvRDwJgLMIpdc=h310"
    ],
    "comments": [
        "I really love the way it looks on my Zenwatch 2. The only thing I don't like is the icons aren't shortcuts to the apps on the watch. Would like to access them by touching them. Seriously my only complaint.  Second complaint: after using it for a while. Step tracker icon on watch isn't updating. Fit updates on my phone but the watch always displays 0 steps.  Using Nexus 6 and Zenwatch 2.",
        "Looks nice and performs well on my Moto 360 Sport. Only complaint I have is the jagged edges on the circles for the battery and the date, they are a bit of an eye sore. I wish it had more options, like to enable or disable the digital clock, the battery, or the date. Otherwise, I love the simplicity, just that jagged lines problem.",
        "Battery drain, even when not active The redlava app is among the top battery users listed in the android wear app and I don't even have this watchface selected. Not sure what the app is doing but uninstall it goes...",
        "I bought this face because I wanted to see steps taken, day/date/month, time and battery remaining and initially it worked very well, it still does. My issue is that the steps often do not always tally-up with the app on my phone (Sony Xperia). If I switch the face back to ‘Essential’ which is supplied as default the steps are the same. I don’t know where this face gets it step count from but not being accurate is annoying. Other than that, I really do like this face.",
        "Difficult to install on Android Wear 2.0 but that's because that version of Android Wear is terrible and not the fault of this application. Watch face is clean, simple and easy to read.",
        "Love it but unusable Drains my huawei watch battery in half a day, native watch faces keep my watch alive for 2 whole days. Would love it if it was usable. As it looks really nice."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.crittermap.watchface.redlava&hl=en&gl=us",
    "appId": "com.crittermap.watchface.redlava"
}