{
    "title": "VAtch Premium Watch Face",
    "summary": "A premium modern and clean analog Watch Face for Android Wear Devices.",
    "icon": "//lh3.ggpht.com/XPbNcW3CP_hmQuM-b7SlGVlLUnMfcaM-wfz1JWcinaRM6GJFWW0ugIkc81aM8uPUXeqe=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.4,
    "reviews": 88,
    "developer": "Mariux",
    "developerId": "Mariux",
    "developerEmail": "mariux01@gmail.com",
    "developerWebsite": "http://www.mariuxapps.com",
    "developerAddress": "via Giacomo Zanella 10,\n20133 Milano, MI\nITALY",
    "updated": "January 3, 2015",
    "version": "1.0.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Please make sure your watch is running Android 5.0+. After the install, please wait a few seconds while the Watch Face gets installed on your Wear device  VAtch is a Watch Face for Android Wear Devices.It features a modern and clean analog interface, with Light and Dark themes.Through the configuration application you can customize the appearance of VAtch, changing the hour and minutes hands colors. You have an unlimited colors choice!NOTE: VAtch doesn’t provide a seconds hand. Vibration permission required because the device will light up and vibrate when VAtch is updated.VAtch Watch Face is based on the amazing work by designer Hrvoje Bielen:https://www.behance.net/hbielenhttps://www.dribbble.com/hrvojeb",
    "descriptionHTML": "<b>Please make sure your watch is running Android 5.0+. After the install, please wait a few seconds while the Watch Face gets installed on your Wear device </b> <br><br><br>VAtch is a Watch Face for Android Wear Devices.<br><br><br>It features a modern and clean analog interface, with Light and Dark themes.<br><br><br>Through the configuration application you can customize the appearance of VAtch, changing the hour and minutes hands colors. You have an unlimited colors choice!<br><br><br><b>NOTE: VAtch doesn&#x2019;t provide a seconds hand. Vibration permission required because the device will light up and vibrate when VAtch is updated.</b><br><br><br>VAtch Watch Face is based on the amazing work by designer <b>Hrvoje Bielen</b>:<br>https://www.behance.net/hbielen<br>https://www.dribbble.com/hrvojeb",
    "histogram": {
        "1": 3,
        "2": 1,
        "3": 9,
        "4": 22,
        "5": 53
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/qMtTQfeqvwVw1Aof5UsoeuvI-xh9PfNsLNum7WondfweTh-arrBq0CMzxICv__PItFE=h310",
        "//lh4.ggpht.com/QcfpAI5Bo3bOitWYSikOznmsgITgcwruLovCRqBaQzxQwYJrsapGpubwChKlM8czcik=h310",
        "//lh3.ggpht.com/Ijeg68CiDSnKC0wULDFSRfxJXQs6-2r7QCzhNZYyroQZALB43ckw-nqsApUArMsusZ0=h310",
        "//lh3.ggpht.com/LhegrJC-sBIozfUojyqZ_iWdMe60TpYOG8PWNvF1DRUc9Co4VRaPz0cdquUOZ33_jICZ=h310",
        "//lh4.ggpht.com/6h_Y2xPaXuZd-4z7rn8IrTKUKVoHutN9xGHNVZOcpXeubUO_VY_k2CgggoPv1zJL87o=h310",
        "//lh4.ggpht.com/Oc_vxR9_38ZmlH_x08VExmBes17OWDBTRKjDj8l5eNWgoDaFDb_DEmXQ6u-8nBuKAF0=h310",
        "//lh6.ggpht.com/TpZHvSeyZoajdOMPyrFoBVg-_SQJG-ix0ao8SxCkSLcV9R9XriVoInSyJ6zC6GvDBzs=h310",
        "//lh5.ggpht.com/jPmnUKWmBoslU4bzq3BUlgqfepVxq6wCQG_TFYZHhq4HWBpKUTHtYQ3n0ql7DqMLnQ=h310"
    ],
    "comments": [
        "Don't waste your money, get it free Seems like developer(s) don't care. No reply, no updates. Still waiting for battery, date and weather options instead of logo and also custom colors for the background. Disappointed. Meanwhile there are better and free watchfaces like this available. Don't waste your money on this one!",
        "Great Design and Awesome functionality Changing stuff from the phone to the watch is blazing fast and stupid simple, not to mention the design of the watch face is just plain beautiful.   In the future I would like to see a little more functionality but this watch face is a must buy.",
        "I've been contemplating the purchase of this watch face for some time and finally pulled the trigger. My initial thoughts are these: 1) it initially takes a little more than a glance to tell the time - when compared to traditional analog watches; 2) there should be the ability to copy colours from hour to minute or vice versa when theming them (for uniformity or continuity for those, like myself, who care); 3) I wish the hour/minute \"hands\" were the themed colour in ambient mode because the switch is noticeably distracting when it happens; and 4) like everyone else, I'd love the date and time in the middle to be a customization option. Outside of those things, this is an excellent and wonderfully unique watch face.",
        "Unusable on a G Watch R There are two major issues with VAtch on the G Watch R. 1) The anti-burn in moves the watch face around slightly. This causes the outer minute ring to appear thicker at some points than others. 2) There is already a minute ring on the G Watch R so it would make a lot more sense for the minute arrow to point at the minute ring on the watch instead of a second one on the interior.  I love the concept of this watch face but I just can't just it as my primary watch face because of those two  issues.",
        "A favourite but... A very attractive watch face,kudos to the dev! However,the numbers are too small and kinda hard to read. Would love to have current numbers highlighted or more distinct.",
        "Great skin Very nice looking. The only thing I would change is the outer circle showing minutes in the ambient mode. I would like it rather black despite I would loose minutes info."
    ],
    "recentChanges": [
        "*Bug Fix"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mariux.vatch&hl=en&gl=us",
    "appId": "com.mariux.vatch"
}