{
    "title": "Chronos Time Master Watch Face",
    "summary": "A handsome watch face for the handsome you.",
    "icon": "//lh4.ggpht.com/a8xwb88Dbu3bJKXBi1mpXyTeFMCQvAxNumGucTGl2IIUhz79VyGBEHePSAwGQxZv3s4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 2080,
    "developer": "Nerd Attack!",
    "developerId": "Nerd+Attack!",
    "developerEmail": "info@nerdattack.com.my",
    "developerWebsite": "http://www.nerdattack.com.my",
    "developerAddress": "B-3A-01, Capital 2,\nOasis Square,\nJln PJU 1A/7A,\n47301 Petaling Jaya,\nSelangor, Malaysia",
    "updated": "April 16, 2017",
    "version": "1.0.9",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Looks and works great on Moto 360, LG G Watch R and more!Features★ Supports for round & square watch faces.★ Custom design for the flat chin on Moto 360★ Custom accent colors★ Ambient mode★ Battery indicator as a dial or digitalAdditionals★ Various watch hands design via in-app purchaseIf you have any feedbacks or suggestions on how we can further improve Chronos Time Master, please email us at info@nerdattack.com.my",
    "descriptionHTML": "Looks and works great on Moto 360, LG G Watch R and more!<br><br><b>Features</b><br>&#x2605; Supports for round &amp; square watch faces.<br>&#x2605; Custom design for the flat chin on Moto 360<br>&#x2605; Custom accent colors<br>&#x2605; Ambient mode<br>&#x2605; Battery indicator as a dial or digital<br><br><b>Additionals</b><br>&#x2605; Various watch hands design via in-app purchase<br><br><i>If you have any feedbacks or suggestions on how we can further improve Chronos Time Master, please email us at info@nerdattack.com.my</i>",
    "histogram": {
        "1": 101,
        "2": 61,
        "3": 183,
        "4": 511,
        "5": 1224
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/tMlynXjePDJVo5bJtYAdZbVlhQ3Bv-kNxaShKxQEA_ryowmGIBZQS8N4D30Bu0ej6vk=h310",
        "//lh5.ggpht.com/Dhvo9vIqtcsVgWjTjiOvcOAmWkL6_YvhFR5XKJrcEtD3K6MqQu7kN_oz7Bc1w-4GDOk=h310",
        "//lh3.ggpht.com/kL4IYBHYXqaNzjICj3HC6bxZ94oj3AO0VTQw5u1PE9u2VVT751Ocjc5eMiM0vn7NDg=h310",
        "//lh3.ggpht.com/dNbA1sbRCcjSxVd2YU8dS6WWTsZuwqWVhQaKsuKPEY62uE18rOcHJtmbkZ1lTOKwf5c=h310",
        "//lh4.ggpht.com/GQftlzONTCwGyQmzQfqoRb9atk3U0B7ktM7_BklXJ0_QG2hfe-UCTDw_dp1VDwTIxUo=h310"
    ],
    "comments": [
        "Very nice watch With the option to download free, then pay for premium features. Well done developer. This is how all watch faces should be... Try before you buy. Paid for and tried so many watch faces, refunded, ended up having Google account deleted! GREAT! Paid for your premium out of appreciation. Keep up the work and hope you bring more faces out 👍",
        "Good look Very good watch face on the market. But it has 1 prob on my moto 360 gen2, I cant change to the 2nd free watch hand, it automatically returns to the first one after some minutes using. And pls make some better watch hands that look better, these hands are so ugly, even premium hands. Thanks",
        "My favorite watch face, but... This is my favorite watch face and I come back to it every time. But, a little more customization would be nice and the watch hands do not save after a restart. Please fix this and it's definitely worth 5 stars",
        "Does not save So I like the overall watch face but I don't understand that after every time I restart my watch or change back to this face from another I have to keep rechoosing the premium hands. I don't understand why it will save my color scheme but not the watch hands",
        "Love this one I have downloaded many of these wear watch faces. By far this one is a keeper. Just one small issue. Noticed that on SmartWatch 3 it cuts the 2 top minute markers.",
        "Looks decent It's a clean look, but each time my watch restarts the hands revert to the default style instead of maintaining the ones I chose to use. Definitely gotta fix that bug, because what fun is it to always have to go switch the hands back after each reboot"
    ],
    "recentChanges": [
        "- proper text scaling across devices",
        "- support for Huawei's watch"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.nerdattack.chronostimemaster&hl=en&gl=us",
    "appId": "com.nerdattack.chronostimemaster"
}