{
    "title": "Popular Watch Face Free",
    "summary": "Blue watch design with 3 days weather and current battery update.",
    "icon": "//lh3.googleusercontent.com/zpezFTLDhTWLHwMzVHbWC6vOAkqgyJjYoEO-btN-ivKaU2N5CrJy5_io84Olvkyclg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.1,
    "reviews": 37,
    "developer": "Frillroid Watch Faces",
    "developerId": "4781000027709845122",
    "developerEmail": "info@andpercent.com",
    "developerWebsite": "http://www.frillroid.com",
    "developerAddress": "Office #2, 2nd Floor, 37-A, Civic Centre, Bahria Town, Islamabad",
    "updated": "May 20, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Add the coolness to your life with this beautifully designed watch face for your smart wear. Popular Watchface Free is a funky watchface with a cool blue background.  It has weather report for three days i.e yesterday, today and tomorrow. With a large font, cool background and necessary options this watchface is the best you can get for free.FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.Key custom features:- Digital dials with three days weather count watch and mobile battery meter Unique design with large font for easy reading Clean and simplistic lookThis watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear LiveVisit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.How it works?It’s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "descriptionHTML": "Add the coolness to your life with this beautifully designed watch face for your smart wear. Popular Watchface Free is a funky watchface with a cool blue background.  It has weather report for three days i.e yesterday, today and tomorrow. With a large font, cool background and necessary options this watchface is the best you can get for free.<br><br>FrillRoid Watch Faces focus in creating professional looking watch faces. Each Watch Face is engineered by high quality design and took enormous time to choose the watch colors with soothing effect which ultimately makes the watch unmatchable and incomparable.<br><br>Key custom features:-<br><br>&#xF0EC; Digital dials with three days weather count<br>&#xF0EC; watch and mobile battery meter<br>&#xF0EC; Unique design with large font for easy reading<br>&#xF0EC; Clean and simplistic look<br>This watch face is carefully designed for rectangular and circular smart watches such as the LG G Watch, LG G Watch R, Samsung Gear Live, Motorola Moto 360, LG G Watch, LG G WATCH R, and Samsung Gear Live<br>Visit our exclusive Watch face collection for Android Wear on our website www.frillroid.com.<br><br>How it works?<br>It&#x2019;s simple just download the app to your smartphone and sync it with the watch. The watch face that you will choose will be displayed on your watch screen. Open Settings from Android Wear app to customize the Watch Face. Get this app now and provide us your feedback :)",
    "histogram": {
        "1": 10,
        "2": 5,
        "3": 5,
        "4": 7,
        "5": 10
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/voYbDwxaH01CXyoafD4Brpp5R7FqJgZ-bI8dj3TIV-vMiDDJ7_MNjLHRKArehuybhu8G=h310",
        "//lh3.googleusercontent.com/oZkAKFEg79gwnLQ25tcVtFmA9hgsujETjffWI-2ZsDrbYdeAatTvgrZ_UCEUgfIjwOk=h310",
        "//lh3.googleusercontent.com/jqwRbCyL0VdQgleLEPMpyOtJ7zJYP-_92xRko055jdIRsnsqOKSH0QyNTshrDXMQvro=h310"
    ],
    "comments": [
        "A lot of room for improvement The 21C thing at the bottom near the day I can presume Is the temperature, doesn't work it was 15 and it said 22, fix this please",
        "Keep crashing Can't go to settings to update anything, wrong weather",
        "Looks good but... Every time I try to change settings it forces closes please fix this",
        "App crashes App crashes when using my moto 360 and Sony Xperia M5",
        "Crashes Crashes when loading settings. Also battery percentage and weather are wrong",
        "Crashes instantly repeatedly. Worthless."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frillroid.popular.digital.free.watch.face.D31&hl=en&gl=us",
    "appId": "com.frillroid.popular.digital.free.watch.face.D31"
}