{
    "title": "Watch Face Scoon Spiralo",
    "summary": "Moving spirals and an animated glowing background with a star on gravity respons",
    "icon": "//lh3.googleusercontent.com/_1Jiv7A_mPTYi7QiUjL-WZI-yfXl1rfu20IoGC7Kh6vBCBoUbChi0nQNvXRQWWM_S1Fe=w300",
    "price": "$1.58",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 5,
    "reviews": 1,
    "developer": "Scoon Design",
    "developerId": "Scoon+Design",
    "developerEmail": "scoondesign@gmail.com",
    "developerWebsite": "http://www.scoondesign.com",
    "developerAddress": "Dr. Plesmanlaan 156-160, 3601DE, Maarssen",
    "updated": "June 21, 2015",
    "version": "1.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Original design exclusive watch faceMillions of combinationsThis watch face is unique and no copy. The Scoon Spiralo is one of the most complicated watch face available at this moment. It took hundreds of hours to make these complex animations to work. The shooting star can be hidden or set to rotate when tilting wrist  by using your watches accelerometer. The background is a 60 frames glowing animation.  You will be impressed. You can change settings live and on the watch. No need to do this in your mobile phone.This watch is made for Android Wear watches like the Motorola 360 and the LG G Watch Round. It includes a square dial so it can be used on square watches like the LG ZenWatch.Please rate us positive if you like our work! We see that some users don't know to find a setting. We can help you with that or finding other functions.Why the Spiralo is the most fantastic smart watch face:★Millions of combinations can be created to suit any mood.★ It has complex transparent animations★ Accelerometer effects are implemented★ Weather information is available★ You can set options live on the watch by swiping and ticking★ The background is a multicolor glowing animation★ You can set the Tourbillon or disable it.★ It has the ultimate artistic look★ You can make numerous combinations. You are getting a lot of watches in this app.★ You can choose for minimal look or set beautiful dials★ You can set it to digital time★ Many hours are invested in this design. It is the most complex watch face app today available.★ You can set date and power indicators and their location★ You can choose analog or digital indicators★ You can choose modern style or classic hands★ Also features a square design★ Future improvements and updates will follow... How to change/ build your ultimate watch:- buy and download our app and wait till the watch face shows up in your watch- select the Spiralo by long clicking your watch face and then ticking the gear symbol below. Or set it in the Android Wear app on your phone- when activated on your watch go to the settings of Spiralo in the Android Wear app of your phone- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone- if our watch face doesn't show up in your watch please try to restart your watch. It can take some time to load this complex watch- change your preferences by long clicking the watch face. Then swipe up. Swipe and tick to select.- pull your sleeve up so everybody asks what awesome watch you have on your wristSupport us and follow us on http://www.facebook.com/scoonwearhttp://plus.google.com/+scoondesignhttp://www.scoonwear.comMore complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "descriptionHTML": "<b>Original design exclusive watch face</b><br><b>Millions of combinations</b><br><br>This watch face is unique and no copy. <br>The Scoon Spiralo is one of the most complicated watch face available at this moment. It took hundreds of hours to make these complex animations to work. The shooting star can be hidden or set to rotate when tilting wrist  by using your watches accelerometer. The background is a 60 frames glowing animation.  You will be impressed. You can change settings live and on the watch. No need to do this in your mobile phone.<br><br>This watch is made for <b>Android Wear</b> watches like the Motorola 360 and the LG G Watch Round. It includes a square dial so it can be used on square watches like the LG ZenWatch.<br><br><b>Please rate us positive if you like our work! We see that some users don&apos;t know to find a setting. We can help you with that or finding other functions.</b><br><br>Why the Spiralo is the most fantastic smart watch face:<br>&#x2605;Millions of combinations can be created to suit any mood.<br>&#x2605; It has complex transparent animations<br>&#x2605; Accelerometer effects are implemented<br>&#x2605; Weather information is available<br>&#x2605; You can set options live on the watch by swiping and ticking<br>&#x2605; The background is a multicolor glowing animation<br>&#x2605; You can set the Tourbillon or disable it.<br>&#x2605; It has the ultimate artistic look<br>&#x2605; You can make numerous combinations. You are getting a lot of watches in this app.<br>&#x2605; You can choose for minimal look or set beautiful dials<br>&#x2605; You can set it to digital time<br>&#x2605; Many hours are invested in this design. It is the most complex watch face app today available.<br>&#x2605; You can set date and power indicators and their location<br>&#x2605; You can choose analog or digital indicators<br>&#x2605; You can choose modern style or classic hands<br>&#x2605; Also features a square design<br>&#x2605; Future improvements and updates will follow... <br><br>How to change/ build your ultimate watch:<br>- buy and download our app and wait till the watch face shows up in your watch<br>- select the Spiralo by long clicking your watch face and then ticking the gear symbol below. Or set it in the Android Wear app on your phone<br>- when activated on your watch go to the settings of Spiralo in the Android Wear app of your phone<br>- select your flavors of choice and change rotations speeds if preferred in the Android Wear app on your phone<br>- if our watch face doesn&apos;t show up in your watch please try to restart your watch. It can take some time to load this complex watch<br>- change your preferences by long clicking the watch face. Then swipe up. Swipe and tick to select.<br>- pull your sleeve up so everybody asks what awesome watch you have on your wrist<br><br>Support us and follow us on <br>http://www.facebook.com/scoonwear<br>http://plus.google.com/+scoondesign<br>http://www.scoonwear.com<br><br>More complicated watch faces will follow from Marc Notenboom and Wes Scoggin @ Scoon Wear",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/0cIojd543YleIY3ldDqq5GFxavPsOPNGEmWFa0Tob0HLo1yI18bGKxMksFVQSZFszj1V=h310",
        "//lh3.googleusercontent.com/ljSfs5csy6CHJHqoBSz_8ZsooFNzz7EucbaBhZy-3_Yrq2aHmnuJVppayCWUCR9vdE4=h310",
        "//lh3.googleusercontent.com/zSW02FzH_Ks8Vq9jyL-fw2IJRWKs4SAr3dcph7xVd3vir7ri5rW-B6qctAXWFdNa-VBk=h310",
        "//lh3.googleusercontent.com/cnrSYsE_m9XzW-PpZ7cBfOd-WFPZI6BqVuasdjq6mOPEwG9QeUVp5R4T9EQrCgqz4j4=h310",
        "//lh3.googleusercontent.com/RqGUFquakLQEXC7WvQSs24mpEtt3LJmc_jP2vfce5XbaAwmesCdUVplJS_ceSijB4Hbg=h310",
        "//lh3.googleusercontent.com/bJ_fLBMOC-ocdg9XJ2ZK0ccIeQwS_58t_Hm0f59vb26sguHykEHk8cR4ULOWMRJKWw=h310",
        "//lh3.googleusercontent.com/IMICzOgv5O6by-TFp74mafFNiuz7oSlJy5kSIQazOvSx2jSDSeiDvjT-U6ifSzOYmSU=h310"
    ],
    "comments": [
        "Love these watches! I am 100% happy with my watch face purchase.  Works well on Fossil Android watches as well.  Beautifully colored!"
    ],
    "recentChanges": [
        "V1.2",
        "-Changed weather provider url to optimize weather data returns",
        "V1.1",
        "-optimized initial settings",
        "-changed activation method of Digital Watch Color Picker."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.scoonwear.spiralo&hl=en&gl=us",
    "appId": "com.scoonwear.spiralo"
}