{
    "title": "Glitter Watch Face",
    "summary": "Get a smart watch sync software with a glitter background as watch face!",
    "icon": "//lh3.googleusercontent.com/9voKaIBvvqvnifeJL6_uRm_GhfFlVJ6N1hDyy5pkQfbj-sk6aWsfJXoO6KM7mLlfTw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.1,
    "reviews": 64,
    "developer": "Thalia Spiele und Anwendungen",
    "developerId": "4630864123770839911",
    "developerEmail": "starathalia@gmail.com",
    "developerAddress": "Rehmstrasse 20\n22299  Hamburg,Germany",
    "updated": "January 18, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "You're all dressed up for a glamorous night out, but you you feel like you miss an elegant gadget on your wrist? If you want to leave a little sparkle wherever you go, it's high time for you to download Glitter Watch Face! Thanks to the watch face collection decorated with finest glitter you can have a new elegant watch face on every occasion! It will also provide you with a smart watch app which you can synchronize it with your phone and change your custom watch faces for the cute glitter backgrounds. You will be amazed by the idea that your smart device can be different whenever you want it. Besides, you can design your own smart watch faces – combine the elements and choose the glitter background you like most. Well, now you can have a glitter fashion watch which is up to your taste, and become the best watch face maker. All that being said, you can download our Glitter Watch Face following the instructions below and become one of the satisfied users! Enjoy!***How to set your watch face?***● Download smart watch application to your phone! ● Find the icon and simply click on it! ● Choose among beautiful preset skins and sync to your smartwatch!● Or design your own watch face!● Choose all watch face elements separately!● Choose a background, different hand styles, markers and widget styles! ● See the preview of each element combination!● Choose what you want to be shown when your watch face is in ambient mode!  ● When you're done, sync the app with your device! ● Both round and square watch faces supported! ***Where to find the watch face you've chosen?*** ● You can either find the Android Wear application on your phone and select our watch face from the list.● Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.● Wait a few seconds for the app to synchronize, be patient!Gear up with Glitter Watch Face, download the app to your phone and then sync software for smart watch.***Compatibility!***Make sure that your device runs on Android Wear operative system, otherwise you won't be able to use our application. Glitter Watch Face is compatible with all of the latest Android Wear devices including:  Moto 360 1Moto 360 2nd genHuawei WatchAsus Zen Watch 1 ,2 & 3 LG Watch UrbaneLG Watch Urbane 2nd EditionLG Watch R™LG G WatchFossil Q FounderCasio WSD-F10Tag HeuerSony Smartwatch 3Note: On occasion it takes some time for a watch face app to synchronize with your device. In case you're having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you're enjoying our watch faces we wouldn't mind getting a positive review. Thank you for understanding, enjoy using our app!Contact us on: watchfacessupport@webelinx.comDisclaimer: Android™ is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "descriptionHTML": "You&apos;re all dressed up for a glamorous night out, but you you feel like you miss an elegant gadget on your wrist? If you want to leave a little sparkle wherever you go, it&apos;s high time for you to download Glitter Watch Face! Thanks to the watch face collection decorated with finest glitter you can have a new elegant watch face on every occasion! It will also provide you with a smart watch app which you can synchronize it with your phone and change your custom watch faces for the cute glitter backgrounds. You will be amazed by the idea that your smart device can be different whenever you want it. Besides, you can design your own smart watch faces &#x2013; combine the elements and choose the glitter background you like most. Well, now you can have a glitter fashion watch which is up to your taste, and become the best watch face maker. All that being said, you can download our Glitter Watch Face following the instructions below and become one of the satisfied users! Enjoy!<br><br><br>***How to set your watch face?***<br><br>&#x25CF; Download smart watch application to your phone! <br>&#x25CF; Find the icon and simply click on it! <br>&#x25CF; Choose among beautiful preset skins and sync to your smartwatch!<br>&#x25CF; Or design your own watch face!<br>&#x25CF; Choose all watch face elements separately!<br>&#x25CF; Choose a background, different hand styles, markers and widget styles! <br>&#x25CF; See the preview of each element combination!<br>&#x25CF; Choose what you want to be shown when your watch face is in ambient mode!  <br>&#x25CF; When you&apos;re done, sync the app with your device! <br>&#x25CF; Both round and square watch faces supported! <br><br><br>***Where to find the watch face you&apos;ve chosen?*** <br><br>&#x25CF; You can either find the Android Wear application on your phone and select our watch face from the list.<br>&#x25CF; Or press hard the face of your smartwatch, wait for the list of skins to appear, and then find ours among them.<br>&#x25CF; Wait a few seconds for the app to synchronize, be patient!<br><br>Gear up with Glitter Watch Face, download the app to your phone and then sync software for smart watch.<br><br>***Compatibility!***<br><br>Make sure that your device runs on Android Wear operative system, otherwise you won&apos;t be able to use our application. Glitter Watch Face is compatible with all of the latest Android Wear devices including:  <br><br>Moto 360 1<br>Moto 360 2nd gen<br>Huawei Watch<br>Asus Zen Watch 1 ,2 &amp; 3 <br>LG Watch Urbane<br>LG Watch Urbane 2nd Edition<br>LG Watch R&#x2122;<br>LG G Watch<br>Fossil Q Founder<br>Casio WSD-F10<br>Tag Heuer<br>Sony Smartwatch 3<br><br>Note: <br><br>On occasion it takes some time for a watch face app to synchronize with your device. In case you&apos;re having issues of this kind, or you are dissatisfied in any way, please contact us. We would be grateful if you could give us a chance to fix the issue so that you can enjoy the product as intended, instead of expressing your dissatisfaction through bad reviews. On the other hand, if you&apos;re enjoying our watch faces we wouldn&apos;t mind getting a positive review. Thank you for understanding, enjoy using our app!<br><br>Contact us on: watchfacessupport@webelinx.com<br><br>Disclaimer: Android&#x2122; is a trademark of Google Inc. Brand names, logos and trademarks used herein remain the property of their respective owners. The listing of any firm or their logos is not intended to imply any endorsement or direct affiliation.",
    "histogram": {
        "1": 25,
        "2": 3,
        "3": 3,
        "4": 9,
        "5": 24
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/JTjubCDWka7lBk6nKXIhu7m8XBaFNF9lA-Pk84nU-ejoErI0tF008MbdtLdPg9am31dJ=h310",
        "//lh3.googleusercontent.com/HILz-O38fIx0PwxVne_F46-48yI-BQqO3mLIe7AAxSyITcCkBz8AY67eJfZ-ISezvZA=h310",
        "//lh3.googleusercontent.com/iUAZOrvEhLv-V9j180awRl0KobwMZkr5yaxqusQUFeyTjIGJNwse_QIQV2GQGNRMdt4=h310",
        "//lh3.googleusercontent.com/pXn-pOohTLUtNQxf_q4Rqy0Sum_lODJkHif-dRS3hkxwWFE5xI0X2VlIiCiuy3mIHeU=h310",
        "//lh3.googleusercontent.com/lxqb_beXTp7GBDcDnNIozsy7CGEYyHYUTnE8gMhcI2Q3sP1o4KEbnaxQR6N17lptNtxn=h310",
        "//lh3.googleusercontent.com/CPVZQZWQDth9QEz9izR_ToQvkiRMnK2f41he5TU4teD44MPEayW7is0WLPyVtPHknQk=h310",
        "//lh3.googleusercontent.com/bUpj0O8HKMALvbymZuVWVVKtLqKB3UURQsDIBgfFw6Wz5DmP3J41vVXXQIBqhy2FNw=h310",
        "//lh3.googleusercontent.com/vE0hETbatUtrwkLFD6aMdh8f8svqHxEhiOjOsj-mOzsmIJdPF1d1hv7coU5hiAJWAA8=h310",
        "//lh3.googleusercontent.com/4AMJ6VwGOe9kLbJyEbnWsqdHJHwFp-Viw5GRVTOC1tNhjzIB1EGOSu7OFBy50vPVm64b=h310",
        "//lh3.googleusercontent.com/J7iQas_s63SPgpio0CFaDvqzDPXe5unRbPSsaTlVJopYsBizL0y9vazopjgYxroESeQ=h310"
    ],
    "comments": [
        "This is the best watch face I came across",
        "Stupid af. Doesn't sync to your phone  it only shows adds literally.  Don't waste your time.",
        "Waste of time Doesn't sync,  just keeps opening ads.  Complete waste of time.",
        "It synched just fine but the image  could be a lot better.  Looks blurry to me.",
        "Will not sync!! Everytime you hit the sync an add pops up ....was a cute idea. Does not work with Samsung Smart watch",
        "Very very very bad cant load watch face"
    ],
    "recentChanges": [
        "- Minor enhancements",
        "- Optimized for Android Wear 2"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.thalia.glitter.watch.face&hl=en&gl=us",
    "appId": "com.thalia.glitter.watch.face"
}