{
    "title": "Plainpalais Roman - Watch Face",
    "summary": "Make your wearable a REAL watch (square and round shape)",
    "icon": "//lh5.ggpht.com/Ak63z0CatBX3U4d_LMBCAnwA8sha7-Jj8CGLDWU59HYEvrggb0pq8UMeJf36mpilsBDi=w300",
    "price": "$1.11",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.2,
    "reviews": 25,
    "developer": "OMITSIS",
    "developerId": "OMITSIS",
    "developerEmail": "android@omitsis.com",
    "developerWebsite": "http://omitsis-barcelona.com",
    "developerAddress": "Casp 162 2nd floor (Fain building), 08013 Barcelona, Spain",
    "updated": "March 29, 2016",
    "version": "2.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Let your watchface look like a real watchOmitsis presents the most carefully designed watch face for Android Wear. ‘Plainpalais ’ is the second of a series of watch faces created by T. Hugo, a professional watch designer based in Berlin, Germany.Plainpalais RomanPlainpalais – A homage to one of the epicentres of watchmaking, This is a place where reading the time is a philosophy. Tags: smartwatch, Face, wear, androidwear, watchface, watch face, smartwatchface, watch, white, luxury, elegantCompatible watches: LG G Watch, Samsung Gear Live, Motorola 360  (Moto 360).",
    "descriptionHTML": "Let your watchface look like a real watch<br><br>Omitsis presents the most carefully designed watch face for Android Wear. &#x2018;Plainpalais &#x2019; is the second of a series of watch faces created by T. Hugo, a professional watch designer based in Berlin, Germany.<br><br>Plainpalais Roman<br><br>Plainpalais &#x2013; A homage to one of the epicentres of watchmaking, This is a place where reading the time is a philosophy. <br><br>Tags: smartwatch, Face, wear, androidwear, watchface, watch face, smartwatchface, watch, white, luxury, elegant<br><br>Compatible watches: LG G Watch, Samsung Gear Live, Motorola 360  (Moto 360).",
    "histogram": {
        "1": 0,
        "2": 1,
        "3": 6,
        "4": 6,
        "5": 12
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/TXpc7Uu1tpF557o8UhkvKI-E5NjJqWPdxTEaqLFxlBJW8QjEH1D2jl0DZvT_UoNKuVU=h310",
        "//lh4.ggpht.com/h-MexdCvK7LU3seWPuyRNb10yCoc2UJLM2w972V_GJdCub2uFFr32XuaQ9Jij_q5i62p=h310",
        "//lh4.ggpht.com/lPQMLavsdJzfPbSdwYsj5T2TglkzJONNkO0Yub6SbMMGRU-tibQ7llmX-HeHcmROetw=h310"
    ],
    "video": "https://www.youtube.com/embed/HoY1h_IWUAk",
    "comments": [
        "Slows everything I need to admit that it has a very elegant design. However, after using it, i found out that both app launcher and ok google detection slows down significantly. Also, it seems a little blur on Huawei Watch, i am not sure whether it is related to the resolution of the textures used by the app.",
        "Great face, poor battery life Overall, I love the simplicity of this face, but it kills the battery on my watch (especially given that it does almost nothing). This needs to get fixed.",
        "Great looking watchface Just wish it had a bit more functionality.  For example, center tap to see upcoming calendar events",
        "Would be nice if we had color options for the hands.",
        "please fix it overlay fixed thanks! but second hand is off centre now looks bad",
        "Great looking watch face. Like another reviewer mentioned, is it possible that you add an option to have the black version (battery saver mode) as the primary watch face?"
    ],
    "recentChanges": [
        "The pivot point of the second hand is now centered"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.omitsis.pocket.roman&hl=en&gl=us",
    "appId": "com.omitsis.pocket.roman"
}