{
    "title": "Countdown - Watch Face",
    "summary": "Watch Face for Android WearFuturistic, Digital &amp; AnalogHighly Customizable🔱",
    "icon": "//lh3.googleusercontent.com/OV9Y3jVV8UacxgREZ1K5klf_DyL1URRVpDZQQrC3LaZ3L-etV5_ucivCAYG8vaH06Oo=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 1579,
    "developer": "Studio eXtreme",
    "developerId": "7274979146896532847",
    "developerEmail": "academyextreme@gmail.com",
    "developerWebsite": "http://academyextreme.com",
    "developerAddress": "41-909 Bytom, Krotka 7\nPoland",
    "updated": "January 23, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Dual Watch Face which brings futuristicSci-Fi look & feel.Completly free, regularly updated!💡 NOTICEAll Settings are accessible via Android Wear Application on the phone.Just select Coutdown and click the \"gear icon\" (FAQ link at the bottom).⭐ INTERACTIVE FUNCTIONTap on the center ring to switch between: Time / Countdown / OwnText!All info in one place, accessible just by a single tap.⭐ MULTITUDE OF COLOR OPTIONS Set colors to each element of the Watch Face.⭐ COUNTDOWN OPTION allowing you to count days, hours, minutes- set date, set time, define text- activate discreet vibrations to let you know that the time is over USER FRIENDLY SETTINGS PANEL the settings panel (accessible via Android Wear application) on the phone or tablet allows you to navigate all the options of COUNTDOWN with easeWEATHER INFO DISPLAY- two weather providers- weather shown as icon or text- weather time update - settingsEXTRAS:- alternative watch hands - sweeping seconds - seconds tailBATTERY EFFICENCY Smooth seconds or standard tick mode. Optimized and tested.CUSTOM INFO TEXTS- special TAGS inside custom text - EMOJI in custom text lines- customizable date format- weatherVARIETY OF DATE FORMATSplay with a date format and customize it to your needs, use either full or shortened names of the days and months, start with a year, month or day – everything is up to you. Find instructions in CUSTOM TAGS in-app info.BATTERY INFO DISPLAY shown as a line or arch or percent in text linesCUSTOMIZATION OF THE NOTIFICATION CARDS translucent notification cards option, customizable size of the notification cardsCONTROL over the \"ok Google\" positionIMPORTANT NOTICE Countdown is designed for Android Wear System 5+Make sure your watch has the Android Wear System 5.0 or higher versionCountdown is compatible with: Moto 360 (moto360, 2015)Huawei WatchLG G Watch R (lgwr)LG G Watch (lggw) Sony Smartwatch 3 (sw3, sw3)Samsung Gear LiveAsus ZenWatch (zenwatch)LG Watch Urbane (lgwu)FAQ, problem solutions and guides: http://goo.gl/5b83SbThank you very much for your interest in our application. If you find Studio eXtreme watch faces inspiring and outstanding, check out our collection on: http://goo.gl/gF3W1f",
    "descriptionHTML": "<b>Dual Watch Face which brings futuristic<br>Sci-Fi look &amp; feel.</b><br><br>Completly free, regularly updated!<br><br><b>&#x1F4A1; NOTICE</b><br>All Settings are accessible via <b>Android&#xA0;Wear&#xA0;Application</b> on the phone.<br>Just select Coutdown and click the &quot;gear icon&quot; (FAQ link at the bottom).<br><br><b>&#x2B50; INTERACTIVE FUNCTION</b><br>Tap on the center ring to switch between: <br>Time / Countdown / OwnText!<br>All info in one place, accessible just by a single tap.<br><br><b>&#x2B50; MULTITUDE OF COLOR OPTIONS</b> <br>Set colors to each element of the Watch Face.<br><br><b>&#x2B50; COUNTDOWN OPTION</b> <br>allowing you to count days, hours, minutes<br>- set date, set time, define text<br>- activate discreet vibrations to let you know that the time is over <br><br><b>USER FRIENDLY SETTINGS PANEL </b><br>the settings panel (accessible via Android Wear application) on the phone or tablet allows you to navigate all the options of COUNTDOWN with ease<br><br><b>WEATHER INFO DISPLAY</b><br>- two weather providers<br>- weather shown as icon or text<br>- weather time update - settings<br><br><b>EXTRAS:</b><br>- alternative watch hands <br>- sweeping seconds <br>- seconds tail<br><br><b>BATTERY EFFICENCY </b><br>Smooth seconds or standard tick mode. <br>Optimized and tested.<br><br><b>CUSTOM INFO TEXTS</b><br>- special TAGS inside custom text <br>- EMOJI in custom text lines<br>- customizable date format<br>- weather<br><br><b>VARIETY OF DATE FORMATS</b><br>play with a date format and customize it to your needs, use either full or shortened names of the days and months, start with a year, month or day &#x2013; everything is up to you. <br>Find instructions in CUSTOM TAGS in-app info.<br><br><b>BATTERY INFO DISPLAY</b> <br>shown as a line or arch or percent in text lines<br><br><b>CUSTOMIZATION OF THE NOTIFICATION CARDS</b> <br>translucent notification cards option, customizable size of the notification cards<br><br><b>CONTROL over the &quot;ok Google&quot; position</b><br><br><b>IMPORTANT NOTICE</b> <br>Countdown is designed for Android Wear System 5+<br>Make sure your watch has the Android Wear System 5.0 or higher version<br><br><b>Countdown is compatible with:</b> <br>Moto 360 (moto360, 2015)<br>Huawei Watch<br>LG G Watch R (lgwr)<br>LG G Watch (lggw) <br>Sony Smartwatch 3 (sw3, sw3)<br>Samsung Gear Live<br>Asus ZenWatch (zenwatch)<br>LG Watch Urbane (lgwu)<br><br><b>FAQ</b>, problem solutions and guides:&#xA0;<br>http://goo.gl/5b83Sb<br><br>Thank you very much for your interest in our application. <br><br>If you find Studio eXtreme watch faces inspiring and outstanding, <b>check out our collection</b> on:&#xA0;http://goo.gl/gF3W1f",
    "histogram": {
        "1": 73,
        "2": 52,
        "3": 125,
        "4": 370,
        "5": 959
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/qj4WaRw1BwVO8z9yf2Fq_vtUAIa97NJwUC9egY5cBA3-3M7-uMhMc8xDKczm0z-Ddd4=h310",
        "//lh3.googleusercontent.com/oywlqLmCBtO7SC-9XdaE7dnjGPoHrVAG4o2gEEpG6yNZj6izkkzlTbZ-IdvFCfBiZQ=h310",
        "//lh3.googleusercontent.com/bY_sIvygPPqGQ_2v15EXyWTwyfpLwiV6GmmAbmAhPmN0_JSWaBdoaUKPQ7dm5_3P7w=h310",
        "//lh3.googleusercontent.com/hkMDPUB0fxAULre6xVbZDmfuLt4dKu_JriClHf40X8U_YxVxbUWePMD2fj6CWcr9WWw=h310",
        "//lh3.googleusercontent.com/usrf7juwSt2b0IVUXJ9JAV0t5BDHUFz9gOTlg3puMjwRAIaqTIM31ao4eRpNy3z_50Q=h310",
        "//lh3.googleusercontent.com/QH3H76E2Pjxfua59tG4gBwwNxabb10--_V5ZQkewuk-YpETEWIApBSd1Yk7XtNUDnnM=h310",
        "//lh3.googleusercontent.com/4bVnSO99ww__x-awk1S_2MLyW9FtCZYjNFmi3RRZiDZGByto7BvgC8C4VoyN9MNWVw=h310",
        "//lh3.googleusercontent.com/RROG1kygiVUiFrnH_iOrXCYyXNAvpnLxiw5H2jIjy07QWJBnngr1gKYVHMuZQaHkDcp0=h310"
    ],
    "comments": [
        "couldn't figure out how to show unread notifications..  plus was not good for OLED burn in..   LG Urbane AW 2.0",
        "This is an excellent watch face (especially in ambient / dim mode).  On my Huawei smart watch it did everything as advertised.  (I currently have the countdown clock set to vacation start date!).  Only challenge I had was with weather updating.  However, I emailed the designer and he got back to me within a few hours with suggests. Now it works 100%.  Great watchface and great designer!",
        "Nicely done! Great looking watch face with good options. It's definitely one of the best looking watch faces out there, however the countdown timer is a bit useless to me & I wish there were more options for what the center button does. It'd also be nice to be able to change the dim mode's colours. As some others have mentioned, I wish I could change the dimming time as well. Great watch face all around.  (My watch is a Nixon Mission SmartWatch).",
        "Wow, just wow! First : I can't believe anyone could rate this less than 4 stars!!  Amazing product, great options and customizable.  Second : Thank you for keeping it simple.  I'm no tech genius and I pretty much have this set up the way I like it.  If only there was some sort of super shortcut to a stop watch function I'd be in heaven!!",
        "Generally nice, bit worried about ring Good and original idea for a watchface, quite well executed - I like the style. Only problem is that the central ring is 1) I find visually unappealing (obv subjective!) but also 2) bit worried about using it on an AMOLED screen 'cos burn in. If there was an option to replace the ring with a 1-2 pixel colored circle (keep glow etc) then it would be a great everyday watch face and would be well worth a $ or so. Or if the ring had a separate dim brightness option I suppose so I could  set it down to like 10%",
        "Best watch face yet I often grew frustrated after downloading a watch face app, only to find it extremely simplistic unless I paid for the premium. This app is customizable in the free mode as if it were premium."
    ],
    "recentChanges": [
        "Compatibility update for Android Wear"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.stmp.counterface&hl=en&gl=us",
    "appId": "com.stmp.counterface"
}