{
    "title": "Bokeh Watch Face",
    "summary": "Pixel-perfect digital watch face with immersive bokeh parallax-effect background",
    "icon": "//lh3.ggpht.com/dmsYZWXOEDtNhx93spV7Bm1kCnyvyvB3yK0u5YlihFz-wC0tffXJ-w3PpcH1jV6VefU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.6,
    "reviews": 306,
    "developer": "Tomáš Kletzander",
    "developerId": "Tom%C3%A1%C5%A1+Kletzander",
    "developerEmail": "android@dmn.cz",
    "developerWebsite": "http://android.dmn.cz/bokeh-watch-face/",
    "developerAddress": "Tomáš Kletzander\nDlouhá 93\nLomnice\n67923\nCzech Republic",
    "updated": "May 12, 2015",
    "version": "1.0.3",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Bokeh Watch Face is simply beautiful. The wide font used to display time and date is elegant and in combination with gentle background makes the face fit to suit as well as sports dress.The background uses a parallax effect based on real time G sensor readings. This makes such an ordinary act as checking current time a completely different and immersive experience. Prepare for battery drain, because you won’t be able to get your eyes off the display.In version 1.0.0 there's now support for widgets in lower area of the watch face. Check new widgets as they get released. The application will get you notified about new releases.New permission requested to access internet. This permission is necessary for downloading information about available widgets and for regular checks for notifications.Before giving bad rating please give me a chance to fix your problem.To receive new functionality earlier, enter out testers community at https://plus.google.com/communities/109859271100666875313 and receive new unofficial versions through Google Play Store on your phone.",
    "descriptionHTML": "Bokeh Watch Face is simply beautiful. The wide font used to display time and date is elegant and in combination with gentle background makes the face fit to suit as well as sports dress.<br><br>The background uses a parallax effect based on real time G sensor readings. This makes such an ordinary act as checking current time a completely different and immersive experience. Prepare for battery drain, because you won&#x2019;t be able to get your eyes off the display.<br><br>In version 1.0.0 there&apos;s now support for widgets in lower area of the watch face. Check new widgets as they get released. The application will get you notified about new releases.<br><br><b>New permission requested</b> to access internet. This permission is necessary for downloading information about available widgets and for regular checks for notifications.<br><br>Before giving bad rating please give me a chance to fix your problem.<br><br>To receive new functionality earlier, enter out testers community at https://plus.google.com/communities/109859271100666875313 and receive new unofficial versions through Google Play Store on your phone.",
    "histogram": {
        "1": 40,
        "2": 29,
        "3": 49,
        "4": 74,
        "5": 114
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/WuxO6VmV7rDtSabiswvLNzMCqMOk1lUIJtBXX_yLrN4LE493-TpQV4_kmJsADKfYLw=h310",
        "//lh3.ggpht.com/RQmaZYyM36d6nJ8qzQxI8F05tOFrOurj7QeZyaJccrT99VejauvRfHPXVzjBUJEFQdTx=h310",
        "//lh4.ggpht.com/dahJMZiWZkukl2tL60Q3lAVOR2C_r_RkdFDrbhJoGZWcPPyV1O6HcMvT5FUZsthGBAA=h310",
        "//lh3.ggpht.com/NJyhCwxCpz_U21_HDtzXTd14jb0SlESIOjPNoEi3qMyMb6ZwBWEKc2IiWFvDG7GFrB8D=h310",
        "//lh4.ggpht.com/Hrfq8zSxXxKzodUZUB1sbGq6dCOWXAQiDlj5xJnRqND00ZEIotoG_hUAUqypkQ9PAXs=h310",
        "//lh4.ggpht.com/qvMffnchar7HwPx3BiykF3vPx7Of8_P4zp4EymhsC42nZtCRX52hgMSGMtHFK-9jlg=h310",
        "//lh3.ggpht.com/Hk_bE4jkBsyzMh_9t7QfzmtDi-4LgkQ-3DKxyajFD0sw9bj5fJZ6Lrox207A6ZDJqwc=h310",
        "//lh6.ggpht.com/CQmcrIun9swwUzAVEJK_RPfN9sGnPuVA8b51YtvFpFngH8CMISCPzAaGg4Q9eZ1vSLQ=h310"
    ],
    "comments": [
        "Liked the app, but after updates using way to much battery life on phone even when not on watch. It even restarted itself when I forced stopped it to control phone battery drain. I will not use any app that uses battery life while not in use. I am uninstalling this watch face until they can get the useless battery drain solved. I use more than one watch face that I change every so often. It's the one of the great things about this watch.",
        "Abandonware :( no updates in over a year. Needs; 1. International Timezone Widget 2. Battery Power Widget 3. Missed calls/Unread SMS/Google Steps Widget. Most elegant watchface in the playstore. I look forward to supporting further. Update: red line IS battery indicator. Nice!",
        "Parallax Effect needed update! Loved this on my first gen moto but after updates mentioned by others and now using on moto 2nd gen the parallax watchface no longer works only the time and battery indicator shows up.",
        "Parallax not working Was good, but for the last few Android Wear updates, the parallax effect doesn't work on 1st gen Moto 360. Would love a fix. Works until the watch goes to sleep, then freezes.",
        "One of the best watch faces around Set this watch face with the weather extension over 6 months ago and never felt the need to change it. Had some minor issues with the weather addon but those were fixed fast.",
        "One of the best watch faces...almost. This is almost perfect. I love having weather on my watch face with a digital clock and the date. The effects are quite unique and cool. I wish I could get rid of the red line in ambient mode, and I wish the weather would show in ambient mode as well. These two additions or options controlling these features would be great. Thanks for the awesome face. Overall I think it could be more feature rich."
    ],
    "recentChanges": [
        "1.0.3:",
        "Bugfixes",
        "1.0.2:",
        "Removed aggressive notification display - wasn't intended to be annoying. My bad =o)",
        "1.0.1:",
        "Bugfixes in configuration application",
        "1.0.0:",
        "Added support for widgets in lower area of the watch face",
        "Added widgets configuration to configuration companion application for mobile phone",
        "Added battery indication capabilities to the red stripe below the time"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=cz.dmn.bokehwatchface&hl=en&gl=us",
    "appId": "cz.dmn.bokehwatchface"
}