{
    "title": "Black Knight watchface by Liongate",
    "summary": "Black Knight watchface by Liongate",
    "icon": "//lh3.googleusercontent.com/4hyBegxzhetC_r0oO_LXHh0mPFwk1GFdLKV7QyzuqA4_g0twcsXyYxSQeDqiAbjMD0E=w300",
    "price": "$2.49",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.5,
    "reviews": 59,
    "developer": "WatchMaster",
    "developerId": "7748240321407942094",
    "developerEmail": "watchfacedesigner@gmail.com",
    "developerWebsite": "http://www.watchmastergroup.com/",
    "developerAddress": "6th Fl, NARA bldg., 369, Gangnam-daero, Seocho-gu, Seoul, Korea",
    "updated": "June 29, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "★Please attention★For the Samsung Gear S2 users, please search \"WatchMaster\" in the Gear apps then you will see the WatchMaster's individual watchfaces. We do not have WatchMaster app for the Tizen right now. We're sorry for the inconvenience.WatchMaster is a watchface designer group who set out to elevate the aesthetic standards of the smartwatch with its unrivaled design quality.This smartwatch watchface for Android Wear is crafted by one of our WatchMaster certified designers.All of our designs, including this watchface, are curated in our WatchMaster app.Features- Watchface for Android Wear Device (Moto 360, Huawei, LG watches, etc.)- Support both round and square displays- Customizable ambient mode- Displayed information: numeric date, watch battery level, phone battery levelHow to use1. Once you install the app, the watchface will be automatically transferred to your watch. (may take a few minutes)2. From watch: Long press your watchface and select the one that you have installed.From mobile: Run the “Android Wear” app and tap “More” button in the watchface section3. Enjoy your new watchface!Note1. We stand by our work. If you’re not satisfied with our watchface, you can get a refund upon request within 15 minutes from the point of purchase.2. Before you express your dissatisfaction through rating, please give us a chance to fix it for you. Send us feedback in any language at watchfacedesigner@gmail.com3. Like your watchface? Great! Check out our other cool designs, too! https://goo.gl/X5mQn6Having released several initial designs on our own, we now want to take this project to the next level – to join with other pioneering designers who are equally excited about shaping what smartwatch should look like. We welcome designers of all different styles. We will do our best to put your beautiful works on people’s wrists. Sounds like a lot of fun, right? Contact us at watchfacedesigner@gmail.comWe will continue our endeavor to lead the future of Android Wear watch designs. Thanks for your support!",
    "descriptionHTML": "&#x2605;Please attention&#x2605;<br>For the Samsung Gear S2 users, please search &quot;WatchMaster&quot; in the Gear apps then you will see the WatchMaster&apos;s individual watchfaces. We do not have WatchMaster app for the Tizen right now. We&apos;re sorry for the inconvenience.<br><br>WatchMaster is a watchface designer group who set out to elevate the aesthetic standards of the smartwatch with its unrivaled design quality.<br><br><br>This smartwatch watchface for Android Wear is crafted by one of our WatchMaster certified designers.<br>All of our designs, including this watchface, are curated in our <a href=\"http://play.google.com/store/apps/details?id=dd.watchmaster\">WatchMaster app</a>.<br><br><br><b>Features</b><br>- Watchface for Android Wear Device (Moto 360, Huawei, LG watches, etc.)<br>- Support both round and square displays<br>- Customizable ambient mode<br>- Displayed information: numeric date, watch battery level, phone battery level<br><br><br><b>How to use</b><br>1. Once you install the app, the watchface will be automatically transferred to your watch. (may take a few minutes)<br>2. From watch: Long press your watchface and select the one that you have installed.<br>From mobile: Run the &#x201C;Android Wear&#x201D; app and tap &#x201C;More&#x201D; button in the watchface section<br>3. Enjoy your new watchface!<br><br><br><b>Note</b><br>1. We stand by our work. If you&#x2019;re not satisfied with our watchface, you can get a refund upon request within 15 minutes from the point of purchase.<br>2. Before you express your dissatisfaction through rating, please give us a chance to fix it for you. Send us feedback in any language at watchfacedesigner@gmail.com<br>3. Like your watchface? Great! Check out our other cool designs, too! https://goo.gl/X5mQn6<br><br><br>Having released several initial designs on our own, we now want to take this project to the next level &#x2013; to join with other pioneering designers who are equally excited about shaping what smartwatch should look like. We welcome designers of all different styles. We will do our best to put your beautiful works on people&#x2019;s wrists. Sounds like a lot of fun, right? Contact us at watchfacedesigner@gmail.com<br><br><br>We will continue our endeavor to lead the future of Android Wear watch designs. Thanks for your support!",
    "histogram": {
        "1": 0,
        "2": 5,
        "3": 2,
        "4": 10,
        "5": 42
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/1tWvgptLHTAtTmPvGmERetvcLg5g7dDUZUzOVL74wPWwE7G0rH23NcAWu3JmhP81Hsw=h310",
        "//lh3.googleusercontent.com/2xXTXUdzobsuEsPAupGYHBZcubWVII3emIaX7nncj7gwqpLqJfLQcSlerz6d5ZdIqhQ=h310",
        "//lh3.googleusercontent.com/8r9RDEWmazzTap031EasrGQrxpsNENXZ9nCDd0-f0JJEUs1WuwjFsBFoZvUN5vIMdw=h310",
        "//lh3.googleusercontent.com/6yQaARmVhyKL4hKEYoCrQ0hzh4sPXDEiTZEOs292twkkcBYNO0XQBVjg9-yxcmU450yE=h310",
        "//lh6.ggpht.com/magG9pzeuittTE9oISrCt4ZmnhKYEFZ0cv82er3j48Jai5d2OmgoPuq1XOwIDse2aK8t=h310"
    ],
    "comments": [
        "Perfect for gold LG Urbane The color scheme and black background are perfect on the OLED screen and match the gold color on the watch. Very clean, easy to read and I get a lot of complements.",
        "Very Nice Super crisp and professional looking. Highly recommend this face!",
        "Great ! If possible can you have like a pack of all or at least a large number of your watch faces at a lower price ? Really like all your watchfaces but can't spend $150nearly on all of them XD",
        "Really liking it Love the look of this face! When in ambient mode however with the full watchface displaying there are two horizontal lines one just above the lion gate logo and one just above the centre point of the hands. Is there a way to rectify this? If so it will be 5 stars :)",
        "Looks premium The shiny gold and black works well. Looks especially beautiful on the Moto 360",
        "Great watch. Just wish I could change the color of the hands."
    ],
    "recentChanges": [
        "- Watchface turning square on round watches bug fixed.",
        "- Shortcut menu customizing option bug fixed."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=dd.watchdesigner.blackknight&hl=en&gl=us",
    "appId": "dd.watchdesigner.blackknight"
}