{
    "title": "Achter watchface by Liongate",
    "summary": "Achter watchface by Liongate",
    "icon": "//lh3.googleusercontent.com/26QHY3ptnyDdiRbB8eKlz4Y9hH8Ca9NfO4KqU5PlBysntWUX_wWzY9rTlej51R2LBw=w300",
    "price": "$2.49",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.4,
    "reviews": 88,
    "developer": "WatchMaster",
    "developerId": "7748240321407942094",
    "developerEmail": "watchfacedesigner@gmail.com",
    "developerWebsite": "http://www.watchmastergroup.com/",
    "developerAddress": "6th Fl, NARA bldg., 369, Gangnam-daero, Seocho-gu, Seoul, Korea",
    "updated": "June 29, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "★Please attention★For the Samsung Gear S2 users, please search please search \"Achter by Liongate\" or \"WatchMaster\"  in the Gear apps then you will see the WatchMaster's individual watchfaces. We do not have WatchMaster app for the Tizen right now. We're sorry for the inconvenience.WatchMaster is a watchface designer group who set out to elevate the aesthetic standards of the smartwatch with its unrivaled design quality.This smartwatch watchface for Android Wear is crafted by one of our WatchMaster certified designers. All of our designs, including this watchface, are curated in our WatchMaster app.Features- Watchface for Android Wear Device (Moto 360, Huawei, LG watches, etc.)- Support both round and square displays- Customizable ambient mode, night mode.- Displayed information: numeric date, day of the week, watch battery level, phone battery level- Day and night mode that change according to time of day (06:00, 18:00)How to use1. Once you install the app, the watchface will be automatically transferred to your watch. (may take a few minutes)2. From watch: Long press your watchface and select the one that you have installed.From mobile: Run the “Android Wear” app and tap “More” button in the watchface section3. Enjoy your new watchface!Note1. We stand by our work. If you’re not satisfied with our watchface, you can get a refund upon request within 15 minutes from the point of purchase.2. Before you express your dissatisfaction through rating, please give us a chance to fix it for you. Send us feedback in any language at watchfacedesigner@gmail.com3. Like your watchface? Great! Check out our other cool designs, too! https://goo.gl/X5mQn6Having released several initial designs on our own, we now want to take this project to the next level – to join with other pioneering designers who are equally excited about shaping what smartwatch should look like. We welcome designers of all different styles. We will do our best to put your beautiful works on people’s wrists. Sounds like a lot of fun, right? Contact us at watchfacedesigner@gmail.comWe will continue our endeavor to lead the future of Android Wear watch designs. Thanks for your support!",
    "descriptionHTML": "&#x2605;Please attention&#x2605;<br>For the Samsung Gear S2 users, please search please search &quot;Achter by Liongate&quot; or &quot;WatchMaster&quot;  in the Gear apps then you will see the WatchMaster&apos;s individual watchfaces. We do not have WatchMaster app for the Tizen right now. We&apos;re sorry for the inconvenience.<br><br>WatchMaster is a watchface designer group who set out to elevate the aesthetic standards of the smartwatch with its unrivaled design quality.<br><br><br>This smartwatch watchface for Android Wear is crafted by one of our WatchMaster certified designers. <br>All of our designs, including this watchface, are curated in our <a href=\"http://play.google.com/store/apps/details?id=dd.watchmaster\">WatchMaster app</a>.<br><br><br><b>Features</b><br>- Watchface for Android Wear Device (Moto 360, Huawei, LG watches, etc.)<br>- Support both round and square displays<br>- Customizable ambient mode, night mode.<br>- Displayed information: numeric date, day of the week, watch battery level, phone battery level<br>- Day and night mode that change according to time of day (06:00, 18:00)<br><br><br><b>How to use</b><br>1. Once you install the app, the watchface will be automatically transferred to your watch. (may take a few minutes)<br>2. From watch: Long press your watchface and select the one that you have installed.<br>From mobile: Run the &#x201C;Android Wear&#x201D; app and tap &#x201C;More&#x201D; button in the watchface section<br>3. Enjoy your new watchface!<br><br><br><b>Note</b><br>1. We stand by our work. If you&#x2019;re not satisfied with our watchface, you can get a refund upon request within 15 minutes from the point of purchase.<br>2. Before you express your dissatisfaction through rating, please give us a chance to fix it for you. Send us feedback in any language at watchfacedesigner@gmail.com<br>3. Like your watchface? Great! Check out our other cool designs, too! https://goo.gl/X5mQn6<br><br><br>Having released several initial designs on our own, we now want to take this project to the next level &#x2013; to join with other pioneering designers who are equally excited about shaping what smartwatch should look like. We welcome designers of all different styles. We will do our best to put your beautiful works on people&#x2019;s wrists. Sounds like a lot of fun, right? Contact us at watchfacedesigner@gmail.com<br><br><br>We will continue our endeavor to lead the future of Android Wear watch designs. Thanks for your support!",
    "histogram": {
        "1": 3,
        "2": 4,
        "3": 6,
        "4": 18,
        "5": 57
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/rT2FRyTipSfLVVH1RW-VoV6NOBWyP1uB-k2oeSArQULq-Ok89eJcvXwc5VkTyUkJgbjP=h310",
        "//lh3.googleusercontent.com/JXiRVE5Bj1pacq_zGaFsVrGlXaXyyUK76URuqFIPZGh29eI7KOVGYwxLnO8Gxlfprw=h310",
        "//lh3.googleusercontent.com/MLSojVXEPnLCS1IApadZXC6RHL28Fyw_hGCOAIeQY4bsxNbCYk4JhCgqetViZ7mAHM0=h310",
        "//lh3.googleusercontent.com/2qdtPt_FlN4Q0CJ-TwxrOsmzv334oRx-AcGR6myHHWSw8bPqol1G8iwiaK_VoOJVxCnm=h310",
        "//lh3.googleusercontent.com/Yud_oPdzbjX1cQ4JVFquLUgDfCi9CRON1MbTW2yCXt4mYrBPGEyUuMubetBnQ558vzA=h310",
        "//lh3.googleusercontent.com/h6dzRt_MQi4S_D5Jq_kGtlVG-uXPAaAMy6rh7kOtE-vL5AT2QSD_o7k4sLPc50xVnbY=h310"
    ],
    "comments": [
        "Love it so far. Recommend making settings changes for the watch face with Google Wear app on phone though.",
        "Beautiful",
        "Great Watch Face Only issue I have noticed is while using on the Huewei watch the ambient display when set to \"full\" will drift slightly off center.  Not sure if this is specific to the face or a watch problem.",
        "Good watch face but... You can hardly see the status icons (disconnected, dnd, etc) on the day face... :( seems like it could be an easy fix, and hope it can be fixed.",
        "Great watch face Love the watch face. It is clean and easy to read. Developer has excellent response to emails. It also looks like battery drain is improved using this watch face, at least at first look. I will know more in a few days.",
        "Clean, crisp Great watch face. I haven't switched it out since installing. Very crisp display. Shame about it being soo dull when active tho."
    ],
    "recentChanges": [
        "- Watchface turning square on round watches bug fixed.",
        "- Shortcut menu customizing option bug fixed."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=dd.watchdesigner.achter&hl=en&gl=us",
    "appId": "dd.watchdesigner.achter"
}