{
    "title": "Time Will Come",
    "summary": "A watch face for the stylish adventurer by jewellery designer, Efva Attling.",
    "icon": "//lh3.googleusercontent.com/DxOI9ih3pCf53JcIScdJK_6arzwqGW5cerkkF51WODXuYddMehN-L7kYMN59f5c3JLfD=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.6,
    "reviews": 587,
    "developer": "Efva Attling Stockholm AB",
    "developerId": "Efva+Attling+Stockholm+AB",
    "developerEmail": "customerservice@efvaattling.com",
    "developerWebsite": "http://efvaattling.com",
    "updated": "June 24, 2015",
    "version": "1.0.7",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "This watch face features Attling’s unique Scandinavian style of ‘beauty with a thought’ — a combination of elegant design and inspirational wordplay. The watch face’s functionalities include four stylish themes, separate dials that can be assigned to different timezones, and a progression feature that grants a forward-thinking mantra every 10,000 steps you take.",
    "descriptionHTML": "This watch face features Attling&#x2019;s unique Scandinavian style of &#x2018;beauty with a thought&#x2019; &#x2014; a combination of elegant design and inspirational wordplay. The watch face&#x2019;s functionalities include four stylish themes, separate dials that can be assigned to different timezones, and a progression feature that grants a forward-thinking mantra every 10,000 steps you take.",
    "histogram": {
        "1": 68,
        "2": 65,
        "3": 102,
        "4": 146,
        "5": 206
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/4KOjG4M441gzwoVCuOCLogCcLIabGH1rzW2M49l22Yrep0HB1QV0RsGQYHradp91SIpN=h310",
        "//lh3.googleusercontent.com/MWUfcfPQgcUalU2rUg0JS1xZreHZEyZVT-N2lRIGnZqz8KfUNcoXr4-UnKOAykd8EQ=h310",
        "//lh3.googleusercontent.com/to3huOz8tdgrmdfRibu3DAhu0Xu4MIxr47EX97vh0HKzD1vC-g0pLrA-RLkXE6dj6Fs=h310",
        "//lh3.googleusercontent.com/LqmnWTtLCPlwZJtcx2HOjHvWC_Zgi_jH6e1YKTtpSRabE2rQUjHXcoTWbAluM7CSOzU=h310",
        "//lh3.googleusercontent.com/VEGhXO-PHkA9SrHYHOdD9GGnLMgNKqv4ZyzhPrpgy2DKFwY_IyGh4XJR1AvpWgpf1zg=h310"
    ],
    "comments": [
        "Love it but it eats thru my battery! I like this watch face a lot, however for the two days I've had it running,  my battery ran OUT by 8pm.  With other faces I still had 60% by bedtime.  I don't know what might be causing it,  unless it's the quotes that randomly appear.  I love what the quotes have to say,  in fact that's one of my favorite parts.  However they don't stay long enough to be able to read the tiny text.  I guess it's a good thing they appear often.  If the battery issue is fixed I'll gladly change to a 5 as this is my favorite!",
        "Bad lag graphics compared to most Nice design but the second hand lags and looks broken and pixelated, really bad.  Not many settings so face disappears in just a few seconds, not even enough time to read it...really annoying. Uninstalling, there are many better simple beautiful faces that work great! Needs work!",
        "Pretty, But quotes need to be longer Looks great,  but I can't even read the full quote in time before it goes away, it's like two seconds and is hard to read that quick on such a tiny screen.",
        "My favorite so far! Excellence and elegance all in one simple face! My only complaint is the quote goes away to quickly and I can read it all, otherwise superb.",
        "Wonderful design, horrible resolution. I have a huawei watch and the face looks like garbage, nothing is sharp and it's almost impossible to read the small dial and date because of this.",
        "Quotes make it useless Quote cannot be dismissed and is shown too long."
    ],
    "recentChanges": [
        "- Stability improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=efva.watchface&hl=en&gl=us",
    "appId": "efva.watchface"
}