{
    "title": "Minimum Wear Watch Face",
    "summary": "The classic black and white ideally complement both classic and casual styles",
    "icon": "//lh6.ggpht.com/Q5LLELXpn8ruEoejRXibvc53M3NxaEd2D5FXgJdxq1SzbcqjDYsefdRTuuvLGqK1dRgf=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 50,
    "maxInstalls": 100,
    "score": 3.3,
    "reviews": 7,
    "developer": "Friday Mobi",
    "developerId": "Friday+Mobi",
    "developerEmail": "watchfaces@fridaymobi.eu",
    "developerWebsite": "http://www.fridaymobi.eu",
    "developerAddress": "Jagowstrasse  36a\n10555 Berlin",
    "updated": "February 19, 2015",
    "version": "1.0.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Minimalism is a lifestyle that makes us stop in the here and now to think about the most important things in life and where we’re headed. Those who love simplicity try to ensure that nothing distracts them from achieving their dreams and passions. Minimalists don’t need much to be happy in life. We believe that less means more. We appreciate the simple, the pure, the modern and the classic.That’s why our watch face is minimalistic, with the only role played by the hands and the unpretentious, yet sophisticated, typeface. The classic black and white colors ideally complement both classic and casual styles.Your choice of 3 faces:* light (white), * dark (black)* muted (warm gray)Features:* 3 simple, minimalistic watch faces to choose from* date shown on faceFor watches with both round and square faces.",
    "descriptionHTML": "Minimalism is a lifestyle that makes us stop in the here and now to think about the most important things in life and where we&#x2019;re headed. Those who love simplicity try to ensure that nothing distracts them from achieving their dreams and passions. Minimalists don&#x2019;t need much to be happy in life. <br><br><b>We believe that less means more. We appreciate the simple, the pure, the modern and the classic.</b><br><br>That&#x2019;s why our watch face is minimalistic, with the only role played by the hands and the unpretentious, yet sophisticated, typeface. The classic black and white colors ideally complement both classic and casual styles.<br><br><b>Your choice of 3 faces:</b><br>* light (white), <br>* dark (black)<br>* muted (warm gray)<br><br><b>Features:</b><br>* 3 simple, minimalistic watch faces to choose from<br>* date shown on face<br><br><b>For watches with both round and square faces.</b>",
    "histogram": {
        "1": 1,
        "2": 0,
        "3": 3,
        "4": 2,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh3.ggpht.com/0b-a7rIq2KwuctiH5Ibk8uILULMaK269qj47tAFtXLpnW0nWMu3Q77r6bTQvrgMJuNE=h310",
        "//lh5.ggpht.com/wiltyLI_j8MF8RzFZzJehZm1kRM2rQ0xL7IjrOlGUEBzLpkn2_n2OJwOh2wPMMfW8Q=h310"
    ],
    "comments": [
        "Almost perfect Only criticism is that there's no toggle for the date. As someone with a OLED screen it's a concern that the date area will eventually get burnt in.",
        "What day is it? After using this for 3 days straight, I noticed that the date does not update unless you swap to another face and come back. New one for me and my moto360!",
        "Date is a problem Date doesn't automatically change to the next day and its annoying.. I had to switch to another face and back..",
        "Tried Really wanted it but date is just too tiny..... look better if it wasn't there or choice to make bigger"
    ],
    "recentChanges": [
        "NEW: :configurable panel to choose one from 3 styles: light / dark / muted. Enjoy!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=eu.fridaymobi.whiteplainwatchface&hl=en&gl=us",
    "appId": "eu.fridaymobi.whiteplainwatchface"
}