{
    "title": "TTMMINUS - Wear watch face",
    "summary": "TTMMINUS watch face app for Android Wear - original and minimal",
    "icon": "//lh3.googleusercontent.com/VPeRXVIZ3YoF57gkY22ywU6LTYK1vO_Kr1rQoloBHdcGAKGWA2-9Vn3X0grHVgMHDqE=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.3,
    "reviews": 39,
    "developer": "TIMESAPP",
    "developerId": "7467054096598986330",
    "developerEmail": "albert.salamon@gmail.com",
    "developerWebsite": "https://www.facebook.com/ttmmtowear",
    "developerAddress": "Artur Salamon\nKazimierzowska 4/2\n02-589 Warszawa\nPolska",
    "updated": "May 10, 2017",
    "version": "1.2",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "TTMMINUS is a designer watchface app for Android Wear devices. App has a nine colors customization and works in ambient mode. Three groups of lines, standing for hours, tens of minutes and minutes, separated by a blinking line for seconds. The time of day is indicated by the position of the square: left for am and right for pm. TTMMINUS  is golden A' Design Award Winner in Interface and Interaction Design Category. The future is now. Compatible with Huawei Watch, Motorola Moto 360, LG G Watch, LG G Watch R, Samsung Gear Live, Asus ZenWatch, Sony SmartWatch 3Idea & design : Albert SalamonAndroid programming : Michał Żyliński© 2015 COPYRIGHT Albert Salamon",
    "descriptionHTML": "TTMMINUS is a designer watchface app for Android Wear devices. App has a nine colors customization and works in ambient mode. Three groups of lines, standing for hours, tens of minutes and minutes, separated by a blinking line for seconds. The time of day is indicated by the position of the square: left for am and right for pm. TTMMINUS  is golden A&apos; Design Award Winner in Interface and Interaction Design Category. The future is now. <br><br>Compatible with Huawei Watch, Motorola Moto 360, LG G Watch, LG G Watch R, Samsung Gear Live, Asus ZenWatch, Sony SmartWatch 3<br><br>Idea &amp; design : Albert Salamon<br>Android programming : Micha&#x142; &#x17B;yli&#x144;ski<br><br>&#xA9; 2015 COPYRIGHT Albert Salamon",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 6,
        "4": 9,
        "5": 22
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/etD33qREpjtqeGqZXIyBcgiqFXujBmocNYCgyxH0C8lmSHvCWydDU0LJM58mdx912dk=h310",
        "//lh3.googleusercontent.com/cPHe7_S_fjoS9iIPmahffEM-joG_VNoYUN3xgqfoeiwpc495P37ufOVfV2ZzBCpVqfm8=h310",
        "//lh3.googleusercontent.com/ZH-5Bihj3Jeb9j0V3XYqnH87znMZ_C-u_XtNwHZySxZHTzLa1e7WmsNJMO_LqAVRrZaX=h310",
        "//lh3.googleusercontent.com/e1LWum3-l1dOBesq6adWTQ0VPenj3zbZss5W2RmBaoIuB1ftpzbuXxeTB-xSFkGIGQ=h310",
        "//lh3.googleusercontent.com/6MHeAie1LzHhGjwMLfA53cEvlJXpBQst1pchAL0dMAPiKiD9dgzxiWFQs8eiIEylxk8=h310",
        "//lh3.googleusercontent.com/gEoafPdsdYEWIdawT_E6SvVWpGc4AsLNMSIohQsMAKg_H0NkOvoBm9D4eZ54nTRR6dI=h310",
        "//lh3.googleusercontent.com/M652WnecNsvdv0GOWR9rs13g806kapqblr7oVnAw4yPJ_Zb7UpdORCsv1d92RTY0Wl8=h310"
    ],
    "comments": [
        "I like it but there is no option to keep the color setting in Ambient mode",
        "Love it... futuristic  and weird",
        "Beautiful design. I changed my setting to always on just so I could keep looking at it. Sweet layout. I know it would ruin the minimalistic design to add date but it doesn't have to. I fill out a lot of paperwork at my job and am constantly checking the date so I don't screw up forms.  P.S. works flawlessly on a Moto 360 2nd gen.  -Great Design.",
        "The trick is to NOT think so hard... The first couple of times I looked at this face, I struggled to count the dashes. Literally, about an hour later, I casually (quickly) glanced at the face and knew what time it was. Right after I looked away, I had a WTF moment as it dawned on me that I didn't have to think at all. An amazingly intuitive design!  I do find one thing a little annoying, which cost the app a star: even right after reboot (no apps running), it often stutters on wake, taking a sec to update the time (moto360 1st gen).",
        "Takes a little getting used to but I love it! Low battery usage, clean design. Love it. I do have an idea I'd like to see... What if I could choose between the segments being lines or hexagons? I'd love to see that!",
        "Awesome Took me a while to figure it out (I'm not the fastest thinker) but i finally got it and bought this....great way to tell the time....doesn't have any other features besides time, could maybe use the corners for like stats and weather (on square watches)"
    ],
    "recentChanges": [
        "update resolution"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=eu.ttmm.wear.modelttmminus&hl=en&gl=us",
    "appId": "eu.ttmm.wear.modelttmminus"
}