{
    "title": "Hello bank! par BNP Paribas",
    "summary": "Discover app Hello !, mobile bank like you!",
    "icon": "//lh4.ggpht.com/KRljIF392-3LpKzhETWa4OmRkIYrnlzdZgIRRCTZqQ7QGH4vsBNtp1Cs7ILJ6oU6zNM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 2.8,
    "reviews": 1536,
    "developer": "BNP PARIBAS",
    "developerId": "BNP+PARIBAS",
    "developerEmail": "retail_mobile_france@bnpparibas.com",
    "developerWebsite": "http://www.hellobank.fr",
    "updated": "February 6, 2018",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Découvrez l’appli Hello bank!, mobile comme vous !Une application pour vous accompagner dans tous vos besoins au quotidien.Profitez d’un grand nombre de fonctionnalités depuis votre téléphone mobile, votre tablette ou votre montre connectée qui vous permettront de garder la main sur vos comptes et vos dépenses, où que vous soyez.Retrouvez toutes les fonctionnalités indispensables de votre banque mobile :● Consultation de toutes vos opérations sur les 3 derniers mois● La liste des opérations à venir pour chacune de vos cartes bancaires● Vos virements entre vos comptes et vers vos bénéficiaires enregistrés● La commande de vos chéquiers● Le classement automatique de vos opérations dans des catégories des dépenses et de recettes● La consultation de la synthèse et la valorisation d’un contrat d’assurance vie et de votre portefeuille titres● Éditer votre RIB rapidement● Le paiement sans contact avec votre smartphone via Paylib (mobile compatible NFC). Vous pouvez aussi régler vos achats en ligne simplement et en toute sécurité, sans saisir les données de votre carte bancaire● Vous pouvez payer ou rembourser vos proches avec « Mes transferts ». En quelques clics, vous pouvez transférer votre argent à partir de votre mobile● Rapide et facile, visualisez à tout moment votre portefeuille boursier, suivez l'évolution de vos valeurs et passez vos ordres de bourseSuivez vos dépenses et gardez la main sur vos comptes :● Modifiez les plafonds de vos cartes pour le retrait et le paiement● Consultez les graphiques des opérations passées et à venir ou par catégorie de dépenses et de recettes pour suivre votre budget, mois par moisBesoin d’assistance ?● Par messagerie : échangez de manière sécurisée avec les conseillers Hello bank! directement dans l’application● Par chat : la Hello Team est #lapourvous● Par téléphone : contactez un conseiller, du lundi au vendredi de 8h à 22h et le samedi de 8h à 18h● Retrouvez aussi tous les numéros utiles en cas de perte ou de vol de vos moyens de paiement, et les banques partenaires internationales dans lesquelles faire des retraits à l’étrangerUne appli personnalisable et pensée pour vous :● Personnalisez votre nom, votre compte principal, votre code secret et bien plus encore...● Choisissez d’accéder ou non à certaines infos sur votre compte principal avant même de vous connecter (sans avoir besoin de saisir votre code secret),● Consultez votre solde et la situation de votre compte sous la forme d’une « météo » dès l’écran d’accueil, grâce à des seuils de surveillance que vous paramétrez vous-même● Parrainez vos proches en quelques instants !● Profitez de votre montre connectée Android Wear pour consulter votre solde, Hellobank! se fait maintenant une place sur votre poignet. Elle vous permet de consulter vos 3 dernières opérations et de lancer en un seul geste une session chat ou un appel vers la Hello Team● Renseignez votre numéro de mobile afin d’activer la Clé Digitale, ajouter des comptes bénéficiaires de virement et régler vos achats via PaylibVous n'êtes pas encore client ?● Vivez l’expérience Hello bank! grâce au mode démo et découvrez toutes les fonctionnalités de l’application● Effectuez une demande d'ouverture de compte directement sur votre mobile. Devenez client en quelques minutesA propos de Hello bank!Nous sommes Hello bank! et nous croyons qu’une autre banque est possible :● Une banque plus mobile, avec vous partout où vous allez● Une banque plus souple, qui s’adapte à vos besoins et à vos envies● Une banque plus innovante, attentive aux nouveaux besoins de notre époque adossée à BNP Paribas, banque internationale leader des services bancaires et financiers enEurope, Hello bank! est pensée pour vous accompagner en toute sérénité sur vos projets à court ou long terme.",
    "descriptionHTML": "D&#xE9;couvrez l&#x2019;appli Hello bank!, mobile comme vous !<br>Une application pour vous accompagner dans tous vos besoins au quotidien.<br>Profitez d&#x2019;un grand nombre de fonctionnalit&#xE9;s depuis votre t&#xE9;l&#xE9;phone mobile, votre tablette ou votre montre connect&#xE9;e qui vous permettront de garder la main sur vos comptes et vos d&#xE9;penses, o&#xF9; que vous soyez.<br><br>Retrouvez toutes les fonctionnalit&#xE9;s indispensables de votre banque mobile :<br>&#x25CF; Consultation de toutes vos op&#xE9;rations sur les 3 derniers mois<br>&#x25CF; La liste des op&#xE9;rations &#xE0; venir pour chacune de vos cartes bancaires<br>&#x25CF; Vos virements entre vos comptes et vers vos b&#xE9;n&#xE9;ficiaires enregistr&#xE9;s<br>&#x25CF; La commande de vos ch&#xE9;quiers<br>&#x25CF; Le classement automatique de vos op&#xE9;rations dans des cat&#xE9;gories des d&#xE9;penses et de recettes<br>&#x25CF; La consultation de la synth&#xE8;se et la valorisation d&#x2019;un contrat d&#x2019;assurance vie et de votre portefeuille titres<br>&#x25CF; &#xC9;diter votre RIB rapidement<br>&#x25CF; Le paiement sans contact avec votre smartphone via Paylib (mobile compatible NFC). Vous pouvez aussi r&#xE9;gler vos achats en ligne simplement et en toute s&#xE9;curit&#xE9;, sans saisir les donn&#xE9;es de votre carte bancaire<br>&#x25CF; Vous pouvez payer ou rembourser vos proches avec &#xAB; Mes transferts &#xBB;. En quelques clics, vous pouvez transf&#xE9;rer votre argent &#xE0; partir de votre mobile<br>&#x25CF; Rapide et facile, visualisez &#xE0; tout moment votre portefeuille boursier, suivez l&apos;&#xE9;volution de vos valeurs et passez vos ordres de bourse<br><br>Suivez vos d&#xE9;penses et gardez la main sur vos comptes :<br>&#x25CF; Modifiez les plafonds de vos cartes pour le retrait et le paiement<br>&#x25CF; Consultez les graphiques des op&#xE9;rations pass&#xE9;es et &#xE0; venir ou par cat&#xE9;gorie de d&#xE9;penses et de recettes pour suivre votre budget, mois par mois<br><br>Besoin d&#x2019;assistance ?<br>&#x25CF; Par messagerie : &#xE9;changez de mani&#xE8;re s&#xE9;curis&#xE9;e avec les conseillers Hello bank! directement dans l&#x2019;application<br>&#x25CF; Par chat : la Hello Team est #lapourvous<br>&#x25CF; Par t&#xE9;l&#xE9;phone : contactez un conseiller, du lundi au vendredi de 8h &#xE0; 22h et le samedi de 8h &#xE0; 18h<br>&#x25CF; Retrouvez aussi tous les num&#xE9;ros utiles en cas de perte ou de vol de vos moyens de paiement, et les banques partenaires internationales dans lesquelles faire des retraits &#xE0; l&#x2019;&#xE9;tranger<br><br>Une appli personnalisable et pens&#xE9;e pour vous :<br>&#x25CF; Personnalisez votre nom, votre compte principal, votre code secret et bien plus encore...<br>&#x25CF; Choisissez d&#x2019;acc&#xE9;der ou non &#xE0; certaines infos sur votre compte principal avant m&#xEA;me de vous connecter (sans avoir besoin de saisir votre code secret),<br>&#x25CF; Consultez votre solde et la situation de votre compte sous la forme d&#x2019;une &#xAB; m&#xE9;t&#xE9;o &#xBB; d&#xE8;s l&#x2019;&#xE9;cran d&#x2019;accueil, gr&#xE2;ce &#xE0; des seuils de surveillance que vous param&#xE9;trez vous-m&#xEA;me<br>&#x25CF; Parrainez vos proches en quelques instants !<br>&#x25CF; Profitez de votre montre connect&#xE9;e Android Wear pour consulter votre solde, Hello<br>bank! se fait maintenant une place sur votre poignet. Elle vous permet de consulter vos 3 derni&#xE8;res op&#xE9;rations et de lancer en un seul geste une session chat ou un appel vers la Hello Team<br>&#x25CF; Renseignez votre num&#xE9;ro de mobile afin d&#x2019;activer la Cl&#xE9; Digitale, ajouter des comptes b&#xE9;n&#xE9;ficiaires de virement et r&#xE9;gler vos achats via Paylib<br><br><br>Vous n&apos;&#xEA;tes pas encore client ?<br>&#x25CF; Vivez l&#x2019;exp&#xE9;rience Hello bank! gr&#xE2;ce au mode d&#xE9;mo et d&#xE9;couvrez toutes les fonctionnalit&#xE9;s de l&#x2019;application<br>&#x25CF; Effectuez une demande d&apos;ouverture de compte directement sur votre mobile. Devenez client en quelques minutes<br><br>A propos de Hello bank!<br>Nous sommes Hello bank! et nous croyons qu&#x2019;une autre banque est possible :<br>&#x25CF; Une banque plus mobile, avec vous partout o&#xF9; vous allez<br>&#x25CF; Une banque plus souple, qui s&#x2019;adapte &#xE0; vos besoins et &#xE0; vos envies<br>&#x25CF; Une banque plus innovante, attentive aux nouveaux besoins de notre &#xE9;poque adoss&#xE9;e &#xE0; BNP Paribas, banque internationale leader des services bancaires et financiers en<br>Europe, Hello bank! est pens&#xE9;e pour vous accompagner en toute s&#xE9;r&#xE9;nit&#xE9; sur vos projets &#xE0; court ou long terme.",
    "histogram": {
        "1": 541,
        "2": 210,
        "3": 181,
        "4": 262,
        "5": 342
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/OFcC4_nFPPfFo7KtpCKwsbYJcns_XjfErgbtNR2t1L_cY_9ZI0RSzfm9QZnO1wzGUA=h310",
        "//lh3.googleusercontent.com/v72RLlFpkoc2r88RIpAx6EBT7UoG7Bm6JkmYNNfftO30ssjwAUhyqCzuDxefbnT2d8hf=h310",
        "//lh3.googleusercontent.com/YC-FIWi8F4Xzkn-x7HCejPfX2AWMKUivJBJvEs-v0rt69L6F5bevgJdYigOUqGcsh-8=h310",
        "//lh3.googleusercontent.com/SH6N-VfQeJ44gT8G6VVoNjsFG7vmy1gHF3eUiBwDWl-paASK6Ir8lZ5BCQceKcmCd93T=h310",
        "//lh3.googleusercontent.com/hCaxTeLgGNRnoo7GePKHeNGQpyyCHyVOwNLv1UIRDWX5kKOCyf2cC2hYoIcPSpVAkM0I=h310",
        "//lh3.googleusercontent.com/dqQTnID2Kav0xlxLl6Vu4JTGSIuWkLeUomodhWEeHARF5Ttl-IuYC9LiON38bKzdThY=h310",
        "//lh3.googleusercontent.com/OXvurI_VhDTsF5nsETQGw3flcjQiqXpL55A2kzKtb95bBzCnYgddtvhgcU8-3oltoY3k=h310",
        "//lh3.googleusercontent.com/j_QIgaxG2OrLbY-VTqvKkekTewtnGUqICk7Rn1NEVs37Alv-4qur5CQfO7HwYGBkXtU=h310",
        "//lh3.googleusercontent.com/MhwM5rjVpR39mFEwSf5TY_jc53lMZy1xcLYMV6kzWthIGcV1p6xY0eufjmCP3XgkzA=h310",
        "//lh3.googleusercontent.com/ou7O4suX6dzMzzWgonnSHzawGy5sblUDAMUVuS_LskPDZPwQOF888xlBSCEHyngKebI=h310",
        "//lh3.googleusercontent.com/1N93EGeSG1DLdWy8hQTfXg-JOcgHakB0GFMWJ5odbLgxE9I6TFwpNx8kzIgDA0M6bg=h310",
        "//lh3.googleusercontent.com/MHV4H-pHRQfOsXPFKYjqNp-ZJD5n2LSvs99H6ZE9mAaQxQmQN_tUJfiOEz59181ZUA=h310",
        "//lh3.googleusercontent.com/Xb1z74lO-NqdJPbLCE2GwWF7HLpqYmipgFrkUpHo2Gp_CYidunxWF3rqTb673IIHOFk=h310",
        "//lh3.googleusercontent.com/cGG8ZOacowNoIeHGq7QOky4NVGIXgwl4nsF9F23zQGRMujBbnqHdPJTO4KDZ6md8uM_s=h310"
    ],
    "comments": [
        "Toujours pas de possibilité de se connecter avec empreinte digitale, pas de notification sur un seuil de solde de compte, pas de possibilité de changer les seuils des cartes, rien pour l'international.  L'interface est pas trop mal, même si il y a quand même un gros surplus d'information redondantes et/ou inutiles.",
        "À lot better since the lasts updates !",
        "Une mention spéciale au service PayLib de l'application, dont l'inscription est impossible et après discussion avec des conseillers me demandent d'appeler un numéro surtaxé... Et après on s'étonne que les gens utilisent Apple pay ou bientôt Google Pay...",
        "J'ai un message d'erreur au moment de me connecter depuis au moins une semaine, \"application actuellement indisponible\"...",
        "Messagerie ne marche pas. Gênant pour une banque en ligne",
        "La nouvelle version est vraiment top. Un must. Bravo pour toutes les corrections de bugs et les améliorations visuelles et ergonomiques."
    ],
    "recentChanges": [
        "Correction de bugs et optimisations.",
        "N’hésitez pas à nous laisser des commentaires qui nous aident à améliorer votre application.",
        "La Hello Team est toujours #lapourvous."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=fr.bnpp.digitalbanking&hl=en&gl=us",
    "appId": "fr.bnpp.digitalbanking"
}