{
    "title": "HuskyDEV Atlas Watch Face",
    "summary": "Show your position on map and has built-in launcher and remote music control.",
    "icon": "//lh3.googleusercontent.com/W72Y4ycrGJwsJhNtZOCi7LwtuIOGcjNTliH53EHnhuAq-vP6-chGB72HxDrPc9rEnbJG=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.3,
    "reviews": 421,
    "developer": "HuskyDev",
    "developerId": "8016075941590810026",
    "developerEmail": "huskydevcz@gmail.com",
    "developerWebsite": "https://www.facebook.com/notes/huskydev/husky-dev-cz-privacy-policy/871691609563215",
    "developerAddress": "Weberova 14\nDecin 6\n40502",
    "updated": "February 26, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "The Atlas Watch Face is fully compatible with Android Wear 2.0 and is compatible with all Android Wear watches笘 Android Wear 2.0 integrated features窶｢窶テxternal complication support窶｢窶デully standalone窶｢窶ナPhone compatibleThe Atlas Watch Face is showing your position on the map and is build for using every day, it simplified many use cases such as launching programs, setting brightness and listening music.The application is absolutely free and it has core options, but you can purchase the PREMIUM version with a lot of features and options.FREE version includes:笘 Own launcher笘 Own remote music control笘 Ability to change screen brightness from launcher笘 Weather forecast for current day笘 Detailed information of watch battery and phone battery笘 Google Fit data for current dayPREMIUM version includes:笘 All features from FREE version笘 8 background colors笘 Ability to set map type笘 Ability to set your position on the map.笘 Use Night Mode for power saving features笘 Weather forecast for upcoming hours and days笘 Ability to change battery indicator type. Watches only or dual indicator (phone and watch)笘 Detailed Google Fit data for current day and last 7 days笘 Set two shortcuts with predefined views or actions笘 Set four Quick actions with predefined views or actions or any application on your watches笘 Choosing from three clock dial types笘 Choosing from four marker types笘 Set smooth seconds笘 Ability to change Keep watches screen awake interval笘 Ability to change Weather update interval笘 Ability to change Weather providerThe configuration in companion application contains:笘 Time and date format according to phone settings (12/24)笘 Enable touch feedback笘 Ability to set FULL Ambient mode for OLED displays笘 Show/Hide Battery indicator笘 Show/Hide Google Fit indicator笘 Show/Hide Weather indicator笘 Ability to change temperature units笘 Ability to change wind speed units笘 Information about last weather updateThe HuskyDEV Atlas Watch Face works great with squared and round watches.For using Google Fit data in Atlas Watch Face, you must confirm dialog on start, that application can read data from your phone.Common synchronization problem solution:If the Application does not appear on your watch please do the following:- uninstall the face application from the phone- disconnect watch from phone- restart watch- connect watch and phone again- install Atlas Watch Face once again",
    "descriptionHTML": "<b>The Atlas Watch Face is fully compatible with Android Wear 2.0 and is compatible with all Android Wear watches</b><br><br>&#x2605; <b>Android Wear 2.0 integrated features</b><br>&#x2022;&#x2003;<b>external complication support</b><br>&#x2022;&#x2003;<b>fully standalone</b><br>&#x2022;&#x2003;<b>iPhone compatible</b><br><br>The Atlas Watch Face is showing your position on the map and is build for using every day, it simplified many use cases such as launching programs, setting brightness and listening music.<br><br>The application is absolutely free and it has core options, but you can purchase the PREMIUM version with a lot of features and options.<br><br>FREE version includes:<br>&#x2605; Own launcher<br>&#x2605; Own remote music control<br>&#x2605; Ability to change screen brightness from launcher<br>&#x2605; Weather forecast for current day<br>&#x2605; Detailed information of watch battery and phone battery<br>&#x2605; Google Fit data for current day<br><br>PREMIUM version includes:<br>&#x2605; All features from FREE version<br>&#x2605; 8 background colors<br>&#x2605; Ability to set map type<br>&#x2605; Ability to set your position on the map.<br>&#x2605; Use Night Mode for power saving features<br>&#x2605; Weather forecast for upcoming hours and days<br>&#x2605; Ability to change battery indicator type. Watches only or dual indicator (phone and watch)<br>&#x2605; Detailed Google Fit data for current day and last 7 days<br>&#x2605; Set two shortcuts with predefined views or actions<br>&#x2605; Set four Quick actions with predefined views or actions or any application on your watches<br>&#x2605; Choosing from three clock dial types<br>&#x2605; Choosing from four marker types<br>&#x2605; Set smooth seconds<br>&#x2605; Ability to change Keep watches screen awake interval<br>&#x2605; Ability to change Weather update interval<br>&#x2605; Ability to change Weather provider<br><br>The configuration in companion application contains:<br>&#x2605; Time and date format according to phone settings (12/24)<br>&#x2605; Enable touch feedback<br>&#x2605; Ability to set FULL Ambient mode for OLED displays<br>&#x2605; Show/Hide Battery indicator<br>&#x2605; Show/Hide Google Fit indicator<br>&#x2605; Show/Hide Weather indicator<br>&#x2605; Ability to change temperature units<br>&#x2605; Ability to change wind speed units<br>&#x2605; Information about last weather update<br><br>The HuskyDEV Atlas Watch Face works great with squared and round watches.<br><br>For using Google Fit data in Atlas Watch Face, you must confirm dialog on start, that application can read data from your phone.<br><br>Common synchronization problem solution:<br><br>If the Application does not appear on your watch please do the following:<br>- uninstall the face application from the phone<br>- disconnect watch from phone<br>- restart watch<br>- connect watch and phone again<br>- install Atlas Watch Face once again",
    "histogram": {
        "1": 17,
        "2": 11,
        "3": 41,
        "4": 108,
        "5": 244
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/HyqzSbJauMWMy4TiubLQxFvnQrLWwUV3NfPEMz-FE5TRiKhhVv9jsXGKX3ZdORn0SyU=h310",
        "//lh3.googleusercontent.com/Z-MzSQ7BNF2Tkl-xja8WX8C0xdNsNvrDOmWdsLAi_vQHjqRMVIR2xBP0tF6Vt5PlY5Q=h310",
        "//lh3.googleusercontent.com/PsWm27bXpbUpENMZ98QzwxrTrL0AJGViu1sWfFGeHyPpuWoyh8uH250Z2xkCiNM-Cbk=h310",
        "//lh3.googleusercontent.com/AI6ytxNfi3vTAgKDVLi8djMEgoLMDbVgrX7EgDqn_txQX1d9eixITGxGqG39ppdtHeCc=h310",
        "//lh3.googleusercontent.com/UeA1f9TanFSB9v-V7NMjdpUCjaxuI73sO9uLdKMRVQV6-4BpgpzbBBY2NNdk4lPxyWA=h310",
        "//lh3.googleusercontent.com/OWsRrIp4un31MsLHM3fnW7YWTHGQ85Rn5yHP1LZOq4vV949izfda3MqbiErD21i5Fag=h310",
        "//lh3.googleusercontent.com/CKGDviNZN0DhITS3tdjfrn4B5cJ94b9ITiETXMpxf-TtrTI_To1L9ym3x4lEkT2V5A=h310",
        "//lh3.googleusercontent.com/Ej7Qx0rcNbBGqPpov59nbvlBmpAeEb--Gi4VFOVHw4hFy6-6SpnbPB6Y6IGcFX7ysg=h310"
    ],
    "comments": [
        "The app will not download onto my Motorola 360 2nd gen. I have tried several Husky apps they will not download",
        "Ok",
        "This is a very impressive face.  Besides an original and beautiful face, the customization features are better than those of any of the other 20 or 30 faces I have collected.",
        "Generally a good watch face.  A few minor bugs that have not been addressed in the latest updates, but still worth using on my watch.",
        "Another fantastic watch face the only downside is that it doesn't have all the options that the real weather watch face has keep up the great work 汨交汨",
        "犇霞ｴ伶ｵ財ｴｰ犇ｨ犒坂"
    ],
    "recentChanges": [
        "New:",
        "- Icelandic translation (translated on 7%, thanks to Baldur ﾃ榲ｳrsson)",
        "Updated:",
        "- Polish translation (translated on 47%, thanks to Andrzej ﾅｻmijewski)",
        "- Russian translation (translated on 53%, thanks to all volunteers)",
        "- Chinese translation (translated on 54%, thanks to Andrew Shih)",
        "- Romanian translation (fully translated, thanks to Baban Cﾄフﾄネin-Florian)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=huskydev.android.watchface.atlas&hl=en&gl=us",
    "appId": "huskydev.android.watchface.atlas"
}