{
    "title": "Info Watch Face",
    "summary": "Interactive watch face with cool features like complications, custom launcher...",
    "icon": "//lh3.googleusercontent.com/ITJpHNo6WJDsPakQSkKSctuILxzfilPFQs9ofU-IIIGfZz4VRfD_Euf1mrHUpcQM4g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 223,
    "developer": "HuskyDev",
    "developerId": "8016075941590810026",
    "developerEmail": "huskydevcz@gmail.com",
    "developerWebsite": "https://www.facebook.com/notes/huskydev/husky-dev-cz-privacy-policy/871691609563215",
    "developerAddress": "Weberova 14\nDecin 6\n40502",
    "updated": "February 26, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Info Watch Face is fully compatible with Android Wear 2.0 and is compatible with all Android Wear watches★ Android Wear 2.0 integrated features• external complication support• fully standalone• iPhone compatibleInfo Watch Face with the ability to set 7 indicators with predefined views, actions or watch app shortcut. Info Watch Face is built for using every day, it simplified many use cases such as launching programs, setting brightness and listening music.The application is absolutely free and it has core options, but you can purchase the PREMIUM version with a lot of features and options.FREE version includes:★ Own launcher★ Own remote music control★ Ability to change screen brightness from launcher★ Weather forecast for current day★ Detailed information of watch battery and phone battery★ Google Fit data for current dayPREMIUM version includes:★ All features from FREE version★ Set 7 indicators with predefined views, actions or watch app shortcut★ More than 15 language translations★ Watch battery history chart★ Endless accent colors★ Weather forecast for upcoming hours and days★ Detailed Google Fit data for current day and last 7 days★ Choosing from four battery indicator types★ Choosing from three Google Fit indicator types★ Ability to change Keep watches screen awake interval★ Ability to change Weather update interval★ Ability to change Weather providerThe configuration in the application also contains:★ Time and date format according to phone settings (12/24)★ Enable touch feedback★ Ability to change temperature units★ Ability to change wind speed units★ Information about last weather updateCommon synchronization problem solution:If the Application does not appear on your watch please do the following:- uninstall the face application from the phone- disconnect watch from phone- restart watch- connect watch and phone again- install Info Watch Face once again",
    "descriptionHTML": "<b>Info Watch Face is fully compatible with Android Wear 2.0 and is compatible with all Android Wear watches</b><br><br>&#x2605; <b>Android Wear 2.0 integrated features</b><br>&#x2022;&#x2003;<b>external complication support</b><br>&#x2022;&#x2003;<b>fully standalone</b><br>&#x2022;&#x2003;<b>iPhone compatible</b><br><br>Info Watch Face with the ability to set 7 indicators with predefined views, actions or watch app shortcut. Info Watch Face is built for using every day, it simplified many use cases such as launching programs, setting brightness and listening music.<br><br>The application is absolutely free and it has core options, but you can purchase the PREMIUM version with a lot of features and options.<br><br><br><br>FREE version includes:<br>&#x2605; Own launcher<br>&#x2605; Own remote music control<br>&#x2605; Ability to change screen brightness from launcher<br>&#x2605; Weather forecast for current day<br>&#x2605; Detailed information of watch battery and phone battery<br>&#x2605; Google Fit data for current day<br><br>PREMIUM version includes:<br>&#x2605; All features from FREE version<br>&#x2605; Set 7 indicators with predefined views, actions or watch app shortcut<br>&#x2605; More than 15 language translations<br>&#x2605; Watch battery history chart<br>&#x2605; Endless accent colors<br>&#x2605; Weather forecast for upcoming hours and days<br>&#x2605; Detailed Google Fit data for current day and last 7 days<br>&#x2605; Choosing from four battery indicator types<br>&#x2605; Choosing from three Google Fit indicator types<br>&#x2605; Ability to change Keep watches screen awake interval<br>&#x2605; Ability to change Weather update interval<br>&#x2605; Ability to change Weather provider<br><br>The configuration in the application also contains:<br>&#x2605; Time and date format according to phone settings (12/24)<br>&#x2605; Enable touch feedback<br>&#x2605; Ability to change temperature units<br>&#x2605; Ability to change wind speed units<br>&#x2605; Information about last weather update<br><br><br>Common synchronization problem solution:<br><br>If the Application does not appear on your watch please do the following:<br>- uninstall the face application from the phone<br>- disconnect watch from phone<br>- restart watch<br>- connect watch and phone again<br>- install Info Watch Face once again",
    "histogram": {
        "1": 10,
        "2": 5,
        "3": 19,
        "4": 41,
        "5": 148
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ocoebaOcmwRjo8m7YmrC4LcIC6NijuVvrURuJm5Uoz_MjMb096zWPCzGDMxUCTa7iRI=h310",
        "//lh3.googleusercontent.com/JrNUWhqDKhhlEW33Lpq5dHgDq4EI6RGdiuES62PR5rm6odlKp20gybVx5fpkaIXTSpQ=h310",
        "//lh3.googleusercontent.com/5-fCCH2ky63L8Xt1nXYqw1etSdqn-MVAvL4fhiZrSdACLldMuSVcJ_Z8Vlqy24sxfi0=h310",
        "//lh3.googleusercontent.com/RqYP5qGs6zQhhkxYxTw16SteuZI7kccD-3cacxGR0-y50JpojOlqZ-iBtRom_NpEsQ=h310",
        "//lh3.googleusercontent.com/1pi45v26gYrTsyyKqVWIhfKBRWujkoQ4NkNwS7uqhM0rfY8zgTVCecFlCIyYNVLpY9A=h310",
        "//lh3.googleusercontent.com/0AVhFfyTy0yWrmSOrM7Dna2yNNgdMOit74e5D4reyQZm7ZZTQA2E-Xj7iJzdjxVm5A=h310",
        "//lh3.googleusercontent.com/v2qbxvelq6dlxnDq7IbsqqRwR4j2VSKty3It9dMliULFuVhDxTYiOdFlAKcipYCS7FA=h310"
    ],
    "comments": [
        "It's ok except it no longer shows steps - just distance walked, and doesn't show heart rate - can only link to heart app.",
        "This is a great watch face. It functions as advertised, but has one flaw that I've noticed. It doesn't obey the Android Wear brightness setting. I have my android wear bright setting on the watch set to auto. So in the dark the watch should not be very bright, and in bright light it should be very bright.   Perhaps it is something in the application the developer can look into and fix.This would help a lot with battery life.  Other than that, it is working great. Would have given a 5, except for this one flaw.",
        "If you're an infogeek you'll love this watch face. You can pack so much information and launchers on it you will never feel alone! My favourite is Shazam right on the watch face - so much easier than fumbling for my phone as the music ends before I get it out of my pocket.",
        "Tons of info, fully customizable. Very detailed Fit data and weather info. Features like hourly chime and disconnect notice mean you don't have to install additional apps to get tons of functionality. No downsides, makes my Wear the best it can be.",
        "I can customize the icons on the watch face to quickly launch apps. But everyone my watch disconnects from my phone, I have to restart my watch in order to use the music control feature since it doesn't recognize when my watch reconnects.",
        "Pretty nice and useful face! The controls are kinda small (at least on my watch, Polar M600), but one gets used to it.   Suggestions:  The settings in the phone app could be split in different screens, the way it is now, one has to scroll a lot in order to find a setting.  Option not to show seconds on clock + three-letter month could free up space."
    ],
    "recentChanges": [
        "New:",
        "- Icelandic translation (translated on 7%, thanks to Baldur Þórsson)",
        "Updated:",
        "- Polish translation (translated on 47%, thanks to Andrzej Żmijewski)",
        "- Russian translation (translated on 53%, thanks to all volunteers)",
        "- Chinese translation (translated on 54%, thanks to Andrew Shih)",
        "- Romanian translation (fully translated, thanks to Baban Cătălin-Florian)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=huskydev.android.watchface.info&hl=en&gl=us",
    "appId": "huskydev.android.watchface.info"
}