{
    "title": "EveryDay Watch Face",
    "summary": "EveryDay Watch Face is build for using every day.",
    "icon": "//lh3.googleusercontent.com/NP32zP09q0o_40GN9Hbo0fxP920Fj1JsXGs2DcCCfQZqkSBg6PmbXDjbXhxt4Blyh3w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.2,
    "reviews": 525,
    "developer": "HuskyDev",
    "developerId": "8016075941590810026",
    "developerEmail": "huskydevcz@gmail.com",
    "developerWebsite": "https://www.facebook.com/notes/huskydev/husky-dev-cz-privacy-policy/871691609563215",
    "developerAddress": "Weberova 14\nDecin 6\n40502",
    "updated": "February 26, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "EveryDay Watch Face is fully compatible with Android Wear 2.0 and is compatible with all Android Wear watches★ Android Wear 2.0 integrated features• external complication support• fully standalone• iPhone compatibleEveryDay Watch Face is built for using every day, it simplified many use cases such as launching programs, setting brightness and listening music.EveryDay Watch Face is absolutely free and it has core options, but you can purchase the PREMIUM version with a lot of features and options.FREE version includes:★ Own launcher★ Own remote music control★ Ability to change screen brightness from launcher★ Weather forecast for current day★ Detailed informations of watch battery and phone battery★ Google Fit data for current day★ Ability to set ambient and peek card optionsPREMIUM version includes:★ All features from FREE version★ 8 background colors★ 8 bottom bar colors★ Ability to use one from more than 15 watch face translations★ Use Night Mode for power saving features★ Weather forecast for upcoming hours and days★ Ability to change battery indicator type. Watches only or dual indicator (phone and watch)★ Detailed Google Fit data for current day and last 7 days★ Set two shortcuts with predefined views or actions★ Set four Quick actions with predefined views or actions or any application on your watches★ Ability to change Keep watches screen awake interval★ Ability to change Weather update interval★ Ability to change Weather providerThe configuration in companion application contains:★ Time and date format according to phone settings (12/24)★ Enable touch feedback★ Ability to set Grayscale Ambient mode for OLED displays★ Show/Hide Battery indicator★ Show/Hide Google Fit indicator★ Show/Hide Weather indicator★ Ability to change temperature units★ Ability to change wind speed units★ Information about last weather updateThe HuskyDEV EveryDay Watch Face works great with squared and round watches.For using Google Fit data in EveryDay Watch Face, you must confirm dialog on start, that application can read data from your phone.Common synchronization problem solution:If the Application does not appear on your watch please do the following:- uninstall the face application from the phone- disconnect watch from phone- restart watch- connect watch and phone again- install EveryDay Watch Face once again",
    "descriptionHTML": "<b>EveryDay Watch Face is fully compatible with Android Wear 2.0 and is compatible with all Android Wear watches</b><br><br>&#x2605; <b>Android Wear 2.0 integrated features</b><br>&#x2022;&#x2003;<b>external complication support</b><br>&#x2022;&#x2003;<b>fully standalone</b><br>&#x2022;&#x2003;<b>iPhone compatible</b><br><br>EveryDay Watch Face is built for using every day, it simplified many use cases such as launching programs, setting brightness and listening music.<br><br>EveryDay Watch Face is absolutely free and it has core options, but you can purchase the PREMIUM version with a lot of features and options.<br><br>FREE version includes:<br>&#x2605; Own launcher<br>&#x2605; Own remote music control<br>&#x2605; Ability to change screen brightness from launcher<br>&#x2605; Weather forecast for current day<br>&#x2605; Detailed informations of watch battery and phone battery<br>&#x2605; Google Fit data for current day<br>&#x2605; Ability to set ambient and peek card options<br><br>PREMIUM version includes:<br>&#x2605; All features from FREE version<br>&#x2605; 8 background colors<br>&#x2605; 8 bottom bar colors<br>&#x2605; Ability to use one from more than 15 watch face translations<br>&#x2605; Use Night Mode for power saving features<br>&#x2605; Weather forecast for upcoming hours and days<br>&#x2605; Ability to change battery indicator type. Watches only or dual indicator (phone and watch)<br>&#x2605; Detailed Google Fit data for current day and last 7 days<br>&#x2605; Set two shortcuts with predefined views or actions<br>&#x2605; Set four Quick actions with predefined views or actions or any application on your watches<br>&#x2605; Ability to change Keep watches screen awake interval<br>&#x2605; Ability to change Weather update interval<br>&#x2605; Ability to change Weather provider<br><br>The configuration in companion application contains:<br>&#x2605; Time and date format according to phone settings (12/24)<br>&#x2605; Enable touch feedback<br>&#x2605; Ability to set Grayscale Ambient mode for OLED displays<br>&#x2605; Show/Hide Battery indicator<br>&#x2605; Show/Hide Google Fit indicator<br>&#x2605; Show/Hide Weather indicator<br>&#x2605; Ability to change temperature units<br>&#x2605; Ability to change wind speed units<br>&#x2605; Information about last weather update<br><br><br>The HuskyDEV EveryDay Watch Face works great with squared and round watches.<br><br>For using Google Fit data in EveryDay Watch Face, you must confirm dialog on start, that application can read data from your phone.<br><br>Common synchronization problem solution:<br><br>If the Application does not appear on your watch please do the following:<br>- uninstall the face application from the phone<br>- disconnect watch from phone<br>- restart watch<br>- connect watch and phone again<br>- install EveryDay Watch Face once again",
    "histogram": {
        "1": 32,
        "2": 17,
        "3": 45,
        "4": 132,
        "5": 299
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/-TtH46DUKNpjvDkmEXwQSPXd6FYl_fqEPMaVLZVhMc6Lwv9QEJ-8s5DTUbAjmBpXhe0=h310",
        "//lh3.googleusercontent.com/elYlIJjODITsfG6bo9Tof99rc0U2YHfzzKvj_bFmhvP-n6iRRwlwnICRg6teb2fuyoo=h310",
        "//lh3.googleusercontent.com/H5We23SqOO8sTg8g_Ku1AKinQ0P-VsVU220KHCaawu9IriD2qIkLVdcMaLCkfldq6RrS=h310",
        "//lh3.googleusercontent.com/4Z2f54wr5y3e0LLX5fg24CamilLdXtcJPLI3mvOHSSI-tteefHmDTPNH1g98rQi7X_8=h310",
        "//lh3.googleusercontent.com/MVEq8i7UQhsHMO2OQcOfPVlbYbqsuDKFlyC8KihrU3hGbj5H3WpJtdqa8bZtKrhj-mc=h310",
        "//lh3.googleusercontent.com/f4copf__Ir6bSycxhIyKqv66c1x5_mKeG6cAe-kCS-ZZLddEj22vLCZZq3jOjm0lNUY=h310"
    ],
    "comments": [
        "Love this watch face, wish it had better color options but it's still my go to for everyday use.  Dev is great too, had an issue from a previous purchase and they got it resolved within a day. Very happy to support great people like this!",
        "No links to texts and email",
        "So far, this is my favorite watch face. Tried free version then immediately purchased full version. I love it!",
        "Only 4 stars because the toggle switch should have a NFC switch and should be able to remove the weather icon on the left of the clock. Other than that very customizable, love the app drawer and interface. Very minimal looking face with a app drawer which I've been looking for ever since owning my LG Watch Sport.   Note to the developer:  look into adding a NFC switch into the toggle switch menu and give us the option to remove the weather icon next to the clock since most of us have a weather widget already on the face or make it a weather widget with the temperature... Seems redundant. Hopefully in a future update",
        "Looked nice but it was too much for my zenwatch 2. Caused massive battery drain, a random reboot and made my watch very laggy. Might be better on a Snapdragon wear 2100 watch",
        "Please give me a refund. Dialer does not work and stopped my Zenwatch 2. Now it is a brick"
    ],
    "recentChanges": [
        "New:",
        "- Icelandic translation (translated on 7%, thanks to Baldur Þórsson)",
        "Updated:",
        "- Polish translation (translated on 47%, thanks to Andrzej Żmijewski)",
        "- Russian translation (translated on 53%, thanks to all volunteers)",
        "- Chinese translation (translated on 54%, thanks to Andrew Shih)",
        "- Romanian translation (fully translated, thanks to Baban Cătălin-Florian)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=huskydev.android.watchface.everydayfree&hl=en&gl=us",
    "appId": "huskydev.android.watchface.everydayfree"
}