{
    "title": "Real Weather Watch Face Reborn",
    "summary": "Interactive Watch Face, cute animations and custom background for every weather.",
    "icon": "//lh3.googleusercontent.com/aK_mEnwEoY7r9YIRJAE6HL35765x6rnXnU6uA0kclWLoUYEEVkxYhjOKOg42GDUbtC8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 1477,
    "developer": "HuskyDev",
    "developerId": "8016075941590810026",
    "developerEmail": "huskydevcz@gmail.com",
    "developerWebsite": "https://www.facebook.com/notes/huskydev/husky-dev-cz-privacy-policy/871691609563215",
    "developerAddress": "Weberova 14\nDecin 6\n40502",
    "updated": "February 26, 2018",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "Real Weather Watch Face Reborn is fully compatible with Android Wear 2.0 and is compatible with all Android Wear watches★ Android Wear 2.0 integrated features• external complication support• fully standalone• iPhone compatibleCute and nice looking animations. Custom background for every weather.The application is absolutely free and it has core options, but you can purchase the PREMIUM version with a lot of features and options.FREE version includes:★ Background image is changing according to current weather★ Animations of sun, moon, clouds, rain, raindrops, lightnings, snowing★ Own launcher★ Own remote music control★ Ability to change screen brightness from launcher★ Weather forecast for current day★ Detailed information of watch battery and phone battery★ Google Fit data for current dayPREMIUM version includes:★ All features from FREE version★ Endless accent colors★ More than 18 translations★ More than 15 date formats★ Use Night Mode for power saving features★ Weather forecast for upcoming hours and days★ Ability to change battery indicator type. Watches only or dual indicator (phone and watch)★ Detailed Google Fit data for current day and last 7 days★ Set two shortcuts with predefined views or actions★ Set four Quick actions with predefined views or actions or any application on your watches★ Choosing from three clock dial types★ Choosing from four marker types★ Ability to change Keep watches screen awake interval★ Ability to change Weather update interval★ Ability to change Weather providerThe configuration in companion application contains:★ Time and date format according to phone settings (12/24)★ Enable touch feedback★ Ability to set FULL Ambient mode for OLED displays★ Show/Hide Battery indicator★ Show/Hide Google Fit indicator★ Show/Hide Weather indicator★ Ability to change temperature units★ Ability to change wind speed units★ Information about last weather updateThe HuskyDEV Real Weather Reborn Watch works great with squared and round watches.For using Google Fit data in Real Weather Watch Face, you must confirm dialog on start, that application can read data from your phone.Common synchronization problem solution:If the Application does not appear on your watch please do the following:- uninstall the face application from the phone- disconnect watch from phone- restart watch- connect watch and phone again- install Real Weather Reborn Watch Face once again",
    "descriptionHTML": "<b>Real Weather Watch Face Reborn is fully compatible with Android Wear 2.0 and is compatible with all Android Wear watches</b><br><br>&#x2605; <b>Android Wear 2.0 integrated features</b><br>&#x2022;&#x2003;<b>external complication support</b><br>&#x2022;&#x2003;<b>fully standalone</b><br>&#x2022;&#x2003;<b>iPhone compatible</b><br><br>Cute and nice looking animations. Custom background for every weather.<br><br>The application is absolutely free and it has core options, but you can purchase the PREMIUM version with a lot of features and options.<br><br>FREE version includes:<br>&#x2605; Background image is changing according to current weather<br>&#x2605; Animations of sun, moon, clouds, rain, raindrops, lightnings, snowing<br>&#x2605; Own launcher<br>&#x2605; Own remote music control<br>&#x2605; Ability to change screen brightness from launcher<br>&#x2605; Weather forecast for current day<br>&#x2605; Detailed information of watch battery and phone battery<br>&#x2605; Google Fit data for current day<br><br>PREMIUM version includes:<br>&#x2605; All features from FREE version<br>&#x2605; Endless accent colors<br>&#x2605; More than 18 translations<br>&#x2605; More than 15 date formats<br>&#x2605; Use Night Mode for power saving features<br>&#x2605; Weather forecast for upcoming hours and days<br>&#x2605; Ability to change battery indicator type. Watches only or dual indicator (phone and watch)<br>&#x2605; Detailed Google Fit data for current day and last 7 days<br>&#x2605; Set two shortcuts with predefined views or actions<br>&#x2605; Set four Quick actions with predefined views or actions or any application on your watches<br>&#x2605; Choosing from three clock dial types<br>&#x2605; Choosing from four marker types<br>&#x2605; Ability to change Keep watches screen awake interval<br>&#x2605; Ability to change Weather update interval<br>&#x2605; Ability to change Weather provider<br><br>The configuration in companion application contains:<br>&#x2605; Time and date format according to phone settings (12/24)<br>&#x2605; Enable touch feedback<br>&#x2605; Ability to set FULL Ambient mode for OLED displays<br>&#x2605; Show/Hide Battery indicator<br>&#x2605; Show/Hide Google Fit indicator<br>&#x2605; Show/Hide Weather indicator<br>&#x2605; Ability to change temperature units<br>&#x2605; Ability to change wind speed units<br>&#x2605; Information about last weather update<br><br>The HuskyDEV Real Weather Reborn Watch works great with squared and round watches.<br><br>For using Google Fit data in Real Weather Watch Face, you must confirm dialog on start, that application can read data from your phone.<br><br>Common synchronization problem solution:<br><br>If the Application does not appear on your watch please do the following:<br>- uninstall the face application from the phone<br>- disconnect watch from phone<br>- restart watch<br>- connect watch and phone again<br>- install Real Weather Reborn Watch Face once again",
    "histogram": {
        "1": 59,
        "2": 41,
        "3": 113,
        "4": 352,
        "5": 912
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/eQNQJYJ_0HSP4m9HYxctMIUwndNPvihXuYKHD87WcBtRem9YYIlOgS_LHwag8SJcDzA=h310",
        "//lh3.googleusercontent.com/PlG3sulqgHetpI82f46opD3C0s1cXKPbHfJjm3C0Vmt22_AGHLOFAYtnVBLkOifNag=h310",
        "//lh3.googleusercontent.com/M3vDDg4R1c6EKfn6SlyGSYhFGoj4xZESUx_XT9LUCOYDCYPDgBMIdr8fZ9eXlfjuasA=h310",
        "//lh3.googleusercontent.com/RY0i4woAUpCpNp5X_-WByNoRiIHMK_3yIEvcXMW062-7ElROvIFNFxqcTLv9Vq3_4H0=h310",
        "//lh3.googleusercontent.com/ut7e5STQnsXLrL9QxwMcGgAuic1TapSCvgNbty3S5SX7teSQKnM2BibE7cEv-j1fmg=h310",
        "//lh3.googleusercontent.com/O_-GiFMgSQU5A4llHnWgpRyAe-gr3jUU9sCTPNVnxG708VOQV_SBo7ai_LN1U54ekFo=h310"
    ],
    "comments": [
        "This is a beautiful watch face with all the functions I need as customisations.  I bought the premium version.",
        "love it",
        "This is a beautiful, full-featured watch face.  My only complaint is that it's supposedly focused on the weather (it's in the name, after all) but unless my watch GPS is enabled, the weather only updates if I force it to from the phone app. I have the full version and I have it set to update every hour in the app but it doesn't. The \"update\" feature won't work from the watch, either.   I'm using a Ticwatch E.   It would be nice if the weather auto updates would work for my device using the phone-only location setting.",
        "My favorite watch face.  Nothing else I have tried comes close.  The options for launching apps is unsurpassed.  Love the real time weather view (get compliments on it all the time).  Also love the custimization.",
        "One of my favourite faces.",
        "Pity that having bought premium, it only applies to one watch face.  There should be at least a substantial discount on extra faces in the set. After a while, the weather update stops working, and I have to switch off a nd restart my phone to get an update.  Restarting alone does not work, and this procedure is needed, then for every update. This is a pity. This is an otherwise excellent app, though it is somewhat unstable.  A few less bells and whistles would be better, if that improved stability."
    ],
    "recentChanges": [
        "New:",
        "- Icelandic translation (translated on 7%, thanks to Baldur Þórsson)",
        "Updated:",
        "- Polish translation (translated on 47%, thanks to Andrzej Żmijewski)",
        "- Russian translation (translated on 53%, thanks to all volunteers)",
        "- Chinese translation (translated on 54%, thanks to Andrew Shih)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=huskydev.android.watchface.realweather2&hl=en&gl=us",
    "appId": "huskydev.android.watchface.realweather2"
}