{
    "title": "Pop Watch Face",
    "summary": "Pop Watch Face - your smartwatch looks differently.",
    "icon": "//lh4.ggpht.com/F7xphQAjDnel18vWI-L4bdRrt0COjPG1gHeRv6TS9bIM7RTLDiTHJw1zrjLu0p0pVQ=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.5,
    "reviews": 488,
    "developer": "Ikubyx",
    "developerId": "Ikubyx",
    "developerEmail": "reda.ze@gmail.com",
    "developerAddress": "Paris, CP 75008",
    "updated": "April 22, 2015",
    "version": "1.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Look at your smartwatch differently, Pop Watch face is the best way to get the time with a sprig of happinessWatch face features:★ Watch battery indicator★ Date, day and month★ 24HR/12HR AM PM Format★ Theme chooser★ Smooth effect control★ Remove hour leading zero in options16 themes:★ Pop Party Face★ Pop Candy Face★ Pop Autumn Face★ Pop Retro Face★ Pop Dark Face★ And more....How to installSome minutes after the app installed on your phone, the watch face will be copied to your watch automatically. If this does not happen, run 'Resync apps' from settings of the Android Wear App. Use the companion app to adjust  according to your preferences the behavior of the watchface. Please let us know if you run into any troubles.Where can i find the companion app to customise the face?- On your watch when you want to change your watch face after a long tape on the screen, at the bottom of Pop Watch Face preview there is a settings icon, just tape it to access companion appMore faces are coming soon, and more features so follow us :)",
    "descriptionHTML": "Look at your smartwatch differently, Pop Watch face is the best way to get the time with a sprig of happiness<br><br><br><b>Watch face features:</b><br><br>&#x2605; Watch battery indicator<br>&#x2605; Date, day and month<br>&#x2605; 24HR/12HR AM PM Format<br>&#x2605; Theme chooser<br>&#x2605; Smooth effect control<br>&#x2605; Remove hour leading zero in options<br><br><br><b>16 themes:</b><br><br>&#x2605; Pop Party Face<br>&#x2605; Pop Candy Face<br>&#x2605; Pop Autumn Face<br>&#x2605; Pop Retro Face<br>&#x2605; Pop Dark Face<br>&#x2605; And more....<br><br><br><b>How to install</b><br>Some minutes after the app installed on your phone, the watch face will be copied to your watch automatically. If this does not happen, run &apos;Resync apps&apos; from settings of the Android Wear App. Use the companion app to adjust  according to your preferences the behavior of the watchface. Please let us know if you run into any troubles.<br><br><br><b>Where can i find the companion app to customise the face?</b><br>- On your watch when you want to change your watch face after a long tape on the screen, at the bottom of Pop Watch Face preview there is a settings icon, just tape it to access companion app<br><br><br>More faces are coming soon, and more features so follow us :)",
    "histogram": {
        "1": 12,
        "2": 6,
        "3": 32,
        "4": 104,
        "5": 334
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/2tsW59wIIBrEWaJAIfACl8ozVIO5U1Ck9sVMsWXRN5rkZC4KRklb0UGh9JhYyM2tFuU=h310",
        "//lh3.googleusercontent.com/4iSZFhZ0DsjrZZVzckej8fEP0obnBy_D_15uPLzuuIxfye6VTdsHOpKmd20GJHo_cw=h310",
        "//lh6.ggpht.com/VD23t_VQ8Cvgww7G0X8O1b0xWtPPzNlICXXti8oyvpyXujOyR8t7eMGdW6rGikq9wd4=h310",
        "//lh6.ggpht.com/XRpaB85mABd-LeJPfIudPWmH9qaDcSxhsjmLtePT9R3o_feTUfYNBzyx2ZWrsAGOJA=h310",
        "//lh6.ggpht.com/Kp6AAEREtUpStUKZPqcAMjpuUrWlQlOKn3FPf9julDhqTHMsrizxVkGBUDOH12ASHv4=h310",
        "//lh4.ggpht.com/AkLPlhDg9QLRyaNs5fkV_6B69euGfO003xReAJNNKiHppWPwQ7vDDiQxA7LDCTBUqg=h310",
        "//lh6.ggpht.com/9zVVn-AC4GEC8LWblZsNdONgsiutHxzmlkyISDuU0LIyPkbqVaTpYM0Lb2UlNifE_o4w=h310"
    ],
    "comments": [
        "Great looking and performing watch face I have owned a Sony Smart Watch 3 for a week now and have been looking for a simple but good looking and unique watch face since then...I found it with pop watch face.  lots of options for colour, look and feel to choose from and I'm pleased to say that my battery life hasn't been affected as others have reported. I charged my watch around 20 hours ago while using this face and still have 59% left now! I was a bit worried at first that the battery life would be negatively affected but clearly not an issue.  Looking forward to future updates :)",
        "Sleek watchface! Really nice watch face. I usually only stick to the stock ones but this one is an exception. I love the sleek look and the customizable options available. Only issue that is very minor is that ever time I take my Moto 360 out of the charger, the options for the watchface screen comes up and I have to press the button to close it. Besides this, I highly recommend this",
        "Once Working, Love It! [UPDATE] Finally got it to install, and yeah it took a while for my watch to finally get it synced up, but it was worth the wait! Best watch-face available yet!  I've tried everything from restarting it and syncing the apps and it just isn't installing. I'll update this if it starts working!",
        "looks good I use Smartwatch 3, this watch face looks good on it. The color and B&W ambient mode is not working (always look plain white), is that SW3's limitation? or I configure something wrong? Please add option to disable the ticking square, on round watch it look good but on square watch not really.",
        "My searching ends here.. The first time I saw this watch face was by someone from Oh! Media (Malaysia blog).. I just fall in love with this watch face.. I was looking for it since last 5 months, asking Android Authority, Oh! Media, my friends who used Moto 360 (I thought it's Moto 360 stock watch face) if they knew about this watch face.. But no one reply me.. And just a few days ago, as I was looking for a new watch faces, I bumped into this perfect watch face.. Quickly I registered my card and buy this watch face app. Thank you..",
        "Awesome watch face I find myself using this watch face the most on my moto 360 and it has worked out great! However, could the color change menu be a scroll menu instead of a tap to change? It becomes tedious to cycle through the options. Fix that, and it'll be perfect in my eyes!"
    ],
    "recentChanges": [
        "★ Fix : switchin from white/black to black/white skin after restart"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ikubyx.com.popwatchface&hl=en&gl=us",
    "appId": "ikubyx.com.popwatchface"
}