{
    "title": "Backlash Watch Faces",
    "summary": "Watch face with stunning design features and first ever phone unlock counter.",
    "icon": "//lh3.googleusercontent.com/i34SbO9O90ZSbjvGN6HenOaVXCXGwdcChQQtugXErW_KjH9SGm9aQToxmA2zyjrZPCz-=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.1,
    "reviews": 84,
    "developer": "Inside Globe Inc",
    "developerId": "7405579135705342632",
    "developerEmail": "wearables@insideglobe.com",
    "developerWebsite": "http://www.insideglobe.com",
    "developerAddress": "2711 Centerville Road Suite 400\nWilmington, DE 19808",
    "updated": "June 15, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "There's backlash about everything we do -Lana Del Rey\". Here, It backlashes the    existing designs and it would be difficult for you to choose one from the many attractive designsWhat you get:★\tIt monitors your heartbeat★\tIt counts your steps.★\tIt shows the temperature of your location.★\tSet the location settings in your phone.★\tSet the time interval to see the temperature or stop it temporarily.★\tIt shows the battery status of your phone and watchWhat is Unique?★\tIt has a unique phone Unlock Counter. You could know the number of times you unlocked your phone in a day.★\tON/ Off provided in the sensor settings let you save the battery★\tAttractive Designs and Color Faces★\tAll operations are simple and you have to simply press and swipe to get the widgetsJust a Click:   To know more about Backlash Watch Face visit - http://insideglobe.com/watch-face-with-unique-phone-unlock-counter/Share Your Idea:   If you wish to suggest us your idea of any additional widgets, Please contact us at (wearables@insideglobe.com)Note: The watch Faces is not for all the smart watches but only android wear watches paired with android phone(4.3+)Requires Android Wear - supports the following watches :• Motorola 360 (1st , 2nd gen and sport)• Huawei Watch• ASUS Zen Watch 2• LG G Watch• LG G Watch R• TAG Heuer Connected• Fossil Q Founder• LG Watch Urbane• Sony Smart Watch 3• Samsung Gear Live",
    "descriptionHTML": "There&apos;s backlash about everything we do -Lana Del Rey&quot;. Here, It backlashes the    existing designs and it would be difficult for you to choose one from the many attractive designs<br><br><b>What you get:</b><br>&#x2605;\tIt monitors your heartbeat<br>&#x2605;\tIt counts your steps.<br>&#x2605;\tIt shows the temperature of your location.<br>&#x2605;\tSet the location settings in your phone.<br>&#x2605;\tSet the time interval to see the temperature or stop it temporarily.<br>&#x2605;\tIt shows the battery status of your phone and watch<br><br><b>What is Unique?</b><br>&#x2605;\tIt has a unique phone Unlock Counter. You could know the number of times you unlocked your phone in a day.<br>&#x2605;\tON/ Off provided in the sensor settings let you save the battery<br>&#x2605;\tAttractive Designs and Color Faces<br>&#x2605;\tAll operations are simple and you have to simply press and swipe to get the widgets<br><br><b>Just a Click:</b><br>   To know more about Backlash Watch Face visit - http://insideglobe.com/watch-face-with-unique-phone-unlock-counter/<br><br><b>Share Your Idea:</b><br>   If you wish to suggest us your idea of any additional widgets, Please contact us at (wearables@insideglobe.com)<br><br><b>Note: The watch Faces is not for all the smart watches but only android wear watches paired with android phone(4.3+)</b><br><br>Requires Android Wear - supports the following watches :<br>&#x2022; Motorola 360 (1st , 2nd gen and sport)<br>&#x2022; Huawei Watch<br>&#x2022; ASUS Zen Watch 2<br>&#x2022; LG G Watch<br>&#x2022; LG G Watch R<br>&#x2022; TAG Heuer Connected<br>&#x2022; Fossil Q Founder<br>&#x2022; LG Watch Urbane<br>&#x2022; Sony Smart Watch 3<br>&#x2022; Samsung Gear Live",
    "histogram": {
        "1": 13,
        "2": 17,
        "3": 15,
        "4": 25,
        "5": 14
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/31Y9e0GS8ZeJlkAlwANkzS1_6Gw91EF1TrcR2b-_6gtOqR7v4JG0c0vln-_kbfLOalOT=h310",
        "//lh3.googleusercontent.com/DQIbsoy1zG9iVdPqxlmfj-LoUco938-VajGQKFzCP6eVsAPLyt3aAz-VPvRqr2SBzw=h310",
        "//lh3.googleusercontent.com/7Qn--k6xvHXFoxwyxBrx7Wpuc4lV4tIM4C9Tez67NPa6wt9aCUgjXRAQbxgD5hbfzYfE=h310",
        "//lh3.googleusercontent.com/3g6t04vTEVxtaIb3vnhgSGCAY_G9CvS7lJ-6NSEMT27v3Z32rJUMjwolCherkB0OEffa=h310",
        "//lh3.googleusercontent.com/pkQB92QFAV9MX6WxPwVcjMooqDPoWtM00PB7p3svJdvS0D3oHthTl64Mr5Qtx768H9s=h310",
        "//lh3.googleusercontent.com/tO-ICCUqOkQuw6BSSvzahPfVRuKZZAYYDZn8Vv_j7_q1jM09rJWwAyPtPKcVnE5SlsVe=h310",
        "//lh3.googleusercontent.com/4qpcMbesJ-MxSpSrhav__M-7MgIWS0GlPe5ZVqXEO19t1OU8JieZrIZ7Z-_0SQSv8w=h310",
        "//lh3.googleusercontent.com/hydRS_QDkb_OwEu95sn3Xr6RG9qIshT3yKLfDFIZ3C6oAe2_BWuAp8j8itRydZiH_aw=h310",
        "//lh3.googleusercontent.com/EqxkDr-z7fcGpoTWDXc6kAG5trSD1rnAFemZmZ_CXuQU6S9gjF2wBmKjWtd1yH7e3yE=h310"
    ],
    "comments": [
        "Execution could be better Nice inspired design, but the hands tend to blend into the background, making them hard to see. Also, the weather always displays 32°F and never updates. Oh, and two mobile battery meters seems a little redundant.",
        "Love the look of this watch face, but I have to agree with some other users. I would love to have the capability to adjust digital clock (12/24hr Mode), and disable indicators (rather than just off), google fit integration (Not a fan of software running its own calculation on steps), adjust second hand to a firmer motion (rather than smooth, consuming more battery life), but I still love the look!. I am having a problem where the hands are in the background , the phone battery always shows low (even with 100% charge), and the color settings do not stay locked in upon waking, it keeps defaulting to tan.",
        "Love the look But functionality is getting brutal. Says I do not a functioning heart rate monitor. Sliding down the options menu changes the color of watch if unlocked. Wish I could change options from phone. Also edit location of stats on face. Edit: after uninstalled and reset phone. Heart rate works after install.E dit 2: still no improvement. Re-rated stars. Uninstalled.",
        "Really!? I could tolerate your excessive advertising on  reddit, because the watch face is not actually that bad, but now I get a freaking advertisement in my notifications!? Because of an app I paid for!? That is just too greedy. I urge not to buy this, since the dev is obviously just a greedy SOB",
        "Meh. It looked promising, but has some issues. At first glance, this watch face looks great, but, once it's on your wrist, you notice quite a few problems. The digital clock is showing 9:3 instead of 9:03, you can read the analog hands between the 11 and 1 markings, the thick white horizontal white line in the middle of the face is too thick and distracting, and there's not enough freedom to change the colors as you see fit.",
        "Really nice. This watch face is really nice. The only problem I have is I can not figure out how to change the digital time display to normal time instead of army time."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=insideglobe.watch.face.backlashwatchfaces&hl=en&gl=us",
    "appId": "insideglobe.watch.face.backlashwatchfaces"
}