{
    "title": "Wear for Swarm",
    "summary": "Swarm (aka Foursquare) for Android Wear!",
    "icon": "//lh4.ggpht.com/PQSA4tEayq751OSxDZZ0_6FC8r_BriWQj95Ah5sodx5Iv6pdZw975kidXrcIyLGTS6U=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.9,
    "reviews": 168,
    "developer": "GENERIFY.IO",
    "developerId": "GENERIFY.IO",
    "developerEmail": "ondra@seal.io",
    "developerWebsite": "http://www.seal.io",
    "updated": "November 27, 2014",
    "version": "1.14",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Features* List nearby Foursquare places* Make a checkin on selected place* Stay notified about nearby places available for check-inDetailsWith Wear for Swarm you can search for nearby Foursquare places and make a check-in directly from your Android Wear device.With \"Automatic notifications\" you can be notified about places around you every time another application asks for position (it uses passive location provider only - no additional battery consumption) in minimal interval 15 minutes and minimum displacement 35 meters. This feature must be enabled in \"Settings\".How to use it1) Launch Wear for Swarm from your mobile phone or tablet2) Login to Foursquare3) Go to wearable applications menu5) Select application Wear for Swarm and wait few seconds6) Select actual place for check-in7) Wait 5 seconds to confirm check-in. Checked-in!Please let me know your experience and feedback!Application source code:https://github.com/sealskej/wear-for-swarmThis app uses the Foursquare API but is not affiliated with or endorsed by Foursquare Labs, Inc.",
    "descriptionHTML": "Features<br><br>* List nearby Foursquare places<br>* Make a checkin on selected place<br>* Stay notified about nearby places available for check-in<br><br>Details<br><br>With Wear for Swarm you can search for nearby Foursquare places and make a check-in directly from your Android Wear device.<br><br>With &quot;Automatic notifications&quot; you can be notified about places around you every time another application asks for position (it uses passive location provider only - no additional battery consumption) in minimal interval 15 minutes and minimum displacement 35 meters. This feature must be enabled in &quot;Settings&quot;.<br>How to use it<br><br>1) Launch Wear for Swarm from your mobile phone or tablet<br>2) Login to Foursquare<br>3) Go to wearable applications menu<br>5) Select application Wear for Swarm and wait few seconds<br>6) Select actual place for check-in<br>7) Wait 5 seconds to confirm check-in. Checked-in!<br><br><br>Please let me know your experience and feedback!<br><br>Application source code:<br>https://github.com/sealskej/wear-for-swarm<br><br>This app uses the Foursquare API but is not affiliated with or endorsed by Foursquare Labs, Inc.",
    "histogram": {
        "1": 13,
        "2": 12,
        "3": 24,
        "4": 45,
        "5": 74
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/WQnhmF8VAfjBTwmzPYAbK8vRwkGODJ4pHC_MUvNTn33yZDlFpcHxZxM09a5L1wlT8A=h310",
        "//lh6.ggpht.com/hpCCUT5WNUzJ8L3qv6GnSyOXha4sWWaWSLXz3t_VORR4m25b2q42VO-xP3agehzyBw=h310",
        "//lh4.ggpht.com/gRG_hfDOFTtDJ8c9hQ00_FCRvOI5MDFEqbOx5w4-d4VtH1PPbEWjnjzGOsCQO4CPTs0=h310",
        "//lh6.ggpht.com/glNPlHDC4PuBaZbke5EGvrabDf_oEN3ADorHAl2KZw7kqfr9jT4ighLLZPUUgRknpCM=h310"
    ],
    "comments": [
        "Had to reinstall because of the 5.1 update and now can't log in at all, even with the official Swarm app installed. Need to fix the OAuth link or else people will never be able to install this as a new app.",
        "Good app, but not enough places displayed Really good app for swarm users like me, but it could be improved: when we are in a place with a high density of places, downtown for instance, it is rare I find the place I actually am. So I have to check-in from my phone and I loose the interest of the app. So two ways of improving it: maybe configure from the phone the number of places we want to see., And even more powerful: add vocal search in the watch app :) Good job anyway, I use it every day !",
        "AMAZING APP! This app is everything I was looking for when using my Moto360.  This makes checking in less of a task now and makes me want to use my foursquare account a lot more!  I really recommend getting this app if you have a android wear device and use swarm.",
        "Sort according to most check ins The app should sort the venues list on the watch by the amounts of own check ins in the past. By that, once could easily access regular venues.",
        "Broken since wear update No longer functions on LGWR since update.",
        "Twitter posting? Great app but it needs the option to post to twitter as well when you check in."
    ],
    "recentChanges": [
        "1.14",
        "fixed functionality with Moto X",
        "minor bug fixes and improvements",
        "1.13",
        "fixed UI and crashes on Moto 360",
        "1.12",
        "optimised UI for Moto 360",
        "venues list is refreshed when user comes back",
        "1.11",
        "added option to share check-in on Facebook and Twitter",
        "1.10",
        "redefined way of check-in",
        "introduction how to use app on wearable",
        "login using official Foursquare app",
        "minor fixes",
        "1.06",
        "fixed disabling automatic notifications"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=io.seal.swarmwear&hl=en&gl=us",
    "appId": "io.seal.swarmwear"
}