{
    "title": "Happy O Meter",
    "summary": "Track your mood on your smartwatch and follow your Mood Trainer’s adivices.",
    "icon": "//lh3.googleusercontent.com/fzHgOF6ne-Cec20KMLzSxmYZUkNH5Vq8MEUJr6D4qeKmmuOcAXktWtXYfH1ND9AtJM23=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 10,
    "maxInstalls": 50,
    "score": 5,
    "reviews": 1,
    "developer": "Makeitapp",
    "developerId": "8216390352712777761",
    "developerEmail": "appandroid@makeitapp.eu",
    "developerWebsite": "http://www.makeitapp.eu",
    "developerAddress": "via Del Carroccio 16\n20123 Milan\nITALY",
    "updated": "November 19, 2015",
    "version": "1.0.3",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Touch the top of the screen of your smartwatch when you are in a good mood and the bottom when your sad or angry.  As time goes by, the screen will change colour based on your mood and the background of your watch will be the raimbow of the colours of the mood of the last 6 days. When you’ll need to go back in shape and good mood, your personal Mood Trainer will appear to give you his support.You can choose between different set of colours to customize your smartwatch, in this way you’ll always have the set of colours that fit you the best representing your mood.-\tWear your smartwatch -\tChoose your favourite set of colours  -\tTouch the top of the screen when you’re happy, the bottom when you’re sad -\tFollow the advices of your Mood Trainer to be always on a good moodHaving any problem or suggestion? We would love to hear from you!Reach us at: happy-o-meter@makeitapp.eu",
    "descriptionHTML": "Touch the top of the screen of your smartwatch when you are in a good mood and the bottom when your sad or angry.  As time goes by, the screen will change colour based on your mood and the background of your watch will be the raimbow of the colours of the mood of the last 6 days. <br><br>When you&#x2019;ll need to go back in shape and good mood, your personal Mood Trainer will appear to give you his support.<br><br>You can choose between different set of colours to customize your smartwatch, in this way you&#x2019;ll always have the set of colours that fit you the best representing your mood.<br><br><br>-\tWear your smartwatch <br>-\tChoose your favourite set of colours  <br>-\tTouch the top of the screen when you&#x2019;re happy, the bottom when you&#x2019;re sad <br>-\tFollow the advices of your Mood Trainer to be always on a good mood<br><br>Having any problem or suggestion? We would love to hear from you!<br>Reach us at: happy-o-meter@makeitapp.eu",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/4BLFop8V5JX-BCwMBdiCmse2myCOaawk1JZSYb4Vrjf8z5ROhymXZxL5at-z1b5-e2I=h310",
        "//lh3.googleusercontent.com/MINNw0XongzRJiRVnMZmp6FdkB4pnsmfGvVl85uw8e6RAH2RILPQZRwZl5z1qPoWTWA=h310",
        "//lh3.googleusercontent.com/7ok9Q75IEXQUWo8onRkMaqe01ihpy8MJhoeISN97Ol1nnwrHqNxulBQfV1pEGcUjvtI=h310",
        "//lh3.googleusercontent.com/MzIK1htbpGvbpT0xwaoClkBG3WyV8prs6tjdt5kvRSrQ_QWTHd7qToBBTFUg_s7X-A=h310"
    ],
    "comments": [],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=it.rifo.h_o_m&hl=en&gl=us",
    "appId": "it.rifo.h_o_m"
}