{
    "title": "Moods of Norway",
    "summary": "Celebrate the Norwegian holiday calendar with 36 styles for every celebration.",
    "icon": "//lh3.googleusercontent.com/f56inNAL8soUILn5vedB_4Ny8N58bKUlwz7ujLONW7Y8N_ehqDfdVIJNWVF_U9onrpG7=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.1,
    "reviews": 487,
    "developer": "Moods of Norway",
    "developerId": "Moods+of+Norway",
    "developerEmail": "post@moodsofnorway.com",
    "developerWebsite": "http://www.moodsofnorway.com",
    "updated": "July 8, 2015",
    "version": "1.0.7",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "With 36 featured events, this watch face stays fresh throughout the year. Moods of Norway’s designs are original and outspoken, and can also be set independent from holidays.",
    "descriptionHTML": "With 36 featured events, this watch face stays fresh throughout the year. Moods of Norway&#x2019;s designs are original and outspoken, and can also be set independent from holidays.",
    "histogram": {
        "1": 39,
        "2": 18,
        "3": 57,
        "4": 108,
        "5": 265
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/vRn6ufaPWXza7yITujCQ-iUQWDvANIVxF3AMWJc48hLJKoQJ7ZtLD1rvcmAIFbnEQjo=h310",
        "//lh3.googleusercontent.com/MAiF-mlOTH-hh2Zbd3E_oqSrelxuhRG0dYj4dSXpl6gRyS1kyYqrXxT_15m41vN-CQ=h310",
        "//lh3.googleusercontent.com/6CheQzSzeHVIpBCg7hLoNuVsbcniYwFG7LEI5yZnRYfUO7mxr4rk4AsNjr7_SUUnWm4=h310",
        "//lh3.googleusercontent.com/swBezHbcdg1r-Ai4pgzGwR2MLJhoRgYJqL0ycMwIPe5llzKgzzHCfnydI7US99ELdg=h310"
    ],
    "comments": [
        "Absolute favorite I get complimented on these watch faces all the time! I love love love them. There are so many, and some of them are just so cute I could keep them for months at a time. I love that we can change them or it can mix things up for us. The only thing I'd like to see added is a date option, but that's no biggie. Still 10/10",
        "Nice but I am stuck with one random face There is no option to change faces on my fossil q founder. So I am always stuck with the one face that came up randomly. Please fix !! Otherwise the other faces seem to look nice",
        "Really like the face but it never changes on its own. When it went from normal to a Christmas theme I had to change the face to a different face then change it back to this one for it to change the theme..maybe I'm just doing something wrong.",
        "Can't change images I love these images and I really want to try them. But for some reason I'm stuck with only one.. I have the Fossil Q Founder. Please fix!",
        "I love these watch faces. I would pay for this if it had a date option though. That's the missing feature keeping me from using one of these faces every day. Love the designs.",
        "Date and time option would be nice. Also having the setting to change the wallpaper on my watch without going to my phone would be great."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=moodsofnorway.watchface&hl=en&gl=us",
    "appId": "moodsofnorway.watchface"
}