{
    "title": "Krona Precious Watchface",
    "summary": "Weather Watch Face, designed with Google&#39;s official Android Wear Watch Face API",
    "icon": "//lh3.ggpht.com/PlPLk--SNFnTLlXxZIDsLwlHoBNxtcsrZ2VhSoBa5rM6-TaP-SoO3M-Foou16ZfrDw=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.1,
    "reviews": 30,
    "developer": "Simon Barke",
    "developerId": "Simon+Barke",
    "developerEmail": "mail@simonbarke.com",
    "developerAddress": "701 SW 62nd Blvd\nApt X-169\n32607 Gainesville FL\nUSA",
    "updated": "January 8, 2015",
    "version": "2.2.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Complex metallic gradients, optimized for all square and round watch layouts.Please post feedback and feature requests in the comments or email us directly.Analog and Digital Watch Face with Automatic Weather Updates6 handcrafted designs individually optimized for round and square layouts. Each design comes in a light and dark theme.All features (digital time, day/date, weather, battery, analog hands) can be hidden.Fully compatible with new official Google Android Wear Watch Face API.Requires Android 4.3+ (Jelly Bean, API 18) to be installed on your phone and Android Wear 5.0.1 (Lollipop) to be installed on your watch, rolling out for all Android Wear Smartwatches (Motorola Moto 360, LG G Watch, LG G Watch R, Samsung Gear Live, ASUS ZenWatch, Sony SmartWatch 3).Features• Six color schemes: silver, gold, steel• Smooth sweep hand animation• Android companion app for watch face customization• Optional elements: analog hands, digital time, calendar, weather, battery percentage, battery ring     - Analog hands: smooth hour, minute and sweep hands     - Digital time: 24h or am/pm     - Calendar: weekday and today's date     - Weather: current condition and min/max temperature     - Battery Percentage: remaining wearable battery power     - Battery ring: multicolored halo indicating battery status• Ambient mode support: easy on the batteryInstallSome minutes after the app installed on your phone, the watch face will be copied to your watch automatically. If this does not happen, run 'Resync apps' from settings of the Android Wear App. Choose the watch face in the Android Wear App and enter the settings companion app from there. Select color schemes and features (weather, digital time, calendar, battery ring, ...). Please let us know if you run into any troubles.PermissionsCurrent weather condition is requested by companion app and pushed to Android Wear device.• Coarse location, network-based (no GPS) for weather data• Full internet access for weather data request• Enable weather update service upon rebootRequired by official Google Android Wear Watch Face API• Prevent phone (watch) from sleeping• Acts as custom watch faceWeather update status log file is written to your phone for debugging. Can be accessed from advanced settings.• Read and write contents of USB storage",
    "descriptionHTML": "<i>Complex metallic gradients, optimized for all square and round watch layouts.</i><br>Please post feedback and feature requests in the comments or email us directly.<br><br><br><b>Analog and Digital Watch Face with Automatic Weather Updates</b><br>6 handcrafted designs individually optimized for round and square layouts. Each design comes in a light and dark theme.<br>All features (digital time, day/date, weather, battery, analog hands) can be hidden.<br><br>Fully compatible with new official Google Android Wear Watch Face API.<br>Requires Android 4.3+ (Jelly Bean, API 18) to be installed on your phone and Android Wear 5.0.1 (Lollipop) to be installed on your watch, rolling out for all Android Wear Smartwatches (Motorola Moto 360, LG G Watch, LG G Watch R, Samsung Gear Live, ASUS ZenWatch, Sony SmartWatch 3).<br><br><br><b>Features</b><br>&#x2022; Six color schemes: silver, gold, steel<br>&#x2022; Smooth sweep hand animation<br>&#x2022; Android companion app for watch face customization<br>&#x2022; Optional elements: analog hands, digital time, calendar, weather, battery percentage, battery ring<br>     - Analog hands: smooth hour, minute and sweep hands<br>     - Digital time: 24h or am/pm<br>     - Calendar: weekday and today&apos;s date<br>     - Weather: current condition and min/max temperature<br>     - Battery Percentage: remaining wearable battery power<br>     - Battery ring: multicolored halo indicating battery status<br>&#x2022; Ambient mode support: easy on the battery<br><br><br><b>Install</b><br>Some minutes after the app installed on your phone, the watch face will be copied to your watch automatically. If this does not happen, run &apos;Resync apps&apos; from settings of the Android Wear App. Choose the watch face in the Android Wear App and enter the settings companion app from there. Select color schemes and features (weather, digital time, calendar, battery ring, ...). Please let us know if you run into any troubles.<br><br><br><b>Permissions</b><br>Current weather condition is requested by companion app and pushed to Android Wear device.<br>&#x2022; Coarse location, network-based (no GPS) for weather data<br>&#x2022; Full internet access for weather data request<br>&#x2022; Enable weather update service upon reboot<br>Required by official Google Android Wear Watch Face API<br>&#x2022; Prevent phone (watch) from sleeping<br>&#x2022; Acts as custom watch face<br>Weather update status log file is written to your phone for debugging. Can be accessed from advanced settings.<br>&#x2022; Read and write contents of USB storage",
    "histogram": {
        "1": 3,
        "2": 2,
        "3": 2,
        "4": 5,
        "5": 18
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh3.ggpht.com/psHiOWo3M5wFZEaknXxAWS5pMtems5OVgxYa0PnIEXKAmn0K7x5PPzvHnnVv0KS-Hkk=h310",
        "//lh3.ggpht.com/zlq0rj1M1ZeRuB2vL2BjC3OJm6rlnkV6euoO4qKltrRu4nmOsTeoZKk7bbuVAA4NsF--=h310",
        "//lh5.ggpht.com/x9eFKI99KhOSIyBl72Pgj3efPCQJiASP2nnQ495yhY4eXMIw1FMOcc49IFjp8GdSdl4=h310",
        "//lh3.ggpht.com/CeAbVGjBFIKrR5E07Bafv5Gi6kmFEnZ-4ShP59jL5KAg3dfqrl8q-mR8rgWozsc08A=h310",
        "//lh6.ggpht.com/1mXf_5zlj-EHvtDUr5gHq-9b4f3BBBv9dMRo3an0nYT0CLrjsoWgoIKTPIHiA5UX-4Q=h310",
        "//lh3.ggpht.com/RARmlOly7qTifwxsKrZM-JGqVpTZh26nKg7NvzFdVuxcctRTESLX1GpI-BTA7n4j9V8=h310",
        "//lh4.ggpht.com/WRTtfPbil4_9ccs65ez_53NEPFKDNXv3CkNWiv8xBHI7p2fjX1kQrR2yL5IsQy9vBXM=h310",
        "//lh4.ggpht.com/xULWmTkPNjp2gwge5i41hKRdpmgTDmIRMj-C7Vj93vzK5HOJeRyEHMJVUo78EjKJGU0=h310"
    ],
    "comments": [
        "Very classy. I usually stay away from the light color faces. But this app does such a great job feathering into darkness at the bottom. It makes the flat tire just disappear.",
        "Lovely design, especially the battery ring. Lovely watch face, easy on the battery too. However, weather doesn't appear to function properly. Incorrect forecast in both auto and manual location mode.",
        "Horrible watchface Too chatty. I constantly putting alerts in your watch.",
        "Another good one! Battery abit better but could do with getting a whole day out of it..like it tho any chance to extend battery life some more?? Other than that I really like the faces you guys are coming up with..keep it up.",
        "Weather doesn't work right Nice app, but the biggest reason I wanted this was for the weather, which is NEVER correct.",
        "Very nice"
    ],
    "recentChanges": [
        "2.2.2",
        "- fixes for ASUS ZenWatch",
        "- fixes for Sony SmartWatch 3",
        "2.2.1",
        "- improved weather update service",
        "- optional log file for weather data update debugging (new permission to write file on phone)",
        "2.2.0",
        "- fix for LG G Watch"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.marscity.precious&hl=en&gl=us",
    "appId": "net.marscity.precious"
}