{
    "title": "Un Petit Monde Watch Face",
    "summary": "Let Kurt Moses’ magnificent miniature photography tell you a story, every day.",
    "icon": "//lh3.ggpht.com/-pBfxhauuWMbNS0VrtgzU6s-R-gtMfP9j58d-G2CKcz270qsdZgZqk9EXdCg8SRx94cc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.2,
    "reviews": 1124,
    "developer": "Kurt Moses",
    "developerId": "Kurt+Moses",
    "developerEmail": "kurt@unpetitmonde.net",
    "developerWebsite": "http://www.unpetitmonde.net",
    "updated": "December 11, 2014",
    "version": "1.0.7",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "The Un Petit Monde (A Small World) watch face transforms Moses’ unique visual style into a series of daily timelapses. Combining miniature toy figures with real-world environments, Moses creates striking scenarios that tell open-ended tales. Layered with travel-inspired interfaces sketched by MediaMonks, each of Moses’ shots are composed and captured specifically for Android Wear.",
    "descriptionHTML": "The Un Petit Monde (A Small World) watch face transforms Moses&#x2019; unique visual style into a series of daily timelapses. Combining miniature toy figures with real-world environments, Moses creates striking scenarios that tell open-ended tales. Layered with travel-inspired interfaces sketched by MediaMonks, each of Moses&#x2019; shots are composed and captured specifically for Android Wear.",
    "histogram": {
        "1": 61,
        "2": 44,
        "3": 139,
        "4": 299,
        "5": 581
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/qSJof-vl4Np8Lxj1iZhAk3NTBryMsRMfnsDeWkt-UNtdbHD7MsaHFDUBrKGsvQCskA=h310",
        "//lh4.ggpht.com/zS7tXU5Vx0H85DN4zfQpctPNZd9OmCqw0GC-_yZbAb7uqHKHyXUrYBKeNp63NuhyVoM=h310",
        "//lh5.ggpht.com/U5VAedrFSGO881A07qWlJnsYFmPPpDsAvyiy4CAlXdZ-30rGwZEY9HgkeLSfZ9ZIrIE=h310"
    ],
    "comments": [
        "Adorable stop motion A wonderful little watch face that changes throughout the day. Only complaint is that one or two frames of the day-night cycle are a little boring, such as the very last frame of the van leaving where you can only see its back half.",
        "Love it but... I really love this watch face... Buy I wish the dimmed face had just the time (text)... There is a slight gradient in the background, which causes those pixels (in led displays) to remain on potentially reducing battery life... A case of aesthetics vs practicality...",
        "Wonderful watch face My only issue is the notifications and the date clash in ambient mode. It could be cool with the (very recent) 1.3 update if you could re-trigger the animation. One of the best faces for moto 360.",
        "I love the hand-scrawled look of the time on the idle screen. It would probably be my favorite just for that, but the little background stories are cute too.",
        "Very attractive, fun watch face. I keep coming back to Un Petit Monde as the watch face for my Moto 360. There's just something about looking into the watch and seeing a tiny world living on your watch screen. The stop-motion animations are nice, and it's very cool to have different scenes depending on the time of day. Would love for new scenarios every day! I would be more than happy to support the development of this watch face.",
        "Nice face but needs update The last update was in December 2014. There are only a few scenes. I was hoping for more but as it's been so long since the app was updated we probably won't get any more scenes."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.unpetitmonde.miniadventure.watchface&hl=en&gl=us",
    "appId": "net.unpetitmonde.miniadventure.watchface"
}