{
    "title": "Space And Time Watch Face",
    "summary": "Exploring space with the lonely spaceship on your Android Wear watch",
    "icon": "//lh5.ggpht.com/L5G_BFYCHxvkTiTvPoTVZeMxyXlf48QN4PsUSIxTQyFzFWDEL1ozOOkGeXviF5XWMJs=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 1899,
    "developer": "Geng Gao",
    "developerId": "Geng+Gao",
    "developerEmail": "hello@genggao.net",
    "developerWebsite": "http://genggao.net",
    "updated": "June 28, 2015",
    "version": "1.3",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "I originally designed the artwork for the Moto 360 Design Face-off contest. Since then I have been asked to make a functional watch face by many people.The wait is finally over, this watch face is build with the official Android Wear Watch Face API. I hope you enjoy this fun watch face.Features:Support both round and square watchSupport ambient mode24-hour and 12-hour Settings in Android Wear companion appMore customization options will be added in future updates.",
    "descriptionHTML": "I originally designed the artwork for the Moto 360 Design Face-off contest. Since then I have been asked to make a functional watch face by many people.<br><br>The wait is finally over, this watch face is build with the official Android Wear Watch Face API. I hope you enjoy this fun watch face.<br><br>Features:<br>Support both round and square watch<br>Support ambient mode<br>24-hour and 12-hour Settings in Android Wear companion app<br><br>More customization options will be added in future updates.",
    "histogram": {
        "1": 54,
        "2": 63,
        "3": 137,
        "4": 510,
        "5": 1135
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/PTtM4mfEVDvQjBHVsG2hseLY_8KVf-ncmb31CL7cb1gje9gRbYyLepCAhfXsrWWLXA=h310",
        "//lh5.ggpht.com/RWKe_fnsHkWYUhNSJSxIJifGdgh2ROOt-Z-QIub1ZCsGiS-DvCWhvKlaGFgmUOMhSryI=h310",
        "//lh4.ggpht.com/Cat2pnMxpFjUpQOifrT2QgRteXGicsVqYc5-CoPdOaJyZ0aAQ5QeixW_7Mnx8WgblsS2=h310",
        "//lh3.googleusercontent.com/fsBqlhGf88VYaLzQRAPxZ3mhxv4wYt3eerUoewYKugcWWcv0_24yXTXuq5pevak-ftsu=h310"
    ],
    "comments": [
        "One issue away from being perfect It's not perfectly in the middle of my moto 360. The bar on the outside is thicker on the right and thinner on the left. Just had someone else look and its not just me. Tried restarting, same. I'm still keeping it because I love it.",
        "Something you guys need to fix Everything is great except for when I charge my moto 360. It charges verrryyyy slow. It only does it when I have this watch face running. I suspect the issue is that the watch face animation is running for some reason when I dock the watch. If you guys could fix this it would be fantastic.",
        "Ambient mode not working on Moto 360 v2 The ambient mode on my 360 v2 is nothing like the preview. It looks all splotchy and distorted. Tried uninstalling/reinstalling and rebooting.",
        "Looks great, but not perfect. Only been using for a few minutes, however I can already see that ambient mode has issues. It almost looks like it flickers. This only happens on this watch face and it isn't the same flickering that the anti-burn in thing does. Using Huawei Watch.",
        "Ambient mode: could be better Love the watch face, the only problem is when it is on ambient mode, time text is hard to read even by just glancing at the watch. It would be great if there's a variety of options for the ambient mode",
        "Battery problems As others have said, this drains the battery quickly. I think making the background (where the stars are) simply black in ambient mode would fix this issue."
    ],
    "recentChanges": [
        "Many of you have asked for 24-hour option. In this update, you can find it on your phone.",
        "1. Open Android Wear on your phone",
        "2. Select Space And Time Watch face",
        "3. Click on the gear icon on the preview image",
        "More configuration options will be added in future updates. Enjoy!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.genggao.spaceandtime&hl=en&gl=us",
    "appId": "net.genggao.spaceandtime"
}