{
    "title": "Ultimate Watch 2 watch face",
    "summary": "One Watch Face For Every OccasionOutdoors, Office, Sports, Health",
    "icon": "//lh3.googleusercontent.com/djsk9z5l5LMyuafGx3O1YIocV1qMPO280ClwqBPokrqWN9X4_AG1FWjxtVf736sDJQo=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.7,
    "reviews": 202,
    "developer": "Stefano Watches",
    "developerId": "Stefano+Watches",
    "developerEmail": "ultimate.watch@stefanowatches.com",
    "developerWebsite": "http://www.stefanowatches.com",
    "developerAddress": "Nytorgsgatan\n116 40 Stockholm\nSweden",
    "updated": "October 2, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "One watch face for every occasion.Use it for office and productivity, outdoors, sports or health.Huge amount of features:✔ 18 built-in complications that can be put on up to 8 dials.✔ Full AW2.0 external complications support✔ 25 built-in presets and possibility to share and import presets.✔ Each dial can act as a shortcut to a watch app or a Tasker activity.✔ Watch face designer. Make your own watch faces using either built-in components or make your own static background designs and import. ✔ Snap pictures with your phone camera and have it as background on your watchface in seconds.✔ Show post-it notes on the watch face. Use voice command ('make a note') or watch (or phone) keyboard to enter note.✔ Use Wear 2.0 complication as background. Can be used to show album art of currently playing music in phone or watch.✔ Use Wear 2.0 complication as note. Can be used to show information on currently playing music in phone or watch.✔ Support for analog as well as digital time✔ Built-in Heart Rate app with continuous heart rate measurements and on-watch chart analysis of heart rate + full integration to the heart rate complication on the watch face.✔ Built-in Timer app with full integration to the timer complication on the watch face.✔ Voice command support for Heart rate ('show my heart rate'), Timer ('start timer'), Notes ('make a note').✔ Extensive calendar and agenda features: Automatically popup details of upcoming or current events in the agenda in the watch face. Show today's calendar events as semi-circles around the watch face.✔ Full bothway Tasker support for automation. ✔ Customizable logo and logo text (can also use external complication as logo text)✔ Unread notifications indicators. Don't miss any unread notifications. Support for unread  counters for up to 10 different apps ( including Gmail, SMS, missed calls etc).✔ Extensive configuration options of dials, including 5 different built/in dial types. ✔ Full Google Fit integration for heart rate, steps, distance, calories, active time. ✔ Extensive Google Fit statistics analysis in phone app.✔ Works as stand-alone app as well. Most of the feature work in stand-alone mode so you can use it even if you have an Iphone.✔ And lots more..If you have any questions or problems please contact us for support before giving a bad review.Web site:  http://www.stefanowatches.comGoogle plus community:  https://plus.google.com/communities/115521255825330665764﻿",
    "descriptionHTML": "<b>One watch face for every occasion.</b><br><br>Use it for office and productivity, outdoors, sports or health.<br><br><b>Huge amount of features:</b><br>&#x2714; 18 built-in complications that can be put on up to 8 dials.<br>&#x2714; Full AW2.0 external complications support<br>&#x2714; 25 built-in presets and possibility to share and import presets.<br>&#x2714; Each dial can act as a shortcut to a watch app or a Tasker activity.<br>&#x2714; Watch face designer. Make your own watch faces using either built-in components or make your own static background designs and import. <br>&#x2714; Snap pictures with your phone camera and have it as background on your watchface in seconds.<br>&#x2714; Show post-it notes on the watch face. Use voice command (&apos;make a note&apos;) or watch (or phone) keyboard to enter note.<br>&#x2714; Use Wear 2.0 complication as background. Can be used to show album art of currently playing music in phone or watch.<br>&#x2714; Use Wear 2.0 complication as note. Can be used to show information on currently playing music in phone or watch.<br>&#x2714; Support for analog as well as digital time<br>&#x2714; Built-in Heart Rate app with continuous heart rate measurements and on-watch chart analysis of heart rate + full integration to the heart rate complication on the watch face.<br>&#x2714; Built-in Timer app with full integration to the timer complication on the watch face.<br>&#x2714; Voice command support for Heart rate (&apos;show my heart rate&apos;), Timer (&apos;start timer&apos;), Notes (&apos;make a note&apos;).<br>&#x2714; Extensive calendar and agenda features: Automatically popup details of upcoming or current events in the agenda in the watch face. Show today&apos;s calendar events as semi-circles around the watch face.<br>&#x2714; Full bothway Tasker support for automation. <br>&#x2714; Customizable logo and logo text (can also use external complication as logo text)<br>&#x2714; Unread notifications indicators. Don&apos;t miss any unread notifications. Support for unread  counters for up to 10 different apps ( including Gmail, SMS, missed calls etc).<br>&#x2714; Extensive configuration options of dials, including 5 different built/in dial types. <br>&#x2714; Full Google Fit integration for heart rate, steps, distance, calories, active time. <br>&#x2714; Extensive Google Fit statistics analysis in phone app.<br>&#x2714; Works as stand-alone app as well. Most of the feature work in stand-alone mode so you can use it even if you have an Iphone.<br>&#x2714; And lots more..<br><br>If you have any questions or problems please contact us for support before giving a bad review.<br><br><b>Web site:</b>  <br>http://www.stefanowatches.com<br><br><b>Google plus community:</b>  <br>https://plus.google.com/communities/115521255825330665764&#xFEFF;",
    "histogram": {
        "1": 6,
        "2": 1,
        "3": 10,
        "4": 20,
        "5": 165
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/a1ZS429ZhTP7HNeT4qmqTNoh2GM9OV5JvZ251pqwLgL78qUHTsakfxZjfq5CfTkKRA=h310",
        "//lh3.googleusercontent.com/7PNcCkcUjsKK2muNA08ag-slaEkEJBLpDP9PMDrryteK8jUyk8uzJiEXgaUEImwrDFQ=h310",
        "//lh3.googleusercontent.com/Jg5IJUBP9FTlTGFDJlH00gZRRo7LSbfQwBXiphNwuf2TCaGzCQipg2rUe4djZi1vfqM=h310",
        "//lh3.googleusercontent.com/G8bNlJmi58i_chpXy_-4siZKiX6dCeaKB6rY7QLhjKDOc6Ql3H6WhtshgwYlUrZxwA=h310",
        "//lh3.googleusercontent.com/C-5KTrxhQhymOETVFHAi46vIwCjkW8_oqLVwLKpU-CRPRpKwE7kZiLlU19yRG52fU_Y=h310",
        "//lh3.googleusercontent.com/DK5ZdIjkP3lNJXtrUUJrxr5P45BlorKJ1voFVx7DLckuWya1XAQwY0dt07xkzjxsgbk=h310",
        "//lh3.googleusercontent.com/ltaL5e177fvYuzakdBvS1z2mYyQ1ZlyshkvKEwazGOfrz7twWBI9UBg4RPeBNVvZ2A=h310",
        "//lh3.googleusercontent.com/qYqfP4MGEKK_iJ5V2ijfUnVpnLvIhjllP5TKXYZRx4d5rrt4757TKXRfzpCb7vHz7xQ=h310",
        "//lh3.googleusercontent.com/SKW-TIVV9k-lMxGK6ame8ntHACqRQyaykyoUzrjA8wMp7OgQRnftwjS5b_quwBTwDnw=h310",
        "//lh3.googleusercontent.com/Qo_zQlMcpP0bhpICEWy2tdo76ESdC536bJvxGrrFzWBGbxLG40CnEtE792KQCXFNUXOv=h310",
        "//lh3.googleusercontent.com/6ukKm4RrpqswJXIw-yv1Sweq66SoMPuNktbR4R1im-qYQcaasPsOfwgpA2_tw28aPKU=h310"
    ],
    "comments": [
        "It's a very good app. The features probably work well. Customization is easy and intuitive. It's a little hard to figure out how save, share and transfer, but with a little work, everything turns out fine. ONLY, I can't transfer from my phone to my watch. I'm pretty sure I'm doing everything right, but I just can't transfer the face I just customized to my watch. Doesn't matter how many different times I try, nothing appears on my \"user presets\" face.",
        "Really like the face and very, very configurable.  One downside is that the digital clock on the ambient face didn't update when changing time zones, the primary analogue face did.  Selected an alternative face, then back to this one to correct it.  Minor bug?",
        "Wow! This is a really nice Android Wear watchface. There are a lot of watchfaces for AW, but I believe this one is the best. It's even better than Weareal. The quality and options are amazing.",
        "Not very user friendly -- cannot get it to sync to my Ticwatch.  Incompatibility issues would have been nice to know about before I purchased it. :(",
        "The weather is not updating. Currently it is minus 1 and the weather says 9c. I checked it was last updated 3PM yesterday afternoon, it is supposed to update every two hours. I can not count on the Weather for me it will be better to go another watch face that does work. Seems to change but it is real slow at changing, can not rely too much on what it says.  This is stock weather \"weather complication I tried did not work well\",  maybe see if I can find a better weather complication.",
        "The most professional customizable/ configurable watch face ever. The developer(s) put a good amount of effort. Simply love it. Now if I may suggest an updtae/ upgrade ( which I'll gladly pay for it ) will be to add a rectangle boxes for digital time viewing ( something like aviator version of breitling ) that will cover a lot .  Thanks again for such an amazing watch face ."
    ],
    "recentChanges": [
        "2.5.4: - Use new watch actions as shortcuts on the dials. Lot's of useful actions such as Brightness boost, Toggle Dim mode, Change brightness, start voice command etc.",
        "- Configure hardware buttons to the same shortcuts as for the dials.",
        "- IFTTT commands as shortcut. Control your smart home, smart lighting, home cinema, car etc directly from watch.",
        "- Generic cloud commands (webhooks) as shortcuts. Use for Internet of Things applications etc.",
        "http://www.stefanowatches.com/changelog.html"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.stefano.stefanoface2&hl=en&gl=us",
    "appId": "net.stefano.stefanoface2"
}