{
    "title": "WoodWorks LIGHT Watch Face",
    "summary": "A wooden watch face for Watchmaker - Fully Unlocked!",
    "icon": "//lh3.googleusercontent.com/fJDGdzpU8rC7o5XO8VSz1Tt0Y2gRhxU8EV90xTzh3X2_e43UYK_F7PabsY0ebX4h9I5H=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.8,
    "reviews": 74,
    "developer": "NwD",
    "developerId": "NwD",
    "developerEmail": "nick.will.dy@gmail.com",
    "developerAddress": "5590 Ormond\nWhite Lake, MI 48383",
    "updated": "July 5, 2015",
    "version": "1.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "!!! THIS WATCH FACE REQUIRES WATCHMAKER PREMIUM !!!Don't let that deter you, it's one of the greatest apps you can get for your Android Wear smartwatch. There are literally hundreds of free watch faces available for Watchmaker. You won't regret it one bit. Download it here: http://goo.gl/FMxUfY-====={  What am I looking at?  }=====-★ The top needle dial shows your watch battery★ The left needle dial shows your phone battery★ The watch hands' shadows are dynamic based upon your movement as well as the rotation of the hands themselves★ The main gear slowly turns★ The mini rocker surrounding the hands, rocks back and forth to each secondWhen fully charged the dials show blue. When less than 50% the wood will start to show red. At less than 30% you will start to see an even brighter red. ★ When charging your phone, a flag appears above the phone needle dial★ The right dial shows the date (duh)At any time, you may hide the date by tapping it. Not sure why you would or wouldn't want to, but you can and it's kind of cool.★ The current hour is highlighted by a black disc just beneath the face★ There is a minimalist dim mode★ If you have a SQUARE watch, you will see a specific square design-====={  Full Version: https://goo.gl/TVsGq3  }=====-All of the sweet features from the light version plus...★ SUPER-animated (over 130 animated layers)★ Stopwatch★ Step counter (if not shown, no data is pulled saving battery)★ Heart rate monitor (if not shown, no data is pulled saving battery)★ Face lock (so you can use the native watch features more easily without the face buttons interfering)★ Calendar (upcoming events plus duration)★ Weather (current temp and condition, today's high/low, 4-day forecast, weather refresh button)  -====={  Semi-fun Facts  }=====-★ All graphics are hand-drawn (digitally) or created from one wooden image.★ The overall look and feel was inspired by the design of Vaping Fuel (feel free to look it up)★ This light version is completely FREE and UNLOCKED",
    "descriptionHTML": "<b>!!! THIS WATCH FACE REQUIRES WATCHMAKER PREMIUM !!!</b><br><br><b>Don&apos;t let that deter you</b>, it&apos;s one of the greatest apps you can get for your Android Wear smartwatch. There are literally hundreds of free watch faces available for Watchmaker. You won&apos;t regret it one bit. Download it here: http://goo.gl/FMxUfY<br><br><br>-====={  <b>What am I looking at?</b>  }=====-<br><br>&#x2605; The top needle dial shows your watch battery<br>&#x2605; The left needle dial shows your phone battery<br>&#x2605; The watch hands&apos; shadows are dynamic based upon your movement as well as the rotation of the hands themselves<br>&#x2605; The main gear slowly turns<br>&#x2605; The mini rocker surrounding the hands, rocks back and forth to each second<br><br>When fully charged the dials show blue. When less than 50% the wood will start to show red. At less than 30% you will start to see an even brighter red. <br><br>&#x2605; When charging your phone, a flag appears above the phone needle dial<br>&#x2605; The right dial shows the date (duh)<br><br>At any time, you may hide the date by tapping it. Not sure why you would or wouldn&apos;t want to, but you can and it&apos;s kind of cool.<br><br>&#x2605; The current hour is highlighted by a black disc just beneath the face<br>&#x2605; There is a minimalist dim mode<br>&#x2605; If you have a SQUARE watch, you will see a specific square design<br><br>-====={  <b>Full Version: https://goo.gl/TVsGq3</b>  }=====-<br><br>All of the sweet features from the light version plus...<br><br>&#x2605; SUPER-animated (over 130 animated layers)<br>&#x2605; Stopwatch<br>&#x2605; Step counter (if not shown, no data is pulled saving battery)<br>&#x2605; Heart rate monitor (if not shown, no data is pulled saving battery)<br>&#x2605; Face lock (so you can use the native watch features more easily without the face buttons interfering)<br>&#x2605; Calendar (upcoming events plus duration)<br>&#x2605; Weather (current temp and condition, today&apos;s high/low, 4-day forecast, weather refresh button)  <br><br>-====={  <b>Semi-fun Facts</b>  }=====-<br><br>&#x2605; All graphics are hand-drawn (digitally) or created from one wooden image.<br>&#x2605; The overall look and feel was inspired by the design of Vaping Fuel (feel free to look it up)<br>&#x2605; This light version is completely FREE and UNLOCKED",
    "histogram": {
        "1": 12,
        "2": 4,
        "3": 8,
        "4": 11,
        "5": 39
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/mC5VWtgr0FOOiigrGHkqpFGwRYe-fbJk9-y2yeIi0O4w6pjkA5iAOs3Lds6fPtn94XM=h310",
        "//lh3.googleusercontent.com/SXONBBC4xXPidbMJUgOjjwjEjuZfB3XtY_khfPV3Ebp4G6c3tzUqWxoTDl7lWU0x1w=h310",
        "//lh3.googleusercontent.com/x9ELebEkCiCHg4gxVjD2XN4uM66NGgVPZXvtNBC26erqiTvdUt9e-h95tgJ8-KmCbA=h310",
        "//lh3.googleusercontent.com/7Tn_MPJIbHkEzgzkkF4I9V5Mfa5FMgYQK4wI3kJ8KLQflkTGbinHadATf_0NpvfGGVM=h310",
        "//lh3.googleusercontent.com/mZMjXiS6Kn0X7PVg6NK5_jFCzdd46Xez6iFt69ki4KUAV23Ro1gScsBgQ2oCgXk2dfmn=h310",
        "//lh3.googleusercontent.com/KUNkBe3QYCR4jokoUYl4PYYTn1egKQorohsKAyaRrwqWWcaLTZGpp216UXteyI-R_WE=h310",
        "//lh3.googleusercontent.com/4lxztVqkE2YdlCnE2RkKdj4fGozrAHX0kZYN5RaZhakAAsvhgFUzlwMvUyVvJpP4CnI=h310"
    ],
    "video": "https://www.youtube.com/embed/9HW-w3zEW_Q",
    "comments": [
        "Love it The screen becomes pixilated right before entering and after exiting the ambient mode which kind of ruin it but except that it's great",
        "Confusing How can i use no widget no app icon",
        "Best watchface Simply the best watchface ever, congrats",
        "I really like the \"gas tank\" battery life indicator and the dark woodgrain, very unique. I looked through what must have been 15 pages of faces before this one jumped right out at me as different. Well done!",
        "Awesome! This watch face is very unique and I can't wait to show it off!",
        "Super cool! This design is very unique and stunning. I love it! Can't wait to see more of your design. :)"
    ],
    "recentChanges": [
        "1.1",
        "+ Added official SQUARE watch face for square watches",
        "- Fixed the dim/blackout for square faces"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=nwd.wmwatch.woodworkslight&hl=en&gl=us",
    "appId": "nwd.wmwatch.woodworkslight"
}