{
    "title": "WoodWorks Watch Face for WM",
    "summary": "Super-transforming wooden animated watch face for Watchmaker - Fully Unlocked!",
    "icon": "//lh3.googleusercontent.com/oqF9NfpRU_UnWp6aQXZsNIqF62ySNlC2MWfZZyufi7CmYdlTcO7GC5VXOMipk-bLmbU=w300",
    "price": "$1.49",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.6,
    "reviews": 39,
    "developer": "NwD",
    "developerId": "NwD",
    "developerEmail": "nick.will.dy@gmail.com",
    "developerAddress": "5590 Ormond\nWhite Lake, MI 48383",
    "updated": "July 6, 2015",
    "version": "1.2.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "!!! THIS WATCH FACE REQUIRES WATCHMAKER PREMIUM !!!Don't let that deter you, Watchmaker is one of the greatest apps you can get for your Android Wear smartwatch. There are literally thousands of free watch faces available for Watchmaker. You won't regret it one bit. Download it here: http://goo.gl/FMxUfYWood Works LIGHT: http://goo.gl/YcHlDLSQUARE watches get a special square design.You get 2 faces, the standard and the \"bright\" version.-====={  What does it do?  }=====-::: MAIN FACE :::★ The top needle dial shows your watch battery★ The left needle dial shows your phone batteryWhen fully charged the dials show blue. When less than 50% the wood will start to show red. At less than 30% you will start to see an even brighter red.★ The watch hands' shadows are dynamic based upon your movement as well as the rotation of the hands themselves★ The main gear slowly turns★ The mini rocker surrounding the hands, rocks back and forth to each second★ When charging your phone, a flag appears above the phone needle dial★ The right dial shows the date (duh)★ The current hour is highlighted by a black disc just beneath the faceTap Actions★ Tap the right panel and it reveals the date★ Tap the heart icon to reveal and start the heart rate monitor★ Tap the feet icon to reveal and start the step counter★ Tap the stopwatch icon to start and reveal the stopwatchWhen the heart rate or steps doors are open, you will see that the stopwatch icon is hidden. In order to see the stopwatch numbers, you must first close both the heart and step doors. You may open and close the stopwatch at any time and it will keep running. Start/Stop and Reset buttons will also appear once the stopwatch has been started.★ Tap the lock icon and it will disable all other tap actions on the face allowing you to interact with Android Wear normally. Tap the lock again to disable it.★ Tap the plus icon (+) to open the face and start the WoodWorks animation bringing you to the calendar mode::: CALENDAR MODE :::The face opens up and the gears start turning. The battery needles, charging flag and date all rotate and drop out of the way on their track. The clock hands rotate and drop out of the way on their track and dangle in place based on your arm movement. Pay close attention to all of the micro-gears as they all power another moving part.★ This mode displays the next three events from your calendarAccess these by using the left and right arrows.★ The mini clock shows the current time★ The colored shaded area behind the mini clock hands shows the event color and duration★ Tap the weather button to access the weather mode::: WEATHER MODE :::The armatures on the right slide in and unfold creating a track for the weather panel to unfold on to.★ The current temperature is displayed in the upper left★ Today's forecast is displayed in the upper right★ The next four days weather condition and high temperature are displayed along the bottom★ Tap the refresh button to update the weather info★ Tap the close button to activate the transformation into the main face mode::: OTHER THINGS :::★ There is a minimalist dim mode★ The font on the actual watch for the calendar events and weather is actually different from those in the photos. For some dumb reason, once my phone updated to Lollipop, the font stopped working. -====={  Recommended Watchmaker Settings  }=====-★ Max Framerate: 20+★ Animation Boost: ON★ Weather Provider: Yahoo-====={  Mildly Interesting Facts  }=====-★ 122 animated layers★ 145 total layers★ 696 line lua script file★ 6 months in the making (this is more embarrassing that it is bragging)★ All layers hand-drawn or created from a single piece of woodIf there is an issue or something that needs fixing or a desired feature, feel free to email Nick.Will.Dy@gmail.com",
    "descriptionHTML": "!!! THIS WATCH FACE REQUIRES WATCHMAKER PREMIUM !!!<br><br><b>Don&apos;t let that deter you</b>, Watchmaker is one of the greatest apps you can get for your Android Wear smartwatch. There are literally thousands of free watch faces available for Watchmaker. You won&apos;t regret it one bit. Download it here: http://goo.gl/FMxUfY<br><br>Wood Works LIGHT: http://goo.gl/YcHlDL<br><br>SQUARE watches get a special square design.<br>You get 2 faces, the standard and the &quot;bright&quot; version.<br><br>-====={  <b>What does it do?</b>  }=====-<br><br><b>::: MAIN FACE :::</b><br><br>&#x2605; The top needle dial shows your watch battery<br>&#x2605; The left needle dial shows your phone battery<br><i>When fully charged the dials show blue. When less than 50% the wood will start to show red. At less than 30% you will start to see an even brighter red.</i><br>&#x2605; The watch hands&apos; shadows are dynamic based upon your movement as well as the rotation of the hands themselves<br>&#x2605; The main gear slowly turns<br>&#x2605; The mini rocker surrounding the hands, rocks back and forth to each second<br>&#x2605; When charging your phone, a flag appears above the phone needle dial<br>&#x2605; The right dial shows the date (duh)<br>&#x2605; The current hour is highlighted by a black disc just beneath the face<br><br><b>Tap Actions</b><br>&#x2605; Tap the right panel and it reveals the date<br>&#x2605; Tap the heart icon to reveal and start the heart rate monitor<br>&#x2605; Tap the feet icon to reveal and start the step counter<br>&#x2605; Tap the stopwatch icon to start and reveal the stopwatch<br><i>When the heart rate or steps doors are open, you will see that the stopwatch icon is hidden. In order to see the stopwatch numbers, you must first close both the heart and step doors. You may open and close the stopwatch at any time and it will keep running. Start/Stop and Reset buttons will also appear once the stopwatch has been started.</i><br>&#x2605; Tap the lock icon and it will disable all other tap actions on the face allowing you to interact with Android Wear normally. Tap the lock again to disable it.<br>&#x2605; Tap the plus icon (+) to open the face and start the WoodWorks animation bringing you to the calendar mode<br><br><b>::: CALENDAR MODE :::</b><br><br>The face opens up and the gears start turning. The battery needles, charging flag and date all rotate and drop out of the way on their track. The clock hands rotate and drop out of the way on their track and dangle in place based on your arm movement. Pay close attention to all of the micro-gears as they all power another moving part.<br><br>&#x2605; This mode displays the next three events from your calendar<br><i>Access these by using the left and right arrows.</i><br>&#x2605; The mini clock shows the current time<br>&#x2605; The colored shaded area behind the mini clock hands shows the event color and duration<br>&#x2605; Tap the weather button to access the weather mode<br><br><b>::: WEATHER MODE :::</b><br><br>The armatures on the right slide in and unfold creating a track for the weather panel to unfold on to.<br><br>&#x2605; The current temperature is displayed in the upper left<br>&#x2605; Today&apos;s forecast is displayed in the upper right<br>&#x2605; The next four days weather condition and high temperature are displayed along the bottom<br>&#x2605; Tap the refresh button to update the weather info<br>&#x2605; Tap the close button to activate the transformation into the main face mode<br><br><b>::: OTHER THINGS :::</b><br><br>&#x2605; There is a minimalist dim mode<br>&#x2605; The font on the actual watch for the calendar events and weather is actually different from those in the photos. For some dumb reason, once my phone updated to Lollipop, the font stopped working. <br><br>-====={  <b>Recommended Watchmaker Settings</b>  }=====-<br><br>&#x2605; <b>Max Framerate:</b> 20+<br>&#x2605; <b>Animation Boost:</b> ON<br>&#x2605; <b>Weather Provider:</b> Yahoo<br><br>-====={  <b>Mildly Interesting Facts</b>  }=====-<br><br>&#x2605; <b>122</b> animated layers<br>&#x2605; <b>145</b> total layers<br>&#x2605; <b>696</b> line lua script file<br>&#x2605; <b>6</b> months in the making (this is more embarrassing that it is bragging)<br>&#x2605; <b>All</b> layers hand-drawn or created from a single piece of wood<br><br>If there is an issue or something that needs fixing or a desired feature, feel free to email Nick.Will.Dy@gmail.com",
    "histogram": {
        "1": 1,
        "2": 1,
        "3": 2,
        "4": 5,
        "5": 30
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FRUl7Pm__mBh4QJhGD1vy2nmqY9IjsJii4KMp8DOHz7Zl1h4h8RBDWQZSPv6wxwppQ=h310",
        "//lh3.googleusercontent.com/VDuWge0Wy4wmWqBNw1yEFLyoDlTDuhHeWyDdnlm76mDPE4_hiHWFH3HnU2ZilEjaXE3q=h310",
        "//lh3.googleusercontent.com/PXTweaIaOUOWQbipkYx9Fye6VONkoIxNcqHO_A_A71NtR759v1XpqgU2XB0QjoVKZXw=h310",
        "//lh3.googleusercontent.com/ANXU47Y8Nxa-aLpZ1kCJAD9OWXnaGOBXEj-CnAC5xMz0qgo-G72Yow6NZClTECctaGoQ=h310",
        "//lh3.googleusercontent.com/7EaB0QC0q1rFXIrUDQHNeolSzp2qDsWWpiuLLUxqIxx8Nk8hABV3UYhx9LhgFxYkUQ8=h310",
        "//lh3.googleusercontent.com/TtZ-W76l5HtRGjxBUoXMZ8I3KihBiUodVYux-DKcu6ZX-MO55TeQ9LfGZD-JpuVTJ8o=h310",
        "//lh3.googleusercontent.com/44jrt3teBMDJD64-Z17kK27hE0-oHvgEQVRrTi_kqUl-ry_FGyGdDoIfcMquxYHf5nw=h310",
        "//lh3.googleusercontent.com/iD6qR0GURmrbOD3RdEBZF1pkoZrPX7FzhGc7lrOiPbREoz_VMdccEbqstjhKeKPOUBM3=h310"
    ],
    "video": "https://www.youtube.com/embed/0fpjrAMf-I8",
    "comments": [
        "Fantastic I have a lot of faces (for my watch!). After getting this one, i basically stopped looking for, and even switching, then around. It's amazing, useful, clever. I wish i could keep it up and running all the time, but my battery didn't cope. Buy this face, it's completely worth it.",
        "Epic!! Can't believe this could be done on a watch face. The animations are out of this world. All runs smoothly and so glad you added a lighter version in colour as the free version was always slightly hard to read. All in all great watch face!!",
        "Amazing! This watch face is absolutely amazing. Please add the option for wood color like ebony, mahogany, teak, brown, etc *especially brown since it match my watch skin. Keep up the good work 🍻",
        "Not very responsive Have to touch tap action several times to get reaponse.",
        "Its not working on my moto 360 I bought this app and it didn't install on my moto 360 I'm afraid it won't install if I wait for it longer and not be able to get a refund after, I would like to know what happened",
        "Awesome This is a beautiful watch face with so many features. Is it possible to change the weather to Fahrenheit or if it is not can you add it in the next update."
    ],
    "recentChanges": [
        "1.2",
        "+ Added official SQUARE watch face for square watches",
        "1.1",
        "+ Added 2nd watch face called WoodWorks Bright"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=nwd.wmwatch.woodworks&hl=en&gl=us",
    "appId": "nwd.wmwatch.woodworks"
}