{
    "title": "Opulence Six Barrel Watch Face",
    "summary": "Watch face designed for optimal readability with the moto 360 display in mind.",
    "icon": "//lh4.ggpht.com/M7wza7JyfVktb6qUEPOCETlTaFTjuUlJQbL5g8Sr95-tNVLQTwiIOBgZS99vRwaHuwt4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.5,
    "reviews": 328,
    "developer": "Frank Dufaux Mindlabs",
    "developerId": "Frank+Dufaux+Mindlabs",
    "developerEmail": "vjmindlab@gmail.com",
    "developerWebsite": "https://plus.google.com/u/0/+FrankDufaux/",
    "developerAddress": "2036 avenue  de la salle, Montreal, Quebec, Canada, H1V 2K5",
    "updated": "March 3, 2015",
    "version": "1.4",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "- Watchmaker needed to load the watch face Download here : http://goo.gl/FMxUfY- This is a APK package contains a 12 and 24 hours version watch face in english and international date setup that will load automatically in Watchmaker after install. For Android Wear 5- Watch Face designed for optimal readability, beauty and precision with the moto 360 display in mind.- New and improved stopwatch now with slide up and slide down watch face effect.  stopwatch mode include a new screen in the middle dial with : step counter, digital stopwatch and heart rate monitor.- Scrolling weather conditions, temperature and humidity.- Date in watch mode, digital clock in stopwatch mode. - Different dimmed design for watch and stopwatch.- Watch and phone power reserve.- Watch face compatible with all round displays and now square.- Now with a new watch face in Cyan dimmed mode flavor.",
    "descriptionHTML": "- Watchmaker needed to load the watch face Download here : http://goo.gl/FMxUfY<br>- This is a APK package contains a 12 and 24 hours version watch face in english and international date setup that will load automatically in Watchmaker after install. For Android Wear 5<br><br>- Watch Face designed for optimal readability, beauty and precision with the moto 360 display in mind.<br><br>- New and improved stopwatch now with slide up and slide down watch face effect.<br>  stopwatch mode include a new screen in the middle dial with : step counter, digital stopwatch and heart rate monitor.<br><br>- Scrolling weather conditions, temperature and humidity.<br><br>- Date in watch mode, digital clock in stopwatch mode. <br><br>- Different dimmed design for watch and stopwatch.<br><br>- Watch and phone power reserve.<br><br>- Watch face compatible with all round displays and now square.<br><br>- Now with a new watch face in Cyan dimmed mode flavor.",
    "histogram": {
        "1": 89,
        "2": 17,
        "3": 21,
        "4": 52,
        "5": 149
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/bebJ3IO8--9SewhTmU_aeRHtWncxDdhIW7JXGLIaTNvT5887NLQ-fdNh2tEM_WgxmA=h310",
        "//lh3.ggpht.com/NANy8aFV-HiURLjBBCZC6bpoLx4X_keHR6beNZECLnOwLNFypuG5J9q7aVIDBiZMIXM=h310",
        "//lh5.ggpht.com/zk46v-Z6bq7qmfHmNG9VaC5cgX2cZ3loWJNsAHQOenOejccLZgOF7EpqB56QOs8NmA=h310",
        "//lh3.ggpht.com/UKbADic-k2Mt9hllH_y1TsAbaLQI-cyfyk_SHlq_96JAwxwiQDXcvzEXWbR_WfDgOA=h310"
    ],
    "video": "https://www.youtube.com/embed/s5Hg_vmyNM8",
    "comments": [
        "Looks great, on my phone THE ONLY WAY TO GET THIS FACE TO YOUR WATCH IS VIA A 3$ APP. GOTTA SAY, IT SUCKS YOU CAN'T SAY, UNLESS YOU HAVE WATCHMAKER PRO, THIS IS USELESS AND WILL NOT WORK",
        "I really like this watch face it looks great on my Moto 360 my only complaint is I can't seem to change the weather to ferinheight. Am i missing something? Thanks great job!",
        "What a rip off You buy the watch face then you must buy premium watchmaker to use it, you need to be more clear in your description",
        "This watch face certainly isn't the worst one I've tried, but that's not exactly a running vote of confidence. The thing which made me uninstall it in the end was that, while it did deliver on what it stated it would, it just felt too \"busy.\" The things I've really started looking for in watch faces are, 1. Can YOU EASILY AND CLEARLY tell the time? (a great number of the faces on the market fail at this basic task), 2. Are the add-ons easy to open and then are they easy to use? 3. Does the face seem to drain power abnormally? 4. Could I walk into any situation in my life without needing to change the face? (too many are just not business appropriate or are too juvenile). Finally. 5. Is the face clean, well thought out, and generally pleasing to the eye. This final item is where 6 barrel fell short. In truth, there are other pieces of the face that I would have changed, but the ultimate reason for my uninstall was that the watch was just too hard to use.",
        "Absolutely beautiful! If you use WatchMaker, this watch face is a must own! At a $1.20 this watch face is a steal! So what are you waiting for? Buy it today!",
        "Uninstalled it!!! Uninstalled it!!! It just doesn't work!! It says you must \"DOWNLOAD AND BUY\" a different app just to make this one work....very misleading so this maker of watch faces will be the only one i don't buy."
    ],
    "recentChanges": [
        "1.4 Small fix to realign the burn-in effect with the date text in international version.",
        "1.3. Fix the date format display for international",
        "and made it compatible to square displays.",
        "-  Added dynamic shadows under the watch, power",
        "indicators and the center pieces for more realistic depth",
        "-  Rearranged the shadows of the main hands and added",
        "one to the seconds hand and the center piece.",
        "-  To finish i created a new watch face with",
        "Cyan dimmed mode.",
        "-  Added 8 flavors in the apk file"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=opulence.wmwatch.sixbarrelplus&hl=en&gl=us",
    "appId": "opulence.wmwatch.sixbarrelplus"
}