{
    "title": "Rubik's Watch Face",
    "summary": "There’s nothing more puzzling than time, so we&#39;ve put the time inside a puzzle.",
    "icon": "//lh3.googleusercontent.com/JRRB0g85b98tt1A2wMqPqlWds8OJW2fhyDbVLUu83Kdd12DOYTRaliWZ1Po6hsYtUdY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.6,
    "reviews": 488,
    "developer": "Rubik's",
    "developerId": "Rubik's",
    "developerEmail": "RubiksTeam@Rubiks.com",
    "developerWebsite": "http://www.Rubiks.com",
    "updated": "July 8, 2015",
    "version": "1.0.3",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "The Rubik’s Watch Face is based on the iconic and original 3x3 Rubik’s Cube. Its colorful design is true to the original brain-teaser, presenting the time and date through isometric animations, that twist and turns like the puzzle itself. Complete with an ambient state for those times your brain needs a break, this watch face is the perfect companion for conundrum chasers, puzzle enthusiasts and retro fans.",
    "descriptionHTML": "The Rubik&#x2019;s Watch Face is based on the iconic and original 3x3 Rubik&#x2019;s Cube. Its colorful design is true to the original brain-teaser, presenting the time and date through isometric animations, that twist and turns like the puzzle itself. Complete with an ambient state for those times your brain needs a break, this watch face is the perfect companion for conundrum chasers, puzzle enthusiasts and retro fans.",
    "histogram": {
        "1": 79,
        "2": 29,
        "3": 74,
        "4": 115,
        "5": 191
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/n1bsEJLftqomXu3dm24IyWnZ8SrWGBfgHo4P6xrn6XnpWmEI3v-16L3kFOLixx9ojjw=h310",
        "//lh3.googleusercontent.com/Cz5kL_e-QWFbZUJfd43FgC6E2hErHIOw4yilZgqtjtJdZ0ohlzqQlUpVkdUsUiOn5b5A=h310",
        "//lh3.googleusercontent.com/2-XL3Hquy4laYsP3AaNPChTSsQyTcNO7zTF8WyESDc5NI5VBl45SgZb2jb3NFYrddI8=h310",
        "//lh3.googleusercontent.com/BINE4f2WGVd8sVwC45xLGtelqJjR_W5oMhKJxPBE---Nyd2fGcTS1uZRnHYmjtHvte8q=h310"
    ],
    "comments": [
        "Ok as a nerd declaration Other than sporting a cube on your wrist this face doesn't really do much. I may have missed it but I don't see a point where I can change it to 12 hour format. I don't care to retrain my brain in order to read my watch.",
        "Needs more \"content\" I wear this watchface 2/3 of the time I wear my watch. My only gripe with this is that it's pretty bland. I want more animations, more colors, make it interactive. Anything that would make this more entertaining.",
        "Great Watch Face This is a simple and yet brilliant watchface. The ambient mode is clear enough to tell the time but the best feature has to be when you wake the screen up. You are greeted with an excellent Rubik's Cube solving animation that ends with presentation of the time. It's a great wee touch that adds nicely to something as simple as showing the time.",
        "Love it At first i couldnt get it to animate but if you turn ambient mode on it works ^^",
        "It doesn't work On my moto 360",
        "Need upgrade The new moto when it turns on, I had to wait for the rotation finish all the time to read time. If possible, can update the app?"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=rubiks.watchface&hl=en&gl=us",
    "appId": "rubiks.watchface"
}