{
    "title": "Exercise Tracker: Wear Fitness",
    "summary": "Exercise Tracker auto counts reps and saves your workout log for Wear fitness",
    "icon": "//lh3.googleusercontent.com/v2q1hvge3LrxEG0VmwQ2REBKIHMbVNMDBC4mY_B6z_-GTBy7pYk7laehaD0Emuu4f70=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4,
    "reviews": 1288,
    "developer": "Track My Fitness",
    "developerId": "Track+My+Fitness",
    "developerEmail": "support@vimo.co",
    "developerWebsite": "http://trackmy.fit",
    "developerAddress": "1172 Castro St.\nMountain View, CA 94040",
    "updated": "January 27, 2017",
    "version": "3.1.2",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Exercise Tracker is the only app that automatically identifies exercises, counts your repetitions, and logs all of your workouts for you! How to train new exercises in Free Mode:1. Start app on watch and perform exercise.2. Tap watch and give it a name.3. Save.That’s it! The next time you perform the movement, Exercise Tracker will automatically identify the exercise.In guided mode, you can build your own custom workout program, the watch will guide you through the workout and track you along the way. We introduced this feature in version 3.0.0 per your requests. It is a major new release, bugs are inevitable, please bear with us and email us to report problems, so that we can improve your user experience.- TrackMyFitness uses the Android™ Wear fitness watch to track your body on the -X, -Y, -Z axis.- Manual workout log and fitness journal feature works incredibly even without an Android Wear fitness watch.- Get more accurate calories burned feedback then with typical fitness tracker or exercise tracker because TrackMyFitness knows EXACTLY which exercises you’re performing!- It takes just 3 seconds to train any new exercise from your Android Wear fitness watch so there’s no limit to how many exercises TrackMyFitness can track in your workout journal.- TrackMyFitness works as your Crossfit log ( wod log ), bodybuilding log, weightlifting tracker, strength training journal, HIIT workout tracker, TRX training journal, kettlebell training log, calisthenics exercise journal, machine workout tracker, cardio workout log, and much much more!- Exercise tracker also records your time in your workout log with built in interval timer and stopwatch.- Stay motivated with remarkable progress tracking including 1 rep max estimates and calories burned - Great to use for home fitness tracking or a gym log.- The only Android Wear fitness app to auto identify your exercises.- Auto repetition counting and exercise tracking compatible Android Wear fitness watches include: Moto 360, Moto 360 2nd generation, Fossil Q, Samsung Gear Live, Huawei Watch, Sony Smartwatch 3, LG Watch Urbane, and LG Watch RTips for more accurate fitness tracking:- Wear your watch just a little higher on your wrist than usual. (above the bone)- Tighten the watch on your wrist. (just snug, not a death grip)Developer Note:This is a new technology and you’re one of the first to try it out! We know it’s not perfect yet. Instead of leaving a negative review, please help us improve the app for everyone by reporting bugs to support@vimo.co",
    "descriptionHTML": "Exercise Tracker is the only app that automatically identifies exercises, counts your repetitions, and logs all of your workouts for you! <br><br>How to train new exercises in Free Mode:<br>1. Start app on watch and perform exercise.<br>2. Tap watch and give it a name.<br>3. Save.<br><br>That&#x2019;s it! The next time you perform the movement, Exercise Tracker will automatically identify the exercise.<br><br>In guided mode, you can build your own custom workout program, the watch will guide you through the workout and track you along the way. We introduced this feature in version 3.0.0 per your requests. It is a major new release, bugs are inevitable, please bear with us and email us to report problems, so that we can improve your user experience.<br><br>- TrackMyFitness uses the Android&#x2122; Wear fitness watch to track your body on the -X, -Y, -Z axis.<br><br>- Manual workout log and fitness journal feature works incredibly even without an Android Wear fitness watch.<br><br>- Get more accurate calories burned feedback then with typical fitness tracker or exercise tracker because TrackMyFitness knows EXACTLY which exercises you&#x2019;re performing!<br><br>- It takes just 3 seconds to train any new exercise from your Android Wear fitness watch so there&#x2019;s no limit to how many exercises TrackMyFitness can track in your workout journal.<br><br>- TrackMyFitness works as your Crossfit log ( wod log ), bodybuilding log, weightlifting tracker, strength training journal, HIIT workout tracker, TRX training journal, kettlebell training log, calisthenics exercise journal, machine workout tracker, cardio workout log, and much much more!<br><br>- Exercise tracker also records your time in your workout log with built in interval timer and stopwatch.<br><br>- Stay motivated with remarkable progress tracking including 1 rep max estimates and calories burned <br><br>- Great to use for home fitness tracking or a gym log.<br><br>- The only Android Wear fitness app to auto identify your exercises.<br><br>- Auto repetition counting and exercise tracking compatible Android Wear fitness watches include: Moto 360, Moto 360 2nd generation, Fossil Q, Samsung Gear Live, Huawei Watch, Sony Smartwatch 3, LG Watch Urbane, and LG Watch R<br><br>Tips for more accurate fitness tracking:<br>- Wear your watch just a little higher on your wrist than usual. (above the bone)<br>- Tighten the watch on your wrist. (just snug, not a death grip)<br><br>Developer Note:<br>This is a new technology and you&#x2019;re one of the first to try it out! We know it&#x2019;s not perfect yet. <br><br>Instead of leaving a negative review, please help us improve the app for everyone by reporting bugs to support@vimo.co",
    "histogram": {
        "1": 112,
        "2": 68,
        "3": 155,
        "4": 294,
        "5": 659
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/S-g9GgQnU5tqsx6j15_KtzdubqXf3nMEWBD9J6aL7Oflsq83IOXX5aSDoLMhZaBZ1jk=h310",
        "//lh3.googleusercontent.com/hyYuuxGSyeWVITNQWuKGFxByaqq9BaF8rX8DYZHpUICxT3aHaq-PttZYGFBv2xIKnvk=h310",
        "//lh3.googleusercontent.com/Anb9B4eWVufRfEj7by35xTfXMKzJQR-RuTJ4b-6A65Sp4NF3GhamCxdKLUBifiIrZsY=h310",
        "//lh3.googleusercontent.com/wpeuKgQ0nsF3f_pqIuXFp5yrdINWvT1LmrzWmCqnCDsYQT1FRC8CmF9FHjLYvdhHIlA=h310",
        "//lh3.googleusercontent.com/V50DkhqzdkiVOLup_7RLWmVivNduRzh-FLL6mr1InILAGgSdMzzqh0f2MTq0mpNRlQ=h310",
        "//lh3.googleusercontent.com/UwkVyhnGDQgfUa1bAJzewUgQZajnwE5tADa1naVbqscaju0N0S8y1Z48jB7AHteKzmo=h310",
        "//lh3.googleusercontent.com/JA1St_CPDfjQg-8tb-plm6A_BCKSHaHsNZHTHSYiIbte9w9G__HUyry1tvHNhhqf7A=h310"
    ],
    "video": "https://www.youtube.com/embed/NJfHHs6Flw4",
    "comments": [
        "This app, for what it does, works very well. It even outperformed another app I have which cost more. I would not dare call this a finished product but it works. I'd love to see some improvements in the interface and perhaps the ability to track heart rate via bluetooth strap or something. The physical metrics are cool but it's but easier to evaluate recovery time by judging how quickly your heart recovers between sets. I'm not sure but it would also be nice to have a web app for this also.",
        "This app has a very big potential, it's almost unique and recognize the exercises pretty well, without any interaction. BUT... on android there are a lot of bugs and few features. Many times the watch and the phone are not sync. The logged excercises on the watch are not stored on the phone, the new excercises are not present in the list of excercises. There are no statistics, only a log of the exercises and reps (poor formatted). Creating a workout is not easy, you cannot pick the excercises from a list. The home page of the app is useless. This app couls be a top commercial app, but at least on android it needs to be improved a lot.",
        "Problems with Wear 2.0. I love this app and it works well on my LG Urbane. However, I upgraded to LG Watch Sport which runs Android Wear 2.0 and have run into problems. When I go to create a new workout or change the reps/weight on an existing workout, the app closes. I believe it still logs the workout, but the crash is annoying. Fix this, and it'll go back to 5 stars",
        "2017.05 crashes on manually fixing. Finds wrong exercises often. Much better before. Updated app and Huawei watch. Used to not crash before. older version 3.1.0 - Works well with Huawei watch,  but missing set count. So still have to track on paper. Automatic tracking is nice. 21mb used in 3 months for me, blocking ALL permissions.",
        "Potentially could be the best fitness app to use in gym. Detects exercises quite precisely. However it is just full of bugs and looks more like alpha testing release. Crashes here and there. On wear 2.0 even every time you try to edit detected workout details like number of repetitions or weight used and log them. App simply crashes and edits are not saved. Thus, generally it is unusable now until this issue is solved. Yes, and the phone part of app is far from being good, too.",
        "App installed ok, and the age/height/weight entry goes ok, but when I try to choose log in via Facebook or  email it pops up a message saying 'missing info' with an option saying 'I'll check' and that's as far as I can go."
    ],
    "recentChanges": [
        "3.x.x is a major new release",
        "- Add custom workout. Build your own workout, watch guides and tracks you",
        "- New UI for free mode",
        "- Auto logging exercises when identified, save you many clicks",
        "- New speed and consistency stats for each exercise",
        "- Detection algorithm improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=vimo.co.seven&hl=en&gl=us",
    "appId": "vimo.co.seven"
}