{
    "title": "Reisplanner Wear",
    "summary": "Always travel advice at home or to work on your watch.",
    "icon": "//lh4.ggpht.com/k_UsbyaCZNHH2OKwlbGaJlxFpuGSvWegdYV916tSPWjb4PuYSXmSyVmnoFC1EXNuRPsN=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.4,
    "reviews": 96,
    "developer": "Nederlandse Spoorwegen",
    "developerId": "Nederlandse+Spoorwegen",
    "developerEmail": "android@ns.nl",
    "developerWebsite": "http://www.ns.nl",
    "updated": "April 10, 2015",
    "version": "0.9.3",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "description": "Let op: Dit is een applicatie voor Android Wear horloges, andere type smartwatches worden momenteel niet ondersteund.De Reisplanner Wear app is onmisbaar op uw smartwatch. U plant eenvoudig van en naar uw favoriete locaties. Daarnaast wordt u tijdens uw reis op de hoogte gehouden van het verloop en eventuele wijzigingen. Zo heeft u de belangrijkste informatie over uw treinreis, letterlijk, altijd bij de hand.Met de komst van de smartwatch wil NS u nog beter van dienst zijn. Daarom hebben we een eerste versie van de Reisplanner Wear gelanceerd. We zijn benieuwd naar wat u ervan vindt en horen graag uw mening.Alle functies van Reisplanner Wear op een rij:- Bestemming selectie: In de app op uw telefoon kunt u uw huis- en werkadres instellen. Wanneer u de app opstart op uw smartwatch zal deze detecteren waar u bent. Bent u thuis geeft hij de volgende reis naar het werk en andersom. Bent u ergens anders dan geeft de app de keuze tussen werk en thuis.- Eerst mogelijke reis: Het horloge laat u de eerst mogelijke reis naar uw bestemming zien. Is deze reis voor u niet haalbaar dan selecteert u makkelijk de volgende reis.- Reisbegeleiding: Als u de getoonde reis wilt gaan maken, selecteert u deze door te reis aan te tikken. De vertrek-, overstap- en aankomststations worden dan getoond. - Uitcheck reminder: Eenmaal op de bestemming aangekomen zal het horloge gaan trillen en een melding geven dat u moet uitchecken.Personalisatie: U kunt de app personaliseren door een foto in te stellen voor de thuis- en werk locatie. Zo krijgen uw reismogelijkheden en andere schermen in de Reisplanner Wear app een persoonlijk tintje.Tevens biedt deze applicatie een NS Watchface (NS klokje), u vindt deze tussen de watchfaces op uw smartwatch.",
    "descriptionHTML": "Let op: Dit is een applicatie voor Android Wear horloges, andere type smartwatches worden momenteel niet ondersteund.<br><br><br>De Reisplanner Wear app is onmisbaar op uw smartwatch. U plant eenvoudig van en naar uw favoriete locaties. Daarnaast wordt u tijdens uw reis op de hoogte gehouden van het verloop en eventuele wijzigingen. Zo heeft u de belangrijkste informatie over uw treinreis, letterlijk, altijd bij de hand.<br><br>Met de komst van de smartwatch wil NS u nog beter van dienst zijn. Daarom hebben we een eerste versie van de Reisplanner Wear gelanceerd. We zijn benieuwd naar wat u ervan vindt en horen graag uw mening.<br><br><br>Alle functies van Reisplanner Wear op een rij:<br>- Bestemming selectie: In de app op uw telefoon kunt u uw huis- en werkadres instellen. Wanneer u de app opstart op uw smartwatch zal deze detecteren waar u bent. Bent u thuis geeft hij de volgende reis naar het werk en andersom. Bent u ergens anders dan geeft de app de keuze tussen werk en thuis.<br>- Eerst mogelijke reis: Het horloge laat u de eerst mogelijke reis naar uw bestemming zien. Is deze reis voor u niet haalbaar dan selecteert u makkelijk de volgende reis.<br>- Reisbegeleiding: Als u de getoonde reis wilt gaan maken, selecteert u deze door te reis aan te tikken. De vertrek-, overstap- en aankomststations worden dan getoond. <br>- Uitcheck reminder: Eenmaal op de bestemming aangekomen zal het horloge gaan trillen en een melding geven dat u moet uitchecken.<br>Personalisatie: U kunt de app personaliseren door een foto in te stellen voor de thuis- en werk locatie. Zo krijgen uw reismogelijkheden en andere schermen in de Reisplanner Wear app een persoonlijk tintje.<br><br><br>Tevens biedt deze applicatie een NS Watchface (NS klokje), u vindt deze tussen de watchfaces op uw smartwatch.",
    "histogram": {
        "1": 15,
        "2": 11,
        "3": 16,
        "4": 25,
        "5": 29
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/b7JQrglkWFqJ_2ZXbVri3MAOcD9XOpy7kjl4a_JF4kE7s1agh7WR0NEEay1Stl6EHjU=h310",
        "//lh6.ggpht.com/N6bK1BpptGmEqZljW1aUFo6J29ZiA7vFZfw76Qwd_0cg9782V_W2176O_jxHlly5cR4=h310",
        "//lh5.ggpht.com/szPWAPGjS4kw_X4mOjlyzGOBPwJ5X6p2t7YzjXkNjl111Z6vefCKVMM1-dpC_BfkDwR7=h310",
        "//lh4.ggpht.com/oHY2v9SowLt4P48PwZoa_NKRAVEhcgmPKwIcpCzRweUc4OyyQXH4TAjjlBMHW5AyhMA=h310",
        "//lh4.ggpht.com/YCAcR5XEn1ArWwYzeX8ONkwiPGseewzvkDKQ8M_I_tYjEgmdBQX4H00DiyUO_wY7jbZf=h310",
        "//lh3.googleusercontent.com/JOxr-0nj9aK97GZAavkWrc40ar10GRUEuUfQoLT44TyaqqWvAOxBVaOMd3oDRCGXiw=h310",
        "//lh3.googleusercontent.com/4prtvCQ1lGmrRAc48CRzAvtcRuwLnIiqj7Cre97GPNokE9xmoQa1wC83thoDd2WyhtM=h310",
        "//lh3.googleusercontent.com/q7ViI96d1PUYaJI26YDEpLEs5Op-PWln2gBmiLkfTxwesjYYFWXTUaWXMdu-tZ7bd_E=h310"
    ],
    "comments": [
        "Watch face overgenomen en werkt niet Big No No om zomaar de watchface te veranderen. Daarnaast werkt het bij mij voorlopig niet, zie de tijd en een Indicator dat er iets gebeurt. Maar dat is alles. En waarom een aparte app? Waarom niet gewoon in de NS app. Toch nog even pogingen gedaan en het is echt een flut app. De app heeft ook geen enkele uitleg. Het zou ook zo simpel moeten zijn dat er geen uitleg nodig is,  maar als ik duivendrecht instel en ik zie altijd diemen zuid,  dan snap ik het niet. Pruts werk.",
        "Ambient mode? Ik gebruik de app net twee dagen en ben erg tevreden. Ik mis alleen één aspect: Ambient mode. Dit is geïntroduceerd in de laatste Android Wear update (5.1) en zorgt ervoor dat wanneer je een app even niet gebruikt de achtergrond zwart wordt en de letters wit: dit bespaart veel stoom en zorgt ervoor dat je toch de belangrijkste informatie blijft zien. Op dit moment blijft het scherm constant aan wanneer de app open staat: Hierdoor gaat de batterij natuurlijk snel op.",
        "Locaties Extra locaties toe voegen en locaties eigen namen geven ipv thuis & werk zou handig zijn.",
        "Werkt goed, verbetering nodig op locatie. Ik heb het recent niet meer, zelden komt het nog voor. Op locatie zou nog verbetering kunnen plaatsvinden ivb met vinden van huidig station. Zou handig zijn als deze app bij de Reisplanner Xtra app ingebouwd wordt.",
        "Werkt voor geen meter Op de moto 360 5.0.1(LWX48T) is de locatie bepaling matig ondanks het gebruik van de GPS van mijn telefoon (nexus5). Er wordt inderdaad gepland vanaf een verkeerd station.Is dit iets wat ik aan kan passen?",
        "Ontbreekt op veel punten Al mijn treintijden zijn in t verleden, -488375min. Navigatie is erg onduidelijk. Er is  geen duidelijk begin scherm, en bij ieder scherm kan ik met 1 swipe omhoog naar huis/werk, ook al heb ik daarvoor 2x omlaag geswiped.Dit maakt het wat verwarrend. Als iets langer dan 60min duurt zie ik ook liever 1u35min ofzo, en niet 95 min. Editie: mn moto is geüpdatet; de wear app is nergens te vinden op mn horloge. Misschien compatibel maken met nieuwere wear versies?"
    ],
    "recentChanges": [
        "Layout verbeterd voor ronde schermen, zoals de LG G Watch R en de LG Watch Urbane."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=wearable.android.ns.nl.wearabletest&hl=en&gl=us",
    "appId": "wearable.android.ns.nl.wearabletest"
}