{
    "title": "Xogram Watch Face",
    "summary": "Bring Hugh Turvey&#39;s X-ray imagery to your watch as abstract kaleidoscopes.",
    "icon": "//lh3.ggpht.com/b0m7g-B39QY8jnUdUZJjs9vcChqjQrPMDM0hzjhK6ACjMKfmoZKLguHOQsQSejsorAzR=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.2,
    "reviews": 842,
    "developer": "XOGRAM",
    "developerId": "XOGRAM",
    "developerEmail": "customer@xogram.com",
    "developerWebsite": "http://www.xogram.com",
    "updated": "December 10, 2014",
    "version": "1.1",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "This watch face brings Hugh Turvey's unique X-ray imagery to your Wear watch in the form of beautiful, abstract kaleidoscopes.Hugh Turvey creates X-ray art, or Xograms, of the unusual and every day. His work touches on science, graphic design and art while always delivering a striking aesthetic.The Xogram Watch Face displays a unique visual for every moment of the day, based on 24 of Hugh Turvey's X-ray images. Looking at these sources through a kaleidoscopic lens gives new variations and movement to the pieces that spring to life whenever you activate the screen.Choose between analog and digital displays, 12 or 24 hour, pick your favorite image or cycle them all throughout the day.If you don't see the watch face appearing on your watch, hang tight! The watch face requires the latest version of Android Wear, which should be automatically updated on your watch over the next week.",
    "descriptionHTML": "This watch face brings Hugh Turvey&apos;s unique X-ray imagery to your Wear watch in the form of beautiful, abstract kaleidoscopes.<br><br>Hugh Turvey creates X-ray art, or Xograms, of the unusual and every day. His work touches on science, graphic design and art while always delivering a striking aesthetic.<br><br>The Xogram Watch Face displays a unique visual for every moment of the day, based on 24 of Hugh Turvey&apos;s X-ray images. Looking at these sources through a kaleidoscopic lens gives new variations and movement to the pieces that spring to life whenever you activate the screen.<br><br>Choose between analog and digital displays, 12 or 24 hour, pick your favorite image or cycle them all throughout the day.<br><br>If you don&apos;t see the watch face appearing on your watch, hang tight! The watch face requires the latest version of Android Wear, which should be automatically updated on your watch over the next week.",
    "histogram": {
        "1": 47,
        "2": 47,
        "3": 86,
        "4": 205,
        "5": 457
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/tYJk1_LCSTsKdE0Oco-luIz9N_V_Nmw16PYcS3iLviYj1uSVmBhitYajKYZKWzhJVoM=h310",
        "//lh5.ggpht.com/4jWDf3YHEaqvsP9GiGh-JpLMTc4po7AhAKv6jOs7T7mefH-9W7IFNywDKvSCw5Q-Sw=h310",
        "//lh6.ggpht.com/tB37sGHsXdK-4FO--xrY45CTSi9MeDTqvvtJsSncvf-81qfGUahWWPj5DGsnzOe9PQ=h310"
    ],
    "video": "https://www.youtube.com/embed/qC87BZIHJpc",
    "comments": [
        "Nice design! Love this watch face...I've tried many others and this one works well, looks great and doesn't drain the battery!  I prefer the digital read out because its easier to read..would be great if the the analog theme also had a small digital read out at the top (so to not interfere with the cards, and moto 360 flat tire.)...  A must have for future releases is the ability to use on white faced designs in the day and black at night. Its just too hard to see the black in direct sunlight.  Cheers!",
        "Beauiful design I really like this design. The dark background images especially. It would be nice to be able to suppress some images from the auto rotation. Since running this watch face my watch has run out of battery in half the time it usually does, this has happened two or three times. I don't know if it us this app, but I haven't installed anything else in that time period. Nobody else has mentioned this so I only mention in case it helps the developers.",
        "Simple elegant, & free... Can't complain, so far, it's everything it should be... I don't particularly care about the movements though, just a nice simple image would suffice for me. Or at least the option to disable the movement. & ability to add watch & phone information of you wouldn't mind please. Update: after about a minute, it went black momentarily... And after installation, battery went from having 25hrs to 19hrs available.",
        "Worth it alone for the analog ambient mode face I love it when the watch face makers make ambient mode that are elegant, classy, save batter, and are not too bright at night. One thing is I wish there were preferences on this watch when it comes to colors. Just a personal preference, but I like to be able to choose between masculine and feminine designs.",
        "Overall it's nice I just can't change the image and I can't find any options other than the time settings. Hopefully it'll cycle on its own because I'm stuck with a glaringly bright white face. Moto X 2014 with first gen lg g watch.",
        "Nice Pretty good watch face. Just wish we could pick the watch hands colors and pick a set of faces to rotate.  I don't like all of them. HUGE battery drain on my Moto 360"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=wearable.android.breel.com.kaleidoscope&hl=en&gl=us",
    "appId": "wearable.android.breel.com.kaleidoscope"
}