{
    "title": "BE@RBRICK WATCH FACE",
    "summary": "MEDICOM TOY presents BE@RBRICK into the world of Android Wear.",
    "icon": "//lh3.ggpht.com/4H5uF498kHW_plvb4aZGiw86w5MxvYt3iMOVa6AP1zaS85PzDiNd2a4vATmS666pMg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.6,
    "reviews": 504,
    "developer": "MEDICOM TOY CORPORATION",
    "developerId": "MEDICOM+TOY+CORPORATION",
    "developerEmail": "morikawa@medicomtoy.co.jp",
    "developerWebsite": "http://www.medicomtoy.co.jp/",
    "updated": "December 10, 2014",
    "version": "1.2",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "This watch face lights up with the familiar \"at sign\", making for a playful and bright design.BE@RBRICK has collaborated with various artists, brands, companies, characters, etc...and has gained many fans in the \"Art Toy\" world.・3D/ Parallax effect・Select time display from 12 hours/ 24 hours・BE@RBRICK pops up to tell you the date with the shake-you-wrist date notification gimmickIf you don't see the watch face appearing on your watch, hang tight! The watch face requires the latest version of Android Wear, which should be automatically updated on your watch over the next week.",
    "descriptionHTML": "This watch face lights up with the familiar &quot;at sign&quot;, making for a playful and bright design.<br>BE@RBRICK has collaborated with various artists, brands, companies, characters, etc...<br>and has gained many fans in the &quot;Art Toy&quot; world.<br><br>&#x30FB;3D/ Parallax effect<br>&#x30FB;Select time display from 12 hours/ 24 hours<br>&#x30FB;BE@RBRICK pops up to tell you the date with the shake-you-wrist date notification gimmick<br><br>If you don&apos;t see the watch face appearing on your watch, hang tight! The watch face requires the latest version of Android Wear, which should be automatically updated on your watch over the next week.",
    "histogram": {
        "1": 63,
        "2": 50,
        "3": 90,
        "4": 113,
        "5": 188
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/PFR9eftAr2bFA5yDMFtFPzuV9lk643pEW6xE_VVJ2fd9MKx84DTPOMLZhPWxRxidjqdr=h310",
        "//lh6.ggpht.com/8eMJzOcgF2OtGNvy8q9OwJoSY-VfUh_SU-SiyN8pJ5HiRz6253zPy-g-xLf3JFgkJGo=h310",
        "//lh6.ggpht.com/3Fzce7TL-QkbMrV-YUinU-fwAJzijUsKvWe18tGjMSNsEqWMl49GuyPwwQlELJbHGP8=h310"
    ],
    "comments": [
        "Has potential but.... I hate the parralax thing going on, just does not look good IMHO. I also hate the shake to see date option. I would actually give this between 4 and 5 stars giving I could turn off the parralax and make the date appear without shaking my wrist.",
        "Parallax is horrible The design is nice but that parallax thing is Simply horrible. Also the designed by on the top just looks bad. Find a more natural way to incorporate it (do you really need to?) than slamming horrible font on the top.",
        "Parallax feature ruins it Eventually appeared on moto 360 after uninstalling and reinstalling it a few times. The parallax effect is absolutely horrid, it ruins the whole thing. That and the \"created by\" text. Nobody is going to remember your company name from a watch face you have to be 3 inches away from to read. All it does is make the watch face seem cheap, feels like an advertisement. Put the date on the face, shaking your wrist is stupid. Stop creating gimmicks. You have a good thing here if you'd listen to your users.",
        "Can be better Nice animations with gyro. The \"Ok Google\" text is blocking the time. Move that somewhere else please. The date bear pops up every time you wake up the watch. It should only pop up when I shake the wrist when I'm not in dimmed mode.",
        "Cute BUT.. This watch face is cute but the date is all wrong. If you don't need to know the correct date it's perfect!***. Oh thank you I'm going to reinstall it right now! ##### I installed this watch face again. Now we have a new problem, the bear does show the right date, but I have to restart the watch each day  in order for the date to reset! I don't plan on doing that Daily it's ridiculous!  Please fix or uninstalling!!!",
        "I would love to give it 5 stars but...... Okay this is my favorite watchface & I think I have them all. But my bear needs help, he's a bit lost. Sometimes he pops up & has the correct date. Such as today he was red & said Jan. 1, 2015. Now he is blue & says the date is Wed. the 31st. Please help my bear I don't want to use the other watch faces....but he is just so darn cute & I love the colors of the watch face! Can you please help my bear? I'm more than willing to pay if you can fix him :-) I am using this face on a ZenWatch & Galaxy Gear Live if that info helps."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=wearable.android.breel.com.medicom&hl=en&gl=us",
    "appId": "wearable.android.breel.com.medicom"
}