{
    "title": "Zen Taichi Watch Face",
    "summary": "Zen Taichi Watch Face",
    "icon": "//lh3.ggpht.com/YjQyDuMBH7PqYBW1JD6ufK73cwq0UBFJEe4xCPcrL8xNGiF3Cf-x7uxakDgwtXKMoSdl=w300",
    "price": "$99.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.5,
    "reviews": 13,
    "developer": "COOLTOUCH",
    "developerId": "COOLTOUCH",
    "developerEmail": "qianxundeveloper@gmail.com",
    "developerWebsite": "http://www.qianxun.net",
    "developerAddress": "Room 1303, Shilong Road 569, Xuhui DIstrict, Shanghai",
    "updated": "June 25, 2015",
    "version": "2.0.0.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Tai chi developed in ancient China. It started as a martial art and a means of self-defense. Over time, people began to use it for health purposes as well.The taijitu is a Chinese symbol for the concept of yin and yang (Taichi). It is the universal symbol of the religion known as Taoism and is also often used by non-Taoists to represent the concept of opposites existing in harmony. The taijitu consists of a rotated pattern inside a circle. One common pattern has an S-shaped line that divides the circle into two equal parts of different colors. The pattern may have one or more large dots. The classic Daoist taijitu (pictured right), for example, is black and white with a black dot upon the white background, and a white dot upon the black background. Now, we have brought this TaiChi watchface design to you. It's derived from Taijitu. The center white circle shows weekdays and day of month. The bottom black part contains white numbers to show Hour and Minute.How to Use?- First, you need to have an Android Wear watch, and download \"Android Wear\" application from Google Play, then follow instructions to pair them.- After installed on your Android Device, this watch face will be automatically synchronized to your paired Android Wear watch. - Long tap on your Android Wear watch, select \"ZenTaiChi_WatchFace\"",
    "descriptionHTML": "Tai chi developed in ancient China. It started as a martial art and a means of self-defense. Over time, people began to use it for health purposes as well.<br>The taijitu is a Chinese symbol for the concept of yin and yang (Taichi). It is the universal symbol of the religion known as Taoism and is also often used by non-Taoists to represent the concept of opposites existing in harmony. The taijitu consists of a rotated pattern inside a circle. One common pattern has an S-shaped line that divides the circle into two equal parts of different colors. The pattern may have one or more large dots. The classic Daoist taijitu (pictured right), for example, is black and white with a black dot upon the white background, and a white dot upon the black background.<br><br> Now, we have brought this TaiChi watchface design to you. It&apos;s derived from Taijitu. The center white circle shows weekdays and day of month. The bottom black part contains white numbers to show Hour and Minute.<br><br>How to Use?<br>- First, you need to have an Android Wear watch, and download &quot;Android Wear&quot; application from Google Play, then follow instructions to pair them.<br>- After installed on your Android Device, this watch face will be automatically synchronized to your paired Android Wear watch. <br>- Long tap on your Android Wear watch, select &quot;ZenTaiChi_WatchFace&quot;",
    "histogram": {
        "1": 2,
        "2": 0,
        "3": 4,
        "4": 4,
        "5": 3
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/86zkji7YrhjmVT1R7pNhwQJExsPAH_ol6ZRuk3ukwuO80tMMGA2mI4DFvPsaSbs6V-_8=h310",
        "//lh3.ggpht.com/j2gJHsTizE95Y2_fhKDeRe8-FruSfkpqZfYt0dvHKYYJeD_zEgqtuA3u3zANIYj0QTU=h310",
        "//lh6.ggpht.com/1XzOcp8uE8jXvW7DTOzvRz3qGLhLtqqxGCbd9zNedEHJxyS67_00if6kVvQZJz2-tik=h310"
    ],
    "comments": [
        "No 12hr mode For U.S. residents that are not military/fire/police or rescue 24hr mode is useless. The face is beautiful, but until 12hr mode is added this face is useless. Sorry.",
        "Needs options. 12PM is displayed as '00' please fix. Clean design. Would be nice if there would be an option to switch to an actual Ying-yang design watch face.",
        "Nice watch face but... Would be nice to have the option to display 12 hour format... Update?",
        "Very nice watchface but... There is no 24h format and at noon its saying 00:00 instead of 12:00 this should be fixed at least",
        "Really nice I really like it, but I wish it had options"
    ],
    "recentChanges": [
        "1. Upgrade to use latest Google Watchface API."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=zentaichi.vmless.com&hl=en&gl=us",
    "appId": "zentaichi.vmless.com"
}