[
    {
        "author": "David and Bethany",
        "comment": "Certain features are only free for 20-30 days. Then the app takes away those features. I've never heard of an app do that. Kind of shady on the developers part. Otherwise, App is easy to use and very user friendly. So much better than writing everything down. Just wish I would've known about this sooner. Unfortunately, the app stopped letting me and my wife sync and required upgrade to even look at timeline or summary. It was great for 2 weeks and then just kind of cut us off.",
        "date": "April 17, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRWxNclRWZ0dJb25NZkJIVlhkVzI2T1BkN2gwSHlCSTF5RUp6M3lXNnZkVnZkMTgtMTRtaWpZOXNON3BaUl9NXzNMcERSVFlUdGRhb21zTWFJ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Megan Beth",
        "comment": "I love this app and have used it with all my kids. From birth it was extremely helpful with keeping track of feedings and diapers. Now that my youngest are 2 and 4 I use it most to track medication, temperature and sickness. This app is wonderful and I'm so happy I purchased it 4 years ago. It has been well worth the money I spent. Not to mention there have been updates added throughout the years that make this app even better. Very user friendly. I used/use this alot when taking my kids to the doctor as it literally has everything the Dr wants to know on it. Highly recommended from this mother of 5!!",
        "date": "December 26, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSGZmcmVrRlBPdktRbHpVMVdkcUJaNWVjdUF6V21kTHlfY1l5SDVtNzVoWDNMVzYxTmJiX04tbldLWEZWRlBXUXZpT0JxdUVCS0hfTER5c1M0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Matt Johnson",
        "comment": "If I could give this app more stars I would! We just had our first child and since our brains are utter mush with excitement and love for our newborn, we are lucky to get both shoes on the right feet, let alone chart bathroom stuff and which boob is getting more attention from our new baby. This app makes it all very easy. I can't imagine doing this without this app!",
        "date": "October 8, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRUgxZlBmMVhWS2lQYmFOQ2lmbk4tUHhYOXhMcHVlMXBMN0xYTkU2OFVBLVVZdTBfcjlLdXBYZWNsNEtqaDkzcEpnTXNod1Ita1FrbGJqMGNR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sarah Banda",
        "comment": "I love this app! I ended up buying it to upgrade free version and it was worth every penny. I use it daily to track feeds (including solids), diaper changes, baths, temperature, meds, shots & doc visit weight & length. My baby is going on 8 months & I couldn't function without it especially at the beginning when I was sleep deprived & couldn't remember a thing. Best baby app in my opinion",
        "date": "June 29, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPR0VEeG55OXEwM2cxb3RZanhPQk9oVDRBQWVFVE05UzNiU1VmTlhvOXFyeHBXTl84MW9fTlhneUhSYWVkUkhpRFhzT0Q0TFpCWmhMNkFzOTRv",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jonathan Pinder",
        "comment": "Very complete. Only issue is sometimes the sync does not seem to always be in immediate real time. I have Android, wife has IOS and we both had to pay $5 each for the priveledge if auto sync and yet it's not 100%. Also even after paying for \"premium\" they force you to write a review to remove that request that is plastered on the screen. Really their items should reduce to 3 stars but the app itself is very well done, thorough and intuitive.",
        "date": "April 8, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSGU3M0dpUGZRaC1ydDNfTDBjU0FiU0VJVFQ2c3FpY2tSSk9YZG1fQnJDZG5MT2lpOENVQ0dWcUdaUnUxZjd4Y29xRXltUG5jaDNQbGh1d2N3",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Samantha Petty",
        "comment": "Suffices for everything it claims to do. Easy to use, making it helpful to keeping on track, therefore serving it's sought out purpose. Would suggest adding some options to be more detailed in the diaper logs, with the chances of it being a topic mentioned at least once between a parent and their pediatrician. Also another great convenience would ultimately be the option to add and customize your own tasks or journals while having the ability to edit and priorities with existing ones alike. I really like this app and I plan to stick with it. Unless of course, one comes along just like this one but with those features included ;) Thanks for the app as is, I must say. Makes my head hurt less than trying to keep track of everything by memory.",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSHB0RGJOSnl0WEJBbmNmSEdaMjY0MWR3TDBkYU9hQnBsU3MyWEw4aV8zS0lEWE1TaTdvc0EycTdsOWVYSUxoYXZ2R2lxS3ZIczdlZm10SzVV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chelsea Weinberg",
        "comment": "I absolutely love this app. My daughter is 2 weeks old and I've tried a few different tracking apps before stumbling upon this one. This is by far the easiest app that I've used. I love the fact that you just have to hit a button and it logs all the details, very user friendly. The ability to change the time after starting a feeding is also helpful because very rarely am I able to hit the button right when I start. The graphs and reports are awesome and have helped us keep an eye on her growth and habits. Can't wait to keep using this as she gets older!",
        "date": "June 8, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSHhmY3B4OGlNdVRpajZUU2gwaFJMaGVveVNxZ19FNUVKUjJFalpJeG1VZzJNcm0yQjFRYnVDYndrQWFKYmR3cW0xYUJ4V21nUGJnQkg5MmNJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ashley Arthur",
        "comment": "Love love love that you can sync between Android and Apple phones. It helps with my baby and daycare. You do have to do the upgrade/pro version to sync whenever you like. Otherwise you can only sync every 6 HOURS! It works well once you upgrade. You can also add things after the fact and update at a later time if you want. Most others do not allow that from what I've seen.",
        "date": "April 12, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSHpoSWkwZVdFdC0zY3hNT3djUnkwMHNGNTRoOFlxWWZINVYwOExTRm1ROHNfTFlib2NUV1piYUpEeDIxaDd2Mk8zN2wwcWd5QkptbVRBeUdZ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Zane Zamuška",
        "comment": "Great graphs! Some suggestions: 1.Remember it's feeding moms using it with one hand. Buttons could be in the middle of the screen to better reach and turning the phone accidentally should not make you start all over. 2.Selecting date and time should have option \"now\" or \"restart\" (i.e., I start a new sleep but baby wakes up and I need to restart it). Also for adding past events, please, make the end date by default be the same as start date (with possibility to change) - as I normally want to add a past event which is 10min or 30min, there are rarely 5 day events.",
        "date": "August 18, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRW5pWG80ZTBCbkl4YjE5NzJKTFdUMW9ndDFsUnM1RHF4dXplMzVyekIzNkRsWFA0RmVJSXppSjZyRTcxYWVPZWg5M0JuU3FBNzFpYlUtaXdn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Alannah McClurg",
        "comment": "Amazing! Cannot fault this app at all, I haven't used all the features yet as I mostly use it to track feeds & nappy changes.    A notification appears after a certain amount of time, I assume an average time, of when the baby was last fed/changed alerting you that he's due a feed/nappy change. I thought at first it'd be completely off & I would just know- oh how I was wrong!!   Amazing app!!",
        "date": "May 9, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSDZncTYzcnBQajM1elVDYTVKYU0wUzBUUGhDOWZXLU9ESEdBbW1nT0xxakhyVUlxN1pKNl9uaEJhRGZuOW5NQUwwQkVKX1FDZzlWLWhmUlM4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "This app is absolutely brilliant. Yes, it's not cheap, but it's totally, totally worth it. I've used it for several months now and really rely on it - and it's great to look back at milestones like the first time they sleep through the night etc. The customer service is great as well (I had to re-sync my data to a new phone and had forgotten my password and they helped me re-load everything). Lots more features than I could ever use, but great to have it there in case I need it!",
        "date": "March 29, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRldNbzR2a3piRDI5cExsNmsyOVYyR2t0ZHdCVE9IUzNEVWl0R0pQWlc0SkFXeUk4aWdBWURHWVk0RzE4OGNtWE9nNG9pT2V1emJBbS1vUmdZ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "This app is awesome, the widgets are awesome... when they work. The initial response is very quick, but the replies to their response are not quick. All of the widgets stopped working after a few days. I did the in app upgrade and paid for the pro version. Their recommended fix did not work and I gave them over a week for another response, but nothing. If they can figure out why none of the widgets work I would gladly change this to a 5 star rating because when it did work, it was great.",
        "date": "June 20, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRWJPcDdHaGVYQkZuYzJET0NXX2hJSzZVeEljZWdzNHBCM3E5LWVPSUhJMS1Gbkkza1ZjZzhST1dsOTRJWGlZMkJYUmEyUmJEem1JNG5uTWxF",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Stephanie Cormier",
        "comment": "Love the app. Only thing is you can't log a feeding session (i.e. when nursing and baby fed off both breasts).  Currently you have to track one side and stop the timer, then start over to track on the other side and it counts it as two feeds when really it was just one on both sides. Would love to see this updated for accurate tracking.",
        "date": "April 6, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRVFZcFR3YjZsX2lWUW5lODdLVGsxeENWSnhnQjhncFE3Q3lXOWgxLWpFWF9NeC01R2pWc0lLcF80czNKb3Rfb0xyZ1h2dGlLbXI4bmFkWHIw",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Mark D",
        "comment": "Look no further for a great app for tracking lots of things about your baby. I loved how simple it is to use, how nice is looks, the amount of features and also the ease of syncing with my wife's phone. I paid for the unlocked version within minutes and would recommend doing so. Well worth the money!",
        "date": "July 11, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSFYxbWxsQ2JHN2ltdGJfTTlYQmE2MFBUWmF3TjU4SWNjRGRTVzA3WVBiM2d4TUlwTHd0UWVfUl83VVdVRHVONTFDNGw2ZWY1Y3ZxZXZWNHRv",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Clare Ralph",
        "comment": "First time mum and have found this app sooo helpful to remember what's going on and answer health professional questions. I would never have kept track without it. The widgets are super helpful and I set up a whole home page just for baby stuff! Would absolutely recommend. Just hope that the data is all saved when I have to upgrade to keep the features.",
        "date": "August 4, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRW55dlBsemFIYjRSTjRieG9LRzlmRzZvd21nNzhzZWFObV9qTF9ROEQ2MnFmWi1EQ1JaNUpDdEdhLUw2Zl9Yc2RZM1R1dmVqTnBxc3V1c2xr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Shanna M",
        "comment": "So helpful with our first born. My husband and I love that we can sink our phones and that you can track so many aspects of our son's activities and growth. I normally do not like paying for apps but this was totally worth the purchase. I would highly recommend this app to any parent.",
        "date": "September 12, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRi1wcWI3SkJ3dURORjVwcHlma3R3bXgzSVNrWmxJakxhbDJnUndvZkpZYjg5R05kdWNPcjZwYkluSjJOWURGZFFPSy10STg0WTI2OXdWSVVZ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "James Ziegler",
        "comment": "Best baby app out there. Upgrade is worth it when 2 people are needing to be synched up. Only needs better way of recording how much milk is pumped from each side when you are pumping from both at the same time. Right now it only asks for the total amount pumped. You can write it down yourself in the notes section, but it doesn't keep track of how much was pumped from each side to easily compare and see a difference over time.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRlBabXh4OWdUSVJZd1U5QWZLTVU4REFQZnBlS1B6cXRSMllJMjJlam9oZlVwUFhuUGY2T0w5QUg2ZXZxSmtHd1AxOFhpX1JDNDBZblBNT1I4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Angela Lessington",
        "comment": "I've used the app for breastfeeding, baths, bottle feedings, and med reminders. It has been amazing. I can only imagine how good it will be when I take advantage of the other things in the app. The only bad thing is the syncing with my husbands phone. I have to press the sync button to have accurate numbers. When he stops the timer on his phone, my phone will not sync like the app claims. This is why I only gave 4 stars.",
        "date": "March 5, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPR2M4SDIyQVBkQ3BHTUc0dW5IaGJWOTN1NFlRUEo4WEk1YnNDZF9DbmlXYkh5UlZLUVZNTnBieFhjS3lQeWtUSGRoVkx6cHdpQjVEU0dsMmhr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Hannah Organ",
        "comment": "discovered when my daughter was 3 days old and I was struggling to keep a paper record of everything. Great start and stop buttons for each thing. I often have to edit back the start time or slot in an unexpected poo between feeds which is simple. I enjoy the stats for the day and can see regular patterns of feeds and sleep forming and it is comforting to have the reminders alert when it could be time to check something. Brilliant app. Getting the pro version.",
        "date": "June 15, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSDRDbURhc05CV0hHbHhfeC12dHZ2cjV3cEVKLXZLRE5NWnNCbW4xWFg5S2VTOG1OVC0wVDVxWmFjbDRwU2s3RFF5dGxOM1BBMnpvTFlyZGw0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kelly-Marie Bonetto",
        "comment": "It has everything I can think of. I love that you can back it up & sync it with your partner so that they can see all the info on their phones as well. My husband is still off on parental so he lets me sleep in some mornings and no longer has to wake me up to ask me when our son's next feeding is due, he has all the info himself & can enter when he bottle feeds so that I can see it, too! Worth the money, imo, especially considering it's a one-time fee and I'll be able to use it for our next kids. Helps me keep track of when we last bathed him or gave him his vitamin D, too, otherwise I'd for sure forget on such little sleep! :-P",
        "date": "November 25, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRkhucmo5M2dWYkk0RWE4VDRoMTJnRF9RczlGZXRFa3RKd1NyZGs1Yk5HSWlNNGFDaGNQT1RJTWx2RExtTUZ2cjNxdm9EdGo0VG52QjBhNEFJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "barry cook",
        "comment": "Great app, and especially useful the ease with which you can sync it between devices. Wont let you input 0.7ml for the pumpings section so had to do 1. And on occasion will not show correct time for a feed. But these issues are minor its a great app. Well done",
        "date": "December 9, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSHYzX080U3BHOGxnQmozLTRJRHp1Yk11dnViV01oNWcwNlhjbmFRN0RVcWFoc05qVVF0ekdzaGZZLU5wQmc5Vlh5NzJhWWo5TnBDS0RYZ2hR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Really useful for tracking everything from sleep to feeds to growth and meds. Used multiple times a day - the sync function is particularly useful.  Would be great to be able to switch sides mid-feed rather than have to start a new feeding session each time. Skews the number of feeds per day stats.",
        "date": "June 1, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSHB6eHBhcTRIc3JIemxaU3QxaC1jdVM2NWlIM2FPajJjUHZ1VFlHaXRiRjZ2dURRb1A2UzBsSWw0TTBCYXdNeHR3MGoxV0dwUTZOT3BhdHBz",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Megan Anderson",
        "comment": "I used this the first time 2.5yrs ago with my first and just downloaded again for my second baby(2days old). I would have lost my mind if I had to actually keep track of which side I started on last time first!! Also logged baby's info and updated at all Dr appts and love the reminder to feed baby and how more user friendly it feels even compared to 2yrs ago!! Great app, highly recommend!!",
        "date": "September 4, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPR3lBNWpLMnBNM1dITUduc2hWTUN0MGk2ODBYeTRVYmVtcHFZNkR2cjNicVZaSUJQR29mWUt0WkJFWDRrOVVEWjE4YUVQbHJyby03aWtUYkNj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Fawn Smith",
        "comment": "Great app. Very useful and helpful. It has really helped me with nursing as I was struggling at first and my son was struggling with gaining weight. We were able to show his dr all his feedings and she was able to suggest things better for us by seeing all his feeding habits and logs of diaper changes. Seeing all the feedings, pumpings, and diaper changes is a huge help!!",
        "date": "March 15, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSGw0SFF2Z3JZRDJFLUdISW1BXy1TVFNoZEJKUGhPVVlWOXlDNHZ3RUtUVWUybnpudUROUUZCRnRaVEo0dEVsNTgtdE5ONlJ6czhldWRpdGtv",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Reanne Wood",
        "comment": "This is a brilliant app. Love the fact partners can also see what the little one has had during the day. But now I have changed phone  (my parents old one) it doesn't seem to automatically sync so I have to manually do it all the time?",
        "date": "August 16, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSGJELVRQTnRYbm9pY2M2VmZUT2k1ZFZKcVNEVXlSa0g0OHpOUEp3dUVGeXZyaVhVcFJvMUdNRGJnMkJBSUdqRS1Xd2xUd3BFa3F0R1pMSWlj",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Summer Basso",
        "comment": "This app is perfect! So easy to use and the widgets are super convenient. It makes keeping track of all things baby very simple. So when I go to the doctor, I am able to tell her definitively instead of guesses and assumptions. Because who really remembers when you're getting up all hours of the night. Highly highly recommend.",
        "date": "February 20, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRVBOLVpUU3BLUzRSVFFMblVDR1BDREVhTGFIaHlBdHE3bUVGNE5VSkdmVzZIcUZDSzdTM2xLdzNQbzdFNWlHV0RiTklxZHhGdUxVcF9lamFR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kristy Vierus",
        "comment": "I was loving this app until my trial period ended... I didn't know there was a trial period. Now I have to pay if I want to continue using some features which I won't do so now the alarm only goes off if I touch my phone so if I'm sleeping I might miss a feeding & I can't see the daily summary anymore which is sad because that was really helpful. I'm a bit frustrated with this because like I said I was really enjoying this app and it was very helpful in keeping track of everything for my newborn but now I think I might have to uninstall it & find something else because the alarm is necessary & it's not working right.",
        "date": "May 9, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPR19NZlVQSTBTV3J5eFBrRTFORXpfWi1lOFdwamstUXVLTlRQMnpLVm1MbEUzNE1HSTNBNnN5dmg2cjVuWUdTX1N2US1IUnZDbEdqXzJMdHZr",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "IDontwish Toprovideone",
        "comment": "I don't really leave reviews but I had to leave one for this app. It helps track everything and has great reminders! Even for dry diapers! The nursery nurses all love this app too and are recommending to other patients. Ads are very small and unnoticeable.  This app is very very practical - this is my new best friend!",
        "date": "October 5, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSEVoYno5VXRkTXFQNXYyMFpmbkJqREVXMFJCN3I0aEJSVDZiRFE4Yk9SdUhlVEFlWWFIM1Zlb3prVUk1RTZybks0bVBWTFpZVWdOTjZuTjJB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ruth Conroy",
        "comment": "One star simply because it KEEPS asking me for a rating. So I did to just get it to STOP! I would give it ANOTHER one star if I could because even AFTER I rated it, it kept interrupting me on my 2nd device, even though I'm logged in under the same name.When you fix this I'll change my rating. And now it keeps asking for a \"positive\" rating to get rid of the bar to ask for a rating!",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPR0tmUGNMbTNJRFZneFE0VVVVLTZXbG5pS0lOZDM0Y1RabER2cEl1MkQ3emNQc0hoRmlQQzI4NTMzWFFXUXFPMzNxY1d2dHJXOG9JcVpzUkkw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Diana Chestnut",
        "comment": "Easy to use and edit. Editing is key because so many feeding tracking apps don't let you edit later. I love the feeding reminders. I use the medicine tracker for my post c-section meds and it helps sooooo much in my delirious state. Definitely the best feeding app I have found!",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPR1Q4RTZjMHo0eUt6SWRvaElDTTYxUkVidGFDWTFZeW5IdVpzdGJaTUk0emRHWC1Ja3Z5VzVTZUhhZEItSEVPemdYSDRsV1E1Z0xuX3FfQ0tn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jodi Morgan",
        "comment": "Love this app. Easy to use and has lots of features thst make it worthwhile. My only niggle is if you come off the feeding page mid timer, you lose the option to \"pause\" the feed so you have to stop the feed then either edit it or continue",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRjBRaGFLYnRKMjRscGRUSDhoTnlzdXhuOUltOU1nNkFadWdnZzRMZWhRRjBzd0pVdmpmck5hQ0NtSzEzd0oxUlNOV29NeDE1SGhDU2tHV2VN",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Yvonne Mitchell",
        "comment": "The syncing aspect of this app is AWESOME!  When the motherboard of your phone has to replace, it meant I had to start from scratch on pretty much every apps I've had previously. This app was especially important to restore because I had recorded my baby's milestones in the journal section.  Being a mother of two, it's also hard for me to remember things especially passphrases. Luckily the customer support is just as awesome and was able to help me retrieve my passphrase so I can have all my records again!",
        "date": "March 5, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRkRKdDh3QW9vWTVRQ0dScHBZNGY4QkMwYkNRZk1mUzNTQnFEdG1fRTVqeWFTb0VReWhwbC1RZWwzUEl2LUdZcU9vS2ZHR0tLTElaMHk3Z2RR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jennie Burton",
        "comment": "I really enjoy this app! It helps out a lot with keeping track of how often my newborn eat, sleeps, and needs a diaper change. The pumping section is really helpful as well as I'm an exclusive pumper. The only thing is I can't seem to find a difference in the simple version and the upgraded version, I just bought it anyway. I also enjoy the themes!",
        "date": "June 8, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRmNIdFpCVEhDSk9hMFgycVRKZExQWlRSaHVsQUFab1RKYXlzaDQ0SUQxUTNMem9JUWhKU1pRMUZvd3dQXzFISFM4Yl83b2g4OU1fMTBPY1Rr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Breanna Graham",
        "comment": "Edit: I did like the app when you could do multiple children  for free, but now you can only do one child. I will eventually buy it because I do like the app, but I think you should be able to have multiple children on the app without having to purchase. There's ads all over the app. I run a daycare so keeping track of everyone can be difficult. All the kids are under 4. This keeps me on track with my own children, and if I want the daycare kids as well. The only thing I would change is the alert every two hours for feeding. My feedings are more spaced out. Maybe an option for how many hours? Other than that great app!",
        "date": "March 16, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRXNWUTFzNk9pc1RwOGZ0U3hpSmhIYjV0X2xsS2VIblZlNjZzTHMwbUxUNkRlcEhWbUs2bndMRVY3UE9MNG5iLWIzcEd3MTl1TnNMdnJjaUQ0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jessica Webb",
        "comment": "What a wonderful app for a new sleep deprived mother with no memory! I tried the free version and liked it so much that I decided to purchase it. No regrets what so ever!! I did originally give it 5 stars but I am removing a star because after I purchased it & rated it, it is still asking me to rate it EVERY DAY! This is super annoying. Update -  it's STILL demanding a rating so I'm taking away another star.",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSHlmR010cENxNFlQb3k2MENkbzljVlMtTXQ3RExyRU1ETGh1VDhVZXdnVEhWQzFYVHM1UHU1bTV2UUgwaHlETEcwNnJON28zNGNPZC1CSHB3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Victoria Williams",
        "comment": "This app is awesome!! As a sleep deprived new mom I have had such a hard time keeping track of how often she eats/fills diapers. This is easier to use than I ever imagined. It's really helped me identify her patterns and I'm looking forward to having actual answers when the doctors ask about them!",
        "date": "March 17, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPSFF4b2l0SF9pVXlLWWljdVZ0YnMxRUZCVDdwZHhRUDdqbGVWSEQ2b0dYbHl6NzlaajV0NEhTdVBwaDhNWFMyV19GN3lUTUY5cEo2eWgwaU4w",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jillian R",
        "comment": "Great app! Although I like to nurse on demand it's nice to be able to keep track of feedings since you're asked by pediatricians how often they're nursing and how output is. Half the time I say \"I don't know\" or look back at this app and tell them.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPR1lpcFF0S19QSmV4VDY3Wl9hNklJNm9PUEZzT0h4UjE5Z1F2ajJTb1RyWGdlVlBueUpNWTRuZTd5QkxsSnY3VzAxLXc3NC1tdXBzYlFjVGpB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chris Greenman",
        "comment": "Great app.  Easy to use and gets the job done.   The only hang up I had with it was with adding a second baby. I had to reinstall the free version and add it.  However, thanks to Google's family library I didn't have to pay extra to link up my wife's phone.",
        "date": "June 7, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPR2pjZm9JaVgzbXoySkI4TzBxRER2aXU5WmFxR0tHQ0RIc1plaVBtUVBJQktpVkZNV0lRSXV1eXViQV9TdEY0V2dUTWN3bkV0MEltdnJMc3Qw",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Brian Arche",
        "comment": "My wife bought the app and I downloaded it. A lot of times I can't see what she has recently entered. It's led to a couple of over feedings. Nothing too major. This is definitely a five star app, just need to get the sync between phones faster",
        "date": "May 30, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRktocXJmT3NoU0F3LVdEUHE2eGRUdnhjSVgyWDNpbWtsOXY0NFlXV3Jvcll4UzhycGlFRnBURU9OcHdyMkd6dzBXV0owOXM5MU5kdHhZNy1F",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kevin K",
        "comment": "Spent $5 for this app to remove all the ads but had to come on here to rate the app to remove an annoying red banner \"rate me to remove from app\"! That is so stupid! I would give this app zero stars for doing that. You don't lie and treat your customers this way, especially the ones that buy the app! When I upgrade to the pro version where there should be no ads, I expect no ads, period!",
        "date": "May 16, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&reviewId=Z3A6QU9xcFRPRWJ3OWktWFpjVUF0TWhtb0VkcUZLdG5MLVVRekN0SWZTUnNjQlA1b1U3bHNDQzdCZ1Fmc2FSbFJReVc2WTVUekZ2c21MR3NiazZXOEt1MjVV",
        "reply": null,
        "star": 1,
        "title": null
    }
]