[
    {
        "author": "Keith Sevcik",
        "comment": "This app is perfect, no frills, no ads, just simply tracks activity. Clean intuitive layout. We've been using it for half a year now and can't imagine how we'd function without it.  UPDATE: I think this app may no longer be supported. No recent updates and the developer isn't responding to emails. Still good but the widgets have issues in Android a Nougat.",
        "date": "November 2, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRk9EaTZfTHhXMjI3WW5zRnA3RWc3ekg4VGJPaTlnQUw1VV9SR1RpNFprU1dXYV9CZUpnT3BJRnlrd2kteHBVQm5uTDFMemQ3VUN1QTBZNUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Crystal Racklyeft",
        "comment": "I've been using this app since just first was born and loved it, recommend it to all my friends, no problem for nearly 3 years. Now using it with baby #2 who's just turned 2 months old and all of a sudden out of the blue yesterday, all her data just vanished!!! I tried syncing but it imported my 3 year old's data instead. Help!!! No support coming through from the facebook page???",
        "date": "November 20, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSHJWdjFEeC0zd01JNVZVS1dTQW44Rk5mZVVQRG5WX1QxbkVXblJOZ0hIM1RQRmpKWGxfU09KSDlIYk9nbk8ySG11a0pfNVlKM0k0ZEVpYnc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Krysta Arabudzki",
        "comment": "Perfect app for the first-time parent. It allows you to track everything for your child during those sleepless nights. I've used it for three-plus years for both my first and second child; I love it! Penguin Apps continue to make helpful updates from a usability standpoint. Fantastic customer service help, too. I highly recommend!",
        "date": "August 12, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSE1faTYxUVFacjhnS0RySkZWN0FXWTNMb0JNZnlIbWowOUVWaDRaal9WbUM3ejl4YmZWd0x5SWdRSXNfUmNpZlZ3WVFJYTNLTkdTQlJjTXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sheila Sliffy",
        "comment": "Tracks everything!  Can't think of anything else I would track, and I've been using it for 2 years now.  Love how easy it is to track feeds (left/right/bottle and frequency) diapers (wet, soiled or both),  baths, pumping (left/right and quantity), sleep, growth, teeth, medicines and quantity and more.  Always records the time and has sticky notifications to remind you to feed baby or check diaper. Super helpful with baby brain and answering questions at the pediatricians office.",
        "date": "August 11, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSHFtVzlKSjhudmZ1ZF85akthN2JNcWQtS1NaVmY2SW9LbmwwSFM4aVJhbVQ0YUN5OW9USFNjdHIwdW9wRHR0b2JRb2RmT0xBajRYRFJYTUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Megh K",
        "comment": "Tried another app and hated it. This one is so user friendly and has everything I need to track. We used this for our daughter and now we're using it again for our newborn son. We really only use it for feeding and diapers, but I could see the other options being helpful too. Highly recommended, we find it incredibly helpful!",
        "date": "March 10, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRmNqbGgyY18xTDNCZnFLN1F4dHMzaUlvdjllajI2QTdUWUxjMHA3WHpRTWJfLUMzbEtJellaZWZFVnl4MERGczlLcmQtUGRwNlc1enJHVnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kaitlyn Hanrahan",
        "comment": "I needed a way to track this stuff, because it always felt like I *just* fed / changed/ bathed the baby. Having this to look at made it easy to figure out what the baby needed.  Its really nice having feeds, changes, naps, baths, meds, growth, everything all together.   The Pro version is worth it to sync between devices (even between different caretakers). And to save everything for posterity.  I had trouble remembering my passphrase, and the developer was VERY helpful in helping me recover my info!",
        "date": "March 6, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRkU0c1BiaFhZNTRYWGZGd0JnOHcwYXVOZHRtSjlKWHAtYVltMlI3SWpkaTNoRktKU1JId29Pd1ZicFV4cVZJbUxoWFp2Zll0R1ZiSkRvbmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Amy Long",
        "comment": "Wonderful! When your so tired you can't see straight this keeps you on track. Great for breastfeeding to know which side you did last, wonderful for formula to track how much and how often baby is eating. When my babies were brand new I tracked diapers to make sure they had enough wets. When sick I track meds so we don't mess up dosages. I always track growth because it's fun and the widgets make life easy. I love this app, used it twice now and it has been well worth the money. In fact, it's the only app I've ever paid for. Buy it, you won't be sorry.",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRl9oWlNBTEwyWnhGaFYzekRvd2UwYlRHX3RycmRqanQ4eEhSZlNPVUwxNU83U3JRcW5fZTJFdnV3QzVaWUlZaHV3RlY0WWJ2NWJzUmNqT1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marian Cruickshank",
        "comment": "Easy to use and keep track of the feeds, pumping etc. But annoying when it keeps asking me to rate it, even when purchasing the pro version! It would be helpful if the full screen timer didn't pop up when starting a feed from the widget. Is there an option for that and I've missed it? Despite the small flaws, I've continued to use it and like it. Plus their customer service is damn awesome and helpful!",
        "date": "March 19, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRm13c0lWMUQtalBnWHVrVWpRc0I0SGF6c3lDc0lxcHdBeVk3OTZsdk05SmNWcTJLbXpQSF9ma01Cc2R0OGhYd0pQUF9kb0RTa0s4Zmk3aGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Shaun Currier",
        "comment": "Time entry is very time consuming for retroactive entries on android 5 because it's buggy and won't accept the time you selected unless you move the active field to the next field to make it stick. I know you can hold down the button to do retroactive entries but that I'd not what I'm talking about. I'm talking about a bug. I also occasionally get sync problems where the program recommends syncing on the sync page but for some reason won't automatically sync even after days.",
        "date": "February 23, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRS1qMjZnR0MxTzhMMWJja2ppazIxYXhudnNiRnVDNWRqNGdscXpYOU9jQlNtMVdxWDRrU1FxNnlTWTJ6SVpOYVMwWnRhblYwcWhmdmdVaVE",
        "reply": {
            "author": "Penguin Apps",
            "content": "Hi Shaun. Thanks for clarifying. This may actually be an issue with the time selector in general, which is native Android UI. We simply wait for it to tell us that the time has updated, which it seems requires you to tap into it or move the active field. Anyway, email us if you want better support. These comments don't allow conversations.",
            "date": "December 9, 2014"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tasha Donatti",
        "comment": "I like it but I really dislike how it turns to landscape mode every single time I start a timer.  If I want to hold my phone sideways I will, otherwise let it be portrait.  Also how I HAVE to have a duration for a feed.. I just want to add feed startn times without having a timer and having a duration (the same way you can for pumping)",
        "date": "April 18, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRmMxY0d5bzdWVlUxdUlwNktuVnU1STBhc3N0enJ0b18yYXJUVW42eFJ1dzdiTTUxYmNRd3dLUm90MmpuWjAwQ3kwNklWTjNqVklRT0VNamc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Demmaree Lilley Li",
        "comment": "I have used this app for 2 children. For my first, I tracked pretty much everything - diapers, pumping sessions, bottles, solid food, and fevers/medicine. For my second, I use it to track breastfeeding sessions. There are a few things I'd like improved - especially that the \"night\" screen for the breastfeeding timer does not dim if my backscreen light is on a low setting. It too bright in the middle of the night. I'd also like a way to export the info to save into a baby book...maybe a monthly snapshot of what baby is doing in selected areas. Otherwise, great app!",
        "date": "April 16, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSHl6QlNTQm1TMm90UEVDQjctTWIwYVFranFBNlIxWHVqRmJuT3ZYQUt5dkhtQ1VhcG11Ty1CY3l6c3ZSR0x5dzhsLU82STNWNXBkUW5iSmc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "This app has helped me keep my sanity as a new parent and during round number 2. All of the things I need to keep track of are here. The app is easy to access and rest to understand at 3 am when my new born is singing the song of his people.",
        "date": "May 31, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSGFHclNnOTl3WmFYSFpDcmpQX0RDNHZJUlc2Z3hUUEFpYl8yTy1fZUZGU1lPeGZrazNCMUloVE1wdFVVX0stMWVrWGx4WEdNU2l1Ynpvd3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Amy Knodel",
        "comment": "It does a great job syncing my phone to my tablet to my husband's phone depending on who is feeding/changing my daughter. It also shows how much my daughter ate at each meal for a week and how much for the past month with a weekly or daily breakdown. This app was also very useful because to give my daughter breastmilk I had to pump and this really kept me up to date with having to pump to keep to her schedule.",
        "date": "March 28, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSEdTaHpjSTBNcHNtSjVNR1cwT2tmc3ZaS2JnTV9yeHZMUElLbHd5V0hFRVUtV0lEaHNlTGRnRWpPV0hFMUt0RTJ2OWFzY3VGb1A3eldfT3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sarah Woodward-Jones",
        "comment": "Very helpful. I can stop trying to remember the last time I fed, changed baby and on which side we nursed. When I go to the Dr I can immediately pull up the average number of poo and pre diapers.  This is my second child and second time using the app!",
        "date": "June 14, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRkxjbDdaUkkzZWl1clYyeHY3NkdZX0tBMHNhY0RtclF4RHZDTXZvQURyemZoREUxaDJydnhPYWJSTzZmbXRQZlBEemRMUFlqbnlmM0UzWkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Stephanie Baysinger",
        "comment": "I have a toddler and now with baby #2 it is impossible to remember anything.  This app is so helpful at remembering last time she ate, when I need to pump etc. I also love that I can track her growth here too!",
        "date": "April 9, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRkRsOHByOWlIaWZHNE9Qek1TQ2c1a0hxX01ON19HQmdLMWY1bTV4dWtBdTJIN1FrUUJSRTFvalZNa0QtRWRjSVNHcWRrVDBfVXFUNTNYN0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Breffni O Sullivan",
        "comment": "I would have rated this higher except for the fact it kept asking me to rate it! I paid for this app I shouldn't have to rate it if I don't want to dust to stop an annoying pop-up. Functionality is good however now using this app for second baby and had to delete first child's data before I could use it for second child. I would have liked to keep the data so I could compare.",
        "date": "March 20, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSG1sWk1zdjhJaTFTbGE4a0ZyNFVjdFBzbjlVSkFpd2ZpMW1TdnhwMXF6cTkwVkU0VFUtblprMHBqZW0zMnVCM0dBMnQ0azZQdjR5UHhFR1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Heather Scauzillo",
        "comment": "I may have a dulled memory after having this baby, but thankfully Feed Baby remembers stuff for me, from the last boob drained to the last bath. *Update: This app was great for my first daughter, invaluable for my second.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRzdDME1ua0ZoSVBlWDVISk44R1dnRUFsQzNPQUY4c2x3OVZyS25iNW1BbzFFaTlBZVc1VllvM0RkSUE3MDJrclJ2SFNXeEk5c09fZVFLUVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Leticia Seabra Delgado",
        "comment": "App is great but every time i'm in app asks ti rate it. I bought this app 2 year's ago and this year it is boring, annoying me .",
        "date": "July 27, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRW1qNnhWZEczallyRlhLRVJUTzFiek1paDQxWTQ0NkNlbmg5cWcwZ1V6bWtsTS1DUVQ0STl6TEcwWEZob0g0RTlsOWtTbEp5SEp6Wlh5SkE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Tyrone Blackburn",
        "comment": "Software appears to no longer be supported. Lost sync capabilities almost a month ago. Regular emails to developer from myself and wife have all remained unanswered and needed functionality remains broken.",
        "date": "November 5, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSFRXWmw2MFY5TmIxb19ENDJocDlkQmJDM3VUWjdMVTc4eUhEd3MtbW9NVHEyOFZSMmt1MFVibVlsS1BjRnJmdzdWZW03YkpJZ2dESzI0QVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "A. Payan",
        "comment": "Almost 9mos in and this app has been MOST helpful for me to stay in tune with how much my son is eating, his sleeping patterns and helpful for overall health stats. If my son has been sick I am able to give my pediatrician exact info on his eating, sleeping and any changes that have occured. As we have switched from BM to formula, and added purees and now finger foods, I can keep up with his progress. LOVE THE APP!! *recommend*",
        "date": "April 7, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRl9aSjhWd19jeFRaSWdQRV8xMVdxT1o1NEltcGFfVmh1NDF1dkFhWnZwQ3JFREtpell3cXU2N3JWX3daOExINXZSYk01YkFfY3ZlY19vbVE",
        "reply": {
            "author": "Penguin Apps",
            "content": "Glad to hear you enjoy using Feed Baby to track your babys breastfeeding and growth. If you have any further questions or concerns then we're always available on Facebook or Email. Thanks!",
            "date": "April 3, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sarah Goodwin",
        "comment": "I'd never remember it all without this app. Pretty straight forward and simple to use. Occasionally I  feel that I have to click too many things to do what I want but it's a minor inconvenience for what I'm getting out of it.",
        "date": "February 23, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRmg0TW1IVmlWRlhrRW1MdDZ2Vl8wTlFteElCZ0cyang4ZExjOW5WcGNpT09kd3llNzVtcjNCbWgwVmZNa1JNTkRrWjUzb0g3SkgtbGdhTmc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Sara Hoffman",
        "comment": "I used this app for the entire first year of my son's life and loved it. I set up an account for my second before she was even born.   I did run into one problem though. I only really use two widgets and one of them, last feed ago (for breastfeeding), is not available anymore when I installed the app on my new phone. All of the other records have the last feed ago option.  VERY disappointing to have to open the app to see the information I need when I've used a widget for two years. PLEASE fix this!",
        "date": "April 8, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSFFKemZXVHZlT0tKVTFWSWdEZUd1c2Q2VmFLeDdNOXo2ZUVZVldsVW5xZ2tjeFdJZ0lMYnNJU2ltT1FTRU53YzJ1R01PdmkxZUJ6a21CdkE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "No other app compares to this one. It is well worth the money. The widgets are the absolute best feature. So easy to use in the middle of the night when you're groggy but need to keep track of a newborn's feedings, diaper changes, etc. I bought it when my first child was born and have continued to use it for all of my children.... We are now on baby number 3. We bought it on both my phone and my husband's so that we can collectively keep track of the kids. I do wish there was a way to add a third child, I haven't figured that part out yet, so my oldest isn't on my account anymore.",
        "date": "April 29, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=bGc6QU9xcFRPRk4taFNERERPYXJOSWJOdnJfeUtRSE90aXRBbTM2TlZtcGhUTVZmOE1rVndJUUZHWjI3dDc2V3ZnY1VpTUxQbXhIcjVZS09vOGNsMzV5elE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kelly Paul",
        "comment": "I like the app overall. Its always bugged me that when you start a feed it opens the timer screen. I also am not a huge fan of the sleep \"heat map\". I would rather see an actual start & end time plotted, rather than how many mins of the hour they slept. Not helpful at all! Otherwise I'd used this app to track for 2 babies now & it's been overall useful.",
        "date": "July 9, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSDZqU0J3VEJZWTRybTlUYmZRODFMZE8xM3o4U3VGYTBvRUdMNnZkQW9ESXpMZXNlamxSZ3FiVEtnbEE1STBNOTQzcU8wZHpTa2JCeEFIOWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Michelle Tafreshi",
        "comment": "DO NOT BUY THIS APP. IT HAS BUGS AND IS NO LONGER SUPPORTED. The app is actually really good but all the data that I'd been collecting randomly deleted itself. Like other reviewers, I never got a response despite multiple emails to the developer. I would advise people to choose a different app to avoid disappointment.",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPR3J5dmhROGpIamx3YWE1OHpSRUtabFE5bkhHMXlEQ3RtYzdYVmFHVkR3N1NjYzJ2S3FieU1BMzBlX0pZNmJtZWdOeGptN3N6UFlMb194b1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Martie Pastor Donnelly",
        "comment": "Great timer for breastfeeding moms, I like the sync feature since husband can add in dirty diapers and pumped milk. Doctors always ask how much baby eats and how often baby has bowel movements, this is a nice way to keep track.",
        "date": "March 21, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRWFOeGRLQVJ0eVVzemthbWdXU2dpOHl3X3NqT00waDd3SnV5YzZyVEZhbVpqS205YVcxWUFCMlQ2b0NGNHE2NEVDQ2xKSFNHc0NpS0dQU0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Amanda Mangas",
        "comment": "I have used this app for 3 of my babies, including one with serious medical needs. With the convenience of reminders (and tracking) for feedings, diapers, meds (with dosage amounts), growth, sleep, and EVERYTHING a baby needs....this app has kept me sane!",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPR2FSTUpBbUlQUmRmTV94Sl90V2FfdzcyeDNMazhqQnd3Z3UwbG5lMjR2RWJxczN3RzFLMkpDS2xUaG9HRjhhQWE1MkhETzVkNGpYdzZkWUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Christina Brooks",
        "comment": "Used this app for two babies, now, 4 & 2.  I still use it for growth charting. Also, if they are running a fever I still use this app to track fever temp and time, as well as any meds I may give them. It's a really nice feature!",
        "date": "December 27, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRVpVc0FNWXBvU2tQZ1Y3UFpQaWxNZnNXRS1SN1VCcUpiZ0V5RWlGcVBnNjF4ZzR0SGVGdEFvZ0lQQ1hseE4tR3NDNExlSEhzcnZMSEZBM3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Allison Collins",
        "comment": "The app is really helpful and easy to use BUT why the pop up when I open the app- at the moment my infant is crying and I'm scrambling to latch her? UGH! I came to rate because the timing is infuriating, and I want to stop seeing the stupid request blocking my timer when I can least stand it!",
        "date": "June 12, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRnRTZklMcmxYb25mRUhlNjFFa3pZak9BMHFOTEV0VkpHVlZzdTJabGpCbTM1aVBjcmpBTXF6Q3I1OFRPZjZkdFR5X2VhSFFIY3RmMUIyZXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Andrew Haynes",
        "comment": "The only negitive is the app is a little pushy for asking for reviews. That's it's. Everything else is fantastic and the ability ot export the data is a great plus and the main reason we chose feedbaby.",
        "date": "September 4, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPR3VwbGkxdy1YSmhuYWVyNnlhakxKOEtMbWIyaG9UX2lRSmFoWnNJRWlua3BkbWFIdXhPS25YbTNlLWZCT0UtZ2lvam9jdG40WWxROWpRVVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Samantha S",
        "comment": "Super Helpful! This app has been a lifesaver as I can't always remember where I left off or how many diapers we've gone through! Very easy to use 😊",
        "date": "August 27, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRUl0XzJQN1NkSUpBOGlVVmhVTW1FLUdvWjlablZJdWNWdWZQRnJLM0FSVzhiQTZNX2hTemVraUViQVMwM1hLZ1NGdGhLNzQ1NG0zYWVIZWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "April Warren",
        "comment": "Fast and easy to use. I like the night-friendly screen. 4 stars because it is not intuitive to enter growth info, and because there is no option to enter head circumference in centimeters.",
        "date": "December 4, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSEN3YllmZVV4N1dnaE5vTGZFQ1JqNzg4X3FPYWJKNVoyX0c2WXBEREJPRWRVZnBfYjdJZ3c5S002Z190TEVleW8wSmxvcU1VT3pUSW1fS1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Selena Valverde",
        "comment": "This app is great for new parents! I love that you can chart just about everything, and for what you can't you can use the journal part. I love the alerts too, with a new baby its hard to remember everything. I had it on Samsung galaxy s3 and now on Galaxy s5 and have had no problems. Get the trial and I know you will buy the pro version.",
        "date": "July 19, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRUc5X1ltUHhwT3pzSVZSbVdhNVhLbU5fR1JHa28ySllhUHRuRmRWdnhMX0xWSkgxWmNDc3U4TnVtb1p5NTdNODE5ZEtyS0dEN2lFODFlSGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tim Kelley",
        "comment": "It is maddening to try to feed a newborn and constantly be asked to leave a rating. I would have left one when I've had a few hours of continuous sleep. And it would have been a lot better than one star. But one star is what I'm giving.",
        "date": "March 24, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSFF5eGxJT29NMHJ3VkNwRWgwYk0yOHVfbDBpVUNXS2l2Q2U0SUpNOVVYMmlyc2R0Z3lWZXBpWm1GZUZfbGJGdktsWmphbE5LNXQ3ekFHSVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Viviana Rueda",
        "comment": "1 Star due to zero response from customer support. I upgraded this App. Used it for just over a year. I got a new phone and followed instructions to synch devices. Not only did it not synch but my dasra is all gone. Fun times. I had planned to use that data for a cute timeline for the baby. Two messages into customer support and total silence. Use with care if you want actually keep the data...ugh!!! So frustrating.",
        "date": "November 22, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRURXUjZ4Vm12R05ySjZMZi12ampRcC1SQ3FNYjJJMTBIT2FXR3l6bC1iM1JnN2V6eldPTzYxUzZSWVh2eUw0NngxdU1WcUo5UlFUUnk5MWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Johnny Shu",
        "comment": "Great app, would be great to incorporate ok google or Siri support. Nothing worse than starting a feed to soothe a crying bubba and the phone is out of reach, then you have to guess the durations",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRXRvVXNWaFRkZzRPb0xQc1BFZnQwS3dpb0ZaV0stNE5sdlVJM2ROYzNPeWZvc1YyaXhYRDlKdlJHMG9FUUpjdEZaandnNl9PUHE0OXlSM1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Alejandro González Camarena",
        "comment": "I really want to give it 5 stars as it is really helpful and helps us keep track of our baby's eating habits and how many diapers we changed on a given day, but most of the time the alarms won't trigger, making that feature very unreliable. We still use the medicine log to keep track of when we give it to our baby, but the alarms just not work and may makes us miss a dosis.  It also misses on traduction to other languages (mainly Spanish), but it is very visual and my wife who doesn't speak English can use it without issues.",
        "date": "July 30, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRkJ2VWZnLS1jNEZfYkJla1NqNnp6Z0FadzlqeVNIbXZUZWRFeEpPNFhvU19hZmRzc2Q5S20wMHhxaEtodHBtNWVlR0o5UzJfbTNRY2huUUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Carvis Hidalgo",
        "comment": "I like to track things because my memory isn't all that great.  This app tracks so much and the reports are nice too. I found it was very easy to use.",
        "date": "June 27, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPR05iVl93U1pTUjFJR3V3TTU1R1Vka1FGX0NEbHEwN0Q4Q0JxQXEyWXg1dGttWExaQjhUbmtNODBhbUdEaHJiZ0xySHVTVWNIODFGd0VOYlE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "This is the only Android app I've spent money on, and it was an amazing choice.  Those first couple months when sleep was tight and tempers shorter, this not only helped us remember what we had already done, it helped us communicate with each other.  9 months in we aren't tracking quite as many things as we used to, but we still each open this app 20 times a day.",
        "date": "May 28, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPRXo1T0E0YWI0NkVPelh3bEQtZVg2aTFrOFloZFhlamtKQjZiaFA5V190Mk1hNjZ3WFFORWlXa284VXNsQ1VBVFdBTGwxZlFUOWYwZTFYNWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Arwen Ogilvy",
        "comment": "I have been using this app since my son was about 2 months old, it would have been brilliant in the first few weeks as we had a strict feeding and pumping schedule.   *EDIT* I love the new clock to enter the time, so much easier to use!  Edit: I now have another baby and using it to keep track of strict feeding schedules, wet and dirty nappies. It's just so much easier this time around!",
        "date": "May 18, 2017",
        "permlink": "/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android.pro&reviewId=Z3A6QU9xcFRPSHdZU1JVOW5Vak12Y3FhNmNORGQzUXhNenJweUVPRWw0WmhEWXZGZmJHTjNvdXdac29wQXVmdDFDRjNycHhycktyU1ZpakV3SnVYR1p2cHc",
        "reply": null,
        "star": 5,
        "title": null
    }
]