[
    {
        "author": "Raviraj Khare",
        "comment": "Great news app if you just want to read text news. Any videos that feature in the app never ever play successfully. But the ads that play before the video play perfectly fine. I try to play the video 2-3 times and only the ad plays, but never the content video. Sometimes just the audio plays and no video. I guess they are just interested in the ad revenue. I love BBCs unbiased and quality reporting, but the app needs serious troubleshooting. And yes, you also receive random \"content  does not appear to be working\" messages.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSHZxQ0pWLXotYWp0UE1lWVlTVU80eVZLSERULWVOdDNseHR5cUJtR21CLXBYbmFfOVJUY09UYmhWU3hRblFSU0Z5TTF3aWVnMWVNMVk4a1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Leonid Morozov",
        "comment": "It's good if want to read the news, works well. When it comes to any video content on the app it simply doesn't work most of the time. I can get and ad playing at the beginning of the video, but the video itself can't be displayed. Sometimes it requires to open another bbc media player and even after i install it, it won't open majority of the videos, just displaying the error.",
        "date": "December 18, 2017",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRjZ0c1JManVwam5IQzRDVHRUQTI2Y2NvTi1IRmFMcl9jT3BOQWhDZTZ3VGZKRzhQc29NRDFnenYzZFpMMlR3aGN5aVN0b2NqMGRYZFRxVWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Nick Marcheschi",
        "comment": "News stories are generally impartial and informative but many fluff pieces have come up, and we never seem to be able to escape new stories about the royalty.  Mostly just mad the videos rarely work and the companion BBC media app works maybe one in 20 times. Get a decent I.T. division geez.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSFNJYnJseVcwYVlSdnFraUItcmgtR3Rkc1lSMGlZS253MWhoQnB5RWZSS0NzSWZOTGQ4UHduOEpHekhjT0lQb1g5M1F2cHRjVWtCZGw2M0E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Chelsea F",
        "comment": "Keeps freezing and crashing. Can't scroll down or read a single article. Its totally unusable. Tried uninstalling and reinstalling.  Requested developer support and got no reply after 5 days.  I used to like it to get a little bit of global news but now it's just a waste of storage.  Uninstalling. Will consider changing my review if I hear back and get a fix.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSGtYSll2eWJ2UWlWWWd3TS1jYzZkOVRuV25qYUNxVkxPSWxfNUx6OWlUU1ZKZlc5Zy14alM0TVlMVmszUDZvQ2ZQX0Q2WVpRNEVOVm1RdFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Rick Clayton",
        "comment": "Great articles, widget stops getting data and media player often does not work. And you have to watch 30 second ads in full only to find out that your video won't play. This app has some serious, longstanding problems they apparently can't or don't want to fix.",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSE1PM0xWVTZlTFRuczFKa05ZemtJUTA0QjZBX3JIaHFqSi1aTjNNSk04d25DVTIxdG9Sek1ZckV6aWZLZWNmdDhvM3h6ZHZfTXZxWmMybHc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Peter Sorrentino",
        "comment": "I love the BBC app which I downloaded from Google Play for free. I have been using this app for years now and it catches me up on the biggest stories in a short time. As a US resident it gives me a taste of the largest international stories which I really appreciate. I also like the video highlight clips which are usually interesting and iften quirky but always pertinent.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSGU5clloMktTT0JCemYyeDZObTFJeGNXb0hoTEpibkFfUVR0dGJ0NVdXN3FwUjJqSGsyXzJwZDlURElPZUhOUGFWSjFKU2VCOXlTQVhwcVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Petra Neveceralova",
        "comment": "The app has nice design, but lately I have been struggling with the videos. There are many long annoying adds and then only blank screen with sound, no video. And please make it possible to move the app to the SD card, it's quite big...",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPR2tyX2xUVXBmM1dHQ3RJb2hJWGJiX0I1TWhaRTJjX2lQNm5BcWxwRVRFQXQ3R25aemJoMUxzOC0ybU14RVc4Sktwa0E1TldmMmw0RU1SNkE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Namcheja Maghembe",
        "comment": "Good: The app work well use it nearly everyday. I especially like the feature and analysis section.  Bad: The videos do not work. Wait they will work to play the adverts but the news segment you want watch will not play well only the sound plays. It is the most annoying thing about the app and what made me give it 3 stars.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRUZJZUlObGVYa1B0ZUphbHVFQzZFbDRhR0FrR29weGloWExIZm5yd2ppSGFSTU1wR2xtaWJPVnZrQzFHOHBUT2ZjVk9Za3lYX2pWbDU4bFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "RedElectric3",
        "comment": "Works well for stories,  sometimes for no reason it will try and make you download another app just to view video-lame. Update-I downloaded the video app, and now none of the videos I click will play.  The ad before the clip will play,  but once it switches over to play the actual video--blank screen. Time to reprogram the app I'm wondering.",
        "date": "December 13, 2017",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRjhXQU16R2RkeTFBWXU0RVFTTHBCNlBYU2pRWUh6QnlZal8xUDNRb29TdmN0bUZQM1ZTRlJIeDZvT3k2V3NJVXZubW1aWXExTnpxbGdZN3c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Steve Youles",
        "comment": "Revising my glowing review of the old app (5 stars) down to a scathing 1 star for the new version.. BE WARNED DO NOT UPDATE! a few minor graphical tweaks are no compensation for the BBC injecting bloody advertising!!! Of all the things I thought the BBC stood for this is the final straw... c'mon BBC youre better than this.. your the ones who set standards not follow them! Update 11 jan 2018. Not only are adverts more prevalent.. they work and then the actual article i want to watch doest. So i get the ads not the desired content. This app just continues to side into the mire. Pull your finger out and get it fixed",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRXpNWFNtNEdEVU9GZmI1a0h0NjFHd2tfTy1HRG9BT0Q5V0szRGVqTWtrLW5LcUpiT0EtbTVrcEM0b0ZNbXhlbUxqQmYycnlVa29NQkxST1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "David Sabbagh",
        "comment": "I think that BBC is one of the best news organizations out there. BBC strikes a good balance between reporting facts while also giving unbiased analysis and information.  The app is well organized, I like the ability to follow certain topics but still get information from other topics in top news. I like the breaking news alerts, and in fact when compared to other news apps I use like Reuters and CBS, BBC is often the first I receive an alert from.   I have one suggestion for how the app might improve. And that is the ability to organize search results by date of publication. Currently they are organized supposedly by relevance although it often seems arbitrary. There's no way to sort results. But I don't think articles from 2010 shouldn't be further up the list than an article on the topic published yesterday.",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPR0ttMGpMQzNGU2VNQmJKWEpndWpJeEt5Ym1PV0ZOTWtTSWNFTnNUZm96ZWhXbDlhVmhvUlRwLUhQMGlfSnI3cWdmMUxiT1lZdFpfdFhFUUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lorna Perry",
        "comment": "I really hate all the advertising increased time to wait for video now .14 seconds is way too much. Sometimes cannot be bothered .understand it funds the company but really....  Good articles as ever and reporting although it's biased as are most news channels im afraid . I really like the human interest articles. Still a favourite of course .. works fine on my phone .",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRTl4RVk5eXpOTGpGSUpaaUZFQTJyQU4yc0RtVl8yTnpDbmJHX0R1NF9fb3BIcGhLcm9KX09XYlZCWGNmeW1HaW5HNEVLOGdNdjBZajllZkE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ona Mazie",
        "comment": "I love how BBC news asks questions and sends links throughout its news feed to either answer questions or provide support for their work.  Being an American and having conflicting information I use it as a beacon of light.  I am  grateful for the writers and I hope they will continue to report in away that provides freedom to all and not to some.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSDJYUVN1RENTVGpFYnFDS01SeE5RdjZGUmxoM1pBbFNUY0xhdHN2bkVQa0R0RG9oUUY4RUdVVXppSlhzX1pYRmxBcllpLVFVWVd4UGk3MEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Leila Zai",
        "comment": "As administrations change here in the U.S., I trust overseas news sources more and corporately-controlled domestic organs less. 'The Guardian' and BBC broadcast news give me a broader picture of global events than most American journalistic enterprises. For that I am grateful.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRzNFdDJGU3FxYTVrYnBSenRZQ18xTi1JTC1mcjlPdVRsWkROYUVHb25PRnVBdUFvdGFGRXFvYllYS1ZLU2lLV3NGUHJYUThlck5menRUb1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "David Barratt",
        "comment": "I used to love this app.... it would download articles so I could read offline. Now the news format has been dumbed down and now includes lots of short and uninformative videos. The BBC has made a huge mistake in the format that news is presented within this updated app.",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRnhoei1Db1lWRFhkX1FLVldkVUZNWXkwMENMWXZzMXFlSjlDaHJkS0FleEtRcGVkNU1iZFlNQ25UeF8tdE1ZOE1aOS0wcW9YdXVZQ1FvbHc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kate McHardy",
        "comment": "This app has been great for me! I've tried other news sources, but I haven't been able to find one that's as easy to access and that is actually world news. This app offers a good variety of news on their main page and I can easily search for articles related to specific content. The videos in the articles only work sometimes and have long and repetitive ads, so I've mostly given up on them, but the videos in the main page typically work. The other thing that annoys me is the the US and Canada are grouped together in one category and I either can't find Canadian news or it simply rarely exists. As an international news source, however, it does it's job well. All of the main functions work well and the news is informative.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRXlvTWZhaEd3Y2xkNzBIOTNwZnItS3BEamZpZmZxOUpYQmlCaGZ0cVFCVlJCX3hNb3ktMUVsRi1pV2dta2t2cWZsNnZUaWY5X00xa21vWkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Prodipto Chatterjee",
        "comment": "I am not sure what has happened to this app for some days now as it won't load any of the pages. I tried the usual uninstall - reinstall process a number of times to no avail.  However, the app works when I am on a LTE network or high-speed WiFi connection. Really frustrated.",
        "date": "December 15, 2017",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRV9QMzYybkRCd2I0b3lYOGVQckRSR0laU3NYbDIyaEl5aHJWZE1aRjZELXRselg0S2tRdHlvRFFnTGh6N2hCSmdEV21NUkg1Y2JvSTRsUEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Adam Burnett",
        "comment": "The app is good. Breaking New alerts however have gotten stupid. They used to be rare and related to notable as it's happening news. Now they range from things such as sports victories to long form  articles about not current events. I shall be switching them of for the foreseeable future",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRmtFLTBqQUsxNFFnSGgyVTcxeWlrdHhQR1QtZTlRYm9YaVZMcU1WdlFpalJZdkRnV2hrSTZUVm5pVzhYYWp3MHZvZ25kNWVOZzRaNy0wbHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Elijah TC",
        "comment": "BBC has become more and more liberal, stupid, pro- Islam, more philosophically inclined. Sky news is more intelligently produced programmes. I am persuaded that the BBC requires a new conclave of leaders who are less bias, partial and philosophical. Britain is plummeting into an abyss and BBC is contributing to its declension.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRUhvandaMFk4Y2UzazBfeVdoV1M3Vm5hUXUyakJZaC1scGdHT3plZHptR29OalJPdVp0a0dsZFJUMEdRU3BsT0hsR29LT0RJZVRER2Rub0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Isaac Marsland",
        "comment": "News is ok. The negative review is for video. U have to download a seperate app and even then the 30 seconds of ads play fine but the video doesnt. You reload it and you have to watch another 30 seconds of ads which work fine... then the video doesnt work again. Its like they do it on purpose to make more money for ads. SHITE",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSHZGOFZvYXZieGdOLVpoTE1rWE84Q1VLMG9jZjBweUtyMmZTTlhESy1BRUx2Y2IxeDJXNUpvT0F1enh1YXZxdkNfaHpiVGp1U01pbnJRQUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Meredith Anderson",
        "comment": "I think this is a very good app. It's easy to use and you can personalize the \"my news\" section of it. The only thing is that frequently  there  are stories that will not load, and if they do not load the first time, they never will.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSF9lVWZZdDlzeVlPOFhQNXhOYlBKempyM0FwRzFDYV81OU9Zc3N5MWRSMUFHRXdSZW51R1psZFVlYV9YaEpiZFBVZF9vb3pQVGM1OFV5Z0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Robert Lord",
        "comment": "App is great, but ties up the processor & rapidly drains the battery after being closed, because it refuses to exit. Must be manually force-stopped to exit. Please fix this for 5 stars. Love the BBC. Top-quality news, and relatively impartial; none of the sickening partisan-politics that plagues the current major American news sources.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRTZDYy14Z2tGVjViZlRPN2NvcXZCa2FITDh0bi1NZ09SaVZnWGVpNzlOOS1hOTZIbG1UdUI2QkFFb3l2NWVydDhIUXRSVERtb09pc1RxTWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Rowan Blaze",
        "comment": "It would be nice if the videos actually played. No problem seeing the commercials but then the actual video i want to see is just a black screen. This issue has been consistent for the past few years on different Android devices.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRVRDbDFnOTZqU2NRTlRXVXZIZVRkX3k2M1R5ZktQMS1ES2tvbGpGMFJVQU9za0YzRmU4UURYTzFZQ0VNM1VfR01IOXFhV2pZRy00RlFEWWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Dakota Smolders",
        "comment": "Dropping from 5 to 3 stars. Great for reading, but videos almost never work. Ads play fine before the video but once the actual content starts I only ever hear audio accompanied by a black screen. Strange how the ads work but your own content is wonky. Once this is fixed will definitely be bumping it back up to 5 stars.",
        "date": "January 16, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRnM0d0dmX0p2aG5ub2g2MFdJLTEtbGxNSm4wMi1NdnktamJ0MkpwN0Q1cUx3bmtIWWtPMmRlQ0xDemVyYndaODAwcmdBeHhDSDdERWNCNUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "jason lickfield",
        "comment": "I like getting content from BBC, but no other news app I've used has more videos that don't play or have bad links, but the ads always work. Nothing is more irritating then watching a full length advertisement then having the video not play.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRms3X1hwd1RsSkNsTkFUTU9FeXNhY3NGcDZoWG0xcW1xbG16eUc3aUMyZDliQVhkdjg2dDJiTWszcDM5ZTI5YWtYSG50QVNRM3hCTExfTkE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "C Eastwood",
        "comment": "This has been my go to app since I owned my first smart phone nearly 10 years ago. However it's barely changed and they still are unable to get videos working on it. With all of their might the BBC are really dropping the ball in the most important area of their business. Time to find a new app.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSEdUUWdMa242Y2pwUmd1QkJQVTNQbm9kVVVGNzRqc2tkS253Zms5U2NtN3RleVJCV2VteEZwTlIyWm9QZzc1eFBaZnlTQmFyZUZoOWxoWlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Michael Peters",
        "comment": "I like everything about this app and the BBC as a reliable news source. However I find the video frustrating. In fact, it sucks. The app that the BBC want you to download is worse than awful. This needs to improve considerably to be average.",
        "date": "January 12, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSEFRYV9BRHkxUmlBaVREc09xRkliRE9xWnNVdGxncE9SZlJpdjlnTTZfRWNGb2NBRHo3Q05DRXI2LXdkcDNlaFpxaC1Kbms1aXpBQlB0blE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "brendan DOHERTY",
        "comment": "Videos no longer work. Ads do but once hte actual video starts, its just a blackscreen. That is if it doesnt ask you to download their video player which also does not work. Use to be a great app, no its only good for reading articles",
        "date": "December 23, 2017",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSDkwU25hSEFKelZNMUx6ajJrdnk3bXhfRFExdWhGRFRHeDVseHlvRURBNUUxYkpuTC0teHp6b3NDWERUS2xnUGk2dm1WZ2lzS0RJSFROLVE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Alec Zuber",
        "comment": "For some reason, whenever I try to click on the most interesting travel articles like, \"4,000 Year Old Yogurt,\" and, \"Ancient Iranian Village of Little People,\" there is always a loading error, always. Inevitably, aside from the occasional piece about my psychotic president (I'm an American), these are the only articles I want to read. I love the BBC. Why wont the travel articles let me read them. WHY!?!??!?",
        "date": "January 12, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRU5EclVyeEFlUTNMeEV2UHF3dDdOTTJXQVplS05QRnRkR1VOVUxTOEFzWHlkQmltaVlnaGNrNFAyUW94dHdKV09iSWtBaFBTVFlnN3NxcUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Many news items, especially towards the bottom of the page, lead to an error message, \"There was a problem loading this content. Please try again later.\" I've reinstalled, cleared cache and data, tried WiFi and Mobile connections. What else shall I try? Sacrifice a goat? It is reliably an occasional error. My two email reports ignored so far.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSGZaQ2J2aGwzN2tWN0YwWVFzRE9nLXJnY01BRy1uV25iWEZRSlJxMWhpaTlWcFBhWDJKbXBlNWs0aHVkX1FXcElVYXEzVmNkdU1OM1VLd3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Eric Bowman",
        "comment": "I like the app for the same reason I like BBC - they both give me a world view at a glance. If I just have a minute, I can scroll through and get an idea of what is going on, but if I have more time, I can click on something and get a fuller story.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRWFwbzRjWVd2WGU2cU91bktNUU9ULTgwTlVXM3lEWWdJN0FtcUFRMXhlOGFoSnZzYTBRMmoyVWhhdGxMSU9RWHZkWHBVVkdJQ3lhQ1R3cmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Alex Hitzemann",
        "comment": "The BBC used to be a fairly unbiased source for international news. But lately I hate opening it...  the top stories are always about Trump and US. Know your market. I come to BBC to get away from all the American political stuff.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSHR5Z0pxbDVHV1kwSFFvNW16Z1hvM1lFQ2NwYm5MbkxVN3BCdXJpd0hyRDRYV0hSMEtDX09uQ2NPelBTWDBMX2tILWNzRk0xZjZBcHhxTlE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Nathan Buck",
        "comment": "The video content doesn't load. It's infuriating that the ads play just fine and you waste 15-30 seconds of your life sitting through it, only for the content not to load. The pop up ads are also irritating as hell. Integrated into content is fine.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPR0VaQ21nUVB1M2FUVkZrT0pQc1JaTXpOZW5VekhqTDFOOUxfQnRPT1hTT2N1QUZQUTk3X2VWenAtWjhSeENKOEt1NGRPWlAtbVQ1UGdsakE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Chris Bonkers",
        "comment": "Having problems with the app. For some reason it won't update, so I'm forced to reinstall the app only for it to happen again a week later. Please fix!! I need my BBC news back!!",
        "date": "January 15, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPR1M0YkV0Q3NTUTF1LW54eWlKQ2tPa1EzU0FzbnFIc3FrWkpHeXZCT3FoN3owalh5eVl6djdpcDhJRGZDVm1wVzN5N01oRWIyazAtTm0xdVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "James Steinmeyer",
        "comment": "For reading it's fine, but if you ever want to watch a video they posted good luck. Videos fail to play 80% of the time (yet somehow the ads play fine. ) and randomly it'll ask you to download a media player to watch the video, which has terrible reviews.  This problem has existed for years, why haven't they address it? I'd expect more from BBC.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRTd3aEptX2hiZi13WFRuN2x1cllUZmxCV0l6V1dnNUh1eHp1Y0NmOWJ6bjVJNVlWZXE2M2dQVmYzZGxETTFJMjcybnhBZTZxdVpxT1VoSXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Aahmed Arif",
        "comment": "i think that the most reliable news channel in the world is BBC. i like it from my childhood. But there is a problem for some days. when i try to play BBC Live option it say \"sorry this content dosen't seem to be working. please try again later.\"  why i am facing this problem??? please solve it quickly.",
        "date": "December 15, 2017",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSHNiQVI2OXJISXptcV81Tl9XdjBXT01ZeUNKZUgwaWltRWxTUFZKSkJrdGpCZTAzQldBVmVVei04eVVNNGF6eFNqbFZhd1BSTEc4Sk85WFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "The RizDogg",
        "comment": "Its funny how when trying to watch a video the ads work perfectly but the content that you want to watch just doesn't work. Audio plays with no video. I'm sure if it was the ads that were faulty it would be fixed instantly. This has been a problem over several devices from my Galaxy S3 S4 S5 and S7 and also my Galaxy Tab S3.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRm84S3FkVkFzWTBxU0RkaFBOcXVMRW1pa0tFci1vNmtxQjZGVHh3d0FESFd0UTBCSnFBaDJNMVdrRTNhaVB1SExEZktGdktya0tzTjd4MVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Francesco Peruzzi",
        "comment": "One-minute world news video is handy and informative, good way to sort news by topic of interest & geographical area. Nice in-depth analysis is provided when one wants to go beyond the surface. Generally impartial when it comes to non-UK politics, though the bias is really small even for British domestic issues... difficult to find a better one nowadays",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRTVTeDZtTU1CVDZ0cHN5SG1VSnhLWF9UMHdtMklRRHVaX1RldjF5T1BRTE45Z3dlTmJMb0dZZng3c2VVZUJmOGtjVXdSLTJEN2dBd0FySHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Feenixe",
        "comment": "Five stars because of the offline mode!! BBC is by far my favorite news app. Finally I can read articles in the underground metro! I never watch videos though, too much ads and bugs... Too much of a pain. It's not worth it.",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPRVRLZkRmR294QUVlX2lxTGhEYlYxVjZNYWFvbHI1QVdVWHh0S3p4U3FqZ1NOb0F2TjVIaVd5ZzV1S19kVXdTNzlLSHhrZnkwWHBlay1kY0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Great news articles and easy layout to read through. BUT after patiently watching through the repetitive and at times annoying ads, the videos just refuse to load. Frustrating. Used to be ok several months back though.",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.ww&reviewId=Z3A6QU9xcFRPSHFUU0RTWUJmYTdQaUplSnBWYTJoN2JxQkV5REt2dlBYbTRTVlVOM2swYmRBaGRLWE9Ec2dOSzBaMGRsTkNKci1zdFZhMXZkN2YzQWJ6OFE",
        "reply": null,
        "star": 2,
        "title": null
    }
]