[
    {
        "author": "Matt Mitch",
        "comment": "Used to have all my favourite topics easily on the top sliding bar. Now all missing. E.g.. football, formula 1, sport, now all missing. Tried to add them back once again. But says I've still got them all added to topics.  No I'm not searching for my topics  when a perfectly good app was working great before update. Please get it sorted. Always use this app, such a shame it's ruined in the update..  :0/",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPR3U0RXJzUFB5X0U2RmhFSnlNYWlObmRQM19seTc0S1pvNGliY3JWNWJoT1o2bEFzckpkbU4yNjJOZzQxLTk2bWpER1plVE9JcnhzLTJIZUcw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Alexander",
        "comment": "Over the past few years, it has been made increasingly difficult to navigate through different news topics. It started years ago when users were forced to place topics into \"my news\" just to be able to see them on the nav bar, and now users can't even see them at all without clicking \"my news\", an additional hurdle. Poor UX design, thought better of the BBC - meant to be a professional service.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRjc4ZEh5MmZsSjNIMDByUEJLOWl1WWJ0Yl9JTGRuY1RfWkQ1ZU43aG5jT013T1dNS2NMcGNDb1d4VFI4TnhvaFNWNUVYbUtrbWtEVXRfeVpr",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Robert Radcliffe",
        "comment": "Looking at other reviews, this isn't a new opinion. The changes to layout putting My News into one tab have significantly reduced the apps ease of use. There should at least be an option to display it the other way.  The result of the change is that I now find it harder to get to the news I want to read about. I am unlikely to continue using this version of the app.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRmxheVJGSGc1aHd5emxhMVlxUzNmeTZCSV92TG96bDRhMFpycEhTYk1zd284RTViTmJkRE96RGZ0TVVNLU5QOFlncExHUDBPeks3QWlvWlR3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "In the last update I've had to go from a five star rating to one star. The reason is that where all my favourite topics used to be listed on the top navigation bar, I now have to drill down a few levels in order to find them, and even then it is a case of scrolling through a load of pages rather than being able to go straight where I want. As a result I've largely stopped using the BBC news app.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=bGc6QU9xcFRPRlZfWUc0bzVFVzdnRzhQWXJqem9zWGtvSG5McDd5YmhNX2ZmcDhTVUItZDBJcXRmeG9ucHlIVFh2emh0LVBvNHlZU2JrUlZOSmZLc2xxemt3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Somebody deleted my comment presumably because they did not like what I said. The new menu structure is rubbish! It is a massive backwards step. It would be much better to have the old menu system. It would also be better if they concentrated on having a login system using the licence number and postcode. That way we licence payers can see all the content when abroad instead of having huge chunks missing. I pay the licence fee and expect to be able to see what I pay for.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPR3JGRFJvQ2Y1Y1pic1dKeml6U3ZXdjA4bldUeWhubzc5cURVb3ZJQktZQ1M4bjlRZDRWSXNIWGRvR1NRTHV4Nmpaa254cHRGa3JicFFRSl9N",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Steve Kerle",
        "comment": "Recent updates have ruined the formatting of articles on a tablet device to the point where the app is unpleasant to use, all images are full screen and it is just one long linear mess if full screen image then text then another full screen image then more text. Previously the images were a reasonable size and the text would flow around the image, much more present to read and use. Please revert to previous format !",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRUxOb0VQZlZvV2lrR0hjSF9qYjhEekhxaWdUY19ZdU5nNlkxVHdsUTBmZXk1TDdMMXlFejNXNlNzaHBVWjlrWVk0S1lyeTJTTTQ4N0JxMXlF",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Barry Rowlingson",
        "comment": "And its even worse with the latest update. Here's an idea. Simplify. Scroll left for the categories, scroll up down for stories within categories. Keep images to a minimum so I can see at least 7 things on a list. I only stick with BBC News because I trust the content and I already pay via the TV license. Maybe I'll get a Guardian News subscription?",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRWV4QTVBYUdKS1NTUDdBdDljdU9lQjYtQ210amFVc0VEWVNodi0tUk9zUkNsLS1fYTU5ckV5RmdteHI5SmRad1V4YkhvZzJsODV2MGtQNWlR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Alan Runcie",
        "comment": "Terrible. The new interface is just awful and does not improve accessibility or ease of use - it's the exact opposite. Accessing  'My News' has now become unintuitive and downright fiddly to enter into to before you can navigate. Get the 'My News' section back on the top level with the news I decide I want to read.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRWRTZDJoZ2lrdkFQUTJtQnphR3ZyZEhuLTVrdHNxbG11YldJeTdqbXZmRUFiTjFNYWtkcDl2dFFQSGNhV2xmR1AzRENxbGx4SEMzZnVpNnBV",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Scott Gavin-Mills",
        "comment": "Much like all the other recent reviews say - the new changes are inconvinient and make the app difficult to use, hiding the things you want to see. If you don't already use this then dont bother downloading, it's really unprofessional every update makes it more difficult to use and there are no obvious benefits or communication about it. Much better news app to use, have a look. Poor from the BBC.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRmw0cTVMRHFuZDUtMmtkN3BBVGxBeFNIRFJjV25EQW1EOWg5RWZwbHdxQWhOM3VKcTh1Q2JPRS1qaEdGdVBHWFlWWE5SNU1UR2k1TjJGSWFF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Mark Paruit",
        "comment": "Used to really enjoy using this simple app to have a quick glance now and then at the news. The most recent update has over complicated that and I just can't be bothered to use it anymore. Obviously the BBC have tasked the new boy in the office with 'refreshing' the mobile app. If it's not broken, don't fix it.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPSGxKTGFTZHdXcHRLVk1ocXFHTmpfSGRCcmdIMktockxTVmxzQ01pLU9Yb3FrdG1yaU5KWWpQdVpaMUQzM3NjVTRmbjBnMy1FMUJuajI4SnNJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "thewhofan",
        "comment": "The new so called improved layout is trash. Having to go into another section to view 'my news' is less intuitive. Before I could just open the app and scroll through all sections on one level with ease. Hopefully the high number of complaints will get them to see sense and change it back or give us the option to choose the layout.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPSDd6UWRwRWJIR1FHYVFNa1o2Q3JXVU54VGJwMVpIdUZjQTJSQ1BEdUR6S3k4WTNHalV4TU8tQVlZZTJyVlZhX3d2ZzV3bGZkTmNtclAwdDdR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Adam Carless",
        "comment": "Feb 2018 update, well seems they've managed to make it even worse. Ffs bbc, put the mouse down and step away from the keyboard, you're making life worse!  Sigh, looks like they made yet another rubbish update. Looks like they don't use their own app any more. Sad that they've decided to go this route. Here's hoping they decide to maintain one of the older versions in a sane way.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRU1VZTBhMlJkZmpsYUVySWgzZS1reW40THFXMld2MENPdE5YeXFPSlJVWWluWDNleVFjVFhhcm5SY0NncmZiVjROaFN0cTRWSmhiRGRtTzhN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "So many comments saying how bad the new update is and I agree. Just give us back the previous version UI. No doubt the makers of this app will ignore everyone and think we'll just get on with it. Well I ask the makers of this app to comment on my post and ask why they are ignoring the majority.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRnVfNkJ2U0xkYk1fc2hyM0xjT1FUaDhiQmI5YjBtWGx1Z3Y5a0hsTE1WNC1DazRqV0h6N3FoUy00Zkx5dFI4QzRBQlJ0QlljeElVLXlkd3JB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Claire Johnson",
        "comment": "New update to make things simpler? Fire the person who says that is the case with the latest version! Each individual topic from My News taken from the top menu and dumped into a menu under the My News tab. Extremely difficult to navigate once you open the tab as the writing is so tiny you are constantly pressing the wrong one.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRzlfWGZCSDJtMEFoNHJDa1hEd3ZmM19ZaXpyTkgzMTB1QkdvNGVoQnNSbDB3LVlVd1BTSi10VXNyM0RlZDV6WHg2TURxRzQyUGl1Z1lEWktz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Brian James",
        "comment": "Go to app every day - bit of an addiction. Not now! Stupidest update to an app I've ever seen. Have to fiddle about trying to hit the news category I want on a narrow ribbon, impossible with a normal sized finger.  And two hits to get to the same place I got with one before, with multiple miss-hits because the ribbon is so narrow and hard to drag accross the screen. An update that makes it harder to access news?  Clever - not.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRzV0XzFGV0xzcDhlaEFRV2VFbnpKcHhZa0tnZDJnZGQ2WVdDQmZwS3BqUmdxSUk4M1NRcERkR2dxellkUEVUaXVZb01oOW4xdlVVQ01sQ2xr",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "If it isn't broken then don't fix it. The old version was fantastic, no issues and no problems. Then you release this version where everything is more difficult to use and harder to see. The topics being dumped into one area is stupid and annoying, making it harder to read what you want. Please get rid of this and bring the old one back.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPR2xkTDlKOVJQUmtZMDRHRzUzWC1iY0R3YUFLZldINU5HMWVZY0hwcE4taVhHR21jSDZYLTc0MEZIV2JjY0xMOFJyQTFNbzhZQVZvNEt4anUw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "James Easton",
        "comment": "Why have you changed the menu bar it really is not user friendly anymore. Fiddling with apps that work is unnecessary when your so called improvements make the user experience poorer please reverse his latest update..... I know you won't listen!",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRUpLNUtDeXZaUDJ4OU81Nm1BS1dkSVNmQlItV3ZyQjNhdlJEb3hWUHR4TzBCSWpfamtVQTBYTXlDSUZyLWg1REhGS2FvbTU4akt2UUxGbEFB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Philip King",
        "comment": "The new layout sucks, as Matt Mitch says a load of my faves have dissapeared. I would iof liked to have been able to remove some of the default catagories and just keep the ones i want but now half of mine have been removed 😕",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRXdhbWtaZTVvb213dmQtS19GcXIxM1RoT2k2dUVUYVVPYml5RkttV0NNNzF6ejhoMkJnYTNNNkNRQ2s0NnlzRENYcTdFS3B4N2tzQlFQZ1cw",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Nothing good from this update, only bad new features. My news is now hidden, as others have said. I also find very irritating the imposition of over-large photographs which have to be scrolled out of the way before it is possible to read the text of a news story. I am looking for a better news app.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPSGNRZVhtaHFpWnVHZGNFVmY5M04yT2hJUzVnLXNzR0hDZU5CT0pnSV9GRTljNFdFRnFERW5tcGdYOEJiZWR4clc3aERqX055TlI2ZVR0b1JR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "M W",
        "comment": "I just watched your video of car accident. When it finished, next video: Amputees in Kilimanjaro.  1. Your autoplay makes absolutely no sense! 2. You waste my data! 3. And you do that WITHOUT!!! asking me or giving option to opt out. Oh, I found it: Allow videos to play automatically. Set to NEVER. Still plays:(",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPR1B5WGxaaTNMd1dnQkVVUjg3TnhLdlVVblRiTm5ZNW5kRGY2VlQzNm8yNU9CdWlHMFNTU2phSHBNZGFzb3NpVUJnTkVfZFB5SjBQcGNxSzY4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "James Shaw",
        "comment": "The app used to be good especially in the my news section. But the new update makes it harder to get to all the sections. It used to be so easy! It's great that new things are being tried out cause otherwise there's no way to move forward. But unfortunately this update isn't the best.... Sorry!",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPR1l5VTU1c2podFZicnpLeWpjRW1oc0hlUDV2M254ZXFOeUJOLWVxdGdLOHp0RzVTMEgtYlhnRW1UTXpVMnM0ZTJRVDluTncwd1pDaXFvZDRR",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Martin Harrison",
        "comment": "What have you done? Everything under \"my news\" now leaving me to scroll through. Not an improvement! Will look elsewhere for an app, soon to be uninstalled. Tried to fix something that wasn't broken? Just look at the reviews for this update and learn.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPSEJJeDMtRHQ1c1piYWZGV0FmOHNudzU0U2JFRHFfd3JOLUZqbHlGNUZwZVBRLXJ0UjI1Ti02SEJEMjJFVFFUTUVsczdwNlNiVzVtdzZyMTZz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "This app has been made unusable in the latest update. It used to have a menu with all the topics in so you could select politics, technology etc. Now all you get is one page with a mix of stories and no way to narrow down want you want. The app is now totally useless so I have to use the website instead.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRWQzandoVXhtY0NrRVJMVzhvZXRvNXJWSDV1QzlTMExvSkxfSkQzVkY3UjROODItTTdDbnRDaHkyTXNYajNWeDJMU0ZsUkRxZ3Ffc29KaXZR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "David Harris",
        "comment": "Awful update. Put the topics back at the top so you can scroll through them. It was bad enough that you had sections at the top that you couldn't hide such as my news and popular but now it's even more awkward just to get to simple news categories.  Also, the new font is terrible. It is too big to read comfortably but changing it too small makes it tiny.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRmFOZDFtNTZhTXdFNE5oVHNaUFV5ZFM3R0t1bzFpbW9LN3VrYURuWjEyLWU3cVdyUUtONGV2MFdud2JDMzdYSXljQ2pVSTktdU1ZeTFKWVdZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sara Allen",
        "comment": "To be honest, the new layout is awful. It's much less user friendly and as it worked fine before, I really see no advantages to changing it. Simple is always better. And having a row of your topics across the top of the homepage, was a lot simpler than it being hidden in my news. Especially as when you're in my news, it's just as it used to be, along the top. So what was the point of adding an extra, unnecessary, frustrating step in the process. If it ain't broke BBC, don't fix it.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRy1ST3FtaXZCOEFFSThXM2Zia0ZmbVdLVjZ3MklwQmRHYlFveUx0WXEtdndlTUJ1UkktUTNhRDIxVUo4dVNtSXV4aEhkUjl0OTRHWXZyYk0w",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ken Smith",
        "comment": "Vile, vile update. Where the hell are all the sections? I now have to scroll through stories and hope the link for that section is present. Stupid, imbecilic change, obviously written by the incompetent developers that wrote the main news website (that ignores autoplay preferences).",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRlhZRFlqYXFBTDVhZ0xDdHJWSU5oaVVJZVlYWlF6TVpSZHFTR0tfOUtERjRHX0Z5cnh1TmV2NS1aVTR1d1RuTVlTQzZIcURIUlI1bXNHcnVv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Robin G",
        "comment": "Latest update makes it much harder to browse your news. A big step backwards. Can we have the old design back please and perhaps fire whoever designed the latest update before they can do any more damage.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPR1ZsdGJLVWRnUC1UWlpRcHhIeUtXY0ZMbFdrQWs1SktFMEQtY2tEdnQxNUg2bTA3dkkxN1NaUlgtNC11Y3k4TkkyNlFDc0NsZkhJRS1Vdkh3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Aaron Dunne",
        "comment": "Everything in a sub menu within the My News section. For those of us who have bigger devices and like to browse on the move, this has meant that one handed browsing is all but impossible. I see the idea, but at least give us a choice as to whether we use it or not.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPSENHLUg0aTJReXh6Q18wWE5wOVVpWWhRT1BhSHQ1dGxuazh4Q0dWS2V3ZFVobmhuMHFSWEcyQ1BBSmxMaXpndnRuOEFIMVJCaHlLMGxpanpj",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "like other reviewers i think latest redesign is PANTS. like many other developers the beeb dont seem to have enough real work to do so they just tinker for the sake of it. whoever thought this version is an improvement either doesn't actually use it or is an idiot. message to ALL developers - make it work then LEAVE IT ALONE!",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPR09JWXFsc1BKNVZ5b1psckN5UHhOWkstTlVXdTNZZ19kS1pMdnNRekp3YzA0bnkzNG1faEdmY0RxcnJCY1pqREx0UE5xTHM5SFYtX1F2c3Rz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "The new navigation system, i.e. putting everything personalised behind 'my news', has ruined what was a good app. It makes it hard to find stories you want to read and just disrupts the whole flow. There was nothing wrong with the app the way it was. Please stop using license payers money fixing things which aren't broken. I will reluctantly be looking for a new app to feed my news addiction.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPSFB6ajFSaTZ0Vy1Qd2FFSk50WUljN1FHUk93UEgzRE9iWFc5ZjZaNmUtWDQ2OFVaZTdDTUhTbDFYY1locW1ESzJ6SDBFRnItdXpkYlZmWXRZ",
        "reply": {
            "author": "Media Applications Technologies for the BBC",
            "content": "Hi, Thanks for the feedback and sorry the last update caused you problems. We have issued an update to fix issues with my news so hope this is working for you now.",
            "date": "October 4, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Chris Purssell",
        "comment": "The new layout makes the app absolutely awful to use - moving user selected topics to \"My News\" just makes using the app less user friendly. I can only assume that someone let the intern brainstorm some UI layouts and nobody bothered to check if was a good idea - it was a stupid idea.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRXA5Q3hDWmFQcHpRMlVFZWNwVmtPcHdnS3hKRkRLTGhRbHdVUjdCLVJxRUZ1bnpIclhhem1tOTR2MWRpcE4tODhXV2VRclJ4OGpqdWtOekVv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "David Cresswell",
        "comment": "Terrible UX decision to group my news topics under one header item, it is no longer possible to swipe between from topics without going through extra menus. Carousel option is the closest to useable but still drastically worse than previous version. Please revert.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPSDd5ZUpZcU4yODlRMGFGeGZidmJYYl9ranNjS1Ezb25NX0d4TlVpRWYtS1pCOEpRZlFZOEJVVml3aWp3bmxfcTBmOTFuUEdlRmdSSllIOTY0",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Clare Knock",
        "comment": "The new layout to reach your personal news is a disaster, instead of being one click from top of screen, you now have to click through more screens to get there and even more to get back.  A slow pain in the neck   Please can we have old version back  Especially with slow internet it's a disaster.  Do app writers ever test things with slow internet connection?",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRkl0R0xRRUZBNk5acjRpUThMQXZjQVF6RkpTNm9ROVRoc3cxRHQzX1pNbFRVWWJmMWVIcUdPVE5ub1EyLWpNY0NQcGFFSWhEWGlzOHJQRjhv",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "David McAlindon",
        "comment": "They say they've simplified the app - they haven't! Your topic preferences now appear on one page that you have to scroll down - the more topics, the more scrolling. Previously, there was a menu to select a topic...now gone. Idiotic change.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRVRrclFfNDJUU1pnWXg3QUsxNkZMUFM2RjdCaG5kN3IxT1Q1bnNaaV96ZnRPMktGSTUybENGOTlNd1JYel9ySWRYVVRMc1dhdllOSFEzLUQ4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Colin Stewart",
        "comment": "Terrible new layout. Nothing wrong with it before. Could swipe through all sections one handed and now you have to further click in to another subsection to find your preferred news topics. Please change the layout back",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRl9jdnJ0ZEFyenEtckJHamo2TFVnb0xOSVk0OFRxSW93bHlHUzlpTHhIT3MtRlhyQmxkVXgzWGk1U0dfM3I5T1R0WmE2dkk2X0tpSFRCRzhR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Harry Miller",
        "comment": "Really disappointed by the update which moves \"my news\" behind a separate menu requiring you to go back to see the other categories you have chosen. I thought it was an excellent app until this update, which now loses all flow. I hope the devs take note of all these reviews complaining of this new, unhelpful feature.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRktPZmUzYjRBNGRUV2VUUUVlOE5Qa0lEU1p3aU54UWVscFJRb1YxU3FmY01WLWpQa21zdVY4WFdsV2NXS3RXWlFYT1RPYUtkM2ZkZnJyeGpF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "John Gibson",
        "comment": "Why why screw up the interface this badly. Have you seen the reviews, as developer's you shoud be ashamed to deliver something so badly thought out. Usability is now way worse than before, and that's one of the key elements over other apps, before 5 star now not really worth 1 star.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPR0dDNnVhSEJmbk4yajlDREhwSG5KekxCejlLWWUzQjg1TFc4dVF1MWsxVGM4SnhydGJSQ18wVEx4N3kyd3gtRmpxMEVfa3pmRUxreUVQMTlv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "I really don't understand why app developers consistently ignore their content users just because they think they know best. I fear a snapchat style backlash with this update; a poor, clunky way of navigating to the news I want to see. Where was the consumer research? I refuse to believe anybody would give positive feedback before release. Why not give users the choice of how they wish to see their news?!",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=bGc6QU9xcFRPSDRPN2FKV1g3M21Ma1c4X0NQYXNLempfenE1ekcyejNpT2xrY3VPYWNQU1BtbnlFbFpQdzhMRWNkVjVIREZaRFpRNmFWeHUxUU9KRjZjYV9N",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Cheryl Wright",
        "comment": "Recent update has made it harder for me to read the topics I like. We're easily accessible on top bar. Now I have to navigate sub headings and the content I used to easily have access to right there in front of me I have to hunt Down. Before this change I would have rated it higher. This is Chang for changes sake",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRllhbEtjZHBSUzJpYUd4Q29FZ0tVUDdGMGdQTzBQdlVicTd6QXNka2dRQklZOHB6WHNTeXhtUGxhdG1rQ2VFUU5YUVJKdXJHdTdpWW9zZGxB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Malcolm Bennett",
        "comment": "BBC news is the definitive news source. It would be nice if you could configure it.  I would remove Top Stories, My News [because it isn't] Popular [because its irrelevant]  and video [because it's unnecessary] It's now updated, it hides topics I have chosen in \"my news\"  I hate it. It's a pain in the ..... Who dreamt this up? Well done. Now put it right.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=bbc.mobile.news.uk&reviewId=Z3A6QU9xcFRPRVNfRmJtVURiY1lPb3NacTlKQkZmMndWYTk5cDd3cHI3VHRocVd6VF9GRl8tTlB4MExZSTRFQnpyNk9OTFozRnNyb1otUGVnUmlpT2V0ZW9v",
        "reply": null,
        "star": 1,
        "title": null
    }
]