[
    {
        "author": "Jeffrey Banks",
        "comment": "Previously I rated this app poorly (two + years ago) because of some crash issue. Those have all been resolved long ago. I find the app extremely useful, use it all the time. The support people are great and respond very quickly to any updates that are needed or any issues that you have. Contact them to get the problem resolved before rating it poorly! I definitely recommend this app. Its a great way to track the items in your wallet and the various benefits you can get. As I have many credit card to take the best advantage of rewards back programs, Wallaby allows me to find the best card suited to a particular purchase, maximizing my rewards!",
        "date": "October 13, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSEd4amFWU3d3aHJEeXdqUXdWd2NuRWl6MFRwalF0aXh2WTBROVJmdkc2d1A4TnRFeWJ4UU9qT2NCZHAyeVFoeGFTeW5VLXJzM2xTMzdwLUZB",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Jeffrey - thank you so much for your patience as we worked out the kinks in the app in the past! We sincerely appreciate your review. Please let us know if you have any features you'd like to see in the future. -Wallaby Support",
            "date": "October 16, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Gabe O'Leary",
        "comment": "Main use case: opening in a store to see which card I should use. Why do I need pin for this capability? Makes using the app quite cumbersome.",
        "date": "July 30, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSDNYY3lLajY2RzZTcGJNSFEwMUVqQl9BVUZnLUJvVUcwdm0wSlpvb3pNMUEyUERnM21oSjZaRmNzUVhHcVo5Qm1GRkVhbUFYWVFjcmZBOWw0",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Gabe – You can actually change this setting to Touch ID from the Settings & Help menu if you are on iOS. Please contact us at help@walla.by if you need further assistance with making those changes. Best. – Wallaby Support",
            "date": "July 31, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Duy Vo",
        "comment": "Doesn't take into account Amazon prime or Merrill preferred rewards program. I cannot override the category credit card. Great idea, bad execution.",
        "date": "September 12, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRm1ud2lhTVAzdWs2Vk9rVmRsSzEybnA1OHpxRTJhSUo1ZzdUTEtmMC1vbGtVYlVIZGJ0ZGhURFpicnpOZEFHRkJRbGs2aXpHTnlRc0taeHRZ",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Duy - we apologize that you're currently unable to enable your Bank of America Preferred Rewards. We are working on this and will update this review once this bug is fixed. -Wallaby Support",
            "date": "September 13, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Xian Vox",
        "comment": "I used to love this app. Used it religiously. Then noticed it stopped updating my transactions and balances a month or so ago. So I updated the app.   Now it doesn't work at all. It says my cards are connected to their banks, but still...no new balance and transaction details come through. The new UI is buggy as all hell, and is super ugly compared to what it used to look like.     Somebody clearly pushed this update months before it was ready.  Great product rendered useless as a result.  Edit 1/4/18: Still not working. Even with new phone. I can't edit card details, my credit limits are either 0 or some crazy huge random number. Tried unlinking cards to add them again, now getting a perpetual, \"oops, can't connect to the internet\" error message. Despite zero connectivity issue with any other app.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSGtUUmRHVkozejZYNi1KaE4zTEJxVk5oSW9IZ3UwLXhPRktlOXNJenpqalFLWnNONFRrOXNWaHJDZU5TNjAwekVNQlRqUmNUUmxSMEVSNlFz",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Xian- Very sorry the app isn't working for you. Please e-mail support@walla.by so we can get your bank links fixed. We are working to improve the app as fast as possible & would love your feedback & help.- Wallaby Support",
            "date": "January 10, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Devon Bertholf",
        "comment": "Really haven't seen many updates in quite a while. Definitely need the ability to use a fingerprint reader instead of a PIN number. The user interface could use an overhaul.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRVpqMV84Y1lJN2hsRmFkNjJmYU4zUFRFMDJUbnZ3S3ZlLWVxRVFTZnpKeXdoQTh2ZzY5QTVfUjQ5ZmV3MXpZbzU0UlZ5QXVYVHRJTWZyUWI4",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Devon- You're right... the feedback is a long time coming! We've got a new version in testing with a lot of enhancements and we look forward to getting to people very soon! Thanks, Matthew @ Wallaby support.",
            "date": "February 26, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Rob Tolson",
        "comment": "Unable to create an account. After entry of multiple verification codes I continue to get an error",
        "date": "July 3, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSDRURDFwUUFrdFJpaXgwOWMxUWdWM3NpSmo3Nm0tcFlGbzdVemIyNVRMWldDSzBjeFVhaGh3Si1ObGpoS0ptampneFcxU1Z6alc2QnBsdzR3",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Rob - Thank you for getting in touch with us. Please email us at help@walla.by and we will get this taken care of for you. Thank you. - Wallaby Support",
            "date": "July 5, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Mike Reneo",
        "comment": "I like the app so far but there seems to be a problem when using my Us Bank Cash Plus card. The app doesn't show which 2 categories I pick for 5 percent. The 2 percent category works but the 5 percent doesn't.",
        "date": "September 26, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRzJIaktPcHBFRE1JcmRJdFh2dTVoampqOHduSXNoekltUFBVV1FCNVFLTnVJanR1WGdPOHZLOVRIUThsbkIzakZJaERoZlNJczV5WTR1aXpr",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Mike - We're in the process of building a more robust feature for the U.S Bank Cash+, which should launch later this fall. We will update this review when it does. Please let us know if you have any other feedback. We appreciate your review! -Wallaby Support",
            "date": "September 27, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Roman Abreu",
        "comment": "The app has greatly improved in terms of stability after various updates, I can recommend it again and it's definitely the best I used so far in its category.",
        "date": "November 15, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPR2o5RWJCRURvYW1WQndmZVdzVW5WelJWeS1RWWlmR1Jqc2d6ZlBXYTMxcExkVHJTeW9pWm16aFdBNGFtbzYxcXpPQ0ZPUXNVTUxhM0xuUkpj",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Roman - thank you so much for your patience and sticking with us. Please reach out to us if you have any suggestions or features you'd like to see. Happy Holidays! -Wallaby Support",
            "date": "December 15, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Andrew Shults",
        "comment": "Account creation is broken (gets stuck on code verification screen).",
        "date": "November 28, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPR2dWZDRITzNsSXJwekNsdFlFZmQ0UWwwSjJva25nTE5zM2U0RDZpdlBnRHlac2xBbDZhZk5pMEY2ZG5NSU1wTTVON0pvaEhQTndvdVhuOUZV",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Andrew - our apologies for the frustration. Please reach out to us at help@walla.by and we can help you get your account set up. Thank you. -Wallaby Support",
            "date": "December 15, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Reetesh Jain",
        "comment": "No notification when in store, needs improvement so that right card could be used at right time.",
        "date": "July 9, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRVROR3lQTEtrX1RmV2dPeUZBRFNDQ3FiVWJCMDVQbG1yVV9qYWhVdlFaTUdxeTFoR3JVbzAzT0lpM2xWeUhEandyREJCX21GQzY0WTA1VGZB",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Reetesh – Thank you for using Wallaby and leaving your review. We’re sorry that you didn’t receive any notifications when you were shopping at that specific location this weekend. Please email us at help@walla.by and we will get this taken care of for you. Thank you. – Wallaby Support.",
            "date": "July 10, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I dont know...",
        "date": "September 2, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRUpXazdGWVNNRDFRZlNiaTZPSnNKVFhaUmFZYVFDSzJFUDc2VE8yRkh3YXFaVkg3a3hZYTR1cFM5QWNzTWxQeTIxLWFSTGI0aEZUbFFyY0tV",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hello - thanks for downloading Wallaby and reaching out to us. Do you have any questions or need assistance with the Wallaby app? Please reach out to our support team: help@walla.by. Thank you!",
            "date": "September 5, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "David Bumpus",
        "comment": "I haven't had much of a chance to use the app yet but so far the UI is smooth and easy, most of the cards that I have are represented (with the exception of a local credit union issued Visa), and I absolutely love the concept of this app. I really look forward to having an opportunity to put it to good use. To any haters out there, it will only get better with time! The longer this app is monitored by the developers the more cards will be added  and the more accurate the app will  be.",
        "date": "May 14, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRzBzSHdnT25CVmRNN2JWS0lGOVNTdHdXVWp6bXk5eXBnR2F1ZmJuUUMzT01ibmZmZ09sWUdzRzFOYTFqMEVQUGRQRzVkSEYxX0tTSFhXSW8w",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi David - thanks for your review and glad that the app is working well for you so far! Please let us know if you have any questions.  Please reach out to us at help@walla.by. - Wallaby Support",
            "date": "May 15, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Rob Molino",
        "comment": "I got an email today, 4-5-17 from somebody at the company saying that they have a new and improved version of this app and that it will solve some issues I had complained about in the past. Well every time they update it, it gets worse and worse. I can't even sign on after this new update! They really should have left it alone when it was working great. Why fix something that isn't broken ? I wish I could give this is 0 stars!",
        "date": "April 5, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRVUwdjJVeU1PQ1JGbU0xZEkyemRYZGUyUmFBb2h0R3Z1SG0zU0l2bksxMGJXc2RGNjRYZy1TQVAyb3ZMSW5SSEtpZmpORURUX2hTWkRNa18w",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Rob - we just updated the app and the performance should be greatly improved. Please give it a try and let us know how it's working for you. Thanks! - Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Ricardo Basto",
        "comment": "Inaccurate recommendations. It doesn't identify the type of merchant by looking at the card issuer's website; instead I think it just tries to guess what the merchant is by its name. Categories are duplicates (grocery stores and supermarkets are both in the list, but they are the same code for card issuers). Finally, the rotating categories that some cards have by quarter are not updated in the app, so it will suggest you use the card that will not give the most rewards, defeating the purpose of the app completely. I give 2 starts because I believe it can improve in the future.",
        "date": "April 10, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSG5PZ3FxazVxN1hCLURveExicExCMExFSXZVUlJNaEtMcXFZaVNFd0d1T2pXdklqajFyeUZtR0ozNkFiUm5vTTl2eGdZdlh4MzZ3VTFkRERB",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Ricardo - please reach out to us at help@walla.by. We want to look into these recommendations for you. Thanks -Wallaby Support",
            "date": "April 11, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Logan Rosen",
        "comment": "Great app! I use it to figure out which card to use for my purchases. I wish it had fingerprint support, though, so I don't have put in my pin code each time on my Pixel.",
        "date": "April 18, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSGlCRzJXY1E5QzN0ejNYVU5yTjN2NllBSkdwSjVUQkVvX3hFaVl0VFBwTWoxanpWMHdMOW5yTUo3NTgyREhyY1ROXzVkaHBBQ0RMRXlDakRz",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Logan - thanks so much for your review. We're going to support fingerprint integration in a future update. We will keep you posted when it's available. Let us know if there's anything else you'd like to see in the app. -Wallaby Support",
            "date": "April 19, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jeeva Subburaj",
        "comment": "Its not supporting wear 2.0 .. i don't see this application in lg g watch r anymore after the update.",
        "date": "April 28, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRXIwa0Jya3JRaW1wa0NrLWVTQ2N6MllWRlVqYWZodGdJWVRWb0Y2ZktDU3REUi04Yy1YZ18wUmZXeElXU3NkanNxbG4yclpOVWlsUGJCcnpN",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Jeeva - we apologize that we currently do not support Wear 2.0, but may bring it back in the future. We will update this app when we have an update on our end. Thank you. -Wallaby Support",
            "date": "May 8, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "steve nelson",
        "comment": "Awesome app! Simple to use and getting better with each update.  I use it constantly to manage my credit cards.",
        "date": "April 18, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRmtVTTEtbm5lX3AyYlQ3TWlUVHZ0UjJyVTdsZzYzdkZaeEp0RU1ZanZjVlRyZnFTQWNLVjluV05uVlhWREtObmNLS0JzWXhmY2JrUTNyb2RB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Derek lahti",
        "comment": "I was using the TPG app and still have it. I do enjoy the articles on Wallaby. The one thing annoying me at the moment, is the back button closes the app both on my Galaxy S6 and inside the app.",
        "date": "February 22, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRkZMcEZ0VDJGR0VZeTVROXUxS2FmQjctWVNGb0tabGRsV2dzcnRRbnNGTnVtQkh3SkM3NHF5Vnlya2t1MW9Fa3l4eFpBU3ZidmVEUDRURGxR",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Derek - this issue with the back button closing the app should now be fixed. Please update to the app and let us know if you're still having issues. Thanks. -Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Alex V",
        "comment": "I loved the old version. Worked perfectly. The new version doesn't work. Always stays locked in my home location, even if I'm 30 miles or more away from home. Reinstalled it, but nothing changed. I want the old version back!",
        "date": "February 16, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRzliQnZLZHJ0ek5JNXZ0WlY1QlBUOUt2LTZVQTRUdDhGb1VCUWhqYUhMYTdQdEg2Rkw1UnNfbElzdlFFd2p0cDVWQjVHbVhhV24xUXVNVGgw",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Alex - please update the latest update to the app. These issues should now be fixed. Please let us know if they're not. Thank you. - Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "David Peleg",
        "comment": "The premises are nice the execution is not. It's slow, at least in my case, it's more than a week and still no bank connection.  Long Way to go for it to be operational.",
        "date": "March 27, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPR1RfMFJ0a0xJT183ZXlyV2NpZXROeU5xYmZLRHI0Y1BLSVJRMk5LLW81dHZLV1NnYzFsWEp6U2oweEtaMFgwMDVDNm55OENMa29QTWZnOUtv",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi David - we've recently completed a major update to the app that should greatly improve performance. Please update and let us know if you're still experiencing any issues. Thanks! -Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Brad Faber",
        "comment": "I reiterate what others are saying. This used to be an app I used daily. Now it is useless. The UI sucks. But worse is it doesn't show all available cards from a bank and wants me to choose to link the wrong card. Just go back to the old version.",
        "date": "April 1, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPR0dMTFk4S3Y2Y0xhRUxkd0MyUTRJdkpzdjY5SEM1b1M3b0IxNU1vWFItM3ZCS0FBWEdtZjc1cjd6ODFjdkZHVG5ja0ZkdXRmcXBDUVBVaHNV",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Brad - we have a brand new update of the app and it is greatly improved. Please give it a try and keep us posted. Thank you- Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Shantoya Murphy",
        "comment": "Love it",
        "date": "March 2, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSHBwREM2MEZCc0E4ZFB1aG5xNzJRanJfRW5YY0FITU9JdGZWYnY5V2xCZlFuRENDbnoxTFRIX1ZMZFJRZXNpNWRGa1o4MmhrcEFVUEVOT2c4",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Thanks Shantoya! Please let us know if there's any features you'd like to see in the app. -Wallaby Support",
            "date": "March 2, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tommy Carroll",
        "comment": "This app used to amazing.  Now, it is so bloated, slow, and all of the information stays outdated by months that it is useless to use.  Why would I care about a spending tracker that hasn't updated since October in January?",
        "date": "January 17, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRk1Ka2tpVkltVzIyR040clVOV0g3emxlMllXUVNYU2p4TjRNWEJiT3hFdllXTXdyaTd2VDVLV3JKSWk3NWU1TTByeHFkM1NGME9mcUlBNGJr",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Tommy - we've just updated the app and it's running much smoother. Please update to the newest version and let us know if you're still seeing slowness and bloat. Thanks -Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Darvin Ray",
        "comment": "Update 12/10/2016. Linked my banks to my card. App doesn't recognize the credit limits from Bank of America and USAA. They are both showing as Credit limit zero. So, it makes credit utilization ratio inaccurate.",
        "date": "December 10, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSHZUM21XSzJHVW0yZWx1YkJ4aElwYUJUUnZtQnRYcTdVUC0yVmhUOUxUTHdENkhVSTE0RE5DM3ZQY080QzIyYjVvNXdyME9VdFpxbGo4MVNF",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Darvin- our new data provider is bringing back credit limit functionality in the future. We don't have an ETA but will update this review once the feature is back. -Wallaby Support",
            "date": "December 14, 2016"
        },
        "star": 2,
        "title": "nice but..."
    },
    {
        "author": "Jeff Williams",
        "comment": "Was one of my favorite apps, before they updated it. Worked flawlessly before. Now it's full of glitches, credit cards don't sync up, user interface is horrible, freezes constantly. Hey Wallaby...way to screw up a perfectly good app. You guys went backwards. Don't bother downloading this piece of junk...it's worthless.",
        "date": "December 31, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRklmMWRWMjh6bkJHZURvQWNDcE8wRVBLUENCNDBmSEJJbktjb19fUVl3S3hkUkNxY0phdlBjMi1ndXpCY3BKeV9RX0JCSjNsRFlmNWFXSVk0",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Jeff - we just updated the app and the performance should be greatly improved. Please give it a try and let us know how it's working for you. Thanks! - Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 1,
        "title": "Used to be good, now it's worthless."
    },
    {
        "author": "",
        "comment": "Very limited card selection. Does not memorize modified rewards value. Useful features like double first year rewards toggle switch gone.",
        "date": "January 12, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPR1d3amc0aFUwdTNoVk5yWWxnVnVpNVJ2Z21wOFNMZjc2Mk9CeFJFZFBnM1NFaDAyTktYYzBwRXRidWlEVmJPZFVYWWtEWFhaUzhuUmJvUUJ3",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hello - we just completed a major update to the app and have brought the useful features back! Please update to the newest version and give Wallaby another try. -Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 2,
        "title": "Nice idea, poor execution"
    },
    {
        "author": "Mark Braunstein",
        "comment": "Does just what you want to maximize credit card rewards.  Note you may need to use its search feature to find less common cards.",
        "date": "December 14, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPR1d4bE9IQjEtUl9ZUTZTVFluTTdnVjNIcWkzTTNtcU5EMXhnSHh5ekFERjdOU2xhYXpnLUx4V21nWjhsRW1XWkRlS1JjV1J0aDNYUTE4a3FJ",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Mark - thank you so much for your kind review! Glad we can help you maximize rewards. Please reach out to us if you have additional feedback or any feature requests. -Wallaby Support",
            "date": "December 14, 2016"
        },
        "star": 5,
        "title": "Great App"
    },
    {
        "author": "Gaurav Shah",
        "comment": "Edit 1/28/17: i will be uninstalling this app in the next couple days unless they fix the bugs and the issue below. If they don't recommend the best card by accounting for the tiered bonus, it makes the app kinda useless! As others said, they have taken a great app and destroyed it with the update. They promised me it would be fixed in a few days, then weeks, and now it's been months... Still no fix. I have stopped using the app so better uninstall to free up space.  ----- Seem to have lost the tiered bonus option feature in the latest version (e.g. for Bofa cash rewards credit card). Throws off all the recommendations! :( Hope they fix it soon for Android too.",
        "date": "January 28, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRURTc2N5WlI0M2ItTEI4T084bnZrYlZYR3N2czNhbXlrZEJoY0RjUlZZVk5iTWNlMGdKZVJKOHhhLWZxMWotcWllNFlfWDBHRXU2M1dDMmlN",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Gaurav - with the latest update to the app, bonus offers are back! Please update the app and let us know how it's working for you. Thanks for your patience. -Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Nawaz Mohammad",
        "comment": "Shows Chase Slate for Costco and when I try to open to see details, it hangs. Have to close and open again",
        "date": "December 28, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPR0ctX1o2UmZVVktUNWI5akhsVlF5MTB6MHBPM19DZm1FRzJmTVA5LV9oR2puVkI3U015MXJlNGJFZWtMbnRQT3JCRGN4Q09TVzBjTTZDZWU0",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Nawaz - sorry for the frustration.We can help fix your bank connections. Please contact us at help@walla.by. Thank you -Wallaby Support",
            "date": "December 28, 2016"
        },
        "star": 3,
        "title": "Shows Chase Slate for Costco and hangs"
    },
    {
        "author": "Wilbur Lin",
        "comment": "Unusable. Wherever I click on link card and search for the right card, the app crashes and quits.",
        "date": "February 4, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSHdEbFl1bnM5cmZ0aDB4ZXNDTDh3bkZEaThGS2FJZnFvbWNUMVQwMU9lOTFlZEw4WXY1cUxvRHBJc2Rua3g5NXFpNG1KZTZoa2hLOV9aV3c0",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Wilbur - we just updated the app and the performance should be greatly improved. Please give it a try and let us know how it's working for you. Thanks! - Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Artie H",
        "comment": "After my wife kept asking me which card she should use for different purchases, I searched and found this app. A great solution to maximize my savings.",
        "date": "December 28, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRTZlM0JqNVgtaVlBeWVCa2JtTjd6ZkZQa0Z2N1l4czY4aTROUEdTcWtTVkRCX1BqUk1xWjVZc0xOcUprSkhoa01aVURVSW5lU1RPS2R3RklZ",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Artie - - thank you for your review! We're glad to hear that the app is helping you as you maximize your rewards! Please let us know if you think of any features you'd like to see in the future. - Wallaby Support",
            "date": "December 29, 2016"
        },
        "star": 5,
        "title": "Great app."
    },
    {
        "author": "Christian Gunn",
        "comment": "Great concept. Transactions are slow and back button always exits the app.",
        "date": "January 8, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSElYOEhOZERpeloxOUd2TEIwbFl4Q0Nkb1NCaUtwLTRPMUJGbmh5Z0h0SGpvQlpFZGtadmdBSzh1aEc5OVBMWW1RaERnMTh6MU8wZjd4aFd3",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Christian- this issue should now be fixed with the newest version of the app. Please update and let us know how the app is working for you. -Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Doug Beasley",
        "comment": "Working great so far.  Been able to realize some rewards on my chase freedom that I'd been neglecting to take advantage of.",
        "date": "December 16, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSDVsa3NmN0dQMUpmWDZKQkRmVkdwdy1LSGRRcWwtMEhXazJ0R3YtRnEzY1V6VmdhOFhNc2d1UFRQSHVWbGpmOUhPQWY1UFhJZEdFbWdYcnA4",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Thanks Doug! Contact us if you have any feature requests or suggestions. -Wallaby Support",
            "date": "December 19, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "bt3205",
        "comment": "This app freezes",
        "date": "January 6, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSEpHNGVLUG9fSk1VNXZDbWxCbjZhUUtHa0FMNFo5dWNvemVJeVBBM0ZUSDNmdXdfVEdxNllBQlFKS2tjM2c4LWdOTWFZWEYwNzE1RlIxclRr",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hello - we just updated the app and it should no longer freeze or lag. Please give it a try and let us know how it's working for you. Thanks! - Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 1,
        "title": "Not good"
    },
    {
        "author": "joy hu",
        "comment": "Bad new version",
        "date": "January 16, 2017",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRmFTb2ZSOUF4U1Z1SU5sSnRuUW1GdEMtSWtEOF9JZEk2aXU5WTFnVjhaQUcxSnFxa0NfQTZVT3Y5SEtIcng3c054X2FZYUlNTHlNMTZKVkRB",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Joy- we've got a new update that should fix the issues we saw in the last version of the app. Please update and let us know how it's working for you. -Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Vandy Prince",
        "comment": "This app on iOS is great, except for not being able to connect to Bank accounts after the update.  This app is useless now, as half of my back accounts are saying fix and whenever I try to fix them the app crashes.",
        "date": "December 6, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRlFsb1NjZ2g5TVRuYjdybFNQY1hpTDJfLU5xU1U2OEtzMmQyRDI0SHJnT2RQVWtSdjVlU1pycmpvVlJpaVJqRXJKbHpWblFmeEpxWHlXWmc4",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Vandy - we just updated the app and the performance should be greatly improved. Please give it a try and let us know how it's working for you. Thanks! - Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 3,
        "title": "Very buggy"
    },
    {
        "author": "Andrew Brooks",
        "comment": "Just got the new Android rework of the app. Looks a lot better now, but my complaints remains. This could be an awesome app! But ambient notifications simply don't show up anywhere for me, and transaction history doesn't update, even after adding new cards.",
        "date": "November 7, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSEJZTEdTSzFxd3dPem9vSVROcjhnNEpjcEotLUIwVW9tRzA4NEtCUHhuTzdKUUtTZUJNVnVOMmhVSktuWVlycWZ2YXFiRE9feDREd3RaMkN3",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Andrew - thanks for the updated review. Sorry to hear that ambient alerts are still not showing up for you. Please contact us so we can get more details from you: help@walla.by. We want the app to work flawlessly for you and all of our users and apologize for the frustration! -Wallaby Support",
            "date": "November 28, 2016"
        },
        "star": 4,
        "title": "Could be Amazing..."
    },
    {
        "author": "Yaco Abreu",
        "comment": "my account was deleted per my request so I can start all over again due to saved irrelevant info. It worked to a certain extent, but this new version misses the target of the previous one. My suggestion is if you can't fix it, stop breaking it.",
        "date": "November 3, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPR0gyTVdWbDF3dFdyRzE4WFRjakF0YzFBUjlpczZrMnRjWWVZMURaZVR0N1k2clFvS1U3MXpyVWRETm85YnhqVDVGc0RrOHI1SlV1VEZfS1dR",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Yaco- we just updated the app and the performance should be greatly improved. Please give it a try and let us know how it's working for you. Thanks! - Wallaby Support",
            "date": "April 5, 2017"
        },
        "star": 1,
        "title": "If it's not broken don't fix it"
    },
    {
        "author": "Prashanth Mannar",
        "comment": "I am not able to Report a missing card. I keep getting error message for missing Card network field even after selecting the right one. AT&T Galaxy S6.",
        "date": "November 2, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPRmZiYkp5dkRjWXJZVDRmVGprczI2OFlxT2J2YkgwU29VNWhIMWtXTTlOUkQwRE5DVzQ5Z1k5X0tZaTJuVlY2UnN3WTdlR0NmNjQzLWZkdTNV",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Prashanth - are you still having this issue? Please let us know: help@walla.by. Thank you! -Wallaby Support",
            "date": "November 8, 2016"
        },
        "star": 5,
        "title": "Good app, but issues present"
    },
    {
        "author": "Ghanshyam Bhatt",
        "comment": "The new update has ruined the experience completely. Searching is so difficult! And the colors are just so harsh. I loved this app but I think I am going to uninstall it.",
        "date": "November 15, 2016",
        "permlink": "/store/apps/details?id=by.walla.wallaby&reviewId=Z3A6QU9xcFRPSDBZSWRZRVN5NHg3N0tsbFVOUEpwcHNGQmNsWTNlMzhDdm9RdDFHVnl3cndRSnQtbWlRdmVwbGl6SmVtZ3g4b2J0NVQ3VFl3MTN4emxLdWZz",
        "reply": {
            "author": "Wallaby Financial LLC",
            "content": "Hi Ghanshyam - We're sorry to hear that you are experiencing difficulties with the app.  If you can let us know what is going on by reaching out to us at support@walla.by we can troubleshoot any issues.  I will also pass along your feedback on the look of the new app! - Wallaby Support Team",
            "date": "November 16, 2016"
        },
        "star": 2,
        "title": "Update sucks"
    }
]