[
    {
        "author": "Luke Dearden",
        "comment": "For three nights, each attempt to sleep has brought you starting from your bed in fright, with no memory of what horrified you so.                               With a sickening sense of deja vu, you begin to dream. You try to wake, but tonight the ghostly eyes captivate you.  \"Treachery and doom!  My brother would unleash a great evil upon us. Britannia is in peril!\"",
        "date": "December 13, 2015",
        "permlink": "/store/apps/details?id=co.slashware.pixelworldwatch&reviewId=Z3A6QU9xcFRPRi03RHp6UHE0LThhbWs5SWRwT1FYY2lhLTB4Y05rQ19fM1JoWU41TWZkNDBjWTFxYmJ6VWZxMVhNSDBUMGF2VjRRNzE1NTBwSWFmQ0lHX21F",
        "reply": {
            "author": "Slashware Interactive",
            "content": "Sure that the ghost can take you to Britannia, you allow yourself to be drawn to him...\n\"A visitor, and from far away indeed.\"\n\"Were he not dead, I'd suspect my brother sent thee.\"\n\"No matter, thou shalt serve to draw the hounds from the scent.\"\nBelow, a creature heads towards the dark woods; a thrashing sack slung over its massive shoulder.",
            "date": "December 16, 2015"
        },
        "star": 5,
        "title": "At last, you are asleep"
    },
    {
        "author": "Casey Nordell",
        "comment": "Looks pretty, but since the time is at the bottom it gets covered up by the notification shade which often appears there. Of this could be fixed, this would be my default watch face. As it is now, I cannot use it because I am unable to glance at the time without using a hand which undoes the whole purpose of a watch. If this is changed I will redo this review. Thanks.",
        "date": "July 18, 2016",
        "permlink": "/store/apps/details?id=co.slashware.pixelworldwatch&reviewId=Z3A6QU9xcFRPR1JlVzFwM25RdGRFYl9UUTA2R1pjV2drQ3E3LUJSUTJPQWZqMDQ4MGZ0cnlaWnZ6cVVkM1pxdG01dUdGUDdCY3F2Q2szUXNZa0Ftbmw3QUcw",
        "reply": {
            "author": "Slashware Interactive",
            "content": "I'll work on it :)",
            "date": "August 16, 2016"
        },
        "star": 4,
        "title": "Requested change"
    },
    {
        "author": "Jeffrey Spiers",
        "comment": "Overall I love the nostalgia but I much prefer a 12 hour clock cycle. Any plans to add it in? I don't see any settings associated with the watch face yet so I'm assuming it's 24 hour only right now.",
        "date": "December 14, 2015",
        "permlink": "/store/apps/details?id=co.slashware.pixelworldwatch&reviewId=Z3A6QU9xcFRPRVRCUFZMZHU0eF9sV3pzR3hGc0JuczZqR0kzNy02aW1IZzR2RGpyZVl1VzV3cHkwR2FUajllMENpZGdWb0V3bGRmeERGYV8yRnJmWVYtOUlF",
        "reply": {
            "author": "Slashware Interactive",
            "content": "Thank you, I plan to add that setting to the next version :)",
            "date": "December 16, 2015"
        },
        "star": 5,
        "title": "Request!"
    }
]