[
    {
        "author": "Tonya Perry",
        "comment": "I like it for Android Auto  better than Google Play Music. Only con is you can't delete stuff from the player without deleting it feom your phone. For instance my ringtones are in the player and I want to remove them but I can't because it deletes it from my phone. Basically a really good app.    Update: Still having problems with Android Auto. Of course no one wants to admit they're at fault. Time to find a new app.",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRmhmUTNSM2V4a3FuOUl6emRic3dFVnVId01tVDlrenNWdFNEeDRyeUMtZHI2bzNNbkVkRVFSaXd2QmdOUzdCMERWSm5sSEVIYnhEeXZmMWc",
        "reply": {
            "author": "doubleTwist ™",
            "content": "To remove unwanted files from your library, go to Folders view, tap on the 3-dot menu next to the folder that contains unwanted files and select \"Ban Folder\". EDIT: unfortunately, developers have extremely limited options when it comes to Android Auto because it's controlled by Google. Google seems to currently have a bug affecting large media sets",
            "date": "January 9, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Joseph Simoneau",
        "comment": "Great, easy app to leverage all those years of downloading mp3s!   Curious if anyone else has issues with delays between tracks? Maybe it's just buffering, but there's usually a sizable wait between each file.  EDIT: Didn't find that cache setting until developer mentioned it. This seems to have solved the issue. Great app! Thanks for the quick response!",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSHgwa3htWTFqUmFZaWhOSWZUZGdkSHNFVVhZQmhEOVdLelQ4RDItQ0k5Z3YzMC1OVTlsbE1vZmU1VFZVNHN3dVZvcEJoVjFraDRWRG1aLUE",
        "reply": {
            "author": "doubleTwist ™",
            "content": "Any delay between tracks is usually due to buffering and depends on network conditions. You could try caching tracks offline and/or increasing the cache size in the Settings.",
            "date": "February 12, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jeff Freeman",
        "comment": "This app is the solution to a significant problem in my life. I store all of my digital music on OneDrive, and it's a lot. Much more than even a robust SD card could handle, especially if I want that SD card for other types of storage. After searching many, many apps, this one did what I needed it to do. It streams from my OneDrive perfectly, and when I need music on my device for faster access, I can do that as needed. As a professional musician and music educator, I need this app. It makes my life happy!",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPR0x2Vy1leXZWOUxyQzByNkkzamxNczVTNGgybVFKM0RMcGhzZUtiSi1KWWlxd3hWd1FGMHFMNDBJcnhuOU1GdWx0c29QQzVHR3NWbk4yVmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kyle Pollitt",
        "comment": "Haven't purchased (yet) but so far so good! This not only plays all the music stored on my Google drive account, but it also found album art and band photos I didn't even have saved in the folders. Music quality is great too! Will probably be purchasing!",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRXkxbUxpS0c3ZEZEQUJpWDdWUURJRXlqNWlKblhWZEpkbjJBZlgtUDhRX1l4MVQ0SXphODlyM21lOHhKdzd0cnMybnF2eGt0YVVZcndyZFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Onno Verkerk",
        "comment": "Everything is there so i bought it. But now i see it is draining the battery. Probably because it scans my OneDrive automagically? Tips: 1) streaming over 3g is ok, but please do the house keeping over Wi-Fi only (during night?), and 2) please do something about the battery drain. I give you 5 stars if you do !",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRXUtTHRRLXI2OUVNM1h4bDdsRnktM1hrZkhSRHRBN3BBX0ZPYUpnNUxtWUxYZl9oUjRiQXFOcl8ydzhPMWs5Y0hpWEg3Wmo5OE5zYUhTUFE",
        "reply": {
            "author": "doubleTwist ™",
            "content": "The only time the app would use more than normal battery power is after initial setup when it needs to extract metadata & artwork from large numbers of songs/albums. Subsequent scans are incremental and should only use minimal amounts of power. It's also possible you experienced some odd one-time Android issue so I suggest you reboot your phone.",
            "date": "February 23, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Iahel Cathartes Aura",
        "comment": "Very well done player! Saved my playlists when in thought they were lost forever! I esp like that it shows how many songs & how many minutes/hours a playlist has. I need an amazing, super professional, advanced, dependable player for my job as a therapist. Will buy pro version soon. Thank you, doubleTwist!!",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSHN6ZEI2SkU3UWFlcmROTk1KdE8tZTVsN1FmbEczVGhFTHhrOUc1bzVXemRxclFJZzMxT0w0aWVsOEFJcnQwNjFjVFFGckE0Tm0zeE1MN0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Claiborne",
        "comment": "Love it! Great way to play my music on Google Drive and cast to speakers around my house. Only problem is that it takes a really long time to do initial sync (several days for me) and the directory organization is a little screwed up in the app. (I have 20k songs.) Other than that, great app and I am glad I got it.",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRTF3SVZ2cnhidURod1ZzSG9uTjNvNU0xSllQM0h3d1JkaHA0WHRzQVlhS0dZLWtlT2pGZ2cwXzdwUTdTbVFuc3ZtNzZlMlJBQzVIM3QxTkE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Philip Staniland",
        "comment": "As soon as I paid for it I started having problems with it. Album art no longer appears. It shows on the lock screen even when it should have been closed, and Android reports it using excessive battery.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSHF2cS1UMWdYUUdpTGU4bF9JTERacGFGeXhTUmxPVjhac25MMnkzbUF4dHZNLVR6dmtHUHA3UHlnakhaOEk4OGU1bldibVEydkltXzlIMXc",
        "reply": {
            "author": "doubleTwist ™",
            "content": "First, reboot your phone and relaunch the app to make sure it's not some weird Android issue. If it happens again, please come by our forum and post more details so we can investigate: https://plus.google.com/communities/102684141461061984604",
            "date": "January 4, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Chris Chris",
        "comment": "Best app for large cloud library. flawlessly synced my onedrive music lib. Tags, artwork etc all w/o any problems. Tried many other apps also on ipad (flacbox etc) they mostly failed. This is a star. If devs would implement high-res play over USB into external DAC/Amp for audiophile headphones this app would be the leading audio superstar b/c Neutron player or USB player pro don't support cloud libraries.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPR05iVllSRGxXMThTR1VFWWI5TE96RnBURVJFREJSRVFyTlVjVEFJOVpHMVU2M3ZMeVBUNkxTdG13cnl1cjAwamVFQXhEcHN4WWczVDRTdVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Abigail Westfall",
        "comment": "I'm pretty pleased with the app. However, one issue is that some of my longer songs will get cut off way before they are over. Is there a way to fix this?",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRjU0czFlbjAyQlZEdjVCQ3lyQXJKdXZPMkVNWjkxajVEUXJYbW04WmhXdFBmbl9QdDEwUEdjbUVSWU9iZnZ1UVhBUGljTkNCcGtQbFRqNXc",
        "reply": {
            "author": "doubleTwist ™",
            "content": "This may happen if your phone is putting your WiFi chip to sleep in order to preserve battery. Make sure you white list CloudPlayer from any battery or power saving scheme and don't run any task killers or similar apps. Battery settings can be usually configured in Settings - Battery - Battery Usage - More - Optimize Battery Usage - All Apps",
            "date": "February 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Knott Nyce",
        "comment": "Not a bad app ,quite good but sometimes when I want leave it playing some of recently added songs playlist it seems to skip past a couple and go on to the next song and I don't know why. All the songs are all in the same format so can't understand why it does this, hence the three Star rating.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPR2d4eUtnai1MeXZydE9ybmE5N1FpTVNfS1l6RzBRVlN0dFRvaUszc0pfdWF1YU9WSDhqNHJOS3ByZU9hbU9ET1MxTWZ3WXk0S3c4RWdUSUE",
        "reply": {
            "author": "doubleTwist ™",
            "content": "CloudPlayer skips songs when there's a network issue. This can include anything from your WiFi or mobile network to temporary issues on the Dropbox/OneDrive/Google Drive data centers in your geographical location. The logs can contain details about the exact cause. You can send us a copy right after it happens by going to Settings - Send Log Files.",
            "date": "February 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Asterisk",
        "comment": "I usually want to be able to access my music from the cloud, but I've found it rather annoying that Google only lets me add music using Chrome. This app solves pretty much all problems I have so far with default music players, which is that I can't edit the mp3 tags nor the album covers, whereas with this one I can. Pretty much checks all the boxes.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSGJLcHNCbTYxdGdyRHJlenJwNTN6Wk9BVUtJX3pjMUV2enlsakpTZjdrUkxDMmNEamRaMlQ1NlJ2NlNGZUx4T093Zm1KRFVFM3ZybV8tTGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jett vW",
        "comment": "Great and fluid app. It would be convenient if there was a universal search bar that searched through albums, artists, album artists, songs, playlists. Just would quicken things up when searching. Other than that, very good.",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSHRWYmJfN0tuQm5waG0tcmpRTERZNG5namE1SXoyVG92a0N4cXpmZzlUVVpGQWxneHE0UjZUc0JLRkFPbXlRQnRGYTM0WkNFcU1nRmNHaGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Edgar Rojas",
        "comment": "One star less for terrible developer response! I WROTE THAT EQUALIZER SHOULD BE FREE and they responded they aren't a big company like Google to provide a free equilizer just like Google does. HOWEVER, you already have the equilizer, you can provide it for free. WHAT IS MORE, WE AREN'T ASKING FOR A PROFESSIONAL EQUILIZER. You can provide a free equilizer just like Google does, and provide the premium equilizer for people who buys the app!",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRWtOR0ZyNzdSZmVyV2t1RHlqSXlhYjRYWFlMWGItZE9PYnpNdnUxazJPZ3J4VFlxcGdiVEJUWXF2Rm50VUlXX1NIdlJUX09UQ3p0TVRkOUE",
        "reply": {
            "author": "doubleTwist ™",
            "content": "Send us a message at https://support.doubletwist.com/hc/en-us/requests/new and reference this comment. Thanks!",
            "date": "January 31, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Faraday Mochama",
        "comment": "I've been using it for a while now and generally it's a great app. No other cloud streamig app comes even close. However I have noted two rather annoying issues: 1. I've set it to autoplay when I plug in my earphones and when I do that but forget to turn on wifi or data (I've allowed it to play using mobile data) first, the app literally freezes my phone. It appears to rapidly skip from one song to the next trying to play but fails and ends up hogging the phone memory and processor. I can't do anything at that point except to restart the phone. 2. Sometimes it fails to go to the next track on my playlist and simply stops so I have to press play again for it to resume.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRnRWbGM1Z3UwZjNUOG1YUjdCZjNzODlodVlMa1FnaEs2NGs4eVJxbEcyell5emFIbzFtUmdRSjNYcHRuRDA4aFZXX042Y0RNOE9haloyUlE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lena Thompson",
        "comment": "That app was awesome. Didn't know it has radios, instead of other radio stations from Google Play Music. That was way on the 'A-List'.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSG9uNkZPbVVhSnlodVgzR2lnbjI0MjFUeDVHWUFmQnB1WHpianBXdXVXNDJZLU96c1h6R2pFU3FzUEtkYll2WXFReFVRRURmd2wwdWxfOWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ngametua-Tiare Brider",
        "comment": "Had to restart then factory data reset my device just to be sure, but after all that which was worth it, I found my music. Once you have all your songs etc; the app is great! Better than Spotify and Google Play Music. If you can't keep up with the payments for YouTube Red then this is definitely a great alternative :-) big thumbs up!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRzg1Y0hUMnJCbzBZeE5rT01tRFlzOWRON2pwcVczXzEyLVFHMVBCUWxqck45YXE1ODJ4dlZvMTVaaVpTVFpHdlY3Q0xSWUVuYXhFZGFnc1E",
        "reply": {
            "author": "doubleTwist ™",
            "content": "If you don't see music that's stored locally on your phone, go to Settings, select \"Scan Local Folder\" and navigate to the folder where your music is stored. Here's a help page with detailed instructions: https://support.doubletwist.com/hc/en-us/articles/360001021472-How-to-scan-for-missing-local-songs-or-playlists",
            "date": "February 26, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Gary Watts",
        "comment": "I apologise, I was referring to your product Doubletwist Sync, which works with Cloudplayer but only supports iTunes. However, I'm growing unhappy with the customer service to be honest at this point, as both replies to my review and others there seems to be an abrupt and unfriendly attitude which has put me off paying for your product at all at this point.",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRWJmMU9iUG82QlJwNlB2MGNuYzBiQ0NEZW84amRtV283X2NUSmpjUmlNNDkxY3FIeElZbnZCMnNXX3BtVEhpakdfUjBuSndkS3FWaUhwTXc",
        "reply": {
            "author": "doubleTwist ™",
            "content": "Sorry, but you're mixing different products in your review. doubleTwist Sync is a desktop app which syncs with doubleTwist Player. CloudPlayer on the other hand is meant to be used with music uploaded to a cloud account like Dropbox, OneDrive or Google Drive. I don't think pointing this out makes us \"unfriendly\". We're just trying to be precise.",
            "date": "January 8, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Praveen Khunte",
        "comment": "Syncing with Dropbox, for 1800 songs, took 2 hours. Great, as it did this silently in background. Search is fast. Streaming is almost instantaneous.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSGp3dzhYSXVaNDM2Z0ktbWJXS1hMNThwVVBVRG1ZZTh5SkxzTlp2SENEVk9HNFdCLXFIemZ5RXlmUW9EX3ZxNFEtS1pacUFGQ0tQUnFCU3c",
        "reply": {
            "author": "doubleTwist ™",
            "content": "Please update to the latest version of the app as it contains fixes for the issues you experienced.  Thanks!",
            "date": "July 28, 2015"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Michael Burke",
        "comment": "Amazing. I don't have to download music onto my device. It pulls my personal catalog from the cloud (in my case Dropbox). It's like my own personal Spotify for the music that I actually own digitally. Been using it for years and thought I'd finally give a 5 star review :-)",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSFh2U2U1R3U2SVhNZG12QW9hTjZkcmlEa0JFMmJScF91bTVSbnN0S2hGallXa2gxN2oyd250MERRbE15WkFQYnAyV1RSZ2o4R25jU1h0SEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Matthew Hazelbaker",
        "comment": "I've been using CloudPlayer for quite some time, and I can confidently say this app is everything I had hoped for. The cloud support works flawlessly, updating your library & streaming files in a matter of seconds!",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRmlYUW5kZlhienEzY0ZWdGdFUzRZbXNYNFVjekdON0s4YzB6a3poLS03T1hFVGNQVWhTSWhtcGZEYS1CV0h5bXBuR1Q2ZE9lQ2NuTzlEQnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kevin Martin Salzburg-Felts",
        "comment": "I really loved this app.  However I REALLY need a Desktop app to, so I can truly have my music everywhere.  I've have to start using Groove  because it has this.  But I would REALLY like to use Cloud Player instead!!",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSE9aaGRETk5mQ29LR19DQjZKU0JFajhuZ2JudTVHQzJUanBmMVJjZzhVM2VGNFpmeDEzYjltZGFHc0tnUDZjZHllTHdPUHZxVjNEdHItMGc",
        "reply": {
            "author": "doubleTwist ™",
            "content": "This is something that's part of our future plans :) To stay up to date on new features and developments, keep an eye on our private beta group: https://plus.google.com/communities/114410062688956839568",
            "date": "January 18, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Hector Berrios",
        "comment": "The only problem I found is that this app does not read music in micro sd card in chromebook.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRW1rNGpPTTgyWEx3YzRNZkpRSlNqcXU4X1p4dE1YdTlGcjB6eGcxR3dpS3JaQmpuSVpKb3ZCZHRZYXpVUGI5ZnlsbThHR09nbUFnNTdQWlE",
        "reply": {
            "author": "doubleTwist ™",
            "content": "Not sure if Chromebooks support this but have you tried using the \"Scan Local Folder\" option in the Settings? Here's a related help page: https://support.doubletwist.com/hc/en-us/articles/360001021472-How-to-scan-for-missing-local-songs-or-playlists",
            "date": "March 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Roy Fremouw",
        "comment": "Enjoy the app, however I can't seem to be able to grant permission to delete files on my Huawei P8 Lite, however this might be more of a issue with my phone than with the app.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRzFyUVZHUkpOcnlFakNlNVVEdUpZdmc4UVlmR09MazI1OFE1OEd2NkpmVy1VajlvaHNkSDhqU01SOTFfR3drZjJIRVBZcjRiUHBfT2dXbVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rene Carvalho",
        "comment": "Perfect for who has songs on Onedrive! Used to use Groove app from Microsoft but now...",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRkJ1eW9GTmZnOGNWSFcybENFX1p3dHNkVXlNWUg0ZnJPYjNsS18yMVpwcFhsSHIyeXZfSjVkZ1c2QlpGeVMtZXZiWm90OTY3VFpCdlBQNWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Dan Abraham",
        "comment": "Unbelievable how the giants like Apple Music and Google Play Music are flooded with errors and this simple app just do what it should be. Whoever you are, thank you!",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRVBWSHpVR2FLcXBBaVZocml4XzBNZDF4djZlcFRHR1IyZldDeEFwTFlZekNSZFlPS1FUdTNVcndMTkR5STQtQWNGTU9OS0Q4RVNXMkpnTnc",
        "reply": {
            "author": "doubleTwist ™",
            "content": "Thanks, we appreciate it!",
            "date": "February 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "K. Hinds",
        "comment": "It works. Very few issues. I have been using it for over a year and a half.",
        "date": "January 7, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSHgtMlRPTzBDUGNuX1JCd283a1ozUGlCWUJtY3Vkem5RWU9MTG9TdWF0LUhWcDR5RXFuQ2UwV0VFVjd1TFN4VmtYbEtBMXZEZ19uQWM3NlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Phillip Baggett",
        "comment": "Not free. Name is Cloudplayer, but costs $8 to link a cloud account. Completely useless and mislabeled.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPR3hILTZkVG44dnlJWXpGblhlSndxMEUwMF9EMk5uSWlaY3JHdk1PSmVjM29ueUE3a1hwRTZRdFJ5T0YxczYxbG1mXzZmN3k4Yno0TWQxeVE",
        "reply": {
            "author": "doubleTwist ™",
            "content": "We clearly state in our description - twice - that the basic app is free and we have a 30 day free trial for premium features. We don't pollute our app with annoying ads and rely on user upgrades to pay the bills and feed the office cat.",
            "date": "January 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "cesar rivera rivera",
        "comment": "Page el servicio para poder reproducir las canciones desde la nuve y no reconoce ninguna cancion ni de drive ni dropbox. No sincroniza nada",
        "date": "January 6, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRi1pY1lWSEMwY3ZrMGZhVTBDZ2FFRmgyT2dOcUFfd0hPZF9WNjJLYzEtSW5NQ1B0R0twOGVLXzZKN0dCUDY3SzQzMElQbEljQkxaQXlWaWc",
        "reply": {
            "author": "doubleTwist ™",
            "content": "CloudPlayer has built in deduplication logic, meaning it won't import tracks from the cloud if it detects a preexisting copy stored on the phone or SD card. Here's more help: https://support.doubletwist.com/hc/en-us/articles/115002066751-Some-of-my-cloud-files-don-t-show-up-in-CloudPlayer-but-they-appear-on-my-Dropbox-OneDrive-Google-Drive-",
            "date": "January 6, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Thomas Leiss",
        "comment": "Why was it changed that the app saves it state? Now it always starts with the default screen. Lyrics would be nice.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPR3hXMjdPdlBtd3I2YW9SZ0JaeEtWczdqR2lUVTFlWnhEUng0UklaQ211QmdNdXM1bkxtZC0yaVlNRFptaDA0M01uc21RWDd2Z1BvTGRGQXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "robin ghertner",
        "comment": "Took forever to index my files and quit halfway through. Gotta be a better app out there that doesn't require going through log files to find missing songs.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSDR1Z3cwM3F5MUY4UnVQQ05KQlJuVlZYZTdsTGI3WWgySjJDNVo4ajQ1dmJDaGRxeGRxaDdIZ0lMSEkydkpCcTlld0hFQ0ZwNUxsa043TGc",
        "reply": {
            "author": "doubleTwist ™",
            "content": "CloudPlayer extracts metadata from your cloud files to get artwork, track numbers, etc. This can take 2-3 seconds per file and is only done once. If you are missing songs, read this: https://support.doubletwist.com/hc/en-us/articles/115002066751-Some-of-my-cloud-files-don-t-show-up-in-CloudPlayer-but-they-appear-on-my-Dropbox-OneDrive-Google-Drive-",
            "date": "January 11, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Richard Wood",
        "comment": "I am still very new to the app so I can't give a fair opinion.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSFdwdzVBWUJqYzB1cTVLVzQ5ZWhVLWk5YkxxbWZmdUJjQVNDcWdZdVBMMU9BejlmUFd3WVFVUGFmM3YxMzJDaGM1dFQ4STBGdlk5MFFHaXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Martin Davies",
        "comment": "Simply wonderful. If you want to keep your own music library and use it across different devices then I think this is one of the best options.",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPR0ZwTGlDSkVWSjBfaU52dUl0bXNnMUVxV1NSdVAwVDYwc3o3dXFyXzRFOXk5V0VoZDhPd0xpeHRXT1F1cmpLYW1ieVcxNjg1Q1ZLSFlFQ0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "sushnata panda",
        "comment": "After some time music from list are unplayable.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRUtfbk1CVF92QVN3anBVc3ZGcVpoNldGUjQzaDB4cjNsSUlDMTl0d0dvQ1VyTnZMN1VVb3dmVDJQR2pMaVBUMjg4T0lrSFhmZV9oemVkTXc",
        "reply": {
            "author": "doubleTwist ™",
            "content": "Are you a premium user or do you have an expired free trial? If you're a premium user, this is most likely an issue with your network or your cloud provider and not the app. Which cloud service are you using? Have you tried un-linking and re-linking your account?",
            "date": "February 14, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Martin Nyaga",
        "comment": "The app is great but I wish they had a better way of grouping artists and tracks. Especially in the case of similar artists, different albums/tracks.",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRlBwekJWNjRELUYycUVxQlVCR01GSGN6MDdCM1VKbTZzUjVyRnNhZ2dhbGIxUm5jTWpaUjV3Nk9rT29UY2xtdjZEeWJ1cGUzeHI1UGdOOXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Gheorghe Jianu",
        "comment": "The app has a radio with which we can receive an impressive number of radio stations. The sound capability is excellent for both the radio and the MP3 player. Thank you for this product!",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSGpDOVZNdjRnb2taMUU3c2RwakRlU3dxSGNnWHBVV0pvTFVfLV9FcEFPOXl3VW93OXY3RFhJS2oyY0J1dXh0Ulh2Y3VIcWlVZGVnb1pWUVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Elvyn Morales-Perez",
        "comment": "Oh, no I didn't. Thanks, I didn't really know what it ment.",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPR1hlbklqQmNNbDZiR3d2Sk5RWHI3UHZmZXVWVUV1RHhUR2FZby1NWTlRcFNIQXRKN3hucnNZTnNBWm1aWENFTVZBdmhwYnVwVTE2dndTY0E",
        "reply": {
            "author": "doubleTwist ™",
            "content": "Have you tried the \"Scan Cloud Storage\" option in the Settings?",
            "date": "January 30, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Martin Shakeshaft",
        "comment": "Over an excellent music app. Simple to use and everything works. Had to hunt for hiding folders/albums it's in folder view. Now my music player of choice.",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRzZiTWZuczBmR0xzaUhCTHlVVDc4eTktQi0xYUtFSDlLOXkyY19CZEpzYUo1X18xZzUxQmxORTFCWmc2bmd2U0FzckxYV3RZTUZ5Zm4tTkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "anwar morse",
        "comment": "Probably the best music player. It has a good interface and an adequate search function. Shuffles and unshuffles my library correctly.",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPSGxLRk5RZ01jcWRGX3RkTDhwbnlqQmx4aTA3Smo0SThURUNuTEZMN3dMME5WQTNhREg2Q3I0Y0o3VVpWanJFX3N2YWFFaUhVQWF2U1V2akE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marco Almerigogna",
        "comment": "Quite good, but I am still meddling with details, I,'ll review the evaluation once I am through (hopefully 5 stars)",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.doubleTwist.cloudPlayer&reviewId=Z3A6QU9xcFRPRzczcHFPOGJrR1ltMkJoUm85Z21ZRUNXUVV0SWNQTkFoR3AydDBvWGh3anRWclpXVnlVTVlHbjRqWmE1N0F5em42YnpYTzZZQ05TLUxqN1E",
        "reply": null,
        "star": 4,
        "title": null
    }
]