[
    {
        "author": "Dennis G",
        "comment": "But in the past week people haven't gotten my texts until hours to days later and vice versa. Used to be fine. It's not my carrier, as all my friends who have Verizon have no issues. This will go back to 5 stars once I can fix this issue. Any advice?                                                                         EDIT: CLEARED DATA AND CACHE SEEMS TO BE OK NOW",
        "date": "April 7, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPR2ZJcUQ1ZWlOWDlIUkNJY3o4eEdLZ0lpTFlSd0ZpblNCTXJvdXhqeFkyZVBlMTl2eDdlOXF4YmJmaHRQNm4zT3ZaVWlkZEpzQVM5eVQxVlE",
        "reply": null,
        "star": 5,
        "title": "I used to love it"
    },
    {
        "author": "Neithan Grevialds",
        "comment": "Please support dual sim phones. Not on sending but please put sim indicator where the message has been sent or received (sim1/sim2) that would be a big help, since dual sim can set the default sim for sending in the main Setting so no need for it. Just help us not to be confused where the msg rcvd or sent like the stock Messaging app. and this is perfect plus elegant! And please add Signature too but a signature like what Textra does wherein you can create multiple, and choose separate it from text editor!",
        "date": "July 11, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRUJtS2x6SXFyVEE1TnJHQ01TX0dkTkg4V3BYUlJvT2FrY0dFdi1NY3U4OHdVaTEyXzJ4ZXVRbV9WMzB6Z1ZwMjVyRUdVa0pucUd2VjdzSXc",
        "reply": null,
        "star": 4,
        "title": "Perfect! But..."
    },
    {
        "author": "Mike Allen",
        "comment": "There may be others that work, but so far 8sms is the only messaging app I have found that allows you to mark a text as \"read\" from your Smartwatch.  Most texting apps will let you clear the notification, but it still shows as unread in the app.  8sms lets you clear the notification with a swipe or mark it as read.  Only missing feature is scheduled text.  I would also like to see a little number displayed on the icon when I have unread text.  Many other messaging apps do this and gmail does now as well.",
        "date": "November 30, 2014",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRXUwcnJSOXdPNVFlRng5UHNMOXludEsyOGZkdDFKSUFEN0JCVzBtZlVmZW1QMEFBNkJleHRYMGxxQlRSNWNXd3k1R2lTZ0JBVi1HQzNJQ0E",
        "reply": null,
        "star": 5,
        "title": "Best for Android Wear"
    },
    {
        "author": "Dylan Crawford",
        "comment": "Very clean and fast. Offers what other messaging apps don't, which is the ability to have the app turn on and off your mobile data when group messaging or receiving pictures or videos. If you are like me and don't often have your data on,  this feature is very important. That feature alone drifted me towards this app,  but it is also easy to use. It would be nice for this app to have a little more customizability when it comes to the interface, and I wish it displayed unread messages number on the home screen, but other than that,  it is a great app.",
        "date": "March 7, 2017",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRnNpRUkzMUtWU0hEYk5jNWY4VXhkSEtoRThNN05rOFBpczA4WndjX3pOdGRfNF81cjdzRFo2aTZDNWoxYUlJXzZPR0JUOXJ5SXVVMXFsd1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "James Brown",
        "comment": "This functions immensely better than my standard messaging app. I don't mind forking over a couple bucks for a quality product and that's exactly what this is. Not only is the set up relatively simple but, with the trouble shooting guide, any questions I might have had were already answered. Will continue to use as long as I can!",
        "date": "June 16, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSFN6cUd2R3VXRkY1azNHckFXbllxYnAydEpyaWUwV1ExYVVObTJDbWJMc0lVODBycWRIelFNb1RfQmRWb256WmtrTlc3Z3diazZlLUtWb2c",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, thank you very much for your kind words. It's appreciated.",
            "date": "October 16, 2014"
        },
        "star": 5,
        "title": "Worth every penny"
    },
    {
        "author": "m w",
        "comment": "Great look, feel, layout... Love the dark theme, and ability to delete all texts at once... but all my incoming mms picture messages are compressed before receiving them, coming in at very low quality (video as well) even after raising the mms size in settings. Outgoing mms my recipients have no issue with quality but sent from them to me its an issue; I cant even read the grocery list my old lady sends me... This is not an issue when I revert back to the stock messaging app",
        "date": "February 23, 2016",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRnpOTENNdTVtQU80ZUh0Z2ZRM2VUZWdOQ2Zaa2NOWFJCaDcxb2lrYWZuRzdPUzFJeWV1bnBtbEpJcC1xVWNmSDYwOWx5NXFyX09vUWpUeUE",
        "reply": null,
        "star": 2,
        "title": "Awesome app with great functionality but one thing..."
    },
    {
        "author": "Felix Hsu",
        "comment": "I am constantly trying other SMS apps.  Some show some promise but in the end I *always* end up using this one.  Why?  Ultimately, I like it's simple, minimalist layout.  This JB/KitKat layout is probably the best minimalist.  It's better than Google's SMS/MMS app called \"Messaging.\"  Although Google's \"Messaging\" is nice, I'm not a big fan of the whole Material Design in Lollipop.  I prefer the older JB/Kitkat layouts of the SMS app.    Because I go back to this app so much, I donated to the developer to show support.  Why? I believe that even if items are given out for free and I tend to use the item frequently, then it is a sure sign that I should donate to support the developer.",
        "date": "April 29, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRlRiZXpYT2FVZWdxQjNlRGpqdWlUOWFJSGN4REFZWU1XQUVELXRCMi1SU3hLMzRBaDVWRTgtRFJTenBuUWxuWnR5NUFmMWFYMGRmaU12RWc",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, thank you for your kind words and support.",
            "date": "May 1, 2015"
        },
        "star": 5,
        "title": "Always trying others but always end up with this one..."
    },
    {
        "author": "",
        "comment": "I was happy with this app, it's simple and easy to use. But after the last update it started running ads. Forget it, deleted it and traded it in for something else, even though it's the only app I've ever used for texting. Sorry, but this just isn't full-featured enough to begin justifying the use of advertising in the app.",
        "date": "March 20, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRVVYaDk0M3Zmd3pWMWFZQlBHZlRmQVRVSUpBLUgyZGNvanpNamhZdW9yZ1F5OEhUbTdHSVp6dGFlWTlqcDlCYU84MmVfYjBzTlJIX1Axb0E",
        "reply": null,
        "star": 3,
        "title": "Ads now! Ugh"
    },
    {
        "author": "",
        "comment": "Love this app .. I'm on Sprint and with the stock app it took forever for MMS to send .. This app solved that! Only one thing .. I have donated but still get the bar at the bottom I click and it stayed that I have donated .. Don't understand? But all in working as it should .. Thanks team keep up the good work.",
        "date": "December 5, 2014",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRktXbWhUTlZYazR1WWJSdFNRMDFWOVg5a3lyeWZteWhlM1NZV2ZJaTV3cFo2Rl9GVndFcTV6NzEwcE9uWm50MnFrelEwVEJmLWRYS1dFOGc",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, please see http://8s.ms/removing-ads or else, email me so I can assist. Thank you.",
            "date": "December 9, 2014"
        },
        "star": 5,
        "title": "Great App!!"
    },
    {
        "author": "Shanthan Reddy",
        "comment": "Great app. Tried everything to replace Google's default. But this is just amazing. Today I donated and installed the material design update. But there are two draw backs. One you cannot copy a part of the message or number. The other is there is no material dark design like classic dark. I think the dark theme is simply amazing. Please update that.",
        "date": "November 28, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPR1dvYy1Ia1VEQjVMYjRTSzFZSnBVLVJRdW1WYVNVMEZGS0FkeUlYNUNfd01oNGphcV9UTHJpOXdCV1NkS09pTGNmcGxZTnM4V3V4X2tPSXc",
        "reply": null,
        "star": 4,
        "title": "No Material dark theme"
    },
    {
        "author": "Kevin Kuhle",
        "comment": "This app almost allows me to stay on a stock rom and while the lollipop themes are nice there are a few bugs that stop me from using this. Sometimes some avatars in the message list change to square until I kill and start the app back up. The notification doesn't properly clear if I wait longer than about 5 seconds to reply or mark read from the heads up notification. Other than that, this app is great. Just wish it was maintained still so I could use it.",
        "date": "April 22, 2016",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSGhPTkRPbTBTRWxuZFEwNklYYTJwYjRFS2pGTWdCYmR2cFhCOG1tVC1Vek5JTVhnN0RHak41OHpoUl9jQzdwVlJvVFB4OWUxY0pKN01nOGc",
        "reply": null,
        "star": 1,
        "title": "It could be a great app"
    },
    {
        "author": "Garz buscado",
        "comment": "Im gonna make it 5 stars if in the nxt update you can give space or gap for the nxt bubble msg. i sometimes missed look and thought that the 2ndtxt/msg was the continuation of the frst one. The rest is actually perfect. Its just that the bubbles makes me confused",
        "date": "March 1, 2016",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSG5GWWw3eHJWSm9iMVJzU3dVc2psbTFkNUhhM0FmaUpPdkFKS2I3bmVTRDZUbUJmdlZ3cFZIZVk4UWJOQU96aWYtNGR6TWhObjN2bWdiMVE",
        "reply": null,
        "star": 3,
        "title": "Satisfied.."
    },
    {
        "author": "Unused Account",
        "comment": "Best messaging app ever. It has support for IOS emoji. I use a custom keyboard with IOS emoji so now I can sent emoji with my friends with I phones. Works perfect on my phone! The only thing I don't like is the ads but I understand why they are needed. I will donate to you soon(you are among the top 3 developers I want to donate to)",
        "date": "May 12, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRWhNZ1RORF9hUHRYdmllWng0TlVoaFJOd1c4b2VCdTBoZ2pRaHZCRWJvX2wzTllvaDNRam1nek40dWVaeHlEOVJHUWtUc2RlZldiMkE3NFE",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, thanks for your understanding. You might find this post interesting: http://8s.ms/removing-ads Thanks.",
            "date": "February 15, 2015"
        },
        "star": 5,
        "title": "Best messaging app!!!"
    },
    {
        "author": "Robert S",
        "comment": "I originally got this app for my Moto G first gen which did not give me audible alerts when I received a text message while on a call. This app solved that problem. I continued to use it with my next 2 phones and like it very much. It is just like the stock app for Android but has more options. I just downloaded the beta material update and it is fine. No issues at all. I would like to see some darker themes, like navy blue, but otherwise it has not posed any problems. No ads, no pop ups. Thanks",
        "date": "January 28, 2016",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSDZNQWNFdjdvQXNXQy05cXB3N2FZS2FxMGV3SGRrc002cGxaVDNyUUpmd2xqYnZKdXU4cUVqaHJzZmNuM05fSDJYVkRHbVBET1hWM2dGaXc",
        "reply": null,
        "star": 5,
        "title": "Great app. No issues, no ads"
    },
    {
        "author": "joe ph",
        "comment": "I liked it. But please with the anoying donation message. Its a copy of something existing. Im a dev,and this app doesnt deserve a donation anoying message. Overall i like it, but wont pay since ALL android os has something really similar...",
        "date": "December 12, 2014",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRmw2TXMtVUduUFdldERweGFrYTAwNGZPUUFDUXlNUVE2Qm9aMFVYWnNqZW9hQWNaZXRRRGJxUXpKZWNmdkZ5QWs5M1NMa1U2T1FSdlJ5dHc",
        "reply": null,
        "star": 3,
        "title": "From 5 to 3"
    },
    {
        "author": "Chriz",
        "comment": "fast and convenient. i love this app. donated after 5mins of use. 5 Stars for the dev and the app. I hope i wont get any issues (like the ads still popping up even i paid for it) in the future so keep up the good work. :) -one thing is missing, Dual Sim Support. im unable to choose which sim to use.",
        "date": "August 1, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPR0FmVzEyaXZJTDQ0Qm5vYXRJQUNvS3NuUHRXbjRSSXRwQXZDclJDUFZVa1czYUZyakgwMzk4eDZad280em1IWmlGRkM3aGNhNVBCTmJYNXc",
        "reply": {
            "author": "ThinkLeft",
            "content": "Sorry about the ads. Please see http://8s.ms/removing-ads Thanks.",
            "date": "August 2, 2015"
        },
        "star": 5,
        "title": "Best Messaging App!"
    },
    {
        "author": "michael rodriguez",
        "comment": "Best SMS replacement for hangouts.. But then they got greedy. They introduced ads and now my phone constantly hangs trying to send out texts. The version before the ads never did that. Really annoying.. Looking for a new app to replace this one now.",
        "date": "January 30, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRWE3V3l0WEhMb1YzR01XX3pHbjF0ekw1Z21JNXBlOXFLWWpFSW5rajE5V0Nrd29JUXBIZkZEWmR1em80dloyeG9fSUxXQWExc0MxY28zSGc",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, please try this beta version: http://8s.ms/download/releases/8sms-1.48.3.apk Thanks.",
            "date": "February 1, 2015"
        },
        "star": 2,
        "title": "Ads are killing it"
    },
    {
        "author": "Quincy Willis",
        "comment": "Ive been using this messenger for about a year and a half now. Never had any issues with it. Happily donated. I understand and appreciate the time you put into this messenger.    Update 1: *All of my Msgs keep saying sending and won't display sent.  Update 2: Never mind I missed it in the settings 😂all is well this app is still as perfect as it has been. Carry on the downloads. Update 3: Never mind the problem persist. Let me know if you need anything to help solve this problem. I dont want to switch sms.",
        "date": "October 26, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRjBfWnBSVHRhQlZJb0c5ZjkzZk9KQ1R0RHhEOGF4QmdLYy1TVUs4RDdEQTNLaTJiYnAySmtxVzFURXZpaHVPU1hGS2stemVXM09PM3JZZUE",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, Thank you for your support and understanding.",
            "date": "November 9, 2014"
        },
        "star": 5,
        "title": "My all time go to sms.."
    },
    {
        "author": "brandon cunningham",
        "comment": "I like the popup and design. I only wish you could zoom while viewing a picture message. The images often show up too small to see and must be saved and opened in another app.",
        "date": "April 18, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSEFGODJvSkpTRm53SVBHSkRmQ1JIbmpUckpRSWRtQklmQ0N4Q2lQeWVRWE9nWjh4N1JiTmZxVEtwZXBxUVFPQkh5OFp2RWh6aXpCNVF3bXc",
        "reply": null,
        "star": 4,
        "title": "one request"
    },
    {
        "author": "Andy King",
        "comment": "2. Donation request won't go away and is extremely annoying. I know I can donate you don't have to shove it in my face and if this issue is fixed, then I might donate. But the developer did reply and was helpful, so I raised my stars a bit.",
        "date": "November 23, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRlV1dlU2NHZzRFJqN2cyYzRQVnd0VmNoSGVuenFrOXhNUWFIcmg1U1JtUmlvc0hPY2IwSnVrd09hSDdzR3BHWEZQQlA5REJzQU9rYnNObFE",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, please see http://8s.ms/cant-send-or-receive-mms and http://8s.ms/removing-ads Thanks.",
            "date": "September 27, 2015"
        },
        "star": 3,
        "title": "Great!  Almost."
    },
    {
        "author": "Connor Place",
        "comment": "I really like this app. I love the the  pop up feature since I can't run cyanogenmod on my i537 (or any custom rom for that matter). Although I have been having issues with the latest update. It won't let me default this app as my messaging when I'm inside the option in the app. It also won't let me change it manually in default applications.  *edit* A simple  reinstall solved this issue",
        "date": "May 21, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSG12NXNJZzd6WHlSUWVuWmFxazBsZlU0T2hlNDVRS3JyU0hOOXlvY0hlX1BmR3dnUVpCWWR3a2lVUHpXa2pBbGhqTnR6dGhfVDZRV1N5YWc",
        "reply": null,
        "star": 5,
        "title": "Recent update issue"
    },
    {
        "author": "Rémi Straus",
        "comment": "Uses stock messaging so lightweight. Good use of screen space. Dark theme available. Has expected options for delivery reports, sent times etc. Has delayed sending option, very handy to catch SMS heading off to unintended recipients. Overall like how it performs and no complaints.",
        "date": "December 4, 2014",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRUxvSFVZNWpxelNSNmUybkVxQnlrMjZVTHYyMGlvMkdZOGpvblVBTTNXeUExckYtVkhRaEtPQXNNMlMzR3ZucWh2alM2QWVvcnMtMjVpUmc",
        "reply": null,
        "star": 5,
        "title": "Clean and simple"
    },
    {
        "author": "Corey Wolff",
        "comment": "Since I switched ROMs from BackStabogen I've been trying to figure out how to get the SMS pop-ups to work. This app is exactly what I was looking for. Unless I find myself a deal breaker, I'll be donating!",
        "date": "August 11, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRlJWOHJlR2ZLX1JWSDFMQlJEWWdOYkpQUFVnUkxwZDJDeHFDaF9BUUlrSkoyLTVvM3hkZnRsLWEtWlVfNl9tQ1FQMnBuZXBMbFRMNTN4clE",
        "reply": null,
        "star": 5,
        "title": "BOOM"
    },
    {
        "author": "Scott King",
        "comment": "I don't appreciate the persistant \"please donate to 8sms\" ad bar you've added. Thats really lame to inconvenience someone and ask for a donation to make it stop. I will be uninstalling and moving to an app with a dev with better ethics. /rant",
        "date": "March 11, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPR2FxUlFpR3l5aGkwcUcxRUNubWVWUEhVbjVjVEpjaXlkWDhBMFJ6VjZRT0dPbzhnV290QVJlLVNGclNoaG0tX1hpTVVRUTVNeUI1bUJzUFE",
        "reply": null,
        "star": 2,
        "title": "I used to love it"
    },
    {
        "author": "Brian Hosterman",
        "comment": "This is really the best simple messaging app for Android.  I've been using it for years.   If I could request one small addition it would be to reduce the vertical size of the text input. My screen isn't the biggest and I like maximizing the amount of viewable screen when typing",
        "date": "December 29, 2016",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSDJMUzJidFBrWUlVdFlZbVp4aW50d1lMV0ZWaG5Od3pIZExpaTVkZUxRUVlBSEVwV2FxRkJTS0p5SkJFWThYaUxuME1pMmRKLVdvQ1dXVWc",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, have a look at http://8s.ms/blacklist-a-contact to see how to do this. Thank you.",
            "date": "October 15, 2013"
        },
        "star": 5,
        "title": "Best texting app"
    },
    {
        "author": "Lee Miller",
        "comment": "Loved it until today!   This had been my go-to app for several years.   But after upgrading to Nougat (Android 7.0) it force closes every time I send or receive a text.   What a shame,  it had the best features of any messaging app.   If it ever gets updated,  I'll come back and give it 5 stars again...",
        "date": "February 18, 2017",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSEhuMjVyS0JSZl9iMDF5ckxpXzdDLWh5WXBwcXRMelFMLWtUSFRHMDNWb19SbnNYYTRleEhBMWVqbzk1bkFlTUF4QlF2M0lMQ1l2U2swYmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Bonnie Nunez",
        "comment": "Great and simple messaging app with a dark theme, BUT who wants to read their text messages with an ad banner in the conversation where you have to type???? Accidental hitting the ads because they're right there by the type box. Uninstalling.",
        "date": "January 15, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRU05YTBaTEVWUkI5VURrZlE4ajlHRlJJSTYtV1g1MWpwWGxTSDFTZ2NBMGNRdUEyYnZld192NVdvLTJISmxCREJsbTl2VEZTbGN5Nzd1RXc",
        "reply": null,
        "star": 1,
        "title": "Loved it BEFORE the ads!"
    },
    {
        "author": "Timothy Carroll",
        "comment": "A no nonsense perfectly functional texting app that doesn't use the horrendous \"material design.\"  Plus it has popups!  yessssss!  One request:  no notification chirp if I cancel a delayed message.  It's confusing because it sounds like a new text.",
        "date": "April 1, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSHhZTWVoa2RaQ19iQ1hIR2ZfVFptLTh5SExRU2lRSGMyVWtSbVF5dW53OTRJUGIyY2JIMmJuczNIUXdIZXdaSGZIcU1tNXkzM0tmVVh0ZkE",
        "reply": null,
        "star": 5,
        "title": "Finally"
    },
    {
        "author": "Tim Woods",
        "comment": "The only thing I dislike about the app is the inability to change notification tones per sender. On lollipop, the only way to change a senders notification tone is through the stock app itself. The only thing changeable on lollipop itself is their ring tone.  So I would love it if you guys would add setting for each sender. It most messaging apps long pressing the senders name in the messages list will allow you to change their tone. Something like that would work, or just any way to change it at all.",
        "date": "July 30, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPR2h0V3RhbUh1ekpwSklERzRWTnJIV1JULWlfNzVsZkUyY1VCcnJWaGxBOFdMSTg3bldPbm1uS3NLZVFKNGRiWGZRYmloenNNN0tmTlJqTXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ben Jonik",
        "comment": "This is my favorite texting app, but after I updated to lollipop, the pop-up/quick reply seems to \"store\" messages I already read. So I have to hit \"next\" a bunch of times to get to the right message. I'm also not receiving messages that are over the character limit and I don't know how to fix that either.",
        "date": "March 2, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRXRzZEpUQ2NKOUY0OTJOMGZUNXQtd3pkYW5yVGFvazdqaWFNTTBvSUNyQ0V1UFRLWk12MllINGgtY01uQVlNN1ZlNU11YWZNeS1sS3dxeHc",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, please email me so I can investigate. Thanks.",
            "date": "March 3, 2015"
        },
        "star": 5,
        "title": "Problems after Lollipop release"
    },
    {
        "author": "Alex Niro",
        "comment": "The layout is simple and there are some nice features. Only gets 3 stars because it's a bit slow on 5.0.1 Nexus 5 and there are ads in the worst possible places.",
        "date": "January 23, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRmFhQ01NeFAzRnJfcVF4TTZHMkp2Ynp3SzREMER6enV0ejdfa2JJM0hVdVdxTGhzcU5tWUZ6SVBIYTlqNmY3Z250dmUxTy1ERi1mTWgya1E",
        "reply": null,
        "star": 3,
        "title": "Good if you don't like hangouts"
    },
    {
        "author": "Jeremy Bougie",
        "comment": "Was 5 stars. The newest update broke the \"no notifications\" option in the settings. Even when you opt out of receiving notifications, the app icon still has a notification counter. Since I use a 3rd party floating notification Apk, the notification counter on the app icon isn't needed. Please fix this or I will have to find an app that works better for my needs.       EDIT: back to 5 stars.",
        "date": "May 2, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSDdyRnh6Qm5QazdfbWZPZFVDaE15c1ctVTh1MzlTMjliY2NCZEpBVFJEZHF6VFJzcGRMUTRBbUxYTzdic2tYSzY4NW5VTk40aHdBbUZ1eVE",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, can you contact me please so I can help? Thanks.",
            "date": "April 10, 2014"
        },
        "star": 5,
        "title": "Suggestion"
    },
    {
        "author": "Marquis Montgomery",
        "comment": "This app had saved me from the Google hangouts app and the default HTC app, and it's been my go-to messaging app for over a year now. Even though I'm on the verge of going to the nexus 6 with lollipop, so probably wouldn't be able to use this app at that point, I'd be remiss if I didn't contribute to an app that's been so good to use over the last year or so. Hope you can continue your good work.",
        "date": "December 3, 2014",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRXJTV3ptZ3JvbGg4UmZxUjZiM0VGRG1Ha1pFZmRTNy1WTUpPSXNhbUNhWVlxQ1hidkJuYWtTU1ByUVlYTUc4Wlg1YVBOUng3T3pjUE9GQnc",
        "reply": {
            "author": "ThinkLeft",
            "content": "Thank you for your support and understanding.",
            "date": "December 5, 2014"
        },
        "star": 5,
        "title": "Happy to donate to this app"
    },
    {
        "author": "Himadri Mishra",
        "comment": "I have the donate version. Here is everything that is wrong with the app - 1. Mark As Read button does not work for messages that have been in the notification for a while. The messages do not clear. 2. Add to Blacklist does not work when used from the menu while reading messages.  I bought this app because I liked it. Now I regret my choice due to no updates from the developer.",
        "date": "April 13, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPRUJUM1NHcTczUmI2QkZoTXYxVm1HbnRBekJzUGt6VjFJcnJWYkhMMXMtN0dMbEFLMlVBNS01eDBBZVNVc2s2Zy1uLXplZmduUC01eFlLY1E",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, please email me so I can clarify and assist. I would also gladly refund if you wish.",
            "date": "April 13, 2015"
        },
        "star": 1,
        "title": "Too buggy on Lollipop"
    },
    {
        "author": "Jay Makane",
        "comment": "A few extremely irritating glitches, but overall a good functional app. Hate round contacts. Add an option for square, please. I cannot stand my phone looking like a cartoon. Also, please allow a dark background on your material option. Most importantly, add a third (delete) button on the pop up. Now on my new phone Mms attachments save as null",
        "date": "August 21, 2016",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSFJEWUVQb2w3bUhVTUlaSDV6OXN1ZUV3ZkV2RjN5cFhoVnFXaVVYR1B2YU9iS3BrWGdsWm40VDk3WFY2UE5ReW9wT1hSUVpoR0V4ZmhtTVE",
        "reply": null,
        "star": 1,
        "title": "It's decent"
    },
    {
        "author": "James Bejarano",
        "comment": "I donated a while back but the reminder is still at the bottom of the screen. And when I click it it says \"thank you for your donation\" .  Why is it still pestering me to donate?!?!?",
        "date": "January 29, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPR2ZzSTRjWTlrVnhla2ZRS2JobjdIRFVjVHNUSW12WXRzbzAyN2tGYlI5OS1NVFZvYXNoQnhkMy03ckZDYWI5T2ozaVRETWRJMENuY2NsNFE",
        "reply": {
            "author": "ThinkLeft",
            "content": "Hi, please email me so I can fix this for you. Thanks.",
            "date": "January 29, 2015"
        },
        "star": 1,
        "title": "Donated but still have the reminder to donate"
    },
    {
        "author": "Adam Graham",
        "comment": "Seems to get better with each update. Sometimes phone does not notify when I het a message. Mms go crazy when pics come through flashes the pic for about 15 seconds before it comes up. A little laggy at times. Still way better than stock sms.",
        "date": "April 15, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPR1N5dkswZDlWRWdPQmU2d3N4S1FfTnUxZ2hFc0hyQWtHMWloeEl1VW1RbEZuWW9wMzl1WnJoVHFqQ0MxVGk5cUdRWVJKUUhsYjBSSU1GN2c",
        "reply": {
            "author": "ThinkLeft",
            "content": "Fixed in 1.48. Sorry.",
            "date": "November 27, 2014"
        },
        "star": 4,
        "title": "Getting better"
    },
    {
        "author": "Michael L",
        "comment": "Only thing I can complain about is the lack of themes. Minor compared to how everything else is fantastic. Not loving the ads though. This would be a reason to change, and now I understand that creator is no longer working on this app, so it's basically out of date and won't be updated. That's a shame",
        "date": "September 11, 2016",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPR0pseUVyQ2tRa0I0UEFVdGlWbUZrbXdobXJ0OHA4dy1tYndHRVQ1NVJNVHVheHU0SVpyXzlkUUx0OENVaXgtQmI5WVdXODFyM0pkaFQ5b2c",
        "reply": null,
        "star": 4,
        "title": "Can't top it"
    },
    {
        "author": "Adam Kautz",
        "comment": "More robust & faster than built-in Samsung app. Converts 160+ char texts to MMS automatically. Unfortunately it's missing 2 convenient features: Resend msg, & open Contact (for calling people back who r txting me from non-voice #s). Also when cancelling message send (thanx 2 delay send feature), the message doesn't return to composition box, & when switching from pop-up to regular view, any text I began writing dissappears. I'm switching back to Go SMS.",
        "date": "May 19, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPR1I3djV0OXdtWFlJM2RsQzAyYWhRSFR3MUVEbEdHb3Y4VC1KbjczLWpfX2VTSFpscHZmb2tGUUhrSno1blJpa0oxY2Q5RWs0MlpHV0lqcHc",
        "reply": {
            "author": "ThinkLeft",
            "content": "After cancelling message send, press on the cancelled message. It should then auto-convert into a draft message.",
            "date": "May 16, 2015"
        },
        "star": 3,
        "title": "Ok"
    },
    {
        "author": "Rees Withrow",
        "comment": "I've been using this app for a couple years now and is always among the first I install with a new phone. I've been very impressed with the amount of features, power user settings, and the developer's dedication to consistent updates. It breaks my heart to see all these one star reviews, because this really is the best messaging app. It isn't King or Zynga, it's just one guy! There's nothing wrong or \"greedy\" about asking for few bucks for something you've devoted so much time to. It's totally worth it!",
        "date": "February 10, 2015",
        "permlink": "/store/apps/details?id=com.thinkleft.eightyeightsms.mms&reviewId=Z3A6QU9xcFRPSEwxU0VqTjd3UnB1SzBPaHNxUmdicFlsUlNnRnRGWWw3YVV5ZEh2b2IyclE3SUFBNFBoem44Q19BNFhmT01FMkFyVTJuWjNiR0ppXzhCeWc",
        "reply": {
            "author": "ThinkLeft",
            "content": "Thanks for your supportive words.",
            "date": "February 12, 2015"
        },
        "star": 5,
        "title": "Best messaging app."
    }
]