[
    {
        "author": "Jeremy Dickert",
        "comment": "Time to look for a new sports app. Crashes non stop on me for both my Samsung tablet and phone. Started doing this couple months ago. Was hoping new updates would fix it. The new version sucks, the old version was perfect. With all the ad money your making now you might want to hire better software development employees.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRU5mUmFXQXQ4d2oyNnUxWGFLSFVhdXc2a196TTdlOXNsWVp3bHNxYXhmVEFsYW9uU1FFTlZtcjVUai1jTkdfWC1aRTR2Rk9hMUFzeHZtSkE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Jeremy, if you're experiencing issues with the app, please send an email to thescoreapp@thescore.com and we'll be happy to take a look at it. - AW",
            "date": "February 25, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Best and only sports app you'll ever need. Only thing is that I'm not interested in the Olympics and no matter how many times I remove the featured item from the list, it keeps reappearing after reopening the app. This is very annoying.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPSElnZWJnOEw5cWVDUXgtbHRpdGM4c21uVDNlcWFwTDFlZVE3SWVIUEdvQ2FVVVNuamQ0S0w1SHRYSkl1emlrQmlGbTdCcm8yT29PbktUbUE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey there, sorry to hear about the issues you were experiencing with the Olympics section. This section will be removed from the app very soon. - AW",
            "date": "February 26, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "C Harkness",
        "comment": "Sitting here at almost 5 am and every single NHL game that ended hours ago on Saturday has not one recap tab available. Have you done away with the recap option? No summary of the games I missed? Ads so big that they cover content. Not impressed with changes.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRldNM3hiVEJ2WVVUcUpZTUJOSjlxZ2picjdzSWpwQWFpdFMya3NycjU4WVpEWGxJSnZLMkZhM1R5YkhKOC1KZ2NTV1VVeHJ1UDJ2cWhDZ3c",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey there, we've recently moved recaps to the matchup tab of a game page. Please let us know if you're having any issues finding this. - AW",
            "date": "February 25, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Kevin Hartwig",
        "comment": "Ads are becoming too much. Constantly updating lower ad which is conveniently placed right below the navigation bar for accidental clicks. Then ads every 3-4 news items. Enjoyed the content but still wish there was a pro version for now I'll find something else.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPSDhoNmotSWlrN09QQlVyZlBWSmNwaFA2NVplWXowRU9UNThfVHpkN2FEdVR2N3JxQlgtc3F5TUd3ZWNhcmY0TE94ekhBQmVLRkpSVkZqWWc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Kevin, thanks for the review and we're sorry to hear about your current experience with the app. in-app ads allows us to offer the app for free. That said, we'll pass along your frustration along with your request to have a pro version to our product development team. - AW",
            "date": "February 28, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Avi Katz",
        "comment": "Use to like the updates when it gave me all the scores but now doesnt give me anything anymore i have the nyr that i say let me know for every goal and they dont give me any information. The updates suck now",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPSEI1R0dmMnBWVXp0ZVM5NnFTV2dKTWxjSVY2WV9Xd294ajJxMWVEb3IxWnFnRW1fNGZoVThXTVZPVzlEWk9KLTFIdE5VMi13YzV4R3U5R3c",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Avi, please send an email to thescoreapp@thescore.com and we'll be happy to look into why you're not receiving these alerts. - AW",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Alex Myers",
        "comment": "Love this app, don't mind the new design. Only big thing I think can be improved is a paid, ad-free version. I hate ads with a passion and would not mind paying a buck or two to never see them again.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRzNDaHhuRVVWNlRlOVQtUEN3Sl9QcUx5OXBrZ2J4aXNjT0JCNFNBNGhPTDNJeE9lVXpOamFxZWFGTVRobXNIZzlpc0ViUlY4S3pCdnZsYmc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Alex, thanks for the review. We'll pass along your request for an ad-free app along with the suggested price you'll pay to our product development team. - AW",
            "date": "February 27, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Ben Jackson",
        "comment": "The only app review I've ever written. The score used to be great but the new layout is not well designed and the ads are clearly causing slowdown and bug issues. I'd recommend fixing this immediately or others will flock to more competent apps.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRmtxTHVMV2RwVFRtcXZ5ZGdia1NhTXk0a2ViUDljX1gtbHBmWkVidFc4U3ZaNWxWY0ZHQWNyQWdMWnVxUm91ZjFFVjJEV0EwbWtpeHNxaGc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Ben, in-app ads allows us to offer the app for free. That said, we'll pass along your thoughts to our product team. If you're experiencing delays or issues with the app, please send an email to thescoreapp@thescore.com and we'll be happy to look into it. - AW",
            "date": "March 4, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Sina Motamedi",
        "comment": "A few tweaks and this could be a great app. Remove the ad at the footer. There's already an ad in between every 5 articles. Would be nice to select article sources. I want to follow a team to see their upcoming games and live scores but I only want to see articles from theScore, not 3rd party websites who write about the team. Also, can't even watch a video in full screen mode. The ad and menu bar at the footer are persistent so you lose 25% of your screen space. And lastly, it's not breaking news if Zaza Pachulia says Westbrook's comments are childish or if Stan Van Gundy comments about NCAA. Breaking news is Cousins having season ending injury or Blake Griffin getting traded.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPR0lsUTI0MFgtMHZ1WUxTV29uNlp3aUY1YXRIb2tJNFF5WFZJTi1jWEduVjc4My1JT2ZHNDhvb0pKLWN6VGpYNnhqNkt0UXVzRFQ1eHNJa2c",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Sina, thanks for taking the time to share your thoughts. In-app ads allows us to provide our users with a free app. That said, we'll pass along your thoughts to our product team and we'll pass along your thoughts on the content of our alerts to our content team. If you're experiencing issues with videos, please send an email through the app.",
            "date": "February 26, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Carolina Capper",
        "comment": "Was the go to app for live scores but lately it's been lagging behind. Fix the slow scores and I'll happily give a 5* rating.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRlNWdUk0aGw4c1E2Q3B4SjVvN1BtMUpuR1Q2R2J2T1NTazVWZG4tRDZ0YnBEYXRTVE93UkR5Q2JxSnN5RFBGcC1rMEhPdFBpZlc5Zm5xMnc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Carolina, sorry to hear about the issues you're experiencing. Please send an email to thescoreapp@thescore.com and we'll be happy to look into what's causing this. - AW",
            "date": "February 27, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Kimberly Watson",
        "comment": "Worked fine before all the stupid updates. Now I can't even find the NCAA Men's Basketball tab! What the actual F? Had this app for years and never a problem til now.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRzNNNlpJc3daYWZnMmd1WU9Uc1FGT0tRZVBUSmFjSTRienRibFN3Si1tLURvSTljaUdzM0xBS0VCdUY3MnFqa0E4NlRzUkh2d0htTm5rNEE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Kimberly, please head to the Leagues section at the bottom right corner of the app. You should be able to find NCAA Men's Basketball in the list of leagues. - AW",
            "date": "March 4, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "The version before was so much simpler and easier to navigate. The new version constantly crashes, and is hard to find info that you actually want.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPR3JsdFZVb1ZMNG5EalNjLWRsTFdRMjFnZzExNFFuTDJiREpkV3RKODRQNW1QaTdtYVBfQkFJUS1WbnpTbTJkQXZMVG5CQkh3TG9fOXVwMkE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey there, thanks for reaching out. Please send an email to thescoreapp@thescore.com and we'll be happy to look into why you're experiencing the crashing issue. - AW",
            "date": "February 28, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Good app, but Yahoo Sports has you beat. How about adding a \"picks\" feature like they have? It's a fun feature and, if you can manage to make it without all the bugs theirs has I'll gladly switch over to this app. If you add video highlights of the games as well (like they have for the NBA), then they'll have nothing on you.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=bGc6QU9xcFRPSHNwTmJ4SVJyM3dXMTBqcUZhTnlLaGE2V25Rc1FzSjhKbFRIZFlMOWZtQm9reXg0QWtlR19kSzd5T0FaV3ViZTE3WGFaNEgtRm9YaVhBYlE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey there, thanks for the suggestions. We'll pass along your thoughts to our product development team. - AW",
            "date": "February 25, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Devon Wagner",
        "comment": "I've been using this app for a long time, still very much dislike the newest version and I don't think that's going to change. I will say the app provides a lot of content, however my biggest issue is with the organization of the news feed, specifically the favorites. I am a huge raptors fan but time and time again the app fails to put any raptors news anywhere close to the top. Even under the favorites tab, where I purposely unfollowed/unfavorite every team but the raptors, it still shows generic news, so I have to go to the actual raptors page every time I want to see news about them. It seems to me that the news/favorites/discover section (which by the way, were the eye balls as the icon really necessary?) all provide the same content, and are only there to make it seem like it offers some kind of selection. I continue to use this app because to be quite honest I am too lazy to go searching for other sports apps, but I will say if someone recommends a new app they really like I'll be the first to try it out.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPSFR1WE5mOFRaYlMwODVvOHhZdzBFRzVKRW42UXJaQS1TWGN4Smp6NS02T2xHQ3Q3WnVsT1lHM205dk9nV3dacUlLQi1FNkZIZnN5N2cyN2c",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hi Devon - I'll be sure to pass along your thoughts to our editorial team, who handle the majority of the written content that you'll see on the app. - RH",
            "date": "March 1, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "I don't care about the ads (Every app has them, plus I totally understand the need for revenue) This was (and still is) probably my go-to app for sports(specifically NBA), but you guys gotta have recaps attached to game pages. I don't understand the logic behind making fewer recaps/reducing it to the teams local beat writers via some internal web browser",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRllQV2pKeFQ4WFl4bGpHYnlWY3JNNG1sZTNFZmpUSXNVcXkyVmI3bjd1dWdTWjkzR0lWcVRNM3pjbW1oblVHRU5UWExXVnVIZUhsN3dmQkE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey there, thanks for the review. Recaps can now be found below the scoreboard in the matchup tab of a game page. - AW",
            "date": "March 4, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jesse Malloy",
        "comment": "Why so dark? A lighter theme option would be great. Lots of ads. Other than that it's an amazing app.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPR0xmQVEwRzFGczZ2aUYzUlBUb2dBMURKaDU1THpnM3ltUlRXMWNtRmhxd2ozOElXLW9weU9JNlh1TEwxa0luYmtrV200MDRUOXZDbWhJTUE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Jesse, we'll pass along your request for a light-themed version to our product development team. - AW",
            "date": "February 26, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "JB",
        "comment": "I love this app! Can we get the CHL, CIS and NCAA Hockey/Baseball/lacrosse standings?",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPSHE5SWZaY2dQbDBDWVpzM3pJT0pkNnlHNDJwQ1VMN194RUNXODNueE9CWTcwMFY5ZEwxQ3JqSXNNMHJ3U2tqMC1DWUhMSlVyMTVTOURYUlE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey JB, thanks for the kind review! I'll pass along your league requests to our product development team! - AW",
            "date": "March 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tim Reeb",
        "comment": "The ads are getting ridiculous. Time to find another app for scores.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRllxckxBMDhfUVdSQTZmY1BFalNYXzdFUWRlaXp6d0lORmJDRkNZLThfamROU0xyXzJSQU90WXJ5VGVmOHIwUzg3ODBDendnMHVqWlhoTlE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Tim, in-app gives us the opportunity to offer the app for free. That said, we'll pass along your thoughts to our product development team. - AW",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Nielson Jugalbot",
        "comment": "New update and now the recap tab is missing. I usually read the articles if I miss a game but now it's gone. Put it back please.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRmQ1WF9oT3JXMnVzZ1NEYVgxOEd0aU84VWpSdDd3bGNPQkNONEQ5ckg3cHFqNEprOWxfbWIxRTRteVhDRlFnZEswV19PTlJodDBrNUZmMXc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Nielson, thanks for the review. Recaps can now be found in the matchup tab of a game page. - AW",
            "date": "February 25, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Christopher Seink",
        "comment": "Please remove the giant ad after every 4th story line or at the very least make them different ads.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRVYxRE9tUnI1d0Z6UzJpTHBQRlE3cTZET3J2VXo5dXNWTlE4TUhJRURHVGtFVG1yLUVvNS13eHdMRWpKaFNJaGVBTkVWZnNpTEYxT1hHQnc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Christopher, in-app ads gives us the opportunity to provide our users with a free app. That said, we'll pass along your frustration to our product development team. - AW",
            "date": "February 24, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Tyler Young",
        "comment": "NBA standings are still not updated even though the games ended hours ago. How is this that hard? Rockets have been 48-13 since before midnight last night (2/28). The standings seem to regularly suffer from slow updates and it might be time to look for another app.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPR3dHcklKN1V2MENTYXdvNERTVnB3bENEcm1rNV9TcUx4Z1RFX01BLVVqR2hHdFIzOGxQamd6UktEZ3QxYzBJcUFuZE1KdVdTMjh6Y215Z1E",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Tyler - If you notice any issues with our Standings page, please send us a feedback email through the app, with screenshots and we'll be happy to look into it. - RH",
            "date": "March 1, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Rick Conti",
        "comment": "After the Feb 23rd update the app no longer correctly displays the current schedule for Big Ten basketball for tomorrow Feb 25th",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRlVwb1oxdFhBYU5XYmFpX3ljczc2THhNQW5HNm9ZN0phdHN2TVZlM2pQaGpjSGRHb1diYU0xdURzVlFXajNWWmdqdkhURnNrUDkwMVUwWHc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Rick, if you're experiencing issues with the app, please send an email to thescoreapp@thescore.com and we'll be happy to look into it for you. - AW",
            "date": "February 25, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "william keller",
        "comment": "Been using this for years, no problems. Recently, pre and post view for games have not been available. Are they gone for good? Hope not, read them every day.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRXFYcThJTUpOWE8tdGEyTGx1YldCMUhCUktWT05MUmJKekxwOEhzR3QydmFXMGlHckk2bjJwcERRUU9yckREYUh3ejhqNWh6ZENXaXE5dkE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey William, we've recently moved previews and recaps to the matchup tab of a game page. You should be able to see it just below scoreboard. - AW",
            "date": "February 25, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "DeVaughn Knight",
        "comment": "I made a pervious review that seems to be deleted. To make this app even better please add CIS teams to follow. No sports app let you follow Canadian university football.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRjhTZU5ZdnB1Zm1rNjM3c0I2ejdCTkZVRXdHQ3ViSVdNNXVoRFpobWZmc0VIZzY2MXhqeWIyeTlQd3d0MzhUVFZ0WE1aZVRYWDVDMERYSmc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey DeVaughn, thanks for taking the time to share your thoughts. We'll pass along your request for U Sports coverage to our product development team. - AW",
            "date": "March 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jeff Cavanagh",
        "comment": "Latest update is finally an improvement after so much back-sliding.  App actually returns to your place after you look at details of a game.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRkNrZGFDLWlDSmZjbTBIc3duNGsxMU81elNLT0N0X3d1dWF5MkVGcWpZb3RTeVNnaFJrRzBZcG9tbnFMUmRuS1FQVklBLXkyZkFEdXRzNWc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Jeff, happy to hear that you're enjoying the app now. If you have any suggestions on how we can improve the app, please let us know! - AW",
            "date": "February 26, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Ty Wheeler",
        "comment": "I like this app but they keep making the UI harder to understand. Simple is good. Content is good but UI needs to be simpler.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRmx5cUNwOWx5TVZlNnk4NENON253T1NraDY3MUMzRnc1YzNfV0V4VVNQTlNBQzJHejBwUWFjM1VXVzBMbDlFX19rd1gzZTdOMWVSRzVhMXc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Ty, thanks for the review. If there is a particular feature or section of the app you are having issues with, please let us know. Any feedback is greatly appreciated. - AW",
            "date": "March 3, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Bridget Webber",
        "comment": "Works great! Best score app on the app store. Wish there was a way to set a \"default\" screen that shows when I open the app. When I open the app it goes to the league screen to choose what I want sport to look at.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRjRsVWlJSkNUVWNNR1ZTOEdDZUM5MDhzbGRVR0pNc0NTUnNUU0VqTWRmMldMVjNISGV4U3Z4SjVQRkQwSVJDd0JsajRqYXZXcnZQZUhCTWc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Bridget, thanks for the kind words. The app should open to the last section you were on before closing the app. That said, we'll pass along your request to have a default page feature to our product development team. - AW",
            "date": "February 28, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Freezes up on tablet. Can't get anything",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPR0Nfakc0LU9LLWRQNUcyMTNzc0o0VGVqQWhaWHNYMWQwVjg3dWREaDluTG1Rb0V0SzJJNnN4c2VSLWpVUUk1MXpjQ013akZ2dW0wUVN6SVE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey there, please send an email to thescoreapp@thescore.com and we'll be happy to look into the issue you're experiencing. - AW",
            "date": "February 26, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Jesus Walks",
        "comment": "So ummmm, whose idea is it to somehow get lost in the scores and conference information, but when you try to go back to the most recent score, it defaults to the Civil War era? Like why the hell would I be trying to retrieve scores from back in September of last year? The fact that I most times have to click on the calendar, and hit \"TODAY,\" which should be followed up with a button that says \"duhhh, whyTF would I want any other date months from today?!!!\" I swear it's annoyingAF. The default should always be TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! TODAY! OMFGTODAY!!!!",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPSDZtY19Rd3VtcjAyY0Q0NEl4aFFNRl9iazUwR2ZYay11dmJ2ZFNOWHhkOXkxR281d05WWXBOZFlHd2VfN2RfZVhDd3pzRlRpS3BiOHp2MXc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey there, please send an email to thescoreapp@thescore.com and we'll look into the issue you're experiencing. - AW",
            "date": "February 26, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Bill Sample",
        "comment": "I used to be able to download team schedules off this app to my calender but now can't figure out how to do that if you can at all.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRkRXbWFyR2lVOEJkeGNSV3RUQUtGQmtkRXNKSFFBNmRWT3B5MGtQVnk2bGpaRnN2WGVMZnUzS1Z6MnVveGxIeVJRZWlfWmpHOTMwUmtKdHc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Bill, thanks for the review. Unfortunately, we've removed the feature to sync a team schedule to a calendar. That said, I'll let our product development team know you would like to see this be re-added. - AW",
            "date": "March 3, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Jeff Ethier",
        "comment": "Barely any screen view, top & bottom take up most of screen!! Including Ads!",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRUVJLWJGWDJuUEpXazdDeWpJWWZ5eU9fYy1mVUZvaTlBa0lvN0VONXcyNGx5TDRJdUc0dENEUE11b3MxTDJSMi1BT01WQ0JoS3p5TjIxUGc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Jeff, in-app ads allows us to offer theScore as a free app. That said, we'll pass along your thoughts to our product development team. - AW",
            "date": "February 24, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "SJW news fails on so many levels. MAGA",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPSGN2dGF6ZC1IUUE2U0Fza0ltZlVGU3FqWko2TWxGVjcwcTA2WUlJWjcwZ1Z2Q0EzcVJWNVUzcFUyT1FndzJMY0pIbk5UT2lxNlpGRkYtWWc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey there, please send an email to thescoreapp@thescore.com and we'll have this ad removed ASAP. - AW",
            "date": "October 10, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Kerrie O'Keefe",
        "comment": "Please fix MLB before regular season! It's not updating, not showing balls, stikes, and outs or on base. It would also be nice to see balls, strikes, outs, and on base on the scores page. Thanks in advance.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRkUxS2tqUkpBX3RnVnZiZ2FsdTVoQ25EN2NqM3dUWmNFQUZURjRHTy00SWd4TE5ac2oyRElKVmlDNUQ2UF9YdWFxT0VIMHh0SjhLZHprWVE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Kerrie - Unfortunately, our spring training coverage is not as comprehensive as our regular season offering. Once the regular season starts we will be able to provide full coverage again. We apologize for the inconvenience. - AW",
            "date": "February 25, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Andrea D'Souza",
        "comment": "For Android, how do you add a team's entire schedule to your phone's calendar?",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRi1WeVlMSnZyLUxaVjZGdDc0Q0hfbFBLTDlqN2h1dUpvUXdveHRzc0lFbEotaWVCRk5CWXF0ZnUyTVVrUF9HUktzdVV3S2ZkMFo0aUNXaVE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Andrea, unfortunately, we do not have this feature on Android however I'll pass along your request for this to our product development team for review. - AW",
            "date": "February 25, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Connor Berry",
        "comment": "Could you please increase your coverage of the USWNT?",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPR2NUTkd1N25LUkktYWxhTW8zVHotdUcwTTNDbmJ3a3pPUkdGaF9UUUVMbURrQTFlNEhiQXRqTnJ5UzFwTE5STUZZZHhRTUVmaXdZVlBjWlE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Connor - Unfortunately, we're not able to cover Women's International Soccer full-time on the app because of data limitations. However, you'll be able to follow the U.S. Women's National team during major events such as the Olympics and World Cup. - AW",
            "date": "February 26, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Wil Bolden",
        "comment": "Great for keeping up with or tracking up to the minute action!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPR09oLV9oWUZIOVQ1VkVKVWJBanlMZ05UcEFwWWVNZ1FEV1BFOElRMzVWUDNSTkROdTRKbmVkdHhIcUVrMHpHTjd0MlJhWWNYTkZPSXZvUmc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Wil, thanks for the review! - AW",
            "date": "March 4, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Isaac Smith Jr.",
        "comment": "Great app for scores and previous game info.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPSFhrRGZ2ckNPbTlsVzlicHZaMGpaRE9icldoOTN5dG1pemRUdFV2N3BzanNsQzN1dEk2VnhoRWVxNmZHbnhfT2ZiOGtqUklBQVhVeEtJdGc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Isaac, thanks for the kind review! Let us know what we can do to make it a five-star app for you! - AW",
            "date": "February 26, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jordan Stephens",
        "comment": "Great app!",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPR001U0RYNU9CTWxTMVdiVTRKQ1kwbDdaSkpDRUlPNHJDbmo0a1ZnSEtNZWw1a1U5TnR0WEVWa3gtQ2F1dmFPS1VPd21UNHdSaXlIYTdGX3c",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Jordan, thanks for using theScore! - AW",
            "date": "February 24, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alan Borlaug",
        "comment": "I love it for quick score reviews!",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRTVVdUJBRGdIZTBoQVpSa0h1SGoxYl92SHFvc1BPNmh0Z2dDNGhrdGVjTzVJdEpPVDl1TDFYREpobFp6eFhhc3NKRWZDanp3MGpEVnV1bXc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Alan, thanks for using theScore! - AW",
            "date": "February 25, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Shamsudeen Oduola",
        "comment": "Cool",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPSFI1cE1mdE42OVNPenRkSGxjVG1rSzQ1ZmgzbjM1TTRPdkdsRGVjT0lHRUdtRXRwSVZOSVlNUGQyang1ejhwT1BWSi1yeVYwemszdHA2OEE",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hey Shamsudeen, thanks for using theScore! - AW",
            "date": "March 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ryan Balter",
        "comment": "This app was my favorite but hasn't worked on my S8 for over two weeks. I've uninstalled and installed it more than five times now and have checked all my permission settings on my phone, but I still can't get the app to work. Im just stuck on the opening Score logo page for minutes. Please fix this bug!",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.fivemobile.thescore&reviewId=Z3A6QU9xcFRPRVZKelZveFF0b01VdmNReDBtRmhvOGJUYXg2WjZwOUk5ZERqVEtWSkhwNzl0SGNyai1aTXFidTZrSG9GdVVfbDM0eGo5aS1VS1lGMEl3Smc",
        "reply": {
            "author": "theScore, Inc.",
            "content": "Hi Ryan - Please send us an email to thescoreapp@thescore.com and we'll take a look into this. - RH",
            "date": "February 22, 2018"
        },
        "star": 1,
        "title": null
    }
]