[
    {
        "author": "matchamaki mochi",
        "comment": "I had to change my positive review of the app I left last year. I am experiencing the same issues one of the reviewers here, I believe Subhankar Ghosh has. The app is paired with the band, it seems to be working, but nothing shows. None of my steps! Can you please explain why this is happening? Is UP not providing support anymore?",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSFQxUWZHVjUzZXpDZ2tDZl9SN2N2b0k0ZUdJcGJ1MEtPTGhrOTN0cGpJc3lwMVd2Z09VTWJTRW9YT0pjR1dZOTg0Q1VwQ1MxNzJ1TnNBZGc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Karin kritzelkatze",
        "comment": "Very motivating app and great all-in-one tracker, especially when paired with a wristband tracker (UP3).   Only 4 stars because food tracking can be cumbersome and tech support seems to focus on tracking devices. (While the FAQ is great and thorough, I'm not sure whether contacting support about further issues with the app is appreciated - \"UP App\" is a subcategory of the tracking devices on the contact form, and I got a kinda canned response to a bug report).",
        "date": "October 18, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRXBRZk4yOEtBSEN6bG1zX3A0TU5YakVOb1ZHeFZENlM2VC1RWXZ0X3BrMDBIcVp4WDdWNmQydVk2cGJyek1MN2o2M3RZYzg2VzRKTU9pY2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Elaine Minty",
        "comment": "I love UP its not a watch, I have one of those.  Its not huge, good for wearing at work. It has a great app with lots of features.  My UP2 strap eventually broke so I've glued it to a latex wristband and it's still working fine.  Not had any sync issues with my android phone for months.  I'll continue to use UP as long as I can.  Thanks guys.",
        "date": "October 19, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRzg3SnlHU29vdDlmUi1icWw3SmczdWN3SGowZ2RSV2lrTzY0X1psZURQaXJyQm1NZWhkbXFuUE4tTGtBZV80N1ZrbFdEMzVDdUxUaUREeVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Christina Reimers",
        "comment": "My up app was working just fine on the 25th as with everyone else on here. Yesterday just quit co nting steps and heart rate. Today it only recorded steps till about 11 and not all steps (says i have only done 653 steps wrong) and no heart rate. It's such a pain I have re-sync band twice and uninstalled and reinstalled app a few times and still nothing. Please fix problems!!",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSC0wUnozSFo0VWJKRmp5Q19Vc0RQQnd0VGpZekw0dnlJQlpIaHRpcUx2VHJoR016MGhZaC1xVUpNTlVPYTdjaVhUVmQwa0dxUmZWZFZkZGc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Elaine Scheller",
        "comment": "I used to love this app. I could drill down on sleep etc and add notes. I use this for medical tracking. I loved it. At some point after an update, I can no longer drill down on anything or add notes. I have an up3 and a Droid Moto z. No support response from UP at all. What little I got was worthless. I followed all online suggestions repeatedly with no positive effect. Now my app, my band and my tracking are of no use to me. Looking at a replacement. I hope you have better luck.",
        "date": "November 16, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPR1VwTThTQ2QyT2I5VlJpbE1wS0J1cFpsQUc5aTFKNzRqREptN0pjT0hCXzEzci1scXBFU1lRbng2QjdYdG5PQkRhNm5CT2t3dm45SGlBVlE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Subhankar Ghosh",
        "comment": "The App is not showing any data since today morning. It's showing as 'syncing data' or 'crunching numbers' as usual, but not the readings. The internet connection is ok. The band is also fully charged and paired with my OnePlus 5 device. Haven't faced this issue since the last 6 months of usage. Can you help?",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSFZ1S2RGX3VTclUtTEQ4LWNtSHZ4TUMtM3VxZTBYNzNVSE5hUXlkZ204dnpTLS02R043NlQwQTBMZkRWdTc2ZV9ZU0NIcGJnZ0t2blc4aUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Amara MacLeod",
        "comment": "Suddenly not recording my or my roommates steps. Re-paired, no live... ALSO The app needs to allow the user to manually correct information. I can not always wear the device. It gives erroneous sleep information. When it's on the night stand AND put into sleep mode. The band's data to the app supercedes mine. Also is reading my nightstand's BPM apparently. Needs a \"not wearing band\" feature. Desperately.",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPR0ZVdGpGRDE3V0tibU9RbjU4b19nOFF0WXJkTy1hUFp1TWhvMWpULU9sSVV2UVlpUURVcGtIN0R2NUZrdWJKV1dCbHk5bUZ0eXc2U01veGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "jacqui leonard",
        "comment": "The Up bracelet has broken and Jawbone will not talk to me. Bracelet was charging today and showed I had done a 3rd of my recommended steps when I wasn't even wearing it! That's the easiest exercise I've ever done!! Not recommended. Sleep part of app is good though.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSEtyLU9BNjRsbEtDRHF4d09RdmhpZkhQbTdmOTdsTE03NEZmSmNuMFhLdmlocVlGVWczRVB6X0xoeHpWLURVdWtZc3czRDI0R3VLcmF3ZFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Georgie O",
        "comment": "I love the UP and the things it does. I love how it tries to keep up with sleep, and how it does blood pressure and different things.  However, the way it connects to the wrist is not the best strategy. I lost it July 28th (it come off my wrist)  and found it yesterday Dec. 24th. Please come up with a more secure way to fasten the UP to wrist. Great job!",
        "date": "December 25, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRk0tVUhkTUY5ZmpvcXZkT3VKaW1kVjNFNS05cVRhQkZjWlM0VEpmc3k1bnM4ZVppWllkMG5vX0Fua29tWkZNYVBqblZleWtCS3FWZDduWkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kamal Morin",
        "comment": "Had up3 almost 1 year.  It's just began malfunctioning and I don't know what to make of it. It's paired with app and my phone.  Tells me connected and syncs many times during the day. The problem is that it displays no results, heart rate, steps or sleep. I had to force it to sleep mode to get those results.  I've done a soft reset, force stopped the app and rebooted my phone but still change. Might have to pay for a fitbit.",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSGpuMkFvcmQtYzB4VE5SdHdnS3RYU1pnTUpnZmttVVVJdmtqdjJRTGs2OUxIaDluYkc2Z0liWDNnNnVzS3cyN1hwWlVFVXRFeDY3V3dNdnc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Marie Bates",
        "comment": "I am very disillusioned with this product.  I have had two UP2 bands since August the first one was returned as would not work.  Second one arrived this week and whilst been able to pair does not sync.  Jawbone have been useless in assisting and would not recommend this product to anybody.",
        "date": "November 3, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRUJxRXlwR2E4VFYzaDJVV1VPMVhBdTVjc3hSb2JHYWNHTmVGUWpVQjZwR2ViWG4weHRxcmhSdnBqYjM1VFhRQ3dDU3gyQkpxc0VkS0NkZWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Edward Reedy",
        "comment": "I have been using UP in one form or another for about three years.  I have seen significant improvements in the software, firmware, and hardware.  It's unfortunate that Jawbone is discontinuing hardware development, but assures that software updates will continue.  As others have stated, there is no continuous HR feature.  I only use the sleep and activity trackers in the app.  If I was trying to lose weight, I would use the calorie portion as well.  The app is a great motivator for me and I use it daily.",
        "date": "November 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSHV6UGlHY3I0U28ycWtrTmRrRFBQejh6WW5VQ2x3ZXVRblVIUDA3cnh2NktuYWJkMmMwb2wyRHUtZUNIQTVfbTVxU0pLRnc3cTNSVGJVemc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Douglas Sutton",
        "comment": "the band is small doesn't feel the need to flash or duplicate my watch. I am not a high performance person. the band keeps track of how I'm moved throughout the day and how I've slept so I can make adjustments. I pair it with 'Myfitnesspal'.  of you want a tracker that doesn't look like a computer strapped to your wrist this is a good choice. Previously support was by phone, instantaneous and great. now it is only by email.  good but not as great, hence resting of 4 instead of 5.",
        "date": "October 18, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRlM0T0N3N1FqQmU2LUl5M1pYSVFYR1dJdDJVOW1qbzBBdE9abXl0MVEyNUdCSnc2ekZNOEV5TFNYZkRGV2VpZ1pMSW51amZ1eW5INS1qQVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Meaghan Powell",
        "comment": "The app is ok, would be helpful to request a heart rate check at any time, not just when it decides to. The band itself is very frustrating, almost lost it the first day I had it. Constantly came off.until I used pliers to adjust the closure, now it only comes off occasionally.",
        "date": "October 21, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSHNVN2c0ZjBfREs5cGJHWk1hNE5rZlBCa056ejVSQ3haOW4xZkNpMmRKVVhzUTU1aXNVMkJUQ2lsRGRvRTYzdTdHd3NXTk1mVk9wSWY0Zmc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Joey Leigh",
        "comment": "I actually really like the band.  The features are what I wanted.  It's small and sleek.  My son bought his first and 3 months later it wouldn't sync.  He did everything recommended.  No luck.  Contacted support.  Phoned . Emailed. No response.  Finally Amazon came through and reimbursed him.  He purchased a different band and I still have my Up3.  9 months later he finally wss contacted about the problem.  9 months later😥  you call that support.  I know I will eventually buy a different band.  But I will miss the smart coach feature alot...",
        "date": "November 1, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSDYyMTZUaDBacE5OZGNWdzlNcEF2a2ZrNVRBOGFPNDNhcHIzeUxfdld0RGZZZnRHQ3puRDJPQ05PTnhQLVhWX2JPbUhxSHJHU29vOENPY2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Alex Perry",
        "comment": "I do really like this app, however, in terms of tracking sleep patterns which is the sole resion I bought my Up device I am disappointed. I need to be able to easily view the history to find a pattern. It did let you look back but it is cumbersome and doesn't function well.",
        "date": "November 19, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPR24xVGNGLVUtei1lVlJtdlhWRnlpOFhVcC14N1BzZTdkQUEzSGgyMDE4WVBCYU9aTnBMVkJOVUZDMWYxWlZvM3dlS0JVTjlaNWhDaTNvS3c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "George Hibbert",
        "comment": "As with a few of the other negative reviews here, the app is failing to report steps and sleep levels despite being synced.  Band is paired with my smart phone and syncs and \"crunches the numbers\" but doesn't report on the summary. Come on Jawbone, get it sorted out!!!!",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSHhnRVFyRHprQ05ISzMzdVg1VG5HYXM4dGZINFBjdjMzNy1iNW5YcWZWc0dYTkloQm1qSXV2M3dyaEFha2Q4X05JWFgwbm44dzBqd1ZzSUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Michelle Tolmay",
        "comment": "So disappointed, bought the up3 as a birthday present to myself at the end of September. It worked perfectly until the October update and now it no longer logs my steps. Not even had it a month, please can we get the app for android fixed",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRlMwNkMzQ0N0Z25MUVo2bUZDemxLSWNuODg5aUVvNXAtUzVuME0xMmFHSG5iR1RQSzdrY1Y5alN4dVRQZ0lBbW80ZXVyQUNkVDlqSU51eUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Lindsay Donaldson",
        "comment": "It's been great up to now but for the last two days, the app will sync with the device but will not display my step progress. It displays sleep but not steps. This is very frustrating. I have tried all of the trouble shooting steps.",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPR0ROelNIM0ljeml4T3lqdlZJX215dEdoMW1RNEY0LVhCSW01bE1QMlBwS3Y5cGNheF8tMlNPYnUxM3RCLU5ybUdCb19WcXFXOXVXN2dfWXc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "natalie loera",
        "comment": "the one thing i feel is lacking in this app is that i cannot replicate meals.  i make a lot of things at home and i have to manually enter all the ingredients.  I wish there was a way to \"copy\" all the food i entered for the next time i ate the same thing.",
        "date": "November 21, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRjBNbHZHZTNyYVIzZnlWaThkQmd5UlNqQTBIWUxkMjlWZ3FoZ0FMUmRha1ZLLUpETENDMTEyY0VnQ294T0V3Smhkckhja3QxaU5DeFNBMnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Matt Torres",
        "comment": "Given the jawbone went into liquidation during the summer was surprised the servers has been kept running. But now it's stopped working! Please fix or tell us that it's the end of the road so I can get on with my life, please 😥😱😱😵",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRkdrRXpiTkh0U2F0ejR0d2hiZ09RY1kyd1FTeFlUcDhEYkhGb0g5dWREdVV5TzlSMEp6ZjI5dUlVbVNPNzRzTFhyUndnVWJtTW9YbUh2YUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Heather Morgan",
        "comment": "I can't get my up3 to even work. It can't find the band. Have done all the trouble shooting tips they have. I got nothing and my pocket is lighter too, I went to the store to get help only to leave in tears. Things aren't built to last anymore. Great app just bad equipment problems I think.",
        "date": "October 15, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRm1UcTJIemwwcmdqaU5oLUNHdklUNUVSd3B1V3ZaZ2JrWTNqcDVxMlp2TXpZMEZSUHRpRE9hTmx5QWRwbTJBTHNTNW9LQm9xdzNHWHRpZXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kimberly Stotler",
        "comment": "Great for the price. I just wish it had a time display. It tracks sleep including rem, deep, & light. Works perfect for that. Also tracks steps. The tips can be annoying. They are supposed to be encouraging. Some i find useful but most are not. Maybe they are better for others.",
        "date": "October 31, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSEJycmRJYzZ0MU01S1FIY0dYSVBBTHhWSlZodDVHZ3l6N0lyT01VWDdJVnV2Q2N3MXFfTi1fQ0kzdTJPVnZtSy1TQ0xkVksyTE51akFJSXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Nicholas Choo",
        "comment": "Avoid products made by this company like the plague. Pray hard that they do not decide to phase out your device because they will disable and remove the app from the store leaving you with a useless product.  That's what they did with their Bluetooth ranges that costs hundred over dollars and leaving you with a piece of plastic!",
        "date": "January 7, 2018",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSG9QUEIta3FQeWxocEE0bGU2dmlTbks3bkE5R2hXWUxTQ2lFR0ZFd2ZMdkhkbFpxT2U4U1RfMmpJdHlXMF8wZXl5ODhReElvRjRaekFEakE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Between this and the Misfit, I prefer it greatly. The food tracking could be better worded/categorized and updated, but the activity and sleep tracking is great. I'm not sure how accurate the heart rate monitor is, but the trends on my graphs DO make sense.",
        "date": "October 25, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRmJ0aFlERTRYdWpvay13OEx5V1U0RXdsenRPdHZPa2NadHU0MTRESGxUQnBwWTRGc2ZpVlh4ZTFtWnhMel9aYWNEdGRXMTNmRjA5UVg0akE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Theresa M",
        "comment": "Since October 25 neither my UP2 not my hubby's UP3 have tracked steps. Support claims it isn't a software or server issue but I don't believe them since others are having the same problems. Not likely that all of our bands just happened to have the same problem at the same time and it not be an issue at their end.",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRW04SG5iOTJmZVplSHVjZ2FwcVF5Nll3ZjNkbmNqSlBkeU83LUxsZXMxclV5d3hrbF84WW1NUEhUQUhTZmdWS2FSX0RCUmxOYXQxdXYya2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Swaminathan R",
        "comment": "I have used many fitness app such as fitbit, Microsoft health, Google fit, Nokia fitness app, Samsung health but nothing could really better this UP app. It is sad to know that  jawbone closed its fitness band but UP3 band is still advanced for sleep analysis.  The UP app gives insight based on our activity.  It will gives motivational words, ask us to take water if resting heart rate is down, keeps us informed about drawback in the exercise we do and provides alternative.  This is definitely a milestone app that was underrated. It uses very good machine learning..",
        "date": "October 21, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRnIycDNnRW1pM2Q4MW9IM01VV3BZNEVkSkR5ZzF4dHNWUFRTSmx6OFB4NkEzOEIxeDRQdjZaNktUR3U0YXNlaTY3OVR1Ym1sUnRnVWxCUnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "lorna hancox",
        "comment": "Good app when used with up3 fitness tracker. Very good for sleep tracking and step counter. Food diary log isn't so good so have gave up using that part of it but doesn't matter too much. Mainly a good app that works well",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSF9tV2Joa2JEUE9rU3Ryb0w0Qk5Gek0tN29lSUVyMlVlZG5EUTM3SXhBSEVlMDRES1Q1QWlteld5VjhpZ0ttdFRaZ282ekVCeXB5X3VuekE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Elaine Holland",
        "comment": "Like others, I haven't been able to get my step count or sleep tracking. It says it is syncing, then crunching the numbers but no data is shown. Very frustrating",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRkprOWt5ZGhxQ283MkR4eTBFU01aem5aaXplcXUtUHA2RUtHVWNkQ2ZaTTdVN0Q2Z3VBMjEwUDVkeTZ5N19OMllVejY2S0RPLVEzM3NVV0E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Cairrean",
        "comment": "My Up2 wouldn't sync, wouldn't update, and wouldn't record anything. It also says that the band is fully charged, and when I did manage to sync it the app said it was only at half. None of the online guides have been of any real help. It's not worth the hassle.",
        "date": "December 26, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPR0pIM0w0NG84WHhjdk9YcjdKMnNvdmMzaUhkWHFkZVZqblluRVdVRnQ4UEthSklLS3k5U3pxX08tOXJOelUxSGxPSTlrVjk2ckdXMk5oOVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Tracie Allison",
        "comment": "Tracks with healthy wage step challenges, otherwise is not something I would ever use.  Samsung step counter more effective and is data dump for this app.  So not a great start, using another app to work.  Sometimes really stupid comments given as coaching.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRk1EdktvQWhYcVo4NUo3ZU5KT0FkdzRhOUVuY0JHemVuRFRObHphdkxycHY0OXVxNGdqbnRqN28xSVd3eG8ySEh2N1RrU3l0Sl9OeG9HZnc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Petra Zelenak",
        "comment": "As many here I am having the same issue as of 25/10. Steps are not getting synced even tho the process is said to be completed. Sleep has to be verified as well otherwise it doesn't show the data. Please fix this. Not just one person has this issue. We can't have like dozen of people from around the world have the same issues from the same day. It is general issue, a customer support should help their customers!",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRTBqd0o3dEZvSEVuSmM2WTBjSDZhb3pEa0tNc3pINmFLellKbm5qejZ0LU5FbUNLREFEcXFVeHZMUGJiQm9ZZXVkdjU3bHllWUszZExPLVE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Brian Hawkins",
        "comment": "Slow to connect. Sleep tracking is the only reason to own one of these up devices. For basic fitness go elsewhere this product is a waste of money. It tracks steps while driving so you'll never know anywhere near your actual results. That was over a year ago and they still have not updated that.",
        "date": "October 25, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRnpIY2EyYnFRS3JncmJKdWhtNEdKbGJYQ21tVHFOc0V4eU1qQ3NQVkM1MDAxek0xWVVZREJzbW0wQmRBN09taTRkeU1INXhfNmlBeTFaSEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Betty Ormesher",
        "comment": "It has not worked correctly for 4 months or more.  Loses bluetooth pairing and heck to get connected again.  Will never buy another up band",
        "date": "December 23, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPR0tKWG9hcTU2REtaSGxZb2ZvcXN0YWFhMzJ1MEFQWDBfVDdpcDRSOGxvM3RVYVphTGdIa1RmZnBqc0RTeGpUTUtNX2otd3VpQXRxeVhtMmc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Maje Graybill",
        "comment": "The best sleeping details. The rest is a good average step tracker. Food tracking is not a easy as myfitness pal. The smart coach is lame and can be annoying.  The best part is the silent alarms on the wrist band. Really the only reason I haven't moved on.",
        "date": "November 10, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRnVORXJueDZHQ3dSZGhZMThaRzVWbmRnNE5Eb3EwOHJlZzlsQjNaak5zQmxuMm1nMHROMHlzVVlmUFM5cmxuTWVvM1Vib212ck9tNXNyM2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Misty Shelton",
        "comment": "Been using UP bands since 2013 with very few issues. Nice to see the app is syncing again! And I don't think I lost any data while it was down.  Thanks to whoever fixed the app!!! Nice to know someone is still out there for us!",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRmdxZWhnX3BPNXhIdU5kdHRLckZGTktEZ1B2cjZYVmlsTmdGOXJ2bWVOOUxEX2c4cXNoOFd0QnlNM2lFRWw0M1ZuSzUtbk44di1hbjFKWVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "D.L. Horton",
        "comment": "Continual problems with the band, sleep tracking is frequently wrong (I would know if I got up for an hour! Band seems to run down more quickly than anticipated. Because of problems, wanted to completely wipe and restart, could never accomplish.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPSHZxRlUxN0hFVHpHNnM1YV85THJuRFNZZ2Y1YmItLWtyR2o1T2VJSUZCWEhQaVJLd19wUENvRDVsc3dYRDdVcEIzY0YyamF2WlhkLVNTZmc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Afroz Ahmed",
        "comment": "Changed my rating to a 2. I have a Hauwei talkband and everything is synced up to UP but none of my steps or workouts reflects. When I disconnect and reconnect it again, it will work for a few days but only if I open the app - after a few days nothing! Why isnt it syncing properly? Why cant it automatically update my steps very day with me having to open the app. Very annoying and seriously considering uninstalling.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPR2pHMFhCdmVKWWxCQzBEaC1IekIwRnNwTGtxWl9jYzJwYTFOcGw0ajFXSnE0M0NKTGtNRHhma0N2OXVNWGFTbkU3TDhFSjBWQ2RRX0ZUZmc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "The band itself is a pain in the butt. And I have had it for just over a year and the non replaceable battery is only lasting a few days max now. The app has changed a bit too. Not necessarily in a good way. When I replace, not sure I'll be going the Jawbone route unless they have miracle replacement.",
        "date": "October 19, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPR0dLMXFZZW8zYVhSN2duU1RhX0JXR3pDQWctVkt4VDJ3ZE1XbDlXRDJpcWVSSldadG9QckxrRV9pcERlQk5TQVhhQ2FVNVZ2MmJub05fY1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Andrea Metz",
        "comment": "I used to love my Jawbone and the Up app until this year. Earlier in the year I wasn't able to update the app. I followed the instructions and after about a week was finally able to get it working again. Now here I am again only now it has been over a week and it's still not working. And the app keeps not responding and closing. So frustrating. Might be time to switch to another brand.",
        "date": "December 28, 2017",
        "permlink": "/store/apps/details?id=com.jawbone.upopen&reviewId=Z3A6QU9xcFRPRWxVT0JNLTFQRDhWbEhsTTJGcXVRR3FJQy0xMjBrQjFVekZNMzFxZkRUSDBaNjh5bGxtSE5iZVhrcmROOFFNSDhLYXdqVmxESlV0am5BdlE",
        "reply": null,
        "star": 1,
        "title": null
    }
]