[
    {
        "author": "Alexandra Overwick",
        "comment": "Not even 2 days into it and already can sleep easliy. I usually have my light on full blast on my phone, and have troubles sleeping. This automatically removes that light based on the time of day and helps me sleep much easier. Heck on the first night of use I had an enjoyable dream which may be a coincidence but Holy. Cow. Awesome sleep. Helped me wake up energized and fall asleep easily. I recommend it. Ye.",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSF85VGRaRHBSNVdMYjVkQWtPQm45bzRjck45b0hZWUhKeWFvR2hMamhwajFKWnJpeTlXckNVbGdhemxPNjF2QVBLb0VQTXVVVGdENjBSbTJz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Olympia Russell",
        "comment": "This app actually does what it says it will do. I've been experiencing a much more restful nights sleep. The only complaint I have, is that the navigation bar on my phone isn't covered. I have a Droid Turbo 2. Other than that, I'm quite happy with this app and I have definitely felt the difference when reading late at night. I have less headaches and wake up feeling more alive than I did perviously. Fantastic app and I recommend it for everyone!",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRjBjWE0xbmJ3aGRCVnpoT2h4VFZ4SW1IZU44R3JyclF4c0VDTVVZWlEyZ2k2aXhBaGJtODdvMmpNbG1oaUFzbC1JUHRjQk0wc2h6VEUzdGd3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tim Hammer",
        "comment": "My phone was making it take longer to fall asleep at night, even on a low brightness. But with using this apps settings of 1000k relaxing, intensity 50%, and screen dim 30%; I've noticed a huge difference. I wish I had started using this sooner! We need sleep, and this app actually helps with that (if you usually use your phone at night)",
        "date": "December 31, 2017",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRlpUNW9GNjZGazlyMkNZU1dXcE5lUFFKTDVCMzF1U0ozZThnOWkzUEw2TDRHcHAyMkNmSFNwcGlCTFJXYmJaMmF2ZmR2NjNWT18tU2gzQWVr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Vipul Sinha",
        "comment": "Gave it 5 stars BUT there is a major problem.... Screen Sharpness reduces significantly as long as it's on.. I hope devs would look into it.. Sharpness reduction is not much noticeable untill you start any FPS game.. In FPS games you need high sharpness for higher accuracy.. I have to turn it off during any FPS run.. Other games aren't much affected from this..",
        "date": "December 27, 2017",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRXFTS29wNGItVkxxZ2hYNWdpOFRsSzctbzFvclc2WkxHbEdwQzR2Y3BMQXNGZHRNMU9KemtnbHl1aXZSVzRxN2Z2TE5UdjNlREJoUXhzNDU4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nicole Rachelle",
        "comment": "This is the best app for screen dimming on Android. You can set a custom schedule if you work a late shift so it won't dim until 2am or 3am.  But the one thing that would make it better, to leave the blacks as dark as possible without reducing the contrast by making black kinds of red, is not something any app on Android can do. Not sure why, but it's a disadvantage of the Android platform.   Twilight does night mode better than any other app I've found, so it's what I'm sticking with.",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRkNkQU1tdklrMjFtd3lCcElXNjg1T0QyNHRrT1BGRHZQdEFxd0VkQVk1YWgzTUdjazJxWnQ1ZUJVeWZMNmZVNVNORC12MkJ1NkRXRWZpLVRJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "OffYour Shelf",
        "comment": "I thought I'd try this out after reading an article about how evil blue light was robbing us of sleep. It's been a few months and I'm sleeping better than ever. Thank you, Twilight! Also, it's neat that it can be set to turn on according to local sunrise/sunset times. Very helpful.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPR3NrTm5GS3pQZ2YxTXkxRjk0c1pVTl9lRFJtWmJ6RXBqSXJYMWpwbU9JV0JBbnQtSTZqNzZDa3Vqc2lCTzA5SGFJMWNGMFRITlp2NlNkajQ0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Steve Soldwedel",
        "comment": "I'm grateful for this app, but since the Android 8 update, it doesn't overlay the notifications on my lock screen, nor on the pull-down menu. As a result, I'm bombarded with blue light. The only way to avoid that is to not look at my lock screen or my pull-down menu, which is nearly impossible. It would be great if the overlay could be fixed to be on top of everything.",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRTkxYVV2QmlibkpnbjhJTlFSZW1GTHA3ZTIzOWtWZ1k0cFNBbEhhN3FISk5UN3ZMNFViS2NXeGMtZDdkQXVTcmc2SFVWMlZZcE9jZXdKTXI0",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Hello, it seems Google has intentionally disabled overlay apps to draw over the lockscreen and notification shades in Android O. There does not seem to be a fix for this. See here for details.. https://goo.gl/S4vZHG  For details on this and other Oreo compatibility issues please contact twilightinfo254@gmail.com",
            "date": "February 3, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sebastian Lüthi",
        "comment": "It does what it promises. Simple and efficient. Would not know what more you could need. I use F.lux on desktop and this app offers you a pretty similar experience. You have to stop it to do some security setings as it interferes with all apps while it's active. Good quicksettings from the top bar.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPR2VONWxwNDdhNUh4U0xocmFvXzRfaHFNT29NMDFJYUdrR21leW1wVGdoU3FGNWRaNGpnQ2lHOG1WVjBpQUxfMjRCNFV0d2M2Qi1oUjYtRHJn",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your valuable feedback. We are unfortunately unable to react to all of the reviews on Google Play Store. To resolve any issues with the app, it is best to contact us on our support email: twilightinfo254@gmail.com or to give us more details, use menu-report a bug. Many thanks. Petr from Urbandroid Team.",
            "date": "February 15, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I love this app and have used it for years. Recently I got a new phone, the Huawei gr3, and now I am having issues. The app dose not stay on once the screen times out. When I unlock my screen, it gets paused and I return to a brightness I was not prepared for. I then have to go and turn it back on. This is really disappointing since this app until now has been flawless and is my most used app on my phone. Reading at night is just not the same without it. Hoping for a fix to this issue in an upcoming update.  EDIT: Developer was very helpful and this issue was resolved by accessing my phone settings and changing the lock permission of this app!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSEt3a01MdGttWVR0T2JscEtNSDkzM3MtcWdTRjc3VWloNnhFdm9NTTh4dndKc3oza1VxQllhS3pTQThvSzJ3Y25BZ2JYd2Yxc1dRZG1ISWZR",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Hello,I see you have a Huawei device which is problematic.For better performance you may need to enable [Phone Manager-Notification Manager-Dropzones],also please do [Settings-Power saving-Protected apps-twilight-Protects being switched off].For details please contact twilightinfo254@gmail.com",
            "date": "March 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Amber Markwart",
        "comment": "Love the app! Really helps! Also love the notification. Makes it so easy to turn on and off. My only problem is it keeps turning my background on my home screen tinted red. It goes away when I change the image but then it turns red again as soon as the filter is on and stays that way even after it is off. Really hope you can fix this please!",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRTFhZWcwWkJ3RlQwaUJHLXJPRF9DMk8wcWdOYVNVcEFSbWpRLTZVTWJTRUVDRXNoQ1pEbGJIZ1NZWmdjeUdTWVRubEFuNUhPbUotTUpibzRn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rachel L",
        "comment": "I've used this for years and loved it, but it's not compatible with my new phone the Pixel 2. It's not dimming my phone screen consistently. It doesn't dim the app icons as well as it does my background. My background will be pitch black at 4AM and the app icons will be almost normally lit - this is especially true of the scroll down menu: bright white.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSGxWdmE2blg4ZGgyb05pT3lFd0xzSHhwM2RhMm1JbTI4X202VG1DZ01zY0U5NDhXRkNWelZLTEhPYUM5LTZhUm1UUExXZTh1LXBKNVJPTEVR",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your valuable feedback. We are unfortunately unable to react to all of the reviews on Google Play Store. To resolve any issues with the app, it is best to contact us on our support email: twilightinfo254@gmail.com or to give us more details, use menu-report a bug. Many thanks. Petr from Urbandroid Team.",
            "date": "February 8, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jamie Cassetta",
        "comment": "It's not difficult to use at ALL. Infinite settings: all shades of red, screen dimming, red temperature. Is there a migraine setting? I wish there was so I could wake up, press a button and not have to squint at the bright screen before finding the right setting. I'd give it the five stars for THAT.",
        "date": "December 26, 2017",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRUtnRDZiX2RwOHdoOUc3cUZHaDhFQlo0MzZDNVdmbldkOGhac211aHd0cGVMUGl6NXZIcjZRREZ0NkhGcTcxZndoOWNhMzIxSGk1dzRLcU8w",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your valuable feedback. We are unfortunately unable to react to all of the reviews on Google Play Store. To resolve any issues with the app, it is best to contact us on our support email: twilightinfo254@gmail.com or to give us more details, use menu-report a bug. Many thanks. Petr from Urbandroid Team.",
            "date": "December 26, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Britt Stupfel",
        "comment": "This app is fantastic for getting better sleep. There are a great many features that they developers could charge for, but they don't. It asks for a lot of permissions because of its control over your screen, so you have to have faith the devs aren't data mining anything.",
        "date": "December 22, 2017",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRTM4SzJ2ZVltQmNYcGEyZ09tQWhVM0FtZUdjMlVSSldjZXRZcHAxSTFiTUhtdFFmYnpDRFZPNGUxSnhiUGJKV0QwdXZZdFFndlFiX3FuZlBV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Julia Pace",
        "comment": "The only problem is this app eats up my battery. My battery discharges twice as fast as it used to, even during the day when the blue light filter is off. However, it has had a positive impact on my sleep habits and my eyes. I like the user interface a lot. I tried a couple of blue light filtering apps and settled on this one.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSDlqQXhfbDk0d2ZaZHo2TGJObGhjUVZEX2NIbUd5TlI3UWRIczlRQW9UMG9VcWpWMFZxZXNXQTZzUVpKbzRDM1RJU0VZSkhGdUMwXzBGMTZV",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Hello, the effect on battery should really be minimal. Do you see Twilight in [Settings-Battery-Stats] as one of the consumers? The app does consume very little resources, it just keeps the filter applied.For details,please contact twilightinfo254@gmail.com",
            "date": "January 11, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jonathan Ventura",
        "comment": "Small and simple app that's easy to use. And it does prevent you from staying awake for too long. There is one problem, though. The filter doesn't cover the home touch buttons on my phone, which could hurt the effectiveness of the app. And some settings (like accessibility settings) could be blocked from turning on while the filter is on.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPR1BWZUFKcG9faGxoYXhOMmZTeTBac3ZhMXRHVkRIQkxzazNXZDJxMXZsNk9Td2dkaGxNcEJsYkhwZnlwLXZCV3BKRXVZbUJQLXpPRFR5MDF3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kylyn Hersack",
        "comment": "This app has a lot of features, but the free version is ALWAYS RUNNING in the background. Why do I need to pay for the version that uses good Android practices (i.e. task scheduler) to start and stop automatically (assuming that's what they're doing, of course...)? I'd rather turn it on/off myself, but even then for some reason this app still runs in the background... Also, what are the permissions used for? Other similar apps don't require access to my files. It made me a little nervous downloading your app, especially since it doesn't have ads. Oh, and thanks for the auto-reply! It really reassures me to know that you don't actually read reviews.",
        "date": "December 31, 2017",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRm5TSFJoWnkyZG15UGJWMlQ2c3V0eFBldk53VDU3RkxIQVh6cmp3dG9TUHdSVU9pTUtXdWFESWxxbW84bnFkSHhBS3JMQWpsSFZzQW5zZlUw",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your valuable feedback. We are unfortunately unable to react to all of the reviews on Google Play Store. To resolve any issues with the app, it is best to contact us on our support email: twilightinfo254@gmail.com or to give us more details, use menu-report a bug. Many thanks. Petr from Urbandroid Team.",
            "date": "December 31, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Marequiz Johnson",
        "comment": "I love it!!!  Having trouble sleeping and always on my phone.  This helps adust my eyes, and it does work to getting you to sleep.  I recommend when your screen adjusts, at whatever time you have it set at.  To play some music or white noise.  It puts me to sleep way faster.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRXpjVXBySThGOGVJNzBHMzlPSnE1SDZhM010MXFXcFU0c0NaTThGLTczUkdzcm5DRGpkVF9FRjZsbGFFVFJsLThuZUlMZWNVMmdEM0tTUHhF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lorinda Wu",
        "comment": "It used to work great. Downgraded to 3 stars now. Since the current update, it's constantly giving me problems. Random changes in intensity and filtering. Sometimes the filter doesn't work unless I manually open the app. Edit: it's on auto location; the time zone is correct. On custom schedule.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRVpiSnFsUGsySXBVUVdrN08zX0g0emZVelVIbFVwZFlNVW9tLU14b2lVRWxFM25XUWphSWFZWTBrRTBidlBrVkFyTVgxdU9CRzdPeUozV1Fz",
        "reply": {
            "author": "Urbandroid Team",
            "content": "UPDATE please contact twilightinfo254@gmail.com for details. Are you sung any battery saving settings or apps. This is usually the cause for such issues..",
            "date": "February 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Holly M.",
        "comment": "This app is amazing! It has helped my eyes so much, I love the Bed Reading profile a lot especially. Thanks for such a great app!  But unfortunately Google has ruined it with Oreo and not allowing overlays of the status bar/quick settings. Is there a way that a root mode can be added to this app to get around this so at least the folks with rooted devices can take advantage?  I hope Google does something about this but I am doubtful they will.  Thanks!",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRmRHUzBTLTBiVlFlX1N6bWZtYjVra1gtZXRJcjB4X0FSdnlFTEpCQkVQdWhfS1JXSXUzQkdaV0k2dUI2Q1lXYjlhWDREdGJGRWQ0RkNZMWF3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "naruto27emily",
        "comment": "I use my phone constantly, I used to get headaches all the time. I heard about this blue light blocker from and friend and it works amazingly! I've been using it for almost 2 years and I have very few headaches now! Thank you guys so much!",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPR3FuTk11V1lTeFlYUVNjNWFwSE5CNzdlaHhIOHM4RU1aZy1pUC03U3R1WjNUWDQ2SU1feEd0VFlIWEpOc2ZyS3NkN1RPaEJ1eXFUMmluREVn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Elijah",
        "comment": "Fantastic!  I've been using Twilight and F.lux (Mobile and PC) for about 4 years. About time I give a review out haha. It's surely allowed me to sleep easier over all of this time. On days where I am not using a device with a Blue pixel dimmer I ALWAYS find it more difficult to sleep.  Twilight has been fantastic for me.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRlRhb1p6VkVOMnFVak4wRGxWX3F2Q3dIZXJ5a1E1aEM0LXQ0bUgxZGtsUzRsR3NLVU82WHJfM19pR2pZaFg5WGJBQlpmMi13SHM5cFlhLUc4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ana Mara Munguba Vieira",
        "comment": "Really good app, aproved by my doctor even. But there is something annoying about it but I couldn't say if the problem is on my phone or the app. Everytime I install a new app it asks me to prevent Twilight from drawing over other apps. I can allow it again later, but it really is annoying.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRkI3bFUwSGd6YXFiWE42aDlqdEVxUS1CaHgxRC04bmFaWmdzaDlvZ1U1bk94SUh1aU9zNldINHRMZ1c4VkpVUS15ZnBvTHNEWVE0WE1uODlv",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Hello, this is a security restriction in Android. Some buttons cannot be covered with another view to function. Please pause Twilight, tap the button and resume.You can also enable apps exclude list to make this happen automatically.For details,please contact twilightinfo254@gmail.com",
            "date": "February 13, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Does exactly what it needs to. The persistent notification is annoying but that's an OS problem. I like that you can control it from quick tiles but the only problem is that the tile only pauses the app but doesn't stop it. I paid for the unlock in hopes that the quick tile would stop the app and the notification would go away but it doesn't. You have to manually open the app and stop it. Rather annoying. Especially because I could've done that without paying for it.",
        "date": "December 23, 2017",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSENXelJsY2FXb2FaYkJ5N0VKR09JaWJJb0hvVW5RRVFjbUszUUptcFliT2tDTEVKcS12UDI1ZDNqMmw4azUyLVBOcXRlUnhYdDRvYzRmYnF3",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your valuable feedback. We are unfortunately unable to react to all of the reviews on Google Play Store. To resolve any issues with the app, it is best to contact us on our support email: twilightinfo254@gmail.com or to give us more details, use menu-report a bug. Many thanks. Petr from Urbandroid Team.",
            "date": "December 23, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Tasha Grace",
        "comment": "Not user friendly at all! Keeps turning on at random times, even after I set a custom schedule. Once it turned on so dark I literally couldn't see my screen at all, and I was in the middle of doing something important on my phone. This could be a great app if it was just more user friendly.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPR1JtR3ZfSGlDR18tVUpvNEp0SkF0MTE4c3UwUDNBXzhXQ2JUTVViRUNwNk16VXVxTUhaN2YzcjZhLXVBcHE2ZjVJNDVVNnVrbGlMcEtONTVv",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your valuable feedback. We are unfortunately unable to react to all of the reviews on Google Play Store. To resolve any issues with the app, it is best to contact us on our support email: twilightinfo254@gmail.com or to give us more details, use menu-report a bug. Many thanks. Petr from Urbandroid Team.",
            "date": "February 8, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Allison Ross",
        "comment": "I love this app. I emailed Twilight about issues when I updated to Android 8.1.0 and received a thorough and helpful response. Oreo seems to be preventing shading the status bar and notifications but some workarounds were suggested, using Substratum's dark themes and the Andromeda plug-in.",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRmpfRndNMXJuTGtHNmpvOTlQVTA2SDg2VERsWmpTZF9qbkpBOWhTODItTTJMRjQyVEZMVThxMmplbDJMS29PRTN5R2Q1aHNab0RpWndiTGFj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Vivek Nair",
        "comment": "Been using it since years now. Helped me to sleep every night. However, ever since I upgraded to Oreo before a while, the notification bar is not getting filtered. Please fix this. I want the whole screen to be filtered like before. The notification bar's brightness is distracting and it sucks to see that small portion in actual brightness. :(",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRk42N0lQeEI0anpwTHhjRFJyYVBvNk9HbVJjemY2blFlMzhnMHdWYnBtbkJwM2VoTW5IMVRfQktWS1ZlQnByWUdVNHVLZkExVzhLblpNTDFR",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Hello, it seems Google has intentionally disabled overlay apps to draw over the lockscreen and notification shades in Android O. There does not seem to be a fix for this. See here for details.. https://goo.gl/S4vZHG  For details on this and other Oreo compatibility issues please contact twilightinfo254@gmail.com",
            "date": "January 3, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Daniel O'Brien",
        "comment": "A very good app, very customisable. I used it for 5 years on my Nexus 5, am only now uninstalling it from my pixel 2 because it doesn't work as well, especially with the pull down menu, assume this is a result of updated OS, and I just found an inbuilt function that is very similar in my settings",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSFV3RVhBd2dnV2Y3NW5oZDVVeTl4YVB3dmFhMHAwWFZNNjdSQVcyUmJkaHFGWlpCWE9wbE9lSUdPMUQxMFNUM2JwVTJXSnNBbG5GSGo4c0dJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Say Like",
        "comment": "Paid for this, so that when I'm not using it, it would NOT be running in the background, which it always DOES. So incredibly annoying. I'm not filtering my phone, so turn the goddamn app off immediately. This would be handy if it was done via the widget instead of Android telling me to force this stupid app to stop. Complete and utter bs.",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRWJ3ME0yXy11eEZ4Sk5mVTU3ZWhrRTRLbzNfQzVYeENORDlXSU1qTnlPNHZTTzhYbDBfWjl3aTRLakJkRDQtaUxkb25xenFmbVJEdDBmYTJV",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your feedback. Please send any recommendations how we could make our app better to twilightinfo254@gmail.com. We are doing very frequent updates, so many issues are quickly resolved. Thank you very much.",
            "date": "January 14, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Julen Clarke",
        "comment": "I love the app, but it makes Android crash sometimes. And even though the developer answered it was a memory leak, I've stopped using Twilight for a week and I stopped having these problems. I'm using another app now and I had no issues so far.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRzVRTlhqSGlTVUN0MjV3MThZX09TR2NOM2Voc29pamR3dDJySDc0djQwUTVDeVVJNDJrMVRncjFVekdXdDRsblBvbERtUHRUcktfZFkyQ2xZ",
        "reply": {
            "author": "Urbandroid Team",
            "content": "This is caused by memory leaks usually introduced by specific vendors or by Google in Lollipop.Memory is getting critically full and your system starts killing processes.For other processes you don't notice,but killing Twilight is immediately noticeable.There is no crash in the app itself.For details please contact twilightinfo254@gmail.com",
            "date": "February 21, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sylvie Lavictoire",
        "comment": "This app has decreased my eyestrain late at night. When my son was on concussion protocol it also helped him control headaches a little better. Using this app and red LED lights before bed do make me feel calmer before sleep. Many thanks ☺",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSHZfMEFIMjh4SG5qMDZ6VzJvUHVzdVo4Nnh4a2Rhb3BsblBYb3QwNk11ODlYRmQyUnMyLV90VzR1SmNfcWh2cHRkS3ZLRzRKaUJRaDRaNUI0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Regina W",
        "comment": "2018 update: love the home widget! It includes immediate set and pause buttons.  OLD: The notification noise is gone! Yea! 5 stars! Love how it dims better than the lowest default on my Galaxy.  OLDER: Wish it didn't make noise turning it on and off. Otherwise, great!",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPR3hKWTdVR1JSWUtXWnRBdWJzNnpRa0Y0RzBfZEdYS2kxQ1cwLTg0andtVU54Rm0wNlJBRzl6TmZ4X0tJTWw1M2w4TmduOWc3NTgtM1d6VC1n",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Great app, worth paying a couple extra bucks for transition times and stopping the app during the day. Only thing I really wish it did was apply the filter to the second screen on the LG V series (I have the V10).",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPR3JFV3hXdWszVk1EREpnYXFXV2NfRDk3R1Npb1FkYWFpOTVhdXFnUDVBaGJ3cFR4LUNxZzhQcUt0UGZHczZseHc3MVQ3ZDFzUm1hZDFZMVpv",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your valuable feedback. We are unfortunately unable to react to all of the reviews on Google Play Store. To resolve any issues with the app, it is best to contact us on our support email: twilightinfo254@gmail.com or to give us more details, use menu-report a bug. Many thanks. Petr from Urbandroid Team.",
            "date": "February 4, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "CK Three",
        "comment": "Mostly like it, except that it's buggy. I'll have the app running and screen will be dim, then suddenly the screen brightens and blinds me (after my eyes have adjusted to staring at a dim screen in the dark). Check settings and the app still shows it playing and should be dimmed. I'd buy the upgraded version if it weren't for this.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSFJ0RnhnQjYxQlNEN3JlQ0xISDNfNmk4cFZnMXNsY0hMZEZLU2FnNlBiNnhBSmNrdVhickY0aGJBQ0d0RkFJYjNxcGZNUWVydE01Z0hwRjBZ",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Hello,I see you have a Huawei device which is problematic.For better performance you may need to enable [Phone Manager-Notification Manager-Dropzones],also please do [Settings-Power saving-Protected apps-twilight-Protects being switched off].For details please contact twilightinfo254@gmail.com",
            "date": "March 3, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "chamindu Dissanayake",
        "comment": "It was a great job done by Urbandroid team. It is very good for me because I have a habit; chat with my girl friend until late night. After night, wake up on next day I get some pain in my eyes. But after, when I using this app it was taken down (Sorry for my bad English )",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPRzlZUHdxRFhydUVUVHMxQU9Fb0ZDMWdCejRFQnJTamU5eFFoYUdDRGVuZmFpcmQwWnV2UERVNktNck1GQjBscU9RNkF5YUZlTV9ZYWE4eGNj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "name name",
        "comment": "Was a 5 star app! Android 5.x seems to have issues with it filtering entire screen sometimes. The nav bar usually flashes when u put away keyboard and sometimes never filters nav bar in landscape.  On latest version too.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPR3RMUU0wN1pnX2xuLXBwYzgtV1hoUHNjS0VBTWQtOG5MOVcwd2Q5cktLUGpKWThRa2pkY0VtaURTTmlkZWptS3VIa2F6VTZPV2RRdzhiVndB",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Hello, please check that you have enabled [Settings-More-Filter translucent navbar] and [navbar in landscape].Unfortunately this is maximum what can be done on stock Android. Sorry about that.For details please contact twilightinfo254@gmail.com",
            "date": "January 29, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Sorry In Advance",
        "comment": "I got this app around a year ago, and it has made it so much easier to sleep since. There is only one problem in which the app closes down briefly sometimes, which is hard on the eyes after you're used to the filter being on, but other than that it's great!",
        "date": "January 6, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPR3VEb0NSY1JtMmRiZmNSREtic3E2czZXTVdrX3NkWXp0MGJ2WTdrTlZ2OXJDRkh0MGd5XzNKWkFnRGxieEk1MHBWWTNOdFlpd0xnMXdPQ0xj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "This app plain and simple doesn't behave. It randomly makes my screen too dim and wouldn't turn off when I hit \"stop.\" I ended up going through my application settings and I tried to \"force stop.\" Didn't work. So I uninstalled it completely. And now my screen is still this dim red color! What the hell did it do to my phone that the screen is still like this even after being uninstalled???????? I just restarted my phone and nothing changed. I'm incredibly unhappy.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSGdxbG5neXpxNmlJVkNZTUdTVGtJMHA1VHlyVWNwUmNLYTVYa2FyNWExa2k0S2dGbjVMbjhPSjR0OEZNNHZBY0ExWmdoMzRHdm5DUlNEbk1j",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Hello,maybe your location hasn't been detected to calculate your local sunset/sunrise time? Please check if 'filter times: always' does the trick, if it does, please enable location from network and the location service or set you times or location manually.For details please contact twilightinfo254@gmail.com",
            "date": "February 26, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "nikki grames",
        "comment": "I turned on the lock and home screen filters and both screens went red.  Couldn't get the filters to go away by unchecking the filters in the app. Unistalled the app,  screens are still red. Restarted phone completely, still red...TERRIBLE   Update-- had to assign new photos to home and lock screens to override what the app did when it was installed.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSEZ0SmY5X1B6YldPbm5sZjd1Y294WEs5dHVnQmZqMkpRMG5KbG5uVFdZd3VDX1RlZ1c1bEI4UUpoUkhVVjN0U2ZESjBpdDl5ci1CX2RVTEtJ",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your feedback. Please send any recommendations how we could make our app better to twilightinfo254@gmail.com. We are doing very frequent updates, so many issues are quickly resolved. Thank you very much.",
            "date": "March 1, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "jennaful _",
        "comment": "I uninstalled the app while it was running in the background. So the filter was applied on my home screen. And now, my home screen is permanently tinted orange! I tried to undo this by reinstalling the app, but it does not recognize that my screen has been altered. Rather, it treats it like a normal screen and applies another layer of filter over the current one.  Tldr; don't uninstall the app while the filter is applied.",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSHRHYTJlUS1JdENPT3JBcGdBYWlvMV9TQUZqMnpuTDFiMVl1LXBKc0Z4OEZZWWdJR000UnBnWjVHbF9maERtMEZ5WWx1UlJlX21WZUc0UHg4",
        "reply": {
            "author": "Urbandroid Team",
            "content": "Many thanks for your feedback. Please send any recommendations how we could make our app better to twilightinfo254@gmail.com. We are doing very frequent updates, so many issues are quickly resolved. Thank you very much.",
            "date": "January 22, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "kipprdy",
        "comment": "So good I came here not to review, but to find a way to donate. Great for making the screen easier on the eyes, at  night and, well, just about all the time. I leave it on all the time and just adjust with the handy sliders, always easily accessible from the top menu. Excellent job on this one. I'm off to upgrade to Pro - I don't need any of the extra features, but an app this good, regularly updated with new features (like autopauses for permissions), deserves support. Thank you to the devs for such a useful and smooth running app.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.urbandroid.lux&reviewId=Z3A6QU9xcFRPSE05SUpZTU9CZFRwUGROcV9QMVZENEk2NERPZXZxclllVGNNSjhhVGo1dmlzMm5xSFNRNnNUQVZLZFFXNnB1cjR0cTBoSFdlSTFfbHZIZENZ",
        "reply": null,
        "star": 5,
        "title": null
    }
]