[
    {
        "author": "Ashley Acevedo",
        "comment": "Doesn't always work. No I haven't. Need to get with them anyway. It worked great at first. When I had an issue y'all did a reboot or something and then it was all good. I didn't use it for a while and then tried to and that's when I started having problems. At first I thought that it could have been something my job had done, since they had done some work, but it gives me issues outside and even in the parking lot. Otherwise it's great to have, or it was.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSFdWOUNQb2VDUldBbTR2Nl9aaEVuRW5YTktvTE9jb2N0VWljUzBXazZGZ3NjRThteHJRcnRSUk5nbF9sTWJiQkFXbUdsejZyUEdNN3NlUFhJ",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "We're sorry that the experience you've been having lacks consistency.  If there are issues with consistency it can be in relation to how the product was installed or perhaps there is a defect in the product.  Please let us know after they have a chance to look at it.",
            "date": "February 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "gustavo velez",
        "comment": "So far the app has worked flawlessly. I was a little skeptical at first but I ended up renewing for a 2-year agreement. I like the idea of being able to start my vehicle from anywhere and of course the extra security. It would only change one thing. When starting my vehicle I would like for the app to ask are you sure? only because I have accidentally  hit the button to start my vehicle and could not turn it off for 1min. Keep up the good work !",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRTdPNnBoZzg4Q3FfYTV3Vl9HNWR6RHBCeWoxSlY3VW5saW1zWGRLellPajVQT1lXYXA2bmhQQmFqM2RZNWZZNWJPWjd6YU5fNnFBME9EaW9R",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the rating and renewing for 2 years! The feature you are asking for is there. Just open DroneMobile, go to Settings &gt; Preferences &gt; Command Confirmation. Turn that slider to On and you will be good to go.",
            "date": "February 1, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Bradley Urbaniak",
        "comment": "It is a luxury in winter or summer to have. That is when the app decides it wants to work. Lately the app keeps logging me. Also have been dealing with the app stating that my vehicle is running. Just to get to it and it's not. Or when it has me try multiple times to start it. Try Again, Log Out, Try Again. That's my favorite. I expect some issues. Honestly then to raise our subscription rates this year?",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSGxDMGtlVlBTWVhZcnZGZk9rSWhEaUZCellSODk1UDFRUDY1UVVKSkEwd25zLVJmd0w2WUEyZFVEXzdUWG9HSm9aOHNOemwwWmw1aGNCbXFz",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "We are sorry you have been experiencing issues with DroneMobile. Usually this could be due to faulty hardware or even installation location in your vehicle. Our best suggestion is to have your place of installation take a look at it.",
            "date": "February 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Ryan Prafke",
        "comment": "It works to start my car. But as soon as it refreshes it looses the information and says my car is not running . It does not display cell signal or runtime. I realise some features won't be available due to what starter I have. BUT why does the information disappear after I refresh?? Run time is gone and weather the car or running disappears. Very glitchy",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRUE0NUowVzNuTDBYcDYzQ3hqZkozeVNVVFZLMVJ1ZUw1a2dDME9nTjFQRFlLVlBPQXpfV3BSRF84OFg3TlU5M0p1RHNBRW9kcm5jd29uUWZZ",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the updated feedback. We will look into this issue for the next version.",
            "date": "February 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Edward Mulama",
        "comment": "Good app, best in the market in my opinion but still has its flaws here and there. I don't have the tracker active but I do take full advantage of my plan. The fact that you can start/lock/unlock your car from anywhere is amazing. Just gives me peace of mind.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSGlrX1FmTUVmeFhjRUJyWTdaeGZSYjFxcVRUOXpWNGpoVHZ1d2Y2V0huUmloNnhiUmVrczVNcVgyOUh2amFPN0RhaXh6UDJVTEEwQ2VNOS1N",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for leaving a review and rating. We are glad all the features are working great for you! If you have any other suggestions on how we can improve, please let us know.",
            "date": "February 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I am able to start my vehicle anywhere, and the GPS is super accurate for speed, and location, and trip routing. The app also tells me the battery level and temperature in vehicle. Works great. Works best on cellular network. Using Wi-Fi sometimes there is a slight lag.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR0lCeDNCZjVCaXBJbGJMWDRiLTN0Y0tzaFg5cmNxdEVCeUVKVHlEV01NNzVaUHVYVzNqWUx4NjhqQzFwMEd6OWtRV25vRE1CdXNNd1RTN0pj",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the detailed feedback and rating! We are glad everything is working great for you!",
            "date": "February 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Diane Gray",
        "comment": "Ever since the 3.8 update arrived the app has lost functionality on my  Huawei smart watch.  When I select \"Controls\" the screen is blank and I am not able to start/stop the engine anymore on my smartwatch.  Disappointing as this is how I usually do it rather than taking my phone out.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR2ZxZ0JKOGVnbnFNeU5EaEU2dWhrWEhZMzNxYXl2dXk2RXBWS3lFMnktNHBxQU52SFl5Nkx1UUhTa2NXMERQbUU5TEluNkVSSkhWWTJDbjhR",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I'm an installer.  I have installed and used DEI, MyCar and FirsTech products.  Drone mobile does what it needs to do.  I wish the GUI was a little smoother, but it always starts my car.  Prices are not very competitive compared to MyCar but I'm sure that will change.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSDdKTzR1Q09oMmI3S1NQR0VHQ0NKZWZOMnZRZGNqUURRd3kyTGhlVC1MYi1neG9sTXhxdGhfNlk5ZXpQZDJ5enlSTGNKeE5nWDBzWHF2Q05N",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Stephen Fleming",
        "comment": "It's a great app. I have found a few quirks with it though. I would like to have it report that the engine is on or off when the vehicle is tracked. Also when the runtime finishes, it would be better to have the app report that than it show a list of things. The install was smooth and seamless with an iDatastart HCX000A into my wife's 2017 Elantra.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRjdKZEl2elpBZC1sdHJ3LWxDMWpUSmNfTVFDZVh6NWlNV05rbEJHSUtVMWs1RTNUUnEweVFoMEViY3JyN0dzcTZ6aDZPX3A2UWZUYURNNGln",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the feedback. We will report this to our engineers.",
            "date": "February 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "jeremy castle",
        "comment": "The audio refresh seems to be working now! The app has always worked consistently. I don't know if it's changed because never tried turning them in but not all the notifications are able to be turned in. Most notably low battery. Will update if I get them working.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR2NUdE1QZ1ZBVWlkdHV0WkZkUEM4a0t2Q0xBUS1CZlFGYl9INTVTTEw4N1hJdmsxZkZUWjlvVzFDYXBmNzlXQWpRNjlfeWtrLWhOby1MaDZJ",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the updated rating and comments. Low battery alert will work if your remote starter has that option, is turned on by your installer and then configured on the DroneMobile side. Do you know what remote starter is installed?",
            "date": "February 1, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Tyson Polack",
        "comment": "Easy to use and affordable alternative! Really appreciate they added a month to month subscription feature. Allows me to only pay for the service when I will be using it (time of year). Once in a while there is synching issues with Android Wear devices.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSGxBN25LR1NGRmlvZXEzWFlTR2lYNUhEUlpCem9Fb0Q2Xzk3bzNEZmM4aTdXNG1wX3J6SGh2bDk1MndKVUkxaFZmOXJDM25LX1BiajBjOG1r",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the feedback! What Android Wear devices are you using?",
            "date": "February 2, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Mark Barsoum",
        "comment": "With my DC3 controller it always tells me my engine is on upon opening the app even with the update done Jan 31/18 and auto refresh is turned on.  I always have to manually swipe down in the app to refresh and get the correct status of the car.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSERwWk03bTM4dGRHdUxjdWFvR2NWR1NBUHlUd3d2R1d0cXFvd3gyaWozY2lyQkRvSF9pQjAwRGxMcG9uT3VKa3l6bEkxNkhZRXF3TFpoYno4",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the feedback. We will look into the issue.",
            "date": "February 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Hector Concepcion",
        "comment": "Coming from Smart Start this one was a bad move. Can't even give you a free GPS to find your car. Even is you pefered it to refresh every time you open the app you still have to do it manually. Just sad.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR0V1ajlsbkFBdHJjMVBDbWYxWE96QzlaYkNKbm51SXk3bUJidU9fVjB3Vm1XOTFxN3lmbTljMXFRWmZVYUlTcnpQb3kybDRGNGhVOXJrV3gw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "GARY HESS",
        "comment": "It works off cell towers and cell signal. For some reason mine doesn't work at my house, but my girlfriend's Drone unit does work fine. It's not a big deal because I just use my remote at my house, but a few times it doesn't even work in places where I know I have cell signal. back and forth with company and rep and still not fixed.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRlJ5bEpJM2dxcEs2WXQ4QlQ4LXRwdlRxS000RXZmcF9HaW5vVGJKTUdVa0l3eDZNSDltVTNwaEVyZ0ttYlFPakwtQlpfU2lvMzhjZ0JnNlpB",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Philip Fisher",
        "comment": "The remote start works fine.  The map sucks. You have to refresh MANY times just for it to work at all to locate the vehicle. I don't know why this is such a hard concept to make work.  Wondering if upgrading my subscription was worth it.",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR2pEandDYy1aRUlZME5taWpJaFNCWVhjMC0wODV5NUs1WDVkZlJwZmpTUTdZeGNFR1NfdXVtdTZfbVlJa20telZ2YmEyR05xMDBYUmNia3FF",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the feedback. The reason you have to refresh is that it takes a few minutes for the GPS antenna to \"wake up.\" Once it does, it will accurately return your vehicle's location.",
            "date": "February 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jonathan Caldwell",
        "comment": "Barely does the basics, wish it was full featured and incorporated the features into other apps better, occasionally gets lost and musty bed restarted. Does NOT reliably Poll the car for info relying on app clicks or guessing to report info. I.e. its possible to have unlocked does when this days locked or a car that is running with ignition off",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRi1rQklfV0hZZDM3QmY2V0xEY3JSWTBUUE8yOHJLa0JGa0dqZXlpR0VQWENFTFozN0lMVzdldUVjWUNqRnNrWHNrcEtvX0NiUDhieVZDTF80",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "We are sorry you are having issues with DroneMobile. Have you reached out to your place of purchase and installation for help?",
            "date": "February 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Hydro Dave",
        "comment": "Good app  and 5 stars until the last update. Now shows car starting and the count-down timer, but then display goes grey and timer goes off. Not sure if car has started or not when this happens. My wife has the same issue on her phone. Also, notifications, including sound and phone notifications (Samsung S7s) stopped sending. Have checked all app and phone notification settings.  Worked flawlessly prior to the last update.Please fix!!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRWxNUlB3RnFVVGJVY3U0UnZRSVQ5MGpZSHJLckNqZUQ4a2tFT3RyT2NQNmltQkRNdVZ5ZGxaajFzbExMOWRqZ29kUThWdm9mcVdIeGY1c1hF",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Christina Malgra",
        "comment": "I am on a trial period. And can not see the full functionality of the system to see if I want to keep paying after the trial. But from what I do have, when every I open the app it is always set to the last time I opened it, like days behind. There for it is not updating, so again I'm waiting for the refresh I have to manually initiate before I know the state of my vehical. Also often it tells me it is unable to  communicate with the vehical so that means if something happened it wouldn't even alert me.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRklsWTZMRi1tSG50MFBhR3JNNFI4VFJHbUZnQ0wzcElmRTJFVTZvd0NDcDFreWlaanAxV2MwRXRLeFNQUlE4aHp3MTEwU3N3UEpvYTBYYUZB",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Bryan Yoshida",
        "comment": "The 'schedule start' function would be great if it actually started your car at that time instead of being a pop-up and asking you if you want to start your car. Also, automatic 2 star demotion for persistent pop-up asking to rate the app.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRUtOUFpFUnpoZkhTTENEOVpGV3JsZjYyQnZTbHllX2YwT3FLcm0wUDR1R09XZDRIazhYMzhtZ1pHNUZKMXpnajh3US1WQm9Rd24tNXR1Ullz",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ken Cragle",
        "comment": "App works most of the time. Does not automatically update if you don't restart app. Not sure if it works well enough to justify the cost. Would like to see bluetooth connectivity for bad cell service areas. Also to automatically lock/unlock doors when near. I believe Viper can.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRV83VHdINnJqc19LSnBhZ0g3d2NnZlhyN2VXM1hKQ0Jsc1FNczFUanBManNJV0FvQUVkdGNFeFZ3TXZBTGItUTN6Z3ZvRmZiTmQtTGZfU2Y0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Michael Thomas",
        "comment": "Lock, unlock and engine status are rarely correct, even if you set to refresh on launch (which I don't think it's doing).  I asked support about it and they said they would get back to me but never did.  When the ticket automatically closed I reopened through the site and the engineer locked me out of the system!  I immediately cancelled orders for two more systems for my parents for Xmas.  Oh well.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR0ZEbW10SEdCQkNEUHJGV1ZoZ29Ub3JPUVowaHRfbnJpQkxieUpmeHlqWWR2Qzg2MkhvYi12UFA5VTJNMlVNdl9sQTRLYi1EcEQya1YzRWhF",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Summer Kerekes",
        "comment": "Best improvement I made to my car. Now if the aux 1 controller didn't have to be reset every fall and my rear defrost would work without having to schedule an appt.. Also, it says my engine is running when it isn't..",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR25pOExOajdrQUNNZHkxUmF3SEVIaUhnMmdYbHNfLWNGRUhmdTJHNmJSUG9tSndJMG9Ed1Y2SjFjMVVvRVFGSERqYzJaMGRRRWF5ZU52X2JR",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the feedback. What reason did your place of installation give you for the defrost issue? Also were they able to find why your engine showed running when it has not?",
            "date": "February 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Brian Floyd",
        "comment": "I have had nothing but problems with this device and app since day one.  Paid too much money for something to only work sometimes.  I should have known there was going to be issues when my trial 30 days ended day 1.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR1BkQzc4U3M4anozb0lPeDdFTWJmRFR1QW5QN2xfQW5vVm9xRzk1T2Rnbk82R1lMVUtwTHJadGF4Y1M4UkZPd1V4aXBUZnNTZElHay1IeEQw",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "What issues are you having?",
            "date": "February 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Josh Everson",
        "comment": "The push button car turns off when the doors open. Was told it's an issue with the car and not the app. Seems like something Drone would address if they want to sell their product. Also, this doesn't work unless you have good cell signal.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR0w4OXBpbElDWkUtYUo5MkZ5VGp2ZXVkSHVYYXlhZVFqUGJzVE5LNEtqenpVVUZ4NFhnTmwzZ2c1RkE0dWxLR3R6MUtad1ZrQkZ5S1pHc0ZN",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the feedback. This sounds like the way the remote starter bypass interfaces with your vehicle. Sometimes we cannot interfere with how your vehicle works, only interface with it.",
            "date": "February 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "mbaker867",
        "comment": "Great app when it's working.  Commonly logs itself out and then states my password is wrong and won't let me back in.    When that happens I have to delete and reinstall app and then change password again. So frustrating!  My truck got its window smashed out and broken into because the app logged me out and did not notify me.  Have a few friends with the system...same issues.  Like I said, excellent app \"when\"  it's working.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSGhDNHd6SzZzckY0bEw4N0h5TVpJNF9JSFdZLURGbEcwSVk1NXM0enZnUUZBaFZNYWt4VmRRcHR6OU1mQlVvOG91VFAwMEZSUnJIS3RzajBJ",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the rating and review.  We are sorry to hear about unfortunate events that took place.  I would encourage to open a ticket to our support team.  https://support.dronemobile.com/hc/en-us/requests/new",
            "date": "March 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Luis Perez",
        "comment": "It's a really helpful app, however, sometimes it doesn't work. Sometimes when I try to start my car it doesn't work saying there was a network error even though I have full service. When that happens I have to uninstall the app and install it back to make it work.",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSE8yb2RJV1NNYU8yNnJEamRuQkpZTFhjUG52TWZUTXZ2OTJGVkxpSEFaRnp0UGNRenJpcDMxWl94dkpoWHBzV1RHRkhjQkRjWi0xTE1vRktN",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the feedback. We will try reproducing your issues.",
            "date": "February 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jeremy Royer",
        "comment": "App works most of the time. Not all the time. The new Widget was great news! Only worked for 2 days. Now if I try a Widget button, it flashes a red \"X\". Doesn't work anymore. Tried re-installing Widget. Didn't work.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRjlja0Rnam10NmU3cjdsZXkydE5mT0ZuZVhCTTlpcUgyV2NGbUlvM3RISnF0ajlySWtQZmlLWE5fMTR3UTFlOW5YdEZfblQwTENqMTR0bXpj",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "philip roberge",
        "comment": "Works good but the service is too expensive.  There are other companies offering a similar module for remote starters just like drone, except the service is less than half the price per year and even less when you pay for a 3 year plan. Go figure. I'll be switching when my service plan is up, unless the prices drop drastically.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR3lKblJmczh1eGRFTk54YjNZR0Nad05Zd05wY04wd3FWLUZKbzZPN202V25Zd2FOZTN0T0k0LXp2LW9GSGhDdTFPVFAxSVBjUjU2NHIwaTNZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Larry Holt",
        "comment": "App is stable. Biggest complaint is that the scheduler won't actually remote start your car. It only sends you a reminder message. Big Miss on what would have been a very useful feature.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPR2ZEQlcyUG5kcjE3YUc4Q0dScWRkR2l6S2k0SkZNallSRlg5X3ZtalhmOWVBMk5sVlBaa0NIaUJZUlNocVNnX2tNRTRjclowSjU3VXJjdnZZ",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the feedback. We will look at adding this feature.",
            "date": "February 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jill Carlisle",
        "comment": "The app doesn't sync automatically when opening.  When asking tech support how to sync, they told me to drag down for a refresh.  A couple things, 1. Shouldn't the app show accutate information upon opening?  Why do I need to refresh?  2. Even when I refresh the app, the notifications still aren't accurate.  The app constantly says my doors are unlocked when I know that they are locked.  I never had this problem when I first got this.  Must be one of the upgrades that has goofed this up, but tech support has not been helpful in fixing the problem.  App still opens my car and turns it on which is why I gave it 3 stars.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRTR3emhpY0xId2tKMDdpX1N2UWxWM1BBbzY5dUFYQkJaTE5UNjBoQ3RseXFPd0dxQ0kyYmtDXzh4YnFVYjRHckI5eVBIUFJyQTRWQW5Gb3Rn",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for the feedback. We implemented an auto refresh. Go to Settings &gt; Preferences &gt; Auto Refresh. The app shows your last status received from the DroneMobile servers. Please let us know if the Auto Refresh helps.",
            "date": "February 7, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Kimberley McLachlan",
        "comment": "I work in a factory with no windows. I can start my car without leaving my work area.  Plus you can set an alarm to remind you to start your car when you want.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSFBpMXBYNTZIR0IxVlczWEZ5RHBkT2E5bWVidE5YdU5hZDFqd3hwQVF2U01GZ1l2M3BhVGVReDNIeTI1SnctUEtPTWt6SlJPSTJFcjg2Wmhz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Feng Vang",
        "comment": "Start/stop engine works. Has about 5 to 10 seconds lags. Status of lock/unlock vehicle is great. Lock vehicle works, BUT unlock does NOT WORK. There is no feature to submit issues with app.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRXdRRVJ5cVdhWFliSEtIckhnTGc1TEE5cFBBTDRydmJRdDVVcmdSdXRpaEhjZ2I4T0Q2YzM5WEZiVTgwNXNGNjV4Q2VibkZ0U1dUQ2RHYlRn",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Carrie Beane",
        "comment": "I use this app to start and unlock/lock my car. It works consistently, I've had infrequent times when it failed, I think it may have been due to call service.  The lag times don't bother me. It would be nice if the running car would open without using the app or digging out my fob.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRldNdHZzMzB1NFhDejU3V3pXRmRSN0hlMlJwY0l2WXF6WFl0djZmTXlNWTV4TkU3eW95Rk1pV3kxdEMzNnhqRVN3emhQNndadVNBNjFTblQ4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tom Wales",
        "comment": "Works well most of the time, but once in a while it will just go off even though it appears to be all ready to enter the car. Maybe 1 in 40 times or so. Otherwise perfect.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSFFSUGRwdmlWUVdUdTNGd3Z4ZlhmSVhpeDVDUEswdGNHMndGa0hneTllc0g3UkZOeENtZDdSMmVLaGJ4cm9EblYyMTAxY2ZpUGR3bXhZT2hZ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Richard Crosby",
        "comment": "The addition of a home screen widget was a long needed feature. Thank you for adding it. Countdown timer is useless. It disappears within 30 seconds of staring the car. When you get a reminder on Android wear to start the car, there is no way to get into the app on the watch from the watch notification",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRm9vbXhsbWdyV1ZFcTRhVWdsY2Q2ZGpyR3NRMG1XcDI0UEVudm12WEdQVm9mQTVCLUMxVzhWTjV3T282U1pVSUxqM3NINzIxcDAxY1NmWDNZ",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Thank you for more feedback! The countdown timer will disappear if no remote start success push notification is received, if you don't allow DroneMobile to access your location and if a remote start error is received. We will look at your issue on the Android Wear platform. What Android Wear watch are you using?",
            "date": "February 1, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Craig Hunt",
        "comment": "Wish i could give it 5 stars.. had alot of problems.. since v3.8 no commands will work.. wont even refresh..",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRWFMS2hYaHRwLWFJV1NlVnFfVXA5dm1MTXFQVUlEWkpPM2tDVFZza1lnalBQX2JXV2x1YWNMSFJoVGFiM3VSalVpLVB4R2RPOFQ3Z2VOQ0dN",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "We apologize for the issues you are having. Have you opened a ticket at https://support.dronemobile.com/hc/en-us/requests/new",
            "date": "February 2, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Terrance Myree",
        "comment": "They added a widget that doesn't do anything or at least I can't get it to work. Very frustrating.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPRkktLWhmNkpQVGdveDM5WjI5aVgxZmFFenB3cTBCaVNBSnJjdGRvbENEYUdsUXZJWkZjNUdxSzlUa2JQakc3VzFkcEdaTkxzVEc4anE2VDFF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Adam Conigliaro",
        "comment": "Well I am definitely giving this app a bad review. I have full service on my phone and have the status on my vehicle with cell service is high but yet it will not send any request to my car. Sometimes the car will not unlock leaving the fob useless.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSF9PRlBZX3ltMUpZRTJWVDdJSFR5MnRSYmFjdVJ3a3cybkpIMXVnVWt6Z2I0ckZHOGNmaTNYY3Q5T3VabWlRSjhwMDVZRGpPOGlQek5rSGhR",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "We are sorry you are having issues with DroneMobile. Your cell service does not affect how the DroneMobile unit installed in your vehicle works. The installed DroneMobile module has its own cell service. It is that connection that usually causes communication errors.",
            "date": "February 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Aime Livingston",
        "comment": "It certainly gets the job done and is excellent for starting my car from anywhere. It doesn't always display the correct status for my locks and the timer doesn't always track correctly.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSDdLVE9Wd3JKb3IyTjdkQTV6dzFjNUl2X0xIcXU3elJsSlFXSVU1MEFOandKQkw5aDA3U0VDZXo5YUY2YXE3OFJ2VEZfLU9IdzhlOTBYb1A0",
        "reply": {
            "author": "Firstech, LLC.",
            "content": "Have you tried turning on Auto Refresh? Just go to Settings &gt; Preferences &gt; Auto Refresh. This will update the status when you return to the app.",
            "date": "February 1, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Hate carrying key fobs.  Have my phone with me most of the time and it works really well.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.whiz.droneapp&reviewId=Z3A6QU9xcFRPSHJDbEk0SDBIQkljcU5pNC1McndqUmtrRC1DYUFEc1U4b0JtRHEwMzE2VEZfRE9GMjIwdGRnNlFjZ1J4bWNLWFZ2S2FaNGpwZ1ZDd1lqdlB3",
        "reply": null,
        "star": 5,
        "title": null
    }
]