[
    {
        "author": "Shital Wadkar",
        "comment": "On Android wear alarm can not have name.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSHBIOEtZcjdPa1N6cHZ5VnhjR0ZucG9jcG1tbUc3ei1QY0hrdTA4bG1hdjU0X1lYOTBpeHYzUkw4dlk2UElWUWNzOWJYTEJJQkhLZ0NuVUJv",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jer Ry",
        "comment": "This app is ok but can be great. Constantly have to be going through manually trying of my million and one alarms individually. How about adding a feature where alarms can be grouped? So you have alarms for work that are all turned off or on by a master button. {{Is it me or the alarm fill screen alert has shifted up quite a bit?}}",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSGlDNXo4UldoQ1dZWXdfd3pqWGE1a1R1eFB5Y1NlWHlVelNIcEFaSHJaWDdvQWFNUEdXX1BGaUVXZ3VMaFhCODRWWGFSSVEtZ1ZLV1A1S1RN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Morgan Jaye",
        "comment": "Would be great if actually functioned as alarm clock. Alarm tones do not work on updated Android operating system.  Phone let's out a muted beep every so often instead of an alarm. Emailed about this, no response. This app could have got me fired.  It used to be reliable,but is far from it now",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSE1WaUZtMVBfSUFTWGNaX2U1MVdQM2hjb2pBT2tvUHMzanhGOHlJZmVsblpRbVotTDR6VjJ1M0xsb1NuM281MUlqdWF0aDVQaXMyUXdnemdZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Cliff Towner",
        "comment": "Great app and would be 5 stars if they would do 2 things. First and most importantly is make it harder to turn the alarm off. The snooze and off buttons are too close and I have turned off alarms instead of hitting snooze.   And secondly make the snooze time separate for each alarm not a global setting. Other than those 2 issues I really like it.",
        "date": "December 4, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSHdSbDU5SXM4SDJ1SVhraFZpaWF6akxUWVBmV09yemM1QjJzMkJGN0t4V2FJdHRTVTVMU0FSdGdPemtEQjYyMHZiTzA2MWRxdWc2VG92a0pN",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Stefan Mihajlovic",
        "comment": "App is not working properly after and update. This morning it missed the alarm which was set to turn on every working day at 7:15 for the last two years. I am switching to the built in Samsung app unfortunately since this app has better and more intuitive UI combined with awesome material design, but it fails as a simple alarm app it should be.",
        "date": "December 6, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRURnUTc2VVZUdF92czkyY1E3Q0JMUWxYb2hFbHdCRGdmTmd3ZVhZU3NkSms4dXMzcVcwa0EwNGJzeWdQUDJpOVBWeDJXeGNPWjQ4TlluT3FZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jackson Caldwell",
        "comment": "In an earlier review I stated that all alarms had to use the same alarm sound tone. This is not correct.  What I meant to write is this app only allows one (1) downloadable alarm sound tone.  The user can select multiple alarm sound tones from the in app provided list.  Unfortunately, if you prefer to download your own alarm sound tones you are limited to just one. Why?  Since my last review an update moved the alarm names to the right side of the days of the week.  Although this is more aesthetically pleasing it still does not address the fact that both the week days and alarm name sometimes fight for space on the same line which can  hide part of the alarm name.",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSFB4bWVURW1ialRHMkJzMk5kVjEwQmZNSUk1Zm1rMmVqU1pIQ2NlT29UQ1RYVThIU3NHZlVDbkFzMTRZdVZ3NF9FR1l4ai1Bd2JDZWN2RFhB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kathy Nicola",
        "comment": "Please help. I've been using this for two years & very happy with it. But about two days ago, it stopped working properly & I have no idea why -- nothing else has been changed in my OS or in other apps, so far as I know. It's not loading all the way, or not loading at all, alarm failed yesterday. (Thankfully, I use a backup alarm!)  Have had very good experience with this app until now. What can I do?",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRWgxSjJ6amo3UkZxZDlBZkprVHhTd05oMjc4WkIxSGtKM0ZaZFZjRDBPWWFDRXJKdmstZFJ1REdGd2tQMWdnSmpRR0hvbUNqS3k3NHRBLVdV",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kathryn Giddy",
        "comment": "Glitchy and doesn't work. I've only had my phone for a week and most of the alarms aren't working. At first I thought I was sleeping through them, but often they don't go off at all.  I re-booted and now some alarms have notifications and these notifications of the upcoming Alarms are driving me crazy!  Do I uninstall or just delete?",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPR1BoX2pocDc0RzRsMlFQYlVQdXp3eFcwTWR2TFRRUENURzlMSFpULUpEbGNscTA0emQwdlE1WFg3SHNIc2FQaGpGMmF2bXNnZW8xVjZBbHB3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Phil Considine",
        "comment": "Something screwy about this. Alarms sometimes don't go off (I checked the alarm volume). Once the system toolbar time didn't match the clock time (I checked the time zone). Sometimes a countdown timer will sound several minutes too late. Could be the phone itself so I'll try another app but I'm thinking I should buy an actual alarm clock.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPR3dZMjlKSUltclU0NU9hQkZtOGN5NVVpd1BJQkFWTEY3SC1mZ2R2WUFZa25lSjBNN1NsSDdlME1RU0VfM0pyMDh2MTBuaVEycTk4RnJnMklV",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Priidu Uusen",
        "comment": "I have been looking for an app for my Moto watch for enabling multiple timers. as the default app can run only one timer simultaneously. Used MoveUp timer but really like the full screen feature of the stock Clock app. Unfortunately the sync between phone app and watch app is quite poor. Although the timers set up in phone trigger a notification on watch once finished (and phone app allows to set up multiple timers simultaneously) but there is no way to browse the running timers from the watch. Also, if the timer is set from the watch, it does not get synced to the phone app.  EDIT: alarms stopped triggering all together. Happens quite randomly.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSGluSnNCQUFsMHM0c01jVi13YmJxRHgtUWJ0dk9DVENZNFNwVlBaZ3BSRzZGMUlKZDFEVVlkZkdBWC1qNThHUmhmR1lRMjBubG9BY25ZaEUw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Karina Branson",
        "comment": "I really want to like this app but the clunky navigation of timers bugs the heck out of me. Why do I need to scroll through all of them each time to find the one I want? Why can't I see them all from the main timer page? Looking forward to the update that improves UI.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSFdWSDMtNExaT0VmQWZVY0xrYjRiWVZyZEwwVFJaQzNuTWJXX0Y5aFBta0VaMExxX0pyRlNGaGJPcWZ1cDVUdktfQldQeVpJSzFQSDFzc3Rz",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jonas Borggren",
        "comment": "On Android N one of my notifications for upcoming alarms get stuck and will not dismiss even if I click dismiss and time has passed. Force close doesn't even work. Must reboot to remove notification. 5 stars if this gets fixed.",
        "date": "December 16, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRTFPOVcwUFJNenJBMzljN0V3bklLc2o1aTJZY3lwZG9KNkswdkR3ODJudXJaYV94TVlvXzh6aGFCMVJzNFRILTZLUHF2NVBMU19wYjR3LUxz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Matthew Balestra",
        "comment": "*If your alarm isn't working, uninstall the latest update!*   Alarms do not go off! It is appalling to me that it's been 3 months and still no fix... Do you even read reviews and feedback? Apparently not. 3 months for Christ's sake. If I could give zero stars I would. Not cool Google!",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRWtkMThCTXdGT0dsUFNPRlVJV2hpREVhT2l1c1BiTUh4WjZCQnAtbndOYjVVSlEtTVlKeTZBNUxkYVctY0ppRUdhMkJjT3o5WkhYQ2VDc0pN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "W Bowman",
        "comment": "The purpose of a clock app is to SEE the clock.  The clock is not visible unless you open the app. o_O  Seriously, How stupid is that? Layout is like the Motorola clock widget which puts the clock on the home page visible and offers 24 hr clock.  Take a look Google and learn.  The fact you have to \"open\" the clock app to see the clock defeated the entire purpose of having it.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRmh2dXAzckhyblBYaTRtSHJ2UGU5c0FKY0tSV3hfWlctOEJGNHNUTGQ3b3dkd3R5NzJtZ0l1MnBBaWR4b3pKZUM4UWF0cFRRLWFPaURFY2gw",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Vivian Law",
        "comment": "I loved this app before I got a new phone - nice ring tones, works well, good design. On my new phone, a Samsung Galaxy S7, the alarm randomly stops ringing on its own, the option to snooze or turn off no longer comes up on the screen when the alarm goes off, and when I push the button on my phone the alarm just shuts off half the time instead of giving me the option to snooze.   Any chance there will be an update on this app?",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPR1RPdF9xUXpaRVgxbVd6YVZZa0VLQ3I4al9LZzRMTHp2TmFOOTRvbTh1SkJ2ZkhOYWFPMHdFZWhOakEzaXN5azFEenFwdG9ETzNBUWJLdXZJ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Stephen Jackiw",
        "comment": "For some reason it randomly won't go off.  Sometimes I get a missed alarm notification, most times not.  I have missed work 3 times because of this.  I am officially deleting this app off my phone and switching alarms.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPR2hoNFRMV2pkLUNNREFUdHptVm5FazRyaGdZZXl2TS1xdHN4NUlCdVg2ZDlKVzhVYnZGaUUzUFI5eXRVWjhPY2d5UzRvTTNHX0VyOGFSdWxZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Alvin Marquez",
        "comment": "Stopped working once I put 'Gradually increase volume' setting on and kept telling me I was missing alarms.  Tested it while awake and it wasn't making any alarm sounds although its the set alarm time. Had to turn off the setting again to make it work normally.  I missed 2 days worth of alarms and was wondering how I was sleeping through it...",
        "date": "December 19, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRlVBYjR1bzNpYzVFMzlKZFEtNThNc1g2ZFIzZ0U2cjEyUG8tOEM2U3JGU0ZuSkJCdDh4SHlDbFB4YUdXN1FtbVpnZGtJQklWM1dCQk1FQUM4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "David Tang",
        "comment": "Thought my phone had speaker issues but then realised that many people had the exact same problem. The alarms don't work at all. It missed 3 alarms in a row. Apart from that, material design is awesome and stopwatch is the best part about it.",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRlVOR0d3WTMwd0hoOVhWTk8xZTZkNWRtRE9QRjJfUTBxWkxiTnhDc3JRRFJQQ2R0SHlFWXpJRHVuZUd6VnRmVm05b1BnbGhyQ0JjbzFFN3pJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Israel Leslie",
        "comment": "Very responsive UI and the material design makes it intuitive and easy to navigate. Fits the android and Google themes, going along with other pre-installed apps. Haven't had any issues so far, however, elderly users may struggle with the small text and buttons for features such as the stopwatch.",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRWVfZ2hYY25LR2V4TXJ1ZzRrNDhMQWg4RTZhSjY0M2JLVWR4a05rNFdvdlViQ29Nd0VKNzB5dmhHUEdOLVVZYnFGc0FQUUdlWjUzN0ZXUzVn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "After the latest update, this stupid app has become very unreliable. The alarm will occasionally not go off. This bug has prevented me from properly following my daily routine for the last two weeks. Just sucks that it took me so long to realize that I wasn't sleeping through it.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSHdjZHM1Rm1yeTJPWDBoUTlPSWliV3FvMGdsN0IxWllmNDBVUU1nZ3lULWoxM01QUzZweWdfU2tEQWUwX1pNZzJUcDZWM0lWV2ItQllXWE5j",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jorick Sambre",
        "comment": "In New Version alarms don't go off, making use of the alarms pointless. This wasn't the case in the previous versions. this happened to me 3 times that alarms didn't go off. And as soon airplane mode is switched off, notifications about  missed alarms start to show up.   It might show the alarm icon in the notification bar, but later on it might go out on it's own.    PLEASE FIX THIS ASAP!",
        "date": "December 8, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRUd5dXdPdjN4VWhLNjk1eGZCbTVSdEJiV3k4Ty1pZkMwWTdxNHZYU0c4Tno5OFdHYmh6dnhCY1NQQVd1bWptZnhKeVVtUW1aemJ1WWhRaG9B",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jessica Leccese",
        "comment": "This app used to be fantastic. I don't know what happened in this update. It no longer comes up on the lock screen or allows me to use the volume buttons for snooze (even though the setting it on). To snooze the alarm, I have to unlock my phone (get blinded by my screen) and then pull down my notifications. Before, I just had to press a volume button - didn't even need to look at my phone.",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRnlOMms5OWp6NFFEY2FQWDZtVG9xX3V4MHJqWS1YbUR5eDlhNTdDOHp5UjBaWENjVEVIQUZ3Y0kwLXJSR3EyeWtvUHF4OG1zS25lcVVDWUNF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Martha Wade",
        "comment": "Since the most recent updates, the clock will freeze and refuse to close. Alarms won't go off. And now the digital clock widget for the home screen is missing! What goes on, Google?",
        "date": "December 3, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRTJUckxoLXhWdnhCUktzNERibDRQaG9WQy1qYml0TTFFenhMZjlsTlZqVzVNMERMTnE3NDJCMlBxVU1zNkN2MWxEaEpXb2JzUjBhX2pOX1V3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Fredrick Marc-Charles",
        "comment": "On Nokia 6, after updating this alarm does not work properly. Setting up multiple alarm still fails in morning with a notification that I missed it. Not sure if this is due to standby or doze issue but definitely affects our in the morning after hours of not using. Simple test for alarm in 10 noon works fine.",
        "date": "December 4, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPR2VpMlpiUktrMVV4RWVxS2dSMm9qTEwtOUhmaThWbzZFS3BGWE5hcDA3UHN1M2hzZVVlcnR4TFBaT1FTTUJkUDRtR1ZDZ2RnQWNTeXZ0cHhB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Babu Alagarsamy",
        "comment": "I am using it in Nokia 6, alarms are not working for properly. When I set alarm to ring in another 5-10 mins it works fine. But when I set it to ring the next day morning it never rings and all i get to see is a missed alarm notification from the app.",
        "date": "December 28, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRWdmTkpvS2JJUWV1aW9HMjZ4dGZVdjlLMWM4MUVuSFN2YkkwR0hkSFRCcmVpcGxkYU5EcFRUMkJoY1NNOENQOWxHR09Xcm5rWUkzMkF4RlpZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "fivepindittom1",
        "comment": "The app was good until the latest update. Now it only works on occasion and regardless of the ringtone u try and choose all is does is give a short soft beep. I've been late for work because if this! I've tried to send feedback and no one responds. VERY DISAPPOINTING!!! When do u plan on fixing this problem?",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRkFhNGVGV1EtV3FJVHBnUUgxQXhfRHRRaUhnQklONUZhaF9iZFJ1UkhTWDdlYjJhSUd4Y3NHR1Bjb1lud05rd3hHSWZBazdIcG5CcEcxRzlj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ian Ager",
        "comment": "Running this on Moto E4 Plus on 7.1.1 Frequently time freezes in status bar. Locking and unlocking refreshes it. When the time freezes alarm does not function. Uninstalling updates then updating app again gets it working for a day or so. For such a basic yet essential feature to be buggy is a joke. Quick check on Google shows this issue is widespread.",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSEoxbnNvTXBSalYwSUFCRWY5LTNuOHg5V2Z6RkR2TkVMaUc3Q3lQNlZ2bXVqb1cwNVg2aXdHdmhHZng2dXVlX3ZNSG5ENG8zUnk1X1ZxcjBZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kenneth Fagan",
        "comment": "I really don't trust that this app will wake me up in the morning... since I updated it, the snooze function no longer works. Worked fine for a long time, now it's just a useless app on my phone waiting to be uninstalled. Timer and stopwatch functions give out no sound when activated. Very frustrating. If only 0 stars were an option.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPR2pwWTNBVlh3UjBSbFN3clJYVEtOeUhBejFabE9XMlNyd25lUkV4dWdVTjV6WGFiVnhxZmxaZjJ4RjRDRkR4bkMxRWJNT2pkb1JLZU9ieTU4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kyriel Lupien",
        "comment": "Only flaw (and it's a MAJOR one) sometimes, when the app doesn't feel like it, the alarms don't work. I was supposed to wake up at 8am this morning for a meeting and it never rang. I even checked afterwards I it was set properly and it was. It just didn't ring. This happens very often. FIX IT.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRkw0eE9Pb2JZblpPWEpHMWJDMHNUTWcyRDVrNUU4Szk5S0tRcU5Ja2Fnb285T2dFVGl0d2tYMVc0Tm40OUNMUjJkNks5eENjVk1ZTVBOa19v",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Daniel Herbert",
        "comment": "Ok for the most part, but sometimes the timer alarm doesn't go off until unlocking the device. Have burnt meals on the stove or overdone running intervals many times as a result.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRUdPUDlNdXJUcnNpQ1kxS09vcUN4X0dCYmx4eDRFYlJtQ29kd0dvVmFHUVUzLUIyNm1nN1c3V0YyV0RWdHF1WXNndS1tWU9DbldSekY5REtB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Rajiva purushotham",
        "comment": "I don't know what's wrong with this app it often misses alarms and due which I had to face difficulties in my daily routine. I used it before but now it is at it worst. I recommend not to use this application.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSFhfODgzS3NuSnJqM2NpbUN6bjlsWElHRmVudFluMTlMSUhZMWFRa0tkSmNnWkpMeXRBTVY3dmI0cUdPb2hwcnBpVS1WRlluSTBiZmlWanBN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Steve Roenick",
        "comment": "Twice this week it's failed to make a sound at alarm time. Had no problems before latest update with this app on this phone and I've been using the Turbo 2 phone for 2+years now.",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRXVLS004OVRFNjd3WkZzbEY1VC16X1FlQjdrUnd0OEI4SVFZMHdtSGU5c3k5UGE2Y1ZfdDlwekZpWEN1Q3JlQXpBbGxtUElZay1tbl9paktB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Josh Beauvais",
        "comment": "This app used to be perfect, now the alarms don't show up at all sometimes and I no longer trust it to get me up for work. Now my phone crashes often and it might not wake me up. Pixel + Oreo is a very bad experience. Thanks for running Google based products for me, no more Nexus or pixels for this guy. Maybe Samsung can straighten out your lousy os.",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRUV1LVJzMktqMzJXZk1uem9VeDYzUGhLckNOTW9PUXFPUERlM28wZllWYWZZOElDTmFFRGprZG9iN3FUQjdMN0NhZ3F2c3Z3MjZmeXZjcFhj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ramani Miraj",
        "comment": "Heyy guys this aap show me wrong time in status bar.. There is bug in this appp I'm recently found that after the update,if i need to know right time than i'm goes on screen and do the phone lock and unlock.. So guys please give the upadate  and fix the proble..",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSGthbUYxLU1QaVlyaXhxelBZeUtuMmdlMXVTZ0hNZkRtaEtoZmstN0pudjh6elBNRjlPS0VndUxjeFlNcld4clVGSDlsZWhuY0tsLThJbWVj",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Chris Jones",
        "comment": "I'd give it a higher rating, but while you can set your volume controls to snooze it, this doesn't work until the second snooze. The first time the alarm goes off you have to open the phone and swipe left to snooze. If you swipe right (because you aren't awake enough to figure out or remember which is right) then alarm is off and you can sleep for a few extra hours. Your boss might not like that.",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSHR5anBjT0VLQXJGMWs2bmRfaXk0T3FXclZrOERfYTFmTk1YNi1FU0NMWTlaX2xCRjdoRm9naVdaSWtnaVVGby1GMTVPaFl4RTVyeDUwTkNB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Chakradhar Davuluri",
        "comment": "Hourly reminder option should have been there like blip blip app.. consolidation of apps is needed like e.g. clock is subset of calendar so you can consolidate them..",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPSGVNdm94ZGNmSGFaakJ4cTgwWDZYYkxTWHlBcl9IRTRWUm9SN2szZzh1ZUlOeWJnRnc3NUVfTFh2WWZZWGNsWk1oYTBWaWQyOEpHWDg0Z2pV",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sadangelman",
        "comment": "The app won't open and if it does you just get a blank screen. Alarms won't go off at there due time, yet the app still gives you a notification to say that you missed an alarm. Also if you get a notification for an upcoming alarm, trying to dismiss the alarm from the notification no longer works.",
        "date": "December 16, 2017",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRkU0TDg1S3BIak1BbWdWMG8wYUF5R2xya2lYUUx3VFM1dGtMaEs1U1VOLW12by0xaWE2LVcxUlU2MWh5UnBDR0VDa3lHVjBiOU95ZnNpcV9F",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "John Doe",
        "comment": "Freezes and crashes on my Moto E since the last update. Alarm rings like it should, but nothing happens when I try to hit snooze or stop the alarm, both within the app, and using the notification.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRmI1UV9GdmlNMmgyanNrVmpSQS0zbU5YRmlZMDdyT29MN2xra09MYUVnaEF3a2cyMVRiZEtqMDl2OWdmN0RZS3pPQVJXekRnZ3l0Zl85MXhN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Luke Thebaws",
        "comment": "Is there a setting so you can change the design to a retarded proof one? Maybe two buttons instead of sliding from the screen? Cuz it is the nth time now that I can't figure how to dismiss an alarm...",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPR1hzTk5ndWxudTVmeWZUZlpEc2lZY3dPSE5oYjdqOUpMUkhqaDlpWFY1RHlPU2p5VUpMNWVPWWk3LTI1NGEzay01MVF3cG5IRkx6MDMwZXVj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Gonçalo Reis",
        "comment": "After the update I just have one thing to say... The worst alarm App ever. And since I'm obliged to use it because of my phone it's associated with Google it really sucks. My clock widget doesn't display on my screen so I have to open the app going to my apps section. Sometimes just doesn't wakes you up... Well congratulations Google... You are screwing around...",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.google.android.deskclock&reviewId=Z3A6QU9xcFRPRWF1bnR3a2toYVBKMUlYRVhvakJZZExBYjRnX3VRY1U3eTZRRHdRMGVzZ1JKbzFhOEdxQ3MtZmp5Z2lKeEV0RnJpSGhZc2hQOEdXMU11WDU0",
        "reply": null,
        "star": 1,
        "title": null
    }
]