[
    {
        "author": "Drew Glicker",
        "comment": "No other app compares. Tinder is still the best!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPR3ZfZnozNXNUaEpHNG05V21YN254ZnVvZFhQa1habFY4TXRlZ3d0TU5aNERTQVlmYTgxYVcwWFNkckhGblpabDdZOG9pd0dmTTdPQXNiRmRz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Andrey Polounine",
        "comment": "Some improvement in functionality over last couple of months. But I agree with others: many likely fake profiles. Also guys watch out for this trick! I had a chick arrange to meet me  then she just unmatched me when I got there. I don't even know if it was a real person and whether they were actually there or pretending to be. Seems like others experienced this too.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRUhsbXRqQTdDNVVEc3R0endsWGRqMlk3RXRZelJGS1ktd01EUTBVSzZZMHFTR3lDUDNhM3BWbkRER2ZqWXBlMkhiQkw5a19OUlh4NXF4Vndj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Imani Hawkins",
        "comment": "I was banned from Tinder for a violation of the terms and conditions. This, though absurd in my opinion, I can accept. I sardonically requested payment from a user who was berating me for sex. Once again, I understand the request for payment is against terms and conditions. My complaints are as follows: 1. Men constantly harass women for sex utilizing this application, causing discomfort and violating the terms and conditions; 2. When I reached out to Tinder for answers, there was no correspondence. I've been attempting to reach someone for days to no avail.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPR2JiTU5IZ2RHQmFYZVBvQUtDYUpUY1ZHaXJROTlQTjVHcEFYVWpfYTZGci1sQnROaEVpd01EaWhWeE1Mb3NNZWZrZ2lyUGdEY0M5NFotU0ZR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Julio Torres",
        "comment": "Why can't I buy the 5 dollar super likes anymore? It's like you are forcing me to get the 40 dollar super like. I know you put an algorithm that makes the buttons stop working after a number of purchases so that us consumers spend more money on your stuff. That's sketchy, unlock that button. I know you know what I'm talking about.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRnlldUhmMVVlZGRCSjgwN3BjR0tuTE1QNHZWWHZjcXpoRERjR0ZMREJacnJFOXFrTXpQenQzT3E4SjNrWWFwa0JNcDZkc2ZRNmVJbktabFdN",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Zik Mir",
        "comment": "Just full of fake profiles. How I know this? My ex is there with 4 profiles with different names. I asked her about it and she said she does the even have an account. So what tinder is doing is hijacking random pics of girls, creating fake profiles with fake names to populate their swipes so you keep thinking there are real people. Fact is less than 10% are real profiles. Good luck",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRTNzanRkOFM5YU8wdzNJVXIxMC1MRnJxdUNnR0kwYUdfRy1rOWU4TUNmNUNTWTI1ejdMbFBJa2RPcFRPV1VESGlORGMwX2FUN0d0Yms5M2FF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "court harby",
        "comment": "Can't log in. At all. Tried both with phone number and Facebook. Got absolutely nowhere. This is ridiculous. Why can't I log in?  EDIT: even after spending MONTHS off the app, uninstalling,  reinstalling,  restarting my phone, turning off my mobile data and turning it back on again... Everything I can think of..... NOTHING changed. Still having problems. Just tried to log in 4 TIMES only to be sent 2 verification codes and be told that I can't log in 4 times.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPR0VkWmVmWVA2RjdsWWp3dE91dkxNYzRPQzhzcUZjVWFIV2FfNEVmYmhlTk9YQ3FWNGI3Z2M2RlBpSFlpS3d6dWJfZ2NVazFXLWZGVlBaMzFF",
        "reply": {
            "author": "Tinder",
            "content": "Hi Court, this might be temporary so please try again later. If the issue persists, try reinstalling the app; this won't delete your matches and messages. I hope this helps!",
            "date": "November 20, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Gaurav Khurana",
        "comment": "Actually I am facing a problem, I'm not sure why but all my matches have disappeared and they generally tend to disappear after a few mins of matching. Now I can assure you I didn't text anything inappropriate or something that might compel the other to unmatch me. I have my doubts because recently I matched with someone and exchanged a few text with the person, when the person went offline for a few min I too moved on to do my work and when I checked my phone later I had notification that the person messaged me back and when I opened my account, the match was no longer there. Could the operators of tinder look into this matter",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPR1dSekJMVUViandMV045QkRENGc2OXF0TzVpa1hDc3JrZTV3SlZXV3lhb1VmSGRhU0pMeER5ZWwxVHdPckNFRXRLQTNnaGV3dXhySTVRb3RV",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Randomly crashed while having some really good conversations, and then opened back up to the login screen. Now whenever I try logging back in with my phone number, it wants me to create a new account. All matches lost, all conversations lost. ALWAYS EXCHANGE PHONE NUMBERS STRAIGHT AWAY AND AVOID LONG CHATS WITHIN TINDER. I would be even more annoyed if I spent money in this app, as I would have wasted money and time.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRlBEMF9ucXBDMlhKQmw5ck93SUpqWmQ4eGl0TDVTbFJmMWtqelc1S1h3Y2RiNUNhcnRMX25WdkxrYzJrZXR0ZUJiV1lLSnByNWhVOWIwN1pF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "maans le roux",
        "comment": "Support is shocking. Deleted my account and that of people I know for no reason amd rhen getting hold of them is basically impossible. Further the app is not tablet optimized, no material design, no Google sign in, seldomly any change log with updates.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRWN2MlNvS2NEX1MxNWhOQTc1SDF1allnWkt1SGIwUzJOY3hITjFVNURvZkttalZrT29sVHJkcXZzNHZGMmpRSVFiN2tYeDhFUTNwdzlLejE4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Prashant sharma",
        "comment": "Though the app is great to use. However, I have been recently charged an INR 2900 amount for tinder gold subscription renewal which i dont intend to renew. I have already requested for a refund. However not received any reply from the developers. I hope this is not the experience you want to give to your users. I have already requested for renewal cancellation and the same had been done. Kindly help me with refund as well",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPR0d1aWdla0dFVUtCWFZEZlR5SE41UW1ReGFJM0hCTmhaNDduR2N2QjdIS0M5NU5CSWY2VmtSaHVmc013NlRmWmd5TEhNRHAxdXdjTU9vdWow",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jan Istenic",
        "comment": "Not using it because Nazi Facebook organisation. Gestapo was a boy scout operation compared to them. PRISM program disguised as social network. No thanks. On the other hand tinder is quite cool app... FB is the only flaw really.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRmhJWllacUJUMVlWVS1yTGRNaUw5YklkNVNhc3ppSzRBSGpkcDU3bG1mNnhFMllQVl9NbXZNQ0VEcW9pYl9OQmZwMXJVSkxadnlIdlFKV2ZV",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Craig Rodgers",
        "comment": "Once upto a time, the app was great, made many matches with lots of people and local too. They also had a version similar to Snapchat with a 24 hour picture and people could like it. This was a key in chatting to people. Now it's full of scams, and hardly make any matches what so ever. Tinder has made this all about profit  ££££. Only way you're likely to make more matches, is by paying in which I refuse to do so.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPSG1ld3dzeXdOclR6Z1lSdmRxUFZCZ1N0a3BkWDZWM3phRkdiSTVlOXRBN3VPb1daM3dhTzlFSWZOaGsxYk9Sd3htYk5uXzM4TWFBaXRMZXJn",
        "reply": {
            "author": "Tinder",
            "content": "Hi Craig, this might be temporary so please try again later. If the issue persists, try logging out and logging back in. Go to 'Settings,’ scroll down and tap 'Logout,' then log back in. As long as you haven’t accidentally deleted your account, your matches should load back up shortly!",
            "date": "August 30, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Bradley Dermott",
        "comment": "Useless on mobile data connection. Even with 4G still displays \"something went wrong, try again later\". Only seems to work if connected to a strong WiFi network.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRmVvUHVCWHZNMVlQVmNtb08tbFBITTlhWW10YzhXcGhGT3d5S0JRaXdfbV8wdEdWNWNBR2kyQm9LYzQxUVZuZGwtcGN0Rms1VVZHQzZsMEVN",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Aaron Ngongoma",
        "comment": "I think it's appalling no matter what I do I cannot view any of my likes. Am fairly new to Tinder. But do not see the point in continuing or even considering paying for a membership. Utterly disappointed in this. Would not recommend to anyone moving forward.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPR3QxY0htV2VtVHFhdXE0ajJqdzl5ZGUtZ1FvbnN0aDg0TTd6a2IwQVM1cnNHVEZNc3ZSN09yM2xWNUpHaHV0cG9ud1hCeG9pS2Fmb1BQcEc0",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sara Abrams",
        "comment": "I have had to make 3 seperate accounts because it logs me out and doesn't let me log in again. The error message says Oops! Something went wrong!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRW90UVUzVk84UVlqdXY3bzMxYk9QTlRndGRLVXM5RmtRNVFWWnI3dlZrSGk3TUZMN0ZJci1TelJDakVCUmxKX1gyUUtCTnB4Q1NkNnNXaHFz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "freakydeath33",
        "comment": "bumble user interface is way better plus free undo's. swipe up and down to view pics, shake to undo, then left and right to swipe. it doesnt glitch like tinder's ui either. logon to tinder error message: already logged in, cancel or sign out? so stupid.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRXdibVRGTlJWbmt1eWctV2x1c2REVFJ6eWRyWnc2UjBXTVBxUWpuYXZTU3I4OEdzazJlNWwxTlBCSDYzZ051RlIzMFROYnNsUVVWbEdFQ3NZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Brandon Slay",
        "comment": "Too many people trying to obtain cell phone numbers and credit card number. Doesnt seem like any matches. Almost like it's flooded with just enough fake profiles and matches just to sustain the app. I got a match and normally it says that the other person liked me too. Not this time, it said that the other person was \"addicted to Tinder also\". Just throwing out a line to reel me in.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPSHk3ZWZlNy1JaHFxWTUyamhlVUtjeGJwSTAtUnB1MnJFYXY2VUgwdXB1R3R1UjMyNGQwTmRPN1VsQlRiZW9fTXB5YnlyNUlyYVlIUURaaklz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Don Pixler",
        "comment": "Bad design. I've accidentally left swiped so many girls I liked by accident because I was trying to swipe through their pictures but forgot to push the info button first. I wish I could disable the swipe function and just use a simple thumbs up or thumbs down or whatever.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPSGFZQkhlaHlabXBlb0pFQ0JudjVLblU0clZHOTNRbVRORnRDTXByTDFVN3RQUXFqZlFhbzJsbXFLd0RscGpJbWNfUzZESERKelZXMUVud3o0",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "I paid $80 dollars for a year subscription to Tinder Gold and have been blocked in the first month. My Tinder profile was regular and had nothing that violated guidelines but my account was blocked two days ago without warning. My account has been active for only one week!After trying to contact support by phone and email for the past few days with no avail I'm going to bring this up with Google Services. I can't get my $80 dollars back or the find the 15 matches/messages, my account is blocked forever for no reason and customer support will not contact me back. This is a rip-off and I've lost all trust with this company. Don't use this app unless you want your money stolen.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPR3c3NWpRRmxLaXRsQ05jSmVLVGdUYk56RFdPdVpyX2pNdFBCR0g0X0JaMEVYSXQyTm1IdzEyOUdaeS1yUU55dk1fRDhCZFhUR251R0xyYV9V",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jackie Moss",
        "comment": "I don't know how many times I've downloaded, deleted, and redownloaded this app for it to not load the swipe screen. All it does is glitch on me and I've never been so frustrated in my life. This app is a waste of space seeing that I can never get it to work.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRU1haWhoaXRxZW5iYlhGdGwzQ3l6bDByYmRCV0tjWFhYUkRGN1R5Rml6NVFoRVFkZVJRbWtsMldaaXBteWM3bDl1bXNHLTFVSHl4YVd6c1JB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kayla Lewman",
        "comment": "I really enjoy using tinder. For some reason with almost getting 2k likes and everyday I message people back, today a problem has accrued. When I match up with someone new and I send them a message I get a red circle loading symbol. Also when I go thru my likes I have and swipe right and go back to my message board that right swipe match is not there to message. The first time that happens I just thought I didn't right swipe them and went to look that person wasn't there and wasn't there for my match. Can I get help because I haven't been able to message people and now that I think of it I'm also not getting any messages and I usually do get them all day.  So again please help ***thanks!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRUU5TElLREp1bXA5dkUxZnNoNlJnWXlQVE1fREo5bF8wcW5yZlRWMXFuR0RXMktVdV9ucXJ2VjRXUnEyMGVWM1lEYUM1RnN2MVhjREVxOFVF",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jemmia Puntal",
        "comment": "It's a good app but why can't I open the people who liked me.. It says theres a payment for tinder gold.. why is that? I thought it's free. There's already 100+ people who liked me but I really can't see them.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRnA0TTlmZmJ2ODJLc01PUVBWY1NsNnRqd0ZJci00QWJlSzNMcW9RemxNd1Blc2xDYUVCeVZ5dGdwcGxKeWJBVnhWcGJmNmZoQkF2TTZVUFNj",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Juan Nieves Bonilla",
        "comment": "I love it 'cause it's really useful. The thing I don't like is the limit of likes they give us, but it's ok; I can handle it. Love this app!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPSGFSb2lWam5uVUlzSHJqN0VIMmVSaU9FazZzWXNNU2d2OUVxWm5McW5oT19xYVNoMjhMOEc2ZmpoLWxnbEduQl9pRmpZN2ljenN0Vm5HZ1c0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Joseph M",
        "comment": "Just recently updated my mobile phone software and Tinder is unresponsive, I cannot login to my account even with the attempts of SMS and Facebook I'm not receiving the notifications or texts. Please help!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRTBhOE9XdUZLYXFqODBSZWN0NzlTTFVTSUhoaVlmZndicU1JdGxMMjlIeHpEVEttMUpIMjJFZ1NsYnFWcnROaUhpYWJGSVlHWng2TzdLYkkw",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Devesh Dwivedi",
        "comment": "Well I paid for the one month subscription and removed the subscription for auto renewal and it was mentioned on the forum of tinder that my subscription will last till that billing cycle completes ..but in 2days after the payment the subscription has been removed..very dissatisfied",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRXhVRlBDSDBpUmxaY2QxdUdqQWFlMDRQVHEwMDZsT3F1TFJULUFVOHZZZVVoa2lLTnAtN1pRQkdOY2dJU3pwREhUVkxFazJEWVNMaU96c3Uw",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Steven Beaugrand",
        "comment": "I paid for the membership and now I can't log in. Don't spend money on this app. They are all theives",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRTdGZ2dRVVFVc2tRcGhQd1VPR1c0SzVYRUpvV0JuMmktWW05LWpHT1EzaURQZThISXFqYlZPVDk3WXZXWHYzRU9ReERXTGtoekpJcW04VVdn",
        "reply": {
            "author": "Tinder",
            "content": "Hi Steven, this might be temporary so please try again later. If the issue persists, try reinstalling the app; this won't delete your matches and messages. I hope this helps!",
            "date": "March 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Cullen McGinn",
        "comment": "The shift of their model to a set amount of likes per day with the option of purchasing more is a greedy and counterproductive move.   Tinder's legacy is one of easy access, easy use. And in order to monetize your loneliness, they've taken away the ease of access.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPSHcxRnRGcmxCLWowVGlDREN5YTJSYTE0LWFOSEJDQWd0VjQ0Y21nY2p2UUp1Rm5tSldabC1TVjljenhucDZjX18wVFZ5bk5VWldvUG5kcHZz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Angelli Borlio",
        "comment": "Gained new friends. But its lagging and freezes. It shows i receive a message but no new messages",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRWVOaUN0VUNyYjI0ejlrVTJKaDU2R3FhT0NBZS0wd09BNXFibkhBQlg1UW9SSTJUajFWejB0WlpJNlVHNHlac1pMLUdXeW54RXV4Zm1jZE5R",
        "reply": {
            "author": "Tinder",
            "content": "Hi Angel, thanks for trying out Tinder. Anything we can do to get you to give us a better rating? Thank you!",
            "date": "August 31, 2014"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Khadija A'T",
        "comment": "It was working pretty fine since forever , but the new update doesnt show my old messages and just shows the matches and messages i got when i opened the app and thats really disappointing i really liked this app and if it continues to be like this im going to uninstall it sooner better than later .",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRV95czVFZVFXeHJzdDcwdkdmanNzSGtMMXd4RnZLOXI2RGo4WjNTd2pVd18tSnJHVHM5WHB4UUdwTnROeXFURWZ2LTVacWlHazR6cXZjdFFV",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "OlI Gorton",
        "comment": "Best dating app out there but still pretty terrible.  You will experiences issues like being unable to log in (Tinder will usually blame your internet connection even if it's blatantly not, rather than offer real solutions).  Its inconvient at the best of times, you will at some point loose all your matches or messages or something. Tinder catch phrase is \"something went wrong\". Unfortunately there's not a better alternative to Tinder, perhaps this lack of competition is why Tinder can afford to be so terrible.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPR1lzellQNEVWQ1hfTjlncGl1bjQ3V05sdHVSY0gzZmdHNXI1aThaaDNsNjliYS1sQTJDQkM3MTk4YnlmbDZFWUpha0FlYXVmYmdOQk9ndnc4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Heron Robinson",
        "comment": "All was well and good until, whilst I was asleep, Tinder decided I had somehow violated their TOS without specifying or giving me any sort of warning, and deleted my account. After receiving the notifying email, I made a complaint because I believe this was an error and was falsely reported/banned. I am emailed back and was asked for a screenshot of the issue. How was I supposed to send screencaps? I explained yet again and asked to at least be given a reason as to why I had had my account deleted. And then received an email being told that my account was deleted. No, really? 😒 Very unhelpful.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRk1vWk5uSW5kM0FpRzlWTWxqRlZ0NjBsQ3lYQjFwQU9nQUxRLVpBaWthY2prVTB3aEhaRGRHcVJZVGZaN1lNTHpvLVFiYVhuTDF4MW8yakhj",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "anando das gupta",
        "comment": "Until and unless you keep buying boosts, you will never get any one communicating. Money hogging app, paid.. Uninstalled. Don't waste your money.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRjBDYnFzMTIyOVJFc1YwVkFoRHhWOEpmMDBLRDYzZTk3Ny0tR2picjByUVNmRFpyZlhpNlJiT0tjVmNxWC1aZW9SdFM3WHFjTEJWc1hSeHpB",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Timothy Twogood",
        "comment": "App is boring. You're charged more for being older. App will randomly midsession log you out, and claim you need verification credentials to log back in. Everything is linked to Facebook, and will only subtly link you to Tinder with no out right status updates. I can't give this no stars. Images don't load, enjoy guessing who you're swiping. Everything is geared to your liking based off an algorithm that you submit zero data to so it's based on random swipes, that are somehow studied to give you bad matches that you can \"Super-Like.\"",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRm9YRjV1YnVJcHI3Z0d0U1lLX0M1aGJCV2FjX2FwaThNZ1UwSS1ra0Q0ZVRueUxpYjN5c09vSVdETDFQdWpFNEhoSnFsLWlVSVFJT3ZPRk80",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Pritpal Singh Gill",
        "comment": "Missing on one very important thing; it must show when was the last time a particular profile was active. I know people leave their profiles active and does not operate for long time. So for someone like me it is wastage of likes.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRV83N2drN2FPbExXbFhqMEdNQW5WU1d2RU1kZ3NGTUcydDJKOFJBeTFhczZKaXV6UTVIRHcxeUNNYW55eHUzX19TclVWWmhJT3VVNWtZbHc4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "E. Trafford",
        "comment": "It's been months and Tinder is still deleting my matches. I'll get notifications of messages, get my lonely ass hopes up, and find nothing. I'd never pay for an app that deleted my connections.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRTVYZHNvQkl1MW95N2gzRzN0VTRPUDhUZ25pOHEyOC1ibkJLVDBPSzF6QUg4ckloWE50VzFBMHFWMHdjc0dkTWdLSWdKaEl1WUpTazNzMjZV",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Well, they deleted my original review, so I'll keep posting it. The app is saturated with fake profiles. They used to at least talk to you, but now they just use up your limited likes.  Paying for premium won't make The ads go away. The app will tell you you have -1 likes. Customer service is terrible since they never addressed my issues and now are deleting my reviews. The only person I've had a real conversation with was someone whose phone number I already had. Unless you count being stood up as well.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRWxvZEVKRnVwcUNpYi0yd2pnOUZvQzFZb2xZc1VvYUNsaDEwTlBoNTQ2c1VWYi1YTVpjX0lVVm5od2FTSUUtaDdRZWl4dWJCRld6N0t4T0k4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "BreakingSecurity",
        "comment": "Without buying boosts is almost impossible to get a match.  When you buy your precious boosts, each one costing some €, maybe sometimes you can get one or two matches, but most of the times, none.  Waste of money. You can buy a beer with the money for a boost and the beer will make you happier. I am no Brad Pitt but not too bad either, I keep myself fit and in the gym. Money hungry app which barely works.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRmV6Rzd1dDN6VlF6VEFzODdhMTNzRHVMNERleVNiRzc4LWZmdGdzOG9paHdGVmdNekgxZmJwdmFSM0Q2cC12WWtsSjRWdjd2UkZIdm14QVNF",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Used to only need to provide a Facebook account to sign up. Now the app requires me to give Zuck my mobile number. I don't care about you “respecting” my privacy. Any half wit knows that's bullsheet. Get bent!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRVpiS1NGdFZjZDdfZ0NvZjhOZ1pOX3A4OURvamloVmJnUUVPYVNwd0pIZ2ZzMDVSbTM5S18zWG52ZkltUTBGUEJlMnEwdXFhNm44a1g4Z2cw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Corey Betancourt",
        "comment": "It's definitely not what it used to be. There are a lot of bots. Also, I understand the need for premium membership sometimes, but the price is a little high. Especially when some of the people who swipe right are bots.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPR1FiTFoxaVNSaVN1a0x3SWJfeEhHM1hBOGZRY3lmSzZFNE5KdjMxRW9EOFFPYi1iOVpobU44ZzlZQlRIQzExc1NCdk9QVExWeEdsS0U3QWE0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Nick",
        "comment": "As usual anything worth seeing or worth being able to do, you cant do, as you have to upgrade. Just like every other dating/hookup apps...",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.tinder&reviewId=Z3A6QU9xcFRPRTdPRjVxWW9LYmhUekdScVhsTHJIMXNHRVcySF85NVBMWURhTlY2d0cwa3ZSY2lTTEJjaHlBSDJYY0dLbnlwMkdrSVZ0OUpPRkFBWDdFRWJj",
        "reply": null,
        "star": 4,
        "title": null
    }
]