[
    {
        "author": "Emily Baker",
        "comment": "I only recently discovered 8tracks, and I love that I can listen to music I can't really listen to on other streaming sites like Pandora and Spotify. However, I feel that the app needs a lot of work. I often can't pause music, or unpause it, without it glitching. Also, there are a lot of limits in the app as compared to the full site. For example, I would like to be able to add play lists to my collection in the app, or search specific users or terms. Overall though, it works well enough, and I'm satisfied.",
        "date": "January 6, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRWpPN3ZveTRYbWtvUGR6bkJ3c0lKVW13bzZFMWZPb1ZzM0Nyem5GMUZ6c0ZmR2pSdXRsZFBXVHhubWxENGVhZnpJRUZwRzJrY2JKdFFhR1E",
        "reply": null,
        "star": 4,
        "title": "I love 8tracks, but the app isn't so great."
    },
    {
        "author": "Kacie gasaway",
        "comment": "I have been an avid listener for years, talking it up to people who haven't ever heard of it. I was surprised this morning to find my music was capped to 30 minutes a week unless I upgrade. I was alright with their addition to ads because hey, we all gotta make money. So now I'm switching to another free streaming service.",
        "date": "December 5, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRm1DYWFNQkk0RE40a2RGSXl4QTh2dFdZT0FxZVlfMXhVWUtZWWFhdFlHQ2JaVkp5aHZGeDdFRm02RVphb0cxaUdydjZqdEM4VmdfZTVkbHc",
        "reply": null,
        "star": 1,
        "title": "Used 8tracks for years"
    },
    {
        "author": "Bright Star",
        "comment": "Is there a limit to how many playlists can go in a collection? I want to clean up my likes, but I tried to put like 75(ish?) In a collection but now it says there's 15 in it. Other than that the app is great! Maybe you can add the \"add to collection option\" next. Its OK if you can't, the app is still good",
        "date": "May 18, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPSEhkTmZBVU1kUl9JRHEyaHh5NW80OEFHT2Y3VkpwTkdvXzRPYXFCSUlfcXItRGhTdF9FNHFnRS1USmpudUpxd2xyajUtRG84R3JBbngxYkE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Danielle Hardgrove",
        "comment": "LOL, isn't 8tracks dead yet? First they banned international users. Then they introduced listening limits. Then they cut those listening limits down like crazy - most people I know only have about 45 mins of listening per week, now.   It's a godd*mn shame, because 8tracks used to be the best streaming service out there, with a vibrant and creative userbase. Now...just go subscribe to Spotify, it's the only playlist service worth having anymore. RIP 8tracks, you got greedy.",
        "date": "October 19, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRm5LNWo1YXp0TDVyblpWXzhaelB0Y2NheUNER1dWQkR2T2w3X1FvZ2g0eGNtRmVybDlwYVZUWWl2Z2NWQmhSSnQxUUZybkFWNDRqTEZNSkE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Zoei Krohling",
        "comment": "Listen, I get it. Streaming is pretty cashless in the long run. It's understandable, you're a business. But the fact of the matter is, you don't get money out of supporters by reducing what they can do without cash. That is how you drive out a fanbase. I was even considering getting a plus account until you decided to shove limits down our throats...and only an hour of streaming a week? Come on, I did that in a night. I think I'll take my playlists elsewhere.",
        "date": "January 17, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRW1TdVBSTGNSd2ctdWV2MVdLcUFVbzFISGp1aHR6VVBnNmRYcXZQZXFnWTc4WW96QnJYaHhVZS1LaUx6SHhwa1dqU0FLVFB2WG1nM0dxQUE",
        "reply": null,
        "star": 1,
        "title": "Used to love 8tracks."
    },
    {
        "author": "",
        "comment": "I loved this app, I used it as my primary way of listening to music. But now unless I pay there is only 2 hour a week of listening. There is no way, I use more than that in a day. Especially during finals. I don't want to see 8tracks die, but I'm going to have to get my music somewhere else and I'm guessing a lot of other people will too",
        "date": "December 2, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRk80OUpkazVvTW5lNWwxcmpHZENjOC1tMEMzU2xGQ0o4ZDhyOGZScVUyTVlmTHp4bE4zbEktMVQ2SHA4UHROdTUzMEF5T1hKZzRfaWthZGc",
        "reply": null,
        "star": 1,
        "title": "No more unlimited listening"
    },
    {
        "author": "Monotone Aria",
        "comment": "In my past review I wrote a complaint about the app refusing to connect to my internet, and in a few short days the developers answer and fixed my problem. Now I can actually rave about how much I love this app! The playlists are not only easy to find, but they have how long the playlist is in minutes on the screen too! I find this extremely helpful for timing my productivity throughout the day. This app also allows me to favorite certain songs I find in each playlist and save them to listen to later. I do wish it provided a way to find specific playlists out of my liked list, but other than that I absolutely adore this app.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPR1FGUXF0dDFrS0lzSEhiVFh5ODA3WlFIdFFlak5KWlhETGVXdWFiUWlsbTdlaFpaQlp2dTZsdndobTVtbEtaMDhoblN5TmlySTBYRGZPRWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jessie Stanley",
        "comment": "I have been listening for years. I was cool with the ads because I get it you need to make money but to limit the time you can listen is so not cool. I loved this app for just that that I could listen however long I wanted. If you guys need more money up the ads don't limit the music that was why 8track was different then the rest now it's just another money sucking app.  Goodbye my old friend goodbye. 😔",
        "date": "December 9, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPR3hxN2pVWlpHQ1J4TmZnLU45R2hGVno2dWdOMW5mOFBLVmFaWnZmZVdfZDFEU0FTTGl2WVJWeDNtQ2lLc1ViMEMzd3FRVS00dElkMFJWbEE",
        "reply": null,
        "star": 1,
        "title": "Disappointed"
    },
    {
        "author": "Alyssa P.",
        "comment": "Love 8 Tracks to death. I have a subscription, and it's well worth the pay, versus ten bucks a month for Pandora. The only problem I've really faced is the lack of a working sleep timer. Please, good lord fix this, I'm sick of my recently listened to bring cluttered with playlists I've never touched. Other than that, good work.",
        "date": "May 23, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRk9EbWNGWjBSQVdOdkJ2Sm9vbWZJbFRRZGlUenNGXzJ5N09rd0l0YTJaQWM1b0Q5cHJ6WWhFaDk2bkpMcTlONjBKd3gzTXZuRW1NY1J5MFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ezekiel Morrow",
        "comment": "I used to love 8tracks, but limiting it just isn't cool. I understand the need of money, but isn't that what ads are for? I'm sure there are also people who would be happy to pay money if there was an optional way to pay to support 8tracks like donations or subscription to be able to listen to a soundtrack as many times as they want rather than the \"play 2 times then wait 8 hours\" block you had. There are tons of people who won't use this anymore, including me. A very counterproductive change.",
        "date": "December 11, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRXF4RS1VQVFRdEk0UGxmb0tUeDlPVG9pQmpjUWVWMFU1S1l6d0tKdGh3X19rdTN1clpicDd1ejR2TzhfZjhxbDNveHh3ZzIwbEwzbUdIMGc",
        "reply": null,
        "star": 1,
        "title": "Have to pay to listen now?"
    },
    {
        "author": "Mizz",
        "comment": "While this never affected me personally it is a horrible buissness practice that I strongly disapprove of. I understand that you probably lost money due to people purposely reloading to avoid ads but in all honesty that had more to do with the fact that these ads never worked in the first place. If you really want to gain more money consider fixing that service before you condemn your users.",
        "date": "January 8, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRWhKUGR3TFdsckFZSlpvYTJvQ2RyQkNCMmxreUVmeHRjS3lYM3Q0ZG1ldVRYdTRWVndOREN1dTZVQWpaN0I2MWFxaTZlb0pna0htVE8wa0E",
        "reply": null,
        "star": 1,
        "title": "Listening cap"
    },
    {
        "author": "Barking Squirrel",
        "comment": "This is still my fave music app. It takes a bit of crawling, bit there are some real gem mixes out there. I end up restarting a lot due to pairing issues with Bluetooth and random pausing of music and volume issues. It'd be nice to see those bugs worked out, but it's tolerable (most of the time)",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRTFmeDJhd0JMZkhOV3BaZ2QtR3lWMmZnYjRlYmp5Wkdfd3VVSmtCVFBmYkQyWXlCV3FNQXhBeWRMUkhZenlrOXhWNEVRSzFpaUtuMDhITGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jenna Sleep",
        "comment": "I have used this app for years. Its always had bugs, but right now its freezing every thirty seconds and i have to manually press play every 30 seconds. Super frustrated. Ive deleted it, restarted my phone and reinstalled it. Its still broken.  I dont get it? Others have this issue but you dont seem to be fixing it. It feels like you just stopped creating something and gave up. All it needs is a few fixes and it would be an amazing app.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRlo0LTJpaWg4REg3MkI4NjJYNDBsaFQ5VlpBclp5YXlUYVRUVE90MW9RNEREVVlaRDBBSWx1a19CMlZhcElLRDgyb1owM29WX3dHTlVBeWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Edward 416",
        "comment": "I love this app... But up until recently its been randomly pausing my songs every 10-15 seconds... I can't get through a single track sometimes and it's so frustrating while I'm driving. I thought maybe it could be my LTE network being weird but even with a strong wifi connection it still pauses my songs randomly. Any help?",
        "date": "December 18, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPR3gydkk5OXZ2aUJ1cW5xNklGU2x4bUFxR2xTcXJ3ZHN1MVpSTlFucHJlWmpqSE9EVnVqSEExblB2WVh1aHZPVmZ3U2xxa2NQWkdDRWVhOVE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Claudine Cyr",
        "comment": "Great app, when it works... Hasn't been an update since 2016 to solve the stream interuption issues. Music will stop playing randomly every few minutes, sometimes refuse to play again unless I skip.  It was a great app. Now I'm thinking of changing streaming service because it's become unusable at this point.",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRUIwRVpaWlhwRURKSzJvVlhwd3hhekc0aVRadmUyWUt6UXJwN2Jac0lWZTEtbmRQdy1faVl4ZF93eG9KaUo1TjZOaVRDNjZQcnFPX1pFR1E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ny Silven",
        "comment": "Who did you sell  this too? How did you guys manage to take a brilliant app and destroy it completely? Are you paying people to write good reviews for you? Because everything sucks and the only thing that's saving this app is the people who make the playlist, but please if someone is a developer please make an app just like this without the 30 min listening a week and 6 slips per hour, and the disconnecting of the Bluetooth and the constant automatic skips for no reason. Please someone make this app but better because the developers have given up improving and destroyed this app.",
        "date": "July 31, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPR1c5dVZocVdadGN4OU1reGdhQWUxcHhHUzh5ZlJJOGRzVk9zeVBjQW40cS1MWDdRRjJ1S3lnRHVJcWJ3bVR6TTJOdmRaUmF6Z0lJWmwza3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Aubrei Perkins",
        "comment": "Never switches songs properly whenever I switch apps. Always says there's no Internet connection even when I'm connected to my wifi or 4g. Always skipping tracks or saying an error has occurred. Overall, a terrible app. Nothing like it used to be.",
        "date": "December 27, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPSGhDdXE1a24zSFBjSl9HTUpCdV9FNTlhVG1Lb21FSTFYRkpiMExPM2tnZG9POHliUy1Kek40WnBVVlEzaGt6c19QaTVSZE5uWW54U3V0c0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Payton Eberhart",
        "comment": "It's simply not working for me. The app will not allow me to play the playlist I want,but is able to play literally every other playlist on the app,which I don't lean towards as much. I just wish I could experience the full apps potential without the resistance to play my preferred playlists.",
        "date": "January 16, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPSHVnM1c2emhST3pPcmhwbzY1RHpnQkZHZU8tcU1aLWpYMWZiZEsxVzBOMTQ2TnIyZ1pzQTFHckN0aVpZODg0UEdMbVR5WVMwUkZHSkZxLWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Ryan Walton",
        "comment": "I think the ability to tag tracks has much potential, but I'm not sure it's being fully realized by this app.  Personal tags vs. public, playlist tags, and public tag review would improve this.  Low quality tags hurt the system, so should require approval by peers to help confirm their quality.  Still has some bugs, but seems like a good app, and is free, so some issues can be forgiven.",
        "date": "August 2, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPR2FOaFh3dVFscXNDX3h1dVF2b011UUYyRFF3RGlsNUN0bUZ0X1Jrekl4eDVSN0FZODR0RGJCZUgtRHN6T3FJR3gwVXNaOGVFVEdRdjlMVWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ameet Kang",
        "comment": "Love the website, but the app is terrible.   I don't use the 8tracks app very often just because of how terrible it is compared to the website. When I search for playlists, I want to be able to sort by hot or popular playlists. I don't want to listen to playlists that have 3 plays and 0 likes. Please, figure out a way to show more relevant playlists.",
        "date": "May 9, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPSEpXMjA5QndmNzBNQ1ZLQzVnaEpuc3FDLWtfN2x2a3FWVFIwUlNITkg0R3I5UEJqVWpaVTBMN3dXbWV5cmh3MHNmSXh6dHd4SXpyVzhZSlE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Brenden Simmons",
        "comment": "I've been using this app since 2011 while on deployments, gym, shooting, running, ect. It was literally one of my favorite apps on my phone. Best for the gym, or long runs. I recently recommend it to a friend. He came back the next day and informed me about the 2 hours of limited time, before it asks for $9.99 a month. I didn't believe him at first but once he showed me, it was an immediate uninstall. Ok, so the crazy part is that the people (ie the users) makes the playlist, not 8 tracks. So what am I paying this company for. I ALREADY am dealing with the ads and not be able to skip tracks more than 3 times. I will uninstall before I have to pay $10 a month. I will go to Pandora, or Spotify which both have a much easier usability on their mobile app. Please fix and I'll be happy to use again.",
        "date": "April 14, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPR1RxYXl4SmRKNFJnZkg2Mmg0TXVVR3ROejd4dkNkSVpVckhrdFlMbGJtRVZZdTdKMS1rTFVGaGQyaE44R0dLRVp3dFFQTkxpeWl0M2Vyd0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Amber Heidenreiter",
        "comment": "Honestly, this used to be my preferred method of music listening, especially because I could find playlists that pertained exactly to whatever artistic work I was doing at the time. But really? 2 hours? For an ENTIRE week? 2 hours for a whole day doesn't even make sense. I sincerely hope another service like this pops up, because this was such a great concept that has been completely ruined. Good job. U did it.",
        "date": "December 31, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRXROaWQ4RWRHc0psMVNDTFBfNjNuc3FiMW5hc2hYYThvQWhIN3E4SThDV3Q0aVZjeE1RSEdlV2VsLWNMTk13TnRySmlsSUlQY25HWDFlY2c",
        "reply": null,
        "star": 2,
        "title": "Ok but why"
    },
    {
        "author": "Nico K",
        "comment": "I love this app, but it's started making a static noise in the middle of a song. At first, I thought my Bluetooth device was doing it, so I turned it off then my phone started making the same noise! Close the app, no longer any noise... Never had this problem till now. I hope this is gonna be fixed because this is such a great app.",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRk1yNW5aYS1wdWlBbVJBMXh5eHUtTi1FcEpOdFNRZDB5MzdZWXhPVTVMT1BlVmV6RDFnN2h5eDdCOGtubmJWM29XMlBacmRtWXBSR0plNEE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sly Fox",
        "comment": "They recently put a listening cap on 8tracks. One that only resets once the week is over and only allows 2 hours of listening per week. The only way around the cap is to buy a monthly($5) or yearly($30) subscription. Two hours is too low of a listening time. People will be lucky to get 2-4 playlists listened to. All in all, I am beyond disappointed and will discontinue use of 8tracks for these super limited changes.",
        "date": "December 8, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRTlsQUFaY0NMUWRWZURLSU1CR2RBZVZJaWpfck5XcnJja2RBYTUzWWVrVW94U2J4U1F0alpWQ0pCdDhSWkt6MWNaZGxSV21FcVNlRUJjMFE",
        "reply": null,
        "star": 1,
        "title": "Listening cap and forcing subscription"
    },
    {
        "author": "Camille Cortez",
        "comment": "This was my absolute favorite app to listen to music a few years ago. When it started getting ads I didn't mind too much but recently they've begun only allowing 30 minutes of free streaming a week unless you pay for a subscription. If I'm going to pay for something I'd rather get Spotify as it's basically the same thing with better features.",
        "date": "December 5, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPSGpPWVBSNWphUWk2cTJVd0VST3owX2pRalk5d2owSm14RHNXQUdubUFDbmMwQWMxdDdEOFA3OG1yWmJKSVNfWW5jcW40ZlRONVZ1TVFfYUE",
        "reply": null,
        "star": 1,
        "title": "Used to be great"
    },
    {
        "author": "Emma Norris",
        "comment": "I used to talk 8tracks up to all of my friends because of how easy it was to find new music and artists. Capping people's time unless they pay is ridiculous and wrong. I understand that you need to make money, but this will just drive new users away.",
        "date": "April 18, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRzZicDR4Qlp5YWc1clVqeG5VdzRNQy12RjctM2RwTnBvcmJiV2F6Zl9ad1R0TFhmMHNVSjEwVzdpcnUxTTNBTjlKbE1tenVfMDdfRXVEQ3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Katrina Leiter",
        "comment": "Sad to leave 8 Tracks. Been a long time fan but now they've basically killed it by going to a service pay and ad model. I understand that providing a streaming service gets expensive but losing a huge portion of customers due to this means less revenue ultimately.",
        "date": "January 6, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRUQ2NnZrQmd3UHNlbXdubHpQcjF4OGRvZUxWRkRVc0pBdzdOR3h1VTM2SUlObnQxSldaUnc3Mi1QTmxGQ1VDVXpIcDkteXp1aFRvck1QWkE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ashwin Nayak",
        "comment": "I love this app and am an avid user. Love listening to people's playlists and choices. Btw, there's some issue with the notification widget in the recent update. Play/Pause doesn't seem to work as it should. It'd be appreciated if this bug is fixed soon.",
        "date": "December 4, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPSDJHdXZneDAzcFJhY2dWcUk5cDQ4MlU2d0RRZDRnbkMxNGRCUFpJeFJQbXcyb2l5bU9ZWnZjY01WSEh2LWFweHNyMnBIMndMbjZiY0tDOWc",
        "reply": null,
        "star": 5,
        "title": "By far the best collection of playlists."
    },
    {
        "author": "",
        "comment": "I didn't even know this company was still online, they emailed me 17 days after they were hacked to let me know my information that i thought was deactivated was in fact hacked. i would not trust them",
        "date": "July 15, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRmtkZURTOWdHcDlMVWxBSTYyME5MVUxJUWlvUDl4QzFLaHE3cFc4MkJmNnhPMHpjT0VubmRqVjczaGZfeEVjd3h4YkVfNndzdTZDVkVIZ2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Finli MacKinnon",
        "comment": "Its great for finding custom mixes of different topics but it keeps pausing for no god damn reason and won't unpause til I open the app back up. Really annoying when I'm just trying to listen to a song and it won't stop pausing.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRWdZNnpVc0RpLXR0RkdLa184dGVtQnFuMmZZOW1mS2ZkOVlWeVhwV0pBWVhZWE53U1RvVjdrTUFDV2l2ZUMwTnI2cTFNeGp3TUNQMHRvS2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Joey Morin",
        "comment": "Yes ! Do download! !!... but plz programmers make this app worm on my phone Samsung Galaxy s6 active... very disappointed in not being able to sign in. I used to play this app 24/7... wtf, plz fix",
        "date": "April 22, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPSDI1anpmTHppLTl0dEFvOWZmUGFsQTc5SzhZRUNOMFcxXzNLVUxLNVlVNXFvUXdNcnFpdm5Sb2F5TTJPaU5BQlN1T1FnMENGcTB0dGlmalE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Harper Grace",
        "comment": "Loved this app for 3+ years, didn't mind the adds between playlists or in the app itself, but this limited listening thing is absolute bs. I understand the point of it, but to force users to pay in order to get than an HOUR for an entire WEEK? Scummy and low. Will be moving to an app that doesn't punish it's unpaid users",
        "date": "August 1, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRUJmVmJCdjN3dVlQaVNzc1NyYlBHck1yUEhmWlZ2TlJMeGl0T1RSUWtIMGxldDR6ZXlyWmJ4QXdRcUVMXzRvLWpjNnJSMkNNXzM1SEUxM3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Megan Whitten",
        "comment": "I love this app, I do, but but recently this app is getting extremely annoying. Ever since the new update it is constantly skipping tracks for no reason, can't load half of the playlists and then just crashes whenever it pleases. I think I've only been able to have the app play a playlist the whole way through once since the new update.",
        "date": "April 11, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPR0ZXSkVCMnhWclRzbnRfS1hvVWd4UTBLZXdqRHNRZ1g3MkNURkViaDZBSkZQQXhjcmxCVS1Ebm1TbUZoRnFsZ2JoM2hpQ0FtNnRFZGJhMWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ryan Osman",
        "comment": "Would be five stars if they didn't push video ads on a music platform... requiring me to watch 30 sec videos before being able to close my screen.  What a joke. Terrible marketing, honestly. Hopefully a developer reads this...",
        "date": "January 31, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRTZrdF9wQXhJSjYzaGo5RlRFR05BNmV0QlQxMC1yQU1RMHZmVXZFR2ljUkZQNWNZLTZjbG91WlUwX3dLRXhsaTljcnluYnE4N2lGRDRLSlE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Andrei Stroia",
        "comment": "Skips songs on it's own, I need to press play every 30 seconds and it's not an internet speed issue, can't skip more than 3 songs now, lovely. Are you guys trying to kill this app? Because you're doing a bang up job at that more than keeping it alive.",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRjN0c0tKR1VuWFhoUGhXVGZkREV5QzJzaFVweHRROUlHQTBNTnB2dWw4Y3BsZjFzMUtndVhrM3pnaTR2Nm95ZGRkWnF1MFVJM29MOVhNcVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Erin McMahon",
        "comment": "I think there may be a bug or something, I loved 8tracks mostly since it allowed me to discover new songs in the same genre as those I already loved. But recently the music gets cut off every couple seconds, that's if it'll load to begin with. I've checked my internet connection many times (since it was telling me that was the problem), the problem really is with 8tracks. Bummer.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRXhpa2wtQnFZaTdRQnRzaXBkbmtIektWTWN0dUxyVVpGYk9QUl83V0ZnQU9EQUg1UkF2Q3Y1Qm44bXQxMkJnUElMLUtnc3BjRGNNLWdxUEE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Emma Phillips",
        "comment": "I loved 8tracks as a concept and used to use it regularly. I've discovered tons of great music and have written many papers and studied for many tests using playlists that I found on it. It was my go to for music for productivity but 30 minutes of listening per WEEK is just insultingly low. Most mixes are at least twice that long. I don't see myself buying the premium service so I'll have to find an alternative.",
        "date": "December 8, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRWpZOTk2Q1gyTVdmalZXVGt5MHphWjJUaGdoQnJiYkxBMXdiMHdnNWZiVDdBeUNSVEhiZk1KM0RGdEhNM2pZdmNpRXp6SURpVTlxdVhiSXc",
        "reply": null,
        "star": 1,
        "title": "Very disappointed..."
    },
    {
        "author": "Marley H",
        "comment": "8tracks used to be the best way to listen to music, but the new listening cap is the worst decision they could have made. Their user base wasn't large to begin with, but it's even more limited now with their 2 hour a week cap. I Don't think I'll make anymore playlist for this app ever again.",
        "date": "December 9, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRnM1QWw0NnAtLWJ5clEwUTJ1T1hSYzlhSkFZcEFBTEZLWmc3M0RZV0ZUaVVWRmxkYk9KRnJOM1Z6bndkYkYtc3FVRVMtWi1hVkZYM2N3WWc",
        "reply": null,
        "star": 1,
        "title": "Used to love it."
    },
    {
        "author": "Critter Zion",
        "comment": "In a world of music aps, there lay one galaxy that possess thy one an only best music Playlist app ever, 8 tracks, a Playlist for every mood, a Playlist for everything. When you thought there were no good music aps left, 8 tracks is there to change that. Used to this way. Now a days, this APP IS A MONEY SUCKING, TWO HOUR A WEEK B.S",
        "date": "February 21, 2017",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRUJ6YnBfTS16NE5nM1pfUXlYWTlkLWNxM2VkZTVNVlJsbVFLRkFxZDJtTWg5Tkh6STlCbGNQN1I5cWxYRWxNaWo2aTcyOEFJVTNKWlR3R0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tobi L",
        "comment": "I used to love 8tracks, but this app bugs out on me VERY regularly, and has been for over a year (despite switching phones.)  Plus the new stupid idea to force you to pay to listen to more than an hour or two of music. 8tracks is really deadset on making their site and app as unusable and unappealing as possible, so like a lot of people I'll be looking for a replacement :/",
        "date": "December 5, 2016",
        "permlink": "/store/apps/details?id=com.e8tracks&reviewId=Z3A6QU9xcFRPRWhfanhuVzhWbjVkdjk2czBDaFdvb0pZSk9rR1VtU1p4OTJDbGtPMk8xTVhPNGNuR1NuQjR4UExUZEluNFNXU3dmQ0hBci1tX043M1FoUUE",
        "reply": null,
        "star": 1,
        "title": "Dissapointed"
    }
]