[
    {
        "author": "Folashade Ayinde",
        "comment": "The App is good, easy to use and products are fairly priced. However there is need to work more on the delivery of goods as some of the dispatch riders do not measure up. My goods were returned by one of them to the store and my order cancelled while I was still awaiting delivery and refund is yet to be received after two months, it's really frustrating sometimes.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPR1psQ3k4OXBNZkJFbEdmeGJsQVFEdDJvNlNja2d4MUh5STdDVzZmMzNKN3UyTVduSUQtM1kwNXMtRFpEWTg2Tm1sbW56dEVRLU4xdXY1T21Z",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Folashade ! We're so sorry about that .. you're right, it must be frustrating. Please let us know what country are you from to pass along your feedback to the appropriate service. We really work hard to avoid this kind of mishaps, but very occasionally things can go wrong .. so we apologize for any inconveniences we may have caused you",
            "date": "February 9, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "cecill",
        "comment": "JUMIA KENYA have just become thieves or extortionist. How can you charge delivery cost more than a shipped item? Why did you change delivery Costs? That's y i simply look for an item on jumia, check specs,check prices, then i simply go to any best shop selling the same item and bargain downwards. Hence don't pay those hefty delivery charges. I have used jumia for 5yrs. But starting 2018 have changed tact.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSEw2M0lzQWdGSkwwNHl3dm4wRkdLU0U1NHZ5Y3l0QlVRTEhtOUx6TWRzRUprMzU1QXl3bDBuNGloTWNiVnFscHpMMUo0SGdrZnIweDBlWC1v",
        "reply": {
            "author": "JUMIA",
            "content": "Hello dear Cecill ! Thank you for taking the time to review our app. Actually shipping costs have been split into different ranges and automatically generated depending on the location & the nature, category, and weight of product. But still, your feedback will be forwarded to the service concerned to take it into consideration.\nHave a nice day !",
            "date": "February 12, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Nnacheta Godson Okechukwu",
        "comment": "Great App for easy shopping experience. Though it needs to be permanently installed in my phone. I don't know why the App will always disappear back to play store.  That I have to always go back to play store, search for it, activate and open it before using. Kindly help me to know why this is always the case with me. And I use a very good Android phone bought from Jumia.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSGJNUWU3RG9kX21HNTR5bElCRmh4OTN4RWExZFBWb2ZlVVlZZGd1RTVSNEhhaFBrQmdtQzRPd19pQmhBSzJ3UmdhQ3ZoUkxLcFFEbkd5ejVF",
        "reply": {
            "author": "JUMIA",
            "content": "Hello dear Nnacheta , First of all thanks a lot for your review and high rating , Moreover please provide us with your country and network provider to be able to help . \nHave a nice day !",
            "date": "February 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ben Kingsley",
        "comment": "Ben Nigeria! Well so far so good! Jumia is doing well for me, whenever I make order, I get response immediately and in short while I got it well parked.... Its an amazing experience for me.... D last order i made from jumia was brought by ZOOM, another company i guess, which left me with doubt, not untill I saw dat d package was truely from jumia..... Just think u should stop dat for security reason... Thanks Jumia for saving me from stress of getting stuffs .. I love Jumia",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRXFhWFBvbzJuYV80eVpnU3A1YzEyaU5QWU5MeGRfaWNSQkx4VkRmb1Ewa1JNdU9LUGpMTU5DT0FYUXJyUnhwMzFaTkh6b0pNYzd6S3VYVUgw",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Ben ! Thank you so much for taking the time to give us your feedback. Actually, Jumia has partnerships with some delivery services companies to handle the huge amount of orders, just to make sure that there is no delay in the fulfilment of your orders 😊.\nThank you again for being a loyal customer & Jumia loves you too ^^\nBest regards !",
            "date": "February 26, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Jumia is very reliable and I've known this online market to be very affordable but recently the shipping fees on Junia has really gone high, even when shopping for a single item, and some items are not even up to the shipping fee. This is not encouraging at all, I really love this app but one thing is, people consider shipping fees before  shopping and I really don't know what happened. Still the best shopping app though but I like the old Jumia.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSEFiWW1lQXhCajNSelJVb1NScktpUng0Vm9yLU9lYnp4b09FcGM4dzViX2JjcGxneVNYUzVNZWRGSHJfWWJwQ19rTm5sT1RvRDNGdFNZeFNj",
        "reply": {
            "author": "JUMIA",
            "content": "Dear user! Thank you for taking the time to review our app, we appreciate it. Actually, the shipping fees have been split into different ranges and are automatically generated depending on your location & the nature, category and size of product. But still your feedback will be forwarded to the relevant department (kindly let us know your location)",
            "date": "March 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Hello am Mutaturu and just want to thank you for this innovative idea. At first I was doubting but came to have confidence when my placed order was fulfilled successful. Another thing is that I found Picking chargers to be a bit high especially when ordered for 3 items,last but not least THANK YOU JUMIA.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRkowQ3NDSldEY21qU2g0eklNSlBXX1BKYThabVdpS1lwZ2FLNnhicm5MWTRWV2UyMGdBY1dRQk1oeGFiNDFweG5wc0tKQWlGNDQ5TWtUeXdv",
        "reply": {
            "author": "JUMIA",
            "content": "We thank you for trusting our service and for giving us the opportunity to work with you, dear Mutaturu ! It's really a pleasure. Kindly note that we are always working on adding more products from different categories & a variety of prices, and we're also pushing on the sellers to give our customers the best prices in the market 😉\nBest wishes !",
            "date": "February 28, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Obinna Onyegbula",
        "comment": "Sub par to say the least. You people can do much better. I have been experiencing issues while trying open the app on my phone. The issue where it keeps saying \"error fetching data\". A customer seems to have figured it out. I think you should listen to them. He said everytime he uses his Glo line for data, he experiences that problem. I am here to say me too. Thank you",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSEtZdmF3SVYtSDN2RFk0dVdNa2UyaFR1Vmp3am9DRS1SRlctSHJzX2VjaWlKTGtqU1o5ZEp1RjI1TDFOSjk1M1dDZVRZNzRGMXVaNmVtSjhB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Frempong Emmanuel",
        "comment": "Well Jumia is great because it's made online shopping fun using this app. I think they're the reason other guys are even investing in online marketing. My only plea is that they include products from other marketers like 'fos' sneakers and stuff cos some of  the prices are scary looking at  the financial standing of most people on  this part of the world. With that said I still believe Jumia is the biggest online market in Africa.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPR3YxUWhyUmdaYnJyQXh6UmpLdzFZOW1sVUJNdzVnYmFkdnYtUFRzTkU5TzA5R1BKbFU2dVhldlRRc3BkT2VHaXRJc1YzYy1MdURXOHc4dlJz",
        "reply": {
            "author": "JUMIA",
            "content": "Thank you so much for taking the time to share your opinion, dear Emmanuel, we truly appreciated ! Kindly note that our teams are working actively to provide more products from different categories & with a variety of prices. We'll do our best to meet your expectations and bring what you're looking for very soon 😉.\nHave a great day !",
            "date": "February 15, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Lawal Muhammad",
        "comment": "Jumia is doing good, but you can do much better. There are a number of simple items found in other online shops, such as AliBaba, Amazon, etc, that can't be provided by Jumia. And I really want to patronise Nigerian establishments. Please extend your reach to much more areas.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRnNZOS1uRzF3SlFpbkRzLXZqSU12VGNUdGlpaGt5NUhvSVlXbTFqUTJwR1FJYUQ3Qnp2UjhlaUFWLU1uQk9Ocll1UGg4SUk3cFk1TUxYZzAw",
        "reply": {
            "author": "JUMIA",
            "content": "Dear Muhammad ! Thanks a lot for being a loyal customer and for taking the time to share your ideas, we truly appreciate it. Yes, there's always room for improvement, and our team is working constantly to improve and provide the best possible service you deserve 🙂.\nThanks a lot for commenting .. you're just the best !\nHave a great day !",
            "date": "February 3, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Martins Oghenetega",
        "comment": "What is wrong,  when I buy goods, they never get delivered to me. I have bought close to 10 things but none has been delivered, I only see an email which says to be delivered, then later it say failed to deliver. This app is getting useless by the day, please do something about it.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRWxrX3B6bURLZk1IWnVkcGsyaGJZbjBsTVpfWjAteV8xenRfcVJoSVVnN3NCZlpCRnN1WHZhMm01aUVhYUQxMHljeVdYc2x1d0RSdThrZDQ4",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Martins ! We're so sorry about that. Kindly let us know more details, have you received any confirmation call/SMS/email ? If yes, have you tried to get in touch with the customer care service in your country to get more info ? \nWe need your feedback to assist you better !\nOur apologies for the inconvenience.",
            "date": "March 1, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "B. David",
        "comment": "The only remaining and not negligible point here for you to solve is to make sure you deliver the same command of more than one items at same time. If others are successfully doing that, we think Jumia also can do that. So, for now I give you a 3 stars.",
        "date": "December 24, 2017",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRWtGVWJCd0E1VXpCT0Nxald4cE5laXZUdjd1OHN5QmZkb1NWQXY0TC1nQl93enF0TEFJTkU4OUZWTzE0ckpLVlBDeTZjYlNsWlVRc1ItaTU0",
        "reply": {
            "author": "JUMIA",
            "content": "Hi, dear David! Thank you for your feedback. Actually, items sourced from different sellers are shipped separately to make sure that there is no delay in fulfilment of your order.. we're sorry this wasn't to your liking. But we are constantly improving our processes to make it better for you. Hoping to see you entirely satisfied very soon.\nRegards.",
            "date": "December 24, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "keny ken",
        "comment": "People rarely review the products purchased previously  and filter search is whack .. it doesn't do what I want. Take for instance I want only items within a certain price range  and shipped within Nigeria ... yet it still brings all price  ranges and shipped within and outside Nigeria.  Kindly fix your filters",
        "date": "January 6, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRzBHZVVkdzUweVE5Rm5udm5sZmZxdmxZOHQwMmctNkRDTVNOWXpYcmt1TlBFd29fYjJySGRfcHlwNEJNOXBZSjNWc3g4N05xbDBuSjQ2aDNr",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Keny ! Thank you so much for taking the time to review our app and for sharing your opinion. Actually, we're recieved similar remarks about the search function, and we've forwarded this request, already, to the app team to take it into consideration.\nThank you again & best wishes !",
            "date": "January 10, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "James Etuk",
        "comment": "Well so far, my deliveries from jumia seems to be great condition. I will continue to do business with them as long as they do not give me a reason to cry. As for the app am also experiencing \"the problem fetching Data\" when using my Glo sim",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRmpCazdiSURTRHF3N0FJMjJSb1A2a3N6czV5VmJzVGN4amZUdHhoSk5IdnRVVXlCb3pQUVd5VE45VlVpRGpRelRDazN2NkF2N1RrNGpEMHpR",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear James ! We're super glad to receive your feedback. Actually this Fetching Data issue is faced by a number of our users lately, we suspect that it might be related to network provider & our tech team is working on it currently. Kindly try to uninstall & reinstall the app.\nOnce again, we apologize for the difficulties we have caused you !",
            "date": "February 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "oni victor",
        "comment": "Anytime I click on a jumia link from Facebook or Google ads, jumia app launches by itself and I get this \"problem fetching data\" error screen. This has been happening for God knows how long. I would've to Uninstall and reinstall to fix . It's not cool jumia",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSG9XRnFlWXJlWlRTc3Y4Z1FJWk9yNG9hcGhyNjV2blRWUy1UaUJFZ1lPWWFJa1RzNGJ6enN2bFFxWEEycFhCeldhUEVsb0xsbkJCajZmbHBZ",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Victor ! We're so sorry about that. Actually this Fetching Data issue is faced by a number of our users lately, we suspect that it might be related to network provider. Our tech team is working on it currently and are trying to resolve it asap.\nOnce again, we sincerely apologize to you for the difficulties we may have caused you !",
            "date": "January 23, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Clementina Ashdiamonds",
        "comment": "Jumia takes too long to deliver orders plus there's no direct way of just calling and talking to a customer service person instead they'd be directing you here and there till your credit runs out!!! Most of the time too, you zoom your products too much and ends up looking different from when it's delivered! You guys should learn to keep up with good customer service otherwise, you'll lose  customers!!!",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSFhzRGtIX2hmR1pLUDc1V0tTMjY3cjRDcERKRFQzTW1reGp2aVMxaE1IUzJkWHlTRkdZb1hNYVVYbUlteDBZNVkwTExnNWVxQzVPRjBJR3hz",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Clementina ! We're so sorry our customer care service was lacking and didn't meet your expectations. Your feedback will be forwarded to the appropriate department to be considered, kindly let us know what country are you from.\nOur apologies for any inconveniences we may have caused you !",
            "date": "February 20, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Emmanuel Idugboe",
        "comment": "I updated the app but it stopped working. I'm unable to access anything. It show this message \"sorry unable to fetch data\" and it always show the message anytime I try using the app. You guys should do something fast about it.",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPR0VfOGp1VUFSN1ZJdFpqSXhLRFdZcEpabVdSMkhJbl9UUGhFdG5tbmxLelFBU0FMMEtsc0ltTmhjNXFxWnBKM3c0UlR5VHdpTVpEc2o1ejdV",
        "reply": {
            "author": "JUMIA",
            "content": "Dear Emmanuel ! We're so sorry about that. Actually this Fetching Data issue is faced by a number of our users lately, we suspect that it might be related to network provider & our tech team is working on it currently. Kindly let us know what country are you from & your network provider.. so we can transmit this to the app team.\nWe're so sorry !",
            "date": "February 3, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Nermeen",
        "comment": "I wish I could give your service a zero or sub zero stars.. Terrible shipping services.. Flawed products.. Making excuses to not return broken items.. Everything takes so damn long and countless calls... First time to deal with you and mistake will not be repeated!.. Close your company!",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRjJ5bGZ4QW5qbndLNll6anZXNWF4cDhQVWlPSlRRSWE5TE1vU25RRks4cDVkUkV4Mk12dHB2MXBJOWRvV3lyeEhoVS1MZlJ1S01OWXVrX2ZN",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, Nermeen ! We're so sorry our service was lacking and we didn't meet your expectations. Your feedback will be forwarded to the appropriate department to be considered.\n*Kindly let us know what country are you from.\nOur apologies for any inconveniences we may have caused you !",
            "date": "February 15, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Readen Samuel",
        "comment": "The app has been performing excellently, but this year it has come short of that high performance. The app will not open like it used to last year, I have uninstalled and reinstalled severally with the hope that it will solve the problem, but no, it hasn't. Though some times it will open but most times, especially, when you needed it most it will not open. Please don't tell me it is network problem, because other similar apps do open even at the period when jumia will not! Problem fetching data appears at the beginning. I am using version 4.4.6 and from Nigeria, using both Airtel and mtn services. It's the same problem with any of the services.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRWZOcXdEOHFrNlhwQk44Tk1CTnFCSk5SVksyY21MdERoYm9ZNF8xYW5ySzhMQTJtRklmNTJudFM5czNrdC1vSW5aVmt5S1V4R2Nfc3lEMWtB",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Samuel ! Thank you so much for your feedback.. this will help our tech team detect the problem. One last thing, could you please try to open chrome and try to access ( www.jumia.com.ng) ? and kindly let us know whether it works fine or not ! \nOnce again, we apologize for the difficulties we have caused you & thank you for cooperation !",
            "date": "February 10, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Korie Darlynton",
        "comment": "It's a cool app but I felt disappointed cos I just used it for the first time today and I tried applying the JAN2018GIFT coupon but it didn't accept it so I had to just go ahead with the order like that,  was hoping on cashing on the 15% discount though.. . So sad",
        "date": "January 12, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPR3ZFQmpNa3FybVJCbmo3S0RMREpic0I4OTNPcDBBTU96VGE0OXdsell3Nmp2T1JFN1J5VzY4c3BuYnEzcnEtZ3JxOFBHdTcySjI5dHVFWVlV",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Korie ! We're so sorry about that. If there was a problem with your coupon, please get in touch with the customer care service in your country inform them with the coupon code that you have used and they'll  immediately replace it for you. They'll issue you a new coupon with the same value of the old one to use it while placing orders",
            "date": "January 13, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Adesina Itunu Oluwagbotemi",
        "comment": "Jumia has always been a saviour when it comes to shopping.  So easy. Thank jumia. One thing though, please endeavour to deliver items ordered together once. It will make sense more you know. Winks",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRmpLcVdfYi1HMFpGaW5uSmtTNk9aSkthTFpQTjAzTGoxQ3VRYVh6cFhfU1Q2bjZ6SDlGV3RpY3ZISGJzMWloZG9tZHZGdEtqM3UtOWJLUW5r",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Adesina ! Actually, we should thank you for giving us the oppotunity to serve you. As for your remark, yes, you may receive items in your order separately because they are sold by different sellers and we ship as quickly as items become available to make sure that there is no delay in fulfilment of your order 😊.\nBest wishes !",
            "date": "January 13, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "vanessa murphy",
        "comment": "Nice app but poor customer service... I made an order for a long time now and it is yet to be delivered. And I've also sent an email but I've not gotten any reply and no one has called to rectify the matter",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSHh6Y0MzVGZUb044dUwxc2RQX2NTN1RJYUdrQXJxR1g4QzZ1ZnhVWEdjdWdGTmRpWkREVXlaa21nWFJIZDBrVGhGZW04MkgtMmszczBPOGhV",
        "reply": {
            "author": "JUMIA",
            "content": "Hi, dear Vanessa ! We sincerely apologize for the delayed delivery. Have you tried to track your order to learn more about its status (shipped / ready to ship ...etc)? We can do this for you, just let us know what country are you from & your order number & your email address.\nOnce again, we are sorry for the inconveniences we have caused you !",
            "date": "January 2, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "suzi Y.B",
        "comment": "Amazing app. The only problem i have with jumia its the delivery charges. I dnt knw why i have to pay delivery for each items when i buy from the same seller. I Hope you guys can fix this problem other than that keep uo the good work",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRmFBdGFHTUJiSmZESmFMWVdiTWtJNFRZODFWUnJ1WUJEZlBMZFE5dVR5TDdRcGUwZW50dWhOWTdYM1ZpU2tGWE95N3VvN2M3bk9YclNmRWlN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ashraf El-ghaname",
        "comment": "I was using it till a little while ago aa long as it was having the pay on delivery option. But i think it is now cancelled. Which means that I no longer be able to make orders. Otherwise.  It is so great and benificial",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSElhdGZtcS1kTmFKOXdfQ0lCZDZGZU1HNkItYXpYeFlPVFhmaWc0UDZPSEVIem1PY1laS1hzQkpPa20wck94QV81NTgyNWhZMnBSeVJxb2lB",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Ashraf ! Thanks a lot for your feedback. Actually, the Cash On Delivery option is not cancelled. It just depends on the item you're ordering and your location. Also, this option can be disabled if your cancellation rate became -relatively- high.\nThank you again & have a nice day !",
            "date": "January 18, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Gérard TCHODIE-MAGLA",
        "comment": "About what you would expect from an online shopping app. Nearly completely free of bug. However, it would be nice if the app made use of GPS and Google Maps to specify delivery location. Also, some products turn out to be fake, or of poor quality.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSF9Oa0NoRGdMaktocWVKRll2bmEtMTd4NzdNX1lBY2ZzVGJWYnRKeWkwdy1KMDFhNVlRNk92R29tRFdKdTRFSkRuSDd5ZFJ2SXNWMlJHWVJV",
        "reply": {
            "author": "JUMIA",
            "content": "Dear Gérard ! Thanks a lot for your feedback, we truly appreciate it. Yes, on the app you can only see the status of your order, but your request will be forwarded to the app team. \nWe're sorry about any bad quality items. We're doing our best to avoid these issues, and any seller found to be selling fake products is immediately delisted from Jumia",
            "date": "February 21, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Obuks Omoko",
        "comment": "I order for a phone in jumia so suprise it a different one entirely. To worst the whole situation it's not working. I tried calling the customer but their stories is getting too long pls.how can I get my money back I don't need any phone",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRnE3WGg1eFhUWVBid3dBZXBweTRidmdzcXo2LUNOZWVFUUdacmJKWUZiSVhDWnNmTER4WmdjZnFiUlF3eEQ5czBaVFFYd3BiWG80bkdsQm1R",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Obuks ! We’re very sorry for this experience. Definitely not what we want our customers to go through. Please let us know what country are you from & your email address and your order number. We'll transmit your issue to the relevant department in your country.\nOur deep apologies for the inconveniences we have caused you !",
            "date": "January 17, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "folasade ogidan",
        "comment": "Been good so far! But wouldn't allow me use my voucher code twice even when the first input was incorrect....so  sad coz it happened yesterday so I couldn't place my order anymore.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPR3Y0QXhrbHVuOFVCenRWbVdOaXZwRjZzQ3dvWlZLV2RBTS1keVkwUHNvbnN4U3RnWE0tNlc4UFAwS1FwUl9WdW9SdTBQWDNPVTRReW5BZUdF",
        "reply": {
            "author": "JUMIA",
            "content": "Dear Ogidan! Did you make sure to enter all the characters & numbers in your voucher code? If yes, kindly get in touch with the customer service in your country inform them with the coupon code that you have used& they'll  immediately replace it for you.They'll issue you a new coupon with the same value of the old one to use it while placing orders",
            "date": "February 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Ernest Asare",
        "comment": "App version 4.4.6 .. Android 7.1 ..  Random full screen ads, even over other full screen apps. This for me is totally unacceptable. I disable notification but still get those annoying ads from jumia. And NO it's not by another app.  Take care of this or I will uninstall and stop using your services. I think features like that are disrespectful to us users.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSFpNZGdWVlRVSjc1X0xMM21VV014bEZoc2lkdkFtY2Q1VWtxWVk3YUVEc3BQMlNIbUVORi1EM0JRbFhYMFVvRU9kSXloa2s0bHlrX0loZHF3",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Ernest ! We're so sorry about that.. you're right, it must be annoying ! Your feedback will be transmitted to the app team to look into it.\nOnce again, we apologize to you for the inconveniences this may have caused you !",
            "date": "February 16, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "hermes salym",
        "comment": "The app is nice and fast. But I want you to add the Item description tab so that a customer can describe the exact thing he/she wants. Also to avoid shipping wrong orders.",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRVNSSmpQbTFyX3BjVTBRS2tzbDYxMTV6YnFJMlJmN01IaGJpRXJ2ZF8zS2EydWtPMlZ1WWdrRUtYaVpZb2xITnVUWk9CQnlHdkk4NE9NdG1z",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Salym ! Thanks a lot for taking the time to review our app, your opinon is very important to us. As for your remark, it  will be forwarded to the app team. And please be assured that we're incorporating our customers' feedback to improve the app 🙂!",
            "date": "January 2, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Samuel Makau",
        "comment": "I once got a cash refund from you guys , due to a below par product. That kind of customer care is what still makes me shop with you guys, keep it up. And you are  quite quick in resolving issues.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRzk0UEd4aWpGcUl3Y1Jzc2Q5WmFyQzd5OGtRck1PeWgwOUdBTEJZaDJ1emNSSXJiZEt6c2xZc2xtZWVqeXpIYkFabUVYc3ZRWW10c0ZrTGNF",
        "reply": {
            "author": "JUMIA",
            "content": "What a wonderful review, dear Samuel ! We're so glad our staff served you well and made your experience pleasant .. we'd be honored to continue working with you 😊.\nHave a great day !",
            "date": "January 21, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mobolaji A",
        "comment": "Your upgrade was rubbish. How can can upgraded and your app isn't opening again. It would try to load and say try again, continue shopping? What rubbish? No.. I may uninstall it if that the rubbish you call a app.",
        "date": "December 25, 2017",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSEt2Tmc1MVRveDFhTmQyVUEtdFJCc2NBSVB6aVJFYXdGYWZOT2FhOE1CTWVicm04N25WMDZzelZlNHNqQmliX24tZFFGekU0RndIMzlXc1Aw",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Mobolaji ! We're sorry you're having troubles with the app. Actually, the app not opening maybe due to a sofware bug or because of a problem with the phone's operating system .. not a problem with the app itself. Please try to do a software update or uninstall and then reinstall again. \nLet's hope it was just a mishap !\nRegards.",
            "date": "December 26, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Sam Kimani",
        "comment": "best online shopping app ive used . bought several items this year and incase of refunds they refund, if goods have problems they exchange and they are always on time. thanks jumia just awesome!!",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSEcwRE1fSnpraFo5aVZ4M1NWeXRFLTN1Y212TFd3Tm5qR1lYWHo3NWp0bWxRZVRaYmNGdjZWZDJCS3RqWWFEZjJzbDZLUDU0TGlGNUNsTTZz",
        "reply": {
            "author": "JUMIA",
            "content": "We thank you for trusting our service and for giving us the opportunity to work with you, dear Sam. It was our privilege to do business with you, and we'd be honored to continue serving with you 😊.\nThank you again for everything & Best wishes to you !",
            "date": "March 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Kennedy Nzioka",
        "comment": "The app is great but it's uninstalling its self, so I have to download each time I want to use it. Too bad",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPSEctazJLblNUWWtTUks0cF9NM05WMjZjemYyaFVlNzRjTnllcFRyd1UzcHdoUVhPZ0tSeXF2bnpiVG9GcTJFWWw0RHpOb2tiZHEyRllubHpN",
        "reply": {
            "author": "JUMIA",
            "content": "Hello Kennedy ! Thanks for getting in touch. About your problem We're incline to think it's software related, not hardware. Did you download something from a questionable place instead of Google Play Store ? Try download an antivirus app and use it. Let's hope it was just a mishap and please let us know how it goes.",
            "date": "January 2, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Edi Tegz",
        "comment": "Nice app. Prompt delivery but I do have a problem with cancellation of order and cash reversal... ordered for goods twice which I paid for by mistake and for over 3 months now I have been waiting for a refund. I keep calling and still been told to wait for 1o days. This is so not fair and it's isn't the first time it's happening... one time a wrong shoe size was given to me and I was told to return back, didn't  get the shoe and I also didn't get a refund. Pls have issues like this fixed",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPR01FS1ZjVzljOHNwVmNmMnFIMlZnRjItZDRmZFRsaW5sQ0NJLXFpZWZ5S1hVdG96MFg5ZTROODhsY0FWa2ZMblVBSUFOdUpkdS14S01obGdv",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Edi ! We're so sorry about that. Please let us know what country are you from and your order number so we can pass along your issue to the relevant department in your country. \nOur deep apologies for the inconveniences we have caused you !",
            "date": "January 31, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Adebowale Gbemisola",
        "comment": "It is an incredibly great app! However, I have not been able to access the app for about 3days now. I uninstalled and reinstalled yet it kept telling me \"we have encountered a small problem fetching data\" I am getting frustrated, seeing that what i want to order needs to be done soon.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRXhVVVY5eEdJX1gyb0JMWFhCQTZFWGJyUmktOXBoeWt3QzBZTUpvUUI1a0xZdmdoZkxaSEd1SzZqbFVDNG94TUlhb09mRWE2UHRfZV9YWEQw",
        "reply": {
            "author": "JUMIA",
            "content": "Dear Adebowale! We're sorry you're having troubles with the app. Could you please reply to these questions : \n1- Can't you open the app at all ? \n2- Does the fetching data Error appear at the beginning when the app is opened or during navigation ? \n3- What country are you from & your net work provider ? \n4- What app version do you have ?\nThank you!",
            "date": "February 14, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Fashanu Tosin",
        "comment": "I love shopping on Jumia, its product range, price and mostly search engine is wey superior to konga. But one fault, over the psst few years, this is the first time you failed to deliver all my order at your stipulated time? Why such a disappointment to start the New year",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRXdqV25NaDg4OE9xa1VraEkteFc0TFFkSlB0c1BaSk82M3FiZ3o5Z0ZLY0RBcVFaMWlSYXRuSWJMQy1TN2FBR3JjQXJUdS1VR2E1bVVHaFAw",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Fashanu ! Thanks a lot for your feedback, and your loyalty as a customer is greatly appreciated. \nWe sincerely apologize for the delayed delivery. we're working hard to commit to timeline days and avoid any mishaps, but very occasionally things can go wrong. We're so sorry about that and for any inconvenience we may have caused you !",
            "date": "January 11, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Muhammad Adel",
        "comment": "I can't even say that this is a service or why they are still working.  Unprofessional service and completely idiot people with no experience. Will never go through them again.",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPR3J3cWk1Qkx0S3FqTUhyX0tvVlVoVFMtaWRwQWVSUXJEb3ZCcDRPS0JlRV9ZckJIajFGNVQ4U2VtVS1Belg1czZSb3gzcDBkcDdPVHNWWmhv",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Muhammad ! We apologize if your experience with us was not so pleasant. We would like to know if there's any pending issue to assist you with, please just reply with your location and few more details so we can help or at least transmit your case to the service concerned in your country.\nThank you.",
            "date": "January 18, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "KWADZOKPUI PRECIOUS KWABLAH",
        "comment": "It's just perfect.... But I wish there could be a flexible payment plan for students....  Some of use can't raise the money to purchase some of the items instantly....   Instalment payment plan via mobile money will be helpful..  Thank you",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRmhxMUpvRHRZYnhCSFkwemVrNDBQWDFQZVM5VW8tN1pTNHVDa1VNb0V4N1g5RFhPbk44M3Z0S0VqWWtmOEs2dzdXd09vSHVQdzNuU1dSdUdn",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear KWABLAH ! Thanks a lot for your feedback. Of course all your suggestions are welcomed .. and we'll pass them along to the appropriate department (kindly let us know what country are you from).\nThank you again & have a nice day !",
            "date": "February 7, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Kats Lin",
        "comment": "Been buying things from jumia for the last 5 years, I started with shoes, then clothes and handbags, moved to electronics and now I just do my house shopping online, jumia has made my life easier than you can imagine. Keep up with the good work and will always be your number one supporter.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRVdQSkxjcmdHTFFSVlpvX0YzWmtSR2ZYd0NmWkFmN1U4dFExV3pCYjllNURzREFRV1NYSVg2eVVwUHlwbzJmZ0xCSEJhMl9MWlp0MFlmVDl3",
        "reply": {
            "author": "JUMIA",
            "content": "WoW ! What a wonderful review, dear Kats ! Thank you so so much for being a loyal customer. We truly appreciate your trust, your confidence, and the opportunity to serve you. We're really honored to have clients like you 😊.\nThank you again, you just made our day !\nBest wishes !",
            "date": "February 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Chivalrous Bethel",
        "comment": "I wanted to purchase like 6 items(like carrot oil etc) which is not up to #5000 and when I wanted to pay #5200 was added and said its for shipping fee. That's when I got discouraged and cancelled all orders and deleted the app.  If its Konga am ordering from I pay on delivery and I can still reject items delivered if its not like what I saw online. Konga charges their normal shipping fee if am ordering once and all the items are weightless.",
        "date": "December 25, 2017",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRnRieU5vUnBERmtEZ29IWE0tYlgwQkxhWjh1YzJ5R0VPTVdENk9nSmw1UGc0MEdvMkwtNXJ4cXRxRlN2alcyelI4TGtTUThTVDE3RjJkRFM0",
        "reply": {
            "author": "JUMIA",
            "content": "Hi, dear Bethel ! Really sorry to see you unsatisfied. Actually, the delivery costs have been split into different ranges and automatically generated depending on the location and the nature, category and size of product...etc. we understand the inconvenience this may have caused you. As for us, we'll transmit your remark the relevant department.",
            "date": "December 25, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "collinstheweirdo",
        "comment": "I really like Jumia, but I'm giving this app 3 stars because of the annoying and very frequent on-screen pop ups that you cannot turn off, always appearing on my screen when im busy doing my work. Please change this, it's annoying enough to make me consider uninstalling the app and using the online site instead. Change this and it's an easy 5 stars from me.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.jumia.android&reviewId=Z3A6QU9xcFRPRnVhbzlzZ1cxaDRRQmV4RXNJMWhzQ0VSQmVZbE9va09uakNiZnlWTGtyS3pwQ1RCQlRFeFNxMzJOYVhZUEhObm04NW5lNENjQ1FSQXF2X1k4",
        "reply": {
            "author": "JUMIA",
            "content": "Hello, dear Collins ! Thank you so much for your feedback. We're so sorry for disturbing you. Have you tried to deactivate the notifications ? Please make sure that we will escalate your complaint to the relevant department to take take it into consideration.\nOur apologies !",
            "date": "February 10, 2018"
        },
        "star": 3,
        "title": null
    }
]