[
    {
        "author": "Susan Schneider",
        "comment": "Latest update says there should be a dialogue explaining how to migrate platinum into main. I didn't get this dialogue when I opened the app after the update.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRmZjajE0LVZvRGc1OTBnLTE2V1NDTVVNeDAyOTVDdnVNN3pjZGNxd3FPczFFYjJJd09xZE44eUZfWGRFMENOU1dfVUF6SGpxUC1qRjFMRUFB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Eddie Nelson",
        "comment": "I have always thought Accuweather was better than most of the  weather forecasting apps, and after using every one of them for awhile, my opinion is Accuweather is by far the most comprehensive and accurate of the many apps to choose from.  The Accuweather team don't just appear to give their forecast out in a randomly condensed fashion, as I have felt most of the other weather station's do.  Instead, they have always been more concerned about giving out reliable & accurate forecasts!",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRm8zVFhVenN1TmZKd1RYTkdhY19kNXdQTzhKVGUzQ1UxSlcwdDhoNFRKVmZZaTNNZDYyQnhSSFpvZy1MdFhuRUViN2ZBakpaRDNZdk8yWERj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "seti goc",
        "comment": "Im a hitchhiker. Which means i travel a lot and often sleep outside.that being said, its good to know the forecast at night. That way i know if i need to seek cover or not. However it would get 5*s from me if you added an auto location option. It would also be nice if it was more accurate. I just got a wind advisory alert and its as calm as the air in a deep underground cave with no ventilation.",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPSGIyYW1HaDVHeVhQTFd2OFllZkRiWU5hbG1uNDVUN1pGb2E2VlhjbVNGcFhiR2RHTG1SQlNESVVmU1o1TE1uV3AzV2JWZFRoMTNvbnFQZTI0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Beth E",
        "comment": "Lots of great features, display options & pollen forecasts. I have super bad allergies. This is very useful for travel to know how to prepare. Lots of options for how the info is displayed & delivered, what alerts u want, and background displays. And NO ADS!! Just weather. I haven't had any compatibility issues w/my Samsung Galaxy S5. Very happy.",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPR25sTEdmaUJ1c2QtbGNMdHRUNms3NUhfN2xHUWoxVGVPNmVvaWVENzJtUUFzYlY0XzFVNFkzV29PLVEtZEFIbmJXLVAwTS1BYm5mZVJnSUl3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Pascal Proesmans",
        "comment": "Good accuracy in Europe and Belgium too. Times of expected forecast for rain or snow are mostly correct. Stable app in general and not demanding on system.  Very nice design too. Nice features like Real Feel. Widgets are nice too. Minor remark here - check text frame about \"Time of Update\". On a full 1080 normal HD on a 5,2 Moto G5, for me, it feels a bit in the way or a bit misaligned perhaps? I would either drop it, move it to a full width horizontal frame at bottom or top, or make it smaller or use shorter description... Along those lines. Talking about biggest widget. Thanks for a very good app and Keep updating and extending the reach and access to measuring stations for Europe.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRVRsQVB0OXlVWkVPQUJYZmNNeWFyN1JRUUV1S3pBcDQ3d3FhWVdnRDJFclJWSUduYlJwOF9JYU9ZWFpxRzl0ZHg3RWY0ZWlGMFV5RzE4Z1Nz",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Albert John Hartl JR.",
        "comment": "I can not figure out how to delete locations. When I open the map portion of this particular app, I can't seem to be able to pin my location on the weather map. Yes I can use the find my location with the GPS. Option however, that is not going to show my location on the weather map. Other weather apps allow one to do so. Make a few changes and I will update my rating. Keep up the good work and I will keep buying this app every year.",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPR3ZFeHlxMjF1ak1NeWZKbnFkTTJlTUVRcVE5VzB5RWdYZ0dXNWFhT01FZnJ0ZWVhdDJSOEpvNEE0eHNvWGJXRS16V2szeVBjZFdnYllGVXpv",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Aaron Adrignola",
        "comment": "I turned on the ongoing notification to show the temperature in my system bar and the app killed the system UI.  It would do so again every time the phone restarted. I had to look up how to boot up in safe mode and uninstall this app.  At least the restart dialogue still worked. I've never had any other app make my phone literally unusable. One star!",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPSHUxNVlnME9KRGViNXc0bVFoY1c3STBUb2lJQkRneFg0bG5XdVY0dXNaTU1kcXk1eFdINmJETVlCbE5aVkgtYWxheV9yRHpxQWlmdHVHU2l3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Mike Wilson",
        "comment": "I use this app because its radar feature is excellent..... However, the weather forecasts are absolute garbage. The first 6 days are decent, but then the forecasts after that are often off by a drastic amount..... I highly recommend using the national weather service's website for weather forecasts, they're the most accurate.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPR1l0YVJ0RWVyYTJ3MDdNSVo3dTRmN0hpOHV3Z3pUQXFtbXo3aHJ1M3VxUnlaLUdBLUJISTdDTUlMdVBVZnkwTEduRDM3amM1VmJSM2JPUDM4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Shannon walker",
        "comment": "Not as good as I thought it would be. I thought there would be a lot more choices of widgets seeing as how you're paying a big price. Also, what's with the current weather? That is like 99% NEVER correct especially when it's raining or snowing. Although the minute by minute is 99% correct? What's the deal with that? Even when I refresh my app...I'd love to give 5 stars bc I absolutely love this app and the layout and options but dude, for this price these should be on point as well as more widgets! Thank you!",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRWwyMWxXSzAzd0hMczdJejk1Q3F0T1c3QVc5bkIwME9aQkdUQ1hXa1M3Mk5vVHRaRW93bF80TWFOTGg4SFFjS2VKQWFWYXZpa3ZxS2FXUGEw",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Greg Squyres",
        "comment": "This is a great weather app. It has tons of information, and one of the most helpful features for me is the preciptation meter on which a display graphically predicts the precise time to expect rain within the coming two hours. I also like that by paying a modest upgrade fee I can enjoy an app without annoying ads.",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPSFJqZXQ2SGJGbzNURTkxWFJKWHRlanhJUG04dVVDc0Y0RWNvYUpiUW9ZVzRTLUl4Q3gxQ0lVLXRoZjZyalFZVmRnc1ZoY3RacEhZdk40Mlpn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jim Stanford",
        "comment": "Fix your freakishly slow servers and internet download speed. One- minute response time is horrible. Just horrible. And don't miss my current location by 300 miles. That is dangerous in tornado season. And get a professional usability analysis by an accredited human factors program at a major university. Then we can talk. And stop nagging me to rate your app.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRUEtYnV5OHJEeXYyVlRYNTkyUkg4amF2NGtEQktUTFYtNjcyYWpFeHlrN0ZJWjBRQjkxaDZ1WUhYVW1tVkxYOWxpa1BiUTZkVzJZQkxjM2ZR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Gene Willacker",
        "comment": "This \"Real Feel\" temperature is ridiculous. It's January, 10 degrees Fahrenheit, and the Real Feel is 18 degrees? That makes no sense at all! How can it feel warmer than the actual temperature in the winter at night? Switch to wind chill and heat index, because we all understand what those mean.",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRmkwTV8tUWNhU3J5dmt0Nm9QaUItSk1yV1R6akRWVkpSUzE2b2RWbVZIMEUyWWFyY3MwenJ2SUxxVHZsaTd2QVM3SjFlU0pTdWs1T1RFLTVn",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Rudi Leibel",
        "comment": "It was working ok, but we've just had more than a half hour of thunderstorms, yet it keeps saying 'cloudy'. Won't even let me indicate that it is now raining at the rate of 5 mm per hour. I've always given good reviews to this app, but I am now really disappointed. 1 star. MAYBE.",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRTZJOHNMYTdyMW0taldHX1FvT3NTX0M0NTRENDM4OHoyTVlfSVZwdm5MZFhpWlM4V1hLVE1hMUI1T0lKeUQ4TnF0UWRSZXZ3V2ZyaG5RSGRF",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Timothy Henry",
        "comment": "The widget is not updating. I find this very frustrating. Aside from the non-updating widgets, it's a very good app. I would give it 4 or 5 stars if the widget thing was fixed. Also, the actual app often does not auto update even though I have the app settings on auto update. There was a new version of the app released on 1.1.18, but still the problems stay.",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRjRWMnNMVFhyR3pxM2lVVGtsSTBjS1liNmZuTk5LYnJ1WWh0d1pDOTNvM19XNXI5cDlLUGtfTTFoSHpCZGdmZUFiam1MZW9Cc3oyZHBqbEtz",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "James Ayton",
        "comment": "Best weather app on android. It does do this one weird thing on the radar map, where it will drop a pin on some random unheard of place while trying to zoom in or move around on the map. Sometimes the pin blocks the area that you are wanting to view. The pin can only be removed by backing out of the radar tab and then coming back.",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRkEtZjFEU2hRTDcycEg3WnRNRTk2WjlRVXM5Ri1keEJESDM2ZlRkc3VRMHlNdUlES0ZLZ19HbFV4RkxqVkF6MGozTWJiSzR3RlFtNm10cVVV",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Edward",
        "comment": "I would give it 5 stars if this app supported tablets. Every time I start up the app my screen rotates in order to display the poorly designed splash screen and then rotates back to the screen tablet view and that is very annoying.",
        "date": "December 31, 2017",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPSFFEZVozUURtUnJjN1JFU2tJZy1wRENpNkhyMFF5ZmpSYzhfX2taaGw2bVdsR0VpUWxDUE82Q2VkQWI3alNWVDF3WUx4ZURWOUFvUDdmQWxn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "sarah lane",
        "comment": "The map is just a basic street map. No actual pictures, everything else is good why are they leaving this out? Still no satellite pictures so things can be located exactly in stead of \"I think its about right here\" Come on fix it. I hate installing and then uninstalling!!!!",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRXZrT19oYzd3Mmx4MmQ2YXV5YU84eS1xYUhCRWpzZFE5TUtCQlpCb2F3U01qSFZMNzdSdUFOTVFJcFlGVE1qbXNrMFJhV3dDT0p1SmxNZGxR",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Steve Troletti",
        "comment": "Feb 18 2018 New: Dont buy the app is now useless. It used to be one of the best weather apps. It tells me it's snowing while the hour per hour is sun and clouds but outside is just plain overcast. Had a blizzard 2 days ago while it was telling me it's sunny. Naturally you get zero support... Old: Although its setup to find my location via GPS it now stopped doing so and always lists an other city. 70% its just not accurate. It currently claims its cloudy while there's not a single cloud in the sky.  Used to be much better...",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRVFTYmgtQ0FfYV9Sb3U2U1dlemNHQldZVzNPZTZaM0FGZlhMYlpyT0hBNHk5M2VWenoyLXJ0eVBjY0VMeVNpN1dGTk1zaUcyalVPTFlMYnZR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Lacy O",
        "comment": "I like the app though wish the user interface was more customizable. Overall it is something I would recommend.  Has a lot of neat features.  Update: 01/05/18 Switched back to AccuWeather because I was fed up with weather bugs inaccuracies. AccuWeather seems to be well...accurate. Seems to have changed a bit since I last used it. So far I like it a lot.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRnJobGVDTGZpUU5DdTVjNUd5T2xHYndmZXRKdGRqd0t5TlUwUklnR05faXN1MFZDMkMzNjhOcXNCY3oydU1hbmZXelZuY0F2QmFPZ2Z2WHFn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Despite its occasional flaws, it's still the best weather application on the market.  The upgrade to premium made a huge difference!  Where I first gave it a one star review, after trying several others and finding them not even close, I've since changed that to 5⭐.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=bGc6QU9xcFRPR2tOVFB5bm93RW5jQksxUGVkMEhpWTlPVnJVOGlTUzNkUGY0dlZScHdXcVNFMUFRY2VmVEJtb3diOUE3ZmsybHB5Q1lBaklHR3hyeFUxNk9B",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Robert Leonardo",
        "comment": "Just bought the paid after using the free version for a couple of years. One thing I would like to see is more widget styles and sizes options. 02/23/18 Last few weeks is slow to update and often inaccurate.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPSGJaclk3aHN0ZTZiMmJoZmRsYTFHTWxjVi1GNm9UejkzYmt3bm9XYU9OQjJHVnU1eHE5M0Q2WmVVb0ZjVG5QajN6SG9VVlBFclZqQ1QzTFFB",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ethan Lau",
        "comment": "This app displays conflicting temperature information. After refreshing the widget multiple times the temperature continues to read 61 degrees and light fog while the actual temperature is closer to 77 and cloudy! I live in Houston and it is ridiculous that AccuWeather cannot supply accurate temperature and weather information to such a populous area. You are better off using a free weather app because this paid app can't get simple things right like accurate temperature data. I want my money back.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRjRsTzljX3lJWDRlUUxzaDVPcDdWZHNWRG50UjhRRU9SbnBfRC01OGhJVG5xaW9XV25YcmJTTzN0VDVyQ3ZUVDlYSENHdXFCdzZNOGJMS3N3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Phil Sharpe",
        "comment": "Updated - now there's no weather widget. OK widget back after a reboot. Any chance we can get the forecast temperature/precipitation graphs back? They're so much easier to read at a glance.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPSFpxVGxlZ3R5S3Q5WG9TV0FEbmZ4bk5tdlZsaGtYa0hHWV92ZWxhZ3lDNjJQS1ZWVm5lOEFuN2YwczIzclhUZ0QwMGxfWVJhY1BybDdleXJR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Joey Jorden",
        "comment": "Widget issue: can't use Find GPS on the widget. It stops working after a while. Emailed Accuweather, and they're aware of the issue /// Below issue has been fixed. No issues now. Good app. /// Widget doesn't update. Freezes too often. It's not my phone as other widgets work fine.  An issue was with if mock locations were on, the location couldn't be sought, but I have it off.  It's disappointing.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRlN6YzdqaTJFRWR0UWtLVlhPRWN1RzZWSmhQNm1NTXEwR3A3R3NQcmxwQkdtcGJxamd6M2J5aHVKRk1GWjVVc2xBd1BSYllKbFh4QlF0eGpF",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "My to go app when I need to know the weather right away. It's my life line when I'm in hurry. It even sends me warnings about hazardous conditions.",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=bGc6QU9xcFRPRlVPdHdON1JQOE1tb1RYcENhLTBCbDd1UC1xeEE3ZnNiX1d0UXk4TXNKOWFjRlpoUWhvMHJ5NDJsQ1BnVlYzMzdheGlLX1BjaE5Qd290UUY4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "craigr98",
        "comment": "Recently I have it has been temperamental being able to submit weather forecasts click on what weather it is and then click on Submit and it does nothing. I have tried in different locations so isn't an issue with signal.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRVotVVNZdEFKRVpZZGZ0elZ2RU1lT3Nndkl2NldBVVQ0Q2lBYzBiNWFrdzVLMVotY3FfRmc2bWRnY3JEVm9NM3JKb1k1VWdsTkowNTNQem00",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Mike Lapoint",
        "comment": "Used to be great. The forecast is no longer reliably up to date. For instance: it's Wednesday 1/3. The hourly is still on Monday 1/1. The daily is on 12/30. This has happened several times in the past months. This is unacceptable. Keep up this incompetence much longer and I will switch to another app for weather.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRXdmVmpSNThTMVZOSjRYOWxzbTQteHV6cXZacWRKWjktTHItblVkclFLTUZuUml3OHFYNmVXcHVMZFVNbGZvcXhSa0ZvMzNaZFVQcXlUNExz",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Marty Brown",
        "comment": "What was state of the art two years ago now is meh. I have loved previous versions, but the current one pales in comparison to Dark Sky and even Yahoo's app. The latest disappointment is that Weather Alerts do not display any text. Dark Sky shows the National Weather Service bulletin, but AccuWeather tells me nothing.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRlFRNXdBS0JPM3kxRHItT0RLRTItelR5SWxZU2hsRUhnMlRHNDdhRVdBYUdiMlJZTElVcjFxUUJINWxLRFZIMWJGTWp4WlEtUmlTbjcxLXVn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "A W",
        "comment": "Newest update added notifications advertising the app you can't shut off without muting severe weather alerts as well. Still looks like it was designed by fisher price and the map is next to useless in the dark theme. If your lucky enough to still have a version before 4.0, keep it, turn auto updates off.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRlA2LTdEX0hMYmQ1OUY0TEIyaW9DMVktTFEtbDJ6cVlFb1JJcjh0VFJTdlQ5M0pZM2VGSTFHYVRuMDRMbFI2UVJnX3YwZ0JOeXpjUUVuWmlB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Darrell Watkins",
        "comment": "Really not liking new look and styling. Just ugly and too busy. Updated : Even though I think the newer look is a very generic mess and in much need of a real designer's help the content and user interface is by far the best and always has been.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPSDdoQ3Z5SnQzdXlURWNpWU5idnNIUXAwV2ZQUXpEM29PN1U4Z2QzYm5hSVdrRkhmbHFxV2lxZ1ZpcUZ4VnVLOUJBZXBoZFBtN3FJRElFaDVv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Still great. Severe weather alerts and the minute weather updates makes it by far one of the best weather applications. When installed on a 12 inch iPad it set many errors and Apple deleted it for a repair. I need help with that issue so that it can be loaded again?  With both the Premium and a free versions of weather running, the battery use can be a problem. Turn off one of the two weather applications as desired.",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=bGc6QU9xcFRPRm0zZHlGRFZKZWFuVW1EQ1J1bk9UeGVBeXgwQU12YjNUS0FzTTFGYXNOaGRQNUhBQnk0TkZtaEFuc0djOVQwVjNsT0NuSS03Z21QaHA5TnUw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ryan Hansen",
        "comment": "The widget does not update at all. I paid for the premium version so I didn't have to worry about things like that. And you nagged and nagged me to rate your app. There you go.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRXR6enJfZVl4bWcxTGxHZGszVHdnZWkzbURXRXpGV0FXX1N4a1NUWDd6TzhOUUxkM2ViUzVndGZIQXNERlJXa010akhKQnc3RGJNRzJ5STdZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "toolofnails",
        "comment": "My #1 go to app. Totally worth buying even though there's free version. I can't stand ads",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRkNjQzVQUEIzRFRNa3Vhakl0bnFyTXJIcGxVSzRBLTk4NWNpaGpuM0dzQ0tDNkNpSGRsb1ltTjFGVjR1cEJodGkweEM3dkFtVS03d2xBbFVn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lara",
        "comment": "This used to be a great app with great widgets but for months now it crashes whenever I open it & the widget never updates. I've tried the obvious stuff such as reinstalling. I'm using a Samsung S3.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRUZKLW4yNnJfcndwdW9OZ1BueTNJcnpMaTZrN1VsZ2NaMTZjMHJ5ckVrdGk1TUkzSld2YzVmQkFPN0FFRFRrN21HVENkOWR4NnduWHFxOHQ0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Anthony L",
        "comment": "Works great, even on my now budget  Android device. This app is compatible with not only premium devices, but low-end devices as well. I like that, my device situation changes a lot, great to have an app that will work on whatever device I have. Great job!",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRUVBcTRiU1pyejlMYWdwUGZDUXZWbEhmWU94ZEROdlY2X3NnX3d2V1BHbGdVbVZQMVlHSDhJQS13M1RZWUpMRmRydVdpdUZRZ3V0a1YyWC1r",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Robert Dubenezic",
        "comment": "Why no \"severe weather alerts\" at current location? Fix these 2 items and app is perfect! Data is NOT viewable in Google Now. Taskbar temp too small.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPR09ubXpnNmU3dXY0V2Jubm9kRmoweEdBSWdhLUZrUFFpZVlPVUk4eFJLUV9Ca1lQVUVSb050T05MRFhHc0pCZWlQYnFkWmlFTWRzLTdqdW53",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Mark VanOuse",
        "comment": "I was wondering why my phone battery life was collapsing. Checked Android battery setting and it revealed the culprit is this app. AccuWeather, this is an unotherwise great app, but now I'm forced to uninstall it so that I rescue my battery. AccuWeather,, fix this!",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRVhTbkpUWmtaajgtR2FoNFZibEZwLU5ya1NjUXVHMWgwa09ZUmxJNHlRdzQ2MFJVb2cwd0dQaktpc0lxV3FFcDZHWEFKQzU2UHoydFN5bHpn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ken Peterman Sr",
        "comment": "I'm using your app again but I'am taking 2 stars off because of poor satellite and radar coverage. I like to have a broader picture of the clouds in the satellite view. I still favor the first version of your weather app. I'll give it 5 stars if you make the old app available. Other than that you have a pretty decent app but is really designed for smart watches which I don't have. Buy me a smart watch and I'll give it 4 stars.",
        "date": "January 6, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPRnlwUmFsNlZFb1R2YnA1LURuZXFNQzNYQVczQTV3MGprZ3lFWDFhdTV5TXY4bG5fTlJ1dWpnRUY0ZlpJdE1ndjdkTjZTMmJwcTFDRjNuZlVR",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Stephanie Rosenberg",
        "comment": "Most of the time when it's raining and the app says so the minutecast says no precipitation for at least 120 minutes. Pointless really. At the moment the current weather says partly cloudy, the minutecast says rain and the actual weather is clear.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPSFZOTnpnV0VBZ1pBSHdVVU9odEotR3pKS0x4WlQxYTRoZ0VtZ1JiMkVDSEU4VWF2YXVDYnZnQ0ZYQ0RZTGJyRE9IME1YZ0taZnM0SkVFVW5V",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Michael R",
        "comment": "It does talk English, and says how many cm of snow it's expecting, but there are two problems (1) it keeps forecasting weather you've already had, not just once but repeatedly, and (2) it's not all that accurate. It's more accurate than some, but the met office for example appears to be right more often.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.accuweather.paid.android&reviewId=Z3A6QU9xcFRPSHdfN19hR0RnaE5LSUcxXzQ5dFFMZk9pTXBhRVZfQXRGdjRoa04tSzFuUkpOeUZMeTk1TTBHandhbU9sbjdRVGFTWDFFZElsckN1NjhxVmlv",
        "reply": null,
        "star": 2,
        "title": null
    }
]