[
    {
        "author": "Destiny Wardwell",
        "comment": "This app is perfect for what it's intended for. However, I would like to be able to delete certain sections like for instance I eat breakfast, lunch, snack and dinner so I would like to be able to set it up this way. Also when it rings(notification) there should be a text box pop up that lets me write in what food I had... Maybe have it as an upgrade. I'd pay about 2 bucks for this upgrade! It's worth it to me!",
        "date": "December 22, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSHJYU1RQT3p5ZFl2OXE0WW5sei1jNjlQbEd5T1pUTlpYVzhsY0h6a2IwTnE5Q2JiNTgtS3lpejRFUTk5ZU9lTkJ4aERwSy1GUld2aEhWV0E",
        "reply": null,
        "star": 3,
        "title": "Needs some changes..."
    },
    {
        "author": "kristi bridgman",
        "comment": "First rating:  App is great reminder when to eat and also helps me not to eat until its time! Great customer support. I emailed question & got an immediate response. Keep up the good work and when updating please continue to keep it simple. Second rating:  Boo! Last year I sent a message saying the times were off when you enter manually. I actually uninstalled it a couple months ago and was hoping it would have been fixed. I entered 645 and it shows 825. I entered 915 and it shows 1015",
        "date": "June 1, 2017",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSFAybDJwVEVseWVfUFZEbWhiVVJBYmxkWmpYeE5FRklLYVRCNlF5MHpPcGZESUsybklIem5IclFlcU5Hem9sYzlVbjVrZ01VeG14YlE2UXc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Paulette Sepe",
        "comment": "But, my metabolism has picked up so much I'm snacking every 1 1/2 hrs. There's no \"add\" option so I can include those snacks. Mind you, they're healthy snacks so I want to take credit for them. Not being able to add them, it can throw off my times.",
        "date": "September 11, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSGhwVm5NYWx4aEEzRnFHVzdjNU13eUJ4eEpkamd4dGo0cUtCOWhOZ0hXaHJObmhHUzMycFE2QjJzVDV2OUhWTEo2S013aW03Nk1sZG9XMWc",
        "reply": null,
        "star": 4,
        "title": "Overall a nice, very helpful app"
    },
    {
        "author": "Josh N Susan Hunsinger",
        "comment": "I forget to eat or skip meals all together. My weight has gained since being so sporadic with meals, not decreased. So I needed somthing to remind me since starting Trim Healthy Mama! Thank you so much for all your hard work on this app!",
        "date": "March 9, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSDRPU1lBVE14VWN4Qmxvdk1URUdmNlYyVUZTVGpRdy0zalpZX0NxUzMtejVKamtRR1Y5NmMxcHFxdlpPMnJqd3VlRXVYOEUxdkYyOGtFQ1E",
        "reply": null,
        "star": 5,
        "title": "This is exactly what I have been looking for!"
    },
    {
        "author": "R Latimore",
        "comment": "I love this app for help in keeping my eating on track.  I like how the reminder bell pops up but doesn't cover the whole screen & it's cute.  It's also easy to indicate whether you've eaten or want to delay or skip a meal.",
        "date": "December 23, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRmtpcVAzeElEXzQ4blZaX016SEN2bS00MnJwaFdZQXF5MGdCVTdhb0F6bkZ2QWpGc2VUM2x0ZnZ5bzk1RjZOT1JfRjlrbGEzRGNlUmZ2MWc",
        "reply": null,
        "star": 5,
        "title": "Great Reminder for When to Eat"
    },
    {
        "author": "Robert Brandon",
        "comment": "Simple and does exactly what it's supposed  to. Keeps me on top of eating  every 3 no matter how busy i get. I just  would like to have a log or be able to look back at previous  days.  I keep track of every single thing i do in training.",
        "date": "May 14, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSC05eERsQVhHX1FQcWVvb28xT3VLVndlalk3Y1NCYWp0UmdfWTRJbVpxVTNlZjlTSk1Bc1ExLUtKWUx2Ui1KQW93bXpuWkhnV2RyWEE4T2c",
        "reply": null,
        "star": 5,
        "title": "Great app"
    },
    {
        "author": "V Millet",
        "comment": "It's great, it helps me plenty. Only thing is....when you go to edit the time the meal was eaten, the clock is out of wack. Let's say I pick I ate my meal at 9:30..i submit said time and the app changed it to 11:30...i figured it out but it's just strange.",
        "date": "September 6, 2017",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRVR2cVdyUWs2NDJWNzdEX0psdG9qRjBjQ3diS0NDcEd2OUptTFhtWjVIX1laRjY5ZlczNjB4QmFmeXRJTk9vSXE0RFBNeHhWd1Q1UEZPc3c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Suki Niko",
        "comment": "As a nutritionist, I know how to eat very healthy meals. However, even though I should know better, when I get focused on a project I will completely forget about eating (some times several hours). Then a hunger headache sets in and even eating doesn't make it go away. This app has really helped me to get up, stretch, and grab a little snack (even if it's only an apple). Plus, the app is clean and clean and has a great UI. GJ Devs!",
        "date": "February 20, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRlZ3SFkwU09tLXlrYmZNUmc2LWF4MnZPYmNhclAxWTRuZG1NeHljRDhwMC1aMF9Ga2lmQkllS3pPSXdxZG1MQk5Bd2tERFhhY0tjeHJPc3c",
        "reply": null,
        "star": 5,
        "title": "Having fun with this app!"
    },
    {
        "author": "Igun G",
        "comment": "Just what I need for a reminder throughout the day. Needs a few more options to manipulate the schedule, i.e. 5 meals instead of six. A couple of other picky issues, however nothing deal-breaking. Great app!",
        "date": "August 4, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRXlDMk1LelIyOVQ1VUxqXzU4TkdnVzVySkE0Ukk2M2ZueU1Ea0R1anczbjJGUGlFMHUyVWVwZ1ItNWJJY3VRVjFWblV5U0NxV2lBZlNpOXc",
        "reply": null,
        "star": 4,
        "title": "Easy to use, just a few things"
    },
    {
        "author": "Amy Voorhees",
        "comment": "There is a bug in the time editing function. I put in the time I ate and it changes it. I also wish I could manage the list of snack options. For instance, I eat breakfast but no snack before lunch, so I would like to eliminate this snack option. Other than that it's a good reminder to eat and I make it work for my needs.",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRUJFWjdtWE9MQkdkM2FRSXdDSnM3T29TdVNGTHl6NlZwbnhtQlo3N2I2RUxyUUpuQjdHUno4VTdidFNwaVpUSnctdUQtZlJsVFhrUlRsX0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jerry Freih",
        "comment": "Only issue is adjusting times... Let's say you are the meal but forgot to check it off when you go back you have to check it off then adjust the time. But you have to need around with it to get it to show the correct time and set the next alarm correctly",
        "date": "December 17, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRURSOWdPS0s2TEluM2FlU3oweGNrbmpzX3NGMXROdTE2RHlkUUVtVzhZRGthZTdkdkF2RHNQakRsR2NTdXNYM0RFNkVZdEJDWElLQW5Fc0E",
        "reply": null,
        "star": 4,
        "title": "Works good, does what it's supposed to"
    },
    {
        "author": "Abby Fichtner",
        "comment": "Great app, does just exactly what it's supposed to. But please please please allow us to configure notifications to be less obnoxious! With it alarming several times per day, my customer meetings and other important things in my life are constantly disrupted by this alarm that keeps going on and on. Please allow us the options to: a) allow a silent (vibrate only) alarm, and even more important b) have it only ring/vibrate ONE time with a notification light in case we miss it. Thanks!!",
        "date": "April 12, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSHB3Nk5OZkt0QTdsVWlBNW8tZnZzNmd4TERnNEpSWV9QQUt6V2hpZHlyMVh5OGl4ZGxUa0NYb1otTHdQV1VTYUllTC1FVFZhWGVKV1RSaXc",
        "reply": null,
        "star": 5,
        "title": "Great app! But please allow us to configure notifications"
    },
    {
        "author": "Kathy DePue",
        "comment": "So far,  the only issue I have with this app is that I can't adjust the meal times from every 3 hours to every 2.5 hours appart. Other than that, it's been a very useful tool!",
        "date": "May 9, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRk54SmdSME5iRnl1eDVCOEpua3Nhb3RhaEhKTmt1bXFnUktIRWkwZkFiVVZtb2w3b2ZXOUNMbjhVcllJNUdUQXAzOTU2dzZ5UGNiZ19fb3c",
        "reply": null,
        "star": 4,
        "title": "Very helpful app, just one thing missing"
    },
    {
        "author": "Julie Russell",
        "comment": "You have to eat to lose weight!  Problem is, we get too busy, then eat whatever is there or wait until late and gorge.  This app reminds you without being too annoying that you should eat something.  A good baby step in the right direction!",
        "date": "April 12, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPR3RYT3k5Y2FxVEtDTjlmUmd5UU5zNFpPSFpkR0N6OXA3SWRiM3FYY1l5d1Z0SkFfT3Fnemc4am5Pd0ZlcGcwN3MxcnE0Rl9kQWNEeW5nSEE",
        "reply": {
            "author": "Nir Benjano",
            "content": "Thanks, this is one of the reason we made this app. People tend to forget to eat during their busy day (especially students like we are). Let us know if you need anything else in the app to help you with your goal.",
            "date": "April 13, 2015"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ande",
        "comment": "The app is a great idea but whenever you manually input times for a meal that might've shipped on the app but you ate it, they're always off like you put 7:30pm and it says 5:25 or something. And it also sometimes will tell you that a time is out of bounds even if you pick a time between two meals already registered",
        "date": "September 27, 2017",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRTRUdkYxVjNSdkNqSV80eXpXY0pfXzkyU2FTbFB6V1lHcG96OVFwaXpYVHhacDI5ZmxLc2tGV3o5TVpqTXo0bWZsTV9NWkxzc0ZOVEZ6S1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Eric B",
        "comment": "The best thing so far..and I haven't used it yet is that it does not require any permission to use anything.  Everyone should get it just for that alone... okay just used and extremely easy.. only other thing I would add. A section were I can put what I ate to keep track..",
        "date": "February 18, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSF8zLWNuQ0ZDNzNwb3U1VFY3SlBlWFV5RHhITVVEQ2lmYTgwei0wSWxfcDk2ZUYwdGFNck16YW9FZ0hiZ0VXdWlyd3kzd0FkYUhSVmREVmc",
        "reply": {
            "author": "Nir Benjano",
            "content": "Thanks for the review.\nWe are currently working on days' history. After that, we might add this feature :)",
            "date": "February 17, 2015"
        },
        "star": 5,
        "title": "Just got"
    },
    {
        "author": "Rob Aboudi",
        "comment": "I wrote to their support feeling sassy telling them where their app fell short in their execution of a really useful, functional, cute little app. They promptly and very courteously wrote me instructing me where in the settings I could find the features that I had \"recommended\" they add....  Opps,  they were right....  They had been there all along!  Don't think if the roles had been reversed that i would have written half as nice and helpful an email in  response!  Very impressive,  the app and the support",
        "date": "April 13, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSEpHbEljV2EwWlA0eUpuQXZfNzIwbjVBR2habHBCREhKd1pQSWpCSjBqU0VBTXdjYlgxWnRDT2hMUUxrLXNZUGxIbzg5elA4Y2pGYUx0TlE",
        "reply": {
            "author": "Nir Benjano",
            "content": "Thanks! We are happy to help :) let us know if you need anything else",
            "date": "April 13, 2015"
        },
        "star": 5,
        "title": "Great app, well thought out and their support is responsive, helpful and nice!"
    },
    {
        "author": "Herman Ramos",
        "comment": "Love it. Great App. Super easy to use. I like how a big apple pops open on the phone when it's time to eat. This is perfect, especially now since I'm working out and trying to eat 5-6 small meals a day. Love how it adjust the times if you skip a meal or eat later the original time planned.",
        "date": "April 2, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPR0RTTFBZNXE0T25lZ0RySFVCV2lNOW5JNDZudDUyamxEeDdHSjJSb0ZHZjZTbVl2ZUF0Yk8wdGsyaDY4TFhBWklLTEVhMkRDNGV0dU1ka2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Esteban Ruiz",
        "comment": "There should be an option to have a sound alarm that repeats with vibration as optional,  is annoying leave your cellphone in some place and find it vibrating as crazy",
        "date": "December 31, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRmdNTDR1YXp5MHQ1cTUydjZkaTA4SXJjNVB1Znp5NU85Wm5wZ2RhUkwwQlVfMnNnR1NJeEZISllGRTh5OGkzZDVUTmdaME9wRE41c1pvMVE",
        "reply": null,
        "star": 3,
        "title": "More features are needed"
    },
    {
        "author": "Teoy Thompson",
        "comment": "This is customizable to my lifestyle and more than enough time slots for my meal. My only complaint is the alarm won't always stop when I confirm a meal. It keeps going and is rather loud.",
        "date": "May 12, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRWJEN1FscnNrVW5lam9PZWgwSjY3R01fdWVGTlJRQm5tMUREdUREVHdBRW9wODJyS21DcGQ3RzRKcGNQSkZrLURjZ0dUd09sSFpjNkRxeUE",
        "reply": null,
        "star": 3,
        "title": "Alert too long, but overall I love it"
    },
    {
        "author": "Zahra Sameen",
        "comment": "It automatically shifts time...that often shifts lunch at 4 and dinner at 11 because of late breakfast...so there should be an option if we want to have our times automatically changed or not..Also the notifications dont show on wear...",
        "date": "November 5, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSHA4SHZVZFlfMVNCUGxDTkhtY2xMdWdzcG5Jb2lsWlFfX251VkU0NW1zMjN0YkFnVzhkZG04RTk5NXA2dThRbHZvMzVrc2RuYXhIaHh5ZEE",
        "reply": null,
        "star": 3,
        "title": "Wish notifications worked on my moto360 and it just stops on my watch all efforts of restarting the app on watch are fruitless."
    },
    {
        "author": "Teresa Krause",
        "comment": "This is great! I tend to get busy and forget to eat then my blood sugar drops and have to have juice. Not good for diabetics! But with this, when it reminds me, I also check my blood sugar so I know what to eat. THANKS",
        "date": "September 1, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRzZ3bTV5LWZjdEpDZmZUSU5YYVBvUE9kR2QzQ1cxaGxXdzQtNjZxeVNaUlY5S0tFLVBPcDdNQzdyS2hGVm8wdlhsVkpBSE9DTGFMbTBJdEE",
        "reply": null,
        "star": 5,
        "title": "Forgetful"
    },
    {
        "author": "Diabolik BaconIceCream",
        "comment": "As it stands this app is good. There are some things that could make it better. Adding a way to log what you ate for each segment so you can go back and review it and add pictures of your food (especially helpful if you have a health coach following up with you), having the notification actually go off again if you delay a meal to add that reminder again, letting me set the interval of time that I'd like it to notify me, and adding more slots for longer days.",
        "date": "April 29, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPR3dyYnUxbDdJREp2UGhWQ2hkcVZETnU3VWV1bkRFQWJlMng1RDdMQUFTX0FmdHBRX1pIZlZjUWJrMzl5MzNBQklzdTcyVmxuRXdncGZIdGc",
        "reply": null,
        "star": 4,
        "title": "Some added features would make it great"
    },
    {
        "author": "Christopher Burgon",
        "comment": "Really love the semplicaty of this app but one thing that would be great to add is possibly the ability to change to default breakfast time ahead of time and possibly being able to input what food / drink I am to eat at each meal and description input. Unless you designed this app to just be simple and easy to use then that's fine just a suggestion.",
        "date": "February 23, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPR2xsVGxlVHRWeVo4NmlsanhOOUtVc3JER1BQQ3NMQ3VNUHpjQVJ6d0QtdnpmRnZwQk5BRlhLYkZuaElwbVpkblBsenBwS1ZPT0ZySjdMWWc",
        "reply": {
            "author": "Nir Benjano",
            "content": "We designed the app to be simple and easy. However your suggestion is something we would like to cover in our app. In order to do so we have to develop a simple and elegant solution which takes time. We have a big update coming up so hold your patience :)",
            "date": "March 1, 2015"
        },
        "star": 4,
        "title": "Great app but one little thing to add"
    },
    {
        "author": "Shawne Pierson",
        "comment": "Every 3, I really like this app.  I am on a new nutrition program to get stronger and leaner for the summer.  I need to consume up to 9 meals a day, which includes protein shakes, to support my increased body building and fat burning plan.  Can you increase the number of maximum meals from 6 to 9?  Maybe this can be an option within the app?  Unfortunately, I have been unable to locate the Statistics page within the App.  Can you assist me with locating this feature?",
        "date": "April 21, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRUFrSkttX3J0ZWlMcEE3eVUtckRFVzVQRTMzZTRBTEJQcTc2eFpRVE9TSFhpRVBnbms5bmFFanlUUkU2ODZkY0RlMHpmRm9tZzhpMENJR1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "candice hughes",
        "comment": "Wonderful app! Could be more embellished with log books for Glucose meter readings and appointments. But very good basic app. The reminders have helped me balance my blood sugar from Reactivate Hypoglycemia.",
        "date": "March 4, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPR19kXzhYVHo0cmR3Z2ZoTzJXWE44ZTAyUGM3SDQ0aUdWTW9IMmYzVXdMUUdTOTNsY2NfTXFIZDFqcllvYU04WTJDcmMwbWJEU0JGWGhYV1E",
        "reply": null,
        "star": 5,
        "title": "This has saved my sanity!"
    },
    {
        "author": "Randi Benson",
        "comment": "I love that it is simple. It is great that future times adjust according to when you eat.  I wish it would allow for a 30 minute reminder so prep can happen before eating.  I'm not so good at planning.",
        "date": "January 23, 2017",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRjBZOG5WNy0wbGlCV2dTTkJhMUhTOGNKLVpYNnZ4MmtPdFZSTmxXczllMUxFSFJpMFlLQi01YUJwcmsxelI2TWRqWC13bXFwOUVKWmxma0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Krzysztof Wierzbicki",
        "comment": "One issue to fix is the timestamp: After user edits time manually it is incorrect, the minute wheel has a 5 minute increment and the time logged is the increment step rather than the value, so choosing 2:05 gives 2:01; :10 is :02 and :55 is :11. Hopefully the next update will fix it, for now I'm just eating at full hours.",
        "date": "July 15, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPR0lhUkQxOGlrdHRDZW5wQnQwaTh4VDRrT0pUMHh1THZ2b3gtSzZmYk5QRzZwLWtnd2RMeVBiTVlyMlFLZzUyNDJESUkyWUpXSmt4akl2a0E",
        "reply": null,
        "star": 4,
        "title": "It's a great little app covering what the big food-loggers miss"
    },
    {
        "author": "saundra spencer",
        "comment": "I really like this app. I forget to eat every 3 hours, but my faithful app reminds me and keeps reminding me! It's nice to have a friendly reminder.",
        "date": "December 29, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPR3F4YzhWeXZoUVZ3Z2pZRFU2S25tTl9fLUJ5eEFDR3VadE53Y1FZekVFZi1Pck8wNEktWVM4S0ZrTU9COGZsVWV0ZjV0TTBtTlNqVTJKMmc",
        "reply": null,
        "star": 5,
        "title": "Every 3"
    },
    {
        "author": "Stephanie Obiako",
        "comment": "Needed alarm to remind me to eat every 3. The only problem is when im up for 24 hours i have to reset it so i can have the alarm every 3 hours",
        "date": "June 12, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRTRBVlNUSjAzdEJ6cjhmX3FIOEFXMmlnUmZ5eVp1bHZUSktvbkJGQ3BKSnpiSmJjX2hmTnN6bUs4a3lNQlR0eHJ1NllyNXNLbnA2b1FtU1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tamera Noll",
        "comment": "Exactly what I wanted!! On a fitness program..and Love that it re-adjusts all other meals if you snooze your meal. ONLY issue ..WHEN I missed the exact time or snooze app THEN put in time I Actually ate..it does NOT put in that time? Ex. I put in 1240 I ate..tried twice, it recorded 1205 :/ Seems like putting in a different time doesn't work if you miss scheduled. Can you fix? :)) 5 stars then. Do love it..that's just frustrating. Thanks! To be clear..I.just put in I ate at 930 it set it for 903 or 906 :(?",
        "date": "September 14, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSDNCbk5ic2RqS1FONUVVb0IyeGQwLThDVG1SZWIxM2lvU3NDOVJEN1E3aXhZcXZYSjVaVXBQT242czRyZ2hHclJlMUxTanpUQ05KcWpBVmc",
        "reply": null,
        "star": 4,
        "title": "Almost perfect..."
    },
    {
        "author": "Libby White",
        "comment": "I wish that the app would remind you again when you hit delay. I have a 21 month old and a 3 week old and am frequently busy with one or both of them when the app rings. Also editing the time you do eat is not accurate at all most of the time! Other than those two complaints I like the app a lot!!",
        "date": "June 16, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRWNqclpVTHdTbFlSYTNiSzhPaTExeTVVN3lfUHhhcV9sUUM5aHR1empaaWZrNlo0M3B1ZnFMVWY2a0JGcGNVZV9jY2phN195UWtfWm04WFE",
        "reply": null,
        "star": 4,
        "title": "Helpful"
    },
    {
        "author": "Yarico Senpai",
        "comment": "It's okay.  It does need more stuff. I like how it reminds me to eat every 3 hours, but I don't care about how you cannot set your eating schedule for the next day.  I mean I wake up at 6am and eat at 7am - I wish that it didn't automatically start at 8am I have to wait until then before I can do anything and let it know that I ate at 7am instead of 8am... it does need improvement. When It shoes the alarm, it needs to give you more options than you either ate or skipped the meal. I find that stupid . It needs to alarm you to go eat then give you a little time to get it all ready then once you are done eating then you can day that you ate...",
        "date": "December 12, 2017",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSHFsT0pqSUhURlBkbUNiVHloTWxlWHJ4OEFmOE5NZW9CcWswLUZXVmk1blpmU1RnRVpHS285eUlVcndQTWRvMnNxYjVicU1KcUVlb0Rxanc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Francisco Barrientos",
        "comment": "It could be excellent to remember eating every 3 hours. But crushes many time avery day... each time I open it I expect it to crush. And the alarm should be louder. Otherwise I woud give 5stars.",
        "date": "February 12, 2017",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSDVCWmo1Z0lZcWxIMXh0VlY2NGc4R3ViNmZJNG5sUHZ2QXVmaXFUc1JYM29KUE5uQl9adi05YmxTQVc2Tm5KWklVNUx0ZllpcUs0c0JrcHc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Allan Josue",
        "comment": "I didn't expect it to be good but actually did what I wanted it to do. It reminds you to eat and show how much more time you have until you can eat. 5/5 from me.",
        "date": "June 10, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPR1ZtdG5MYjNBOEp4aVIteV8tTjNlXzlVczBoLVFyYXVmMnBMcUZKMkh6cEFEbHhtTDlhaFBBeVFGb3h1QjdUYUNNQTh1eUlSSEdqc2MtRGc",
        "reply": null,
        "star": 5,
        "title": "Actually pretty good"
    },
    {
        "author": "Renorda Pryor",
        "comment": "This would be an awesome app if you eat breakfast at 8 am every morning. It has no setting to change your meal time. I would be OK if it would just allow you to set what time you begin breakfast and then no control from there. I give it a 3 because I love the reminder and the 15 min delay.",
        "date": "July 12, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSFFybHhlV2ZtZnVyZ01tQ1JZNTdYZmp5X2RaSFVjWGhzQlNuX2U1UGRwdVRVQ1BIZjV6REp2ajVYaTZvX2xwdmIwUlo5eGVyMm5rR0NiUnc",
        "reply": null,
        "star": 3,
        "title": "No control of first meal"
    },
    {
        "author": "Emma Brook",
        "comment": "In my case I'm a mother of 5 so remembering when to eat is mostly impossible. This app has helped me keep a track of my food.",
        "date": "September 17, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRWZ4T09nMTMwNENPVk5WaFNieWp4M0ZnUGpsZ1U1X1dhVUdqZXNGSWtBR1A3S2lhTW96OVludHJGR0ZKU0hpV3VxaDAtMzlWRkktYi1oSXc",
        "reply": null,
        "star": 5,
        "title": "Awesome reminder"
    },
    {
        "author": "Peaches Daley",
        "comment": "Good app. It helps me remember to eat especially when I'm busy at work. But it would be better if you could change the order of the snacks and lunches since I work early in the morning",
        "date": "March 8, 2015",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPR05nOXU4UmYzOWRSMjh0dUxzRVJTeEZmZzFjWk9hYWpPQU9VaWw4VVZwRXc4eHY0SnpPZnI4em8xakNMQktDRl9GY1pNR0l4ajJZeDRESWc",
        "reply": {
            "author": "Nir Benjano",
            "content": "Thanks, we would like you to contact us and tell us what do you mean by changing the order of the meals.",
            "date": "March 14, 2015"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Betty Richardson",
        "comment": "I'm loving this app! It keeps me on schedule and I like that it will adjust your time if you don't eat exactly when you get your alert. You can also manually adjust your time if need be!",
        "date": "March 24, 2016",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPRnpDaDIwLUFrT0RpMFh2SWdTM2lOeWphUFYtdEoybnJramFjcFlhMnlXTGdGZzVyLTRDaTlqTkRweTkwUzlialVFTlkxYzI5eGJPTGtVS2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Andi Surface",
        "comment": "At first this app worked well. The alarm reminded me when it was time to eat which is the main reason I need it. Chasing after two toddlers all day, I forget to feed myself. But after about 5 days or less it started malfunctioning.  When I would check in that I ate it would set the time to something other than when it was. Even after attempting to edit the time. Example: I would edit the time to reflect eating at 8:50am and it would register as 11:15am. Not even close. Sometimes it would tell me a range of time to enter in, such as after 8am but before 8:40am. And I couldn't even do that. The alarm also stopped working. If it actually worked I'd really appreciate this app. Maybe also if I could note what I ate.",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.benjano.every3&reviewId=Z3A6QU9xcFRPSEJIcDU2TWJXWVY0dGpqNjJkWmJjYkRxRHk3X240SE5qU1FraHFKZjNjTlJQYnFiRE5GSGlMS1d2OXNSUE82YW1lcDlRMm5MSlhKaHJJZnc",
        "reply": null,
        "star": 2,
        "title": null
    }
]