[
    {
        "author": "Samuel Davis",
        "comment": "thsnk u guys the audio update before this recent update.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRVU1WDdLMU9YX0x3cHJKaHlWM2cxamk5d3pPb3dLVFo1WVNuSVpDNmhSMm1Cak0tc2pCVGxONlphUlBYekQzd3lnSmU2UW93eDlUcWNGbWc",
        "reply": {
            "author": "BandLab",
            "content": "Thank you for the feedback and review, we appreciate it. Please don't hesitate to reach out at support@bandlab.com, we're here to help.",
            "date": "March 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I get better sounding vocals with this app than I've ever gotten from spending be hundreds of dollars on protools equiptment, FireWire microphones and soundproofing materials. Not for nothing, even though I still can't edit my profile information even after logging out and logging back in, this app is low-key legit once you get the hang of it. Not for nothing but I can see this app getting low-key popular in the future.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSGZiZGRwdUI0azdEZ1F4dEQ5NUhuUXBrMXBIVUVFYlN6SjBkUE5pZlNMSDVkRnpuZ0RId2ZOUG1WdEtnYWFJdWRsWWVtUjNFSVZ3ZjZya2c",
        "reply": {
            "author": "BandLab",
            "content": "Hi - Thanks for the stars and for the kind words! We're sorry for the frustration. Our engineers are already aware of this issue and are currently working on fixing it asap. In the meantime, please feel free to email us at support@bandlab.com if you have any other queries.",
            "date": "February 11, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Deovrat Garg",
        "comment": "Great app for making music. Good quality sound. Good guitar effects. Good quality vocal recording, dont even need to plug in my microphone, I directly record on phone mic. But just one thing is missing; Midi support..... Using pads is really hard. I hope you add midi support too.  Thank You",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSFBBaUNhTFZPY3hLN1JMbW5nUnVTaFVVMnZYYTU0MGJsU01zSXYwUXB0RUlKOXp4ZDV2dUhMcnFmc3RtYTByNzhvRE9uRm5fM0ZqMThoUkE",
        "reply": {
            "author": "BandLab",
            "content": "Thanks for the stars!",
            "date": "February 18, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Kittikun Suengharuethai",
        "comment": "I love this app so much! It's easy to use and make music in my style. But i have a problem now. The app cant record any sound from my device after pushing red button. The other recording apps still can. I've tried re-install, turn on recording permission, and reboot the device. But it doesn't work. Please help me. Thank you ❤️",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSDNreXdsYWYtQ1dVR1JNcGwyZzNUZkRDTFc1YmdjR1VzZkZEemR4VF8wVnE4YnJmRFBWUjQ3N0JxSUNwcjRhQmtWNnJ6N0dYT3VndlpKVmc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Kittikun - Thanks for the stars! Do you have any screen recording apps installed on your mobile device? If yes, please uninstall those apps and try recording in BandLab again. We've reached out to you via email to help as well. Email support@bandlab.com, anytime!",
            "date": "February 12, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Justin Hinkley",
        "comment": "Can't even make it past creating my name? It just continues to load . I'll keep trying but if it won't work my rating will drop more.  Update: Rating changed to 5 star's. I Love the app,but it seems to be slow with my device? Running with Samsung Galixy S5.  Other then that everything is fantastic!",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPR1hfdnFucHBDdVp1WUV0TGtvODY3MUJvTUhEdU9UdFc3OHpNUjBCYnBlRHhjQmc5TllsR1luMXh4SXllaVBXMnlGYjBOQ195ZG1SUnY0eGc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Justin - Thanks for the updated ratings! It looks like we're in contact via email as well. Please don't hesitate to contact us at support@bandlab.com with questions, comments or concerns, anytime.",
            "date": "February 27, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tyreise kymani",
        "comment": "Keeps on messing up my songs that I've spent hours working on! When I publish it, it changes the tempo, tone and sound of my voice/music. It's really annoying me now!",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRVdDbmZmQW9WZXVaejVEdWwxUXZMaGdlT3ZiU0xBUkoyMVk0QWNOU3BHdnZwNXNQQ1FnVThuZVd6ZzBBdjJyNHFra2t2TFd6WUhKYlVLMmc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Tyreise - Here's how to fix latency:\n\n1. Tap the red + button & start New project \n2. Tap the Gear Icon near the top right of the screen \n3. Scroll down & tap on Latency Fix \n4. Unplug your headphones & tap Start Test \n5. Follow the instructions & apply the results once test is completed\n\nEmail support@bandlab.com, anytime!",
            "date": "February 4, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sir Plankton",
        "comment": "This might be a good app. I'm not really sure because I COULDN'T EVEN START IT. The bottom of my phone covered one of the 'next' buttons completely, making it impossible to go further than the genres of music part. Shame, I was looking forward to using it.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSDBGMFQyUEwySmNjaTA1SnpFT1NGcDZKTjlrb3BvUlFCaU16NXRsUDFCck8wN1VjZHk4Wi1hZUE4dW9SV2tjSEg5bFlDOW1LeUpxd2tIdHc",
        "reply": {
            "author": "BandLab",
            "content": "Thanks for the feedback and sorry for the frustration! We can't seem to find a BandLab account under your name. Please email us at support@bandlab.com so we can help!",
            "date": "February 9, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "KittyCat Berry",
        "comment": "Bandlab started out great...but the app has crashed so many times and has so many glitches...i have spent hours accomplishing 10minutes worth of work all for nothing as I watch my music erase before my eyes. Disheartened and furious. They're techs are available days after u request help and have not solved a single problem I've had. IF YOU ARE SERIOUS ABOUT YOUR MUSIC, THIS APP WILL DESTROY IT!!!!",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSHNkdDJpOWtqUjM0RVdTNjYyRkk1OXRxZXlrZVIzSW5UcUVkS0JDWjhVTVFiY1lJUG1yNVR1RFJDNHJZMHVCYkJZX2hRTnV2MXpmVnlXSFE",
        "reply": {
            "author": "BandLab",
            "content": "Hi KittyCat - We are so sorry for the frustration caused. We have a restore functionality that can help if the app crashes during a session in the Mix Editor. Were you able to recover your projects using that? We hope to continue helping you with these issues, please email support@bandlab.com, anytime!",
            "date": "February 24, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Its the best, the only issue ive had is with recording. When i use the app it sounds too loud no matter what i try, and having tech support experience didnt help the fact that it sounded way too loud and electric. Ive managed to find a work around in the meantime",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRmFXVHhTYXgxbE5wRG9aUnQzZlhVaEhLdXFaQWxsbWJDYml2QUc0bXVjMlg5aGNuUktYaVBXN3FNNlR3d1hfT3Q3WGc4OFpUY3pUUjFlMnc",
        "reply": {
            "author": "BandLab",
            "content": "Hi - Thanks for the stars! Are you using your smartphone's built-in microphone for recording? Please reach out to us at support@bandlab.com so we can help!",
            "date": "February 27, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Really good app I recommended it to anyone who's starting to record mixtapes like me. Its able to record vocals like as if it's a studio.   Please keep the UI simple as or is right now. And it would be better if we could identify the key and bpm of tracks we import. Moving tracks left and right would be easier if we could zoom further for accuracy",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRzZrYUxfVk5TOGc4RURhbFVRWHI5dUVNYkxnYTlUUVM5QU5tMGRweDF4QV9SWEJSQ29DSTVWRDJhUUVrUEZfS3VLd1UxTUJTRUpjTEdtQ1E",
        "reply": {
            "author": "BandLab",
            "content": "Thanks for the stars! We will forward your suggestions to our Product Team for consideration. In the meantime, for a richer experience including additional editing capabilities, loops & virtual instruments,check out BandLab from a computer online at www.bandlab.com",
            "date": "January 30, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Clayton Swaffi",
        "comment": "Depending on the phone you will have issues with this app. I have a ZTE, Galaxy7 and I use a Samsung tablet and they both don't work well for recording but I can edit. On my friends phones they work fine they have apple and Samsung so I'm not sure why my devices don't work properly.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRktxSURFNzR2NGdkUTc3d1dIM3E5VGR4UlJpa1IwcVpuSUVhanZOaXV5bFpsZGM1dnkxMl81c1pxY0g1U2hDQ0VQX25WWHdFNGdnbDhtYVE",
        "reply": {
            "author": "BandLab",
            "content": "Hi Clayton - Sorry for the frustration! We've reached out to you via email to help you troubleshoot your issues. Email support@bandlab.com, anytime.",
            "date": "February 11, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Mikaila Endona",
        "comment": "Voice 1 and Voice 2 doesn't sync. Waste of time.  edit: It's now solved, it's my fault after all, haha thanks so much! ❤",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRlBxaF93V242Z3JRaUpsNG9RbmtvVlF6UktYeDItNnNGTlg4M2dPNDhMcDZsQUtpNU1jckl2NTVYZjU1czVPdXBhYkFpWTh2RmFPSm1HLWc",
        "reply": {
            "author": "BandLab",
            "content": "Thanks for the stars Mikaila!",
            "date": "February 18, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jordan Garcia",
        "comment": "I really enjoy the community, it's so easy to find great music and share ideas, my only complaint is the mixer isn't the greatest for uploaded tracks, volume gets pushed to the max threshold and even if you pan and mix in the mixer, it doesn't demonstrate in the built in player. Not sure if this problem occurs with the built in samples. Overall though it's a great app just needs a little more polishing",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRWxSUFBYaE8xQUE5MU15dlJUXy11Z0xWcEp6OUp0UVVGbnlfeFJFZm9GemlsMHdFZEtDTWhOMG5UcDQzVmV4OC1EU3BGX0dnQ1ktc19VbEE",
        "reply": {
            "author": "BandLab",
            "content": "Hey Jordan - Thanks for the feedback. Please don't hesitate to contact us at support@bandlab.com with any questions, comments or concerns, anytime.",
            "date": "February 24, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jazzy One",
        "comment": "Good day to you. I really love your app. But unfortunately the voice playback is extremely low when played back. I tried raising the voice volume to the highest point, but it still sounds low. I'm using a Moto e4 running Android 7.1.1. please get back in touch soon with help regarding this issues, thanks.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRnRLcm9mODlSaE5kTnR4eDlqVU9ZUHlIVl9xZ1EtdjNDMjdTcW91ZUNuNWtNV2tocGt3T0xIVmxwTllvb3d6enFHMFpSdEQ5S3pCY2hmVlE",
        "reply": {
            "author": "BandLab",
            "content": "Hi Jazzy,\n\nThanks for the stars! Sorry to hear that you're having issues with the volume being low. Have you tried using a pair of headphones with a mic attachment to record, or moving the phone a little closer to you?\n\nDrop us an email at support@bandlab.com and we'll work to sort out the problems for you.",
            "date": "February 6, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "fizah izah",
        "comment": "The problem is,when i sing to suit it for the karaoke that i import,my voice didn't follow the rhythm of the sound!whyyy?i aleady fix it but it still didnt follow the rhythm of the import sound. How to fix it? Sorry for my eng.   Example of my prob : first,i open the app and start a new project. Then i click my music (karaoke) on this app. Then i try to add my voice. So i record it and follow the karaoke  then,when i hear my recording,the karaoke is faster than my voice.   Thank You!hope you reply my comment ASAP :).  My username bandlab : fizah izah",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRklnZ2l1NVNBTnNvZ0ZGczdvRjM2WFdNUnR2NkhIUEZhM3ctREVtQk1PNVU2RzRjQmtudWdKemxvOUs4ajVFN01xdXZ5VUNFX1dBWWJQbGc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Fizah - Sorry for the frustration! We've reached out to you via email to help. Email support@bandlab.com, anytime.",
            "date": "February 24, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Ben Richardson",
        "comment": "It's not intuitive. I don't have a lot of time to mess around with it. It looks like there are a lot of features but they aren't obvious when I log in. If I spent some time digging I'm sure I'd find them and be very happy. But as it is, I am a bit frustrated that I can't do simple things without a tutorial.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPR1lrVl9FMmlRNGRGTjZDNUdxNDZ0RklDMTZrVzVaRkhuQWFjR0QzT0k3c2YtTzN2UW4yeC1Tc2RlbjhzX0RPdGtaVVQyVG9EWXlJUmtQVVE",
        "reply": {
            "author": "BandLab",
            "content": "Hi Ben - Thanks for the feedback and sorry for the frustration! We can't seem to find a BandLab account under your name. Please email us at support@bandlab.com so we can help!",
            "date": "February 24, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Bandlab is in a class of its own. This app is ever musicians dream. This app allows you to record mix master and great ur own music. Dont sleep bandlab is the best app out there Im just pissed I wasted years on other phoney hip hop apps before I  discovered the Lab.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPR25WSFFGMFVjMkVCaU8xdTgteWVkS0I0dEJsbHU2aHp3dVY2QmRpcUp5ZWpfVjJaQVdxSXZhMVZLb3BxbklfbFJYRXZ2NXN2aWpFbEV5Nnc",
        "reply": {
            "author": "BandLab",
            "content": "Thanks for the stars!",
            "date": "February 20, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Rj Trickster",
        "comment": "This app just unleashed the inner music maker in me. And i cant stop making it. I could even give it 10 stars if i could but alas, only 5 is max.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRXRBOFp0bUlhNC04UXdFanlNZ2ZEcG10QXVOdUdaMnpkNDRsQVRmQUNyRy0wYkFJenRGXzRMQldGWjZlZ2dhWWU1RnVRS0VOQjVucThQMmc",
        "reply": {
            "author": "BandLab",
            "content": "Thanks for the stars Rj!",
            "date": "February 16, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Joe Salles Drums",
        "comment": "Don't know about Apple..I do know Bandlab is by far the best app of its kind on Android bar none. Staff is very good ..The standout tho is Aquila Misory..who answered my initial few months of daily e-mails as the whole online recording experience was way new. I started out with a decent cell..then went to cheap tablet working up to my current setup. BandLab is 100% free..and while there maybe lagging issues once in a blue moon due to hellacious people on..use Songtree for Android..or try to...youll RUN back to Bandlab",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSFZ3TEtXSVFIVGl2ME5yOU0ydWVOaEd0dm9jaHF5QnhFVnJpVWJsWEZGWFBsWnFvWWx5N0J6RkFxaDA1cU9jZjlzNzlrVnJ1NlBnNk4yVWc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Joe, thank you for your kind words, and we absolutely love that you're loving BandLab! We're also definitely very lucky to have Aqilah onboard! :D",
            "date": "February 10, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Munoz",
        "comment": "Really good. Only gripe is that the record, back and play buttons are too close to each other. When I'm recording guitar, too often I'm hitting the record button, when I've meant to hit either the back or play button. Perhaps in landscape mode you can separate these some. Thanks.",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSFY1YldBdWNNaVRaTnVXSVJYSXhJNWhVZGtfQllURzdkcVRpMnRaRjRYcnNWNThmX2hkRXRfTE1oUk5zNk96Uzg0VFhHTkpZS3RVZ21vaFE",
        "reply": {
            "author": "BandLab",
            "content": "Thanks for the stars Mike! We shall forward your suggestion to our Product Team for consideration. Email us at support@bandlab.com, anytime!",
            "date": "January 30, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "stephen Jr",
        "comment": "Sucks so bad, can't even download the beat created to share with friends. Spent so much time creating a beat and all I can do I share a link.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPR1ZIZjc2RUlvbTh6NG1DMGFJZGlTbGZkZ0ptOTZhcEhmVFlkRWliT3NHdHJlY01hT0pteHZyd1VCTDJGckdZOEZFU3Fib0M5REl6ZkFJTVE",
        "reply": {
            "author": "BandLab",
            "content": "Hi Stephen - Sorry for the frustration! Here's how you can export your songs to .m4a in BandLab:\n\n1. Tap on Projects\n2. Choose the song you want to download\n3. Tap View Details\n4. Tap the triple dot Icon in the top right of the screen\n5. Tap Export Audio\n6. Choose how you'd like to export your audio.",
            "date": "February 6, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Sam Rich",
        "comment": "It's great. Never thought I could get this level of quality on my phone. Only complaint is I can't save the music to my phone and share it as a file.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRXhialVzeGlmeWppN3JHdjNaR09ETE5ZUzk5cVJFSTNMdGg5aHVHeldWS2JNNkV1cDZVR1NWMmtTVVotaEZnUExPZ1JFcFlyNS01ZVlWaEE",
        "reply": {
            "author": "BandLab",
            "content": "Here's how you can export your songs to .m4a in BandLab:\n\n1. Tap on Projects \n2. Choose the song you want to download \n3. Tap View Details \n4. Tap the triple dot Icon in the top right of the screen \n5. Tap Export Audio \n6. Choose how you'd like to export your audio.\n\nYou can share from there! Email support@bandlab.com for help, anytime.",
            "date": "February 18, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "eino duazo",
        "comment": "I could rate this 5 star but it has a bug where everything that I have saved way before became so messed up... (Tempo changes, drastic key changes) and with the instruments, it has an instance to be different from the original key of the instruments, like when I tried to set the key to F#, the button for C# sound like D# on original tuning of my guitar...   And if you could consider having the buttons for the drumpads be interchanged, and the soundbanks of it as well...  More power!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRm1lWHZEb3drR3hKUnRSYktQSmJ3SmhRMEpRQUROYzRzZ056bGp3NXNmdEt4MXhiMjFWWHVjTXJNUUdENlk5cU1lVzlOd1dQQy1jMmJ0cnc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Eino - Thanks for the feedback. Please don't hesitate to contact us at support@bandlab.com with any questions, comments or concerns, anytime.",
            "date": "March 3, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Brian McCalla",
        "comment": "Tried it before, but I'm back for good because it's a strong app backed by a company that deserves all of the support I (and many others) can give them for saving a legendary music (and just generally- *software*) application: Cakewalk. This company will be a leader in all things audio and collaboration in time, there is no doubt about it!",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRVQ2dXlocmZHQkNQMHBGSTIxX2Rjb3RZeV9XbWVwdG5ob1lINTJndkVEdWQtOGNvdzhQU0FvVHRtN3llcVh5RW96RGdQbTNCSXdSS0RqVUE",
        "reply": {
            "author": "BandLab",
            "content": "Thanks Brian!",
            "date": "February 24, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jake Hamilton",
        "comment": "There isn't a tutorial but it's so easy it doesn't need one! Making recording multiple sounds, cutting, pasting, looping, and overlaying them easier than I thought possible",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRzIxZ092ckM0dEVfeW1Ob0lpT01Xb0hDaS13enYyVGFzT1hRMkVXNWxFdGd3TkUwZXJ4NzZCVkszbUdLLXhmQUlhUVRfX0Jsb0VoazNZSnc",
        "reply": {
            "author": "BandLab",
            "content": "Thanks Jake!",
            "date": "February 18, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tim Gudmundson",
        "comment": "I'm so torn on this app. On one hand, it seems to be the only multitrack recorder on Android that actually follows modern Android design guidelines and isn't ugly as hell. On the other hand, the UI is extremely unintuitive, effect selections are VERY limited, there doesn't seem to be an option to program drums rather than just tapping the pads during live recording, and I wish the social network aspect was its own app. I think there's a ton of potential here, but it's got a lot way to go for that potential to be realized.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPR0FXU294eV9xWmJHc0MzRWtjbEFKaTIyU1VHSENQNTNaYW40M0JqaVNQZ1FlV29wc3RXZDdPV0NudGVYVlZPaHA3ZDgzSkZMN2lHX2czbmc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Tim - Thanks for the feedback. We hear ya! We do have programmable drums on BandLab Web at www.bandlab.com using the computer and we are working on expanding the features that we have on web to our mobile platforms in the future. We'll forward your feedback to the Product Team. Email support@bandlab.com with questions, anytime!",
            "date": "March 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Vaibhav Pandey",
        "comment": "Excellent!! Best app for all those who wants to become a professional musician but don't have accessories or heavy equipments, I upload my youtube videos( My Channel name Following GREY) all thanx to this app. Thanx to the devloping team.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPR0hiNGRQWG9aa0dldzBzUnVNTXo1M3VRZjlOZ3BERUxpb0VRTWlvX1VJZXVoMmxZNjN0dXlBOGFpTmVDemdTXzNsdDVmTzE2WGFVeVM4WWc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Vaibhav - Thanks for the feedback! Please don't hesitate to contact us at support@bandlab.com with any questions, comments or concerns, anytime.",
            "date": "March 3, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Collin Brown",
        "comment": "Excellent platform to collaborate with band members or total strangers. Stuck on a song and don't know where to go with it ? Allows some other creative minds to take a crack at it and possibly get your own creative juices flowing again. Really excellent app and I am very impressed.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRmxVdEphNTE2OFhGQUFaQllHQ1B4dVRDSEZGOXQyWXdTd1RQTmsxTjN4SDZ6N0JuS1RyQjhjZ2FUbWJyN1ozRV94WXJOamQteTZwTjlPZWc",
        "reply": {
            "author": "BandLab",
            "content": "Thanks Collin!",
            "date": "March 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Brian Speers",
        "comment": "I was very excited to use the app, was disappointed to say the least. Poor user experience starting with an overly-vague UI. Looks like most of the resources went into tryi g to boost the social aspect of it, which honestly seems like the least interesting part of recording. (I guess everyone has to feel famous first) Next was the difficult to find help section for support on why tracks were not recording in a simple 3 track project. No support there to explain why, and after 3 days of trying to record a second track, still just silence.  Summary - Good idea, poor execution. If you want to record anything, just use something else",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPR0hnWE1XTkM3MlM5T0dRZHBJbXVFc0NkVmpGZVpvdjFqSll2Tm5NNnNkbGZodk1jSUU3Uy1DTXVuZFdlTnEzZkY4RVdNQWtkRUlpbnRBaHc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Brian,\n\nSorry for the frustration! What problems are you encountering trying to record? Do reach out to us at support@bandlab.com and we'll dig in.",
            "date": "February 3, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Overall a good app, except one thing, that 1 thing really sucks! When try to play a track, no wonder why, it plays for a second and stops!!! This is for every track in the app, i can't listen to a single thing  What do I do?",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRkNLb1BVY0VyUTBaZ1JsSi1ieTdCdjdzSi02bTlWRktlLWRNaF9WcWxITzI0SDBCRUY1OVdYUUhFNVZ5VGtrSnhHWTJTdFFDNTZWTGF6RlE",
        "reply": {
            "author": "BandLab",
            "content": "Thanks for the stars! Sorry for the frustration. Please write to us at support@bandlab.com and we'll be happy to help. Thanks!",
            "date": "February 14, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "ISLAND EVERYWHERE",
        "comment": "The app doesnt really pick up on the mic. It makes the quality sound bad when it does. I'm using a gaming headphone. But other than that arguably the best free studio app!",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRVlldGJPemtzR01fQTZyaV9peWZWU2xJcndCUTNJREc2TlU4V2x4VGdueGp2ZXlTRjJCT2s1b3kwVndjRWFTbDc3TmFIV3hBNVBvS1J6LXc",
        "reply": {
            "author": "BandLab",
            "content": "Thank you for the review. Have you tried using a different mic? Also, will you be using it through an Audio Interface? Please write in to us at support@bandlab.com and we'll assist you further.",
            "date": "February 10, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Bailey Smith",
        "comment": "Mixx whatever you want!!!  Help progress in the music industry for sure! Only complaint.. is sometimes my tracks won't load.... I just Bluetooth them over and put my track up... So all is good!!! Great app!!!",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSExqa2dsZk50dHViaFl4NVdQYjNpVkhsY2pkdGQyVXZveFNLQzlCaS1VRlFfNDBlVUVwajRDQlNVWkRHSUVZb3RCZmN0cGQtLW5qc3JwQWc",
        "reply": {
            "author": "BandLab",
            "content": "Thanks Bailey!",
            "date": "February 20, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jayson Richards",
        "comment": "Its a great app. I've recorded a few songs but been having latency problems alot. Audio lags a bit behind",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRUF6TXpNMmV4dWIyNXAxXzI5d3NGdVVCcWRlQ1VEQndqbkktTVpJUHdwNkdLa245UzZLdFdEZHdseW9VRW11aXRvQTUwSU9VSWlIMzBtZEE",
        "reply": {
            "author": "BandLab",
            "content": "Hi Jayson - Thanks for the stars. Here's how to fix latency:\n\n1. Tap the red + button & start New project\n2. Tap the Gear Icon near the top right of the screen\n3. Scroll down & tap on Latency Fix\n4. Unplug your headphones & tap Start Test\n5. Follow the instructions & apply the results once test is completed\n\nEmail support@bandlab.com, anytime!",
            "date": "March 3, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Nofeelings Nathan",
        "comment": "Dear Bandlab  I used to love this app, but lately I have had issues with it. When I record my vocals it makes my voice very disturbed, even without voice fx on.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSHRiTmpIeVJrLWZtVE1GU2tod2JGeU9VUWFtQ0pnSjBvUkxFNGd5cjhsRXVSMTVJYlFYN1ZoV1BsVFd3TV9NOVFLQmlSbUpYcmZrVndmVFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ghosty386",
        "comment": "This app is awesome for editing vocals onto tracks and adding fx,  slicing, cutting, left to right fx brilliant! The soundpacks u have are really good too and u even have a grime pack! The best thing about this tho is its FREE and has NO ADS too! One of my favourite apps for music editing 5 stars from me!!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPR0xxZVhrd0hGWVZSYm5GZHc0VnB3RFJJZEQ4Qks1M2VoUUdLaHNFUXotd1ZEVXFJTnk0WldFWGs4U3hWNXpQWmM2S1Azb0lBY0FlcEw2QUE",
        "reply": {
            "author": "BandLab",
            "content": "Thanks Ghosty386!",
            "date": "March 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "XXL FRENCHMAN",
        "comment": "Listen I love this app, but Everytime I try to record it's all static. On my old phone it worked but now it's awful. Please fix this",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRTF4UWZsTG0xc3haQ2pOWFlEMnNQcUhvM0plMmFuQ29aRjhPVkdZTDY2eS01S0NNRTk1WTBENEctaTFxYkVrTnFaRXQ4dzlWYzRMTXNQVWc",
        "reply": {
            "author": "BandLab",
            "content": "Can you please check if you have the staple \"Google\" search app installed on the phone? If yes, please try this workaround on your mobile phone and try recording in BandLab again:\n\n\nGo to Settings &gt; Google &gt; Search &gt; Voice &gt; \"Ok Google\" detection\nEnsure that both \"From the google app\" and \"From any screen\" options are DISABLED.",
            "date": "March 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "zeroarts 030",
        "comment": "This app is very good! Though I am wondering if you can get more than 2 dubstep beats or sound track",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPSGM3MkFvTXBIUUw3M3hoZF9oVnNQU0R0Rk02RGNpODdYbExtaUd6QzZQa04wYVdBSzRxVG04aWx6eEhmSzVIaEpJQ0JUV3dXVmx3bmdDbUE",
        "reply": {
            "author": "BandLab",
            "content": "Thanks for the stars and the kind words! We will forward your suggestion to our Product Team for consideration. Please don't hesitate to contact us at support@bandlab.com with any questions, comments or concerns, anytime!",
            "date": "March 4, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Black Ibah",
        "comment": "I honestly love this app...it's the best thing I could find out there. My music career was now slowing down but because of this app I was able to revive it....great job guys😘",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRzl1a3BIbXB5TGlrbzdNaW45UUc0Y2NrSUpmU3lyWmF5OGZvNllzZUZZcFA0aU90Y0F3Yy0xZ1M4Y2Zua3h4OFVtME96ZGJDeVVOY0I2S0E",
        "reply": {
            "author": "BandLab",
            "content": "Thanks Black Ibah!",
            "date": "February 9, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Optimistic Gangsta",
        "comment": "Great app but it glitches too much on computer. It also won't sync some of my tracks, it been processing for a week and quality needs to improve and needs more autotunes but other than that, best recording app I ever used. This app will make it far.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRlBaeGxPcDNicEM0RTZEWmc0QXpuTmNxS3FVdld4enkyU09ieGRzbGpYVkRwbGV6LWJQMk1pQzJGcDhQWm9ZUU5KTU4ydU5SOE9LY2FZbEE",
        "reply": {
            "author": "BandLab",
            "content": "Hi Optimistic - Thanks for the stars! What is the name of the track that's currently under processing? Are you on Wifi or data? Also, we're unable to find a BandLab account associated with your email address, please email us at support@bandlab.com so we can help!",
            "date": "February 28, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Rishel Manalo",
        "comment": "I can't log-in my account. It always says \"Add your email address for account recover...\" Then, when I click NEXT, its stuck. Its not loading",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.bandlab.bandlab&reviewId=Z3A6QU9xcFRPRVktZkRjeTRZNk9GUERiRVZza0VaNE1FLWJQUlh2b1NYRlF3TU9Kc0VseVFHRWpDRWF0dE9hd3VSQy1WRzlKbGJaVXNfZE1RLTBtaTBoamc",
        "reply": {
            "author": "BandLab",
            "content": "Hi Rishel - We're sorry for the frustration. When you receive the long loading screen once you hit \"NEXT\" can you please hit the back button on your phone and try to enter your email address again? Please email us at support@bandlab.com for help!",
            "date": "January 31, 2018"
        },
        "star": 2,
        "title": null
    }
]