[
    {
        "author": "Joe Macina",
        "comment": "This app is actually very good. However I gave it 3 stars because it is missing smart home devices that should be there. For example. Nest is there but no camera set up. No August smart Lock. No voice assistant like Google home. No tp link etc. The app has so much potential if more devices are added. The interface is very nice. Add those devices and I would pay for the app if it was not free. But in meantime I've uninstalled. Will check in periodically.. keep up the good work",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRzNTOUl3Rk9oUDlpTVdjVVRFUGhtT1BhaVVBWVNQb0hPNHIwWm91dm1fOTlhdDJ5eHVpQzg3QlhiTXR2dVVTYkduRmgxYlZZUFJMUzRqLVhJ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Brendan Dolan",
        "comment": "Won't load if connected to WiFi.",
        "date": "December 3, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRUlobURwNkRTczR6by1pSVE5VF9CaFlIT1MwNEZwREEwaEkzVWlSc2ZIU2picWVqMWdPaVpQT3pxM0kyU1VfNGpJQWhwREVGMzB5NFFIMGow",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "RockyNinja",
        "comment": "App won't even load. Spinning circle on white background.",
        "date": "December 3, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRXpOYlhKaHQyMk1ubUpaSXVmOXlyMEVvTTI3cjdsZVF0WVZ6eDZNajJVR2ZNaW16WkxUWjJobTZlLXZra0lDalhuN2lGRlRWdXpkMnJJWlhN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Simone Di Mascio",
        "comment": "Happy that this seems to be the only system to work with an Egardia Alarm, however I successfully linked the app to the Egardia alarm  and set up some agents to notify me when the alarm is disabled or enabled at home, but sadly no notifications are generated when the alarm is toggled on/off  :-(",
        "date": "November 9, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPSEhCNWhzcExQTmVOcWVGZXJROUFyREFqOXNzNGJKWElqdjdQUlZSSkxxYUJHbGVORzd5cmJwMjJMNlpObGRNVV85eGNFZHczSy1rWGpacFow",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Martinez Green",
        "comment": "Getting better and better and more device are being added.",
        "date": "November 14, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRW9fOGphY0ZIS0dicmFLTV9zUGxaWjI0MEJHdUk0cGs0dmtKSXZYcGRURDRXeWNZYW1VX0tlS0M1aXRNMHdlME9lRUllaTJUcUhaMTVBMnJJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Emeka Agwu",
        "comment": "Add NouLins and Sonoff devices.",
        "date": "September 11, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRk5UaGNDR21pNTQ3a3JsTkwzYlB2Y2hVVjNOSGFlNUVldzlDeUEtYWRqVFF2WVJKMzFTOEt6cmhLZmdnekVZN2NxWHhFelE5QkJkUVdRMXg4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "gfourhsean Ionessa",
        "comment": "So I switched to Muzzley because WeMo was just not cutting it. I Now have different brands of switches and lighting in the house, like the Belkin WeMo and Philips Hue. This app recognized all of my devices, it was perfect. Also the automation agents are amazing too! I was able to add automatic enabling of my home lights based on my GPS location. The support was amazing too! The gentlemen went out of his way to go about testing problems I was having with my WeMo. He sent me updates every day too! A++ service",
        "date": "January 15, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRlgyWHE0cW5yNWk4N0JDSTBUM3BkX185YWlFUXgwb3owNTNaSDdnTEdseTZoMzRXRlZSMWlWcmlKemVlOWlQQ0xiVGV2N0FhTVp0QkczNUdz",
        "reply": {
            "author": "muzzley",
            "content": "Hi there,\n\nThank you so much for the spectacular review!\n\nPlease let us know if you have any more questions or suggestions. We'll respond promptly and take all your suggestions into consideration. Your feedback is what keeps us moving forward :)\n\nThank you for choosing Muzzley!\n\nCheers,\nThe Muzzley Team",
            "date": "January 15, 2017"
        },
        "star": 5,
        "title": "Excellent App and Amazing Service!!!"
    },
    {
        "author": "Adam Northrup",
        "comment": "Have had problems on and off but lately it works pretty well. The interface is kind of clunky. One thing I'd like to see is being able to change parts of an agent without having to delete it and start over. Also can't believe you can't search for new devices--just have to scroll til you find it.",
        "date": "January 9, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRUJKLTAzWlpUUUllc3V0Ynk1T1dnSHVvMEIyZjBWT3g4SlBvcWFad0xyTnRGZ29kbkp3aUY3cjRtVEc4enVTa1J5eWtYd2ttTFNMRjdBaHRR",
        "reply": {
            "author": "muzzley",
            "content": "Hi Adam,\n\nThank you for the updated review and for the suggestions!\n\nSearching for new devices will become a reality in upcoming releases, and the editing of Agents will be improved in the very near future. Once we have these new features implemented, we'll let you know.\n\nCheers,\nThe Muzzley Team",
            "date": "January 10, 2017"
        },
        "star": 3,
        "title": "Works OK. Interface could use work"
    },
    {
        "author": "",
        "comment": "I have to say, this is pretty much exactly what I was looking for to control my Hue lights from my Moto 360. The only problem I have is that the \"use 24h clock\" option is set to off, yet my watch is still set to 24h mode no matter if it's on or off. I'm not sure if this is a bug or not. Only thing I would change is that it would be nice to be able to scroll to the next option on the watch face rather than having to tap that tiny little arrow.    UPDATE 1/11/17 Hey Muzzley team! Thanks for the reply. I've tried to manually change the time to 12 hour mode on my watch, as well as just syncing the time to my phone. The Muzzley watch face still shows in 24h format no matter what settings I choose. All of my other watch faces update to 12/24 mode without a problem, so it's definitely got to be a bug with Muzzley. I'm happy to continue testing things if you have any ideas!",
        "date": "January 11, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRkphWFlUNElMLUF2ZnJTdTRaS1BuOFN0TTVNMFo0VXpZTGpPbkpnM2VNUE5saHp1b3dLYkpYV01ma3BRRDBmVEs0NG1FMVhtMlhKRzNLY1ln",
        "reply": {
            "author": "muzzley",
            "content": "Hi there,\n\nThank you for the great review and for the suggestions!\n\nIn that case you might be right and it might be a bug from our side. Our team will analyse this and get back to you as soon as possible. We are very glad we can count on your feedback, please keep it coming!\n\nHave a great day!\n\nCheers,\nThe Muzzley Team",
            "date": "January 11, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Not sure why Muzzley needs access to my contacts list and messages in order to turn a light on, but as I won't give permission it's not working. One star because I hate apps that need irrelevant stuff.",
        "date": "December 28, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPR2J5blB4MnFSclVIdm1BdktiZ2kzRUJTY2RXd2phUzloMEQ2dWRlYThuZV9lSTd3UU9IeTk2OFFocjhQYXhqaFNyN1ZyUGVvSm1UblFvMk0w",
        "reply": {
            "author": "muzzley",
            "content": "Hi there,\n\nThank you for reaching us.\n\nAccessing your contact list and messages is to allow you to create Agents on the Muzzley app, which you can refuse to do or disable access to your contacts and messages if you wish.\n\nWe respect user privacy above all, and our goal is to provide the best IoT experience possible.\n\nCheers,\nThe Muzzley Team",
            "date": "December 29, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Imelda Coyne",
        "comment": "BEST APP FOR SMART HOME SOLUTIONS  I only downloaded this today and I have to say I absolutely love it! It beats many similar apps out there for its functionality and simplicity! But please add Amazon Dot and Yeelight/Mifit integration to the menus (the latter mentioned are by the manufacturer Mi who you have another menu feature listed).  Thank you for making my life easy!",
        "date": "January 22, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPR21OSmJCZmJlM3A0S3dLRzNFa2tlSlVzSHlXclo2X3pXcG9JcW5QS251b1c0aTVCNlVFOEY2MDk3a0JHaDhEUkxuSC1qaUFISWt3bnNkQWFN",
        "reply": {
            "author": "muzzley",
            "content": "Hi Imelda,\n\nThank you so much for the excellent review!\n\nWe will consider adding your suggestions to our roadmap. However, you can already use the Amazon Dot by downloading the Muzzley skill from the Amazon Alexa store:\n\nhttp://blog.muzzley.com/post/142326181999/alexa-now-talks-with-muzzley\n\nCheers,\nThe Muzzley Team",
            "date": "January 22, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "gary fowler",
        "comment": "Had this less than a day and it does exactly what i want with my easybulbs the sophistication of the set up and ease of logic is outstanding  i have set up for the lights to come on at sunset.......amazing when you think it does this via location and will adjust as its gets lighter earlier.....lights now fully automared great security feature. The ligjts on via location can be used to put the outside driveway light on prior to getting home......the limit is your imagination",
        "date": "January 29, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPSG9OUTBTVXgzYWh1cXhSWUx3UTd1azY0YWstbzBIRHlxT0FIUXNGVWlSeHhBQk1tR3k1VFZkeW05OFZPR3ppRzVSYVdDTmtLT1NGZjdMMHhv",
        "reply": {
            "author": "muzzley",
            "content": "Hi Gary,\n\nThank you so much for the fantastic review!\n\nPlease let us know if you ever have any questions or suggestions by emailing us at support@muzzley.com. Your feedback is really important to us!\n\nHave a great day!\n\nCheers,\nThe Muzzley Team",
            "date": "January 31, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Dan Leonard",
        "comment": "WEMO devices are great, the app is not.  Muzzley does what WEMOs app cannot, which is, well...everything.",
        "date": "April 24, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRmJSdkxFWDBodW11SDVSSzdlcTBTejVxRU9DNS1zN1EtN3FzSWNmTUg3SkF0TUlhb2publowS0stZTJERDBUT0NsY0JLaWFIMzBaZmt5cVFR",
        "reply": {
            "author": "muzzley",
            "content": "Hi Dan,\n\nThank you for the amazing review!\n\nPlease let us know if you ever have any suggestions on how to improve our app, and we'll be sure to consider them for implementation. Your feedback is really important to us!\n\nCheers,\nThe Muzzley Team",
            "date": "April 26, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Cristina Lopes",
        "comment": "I recommend this app to all of those that want to create a great smart home ecosystem.",
        "date": "February 13, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRy1fTXVCbV96ZlhyNDQ3YkpuLTVTSXBlckc4dnZVT3hXejVTX01VMExFbjZ5RDhXOV9JcGNCRmhHc0lkbGE0a1ExcHlzZXJXSlNLYk5qUTNR",
        "reply": null,
        "star": 5,
        "title": "I use it everyday!"
    },
    {
        "author": "Amnon Pahima",
        "comment": "doesn't support Vera",
        "date": "March 26, 2017",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRmNqTmtVSy1rZXJDUVRDdnA2cmtnejhRbmJHQjh6TXpqQmh6UVlqZW9BeEtocVVzTFhwa280cW9LU3BBMWY4WTVqajFQcVZBRU52RzB6OExR",
        "reply": {
            "author": "muzzley",
            "content": "Hi there,\n\nThank you for reaching us and sharing your suggestion!\n\nWe really appreciate your suggestion to help and improve our product, and we will definitely take them it consideration. As soon as we have any news, we’ll let you know immediately.\n\nHave a great day!\n\nCheers,\nThe Muzzley Team",
            "date": "March 26, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "William Steele",
        "comment": "It did t seem to have a way to add things that are just classified as zwave in Wink. It has to be Ge on wink or Osram on wink. I have a lot of switches, outdoor plugs and even my garage door that didn't show up. Needs a way to just pull in all my stuff or why bother? If you only have a few big name things this may work for you.",
        "date": "December 20, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRmVYbG9HX1VUU2wzMEwzelh3N1VfcXcwMkZ4ckdhQ0tvOHFBSXJDNUZuQ09naDdnWGM0bDNFdzJmRFhVbjFzXzFsVWlveVFaM25NZzZmYm9R",
        "reply": {
            "author": "muzzley",
            "content": "Hi William,\n\nThank you for the review!\n\nThe way Muzzley works is that we are compatible, as you said, with brands and not protocols. As long as Muzzley is compatible with the device, it doesn't matter what protocol it speaks, we'll make it work.\n\nPlease send us more suggestions to support@muzzley.com.\n\nHave a great day!\n\nCheers,\nThe Muzzley Team",
            "date": "December 21, 2016"
        },
        "star": 3,
        "title": "Only has options for the brand name stuff"
    },
    {
        "author": "Channing Hayden III",
        "comment": "Great support, but the app falls short in many ways. Rather than support the Wink Hub like other apps, they support individual device types running on the Wink Hub. So, my Cree and GE lights work, but not my Lutron lights. The UI looks pretty good, but the widgets are large and clunky as is the shortcuts screen in app. Seems like they are more concerned with showing off their graphic skills than making a functional app. Minimalistic is key; especially with widgets.",
        "date": "September 25, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPSGo0SFRYckRreUJadEYzeVo3enljblZGMXJsdDR0a1NHYXZha0xZODNQcGV5aVd4Nkk0VXZlcGVoRjJ3Y2Y0aEY0SjJrYUpsZTd1YWxKNmZF",
        "reply": {
            "author": "muzzley",
            "content": "Hi Chad,\n\nThank you so much for the review!\n\nWe will take into consideration your comments to improve the experience in our app, and rest assured, we are working daily to guarantee the best possible experience and improve the quality of our features.\n\nYour feedback is, as always, very important to us.\n\nCheers,\nThe Muzzley Team",
            "date": "September 27, 2016"
        },
        "star": 3,
        "title": "Falls short"
    },
    {
        "author": "Dan Hall",
        "comment": "I'm using this app to control my WeMo connected house.  The app is much faster, cleaner and intuitive than Belkin's hands down.  It's not as fast as WeMo Home but the native remote capabilities and clean design in Muzzley has me completely converted!",
        "date": "July 19, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRmNQQUFOb1FCdzRNdWVJNTY4MkRzVW9GNUg4NjlRV1NzeHhKWFNmMTFaTWRfX05aSmo4cWVVRC1Da2hfekt6OXFxcjgtQWJ1MkEwcTI0V0Rj",
        "reply": {
            "author": "muzzley",
            "content": "Hi Dan,\n\nThank you for the amazing review! We really appreciate it!\n\nIf you ever have any questions, or suggestions that you think would improve the experience inside the app, please let us know. Your feedback, as well as your satisfaction, are very important to us!\n\nCheers,\nThe Muzzley Team",
            "date": "July 20, 2016"
        },
        "star": 5,
        "title": "Clean interface.  Works beautifully."
    },
    {
        "author": "William Segura",
        "comment": "Promising but limited device support. You have to login to Wink for each brand of supported light bulb.I have other Wink supported devices like outlets and switches which are not supported. This really limits the usability of this app. You should utilize the Wink API more.",
        "date": "July 22, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPSDVPOGJBb3l0OTVnaVBoQ1U4NHgwbzNtcWFRM2V6MzVxeHJVVXhyMTlpS1MwbUowak5NX3dfeTRGZjFYZDhKb0xnM2RuZEg1UEJ4YUJxRDNZ",
        "reply": {
            "author": "muzzley",
            "content": "Hi William,\n\nThank you for the review!\n\nWe plan on integrating with other Wink devices in the near future, so let me assure you that we will continue to use the Wink API if possible.\n\nAs soon as we have any news about new Wink compatible integrations, we'll let you know.\n\nCheers,\nThe Muzzley Team",
            "date": "July 25, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Anthony Gurrieri",
        "comment": "I only wish this app worked with my Homeseer controller. Other than this one main missing integration the app is very solid. Any chance of making homeseer will work with this app?",
        "date": "September 7, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRlJubGFtRkxLQzRwa0IzdkNqQjlBM0t3NjFLNFU1dUxyZWRNQzV2V09BODZrd3NlMHhfUVRUbHpCNzlaNGtCbmY1ZktZM2J2ZUhSYmU4eEVF",
        "reply": {
            "author": "muzzley",
            "content": "Hi Anthony,\n\nThank you so much for the great review!\n\nWe really appreciate your suggestions to help and improve our product, and we will definitely take them into consideration and we will try introduce them into our product roadmap. As soon as we have any news, we’ll let you know immediately.\n\nHave a great day!\n\nCheers,\nThe Muzzley Team",
            "date": "September 9, 2016"
        },
        "star": 4,
        "title": "Would give 5 stars but...."
    },
    {
        "author": "Chad Muchard",
        "comment": "I think it's a great app. I use it for integrating buy insteon switches and door locks. It would be a lot nicer if you added wink switches and smart garage door like Chamberlain. But thank you for the great app",
        "date": "December 2, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPR1ZWTTlRRV9zZ3VHSG5rRVZNdEJGYUJBRE00a2d2OC1Jdk8wZnNhLTZsM1doVmNBel9QNFQwOGlXV2NSYXVNcHEwbl9GX05aU3lCNzBKZFFZ",
        "reply": {
            "author": "muzzley",
            "content": "Hi Chad,\n\nThank you so much for the great review!\n\nWe really appreciate your suggestions to help and improve our product, and we will definitely take them into consideration.\n\nPlease email all your suggestions to us at support@muzzley.com, and as soon as we have any news, we’ll let you know immediately..\n\nHave a great day!\n\nCheers,\nThe Muzzley Team",
            "date": "December 2, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Paul",
        "comment": "This is great. Works with Amazon Echo as well. Do you have plans to add EasyBulb white along with the colour bulbs?",
        "date": "September 10, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRkg2YWEwVVBVUWhWdHdzdUljT08tUGlWcU1xcVd1cnAxbXhTRFA2a29TMFZwM19nYzdqcEM3X2NQYmdrNG1RN0l4V0FuUlQxdW5odTdNZVhR",
        "reply": {
            "author": "muzzley",
            "content": "Hi Paul,\n\nThank you so much for the great review!\n\nYes we are planning on introducing white Milight and white Easybulb support very soon. Rest assured, once we release this new feature, we'll inform all users.\n\nCheers,\nThe Muzzley Team",
            "date": "September 12, 2016"
        },
        "star": 5,
        "title": "Superb!"
    },
    {
        "author": "Al EMS",
        "comment": "Says sign in aborted... Uninstalled.",
        "date": "November 25, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRlBRR2F0bXZoVHk0b1loU2pCOHhYUm9xM2kxRDYzWDhLYnNUQlMtUEF4QWZuc1FVYWVCQ3VsNHRsZ1R1eEtFYktMRTh3dk84bUVEUFpzaGxv",
        "reply": {
            "author": "muzzley",
            "content": "Hi there,\n\nThank you for reaching us!\n\nWe've tested the sign in process, and it appears all is working accordingly now.  \n\nCould you please try once again? We apologize for the inconvenience.\n\nCheers,\nThe Muzzley Team",
            "date": "November 25, 2016"
        },
        "star": 1,
        "title": "Can't sign in"
    },
    {
        "author": "",
        "comment": "Why do I have to use GPS for rules? I'm looking for simple, not complicated.",
        "date": "November 17, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPR1hvdlBoMm1XY1M5Z2pQM1RTeGtwVy1pT3ZGMmRUX25WVEg1RU9KZ2NaRzhaRmN5WWtmQzYycnR0Q0Rra0gxTXRkV2U3TnJlcEFsQmUyYk5n",
        "reply": {
            "author": "muzzley",
            "content": "Hi there,\n\nThank you for reaching Muzzley!\n\nGPS location is used for location based Agents, in which case the app requests your location in order to execute actions on your devices.\n\nWe respect user privacy above all, so rest assured, we are just trying to create a great user experience by being as precise as possible.\n\nCheers,\nThe Muzzley Team",
            "date": "November 18, 2016"
        },
        "star": 3,
        "title": "GPS for rules?"
    },
    {
        "author": "Bernardo Santos",
        "comment": "Fantastic!",
        "date": "July 23, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRU02SktNVHN6RkdGQ21uTkduZTZxdzlkcldqZlBNa0gwSmZHeVU4dzR1WlgyXzl0VndLbzY1N0ExTDRDQ1Zsb3AtNV9BeHRhQVNKVmRkM3NZ",
        "reply": {
            "author": "muzzley",
            "content": "Olá Bernardo,\n\nMuito obrigado pela óptima review!\n\nSempre que tiver alguma questão ou sugestão acerca da nossa app, por favor não hesite em nos contactar. O seu feedback é muito importante para nós.\n\nObrigado,\nEquipa Muzzley",
            "date": "July 25, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "James Nightingale",
        "comment": "A nice app with a nice, easy to understand UI but the delay between turning a Wemo Smart Socket on and off makes the experience feel less smooth. Also, Logitech Harmony integration would be amazingly helpful.",
        "date": "July 17, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRjluRkN2NGVVRGZpVGhrdE53YjhIbF8tU29mUVV1anozajBiY3VZRnRTMFk2MTBzN0N4REd4OEdnSzh2bEx4MUl0bGpOUGxxcFZlN05BSHlV",
        "reply": {
            "author": "muzzley",
            "content": "Hi James,\n\nThank you for the review!\n\nWe've tested the  interaction with WeMo and all appears to be fine! It was probably just a minor network glitch.\n\nRegarding you suggestion for integrating with the Logitech Harmony, we'll definitely take it into consideration. Once we have any news about it, we'll let you know.\n\nCheers!\nThe Muzzley Team",
            "date": "July 18, 2016"
        },
        "star": 3,
        "title": "Delay when toggling Wemo Smart Socket"
    },
    {
        "author": "Jaysn Rye",
        "comment": "Location based triggers are unreliable.  I have a 500m range Setup around home.  When I enter or leave the lights are supposed to turn on /off.  I can arrive home,  they turn on,  but 5 minutes later the lights will all turn off as it thinks I've left.",
        "date": "July 9, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRVQzamtiOWI3eFp3Qkc3Y3NRdVNzVTY2X1FGMUdJeEZ2ZzlORWN5TjBhMmtaRlkxZGxsdGNXY056VkNoT1V6N1pHa0lvNWpBZFZjajJCSzFR",
        "reply": {
            "author": "muzzley",
            "content": "Hi Jaysn!\n\nSince our latest release to the store, our location based Agents have improved reliability and are now working as expected.\n\nWe would like to invite you to try out this feature once again, and ask you to please get back to us in case you encounter any issues whatsoever.\n\nYour feedback is very important to us.\n\nCheers,\nThe Muzzley Team",
            "date": "August 3, 2016"
        },
        "star": 2,
        "title": "Has potential"
    },
    {
        "author": "Gabi Lipan",
        "comment": "App looks great! Could you add support for Hasled light bulbs? It doesn't work with milight for some reason...",
        "date": "June 27, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRjdTUjBxVWtHTms2UUZLOFQzT0JfQXJ3a2ZSWnRDT3lIem5ldUQwcjZGa1RTRWsyOUZEczZDMG9MbzlTTXRVV204Z0EwM3RQbmlNYVQ4Xy1F",
        "reply": {
            "author": "muzzley",
            "content": "Hi Gabi,\n\nThank you for the great review and for the suggestion, we really appreciate it!\n\nAre your Milight bulbs white? If so, that is because we are still working on supporting them.\n\nIf you have colored Milights it should work. Please get back to us at support@muzzley.com and we'll get right to it.\n\nThanks!\nThe Muzzley Team",
            "date": "June 29, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Per W",
        "comment": "Account needed for use. This a no go for me, do to security risk.",
        "date": "May 25, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPSE53SWJpMmdOQ3hjYUJzNjFxdDZ3S0JZdWFFY0wtblNGQzVNZGJfWnNTUUd4R1ZYYkxLLURaVGJKYktkaUZIbHU2d0dVUXpqdlBDQ0wzazFV",
        "reply": {
            "author": "muzzley",
            "content": "Hi there,\n\nThank you for reaching out.\n\nAt Muzzley, we value the privacy of users, never disclosuring user data. We can assure you, your account information is secured. We would really appreciate if you tried us out, as we will do everything we can to improve your Smart Home experience.\n\nThank you,\nThe Muzzley Team",
            "date": "May 27, 2016"
        },
        "star": 1,
        "title": "Account"
    },
    {
        "author": "Carlos Medina",
        "comment": "I have a 8 miligth led bulbs being linked with two wifi bridges located in the front of the house. I am able to manage them through this app with a manual and time commands. Customer service walked me through the set up process. Mr Goncalo's help was outstanding.  Thank you very much!",
        "date": "May 5, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRTVJaHNwQXJYdDBTYkRQNWFFbWZIQmZPSWgxVjl5UGtFRGZkcUt4Zjk5ZjBlQWtmcGlqOEpWM0g2SmpLQVNSeHotZG5nWUt6ZGNORTZTVmg0",
        "reply": {
            "author": "muzzley",
            "content": "Hi Carlos,\n\nThank you so much for the great review!\n\nIf you ever have any other questions or suggestions, please do not hesitate to reach out. Your feedback, as well as your satisfaction, are very important to us.\n\nCheers!\nThe Muzzley Team",
            "date": "May 6, 2016"
        },
        "star": 5,
        "title": "Great,  excellent app and outstanding customer support!"
    },
    {
        "author": "Conor Letham",
        "comment": "Liking the app, but the widget is useless when setting it up with an LIFX bulb. You set the shortcut only for it to loop round again with no result.",
        "date": "April 27, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPR2VnOVN6b2xXbl9EVzJnZjZ5OGg2Qm90ZjNtenotOTJjSW5vZDJsWG5JZl9jcjF1ZUNrcUFWLXJIVWdwNFVHdHJHVnRmc2hzSzdlODlwXzJZ",
        "reply": {
            "author": "muzzley",
            "content": "Hi Conor,\n\nThank you so much for updating your review!\n\nPlease let us know if you have any other questions or suggestions. Your feedback is really important to us!\n\nCheers,\nThe Muzzley Team",
            "date": "April 28, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I only wish it worked on the watch as an app instead of a watch face.",
        "date": "May 13, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPSE1Ba2FWLXJUdnNHUU5pVFFWUnFJZlhMUmhLQVpfY09MdVByUUJrTW1zUkpnVVJqRUFLNU1LUEctUHZwT3VQN1h6ampCWlJ3eG1waWFGRU1z",
        "reply": {
            "author": "muzzley",
            "content": "Hi Alison,\n\nThank you so much for the positive review!\n\nWe understand what you mean, you'd like more features on the watch besides shortcuts. Could you please share with us what other features you'd like to see on the watch? Please email us at support@muzzley.com, and we'll take all your suggestions into consideration.\n\nThanks!\nThe Muzzley Team",
            "date": "May 16, 2016"
        },
        "star": 4,
        "title": "Great"
    },
    {
        "author": "Adrian Lee",
        "comment": "Great, easy and visually appealing app! Combining great features. The developers are quick to action on any bugs and requests. Looking forward to seeing future updates and features!",
        "date": "April 19, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPR1BqMUg1VVd3ekZPcDdwenlLNC1VUVdEanBFOXZRN2dmNTFJQ3lhNnFDamI4cHFTMVlYOEw4ZlNVOWRQMGdISVA2dFJjU0dpY2RwMWhkYlM0",
        "reply": {
            "author": "muzzley",
            "content": "Hi Adrian,\n\nThank you so much for updating your review!\n\nPlease let us know if you find any other issues or have any other questions.\n\nYour feedback is really important to us.\n\nCheers!\nThe Muzzley Team",
            "date": "April 19, 2016"
        },
        "star": 5,
        "title": "Great app combining several 'if's' and 'then's'!"
    },
    {
        "author": "Brigham B.",
        "comment": "I love this app! It's very hard not to like this app. It has a wide feature set for the more power users but (possibly more importantly) it has an intuitive UI that makes managing a smart home easy. I was disappointed, though, that my Zuli smart plugs were not compatible.",
        "date": "April 12, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRzg4c1diRHFPZGcyNnZEb1E4eW5zSW5RM3lSbzlpQjdwSTJNME1YTEczN2RPU1JIM1V3TGhxZjZIOUs0S2RXV2JpSVpYalJOal96RlVxVXdn",
        "reply": {
            "author": "muzzley",
            "content": "Hi Brigham,\n\nThank you so much for the great review and for the device suggestion!\n\nIf you ever have any other questions or suggestions, please let us know by emailing us at support@muzzley.com and we'll get back to you as soon a possible.\n\nCheers,\nThe Muzzley Team",
            "date": "April 13, 2016"
        },
        "star": 5,
        "title": "Love this app"
    },
    {
        "author": "Jason Cohen",
        "comment": "Crashes when I try to add widgets for LIFX bulbs",
        "date": "April 14, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPR1V6OHZIcndDbGJDc2Q0SlBzY2JyS19zVTgwclB3VUVoZkg3eWFfSXl4b2w1MEJxYlhSUzNLMEl2SldfbksxWUM1Tkt6T09PTGJkRHFqeG5n",
        "reply": {
            "author": "muzzley",
            "content": "Hi Jason,\n\nThank you for the review!\n\nWe'll get right into this issue, and our support team will send you an email with follow up questions to try and debug this as fast as possible, causing you no further inconvenience.\n\nThank you!\nThe Muzzley Team",
            "date": "April 15, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "The app closed immediately on OnePlus X. The devs reached out and after the latest upgrade the app is working.",
        "date": "February 18, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRWY1RGNBNVRzWWhxUjhhRC1XRm51bWsxZkRyejlFcUE1aERIajhSOFZTMURCNDk1YnRMN1JNNVlYdC1BZlRXX0NIc2RkTGJnMTJ6SEV4Z0Vv",
        "reply": {
            "author": "muzzley",
            "content": "Hi Boris,\n\nThank you so much for updating your review!\n\nWe are very glad everything is working now.\n\nAs soon as we have any news regarding the issue, we'll let you know.\n\nCheers!\nThe Muzzley Team",
            "date": "February 19, 2016"
        },
        "star": 4,
        "title": "The app works on OnePlus after the latest update"
    },
    {
        "author": "Michael Ambrose",
        "comment": "Needs wemo motion support to be useful to me. Too basic and lacking in many ways. Poor support.",
        "date": "February 10, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPSF9TTWg1Tnp6aTdxcDY5NkFQbVFOcUJCaE5pajhfWkpQM3dnQzhmUm9rMFRacjdNMWNydlp5azBDdWwwZnR4VGNYbHM3MWdUQXlINzQxZmo4",
        "reply": {
            "author": "muzzley",
            "content": "Hi Michael,\n\nThank you for reaching out!\n\nCould you please share with us in what ways you think the app is lacking? Your opinion is really important to us, and we'd really appreciate if you could share your thoughts with us.\n\nCould you please send us an email at support@muzzley.com? We'll get back to you immediately.\n\nThanks!\nThe Muzzley Team",
            "date": "February 12, 2016"
        },
        "star": 1,
        "title": "Lacking"
    },
    {
        "author": "rick Ramirez",
        "comment": "Does a good job and then some keep up the good work. Looking forward to see what you guys can do next",
        "date": "February 5, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPR3ZlMmdlTVIxVFNRRDVBQWtGVEd0cFJtdllCejZwT3ZXWDNkU203NERWQTVGSjAxS05KMG1yOWdCZkI1WnpaR21CTUNMZGxFZ3RNdm9zemhR",
        "reply": {
            "author": "muzzley",
            "content": "Hi Rick!\n\nWe really appreciate the awesome review, thank you so much!\n\nWe'll keep updating you on our latest features, don't worry!\n\nCheers,\nThe Muzzley Team",
            "date": "February 8, 2016"
        },
        "star": 5,
        "title": "Nice app"
    },
    {
        "author": "Andrew McCabe",
        "comment": "I'm after something to integrate Samsung SmartThings with TCP lights so this app doesn't do it for me.",
        "date": "February 11, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPSDZrYzVGZjRmbFpNakJVckZtQUs1Q1RHdGdPRl9uYlRab01hVHF1WjZzOG9OUHM0WlQtaExEOXZQMV8xSzFySDk5cm9LakpfUDlXdDFVcUJF",
        "reply": {
            "author": "muzzley",
            "content": "Hi Andrew!\n\nThank you for reaching out!\n\nWe can certainly see how Samsung SmartThigs could be an advantage to you. If we start the integration process with Smarthings, we will definitely  let you know. Can you share what connect devices do you currently have? \n\nTo reach out to us, please email us at support@muzzley.com\n\nCheers!\nThe Muzzley Team",
            "date": "February 12, 2016"
        },
        "star": 3,
        "title": "Probably great at what it does"
    },
    {
        "author": "George Prekas",
        "comment": "Great app with greater supp",
        "date": "January 18, 2016",
        "permlink": "/store/apps/details?id=com.muzzley&reviewId=Z3A6QU9xcFRPRXV3dVRWX3NjOGhURVRxN3h0U05ZYnYwaGJkY1FBM2lKczdRcHVQaW9mZFk5Q3cxZWQzQlAyZnUySFROcHJoTlVDV1o3cXgyREctT25pandj",
        "reply": {
            "author": "muzzley",
            "content": "Hi George!\n\nThank you for such an amazing review!\n\nIf you ever have any more issues you'd like to report, questions or suggestions regarding our app, please feel free to reach out whenever you like. We are always available!\n\nCheers!\nThe Muzzley Team",
            "date": "January 19, 2016"
        },
        "star": 5,
        "title": "Love it!"
    }
]