[
    {
        "author": "Shyam Sunder",
        "comment": "Every time there's an update, it says bug fixes and performance improvements.  Does it mean that the earlier version are not proper and why the update is released before checking for the bugs.   Nowadays, I am not getting notification tone nor intimation whenever there's a new message.  I need to keep checking the Gmail box every half an hour.. kindly check it out.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRVhsdXI5WHBhZ21ZZm1jakdzeTBmWTFoN0VjVkpaWXZ1R2NkclpGWjVCRnJITUVTWHg2bUp4bWU1ZzJqNlB2VjZlc1BXMVBvMm5kSTZxQnNR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ruchi Patel",
        "comment": "Displays the correct number of new mails but does not display the actual mail immediately after forced or auto sync. I end up opening Gmail in Chrome to read the emails...additionally, what's with ads taking up screen real estate in my inbox? Not a fan, at all.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSE9pbFhYMDJ0UUR5X3gzLUNDUWd6UlotRm1ZRnA3X0Jyb2d0ejR1OUdyVEtxcVg2cjUtWndmMWhsZHNqWThUdnY1R2ZVenhfdTlCN0g1NGNz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "M. Daniel J.",
        "comment": "Tried to access an email account with 2-step verification. I got no text messages with the security code. So the app locked me out of my account for three hours for too many attempts. I had to go to my PC and disable 2-step security to install the account on my new phone. 10 minutes after this I got a flood of security text messages...35 minutes late that locked me out of my account. So your security server was down evidently. Well done Google... well done.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRzJqLVZPTV92Tk1hbi1USkxsUW9RQ0E2Wmt5Q3lWY0RoSTJYMlhfSmdzWmZjLVFqS01iWENnVjlNUWpRSWVkME42Smc4Mjh2Q29HWGNTVE9j",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "GURUMOORTHY ictcramesh",
        "comment": "I have a lot of mails in every folders (spam, promotion...,) So while trying to delete Every messages from social folder I have to select one by one by hold pressing. It will take so much time to delete message on specific folder. So I expect that your future update of Gmail app will have a option to delete Every messages on a folder by one click....",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRWNwdWZEZTgxTDJNSlJtZFBrVlI1em5UNHpWWk1seU5sUUZtQ3JKTjBTbUEtXzBTSWhoREtZOV9CRktzTG5xMUkyeU1sekdob3QxUUhRRER3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Richard Andrew",
        "comment": "How difficult can it be to program this app properly so when one ticks each email for deletion or archiving, by tapping the LEFT side of the mail header, it actually ticks the email and doesn't open it up for reading? Try selecting three or four emails fairly quickly and you'll see what I mean. Bloody frustrating!  And when is the bug where attachments cannot be downloaded going to be fixed?",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRVk0TGhaelY4Uy00YWdPNERxS0UzbjdoWGU3QzU4MHVZT0hEbWZxaHhXMUx4MWwyRjVvaS1EeWNnR2FOa0hXY2hQVmlYOW9lcld6RzZaTUtn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Lorena Matek",
        "comment": "For about a month now same issue no matter what I do with the settings and no matter the latest update. I am constantly not notified of new emails and they don't even show until I manually sync. Everything is set so it should be working on auto-sync. I have never had this issue before.  Please fix, I always enjoyed using Gmail.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSEFBUzhFVWxNTUtoOFBDWDk2UUZCazhrRENFbXZMUjVLcWxtendqU0xnbDJ5cHN5NjQ3UE9mc2hBOEw3bTAySW8zbzl4cXUwekJJSHZfZUFV",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Salina Anderson",
        "comment": "I've never had an issue with the gmail app until the last update. It's now a nightmare. Crashes and crashes and crashes and crashes and freezes. I can't type one sentence without it lagging way behind me, freezing, and crashing. I'm officially uninstalling my gmail app. I've had a gmail app for years n years... Can't even use it anymore. It's broken, google. Get your life together.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRS02REVZRTNNQ25VT0pjUGFwTGdNX1dxbzlQTUhGZXNfQzYyY0twRDNjR01USnluUDJyZ3p4YkFBSU1DMFJpOXZ1TVFPRmswQ0VGTjktOWJv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Xboxgamer12346",
        "comment": "Its crappy. It doesn't even have a select all button nor can you manage your inbox efficiently on mobile. Would rate 3/10 unless it was easier to manage you e-mails on mobile.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRm9VQXBMeU14ZktRTGkxNEJrWVhDeVloZXFQMkZXeXY2TGFDd3RfWFkzYjBPdDNuZ2FGVWlQQldsemV4dDhybDZBc0w0aG9rMlRBbVhPRnBz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Heather Stevens",
        "comment": "All of the sudden I can't change which email address I'm sending my message from. I used to be able to select from the drop down and now nothing happen s and I can't switch. And since attaching a file is a nightmare is you compose first, i have to select several images from my gallery and click share via email instead. But then i cant change which email account to send it from.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPR2g5OERsbGItbEpDdUFRRUJYaFZ6dGIzS1FadkN1M0tqOUNhXzJ0TWN5WGV3SmFaM2RIazZBaUx5WUdhYlQwUU83M08xYlRLRDBqNmxmY29n",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Firat Sarsar",
        "comment": "Please re-design the inbox part again.  1- it should be an option  to sort of  unread emails first. 2- it would be great to connect Google  calender thru email.  Therefore it would be easy to set our works by putting our emails with attachments into the Google calender",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRlBQdk9GNjhBZ2taQmp0bUdZaUVMVnoyRzJvUzM0ZG9fWWlvRTl3dnJaVWV4VU9KN1A1RVJaNVM3YnAxQ2JfLXlrZEExaUdTRU5UenQzNkNz",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Cookie S.",
        "comment": "After the last update, my app has been crashing nonstop. I can't type out a paragraph in a reply without the app crashing no less than 3 or 5 times. I get notifications for emails once in a blue moon, I have to check the app manually every 15 or 30 minutes to make sure I didn't miss any new emails, but this has been going on for months. You say that the updates are \"bug fixes and performance improvements\" but it seems like it only gets worse with every update :/",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRVZUZTk5MElZOEV3a1U5LVJLa2xYTUxiZjI1NlJlRWdjZXQwNVZBOE1GT0pSV05iUzZTbXAyMHlrTFB5WGhEdS01Uk1SWmJXVTVobjhESC00",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Rebekah Parkinson",
        "comment": "Well, it would be such a better app if it actually informed you when you get an email and stopped queuing outgoing emails. When I push send, I expect that email sent now, not tonight or tomorrow or whenever you decide it's worth your time to send it.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPR1J4UzNHVWxKMlBLMjRucUFLT21xNGZaY0xDV19IU3B0cWxQSl9GRzlscFF0XzFHd3Y2NEZrN2daRUc4eGlTWWNyb3FVRVRsaE4tci1NZmU0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sarah Lawver",
        "comment": "Easy to use. I like the swipe to delete. I can switch accounts. Now they changed it to where your promotion emails disappear when you close the app. Don't fix what ain't broke. I don't have any annoying notifications but people do for some reason. Must be their phone and the app.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSExVSHNuX2UtRk9mVWhzUE54Y1MtMWlWRG40LW9LN01DQ0Zwd05vQUIzM19ZMkpKTU9FYVdzS21LSDRHN0c5Q1BXU3dxcE9NWnZNckc5M0Yw",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Vikki",
        "comment": "Shocking for a Google app. Barely refreshes, when it does it takes forever & I can never search for specific emails as it just continually loads without showing any results. Think I'll stick to yahoo for my important emails",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRmlhQjB0eXZXTmR5dzJVZ0xLa0NDMkRvVHRrem10bG9jUVM0YVRiOUVnVmRWZi1ob2hnMnNCR1BaZmJ1eXRpTWlwUE0wdGUyQTFreWhjLWg4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "D Pearce-DAWMAIN",
        "comment": "2/28/18. Please listen to your users. Other email providers allow us to create folders on our mobile. Why is Gmail only able to do that in a browser??? I really hate that you are not standard as other email providers. Please make it where gmail mobile allows you to create new folders or delete some for organizing emails without having to use a browser.  Also, please allow a sharing of emails especially in regard to newsletters so they can be shared to apps like G+ etc. from Gmail. I don't have sync problems with other email services like I have with Gmail. Chronically. Google Photos is wonderful, other Google groups are good, so please do something about Gmail and G+. They give Google a bad name and really make me want to stop buying Androids.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPR3lFMkdRelh0cVpqblFBYmM1SVJFWEZqNTNqRVVTMmJtcHBFWGVyTHBiZ2M3Z0RRNmRTbWVSUWJ2R0NYVUZBNUpVWUVtYm1FMnlHWXE2c1l3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Starr Giroux",
        "comment": "Horrible. I am CONSTANTLY deleting emails from several years ago. Each time I delete them, they return a minute later. Extremely frustrating! We're talking 295 emails every few minutes even though they are repeatedly deleted. Doesn't matter if I empty trash, clear cache, or uninstall & reinstall. Terrible app. Would not recommend it.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPR0M1d0NYQjZSNVZWelhEU3AwM05lQXZqWEdLZi03a3lOZVVBdDlzWUdUM1k5dHZGWHE1a3lvcGhweVJHUjdSQjNfb3NGeXhHWHFxRzQ1M01r",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Mike Potter",
        "comment": "On Samsung tablet on replying to an email it skips down to typing in the email am replying to. Is very annoying. Wastes time backspacing over bad typing. Then finding where skipped restart typing. Doesn't happen on my much smaller iPhone screen. The existing email text should be locked from modification by default. Shouldn't be rocket science.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSGdxQzF1Q1VLRnI0Mlk4Yi1YbjhiM1RkVlpHN2F5RkRIT0RoUFFua0pONEFGR3dSMXVLRVdneFRmSmFBWF81V1Iyb3VXdzRNc3pLQ1FKcEJN",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Shane Burke",
        "comment": "It said one account for all emails. I just found this one because the last four years Google couldn't find me or my info although they sent me verification codes twenty times a day. All it did was link every account to each other and only give me spam from all the accounts while hiding everything I need. This one has nothing synced and I hope it stays like that, but I'm scared to use anything because it's a new day",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSGJXUnV0RERtSDZFZXZiZXdYa3pxMVVwakdqMHVmcnhUZ1ZJc3c0aXhmeWVZeW9Zd2lOTE1GMHd4V1UyZXNpS2xFTW1sZlhlV3lDTk9BYmNV",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Amlendu Khapre",
        "comment": "I like the app. But past few days there is a syncing mail icon on the notification area which does not go away. This is getting annoying.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRXZpcmxhNEg2VUJVMVlhOUs2a2EyRTZoV3psUW45MGczRFgxay1nUDRLX3NFRUdFWDFxYzMtRDFkTHUzOEs2SnhhSHZSTEQ3Qm81RmV2c1Q4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "This app isn't bad. It has a few problems now and again, such as not being able to read new emails, but that can be fixed either in settings, or by updating the app. It's simple, easy to use, easy to access, and all round useful.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRnFBbTdwV2dFMVR6Z0pHc2lkMVlVc0hPYV9ncldRa0N2SGNEWEVBOFRqUHJ4dGJmR1NSbmUyYXJVNkN2VEJ2b2ZWZ255dzNpSkhaeERqZEtB",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "vishnu jangir",
        "comment": "I Got 100GB extra storage bcz of Google local guide program. I have used about 90% plus storage. Now 1year passed ,Google had stopped my all services due to storage issue. If you are providing the storage, then why you have debarted the services",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRzdxT09OeXZ6V0lwY1ZOc05SVGp0MHJUa3NneTlRbkowejdXQnk2bmJ4Y2Z6SFdyTTIyWjhYclQtZTVSdThuUWtUUmc5WXVsQktrclpMV01B",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ian Craigs",
        "comment": "Awful when trying to copy/paste messages as paragraph formatting messes up. Does not happen with samsung email app so I know it's not me or my device.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRmdta1FtYjNIYXM1c2NlQVdBRlNMZFc1THpUOVhrN045VGZfTEdVcXBJMEVNNEtONlg4aXAweE03NkNJei15eWxuWnVZdFl3bHI4YTNxZHVZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Alan Graham",
        "comment": "Yesterday, even with update today, this app notifies me of random emails from years ago.  GMail via chrome doesn't do this.  Looks like I need to uninstall.  Google is going downhill.  I'm not happy with Google Home either... Amazon is better!!!",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPR2JSemg4bmVnUG94QVZadWQ2ZEMzNE5EMm1sQnBoczloQjBVSTdOUnYzTlNRT3hNeUdvRWdwTTRvU1NraHE5WjVNLVVFMEdNYTZYUWNtT2pJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Benjamin Kitching",
        "comment": "Happy with it except I cannot \"select all\" messages either in primary or search column messages (or at all) It's probably the most frustrated I have been with an app.. very poor design there. Not happy. Please fix this. Please.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRnQtZ3ZodG00M05vY0xmNEZWcEhaQ052ckZsQ2k0LUZwcTdsaFIwdUFYZHNidGdxekM5dzRlUV9RY0RtendPUjQ4TS1Vc2RaRDA4X29WRE8w",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "T Bird",
        "comment": "I usually really like this app. For some reason, though, it's crashing almost every time I read through old emails or tried replying to an email with more than two replies on it. It's been doing that all day. Rating will change when it's not crashing.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPR0h4YjVQOWxXeV9hZGVsUHFaN1BSWlpQTk9NWGJwWTJBMUtoMTBCaktXVVVhejdmNXdxTERmLS1NeGlNSTh0dWFERzNhYlFBRjI1anVhNXNj",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Χ Ν-Κ",
        "comment": "I use it but I hate it utterly.      Especially the way it handles attachments, conversations and the fact that it won't store as many past e-mails as I need for reference.     I hate its interface, the lack of proper text formatting, no read receipts, that it can't be set to automatically copy all messages to self, no link to calendar, no memory of e-mail addresses sent/received...     The list goes on but migrating to another e-mail app is too scary a prospect to consider as I see it losing all my e-mails.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRWNYd2RDcjFMcTBNcmEzMmgtOFI0d2N1akVSc08ta2hFUnBOSlQ3dWQyWDlYSTVOckRpOW1aa3NsNUdLdmFxQTBoTzJ3TFJyYl9OTlJzSG5F",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Anita Plamann",
        "comment": "All I can say is GOOGLE what happened?  You've totally dropped the ball.    I can't format any of my text and I can't even add links to my email.  If I wanted to just type and add a pic I would text message.   I am trying to send a professional email and I can't do it from my phone any more.   I checked and they did the same to the mobile version for my tablet as well.  I generally use INBOX for my emails, but all of the options were removed so I logged in here and same thing!  so infuriating.  This better just be a glitch that is fixed very VERY soon because this is just not acceptable.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPR3dPbFpraHRucXhKSGU0TzUyUHltMU5sRFpyNnJ6UjNXNVVxT21OZl9YUlFuWUdMQnY3ZlRCVXVjU3lBenMxZmVGdGxFRURTSTVzMFRaSTRN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jesse Blume",
        "comment": "When I try to open files from work email no matter the file type it says problem with file. I force close the gmail app and reopen and then it works . Coming from iPhone where for 10 years I could open any email without issue doesn't impress me . Fix it Google",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSFNtNkpWREpCdXhOVkZna2hpV1VJYWRjSXVsM1R3ck4wVHAzRHM4YXQ4cWYtaC0wSWRQVnpPSDZaR3p4YWdHQklUQ0pwMTJTTlZoVWNMcU1R",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Keanna Allen",
        "comment": "This update is stupid. It take literally t mins to load up my email. My mom sent me me an email and she had to text me to see if I received it because I didn't response back!😡😡 I was working fine before the update!a",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRUpmVngtVWUyUDcydm5CT3U0VkFIUXFLWEYwT0VUVkx5MWxSNTBja1dmem1RcFY4OTlhWkU1cFVULW10VWZNcl9WbE9UQ1pUMmswWmRHQk9V",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Joan Rosborough",
        "comment": "Seems I'm not the only one having issues with auto syncing since the recent update.  Not good Google.  I'm at the point of checking into some other email apps.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSDZSZmJYb2hRVEhsUE56Q2dad0ZmbEhTcGJMSDBYcElwSkYwcElTaU93QnhKUWd0VFU2bDVOaVNPNnRCWHJUQ3I1UWViSllFS2syVnZRUm9j",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Paul Brockett",
        "comment": "if I could give zero stars I would . cannot turn off conversation mode (yes have it turned off in settings). Very slow if at all in displaying photo attachments. Fantom unread emails, it shows that there is unread messages but there are none available. Shows emails previously deleted. It has gotten worse since last update. Will not delete email from yahoo account,  they just reappear like magic,  but its not funny. I really don't know why people complain because Google will not listen because they are too big to really care what their costomers want they know much better than we do. Most recently cannot add new or existing Yahoo account",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSEhMNURTbHdTaXBsS1h5N3l1OTdIczNQWjZrbnZ1bnFhdGYtRkotN19KT0dfWXhXU2p2VWNVWkRLQ3NGcHRxX1JKNkE0UjZfcW56eTBJSGpn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Since this update, spam and trash say they're emptied, yet always show one email in them. I've found that the outlook email app is better these days, so might swap to it for this email account too!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=bGc6QU9xcFRPR2Nqc3ZHQ0YtU0pVcVljRHRDanFJb25hS0ZlTC1ZSmlhQk5PNFZ5LTZYMUJWVGxnTFE2NnlEbjljeHg1bGNXTFJYQ0VfQTc3TnBEN2lVcEw4",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Josh Glover",
        "comment": "I just spent the last 15 minutes trying to locate a file to attach to an email. Still didn't find it through the app so the I had to share it through the OS and copy out everything from the draft email. Because I couldn't copy the email address i had to flip back and forth between drafts  typing the email to ensure I got it right. Brutal.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSDhEZzF0N05qWUVOVkpPdXlsNHdlZ2RrSkJtSW1xaWhfc1dCbHhVY05MLS1xbGdJd1N0dzRKRUFCTm0xWjBGYW9YNmh2dDdUTVlZZHRxUGtJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Alan Casey",
        "comment": "Since the last update I have messages in my outbox that won't send. Have tried everything including rebooting, changing sync settings, clearing cache, not working. I can receive messages fine.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRzBjaWE1NnJJWDRGUV82LXJGU01FVHJvZ1MzLUhzQThZYV9WaTlDc3dYSVVwTlpZc0gwNkdaQkpiNlZSeDZXYkFqb0g2UDNRU0JpdUtUTUZB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "matt ziegler",
        "comment": "Normally satisfied, but now it is not showing my notifications for an multiple reply email. I have to scroll down 20 emails to see if I have a new message to a conversation starting a week ago.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPR2tBNjAxNlo4VmU2U3VFaWhsMS1lRUg4UGdvQTJMSFRJWU9oejZRU1ZtNmt6MkdrLUc0MDlpazBKTHplczB5Vl80VjJmWFJzTGNhTFVwdHgw",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Colin Cummins",
        "comment": "Annoying. It continually loads emails I have already deleted, and does it multiple times. Was good once, past its best now",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRU8tSVBIRXJRa2NNZkdmaE56N1pNU2tJUVpfZzZkMWFkazVNVkEwZ1pCRVJBajNfdkFMdDN1MFRYaVQ5NVk5d0RKMEpPbE5NeHpER0dYX0xR",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Kody Klinginsmith",
        "comment": "Its all at the touch or a click. Nothing hidden. I had never before gmail been an online messaging person. Starting a new business in 2018 changed that for me. As a daily user, I could not be happier with the Gmail app.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPRWRzdzlKYXh2c1ptMDU2bEV2QUxXZmJ6UUNUMzMwamJ4SEEzbm40NmI4bVdnZHdRdlFjMGRDRmdYb0dmbTczZ2w1UF9OaXpIN3FrX2s4SnJn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sanju Simon",
        "comment": "It's taking too long to receive mails. I sent a mail like 6 minutes back from my windows desktop. It still hasn't shown up in the app.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSGNrUUpuVThNNWQtLUx5UjR2bEowcGVjMEhnaHlaWDJqT2wwWWJXX2N5ZDlXZTgwSEpnZ0VTRTctOU5HczBQa3NqcE9vcHpkWl9HaThZNFdv",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Carolina López",
        "comment": "Its great i would have rated higher but i have one problem when i want to delete some msg there is not an option to mark all so all can be deleted i must delete one by one and sometimes i have hundreds of mails thats a problem please fix so i can rate higher and save up more time in not deleting one by one... thank u i hope u take my review in consieration and that u do fix plz...",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPR0NIRzg1b3R3SGRjUmpIVnl4RmljbUZWRkhTcFNJRUhnNHZTcWJTb2hhOE5UYXRfWDhBOFBqcmUyM3M0NWxxc05TWGpOLWVHZzVwRzF6QnFJ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Joeri Dellafaille",
        "comment": "Most issues i had in the past are fixed although still no 5* for 1 reason only.  When can we ****ing make folders within the app?  Tags aren't enough if you want to keep everything tidy + having to do it in a browser is really annoying when I'm too busy to even used the PC to get it done as of late. It has really been bugging me as of late",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.gm&reviewId=Z3A6QU9xcFRPSEtzT3RnZTBpS3ZXT0xwbGVKOWYwa1FyTDUweHJLbFRmZHRfc1luSWcyZUhSNFVFYXkyV3FMbXVxelVDX0M3dXQ3QnB3ZnVTczB2bENoZ3Fj",
        "reply": null,
        "star": 4,
        "title": null
    }
]