[
    {
        "author": "Mae Marrow",
        "comment": "THEY STOLE MY MONEY!   I been using moven for 2 yrs and so far its been great. But this following week i started to use the moven stash to keep money to the side for new years. Unfortunately everything on the app work expect for the moven stash section. I cant touch my money. I have to email them to even transfer my money back into my account and still i dont know how long that going to take. I can use the app but not moven stash. Its funny how it was working fine before i put money it. Now im stuck on new years with no money because i have to wait......i dropping them! Dont do it only thing that is good is no fees...other then that...not good customer service...and cant talk to anyone!",
        "date": "December 31, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPR2UzRWFPS3loYTFONlRLTk5fdHdCbkY0Q2tuV216ZEFmSVE1cVgtbEVZbEJ5bXVaeUtlcG0xMXhVNkRtb0pPMnZxcVVaM3g4b0hnR1VfM3c",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Mae, \nThanks for reaching out. We're so sorry for the inconvenience. A member of our support team has contacted you and was able to move your money for you. Additionally, our tech team is working to immediately fix this issue within the app. Please reach out if there is anything else we can do for you. ^AG",
            "date": "December 31, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "M C",
        "comment": "I like the card, but sometimes Moven charges me 5 dollars more for transactions over 20$. Customer service has not been helpful about answering my questions on how to load it. No stores on their site has even heard of Moven and I can never add cash to my card!   Updated: to Moven support. Nope. No ones heard of repower. That's what Ive been trying",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSHh6eVhLeVZMQVNHTWM0OWp3UlpNYURLNDJaeFlsTGZZaVd3MFJxQ2luZFlDX1ZzLXRkako2M00yT1Rxc2EwakgxcE16MjNjVkRQQVVWcVE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Michelle, Sounds like you're trying to add cash to your Moven account using the MasterCard rePower network. Moven does not charge a fee for this service. However, the locations offering MasterCard rePower will charge a fee. Our app shows their fees before your deposit cash at the store. Just click the $ button | select Cash/ATM | Deposit Check.",
            "date": "November 7, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "ma-shaa Heppard",
        "comment": "Love moven there are no over daft fees ever and the the customer support is awesome! Any problem I've had they solved it quicky.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRW9zNEcwcjRoSjZqd0tWb1ZLN3EycHg4UHFwR2gwd182Sm9iSDdLVTZzcmt6MUEzeUJHRVFXSTRZcGl6dUttSzVqRHZkNjNtUHU0MTJvNEE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hey Ma-shaa, \n\nWe appreciate the kind words! Have a great day. ^AG",
            "date": "January 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Daniel Ravert",
        "comment": "I refuse to get a \"regular\" bank account until they can match the service and communication moven offers always incredibly easy and helpful and I've never checked my account and said whered my money go like a \"regular\" account nor any overdraft fees",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSFkyX3B0bDlzbno4aGprZjNPbWxRdUgyTFNrbnlpaHY0UVFGSk1OdXl6UXphVkwyck0wYnlxRlpYeEVZRW1Qd0RNZkl5eWQ5V1kyNUNYbVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kristin Pierpont",
        "comment": "Moven is amazing and their personalised customer service is even better! I have used them for years, and can't imagine going back to a large banking institution ever again! Five-star rating from me!",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRVR3ZWZlWXo5a2s0N0V2VzJreUlCZWVVQWpMdDgyOFlmb3ZpS0k1Q3BvVWZhX3ROTnZZb3drQkN4WU00b0VBejNVN3ZUcFByLVhlWUF6Unc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hey Kristin, \nWe appreciate the shout out! We're always happy to help. ^AG",
            "date": "March 1, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Travis Butler",
        "comment": "I can't login to the app. It no longer accepts my password which is correct. and it won't let me create a new password. Customer support won't answer or return my calls.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRkFCYkRLVUphdW83ZGhaakxsdHI4NmdueHM4MW95Y1BzS254ZUU2dllzVkpLMEpibDJhWlF3cGx2VzRuYk1jTm1SX3ZmSEdkcW1oR1U2cnc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Travis, \n\nThanks for reaching out. A support team member will be calling you this morning to help you out with your username and password. You can also reach us at support@moven.com.  Have a great day. ^AG",
            "date": "January 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Atiya Howell",
        "comment": "Had card can't remember the daily ATM withdrawal",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRjRKcnd5VUxmNHdXVzMzdzAyU0Y1dFYzLTdMU01vZGtoSFllZ09TSUlPNEF4NmFHRmtTcWRhbTVyUzVKWmtDT0JRNXZVX0tTUVNCUk0ydVE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Atiya, Thanks for reaching out. Please contact support@moven.com and we would be happy to let you know those limits!",
            "date": "March 1, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Saly Sounthala",
        "comment": "PROS: App works as long ad you have update phone, No trouble for me..   Cons: It is not a really credit bank, you can't get a 2nd card for y ou significant other on the same acxount.  CSR is not helpful pass exoerience of course, You are not going to gain credit. They are more of a savings account business, and location for you to rake money out depend on location, if you take money out off tcf, usbank, wellsfargo or any major banks, you will get charge by the other banks and Moven. 1 out 10, I give it a 5. Just saying.",
        "date": "November 24, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRVhlU2JSSFZEbzVpWGNaX1RNeHFjaE1uNFpJVmZnbS1TamthUm8yVl9ic1VZYzA1Ul9uYi02eUlwTXdOZzdZNGZ3Ynk5ODVkWlpTNmdoMXc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Saly, thank you for taking the time to review! We appreciate your feedback. At this time, we do not offer credit. However, regarding your comment about joint accounts, we do have an option that allows you and your significant other to link accounts. We would be happy to give you more details! Please feel free to write into support@moven.com. ^AG",
            "date": "November 27, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Couldn't get the app to work at all. Customer service was quick to reply and friendly enough but you can tell that they are just sending automated responses, and after a few back and forth emails they gave up and told me my phone must not be supported (it is). It's a good thing I didn't have an account with them yet or I wouldn't be able to access it or get help to fix it! This review is less on how the app works and more on the service I received which was overall rather poor. I can't imagine having to deal with such poor service when I have real money on the line",
        "date": "December 8, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSG5pM29janJKSmdGVTlxUkc0MmhzOUVVSWFRa2ZRaUZPZlV3a1llR09WMXdpQVJmSUZDaG5ieGhBeHFMQU1JZzJaN2FlTXh4YXFFb0RwMFE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Thanks for taking the time to write in. We are sorry for the frustration you're incurring. We would like to look into this issue more. Could you please write into support@moven.com so that we can continue to troubleshoot? ^AG",
            "date": "December 8, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Anthony Pasco",
        "comment": "Without a doubt, the best prepaid debit card I have ever had! Prompt, professional,courteous service, friendly and helpful!",
        "date": "December 7, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSEdxYkNybjFBbmRWcGUtQ1psMEIxX1NaZk1yUm0yZ2xoWHZUVEp6bUI2RVA4ODZBb3JUcjBhR2VpNjUtVDlJWnloX2U4bms3SjZfRUVhU3c",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hey Anthony, thanks for the awesome review! We love helping out our customers! ^AG",
            "date": "December 8, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Dale Hammers",
        "comment": "Dude moven is great never a issue with my account. Had a little problem with the app which was probably my fault but the support team was on it and did an awesome job. The staff is just awesome people that are so nice and professional",
        "date": "September 18, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSGg2MmlXWDVoUy1nM3RMNEo2bHM3UWNMcjdLbWVmb3FxUDBrR3FpT19yRmVsUldBUHlIUE50NGd4MGMzaDJHU1VQSjlrdUw0R1RIS2RmeHc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Dale! We are so happy to hear this feedback. Thanks for the great review! ^AG",
            "date": "September 19, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Philip Mcgreevy",
        "comment": "Anthony G is one of the reasons I use Moven Great communication fast service was able to handle my issue not  once but twice very efficient at what he does.  Thank you Anthony for your help and urgency in resolving my issue i give you 10 stars out of 5   👍👍",
        "date": "November 5, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSEk2VHROYVNfRXhpTkZpSVVTRFZqNVo0UjFZM1hTYTRTR0FlYTBKdXJYZmJ3VTR3ck1DMF9sUGpRNWM0Y0prWEZBOElKMnhQYVBTN2JJcHc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Philip, Thank you for the kind words. We take pride in our customer support! We appreciate your 5 star review.\n- Moven Support Team",
            "date": "November 14, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "They ask for personal documents (bank statements, voided checks, etc) then email you and say your acct is closed. You call in, they say you'll get an email.. yet no email. I'll be contacting the bank, and BBB about this shady business and it's practices . Sent them personal documents and they stop responding.. shady, scam, identify theft?",
        "date": "October 14, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPR0FPaWhhSVBFWnFFZlFqc2ZGX1EwR2o1dlRjVy1pbnZ4X25SSHdlMy1BYXBTaWpEM3hxT1ZwUWo1UjlGNzdnN3p6dkZ6ZW9FOHBWQjNsMVE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hello, we apologize for your experience. A customer service representative has reached out to you to further explain the situation. Thanks for your patience. ^AG",
            "date": "October 16, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "It's a good card...but it only works by direct deposit..and no way to load cash on it",
        "date": "October 8, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPR2VNeDl5Z09qcTZ3eng5LUQzU0ZyWXFKUklOMmFQYndvdGdodXV4ZkJkVW50T1lDUUY2T20zdjdoeW5ubnRwWU11Z1p1bkUxaTRodzZIa0E",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Glenn, thanks for reaching out! There are multiple ways to load your card besides direct deposit. This includes cash loading. We would be happy to provide you with further details on this. Please contact support@moven.com so that we can assist you! ^AG",
            "date": "October 10, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Thomas Seward",
        "comment": "Absolutely everything, from the card delivery and the app to the customer service promptness and kindness, has been incredible.",
        "date": "October 7, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRTFfanJnVk5BSWo3RTlrU00tbk9rYlI2WGJiTVREQUtYR2ZGQXc3QTE5c1ZxazFIVmcwb3hZM2g0bVB6dXlUMDZvRzJFcjQza3lPdFRTZnc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi  Thomas, thank you so much for the kind words! We are always happy to help! ^AG",
            "date": "October 10, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Corruption Vids",
        "comment": "Pretty good app, but...they wont allow you to receive your statements monthly unless you request a paper statement...and if you want it by email, it never comes.",
        "date": "August 2, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSEd4YzVlb25FTmRTVjE2WjlOM1UyV1YzbTRNWVhHSWxRYzZFMW84QzZfUHBPMU1GRU43SDBWRFhjZzNWUXJMR3MwVVByRXE5Um4yRHhzTXc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hello - We're sorry to hear about your experience. We do offer the ability to email yourself a statement from the Moven app. If you can email support@moven.com, we'd be happy to look into your account and see why you're unable to receive those emails. Thanks for the feedback! ^EW",
            "date": "August 3, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Pamela Witherspoon",
        "comment": "I love this app been with them for two years now i love everything about it but it would be nice if they had a way to set up a automatic system to let you set up a way to save money without worry",
        "date": "August 26, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRTlYSVBUdk90QjdnTF9JMlFQR0Z0VDEtMzY3YklqSXVGY1V1djVuNldFbmdiLUJLNzdUOEVPZHE4THFsejEyOHBZckt4amdUWUswQVhvOFE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Pamela, \nThank you for the kind words! We appreciate your loyalty to Moven. Please contact support@moven.com so that we can discuss the best ways that Moven can help you save. ^AG",
            "date": "August 30, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mark Dayton",
        "comment": "Had an issue.  They fixed it. Thank you.",
        "date": "August 4, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRnB4V3ZLNU1wa25VMGZVbXktbVhXeDVaSy1pOWpfNVlFZGttck9la29IZ01pT1Y5XzhKQTNXU1RxWFVVUFkxTUxaM09FbmNub1NPakZ2Q2c",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Mark - We just had a manager reach out to you from support@moven.com. Please let us know if there is anything else we can do! ^EW",
            "date": "August 4, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Yvonne Benjamin",
        "comment": "I've been using Moven for a while now, they have the best customer service unlike traditional banks, your  money is always deposited on time with no delays and postings are usually accurate. They have a great team where they are helpful whenever you need help, I usually prefer communicating through emails and they respond very fast.",
        "date": "July 23, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSFBkS2xTM3l1Vl9rOXpVc0dmVEZRUC1qOGRIVnNvS2NZdnUwSzNzZlRhNURHeUdQcVIwQ0hqaDRDOUhYRi0zYlEybjI5TUpnVTNYX2lXdUE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Yvonne - Thanks for your kind words! We really appreciate it! ^EW",
            "date": "July 24, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Laura Jambon",
        "comment": "This is the real deal!! Definitely NOT A SCAM!!! I've been using MOVEN for a couple of years now and have NEVER BEEN SCAMMED!!! Every red cent I've ever deposited has ALWAYS BEEN THERE (ready & available when it was said to be) I use this app together with  Prism and have been able to master my finances!!! BTW......... To those implying this to be a scam, Since when is verifying identity for financial reasons a scam? If identity verification weren't  required, anyone could just open accounts in anyone's name (including yours)!!! Just saying.....  I Absolutely  Luv, Love, L♡VE MOVEN!!!!! Thanks",
        "date": "May 19, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRzVTYTlScmpEamVUbFh1OXduWE5MTWJWczUzR3VreE9tb2dNVHFuN3JEdE1CeWJfV1ZkcElvcXgxa2pkMVN5UjZuckZkeDZuSHJWNFdXWkE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Laura - Thanks for the kind words! :) ^EW",
            "date": "May 22, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Bruno Firstenberg",
        "comment": "Great customer service. When someone attempted to use my card, they worked on a refund and card replacement immediately. They're always there and always reply to any questions or concerns. While providing a fast, friendly and competent customer support. They're always updating their app as well.",
        "date": "May 25, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRWdhYlBRZHQ5bWVqdU9RQXN5WWVFRm5VRDltZllHcXZzaWd0UG9oSjJqX0xIWEpRNDhfZzY0dUdfMGtqTEY1SkhhclBwM2trUnUtSVd4bHc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Thanks Bruno! We appreciate your feedback! ^EW",
            "date": "May 25, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jess B.",
        "comment": "I am happy with my account and service so far. Have liked the app up until this latest update. I updated on 5/27/17 and the 'Stash' & 'Wishlist' sections load to just a blue screen (the same blue background as the app with nothing else). I tried force quitting and reopening - same thing. Re-downloading - same thing. Dunno if anyone else is having the same issue",
        "date": "May 27, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRjlEOEsxMHZDQVFNaXo2SnZhNDVucGhvUWE5MWt6dHBVa0poRzY0amREOXRpWC1DUnNtZFVsQkZUNVR5d3dXQzhUVzltNWhjTTQwNkJqdlE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Jess - Thanks for the feedback. Can you please reach out to support@moven.com with your phone model and operating device? We'd be more than happy to help! ^ EW",
            "date": "May 30, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Sweetheart",
        "comment": "Moven continues to impress me with their impecable customer service...they take pride in hiring great staff members...there is nothing they won't help you with when it comes to your account!",
        "date": "May 17, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRTVrRGxjdUcxa3JqUWQwNFdHNU1GUG1JN1VnOGtJa3JPUnBFemxDLXl4aEJTNFZ3STFwY2pkOENrdXppRmVJcnhwWFZtQ09sd1d1RXo4amc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Rhonda - Thanks for the 5 star review! Glad you're enjoying Moven. - Moven Support Team",
            "date": "July 19, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Patrick Roscher",
        "comment": "I don't know about this yet ,I'm waiting on approval to open an account",
        "date": "May 16, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPR01fUEdCejktb3JjRzBYbk9Fb0MxZGlBRW5qZDJ1dlhsQ0xwWm9kTWNaNm0wZG9rQ3RQMFg5bGtkc05lV2VOMUpvS2xidjNGME5xdE1FbFE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Patrick - Feel free to reach out to our support team by emailing support@moven.com, and they can provide you with more info on the status of your application. Have a great day! ^EW",
            "date": "May 17, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Great customer service. Very helpful and very prompt responses via email. I suggest using if you can't seem to get a real bank.",
        "date": "June 25, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSDlUMWJWdVdja2dkZGhQalRqUnRUV3o5N2pVRG9WZV95UmJ4WVc1dWdjdlhIQ1BLaUpyNllFVzNNeTdtVVgtcWozRVd0WmxvUHdKWG1OQlE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Thanks for the kind words! Happy that you're using Moven :)",
            "date": "August 18, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "cory sabia",
        "comment": "Love using moven just sucks every time I get a alert app crashes",
        "date": "May 4, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRndET1phdXVUV094Rm5aWm9FOFlNNTI2SFpvVzhrbFlzMkhrV3RXMjBIMDZDaEwyZ0NCckQwTTBZX1p4WC1ZYXhtVGUyYktnOHBwOERfb0E",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Cory - Thank you for letting us know. We have passed along your feedback to our Tech Team.",
            "date": "May 4, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Marie willams",
        "comment": "Keeps you alert  and it is easy to see where you spend too much or to less of money",
        "date": "May 19, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRlBkRHQ4RkNIYW1nMXk4X1FVRDVVUW13VjVxeE1DamVyQnhpNThpcHU4S0NIbzM0OUhQZlVHV2tjTmI3MkVGTGdxUTl4Vm9TTlZGNUhUaGc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Thanks Marie! Happy to hear that you're enjoying Moven! ^EW",
            "date": "May 22, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Lance L",
        "comment": "Great app and great service!",
        "date": "May 1, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPR3RYeGVNMm9KWG1oMEd6MFl6SlNlYy1pWjU3UTFTSzVpTTdaOTFKM1FCQTNZRS04N0pDY0NhMTNsUThYeTVISTU2V3NtVF96enlDT0VOYVE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Thanks Lance!",
            "date": "May 1, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Malissa B",
        "comment": "Finally had someone (Emma W.) contact me to get the issue I had resolved. Hopefully I won't have to deal with anything like that again! I like the recent update, which allows me to save money using Stash. Customer service could improve but other than that, everything is okay.",
        "date": "March 31, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPR0tIY1VJMFJ6RW95RkRtS01WejdpSnB2YU9mNm9aWWc3UDEyRkIyWGw5RHV3QlJVSUhQRnI2YUhmUm1QM1JmMG54V1V2eG15ajEtQktzcnc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Malissa,\n\nWe've had one of our managers reach out to you through support@moven.com. We're sorry to hear about your experience, and your feedback will not be taken lightly. \n\nThank you,\nMoven Support Team",
            "date": "March 27, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Priscilla Kirkland",
        "comment": "I've been using Moven for almost a year now and I have not had any problems. I love how I get alerts of my spending, evertime my card is used. I have direct deposit and get my money with no problem at all.  I love it.. Keep up the good work Moven Team...",
        "date": "April 1, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRWFJbFdtaGxFX1Z4bGpGeHo1YVBnenV5OUpjNDdsZW1IN1owdXVrVlA1aUs0eW55Y0gtU1hGRlFHeEg2Tkh2UklHQ19QTUo3WlBhVmxJTlE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Priscilla, Thanks for the kind words and your review. We're happy to hear that you're enjoying using the Moven app :)\n- The Moven Team",
            "date": "April 6, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Biency Natividad",
        "comment": "I love this app very useful and very accommodating staff . Fast and reliable",
        "date": "April 12, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRzF1OEUtZ3lDVkcwTTJOeUxXYXVwT05DRVNqbVkxN2ExV083YmYxUF9zaVZfUUxkVkxfQ0s0alpJUkZsWk15MHBub0YzQVhSamVJV1BQTnc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Biency,\nThanks for the kind words and your review :-)\n- The Moven Team",
            "date": "April 27, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Anna Greenawalt",
        "comment": "Great customer service!",
        "date": "April 26, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSHFGTzFGS3FyVzRSR3ozMEtVTUxyMExfcm1HNTdSa29QVHNGb1RSUUdQMFJFX0ZHSlIzUS15ZzVWZEJoTFpMR3lsTjFrc2ZucklnWUhDX0E",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Thanks for your review! We'll make sure to pass this along to our customer service department.",
            "date": "April 27, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "James Martinez",
        "comment": "Decent app",
        "date": "May 16, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRzRZYlN0TkZ4cmxfYXBnakdnMnp3RmJINExkam5jWUZXTGkzamNRdkl3X1dLdVhwa21hci0ybkdmVG4xcC1GZFVYSG9lalpQMzd0Z0o3V0E",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi James - Thanks for the review :) ^EW",
            "date": "May 22, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Robert Lassiter",
        "comment": "I was bullish on MOVEN,and started using the app on a limited basis instead of GOBANK,which I had a bad experience with.All seemed fine until someone stole my MOVEN Debit card back on Valentine's Day... I couldn't order a new one because my phone was tied to the app, I had everything stolen,and I STILL HAVEN'T RECEIVED THE*******card.They screwed up on the replacement order,I had to call and call to finally discover it is supposedly on its way ( still nothing).They screwed up but didn't make right on it by overnighting a Replacement,here I sit,still waiting..I am extremely, extremely disappointed.  REVISED REVIEW: A MOVEN Manager contacted me ( Emma) who is conscientious..I remember her from originally setting up my account.She activated my MOVEN Paypass so I could at least use it at Starbucks or a location that accepts the swipe technology.Thanks for making it right,and it goes to show you that Management that cares and is hands on can make a difference..  ***NOTE*** I DID REVISE MY REVIEW BACK UPWARDS,I APPRECIATE THE FOLLOW UP,I DID FINALLY RECEIVE MY REPLACEMENT ATM DEBIT CARD.",
        "date": "March 29, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPR0RrZ1ZuZ3RTdUdIMkg5ZEQxQk8zdGRXelFPTUN1emJycGtOLXRmT2lrUlZjaENZMVliY3RtOWNRbWVBbzBaM0lyY2dweE9lNVBKVGtsWUE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Robert,\n\nI'm sorry to hear about your experience. We do use USPS for our mailing and the timeline for the delivery can definitely vary. I'll have a manager from our Support Team reach out to you through email.\n\n- the Moven Team",
            "date": "March 28, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Alanna French-Ross",
        "comment": "I love the app. When I had an issue it was handled quickly and efficiently.  I could also suspend my card from the app when I forgot it in a store.   The app shows all transactions immediately. That is something I appreciate greatly.  Helps me keep track of my spending habits. I also linked another card to it and it kept track of that one also.  That is a great feature.  When I needed a print out I printed it from my phone using my Wi-Fi printer.  Haven't had the problems with customer service as some others spoke of in their review.  My experience was a good one.",
        "date": "March 25, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPSDc2WDkzNmxIUDZhUUtIYzVla2JyN1pHTS1xd3dwN3NDbmpZNUpfaDQxUFBRTEdOZ0NvbmctWWk4TjlTdi1WY3VQYTV2cHAwaWRYa2dZRUE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Alanna, Thanks for the kind words and your review. We're happy to hear that you're enjoying using the Moven app :)\n- The Moven Team",
            "date": "March 27, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Mark Mercer",
        "comment": "The app is useful to monitor multiple accounts/transactions but the banking piece is something less than useful. I do not recommend you use your Moven account as your primary checking because if/when there is an issue the support system is ineffective and your money is held up until you wade through the myriad of \"run arounds\" and \"delays\". Absolutely the worst banking experience next to Bank of America.",
        "date": "February 26, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRXUzNW9hNjhicm0yR1NGcTlWN2EzNGZwem1LX3g4TktsLXVFQzZta3BQTHRHU25vMWkzX2tVMS1XdlRaTU1PS2dlT3dTejVQWXRzYUNFSmc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Mark, \nThank you for taking the time to share your thoughts. We'll pass along your feedback to our product and support teams.\n- The Moven Team",
            "date": "March 2, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Sean Muldoon",
        "comment": "For a online bank, my experience has been above average.   Customer service is top notch, fast and honestly is better than most other banks customer service.  Direct deposit times are a little later in the morning, 11 AM, but it is reasonable.  Even to my surprise the fraud system caught 'suspicious' activity, I appreciated it.  I will without a doubt increase my banking with Moven as I see no real need of having a brick and mortar bank in this digital age.  Thanks Moven Team!  Sean Muldoon",
        "date": "April 4, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPR2F0TzZXWkM4dzc0b1ZhNi13WUw0Z05YbVh5aTY0XzduNEszVDJ1cHFMOHU2T2p1MjM4OG9qWTFHcWNZczZiNnJ2Y1NuTkVCVG9vUDJsTGc",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Thanks for the kind words and your review :-)\n- The Moven Team",
            "date": "April 6, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Michael Cruz",
        "comment": "Revised *** I was happy to see all the alternative options to common banking. Research led me to two possible choices. Simple vs Moven. I chose the underdog. The team with the lesser rating. I chose Moven. I felt and said to myself, “I could have a better customer service experience with Moven. They reply to comments!” How great was that. I was wrong. A mere hello with the absence of solutions.  From escalation to escalation, takes too long for moven to admit fault, and do what needs to be done.   A transaction was declined, yet had been \"pending\" for three days.",
        "date": "April 7, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRzdqZFg3QkRUQy1QdnlHS01jX2h6WDBxdUtHYmRsbDltRVF6LUF6cUhNZ0ZkSTNKZW9IUWhJU1FxSzZEMmM1cm9zem9rY2VsenNFUzk1SUE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Michael, \n\nThank you for the feedback. We have passed along your note to our Support Team and will work with them to ensure your case is handled in the best way possible.\n\nEdit: We have re-reviewed the pending transaction. We will follow up with you through support@moven.com.\n\n- the Moven team",
            "date": "April 7, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Tim nukala",
        "comment": "Just another prepaid card   I really thought that this was going to be good. Rather than go into a big time consuming review. Had a major  online retailer got my account 3 times back to back . Move paid it ,I disputed nothing ,also why can't I get  transaction statement ?well you can after contacting customer support and DAYS later they respond .oh when they did and i asked for a cust serv number  i got some random Six digit number. Cant really show your phone to the irs or the bank when you need to show income etcif your looking for customer service this isn't it .REALLY !Moven?",
        "date": "February 3, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRnBEV1JPWS1ZNW4xME1aMjB1YTdfcXZSUnREVXQwTTNic2psRmJ3RHJOYy1lOHp0bEV5ZThPUUpJVXFrTTJ3NS1yWEJwaDdGUFdhS1BKVXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "nishiki",
        "comment": "Amazing app, amazing bank, and terrific, fast and personal customer service.  I emphasize that last point! As well, this company is a tech leader in the banking space and as such, not only do they have a great mobile app, but their debit card is enabled for Apple Pay and Android Pay, which is awesome! Thank you team Moven for all your effort and hard work and focusing squarely on the customer! It shows and is much appreciated!",
        "date": "March 27, 2017",
        "permlink": "/store/apps/details?id=com.movencorp.moven&reviewId=Z3A6QU9xcFRPRUNPQUgzTGdjZmMya3IwMlpub0dYdklTNjNiMXJqcmlsYWttbWwyTFUzWTBYVU91N2Vscy05WTgwWU80ZlBDTWFCX21ReDFyeE9OSG9pTEE",
        "reply": {
            "author": "Movencorp Inc.",
            "content": "Hi Alan,\n\nThank you for the kind words. We greatly value our customers, and they are our number 1 priority. If you ever have any questions, we're just a quick call (1-844-810-8100) or reply away (support@moven.com).\n\n- The Moven Team",
            "date": "May 8, 2017"
        },
        "star": 5,
        "title": null
    }
]