[
    {
        "author": "Peter Wexler",
        "comment": "So far, I am using this application to inform me of e-mail updates by way of my new Motorola smartwatch. This software definitely makes the watch and my smartphone very interoperable.  Two thumbs up from me! Many thanks for a very nice piece of software!",
        "date": "January 27, 2017",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRWhTY2R0R0xEVnB6NVpTaFlLVnR5OUtEcW1OZWxacENYYy15b3RIYUU5Tmp0UDl6Y1cwbHdKQ056d0Q3RXpGMkp3WUhJNF9Pb05lbGdYV2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "DaterHill Project",
        "comment": "Based on the reviews and honestly how active the developer (s)  are. I decided to give this a shot. Keep up the great work!",
        "date": "November 23, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRVJuMTN2LWNPbFhmV1MyM1g0bXhOakQ0RlZSbmNDM2dfN2JMUjRqNkYtU3VPaUYwRENISG9jdG9sdDFZZFhTTE1TUWlDeFdYQ2JrUnJyWkE",
        "reply": null,
        "star": 5,
        "title": "Based on reviews..."
    },
    {
        "author": "Mike G",
        "comment": "Tried app after app, looking for one that would delete my hotmail emails and still display on my watch.  This app is the solution. Had issues with it at first, but the developer was extremely responsive and took care of my trouble quickly.  If you are looking for a similar solution, give this a try and if you have issues, contact the developer.  This one actually cares about their app.",
        "date": "November 20, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSDFxbkRFUjc1d1NwOUVoaTJOd3o4MTdTMGVKWGxNLXowYnpjQ09zSHZQc1J2anJ1WWdPQndyd3dvLVk5YkpSM2V2aUctU2p1d1BIQUR5QUE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Cheers Mike. For an app like WearMail, reliability is essential. But some re-work has been required recently to keep the app functioning on the newest versions of Android Thanks for your detailed report. Regards, Glen",
            "date": "November 21, 2016"
        },
        "star": 5,
        "title": "Great app and developer!"
    },
    {
        "author": "Paul Cluett",
        "comment": "There doesn't seem to be a way of checking if it works or how to fix it. The switch off/ on notifications for phone or watch buttons are a little illogical: off for one, on for the other",
        "date": "November 23, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSG1DVE93b002bW5kLW9hd0RxMDViTHY1dDRBTWdaMVpZQlliS0hpdi1sZXEyTUNlRDJ0bEc0bHZ5QjAtMGZ6dXVQVzU2aHJTOGFsaF9obVE",
        "reply": null,
        "star": 3,
        "title": "Comms to the Watch seems to fail"
    },
    {
        "author": "craig freeman",
        "comment": "I have Been looking for a app that can delete my Hotmail emails on my watch and this works grate",
        "date": "November 20, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSEl5d2hCY21PeG42TjcwTlQxNGhHYWkyS0d6ZWhoVGhJcUR3SEtKcHAtMjVhZmg2Nkh3dm5hd2FwSndNaFJySmJMS1I1RERjS1JTYXlsWWc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Craig. FYI: For anybody setting up a Hotmail account, it is important to use the full email address as the user name. Regards, Glen",
            "date": "November 21, 2016"
        },
        "star": 4,
        "title": "Works"
    },
    {
        "author": "George Fong",
        "comment": "Brilliant app and brilliant support. Within minutes of contacting the developer about a bug with an Android update, he was onto it and was fixed  quickly. Essential app!",
        "date": "November 19, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSFY1S1JFTUV1eTdCUVlDWjEyVEFfZGdlM2hpRFMzNlNVTC0xTFJTdW5sZGZYNE5qSXhQcU40eEo4U2IwZjNIclVPTzdDU0YtX3JJNXotUGc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi George. Thanks. I'm always grateful when people take the time to report an issue to the support address. Regards, Glen",
            "date": "November 20, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tom Kannemann",
        "comment": "I have a Moto 360 and after some initial install issues which the developer quickly responded to it has worked flawlessly.",
        "date": "August 3, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRXZtUm5pOUVqSTdKeTJBRTZNcVFXa0YzT0pPWTZXYm9ZN3RLclU3aXRNX2FSVXJ6MGFFcGs0NEVJa0c2UWxVa0d0OWVvTmJSeDNZNUZIYmc",
        "reply": null,
        "star": 5,
        "title": "Best mail app for Android Wear"
    },
    {
        "author": "Douglas McLaren",
        "comment": "Works great for me on lg urbane 2nd edition...fabulous to be able to read whole emails and respond, right from watch...as Android wear should be able to out of the box, but strangely doesn't.",
        "date": "August 11, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRlRsdC1SZk9sRVo5bkpwUUxEalgtZnBNRkZRT0w5VS1BQWlNckh2V0I1VnJIX2IzNkJuaThsbG9QVUVjeUFuRkVOaUs2X25LWk96b1g1aWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Hetal Patel",
        "comment": "The app worked great, but seems like updating to Nougat 7.1 on my Nexus6P has broken it.  No more notifications.  Can this be looked into?",
        "date": "October 24, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSDExUkNCTmRfR0RVQWRPTnVaaVBrZ2lBV1AyeVd1d21nNVdpUHpJaHN1SnBsRkVYc0RtTVktRVBHOERTVVBhNnVvU0Z3OWFrejNQaHZJTVE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Hetal. Sorry about that. There is a new version rolling out 2.9 that is built on the Nougat 7.1 SDK using the newest build tools 25.0.0 and all the wear support libraries have been updated as well. I'm at support@maxlabmobile.com if you need the apk. Regards, Glen",
            "date": "November 9, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Dean Hammond",
        "comment": "And a little bit more. .. few bits not working notifications vibrate adjustment would be by what account sorted issues and now all good",
        "date": "July 26, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR1pSU19qYTBpLXhCeU9BRzR1UFhiTHREX1I0UzNSaEVOYlQzbXM4YkZSMm9FeDlLejlRejk4bFZCd1puWE4tVTNTeE9KbjY4MDVJaWdYRUE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Dean. App version 2.5 should give you full control over vibrations including the ability to create your own arbitrarily complex vibration patterns. I'm at support@maxlabmobile.com if you need anything. Regards, Glen",
            "date": "July 26, 2016"
        },
        "star": 5,
        "title": "On the tin"
    },
    {
        "author": "Alexandre PAGE-RELO",
        "comment": "The app is plain awesome. should be standard Android wear mail behavior. BUT and it's a big one: (if I'm missing a setting correct me) the vibrating on each email on watch and phone is annoying as hell and no need for the notification on the phone at all. 5 star app, 1 star for notifications... bottom line 3!",
        "date": "July 1, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRldsV1hQWmZuMEtveW9Xa01oU2RnSjgxQWljSWk5NWIyY0pqdU1pRTdldGU0OGNwdDdYdTNTbzl4ZkI1MWVmTFlKSU5iODN3dGp3ZUJyd2c",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Alexandre. Thanks. The vibration behaviour that you describe is standard notification framework behaviour as designed by Google. However, in the latest version of the app, 2.8, separate vibration patterns can be specified for the phone and watch including an option of 'None'. I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 3,
        "title": "Would be awesome without the vibration"
    },
    {
        "author": "Jay Leber",
        "comment": "Crashes on any Android wear setting as soon as you select, can't set Reply only Quick Reply.  Useless for notifications with options, but can speak subject and sender on phone!  Excellent if this were the only feature it had.",
        "date": "January 11, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRkt2Vl9fR1FmRl9Gb3VOVW1teEszTEdwSi10VVJvYU1MLUNUem5ockV5MTQ4U1ZTRmlqUTRNU2hYd0ZjWmVMb0NPb3JDWVV6VlpBU1dCLWc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Jay. I've fixed the crash that you mention. What options would you find useful? I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "July 26, 2016"
        },
        "star": 3,
        "title": "Useless for notification options, great for speaking notification"
    },
    {
        "author": "Yvette Stewart",
        "comment": "Icon doesn't show up on app watch list so I can never go back to an email once I've swiped it away. Also I didn't see a vibration only notification, so I have to hear a loud beep every time I get an email. If the notification sound is not turned on, I never know if I have emails because no notification alerts me unless there is sound. Not even an icon popping up on the watch face.  The display of the email is good when I can see it. Lastly why doesn't it sync with phone so I can delete the email completely.",
        "date": "May 22, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR0dHeWVfOGtvSTFFT2tndmRnbG5IdVdfYUVxNkxBS0ZLS05YRUlXRms1b3ZYSmdsUUVjcTRjc09PdzkyZTZwYzg0RnlWUFRhTUNhSWFkd2c",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Yvette. No icon. WearMail is a custom plugin inside standard Android notifications. In app ver 2.8, separate vibrations can now be set for the watch and phone including 'None'. Also, the notification sound can be set to 'None'.  WM deletes email on the server. It cannot delete data from 3rd party apps: support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 3,
        "title": "Where is the icon?"
    },
    {
        "author": "Phil M",
        "comment": "Works really well when this isn't switched on for your account, but won't verify or login at all when it is. Such a shame as that's becoming standard security advice to turn it on. Until that is implemented or fixed then I will unfortunately be uninstalling.",
        "date": "April 6, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSHdhR01OVUtreVVYdFdiUHJBODUtZXlxWWNHM1Z6amxVSWp5dS0tX2lXZWVLT0xLQUk2X3diVmRLVno4SjFYSUF0UWVucVMxdV8xbVByV3c",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Phil. I used 2-step auth with my account. Tip: Do not enter the spaces shown in the 16 char app specific password. 2-step is no longer necessary, password-less auth using OAuth2 has been added to 2.8. It is no longer necessary to change your GMail security settings if the account is managed by the device. support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 3,
        "title": "2-step authentication?"
    },
    {
        "author": "Evan Berry",
        "comment": "I like this app because it is a standalone app that connects to your email server and relays to your watch. You don't have to change your primary email app on your phone, but this app gives you full read and reply options. The downside is you cannot disable notifications on the phone without also disabling them on the watch. This is a huge drawback since I don't want dual notification of emails on my phone. Please fix!",
        "date": "April 12, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR3RqZFlkNFhTS2dhLTRYM0ZoTXlvallYVWU3UjdTUWtTTEk3d0NCSTNpOFZ4aVozV2xTejJKY0wxbmJWOGk0aGZKYUw1aUo2dm9IenNKbVE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Evan. Yes I agree. That's forced behaviour from the Google framework. The designers decided to have a mandatory summary notifice on the phone as a requisite for stacked notifices on the watch. in app version 2.8, I've re-written the standard framework to allow watch only notices. support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 3,
        "title": "Would be great IF you could disable the notification on the phone but not the watch."
    },
    {
        "author": "Jay Bee",
        "comment": "Is actually lets you look at multiple emails instead of one at a time like the stock program that comes with Google wear. I really wish they had text messenger because the Google wear text messenger is not as efficient once more than one text comes in. I just had to uninstall this app not because it doesn't work but because of its battery drain but it still is the best there is at what it does",
        "date": "March 28, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRUdaclJseXdySDZGdkFQSmJsVXhZaFNNcGVoLTFKTXpTSHh0MmlQV1loQThsQlZwZUsyZHhZQXJXM1pDR2FJYlNSRVZjclVPQ1JsNGRPSmc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Jay. Thanks. As it happens, I do have an app that does stacked text notifications with commands. But I don't intend to add this to WearMail. I'm at support@maxlabmobile.com if you want to discuss. Regards, Glen",
            "date": "December 20, 2015"
        },
        "star": 5,
        "title": "Better than  Google cards"
    },
    {
        "author": "S Lovely",
        "comment": "It was working earlier but since I upgraded my phone it do not notify me of emails. I have reinstalled it 3, but still doesn't work. Smh, was a lovely app but now it do not show, send, nor notify the emails on my smart watch. Been crashing also",
        "date": "January 26, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR3hxQVpOYnFVZnZic2xfcWs3X3lvcEpmRWFuWTAwR1BpcWtKNWZfWktnMmJaNmhscG9sdkJPZTFhSWlma2puYzZoWWYxdTh4ZmFUYmNwN2c",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi S Lovely, please press the 'report' button if you get a crash. When upgrading phones, you have to do a factory reset on the watch due to a defect in Android Wear. Failing that, clear the cache on the Android Wear app. Un-installing WearMail accomplishes nothing because it is Android Wear's job to deliver the notification. Regards, Glen",
            "date": "March 22, 2016"
        },
        "star": 2,
        "title": "Disappointed"
    },
    {
        "author": "Tonya Weigand",
        "comment": "This use to work fine I have Moto 360 and and Samsung Galaxy S6 and was able to read my full emails but now I do not get anything on my phone what a big disappointment  disappointment.",
        "date": "March 17, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSGgtRXpmcy1MU2dtNERxM2dDdkltOHk0d1V2UHgtaTl4Ynk3QTVpSDY0NW5pd3NIbVEwWXFETG1JSlZYby0tT21UOWJzTzNXNktNRk55c0E",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Tonya. Do a factory reset on your watch. Due to a common Android Wear caching defect, app notifications get blocked when switching to a new phone. I've run into the same issue and the reset does fix it. Also, you might try app version 2.8, since it uses less of the standard android notification framework. support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 1,
        "title": "Use to work"
    },
    {
        "author": "Jeremy Ripley",
        "comment": "Even if I have \"vibrate when silent\" set to off, it still makes my phone vibrate.   Having my phone vibrate every time i get an email would drive me crazy.    It's too bad, one flaw that ruins an otherwise useful app",
        "date": "July 18, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSDZaN0ZjYUdfa1BtUkFDR3JHZHMyYzdzQ3lNMDc1ZldNTW5mTGlJejhqT3gxUURTbFpNMHZLeFd2dHJwc1NDUVJjeHd5MzZzY3lQWURKNFE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Jeremy. Vibrations have been fixed in version 2.8. The new version supports: 1. Separate vibrations for the phone and watch 2. The ability to disable vibrations 3. The ability to create your own vibration patterns. I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 2,
        "title": "So close"
    },
    {
        "author": "Daya Here",
        "comment": "Does what it says. Only wish I could access/see my emails after the notification is gone...",
        "date": "March 31, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSFdQc2UwS2hxR3A1SWdJTlVOcDN6MGlveGJiMlNjd25SQXkzak44bjRLVTdKUnF0TmpVa1ZubDJkOW1iWjNSV3NqT2xyOV9QcWVfYV9HbXc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Daya. Thanks. The WearMail concept is aimed towards power notifications though a full email app is useful of course. In version 2.5 , I've added the ability to do non-stacked notifications. So you can get a separate notice for each email now if you wish. I'm at support@maxlabmobile.com if you need anything. Regards, Glen",
            "date": "July 26, 2016"
        },
        "star": 4,
        "title": "Works well"
    },
    {
        "author": "Jim T",
        "comment": "Can't connect to my Gmail account... Pointless.",
        "date": "February 19, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRWhNUlhnVHZMVHRXRzdMUVR5cUVmNGlyZFBrYlNwUlhZMGk4SEJpRU1VajZJVWhuNWd6RDhfN1dsT2ptdHlpSU9IS21wRjZpVTJRTFJOY0E",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Jim, I've implemented password-less authentication for GMail in app version 2.8. As long as your account is managed by the Android device, it is no longer necessary to enter a password or change your GMail settings. I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 1,
        "title": "No use to me at all"
    },
    {
        "author": "Maria Rosero",
        "comment": "I will give it a five if the emails would come constantly as soon as I get them and will not disconnect",
        "date": "June 1, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRWR5cmVySHFNWGxzUGV5M3hGMGVJeTl5YkI3WFFrNVRveVhxNVBVR1BndHhTTEZwNkYwR2ZnLURvaG5RUTRRUzRqZmU3OWNWUEVrX2FtRGc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Maria. In Android 6 Google has added battery saving features that work by turning the network OFF and disabling software. When the phone is not being moved, it is safest to leave it charging to ensure uninterrupted coverage. In app version, 2.8, new directives have been added to ensure that mail is sync'd as often as possible. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Harold Miller",
        "comment": "Pretty solid, well supported and extremely configurable. All Wear developers could learn from this lad!",
        "date": "April 11, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRXpQVjRsY1VOejFaOHF0aF93T0loWndld3h0eE5wejZheUtnYTBUc01JRlNLLV82bFF4MzVZQmR4WmROZ0xkV2pPTVlwTGc1SF9rMHQ5Rmc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Cheers Harold. Please let me know what you think about the new version: 2.8. I've tried to address the majority of the issues that folks have raised. support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 5,
        "title": "Well supported app"
    },
    {
        "author": "Steven Koch",
        "comment": "Exactly what I needed especially the quick reply options, developer is extremely responsive.",
        "date": "January 28, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR3dGa2R5NjF2RW1uM0EzV2cydDQ5dG9peG5DVlQ3S2tNTzN4TDQ2bDBLNG5vOC1SR3FsT2pKNWJPX2R6dElCeUV4ZWY3cmU3ZW5IejZSQWc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Steven!",
            "date": "July 27, 2016"
        },
        "star": 4,
        "title": "Great App"
    },
    {
        "author": "Len Cook",
        "comment": "Does all I want it to",
        "date": "February 1, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR2FSRWdkYjdqV3ZUYWdHQnI4YkFBTE9KNmRPMDA5czQ2V1l1b1ZEemFiQ1gzZHFsdlQtaGx1SjJXUU1LRlBHSHdmZjkyMHBPb0R3MDNNUnc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Dad. I'm not sure that you're allowed to leave reviews, but I appreciate the sentiment. Now we just need to get mum a smartwatch. I'd recommend the iWatch gold! :) Cheers, your loving son",
            "date": "March 22, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "rudy martin",
        "comment": "All my emails in watch thanks",
        "date": "February 23, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSC1LSWVmUlZTbkxGdTlpOXNRQlQwR3p0UjRJVERPNmY3ZmlWTkNJemw0eWQ2TWFpT0dQYVBkMkJEcWdGWFBOSFhrTTN4SWUtTVlvcXZjY0E",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Rudy. Thanks for supporting free software and being one of the good guys that gives something back! I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "March 22, 2016"
        },
        "star": 5,
        "title": "Nice"
    },
    {
        "author": "Darrell Christie",
        "comment": "Very useful app easy to set up too",
        "date": "April 1, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR3ZpLTZCQlhqMmFFZGZSSTJKSTVhUTFJMy16c2g2M2NYcDdZOXpqSW5hYkVSaldSc0ZWYlBORkppM1ZOSTJ6U2lyUVkxdTBjM0FTTGx4S0E",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Darrel. I'm at support@maxlabmobile.com if you need anything. Cheers, Glen",
            "date": "July 27, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Dora Bowens",
        "comment": "Easy to use, very convenient",
        "date": "April 18, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRk5CdE9yQ1VCRTMxNEpwM196dVRtY2tFRzhaNkpSRGdLRml5WnpPakZHTk01RG9Wb0RkemQyRG9ZX2laWTJLeHBKajR3MGtwUklkSWZaZWc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Dora. I've tried to improve the ease of use further in app version 2.8. Account creation wizard, Password-less authentication for GMail, More attractive less cluttered UI, Better syncing of notifications between phone and watch. I'm at support@maxlamobile.com if you need anything. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 4,
        "title": "Good, easy to use app"
    },
    {
        "author": "Marcus Jess",
        "comment": "Decent app but could be better",
        "date": "January 27, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSC1ENWptb0dNc2ZCYUNtNUN4NFcyWkNmWkRsLTVkaFVCbk13eXNHZGdNbGlaR2d1cThROEhoMVpLUXlmSGFlaXpwd21lbE1lNktDOVdxbkE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Marcus. Please try app version 2.8. I've tried to address most of the outstanding feedback in that version: Watch only notices, Ease of use, Vibration options, More notification options, Better syncing of notices between phone and watch. I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 3,
        "title": "Decent"
    },
    {
        "author": "Conrado Dy-Liacco",
        "comment": "Great app!",
        "date": "March 13, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR3YyRUs0RXpvVEl1TFdIVDl5THBIQ0FOVUhfV2x0Zm93cDJhRzBGR2pwNzBKMUFzbGNESkZEN3I1ak5SaXZxcG8yVG14UDBpRVdNXzdsRnc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Conrado for supporting free software. I really appreciate it. I'm at support@maxlabmobile.com if you ever need anything. Regards, Glen",
            "date": "March 22, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Yvette Beck",
        "comment": "Love it!",
        "date": "January 27, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR0VBWlkta1k1QlNVb0lOejk2ejJaSVhIQVd3NEo0ejNpbXdJSW00Zng3TE44VThhMHRyeXplS3pTeUFJSEhHOS1JWTN4MmQtLW55cEl0bVE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Cheers Yvette",
            "date": "July 27, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jacob Bondt",
        "comment": "Piece of junk ,will not pair with my gmail,says it is invaild email and password. Have used this email for yrs with no trouble my phone is nexus 5 with Marshmallow 6.",
        "date": "January 4, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSDdQdUhFNk81bVNUdVNuUXN2ckZydEIyX1Qzd3VPZm1ISGRyZml2WmsxV0Q1dHJWajRkZFNiS01VbkVrOEY5S2prZURZLXFabGVJR20tYUE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Jacob, I've implemented password-less authentication for GMail in app version 2.8. As long as your account is managed by the Android device, it is no longer necessary to enter a password or change your GMail settings. I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 1,
        "title": "Sony sw 3"
    },
    {
        "author": "Benjamin Buzzard",
        "comment": "Does everything I wanted and more, this app allows you to pick from actions to quickly perform on your watch, read, reply, delete and much more from your wrist. Note though that this is not a full fledged email client, it's more of a email notifier that allows for quick response, and such. It does few things, but it does few things amazingly! (LG Watch Urbane)",
        "date": "December 29, 2015",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPSGpvZ3QzdVdZQkU2Z1k4cVZaVk8wX2VwdEFYanEwMmN3ejZqYkdMNml1bEdEYTRMZFV4WkNxYzhBZ0RmRDlTMGhvYkE1Z1ZiLVlNNFdBRnc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Benjamin. I'm at support@maxlabmobile.com if you need anything. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 4,
        "title": "Works like a charm."
    },
    {
        "author": "Rob Rainey",
        "comment": "I have the app in Silent mode and turned off Vibrate when in Silent, but my phone still vibrates every time I have new email messages.",
        "date": "January 2, 2016",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRjREVHFfR2ZHRVJyV0VtMThfTUNFUjBlNmllcUpyZG1rX2x4Z1VZV2dYYVppTkJsblpnTzZXMEhRTm5iUXdWLVNPVWFVZWxYX2RiOFVZekE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Rob. This should be fixed in app version 2.8. If you're experiencing any issues, please contact me: support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 3,
        "title": "Vibration setting doesn't seem to work"
    },
    {
        "author": "Trevor Whiteway",
        "comment": "Seems to do job. Only had watch for a week so still trying it out.",
        "date": "December 22, 2015",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR0Q2QlU2cUllaW1ZdUhmd3dMSDFEUDhqdlVHVjc2anM4c0J3ZTYzdkluRFotblMwV21hZUdRRGRVME1GRXhsWk5Ub3RRb042clZtZ2s4MkE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Trevor. I'm at support@maxlabmobile.com if you need anything. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 4,
        "title": "Wear Mail"
    },
    {
        "author": "Matthew Stroh",
        "comment": "A great little app that customises email  notifications on both Z3 and LG R watch, and works with any email app. It means that 'delete/archive' is an option for all email apps on both the phone and watch notification, which is what I wanted so can clear sales etc email on receipt.  You need to set up all email accounts on the app, but there's great support via email if any problems (I got a reply and solution very promptly). Really impressed with this one, so it's very easy to recommend",
        "date": "July 4, 2015",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRmxTOWFnZlhBVGJCNVRGamFwNVVTMFFmWlZqWkFsV0pWTmlLczNoZ3A4dEktbHo1cWNOcHcwa0FQb0RoWWVHdHlTX3hXb1FJY0U0X0ZoUHc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Matthew. I appreciate that. I'm happy to help any time. Cheers, Glen",
            "date": "December 20, 2015"
        },
        "star": 5,
        "title": "Working great and very useful"
    },
    {
        "author": "Jack Miller",
        "comment": "Great app, allows me to configure work  email (IMAP) and view them on my moto 360. Default android mail only shows summary of mail on watch. Only two issues i see (or maybe just haven't figured out yet) are 1) it won't let me turn off notifications to my phone and 2) it marks my emails as read wick means when i go into my thunderbird client on laptop i can't tell what is new.  This is regardless of whether i actually viewed them on watch or not.  Fix those 2 things and we've got a 5 star app!",
        "date": "September 9, 2015",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR3F2cVVLS05mdHU1UkZaMzc1REhvNFB6VTNZRU1aQU1KVnNaWVRIUnZ6UDJWMXpoMVg4OWVLNHBiRThLQUFWbkdvOGVYWG9wVjJtcTdsaEE",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Jack. 1: Watch only notifications are now possible in app version 2.8, 2: Your IMAP server has the unfortunate (and incorrect) behaviour of setting the SEEN flag whenever a message is retrieved by an automaton. In version 2.8, WearMail sets the PEEK flag to prevent this from happening. I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 4,
        "title": "Very nice, almost 5 star"
    },
    {
        "author": "Rick Mac Gillis",
        "comment": "I use this app for the same reason that others do; to receive email notifications on my smartwatch. I don't want my phone to get polluted with additional notifications along with the ones my mail app provides. Unfortunately I cannot turn them off individually.",
        "date": "July 19, 2015",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPR0E0UHZmNENOZUV5RzlsNkh2UTQ3d1RpR3RHdUU4QkpSeldHU0ZRSUd6NUVQOXpKR2NlNFQtbk9mQXhmTHRITlprZU5IOE5waEpnUml4Znc",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Hi Rick. 1: In version 2.8, it is possible to do watch only notifications. 2: Turn on the 'Mail Delivery' option: 'Only favourite Contacts'. I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 3,
        "title": "Turn off phone notifications"
    },
    {
        "author": "Tony Fuller",
        "comment": "It works really well very pleased with the speed it opens up. Maybe missing something but as I use it for my gmail and one other non gmail account is there a way to send an email from my non gmail account from my moto 360 please? Thanks",
        "date": "September 28, 2015",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRmRzZmFCSUk0NGlOMVRya3B6MDhIaHkyd05SMVBZNWZjVk5Rd21jUWxkeEljbXlBTFgtRUxyZndXZVhKNnVjTV9HZGhZZjVuVGhxWjNzZ1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Gareth Blades",
        "comment": "Very usefull app as the email client I use on the phone although the notifications can be sent to the phone they don't vibrate. Would be better if the phone notification could be disabled expecially as on the latest android the phone always vibrates which is annoying.",
        "date": "July 31, 2015",
        "permlink": "/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&reviewId=Z3A6QU9xcFRPRnl0N3FxMkhkSEJaTzFLT1dZNm45djdYYW9fc3dYclA1bld0RmRzSEsya2o4VTZwTHNQaXc2aW5HdTF5WllBT3E1YWk4Q0NOWFpmUG9TT2c",
        "reply": {
            "author": "Maxlab Mobile",
            "content": "Thanks Gareth. Sorry, this wasn't possible previously due to limitations of the Android Framework. Version 2.8 contains a custom framework that enables watch only notifications and the ability to set a separate vibration pattern for the phone and watch, Including 'None'. I'm at support@maxlabmobile.com. Regards, Glen",
            "date": "July 27, 2016"
        },
        "star": 4,
        "title": null
    }
]