[
    {
        "author": "A Google User",
        "comment": "I had purchaced this Pro version some time ago, now with the latest update, it is advertising for me to buy the Premium version for $19.00. What a rip since I purchased the Pro version before.  I'm going to stick with my Microsoft Office Apps because they are all free, no advertising, works with my MS OneDrive and all docs are automatically synced and useable on my Windows PC's and other Android devices and it MS Lens is a much better scanner program - better scan quality and has better PDF conversion too. Goodbye MobiSystems, you just lost a paying customer.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=bGc6QU9xcFRPRnRmX3BBQkxXSlBfYl84d3NQM2RrQmxPaVVvUEUwQzdvV0U5MWJuS2xNUWh0SGRQYjV6WjZOb0JBTUsxRUdWSEVyT193dE5ISkkzWGh0U3k4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Gary Boyle",
        "comment": "I really enjoy the Pro Version. Does everything I need and doesn't force me to the cloud storage or cloud editing, like the newer MS Office and Adobe Elements does, for devices. They are no longer for me, and I'll never miss them with your program around. If you ever write this program for PC's, I'll be in line to get it, so long as it maintains local storage and runs locally without the need for phone or internet access. Win10 needs things just like this program. Thanks for the great job with this.... and hope a PC Version comes out to complement this Android program.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRlBrZWVTcEdXVXdxZFlXbTdNWDNGR1N1OEQ2XzdxUEpiekJWbTlyNkFnRUlZa29hR0tGd0diLW93YXQyUDgzazJmTTJTOC1kUUhnM0JaX2pF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Alien Bird",
        "comment": "i can't open most of pdfs and words. uninstall. but with +pdf editor(monthly paying) version i managed to do. i really don't know why. any manipulation? is it the policy? i uninstalled that too. now i use WPS office with which i am so satisfied. somebody said 'honesty is the best policy'. the same case is in your quick pdf scanner. no difference, but different name, and asking another pay. no refund option.",
        "date": "January 15, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRWNTNGM4eVc2NXZBLTdobXhJdFQtdTFpako4WXE2TGJuN19tT3g3dklMWEtpSFBzVzk5WjhwcVlhRzAzLWxPc25aMmE2T2kza0k2RHlVMXYw",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Stelios Theophanous",
        "comment": "This is the best office suite app I have found for Android. I use this on my Chromebook and it works just as well as Microsoft Office. I had this from a past purchase and was dissapointed to find out the fonts were separated from the pro app, and that they were now a separate $10 purchase. I reached out to MobiSystems and they were nice enough to send me a code for a free unlock of the fonts. Now I can keep using this app on my chromebook with all the usual Microsoft Office fonts, great customer service!",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRUdhX1ByeWk3VE1oX1FIM1ZrUDdWcXlUV3ljX1Q5dTVJTXRhbVdnQUtSLUYxM1llbkxNUER6UnVEQTZoU3VmYnlyTC01X09leWM5MlhtQnc0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A.P.U. Leino",
        "comment": "One of the recent updates seems to have broken the management of external fonts. To see documents properly, I now need to re-scan the external fonts folder every few days, and even then I get a pop-up suggesting that I buy the font pack every time I open a file. All in all, though, it's a very good suite of office tools.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPR2ZENlBSVFZheVJzcnpremNxQ0hfVWZoM1RQY2FpNFFWeDZzdl9wM0RUQnZibWNzMzc1R1ZjY1Z4c2M2VEEwakstZy0tSUpvQWRUQzJPOXpN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "LC Go",
        "comment": "Wow. So, I purchased this product claiming it's better than the usual Microsoft word app.  At first, I liked it. But then again then they included a button of the PREMIUM one where you have to pay almost 20 bucks per year! They have the FREE version, the PRO version which basically just eliminate the ads, and the PREMIUM version where you have an access for their cloud drive. The FREE MICROSOFT WORD app already covers the access of your cloud drive. Again, it's FREE. This app asking you to pay the yearly subscription is a rip-off!",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSDhpb2lnU0otOTZuMlF5VUdrWmpvanNiUExHLUNjWjhEWF9Gb1FWZG5OcUstdl9zN2FiUlJuakZwLXFYZGxlaWRROGduS0ZHQU1aN0hiRWNB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "This is my goto office app. I mainly use this for the Excel. I have some visibility issues and some of the formulas don't look the way that I created them on the PC. Over all this app is heading in the right direction. Minus displaying time correctly in the cells, I am very happy with how this keeps getting good better with every update.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=bGc6QU9xcFRPRUJxVFhZUHhwTFRMZVUzTG05RXZWUGEtMUF2V29YNUE5V3RHTS1xWksyWldaNUdTekI1Nk5zQ3dDbzcxQWdrdXBYbUYxZWRXVWF6bkgyUmRj",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Joe Doo",
        "comment": "Office Suit used to be good back in the day, buy seems to be focused on harvesting data now days and continually prompting for some up sell. Spell check does not work when not allowing access to your contacts. That is even though it says that the document has been checked.  I've owned this for many years and switching to another product that that I can have confidence in that's its not harvesting any data.",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPR0xnM0lXamZYdmdtMkxlQVNjVEs1UEZZcWV1TDdpQ04zUld4NzFYVDc2S191WXYyUEJFOWVINUg4NTZnNnJCVlhnM18zREw1V0xrVHNIUG5v",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Joe,\n\nWe are sorry to hear that you are experiencing a problem with OfficeSuite. \n\nPlease contact us at: support@mobisystems.com providing more details and screenshots, if applicable, so that we can help.\n\nWe take pride in our products and are constantly working to improve and make them better.\n\nThank you!\n-MobiSystems",
            "date": "January 4, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Min. Ronald Waytes, Jr.",
        "comment": "I have always used the basic apps of the ones I liked. However, I am involved with many professional level positions and, my smartphone is my lifeline. Therefore, I haven't ever had any concerns about using this application and I thought I'd upgrade to the pro version and I'm content at this time—it has done what I've needed. However, now it's asking me to subscribe to the premium version. I thought I had the greatest in the pro version. I don't think I need to purchase another version as this time and consequently, at that price!",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSGRIQm5mbkl6bDU2WTY3OGFrNkdhcHN1aFB4SnM2akZDVDdjSlVINVB2SWJaQ0pDY1JyYTEtVnVXR3o5bk04c0J2TjhxVGVNWHBLSl9zSENZ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Daniel Melenevsky",
        "comment": "It's slowly became reliable. Thanks to its good customer service. New UI is awesome. Update: there is a bug with pdfs. Every year I write to customer service. And then just drown in emails  and usually leave it. And use other apps to work with these docs. About 5 years now. All in all it's a good app and I already paid for it. So 5 stars anyway.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRXZIQjdTRHVRYWlxUXdsaEVreDc3WDFiMHppQkYzcEo5b2xXbWZtSGhMYjZPekhYM0pON0xERWIyTlpqTDF6bmZkb01qNm9lQWtpWXAyeDVR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kevin O'Connor",
        "comment": "Exactly what I've been looking for in an office app. Unfortunately it has become buggy, slow and jumps around the text while trying to select a sentence in a word doc. Stop prompting to download fonts and stop pushing your cloud when saving a doc especially when it's an existing doc which I already have on my phone and synced to GDrive. At one time I couldn't fault the product but now.",
        "date": "January 16, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPR2VLS0duTExZb09tQzF6ejdmMEhqOFdKUkR4V25zcGxvbC1ZZldNazd5cVo2UUJwOUxHZXpjYTBqUUhkdmdiV1BjZzkxeFBMLTNVVXBZSUNN",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Kevin,\n\nThanks for rating OfficeSuite. Could you please provide us feedback about what you didn’t like and what it would take to earn a higher rating from you, by writing us at: support@mobisystems.com\n\nWe strive to improve our products and hearing what people like or dislike will help us with future releases.\n\nThank you!\n-MobiSystems",
            "date": "January 19, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Azrul Feizal",
        "comment": "Ripoff. I already bought this app. I seldom use it, but when I really need to use it to edit a pdf file, now theres a PREMIUM UPGRADE? Why the heck did I pay for this app before in the 1st place??? And theres no mention of requiring to purchase premium in the app description. This is a total ripoff. I would send a report to google.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPR1RsNlJGRjN5NE04VFNfbXJSeFZXcTN6RW8zUXZUVWZKZGZic0pKMURyN1NVczhrUWdqSk9ha2duVFhJcG1TZ2pFNkJWbTB1S3JJQlJuV2xR",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Azrul,\n\nThank you for the review and rating. We are not asking you to pay again or upgrade! Due to user feedback, we have only included a Go Premium button, should you decide to move to our subscription based model which includes cross-platform support.\n\nYour purchase of OfficeSuite Pro is a one-time payment only.\n\nThank you!\n-MobiSystems",
            "date": "February 21, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Stefan Grell",
        "comment": "I am using a Pixelbook, which should be sufficient powerfult to use this application. I did create some slides, which only consisted of 3 slides with alltogether 6 text boxes. App crashes and when I try to open the recovered document it crashes right away on load. Support, please do not ask me to send screen shots since it crashes before you can actually take one. I think I would rather get my money back, or even write it off as a learning experience",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRlhYMGxzZk5iU1B3c0FWMGZRRWZiN25zVkxoR0FGOXIwTHpZcDZVRzMxOS1GeS1Eb3BhbmZYcjhjMDZ2My1VZ3E1VzhqbzdmU1VLTFRkY2ww",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "George Balamotis",
        "comment": "I'd change my review and instead of 5 stars to 3 stars. I'd the Pro version for years and I was satisfied. But the last month I'd face a serious issue in excel: if a cell contains formula like \"sum\", \"average\" or \"vlookup\" then give back a value of \"#name?\". So, its became useless to me due to that fact and force me to start looking for another solution, another suite...",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRnVxVkJDQ2JwSGczakE4QVJnN1g0U0RSdVB3b0FlT2hvZ1Q0d2hYSEdvR3pHaklaZmZrRFdFbE9HVWpQdTliV1VqUkZocEowcFJ0bUY5dDRB",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello George,\n\nWe are sorry to hear that you are experiencing a problem with OfficeSuite. \n\nPlease contact us at: support@mobisystems.com providing more details and screenshots, if applicable, so that we can help.\n\nWe take pride in our products and are constantly working to improve and make them better.\n\nThank you!\n-MobiSystems",
            "date": "January 29, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Steve Michael",
        "comment": "I purchased this app as the pro version many years ago. Today I try to use it to edit a simple pdf document and it is asking me to pay for a premium version? Is this a joke? What did I pay for with the pro version then (which was not cheap by the way). Terrible. I will not use this again.",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRTY0OUY0VFhySWotakNMTERuTC0yUGVzeXBKRkk4WjUxeWlKNnNWZnJUbWRLS0hUUjZUUXBKY1F2YjVJN0huT0VnbEFBT0tZaVFESWJUN3Bv",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Steve,\n\nThank you for the review and rating. We are not asking you to pay again or upgrade! Due to user feedback, we have only included a Go Premium button, should you decide to move to our subscription based model which includes cross-platform support.\n\nYour purchase of OfficeSuite Pro is a one-time payment only.\n\nThank you!\n-MobiSystems",
            "date": "January 29, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Jehangir Gai",
        "comment": "The app is excellent. However, even though I had purchased the PRO version, all of a sudden I was UNFAIRLY downgraded, and WAS COMPELLED TO PAY A YEARLY SUBSCRIPTION  for upgrading once again. The Developer does not respond to e-mails.",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRl8zVEd5WHpoNlBqVXZxRU1DbzJrMjV4NDU0MWkyR1JuSUNZZS1KbHhNSDhfN1l1NlluRGRwWVF0bVZPa0I0b2FTRWFNTXlBLTdKaFdNSTRV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "I like the new cloud feature however it's being implemented badly. I already have most of my documents stored on my device so it would be better if when I save something it saved it to both my device and the cloud instead of separating those saves. It seems to only be affecting my phone, every time I open any document it immediately closes and CCleaner opens.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=bGc6QU9xcFRPRmJocXNPb0ZhZnUzem53UlVCcE9SaHhYbnNHX21UWkRIeGNWRDhfekNJUEpfQTdLc2NnTHQ3Q3QyUzB4UkhSaFpxRk95cVpPQUlMQnZDUXBv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "d vandy",
        "comment": "Bought this item,OfficeSuite Pro + PDF, from Google Play About 4 weeks ago. It is a great App. I use it all the time. But on 01/23/16 an ad for your trial version kept popping up when I tried to open a doc file. I looked in my apps and the pro version was gone. I went to Google play to try to reinstall it and there was no record of it there. I have used the Your pro version that I paid $14.99 for ever day. I need it. Where did it go ? I paid for it again. Another $14.99. I have waited about an hour and still it hasn't reinstalled from Google Play. Please Help. Paid $30 for a $15 app. I do not want to inform Paypal to remove the charges. But I refuse to paid twice and have no app. Tried it Again 01/29/18. worst than ever Slow and not much too it. Moto Z",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRmdHX25DR2l2R1A1Uk9LUEJhRWdPVmlwR0EwbTdySW45NHg2NG15alg1dDNNVGp4dUdfbFVyMjBObVFQRlZOamduYldLbUsyZEh0WVJEb0kw",
        "reply": {
            "author": "MobiSystems",
            "content": "You can Clear Data for the app from your device settings and then log in with the account. \n\nIf that does not work, please contact us at: support@mobisystems.com providing more details and screenshots, if applicable, so that we can help.\n\nThank you!\n-MobiSystems",
            "date": "February 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Very good app. Only lost a star because they want you to pay another $25 to get a few extra features (like OCR), even after paying for the Pro suit. Not nice.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSDZYc3RNTVc3TG5jbktLNEVfYndlQTBtNUYyZjQ3S3I2QkdTSFc5S2lwQzNJN3B5V2pZZ3AxTnN2SzVPOUhxaFpYdnhmZWRLSVZKTHUya01F",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "David Sleep",
        "comment": "I bought the \"Pro\" version a while ago and have been using on and off. Went to use it today and it wants me to either upgrade to premium or personal. How many different paid versions are there.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPR3JtbWxRVU5OUldqRV9QWVN2NEIySDFHNHN1bmZhTUNKQnZRdkJERFU3R1pFeW5xQW5YSUVOVkQyektZSk1zVG54ZmRtb1Nic1RRZU4zRXhV",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Uninstalled due to data mining. I'm fed of this on the Google store. Mobisystems used to have a good reputation. That I've paid for this app already just adds insult to injury. If there is no data mining going on, Mobi need to have it out with Norton AntiVirus. As it is, any apps that data mine do so without y consent.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSGFlU2NsR1dYYWg4YmJISXN6Y0tfdEpzTGdwVEFFVzlXdHdHVUZnSHlaWmtsc0tOSUtTc1Uxa3QtX0NIbVJyTExHRm9OR1IxdG9PUTdhZ2t3",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello,\n\nWe are sorry to hear that you are experiencing a problem with OfficeSuite. \n\nPlease contact us at: support@mobisystems.com providing more details and screenshots, if applicable, so that we can help.\n\nWe take pride in our products and are constantly working to improve and make them better.\n\nThank you!\n-MobiSystems",
            "date": "February 21, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Douglas Swift",
        "comment": "The responce from the developers just proves the truth of my review.................This use to be a great app.  I even purchased the pro version years ago.  Now with the latest update I get nags to upgrade to a subscription.  I am done with this product and the unethical behavior of this company.    Developers take note the number of negative complaints you are getting after the last update.  Finally before you say you were just responding to user request a quick review of the feedback here on Google suggests that the users are not asking for a subscription-based service. Please have the Integrity to acknowledge this.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRkFoZlZhVldyYW5BR3pZcXpya2VYN3pxeU0zLUdTRzR2UXoxbmRsU2VNRVhLOV9OZWV6SjJIQWpmMWQwbi04YnkxM0NHVVNGLXJzZmw3RWRJ",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Douglas,\n\nWe have other means of collecting user feedback, not only through the reviews in the PlayStore. We appreciate your feedback regarding the Go Premium panel.\n\nThank you!\n-MobiSystems",
            "date": "January 29, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Rolando Ramos",
        "comment": "I had purchased OfficeSuite Pro long ago. Now anytime I open a document the app request to install missing fonts like the ubiquitous Times New Roman (really???), for which (of course) I will have to pay more. I hope it is a software bug and until they fix it, is one star rating for the app.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSGhVZ19mUVotVTZ3WFVZc19uVWhIbWRrMFVwbU9XQmNqTi1Ea1ZwdVJhUXlUUW10SXBlWTh5OXlqV3ltRTlQODR2Zk9vVkYzcjBDSnQyWk1N",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Rolando,\n\nThe font pack is a purchase because we have licensing costs associated with it. It is a convenience item for our customers.\n\nOfficeSuite Pro and Premium allow for the installation of custom fonts in TTF and OTF format. Please check the program settings for this feature.\n\nThank you for the review and rating!\n-MobiSystems",
            "date": "February 12, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Rajat Prashar",
        "comment": "Worst purchase ever! I had paid for this app and all things were fine till this new update because now even I cannot access those things for which I had paid and so if anybody is here after looking the 0.99$ then go for any other free app. If you want to purchase then I strictly advise you to go for another app like Polaris office which deserves 5 stars and is a editors choice also and for which you should pay but for this app not even a single star whose developers are so illiterate that this app can't even check my credentials for which I had paid and they are thinking that they are Editors choice  Also these people cannot answer the mails which we sent to them.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRVFVRlBQSDEzbGxXNkxlVHpXaXQ2LXRIVzNfT2hCcW1wWEkzSDVuSDBoYjQtc2NCYUhTTjVRaVRHMDZ3dTc2NDIteTBmR0RGb3FPM0FBVmNV",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Rajat,\n\nWe are sorry to hear that you are experiencing a problem with OfficeSuite. \n\nPlease contact us at: support@mobisystems.com providing more details and screenshots, if applicable, so that we can help.\n\nWe take pride in our products and are constantly working to improve and make them better.\n\nThank you!\n-MobiSystems",
            "date": "January 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Runesten Grimeton",
        "comment": "This app keeps starting itself up and then later shutting itself down. I'm beginning to wonder it maybe like to phone home all the time. Not good, having that happening. It gotta be data mining. And the nag wear, my god I already have a file explorer and no, I don't want your fluffy cloud.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRjd5Vk5rcFlfRzdaS0pjQ3dYbTRzeXpUcGFpSHkyWE9CRHJ4QzhqZFlVZVNneUlHVm1Ta0JYNkhadm5wZ2dleWkxX1ZwampxMlRMYVpKTUxZ",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Runesten,\n\nWe are sorry to hear that you are experiencing a problem with OfficeSuite. \n\nPlease contact us at: support@mobisystems.com providing more details and screenshots, if applicable, so that we can help.\n\nWe take pride in our products and are constantly working to improve and make them better.\n\nThank you!\n-MobiSystems",
            "date": "January 4, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Johnny Cash",
        "comment": "Just started using apt. when trying to edit a document it will jump back to a previously used word. Example: The word choice is Is used in the document. I typed two more lines and used the word choice again. When I try to correct  the word choice and press the space bar the cursor will jump back to the first used  word choice used. Better raring when corrected",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPR2xqS2JoQ3huak1VTmtaaW1lQVp5N2E2bUNSaTFRaC00VFdLREZIYUk5d2VaR2UyY2oyME42SFlVTXFfZ1N2bGYyTG9YRWhPM1QtaXBNNEtv",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Johnny,\n\nWe are sorry to hear that you are experiencing a problem with OfficeSuite. \n\nPlease contact us at: support@mobisystems.com providing more details and screenshots, if applicable, so that we can help.\n\nWe take pride in our products and are constantly working to improve and make them better.\n\nThank you!\n-MobiSystems",
            "date": "January 19, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Jose A. Garcés",
        "comment": "More concerned on selling you more stuff than on doing it's job. Not really compilant with OpenOffice/LibreOffice: can read more or less good the files, but cannot write it. Navigation in spredsheet really bad: you have to tap on the \"edit cell\" field before writing the cell. Cell formatting does not work ok, also not autofill. Conclusion: ok for a quick edit or emergency, not as a full editor (not even a reduced full editor).",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPR3N6QzAyeWxEYjRvN2tKbmNsb0dER25NendsZ0tITU5xT0Iyb2lhc0U2T09MNGxnTDg2c0pkM3J0X0RUdEU0OXc0VFFXRm5ybV9QaTQyWHVv",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sarn K",
        "comment": "update: there're some issue exporting file from excel to pdf and the header & footer does not work as intended. the abc 123 colum & row show when export completed but when i uncheck the header & footer  it work without the abc 123 etc..weird but i can manage it without the original header & footer..",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSHJheEVUQmc0YW5DRURvVjJ2X1FvSDlhRHRka2NRcjBWbFYyTklzSGYyWmstMHJPVHZPR2VTSzg2a1NKcU5rQkIyZFJrbnd5aVUyWFJ6MlVJ",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Sam,\n\nWe are sorry to hear that you are experiencing a problem with OfficeSuite. \n\nPlease contact us at: support@mobisystems.com providing more details and screenshots, if applicable, so that we can help.\n\nWe take pride in our products and are constantly working to improve and make them better.\n\nThank you!\n-MobiSystems",
            "date": "January 29, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Raymund Tiu",
        "comment": "So you have to buy this \"Pro\" version and pay again for a subscription to upgrade to the \"Premium Version\" to have all the features unlocked? Lmfao! Time to dump this PoS. I'd rather spend my money on Microsoft Office for a real cross platform office suite than this crippled, bait & switch junk app.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSEV5VE9yR1JUUmJDWEtnenh1Rm1SUTNwYmN4X1ptTDRNRVp3aFFBbE1RV3JWcTV5SzQxLXY2NWFwbFY1T1dyMldMMGpYN0pabkVhSUl2RXpv",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Raymund,\n\nThank you for the review and rating. We are not asking you to pay again or upgrade! Due to user feedback, we have only included a Go Premium button, should you decide to move to our subscription based model which includes cross-platform support.\n\nYour purchase of OfficeSuite Pro is a one-time payment only.\n\nThank you!\n-MobiSystems",
            "date": "January 24, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "I paid to upgrade this app , now an upgrade came across and now you want me to pay another 20.00 for what , the upgrade I already did , no thank you , if it. Doesn't work , I know of a nother AP that will work fine and they won't going me , thank you for such a life changing app , boy I don't know what I will do with all those resumes that you can't do anything with. , I'm a little fed up",
        "date": "December 25, 2017",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRVQyblpPMDdaX0w4X3hoY3VZMDhCV2phY2pQWXR1YkRwelg0NGYwWTVNTG9JTndlRmthUWJnOHlNQlNibXF0WGpYTzEzdl9NN2RYc09ZQ3dZ",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello,\n\nOfficeSuite has two paid versions. Pro is a one-time payment while Premium is subscription based and offers cross-platform use as well as including some other features.\n\nThe new release of OfficeSuite Pro now simply offers the option to move to Premium, which was not possible before.\n\nThank you!\n-MobiSystems",
            "date": "January 2, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Mike Pew",
        "comment": "I know a lot of people have had problems with the fonts in this app but this is actually a pretty good app and you can add your own fonts I have 85 fonts and I've never bought one of the font packages. It takes a while to go through all the settings and turn off all the nags but once you do you will like this app",
        "date": "December 23, 2017",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSHhUNHZYX1AwRHhhR2F5VUd4NU8tODROTXBqbG1lVjRJb21WcGthMXhwRHNENHZyTFZXNXlodXRnMGRwYXVJOVJrLVRWNUkydWpOcFVWdVRB",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Nate P.",
        "comment": "I'm tired of paying for these apps then a year later trying to charge me for premium again! This app wasn't cheap to start you greedy punks",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRV9SdzZyTEU1OGViMnpUa1dBeEdFd19kUnRJNXVhUjFfQWNUemFnSkdkbl9kX2wyeF94ZGs1cDJiclA1MnNtMjJ0ZFowbUtsYkFSVjRUQWg4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jim Caldwell",
        "comment": "I've used Office Suite since its introduction, and have been more than satisfied with each update.  As important as are the many improvements each update offers is the care to avoid programming errors which are so common when rushing to update before thoroughly testing the program.  Congratulations on what appears to really be the BEST Android program to be compatible with MS Office.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRmg5aGtGRkU0SVZiR2d6QTlKMXphTDVWUExjYzIzYzBkMF85T2VVaURBbnFiVkZ6QUpWTzV3V0ZNci1VSmR3YzVwZkEzME9kX3FpSXVhQThn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Yoji Ohkubo",
        "comment": "Please stop popupping up \"Rate 5 star\" request even to a paid user. It's very annoying and is only to disgrade the company, MobiSystem's reputation. Function and usability except that are good!",
        "date": "January 7, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRkZJYVlUX0dib0UtUHNhTGZ3VS10OU8xRFJyYi1XYVREOWcwYlQtMVgyTDZtLW9LQ29UQzQzRGhta3Rad1NLbmkwbm1QRXVFS0otdWZuSm04",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "H. G.",
        "comment": "Good app, but if you insert a few pictures (4 or more) it will mix or change to other pictures when you save the document or try to print. Its very annoying.",
        "date": "January 7, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSHktTFE2OEpaMjJidDBLYjFvUnZiaXFscmtsTUtxWnJfRklLV193YjlSQXlGREE0eC0yekF4eEJrNU5GQXNrR2F3WTZXN2hiZE1INm1ETWd3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Flashxml Flashxml",
        "comment": "Edit 05.01.2018 * You can't convert from pdf to word etc, you need to pay 25$ / year 🖓 I have pay a very good price 15c $ 🤗... very good application like the one from pc. Edit 11.10.2017 \"Free office for pc * menu\" crash application",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPR3pyb3J1cHJVY0w5WVFxZVp0bDJGcnNGQTRtcVZlel94bWYzUmRsbWxIY01obDlPd0tJdzA1cWNsTkozOVM4TmZhOXNEdUhnUEFsZHhpdXVz",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello,\n\nFiles conversions are now unlimited and included in the Premium File Commander, which is our file manager app, designed for work with OfficeSuite. Consider using it, and you will be able to convert your files.\n\nPlease contact us at: support@mobisystems.com if you need more information.\n\nThank you!\n-MobiSystems",
            "date": "January 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Mister Selcouth",
        "comment": "It is a very good team effort that you made this magnificent software but Its asking me to again upgrade to premium??? Why Office Suite free version does the same as this softeare do??????  We are getting no advertisement that's it??? I hope you will fix this soon.",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSGo5Rl9lZzg1YWJueFRRTGFHTTRjNVdsRlNYVHdtZlhzM3NSQWFSWEVTVEdiWlBFcWljUzdVekR6bnVQMTJEM0xIUy15bUpQT1lqS3pCNk9J",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Puneet,\n\nThank you for the review and rating. We are not asking you to upgrade or pay again! Due to user feedback, we have only included a Go Premium button, should you decide to move to our subscription based model which includes cross-platform support.\n\nYour purchase of OfficeSuite Pro is a one-time payment only.\n\nThank you!\n-MobiSystems",
            "date": "January 10, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Will Lowe",
        "comment": "Purchased pro version a while back and now my version is nerfed and they want more cash.  I'm sure they would be pissed if they purchased something, only to be told they had to pay every year for the pleasure of using it.  Poor business practice and a fine way to lose paying customers.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPRUJhYjVvSURvWkUtYjBDeGV6QTF6azFoQXhPX25kdExkRnZzdHhPbzFydWZIMDBRVnNzdU5tRE4wby1DOVUzcVJkeXNEZlZUTG9zQS1xVkM0",
        "reply": {
            "author": "MobiSystems",
            "content": "Hello Will,\n\nThank you for the review and rating. We are not asking you to pay again or to upgrade! Due to user feedback, we have only included a Go Premium button, should you decide to move to our subscription based model which includes cross-platform support.\n\nYour purchase of OfficeSuite Pro is a one-time payment only.\n\nThank you!\n-MobiSystems",
            "date": "January 12, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Brian Rae",
        "comment": "I think that this app works good, looks good, and feels good to use. Doesn't work with some ods files, but others works well. No problem to print . I use Dropbox and it works well there. Just getting used to it but all in all I would say this is a very good app.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPSHY0b1VHVTdOVVluYXJjZzJRaDZQZ3VtYWpxcjZGbWZnSk9fZlBRVFVGR2Z5el81TmlJNDB5bDBrR3lpeGFTUjhMRl90YVlKTkM4bFZjS28w",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mr Soni",
        "comment": "Mobisystems is one of the greatest development company.. The developer is not only generous in solving issues but also hard worker.. They made every app so greatly . And every app is really great. This is the only app i use.. no need to install any other app.. Supports all types  of files. It is worth every penny.",
        "date": "December 26, 2017",
        "permlink": "/store/apps/details?id=com.mobisystems.editor.office_registered&reviewId=Z3A6QU9xcFRPR2FDUS12WW4xeUZfZXpTdm9VcDlTanM4MG5Mck1GeGV4SWpxVTlMWmxMa1BWdl9mUkRTTWNySTYySUtUdzVNTTVPTy01UUtHeDBxdDNqaE0w",
        "reply": null,
        "star": 5,
        "title": null
    }
]