[
    {
        "author": "Darren Turbill",
        "comment": "Works, but this needs more work. Installed initially on my watch, expecting it to be a standalone app - which it is, but with a catch. It doesn't tell you when you initially open the app on the watch that you need to install the app on the phone to log in to Spotify. So was getting connection errors with nothing to tell me why I was getting the connection errors. Installed app on phone and again, and application login didn't work at all and it doesn't tell you if it's successfully connected to Spotify or that It's actually logged in. The app needs to give more feedback to users so that they actually know what's going on and how to use the app.",
        "date": "December 25, 2017",
        "permlink": "/store/apps/details?id=com.drewapps.spotiwear&reviewId=Z3A6QU9xcFRPSDVrSEh1alZOWGswUTFqc0g5V25YSmFnVGVjUy12S29SOVVXNkh1SDh5ZnJIRWZFMlc1ekNVcXFaeUhaTGpSM1R1VmdaRm1sa3ZwcUtMYVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Daniel Lynn",
        "comment": "Had trouble with app at first then I messaged the guy who made the app and he helped me get it working thanks for the help",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=com.drewapps.spotiwear&reviewId=Z3A6QU9xcFRPR2lUd1ZqcTAxVG5BRkVYdFJUaHoyVTdQZ05WQXhFb3AwZHc1a3JfcVJZTFl0X2JZdGR6c0ZnSnBsbVp0VWo3MzhGa083S1RRVnA0ck4wdFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Amazing app, honestly this is a pretty awesome app. Spotify will one day provide a standalone version for Android when there's more demand for it, in the meantime I HIGHLY recommend this app as the alternative. Works great & no complaints.",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.drewapps.spotiwear&reviewId=Z3A6QU9xcFRPR3R1WnpqRTJBYU5qaFQyWXcxeE44QWJHZ3BwRmRzT1B5U1NaUzNpZ3NkaXEzZnZvdjJoVlNpV0hQSUpWUnItTHFLV2xfVEpwME52b3AxQkE",
        "reply": {
            "author": "DrewApps",
            "content": "Hello, thank you for your nice feedback. This is much appreciated.",
            "date": "January 21, 2018"
        },
        "star": 4,
        "title": null
    }
]