[
    {
        "author": "Avi Heletz Sufrin",
        "comment": "The new ui scheme is better but it has strange decisions: why is the 'add a person to your group sharing' button so easily accessible on top? A user needs that button maybe once or twice in a lifetime. Other such decisions make me think this app needs a ux overhaul, especially since it has too many features, a classic case of can't see the forest for the trees...",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSGlkbEhpN0ZweVVNVmU3M0pzMENGSXE3ZHRsdy1udGMzTUFQNVU5RFFpUVdXaE9LcDhoVDh4Q2ppUFViRU84TTFQZVVES1VQNGplMUtadFE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Avi, Thank you for your feedback about Wallet. Your input is very much appreciated. If you have a moment, please send your suggestions here as well: http://feedback.walletapp.net/.",
            "date": "March 2, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Brynn Curry",
        "comment": "Was a 5.  Ugh. UX was better before. I used different charts for different accounts as it made sense. As a paying customer this was important.  A possible fix could be the option to apply certain charts we select to only certain accounts... Or having the option to use the old UI.  Also... If I do select an account at the top to do a reconcile (switching transactions from cleared to reconciled) it works but then deselects the account and I have to go up to the top and select it again to do the next transaction.  I guess I can try going to \"Records\" and screwing with the filters a bit.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSDUwdTF1NFF1YkR6NGhCYXV0SG9fWlEyMUt5cm5GOENPcHYwekFQTk5aNnd2MlhqYWZVLUcxWHRDTnRRTklXSHBvVjVzMDBLRTFsUFlVNkE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Alexandru Dominte",
        "comment": "pretty much a great app. but sometimes it crashes ever so gratefully and duplicates the transfer records messing the balance. also a real (not crypto) currency rate widget would be nice!  also please make a setting to change the default account input from notification",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRWJXRE9MTTM0dElBX0hTSDBHeXhHY0xDVVl2UlBpUzkzdW5wUjk4UmdFWktad21KTHJ6ZDN1aGVXTmlDOWRwOHUyZ1BVWW1KaVY4OER0cVE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Alexandru, Thank you for your review and feedback about Wallet. Your input is very much appreciated. If you have a moment, please send your suggestions here as well: http://feedback.walletapp.net/.",
            "date": "March 2, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Azhar Omar",
        "comment": "this is a very good app. it just the latest update is very bad. i think the swiping method made this app very convenient, but now it is gone.  besides, the values shown in color grid is incorrect. i thought i lost all my data, luckily after checked with the balance widget, i still have it. it just the color grid is not right.   please rectify this problems.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRjJrc3dNQy1mdG5EMFVDOWdXbGEzNWVxZGRfSjQwQjdqTU9wQzRWVWRCbURMWldCMnNRLXEzejRfRFVOdU16bVpsdUdaa3RjLWhLS1N6dHc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Azhar, we're sorry you don't love it! Instead of swiping to your different accounts, now you simply tap on which account you want to see. Also, if you want to see the total for two or three accounts, you can now long tap on the second (and third) one to see your combined accounts' statistics.",
            "date": "February 27, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Response to my feedback is untrue. The app used to be great and is now not suitable for purpose as many recent reviews suggest. Given the responses these reviews are getting doesn't seem like the old system will be brought back. Save your money and look elsewhere. Support for the 'update' is awful. Am very unimpressed that the company still thinks functionality is the same, if they valued their recent reviews they'd clearly see this is untrue!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRkU4d0g2VC1CR2tnM3I1TkV5anp4dkNsV20yby1paGhqd0h6eW8xZ1EyNGFTaUxjeEJySUxGY2xMN0Y4NzNhOWl2cEl0S0pObU9WOW5nVWc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi, we're sorry you feel that way! Our purpose is to help users understand their finances and cashflow better. We designed Wallet 5.0 with this in mind. See here for a brief article about the update if you're interested: http://bit.ly/2BNaiOL.",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Shubham gupta",
        "comment": "Hate the new update... Common widgets for all account is awful... I customized the widgets according to the account but now I cannot do so. Please remove the common view and rollback to different dashboard for different accounts.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSF9XWG03NHplZTkxM0xEaW1EWlJVQ1drVkVyTUhhN3dNMXRPNjEtdE94UXhHOFZOOFgzNzFyU2NVYktJZ0VBdlJleEx1VEozbEZLdm55TUE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi there, Its true you cannot customize the Widgets for individual accounts, but you can view single or combined accounts, and still find all the widgets from before. Thank you for your feedback about Wallet. Your input is very much appreciated. If you have a moment, please send your suggestions here as well: http://feedback.walletapp.net/.",
            "date": "March 2, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Andre Gentil-Kraatz",
        "comment": "The app mostly works. It is great that I can connect not only my UK accounts but also the once in Germany. One really annoying thing is that all my transfers between my accounts are always categorised as \"transfer from outside wallet\". It doesn't matter how often I try to edit the transfers to link them to the correct account. As soon as I hit \"save\" wallet changes it back to \"transfer from outside wallet\". Hence only three stars, as this is a very basic functionality that they just can't get right.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSHNSSm5NUmNVa1NiOVBkVWIwcURsRWg2RWthcHhrWjdHTTluWEYxR3pJTFVqb2JUQ0xvRjh3VlJNZ2Y2Uk1mSkNRdXRwbUE2Q0hEc0NWZGc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Andre, Wallet does not yet handle Transfers between bank-connected accounts, so you might be better off changing them to Expenses in one account and Income in the other. We hope to introduce this functionality in a near future version.",
            "date": "March 2, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "old channel",
        "comment": "I hate the new update. I really would have given it 5 stars if it weren't for the new update. I like how the accounts were like tabs abover instead of the new click to show theme. It's really confusing.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPR2JJLTdlejlDbDd3dlhuSV9rakFSQ2VIMjI2LThmLTlSWDlZc05NZkRLNS1PLW0zbTJGSEo2el93aGV0Um5UMHZyRHJrSWJSNUlrcE83b3c",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi there, Thank you for your feedback about Wallet, we hope the changes will feel more comfortable and natural as you get used to it. If you have a moment, please send your suggestions here as well: http://feedback.walletapp.net/. Thanks for leaving a review.",
            "date": "March 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Hana Púčeková",
        "comment": "Until recently I was super happy with this app. Everything worked perfectly. With the last update my \"synced\" transaction stopped to sync and now I don't have the exact overview of my expenses! Very disappointed also with the new interface. I would give it 5 star review last year, now not so much ... Ugh so sad.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRms1SjV2R1M5ejVhaWdmZjc0UThEcjN3ZzVmQ2xyamJueERCZFJCMFl4R20yV194bmxwWVN2VG1WZlJSTGlnTnBGSVVJX2diY0JzaXhFRHc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi there, We apologize for the interruption on the bank sync, but from our end it looks like it refreshed yesterday. We hope you give Wallet's new look a chance and come to enjoy it, do let us know if there are any issues. Thank you for your feedback and review!",
            "date": "March 1, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Shera Isreal",
        "comment": "The new update really messed up my whole account. I can't add anything to my account. Have to completely start over. My bills still keep coming. I can't not document because I'm waiting for the app to fix the issue.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSEFVTXp1d3pkejV5c1pyTDVuZnVSdlNXTTdTcWR0ekJUc0FzbmM0bW1GYWJOU1E0VVVMMDB5Y3Bnc0F3eExoX2dzbktpcDZDSDlpMElHaVE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Shera, you mean you cannot add any Records to your accounts?",
            "date": "March 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Muhammad Abdul Wahhab",
        "comment": "I really like using this app. Although recently I just noticed - for example if I spend £20 it comes up twice in Wallet so it shows I've got double the expenditure (and likewise to income). Why does it do this? Help!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPR0FuY2xBdlZPUEhNYkoyS0ZiVWhZekdSWjZqTE9sRFJpWFo5MU5mZUZsLW9MYkc5S3FiNHI3ME9TendQdEZlUmZLMXE2ZWhveWVmQU1JSVE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Muhammad, Please write to us at support@budgetbakers.com so we can check into this and report it if necessary. Thank you for your review.",
            "date": "March 3, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Monte Cillo Co",
        "comment": "Cant used the app after changed to another device. The pin was change. I just subscribe a few dawys ago and then cant used the app. The support is too slow.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRm5PcXRpTjMxNDZDRnI1NkRpUnZzWTRsRWNwenk3ZERrazRiX1pTOXRvWW1LMkdyNG44OFprN0xzaE14YlFsc0dRMWNNQWVOYklhblpMSUE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Monte, I just replied to your email, please check there. Thanks!",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Wojo62star",
        "comment": "Terrible update. App worked great b4 but I can barely use it now with the new features. I rely on the editing of the balance feature that was removed. As I often don't record every transaction. I have a yearly premium membership so yeah I'm not happy.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSC01NmIxak42bTZyVHB2U1ZjdTJ2akVPQmJJdXJRSUxCclBjRHhRcXJjVld1cjAya2RSWjVuZnVIM1JGbS1xZ1VuS01pQjJNbkFTTXB0dEE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi there, Thank you for your feedback about Wallet. Your input is very much appreciated. If you have a moment, please send your suggestions here as well: http://feedback.walletapp.net/. You can still edit the balance of a single account, and even reset the initial balance by choosing an account and then tapping the icon next to the balance in th...",
            "date": "March 3, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Quite the irony that the app becomes \"Editor's Choice\"... and gets an update with stupid design changes and bugs... I gave the app 5 stars in the past, but I'm removing stars, as this seems to be the only way to be heard by developers, even when you are a paying customer. Hint: if people use and pay for your app, chances are they like it the way it is. Instead of fixing existing bugs in the app, how about we change the design like nobody wanted, and add some new bugs in the mix? Seriously, guys... I have split an expense... one half of that expense has disappeared from that account... Guess what? This never happened before the app got the big design update... Will not be renewing the subscription if bugs aren't fixed.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSFdjSUpQVUNhMTVzRDVJSEFwUFR6cVNHQnA1aG9FZC1STVlsbUxvbzJXUnZhZU9zV2tsMEVFUl9sVFVycjJydDhTbEx2TGIzd01PWk1oMlE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi there, We're sorry that your initial experiences with Wallet 5.0 were not enjoyable, please write to us at support@budgetbakers.com about the issues so we can check them further. Read more here about new changes in Wallet: http://bit.ly/2BNaiOL, and if you have a moment, please send your suggestions here as well: http://feedback.walletapp.net...",
            "date": "March 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Soffian Abd. Manaf",
        "comment": "I'm currently trying this app out. I eventually needed to create a third account, which i was then asked to invite friends and have them download and register, which they already did. Unfortunately I  still unable to open up a third account afterwards. Please help!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPR2xZNFZCa2V6UE1pNkdIb2hjTDA1VG9xRnJ3WTFEWHpGQ2R1UzJZU1dwZkhHdXRHTVE2XzJleDhTQzJUN2VaU3U1N2RZUE10bWlsaTViUmc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Soffian, we will look into it! Thank you for the review.",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Redowan Nafi",
        "comment": "Been happy with the app for almost two years and now this crappy update. The color is dazzling green which hurts my eyes, the color scheme of the font looks laughably childish, 'Wallet now' is another unnecessary spammy section that was hidden before, the card ui cuts down screen real estate, the thick font looks something from the early 2000s, sync is broken and I could go on forever. The UI was perfect. This overhaul simply sucks. At least please give people the choice of picking up thee default color scheme for the app. This new dazzling green is making me to look for another app but I have 2 years worth of data here.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSE50aHVWSUFmT1F6VkxWLWpraGZOSW5ib3FmdHU5bjQyLXo1TDhMaGYwU1kzTW5UUG14ZTZkMVh3OFFWaGtiMHllVjlIcEc1bWZVVWtxUEE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi there, We're sorry that you are not happy with the new update, but we appreciate your feedback and input. We hope you will give Wallet a chance, and please write to us at support@budgetbakers.com about any issues that you notice. Thank you.",
            "date": "March 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Maxim Tsegelnikov",
        "comment": "The best program for budgeting. There is only one thing that make me sad: UAH symbol is not knowing by app. It's looked like ₴. Please, realize that symbol. Thx.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRTV1UEJ2Z0dOalFBMU1HM1R0SFNHVGhHU3NuU0ZfUkY5SFE4bDdjaDYxTGFMbWh6RmtiMWFuSGtXVHZxU1pjX0NvU1FsZVN1UktDMlFROVE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Maxim,\n\nPlease contact support@budgetbakers.com with a description of your problem in English and we will look into it for you. Thanks!",
            "date": "August 21, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Heliana E",
        "comment": "I just started using this application, an so far it works great. I haven't used many of the resources available yet, for I'm still learning. There are some things that could be improved, but so far it's a great application!  I intend on signing up four the paid version. Great help on keeping track of our finances!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPR0s3ajdBMjNnbmlWSEU3N3Bvbl9SZ1BxX09XZHpheWJUckN0aU5LWVVFTEFjQmNnQmRYa2Rnd3JBYUk3T3BXeEYwX05CVXd3dUJTNHVRZ1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "UNDFTDX PLM",
        "comment": "OK. this is good. already purchased the premium one. its the cheapest with lot of features. its will be perfect if the planned payment has total summary. and adding another note section where we can take note or upload some bill etc. or we can upload picture for wishlist section.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSDlLWThIMTNYck42N0FyM0E1YkVyQmlTLWFsZVRTSVpnWTR2VmV5cHpPUXBwLVZvRXQ2SUM0S2o1dE5qQU9tSzAwT0hfdVZtVE1IUG5zUEE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi there, Sorry about that, please write to us at support@budgetbakers.com with your registered email so we can check it. Thank you.",
            "date": "February 27, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "This app was awsome before the update but now it's just over complicated and annoying. I use to be able to click on one of the accounts and I could see all my expenses now I have to do about 3 extra steps! Sorry wallet! 2+ years is coming to an end... :/",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRXFyeko5Wko1MHZ1VFhjMWRwTGVMRnE4dXltbkVmdlFXcUk1dFdSRG5kbnFVRExlbFl0UnZEeklXaFZsUTJVSDJVTklzY2dKMDZrZndYLWc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi there, Thank you for your feedback about Wallet. Your input is very much appreciated. If you have a moment, please send your suggestions here as well: http://feedback.walletapp.net/. Please see more about the new features here: http://bit.ly/2BNaiOL.",
            "date": "March 3, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Fayyadh Zul",
        "comment": "This app was very good. Easy to use.  Easy to understand. But with recent update have causing problem for me. It crash evey time i open the app.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRjRhS0NKcHc5NTR6ZlU2Q1gyb01VN1dsWnQyOXg0R2RYQWszVVR4SWJvYXBuN0JYdE9MZko1eGRfMkpweldVVHJfSHJnX1JiR2JhNDFWeWc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Fayyadh, we are very sorry about this. We monitor crashes and hope we can resolve this quickly.",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Josef Baxa",
        "comment": "I am paying for Premium membership and this useless app falls down again and again. For what am I paying actually??",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRjJEUU9VdjM3MTVFRVZCb1J5M0FUNEo4cElXQm15akowU2RtcFhPRkZJdFFLUjFZQ2ZhZ0wzek1ONnNIamJPMndWZHotZ0VCaVZHY2xnZ2c",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Josef, Sorry about that, if reinstalling the app doesn't help, please write to us at support@budgetbakers.com so we can report this.. Thank you.",
            "date": "March 3, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Denis S",
        "comment": "Getting worse, new design is pretty bad loaded with useless functions. Customer service is so bad even for a subscribed users, if any problem don't wait for a reply... Looking for a replacement.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSDNGYS1QcnFUVkdwR2JfaWhqNFRrOXZlZW1qeldFXzRyQ1hhUS1HQ0VVTzYtd3lQRU45eTRTcHFrc1lSbUNCN3c0ZThzNTUyaDFiRzFjREE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Denis, we hate to hear this. We're proud of Wallet 5.0 and hope it helps users better understand their finances. However we hope you find the right tool for you!",
            "date": "March 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "It is the best app for personal budgeting, but after the latest update syncing between devices can took couple of days. Probably, it is a bug",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRnR0SjFZX0g1Uko3OHdFY3lrYkI3MmI2a2N1TncwZ3A2NHhpemkxQmF4NWNmUm16V2hwTzJaeFl6NTJUZ045aDVMRDN5NFZBcGNMWmdSMVE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi there, thank you for your feedback, and sorry if you've seen some latency with syncing across different devices/versions. If you have a moment, please write to us at support@budgetbakers.com so we can check it further.",
            "date": "February 28, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "I like the app, but the thing holding me back from buying premium is that Midflorida Credit Union is not yet supported for bank sync. Are there any plans to support this bank in the future?",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRUMwRnZTODZOdHd5UlQyMXRybFdVUUJCU2FNaXI5V2tOVElwVjdyWGRQRnE4NHNkMFB0Vjc5QjIzZ1JHbnRpUmhpa0JLdW5ORFNZcV8xcWc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi, we don't have ETAs for specific banks, but you can help us to generate interest for your bank by submitting a bank request here: http://bit.ly/21VYiOR. Also, you can try our Import feature: http://bit.ly/2qnuMUQ. Thank you for your review!!",
            "date": "February 27, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alexis Carrell",
        "comment": "Its great. Easy to use and you can do backup on it log into another device and it backs up all your logs so you dont have to redo it. I had other apps that never d o ne that so thats a plus for me",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRlRTNGlXVFdDXzU3Q0hhenI0aHZmVVVDUFJSbDFiaEhDWU5nemY4dENGa200cDNhNWVPMWY1Tmt0elI2TVFjSy1WYVZHdXdBX001RmZOeWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Unable to choose currency for the current goal in the goals list, only local currency for my country is suggested. Unable to choose my country(Uzbekistan) and bank to add bank account.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRm1SQXcteXJGU0dXUWE1VEhDQ2dUdzZ5dTNrRXAzeGJjcE5Ud2NPaTRJZXE4N3RxUU5CTEdJY3VjRUVnZFVBeXllcmtoZE5mRm82cGp4dHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Adham Attia",
        "comment": "Great App, I kept searching and trying different apps looking an easy to use and same time features rich one .. and this app is the best I found above all. Just 3 things that needs to be done and it will be 100% perfect:  1- to have an account type as credit card where I can enter the limit amount, balance, and due .. currently I am adding credit card as a regular account and putting it's balance in negative which affects the reports when I transfer from my regular account to the credit card account.  2- when creating a group and adding a member, when I try to change the permission to read only and save, it doesn't save and remains on admin access  3- Please allow to add a label when creating a record, cause everytime I create a record I need to edit the record again to add a label to it.  Even with the above the app is still more than awesome, and I will keep using the paid version. Just hope you guys fix the above, but please do it so users can modify without losing or messing up their previous data   Thanks a lot and keep it up 👍  Update: I decreased my rating to 4 stars because of the support service, I tried several times to send them about issues and features request and they always give you a copy paste replies that are sometimes even irrelevant",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPR1JCS3l3blpYMXFZRnA3dHFNN1FsZUlEeDdGaHRRZzk0a0xlaGxtVzB4ZFhtYWVjWjZoWHdMVWtaam1ySmF3QXB0Tldtd3VlWkF6THdRX1E",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Adham, Thank you for your feedback and review, and as we said in our response, we apologize for our delay to respond to our large volume of support requests, we do our best. If you have a moment, please send your suggestions here as well: http://feedback.walletapp.net/.",
            "date": "March 1, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tekena Jim-George",
        "comment": "Great app for managing finances. I'm glad I downloaded it! However I referred people but I've not gotten a free second account yet. How am I to know when other people sign up using my link?",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRlUyQVdfZ2FfVjZaSTNrX3FzcEJQYXBuYTNfaTY5SXg3Z3lmTExTZjJMR2V0NjBJZkxkOHBGRTF0d2NZekdsWUN1UjE4N1VvWjlnOWZ5LXc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Tekena, please send us an email to support@budgetbakers.com with the subject line \"Referrals\". Also include your Wallet email address, thank you!",
            "date": "March 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Renzo Cornejo",
        "comment": "The new UI is terrible. Moving through different accounts is confusing and just not worth the effort. Uninstalling now  ..",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSEQtN2NDWVBtcWRSOEJGUWRiZ2x2TmFtbGJIZTJlcXdLMmRmZWxNZG83OGNLaEZrTUREczBUNlBtM1pIWG1reVRCR2lCcVZ0Nk5TUjNpZHc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Renzo, we are sorry you don't care for the new design; we eliminated swiping in favor of tapping on the account you want to see (http://bit.ly/2BNaiOL).",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Akhil Kawle",
        "comment": "In new version we cannot have different dashboard for different accounts.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPR290MjNvc2g4b1d2clBxQTFrdFM1ZnJEUlhTNUN3elU0V3hJMGROcGpOdmJKUDFqOVlWcUJtS2pIT0lKNzVyTHk1ZFdzdjFUMDBBRk9mQkE",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Akhil, actually you can, but instead of swiping you simply tap on the account you want to see. Check here for more explanation: http://bit.ly/2BNaiOL.",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Kody Davis",
        "comment": "Choose how to adjust your balance is annoying and an unwanted feature/button press we didn't want.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSGxlaEdsbmVYemVkUXRTUVF3NHI2WVhlZXJmZy1FYnVONU1UYXBERVRYWjF2OFA1dVE4T19RZVh2eHloeFpxYTZxTVluNlpsVER3VE9icGc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Alan Haw",
        "comment": "Expect for better performance and feature,  u guys done great job",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSG9qY3ZSRTY3SnZVbzl5alQzd0t0SnM3aU9ydHg1ZzFYRnZxdzI1bUk5VEdPNThqRU93eGdodEdSWUQwaUtJeVRXSUl4OGc1Y2RCNndnNmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chris Litherland",
        "comment": "The new and fresh 5.0 version of Wallet at first go seems to be more stable and well designed. I'll give it another go and see if it works for me now.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRUg3RnBDRUJYcnR3ODF1X1lfT2daWVd5ajc5WlZuMFdtM3RpekRpY2QzOVhOY0dROVZRV2pjR2Vic0p2dDlyZ1VaTGpvTzJwWXRaMjVFa2c",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Chris, We apologize for the inconvenience that some of these known bugs have caused. These should be resolved in Wallet 5.0. Debts can be partially paid, tap the circle icon and choose Partial payback. Thank you for your feedback and review.",
            "date": "February 28, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Here's an idea for the Wallet's marketing geniouses! How about... Each time that I need to look at the app's icon to have a popup telling me that this is a premium feature for just $3?! And then if I want to also tap the icon to launch the app, this should be an additional premium anual-only plan for just $19.99!!!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSHpMa3AxaHI3WHNXVE05TmIwWGVUZS1IeEs5Ykk2WDBNb1hXUXRmQjRSN3Q2YzVRNEFkdmdib0VWenYtTmQtdlROTmEtcnlBOGNPbmEzRkE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Sean Galbraith",
        "comment": "Awful update. Bring back old system. Waste of money with current 'update'.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPSEctNzktYTU0THZoYkhOZmlhYkM4akd0LVV1TGhveWp3MWdQNU9ueHhKNXpqZ2FWaGVOR2I5d3FubmpHVm5YZlFCUnBaWTNCbWRGVzVqcnc",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Sean, we're sorry you feel that way! We're proud of Wallet 5.0. See here for a brief article about the  update if you're interested: http://bit.ly/2BNaiOL.",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Andres Cobos",
        "comment": "I love this app, from the moment I downloaded the free one I new it was worth it. I'm getting married and its helping with our expenses to track down every dollar .",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRmRkQkM0Qkp3aW9NS2YwSTU4U1pIa19UVHZ4eG9OX0h0OWFoQmEyWHNDb2FUX2NKM2xfM0dOUFVzYnFDeXY2VHo0eEdpTlR0RVdXMlZ1RVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "cesar andres gomez garcia",
        "comment": "They have fixed all bugs as promised. Amazing app",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRmtfd2x0VTJkSHdMXzNpekFlWEZ2bUdmeHJGRFN6Z1NBNGl5QnhWSWNUaXlVRTFRZnl2Ni1NQWgwVXhPLW5YRmN1SjVnRXNLbHhwamRRd0E",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Hi Cesar, Thank you for reporting this issue, and we're sorry for the frustrating experience. We have a new update coming any day now that will fix the Export crash bug and related issues. Please keep a look out for it.",
            "date": "October 31, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Roman Voronin",
        "comment": "Android wear app still doesn't work(",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRVU5NUltMnh5cUZHM1B1OFAyc0RQLTdHU2dMZlJXUWNuSDM4aDB6bjlZVXFfR00wNW5NaWV0aWg3d2VoN3R5RkRDcldrei1Tamp6TW1YN1E",
        "reply": {
            "author": "BudgetBakers.com",
            "content": "Sorry for that Roman. We may develop the Android Wear app further in the future but it is unstable for now. Thank you for your feedback.",
            "date": "March 2, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sinti Haze",
        "comment": "Ive just begun using this app-mainly to visualise my financial goals. I find it very useful that it makes calculations for me.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.droid4you.application.wallet&reviewId=Z3A6QU9xcFRPRkRXanRFa042Uzg4eTRQdF9EcU96UWVWTWxmdUhlcFg1enBSOFJGeXNKYnVIRkJ1UVViU1p1UjBGd2ZHVmdheGxGR0F2NGpzVjlUQXk5NWc",
        "reply": null,
        "star": 5,
        "title": null
    }
]