[
    {
        "author": "Andry Lumintan",
        "comment": "It's a great note taking app that integrates well with PC. The sync is INSTANT! It lacks auto titling for handwritten only notes, which makes it rather confusing when I don't put any title directly. Perhaps using date, time, and location for any new note is great. For SPen it lacks pressure sensitivity and that's all. I like the two pen color option, it makes everything done quicker. The app should also utilize the always use Rules Lines on new notes like the one on PC. But the most important feature is sorting notes based on date modified. If that can happen soon then it will be perfect.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSHo4RjRCRGZaZXRNSkFxeHFWN3dlWFFZMk9NaFpXQmdXVmNfRFo0ZlJlRm5CSzJoM3pYSHpINlZWTElLMS1FRTJKRjJQLTd0OXlZQTVlTWRJ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ron Ho",
        "comment": "Not Bad for a Free App Everything runs fine on this app. Tools for editting are simply designed and are intuitive for even new users to get used to. Especially, if you have a wide homescreen, you can make good use of its widget function. The only drawback I have realized so far is that there is no way this version and the PC's one can synchronize, and I hope this would be fixed in a near future. Thanks for a wonderful app.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSDhVeXllTmxIcG5fcWtKb25sY2ZfNEZlSndyZmhyeUxTSDk4YnVjV2FxTm00bjRac19QdjNfblVhUDcwVEdYWEZNc3h4alNtVXdSd3plM0J3",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Danze Company",
        "comment": "This is what I needed in a long time! This helps me with my homework! For example if my dad is using computer, OneNote is here to help! I can sit and do my work on my phone and then when the computer is free I can print off the same work that I have done! But one thing that I think you should improve is to add more editing details for example a letter size or font of it on the phones please!!! Thank you for the work that you are doing! I really appropriate it!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSHdqbDZaR1ZvalNUOGhPaGo5TGt0aXFfZzFQMVFneWlvVDFJZ2RWUW5FVW1pNWQ1TXJQM003ZHVsODhIVVJCS2NpWGZSWGZKbWwtRXE3TjNR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Cory Witt",
        "comment": "The newest update makes it impossible to type on my phone without the app returning my cursor to the top of a paragraph. Pressing the backspace key deletes entire paragraphs. This used to be the sole mobile app from Microsoft that wasn't entirely unusable due to bugs but it now joins the club. Will change my review once this issue is resolved.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRmxwNGViVV9xUGZabTUzeVNadS1lRENPVWMzNXVHc1lVMmZwUUNnYzZvT0RSOGNJNWNabEI3N3FJZmZWN19RbE5IRjU4aUw5TXRtMFNYLWV3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "It's a great app! I've started using it for professional reasons, as a personal/work diary. It works like a physical notebook when you have different tabs, only here you can have sub-tabs, which is great. I would suggest adding a few more sub-tabs in case one needs to expand their notes, the way a tree branch grows. I love the yellow text highlighting function, very helpful to make your notes stand out, and it's great you can underline, change to writing to bold or italics. I would just maybe also add the ability to change the font size and type. It's great as a personal diary too. You can upload pictures (from your gallery or you can take one there and then) and write underneath them. You can title your tabs, and the date and time is recorded automatically. Great job to the team who developed it. Would also be great to see the changes suggested above maybe. Thanks!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRXlDVGZuN1diMjlxcEZuV05TLW9Qbk84dnFvbkRSbnI4VEVOakRxTHpPNHI2eVFZNVItbHVUVWNhcnZkV3hWVnV4bF9oV3RPZmpmenRWN0U0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Cam Crea",
        "comment": "(1) We really need \"find on page\" search functionality   (2) OneDrive has a feature that provides a choice of requiring a passcode every time the OneDrive app is opened...can you do the same for OneNote? (3) When you hit enter at the end of a line, often the last word gets pasted to the previous line.  I have seen other users cite this issue in their feedback.  Hoping you will consider addressing these points.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRWd0RHJoT3l6bXdtOGlfRWZIdXc2SUduSFBwTVltd3dRRG50X0c3djFheDM3RXh4WHVSRm9nazl5ZWJFWUx5bm5HUG1COVFFZVhMRVRnQXFF",
        "reply": {
            "author": "Microsoft Corporation",
            "content": "We have fixed this issue with the latest update. Please update to app version 16.0.7341.1796  for arm devices and 16.1.7341.1797 for x86 devices. Let us know if you still face issues.",
            "date": "September 9, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Darren Greenidge",
        "comment": "I use OneNote daily as an amateur writer and never usually have a problem with it, but today it is playing havoc with my typing. I'm getting to the end of a sentence and the cursor goes back to the beginning of the paragraph and won't let me continue typing onwards. I keep trying but it keeps doing the same thing! I've even copied my entry and pasted it into a new page only for it to do the same thing again! To say it is frustrating is an understatement. If this continues I will have to look for another App elsewhere.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRUZtZGY5QWdmeW96WkVUQ1VXWVVmY01aeHJ3LTN3dFZ1XzNSTGlTOENRX2ZSSXViM251X2ZjaWNfWllqNU1SUnNNY1dRSTNuN1FHUXU1S2xV",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Andrea K.",
        "comment": "I really love the app. My only concern is that the way it types is kind of weird, because the letters themselves appear just slightly after you type them. I don't know, it's just kind of disorienting for me. Also, I've been having difficulties copy and pasting lists, and can only copy one number at a time.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSDRlTWpFbDRSQml2UjJIbjA1bF94czNyMnlCX2dnZXhvaHpoYjVmQ1U3ZHdKY3JpLUtOTERuNlA5czYwdFQwN2RlX2tXb3dxZ0IzMzY1bC1j",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Aleksandar Petrović",
        "comment": "Great as a service, the app not so much. The annoying bug I always coming across is when I want to add something in the middle of some text it won't allow me to type on a chosen place, but it always starts to type at the beginning of the paragraph I would need to fix at the middle or anywhere else... The low rating I gave for the app only, because as a service overall One Note is one of the best I know about...",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRm5OMFBhdE5XRkZRZ2lwa2RucUI4bFF4UHIwNFFwRmdmTi1FVXYySGVSU2xQbm5kdFpEcFhTRnRwRTVVYnNRamlBQnZqWWt5X3dIbnBucEg4",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Aaron Koop",
        "comment": "Great app but I'm having lots of issues on Android 8. Pages don't load unless I back out of the page and select a different pages then navigate back. Shortcuts to pages on the home screen lose their names and just say OneNote. A phone restart fixes this but it eventually breaks again.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPR2g5SmJTUEhGV0d2ekphdkZRTmV5QzRDazlmUnE0NWUwamNhakIwRUZUYlZUOTA4dXFfWEswM1JxUUZuZXpCUEYxbmpQVU9ETUN3SFc4ZGhv",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Cynthia Enciso",
        "comment": "Its a fantastic way of organizing notes and storing documents. I love to take pictures of print documents and upload them into my digital notes to keep everything together.  My only problem with this mobile app is its way of correcting what you type as you type it. I end up with frankenstein words or duplicates.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRVFoVlJWdnZSaWRCTjNKNWR6X3VDam10cFdDcm9EZ0o5QThIeHBZRmhiUDVsemFUcWlEbkJnSWE5Tk51Wk1WVXNNWV9TbGtNZ01BS0hSaGpz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marc Aarons",
        "comment": "Essential if you use OneNote on desktop. Mobile app's good for clipping content on the go and reading small bits of content. Not good for typing content though due to issues like being unable to easily copy and paste content using Swype keyboard shortcut gestures and general touch typing responsiveness. If you use Onenote primarily for storing existing content you find on the web, then it'll get the job done so you can finish on desktop. Definitely not a mobile only app though. Would be nice if there was a full screen option as well since the menu bar takes up quite a bit of screen real estate.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRkdxc2lmSFRYTDNkd0Y5amVFRF9MYXh4VVhnWUM0RFJBSnp4TkRjMW15TUtSc25vaXFCNWpWT2dEa0pydDkyTE83b19QVjg1XzJIaTFQcjFB",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Raphael Maenle",
        "comment": "It's a well implemented version of onenote and passable for looking at notes on the fly. The inability to minimize sections is a severe impairment to the usabiliy. Note switching in bigger notebooks can take up to half a minute when scrolling through  all pages in the book.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSFBZRlhWekVPQ05weFBvQlB6N3dSbDl5SGUtM0g5YmRfN0lEaHNWTEMtRzZKUWsxczFscFo4MFlzZlFFeVFTbC1tbUd5Ykktak5rWFpsSjFJ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Nathan Robertson",
        "comment": "I use OneNote on my laptop for school (the desktop version, not the app version) and it's awesome. But this Android app version sucks. It takes FORRRRREEEEVER to sync and it has extremely limited functionality. Would LOVE the ability to open notebooks from local storage instead of the cloud.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSDk5SjJNQ29uR1RzV0VHSmJVZVJCQ2hJZFRVc1lqUlI5QUxxZDh0OEhMemJzb3RVU0VZUGRIZVVENjNGVVk2Z25yMy1YM0hJVjBmVWtaUWNJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ruel Saunders",
        "comment": "UPDATE 2017 - Awesome app. I however have issues with formating on my Android devices. Compared to Evernote, the format of the information is never squeezed up on my phone or tablet.    2018 - I now have a Lenovo Yoga Book and I cant use hand writing recognition apps with it. Sad sad sad. The app I speak of especially is MyScript Stylus currently in Beta. This app works well in Microsoft Word.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRm52NHQxX25OWkJHbVgtZ2hNTUpWN005U1h6SzRRazRQbmZqX211cTFCakswdG9KaUdKZ1hpbGxtVHBqUEo3bmlRcV8zaWZOMnE5aFNRTUlB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Johnathan Harpham",
        "comment": "This could be the greatest and most useful app on my tablet, but it won't open. I've tried at various times during the last week and not once has it worked, just brings up an error message and tells me to come back later. I've sent the error report but until its remedied it's the notebook on my desk.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRnRMdUtrcUotOGJxeU5hSk1LaHRpeG8ycUxqeVhURVlGeVluM0xmYVVNM2JNVEdlYjVzOEpwVFFBT0xzSWNaMGxFQmJ3cDRwS09xZXhlNXlJ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "sally Teeling",
        "comment": "Actually preferred the older version but that might be because with Galaxy Edge it's always opening pages on the edge that are a pain to delete. Also when I'm trying to find a list or whatever it keeps opening new pages. But it's free so I should shut my noise.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPR1pNRnQ1NmZEUV9PcHlfczdlYjVJcnJqNW5OMEZzR0JuZjBZdFFvWXpXNnFTbVdBek4xOXoxUVU1czZmVXAyQWdDUHNsTmlMQV90UTUzcEhF",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Kevin G",
        "comment": "This app is falling apart. If I create a new page on my phone, it doesn't show up on any other devices. If I use the share function in my browser it will just hang indefinitely until I force stop it. Then we have the \"conflicts\" I change a single word on one of my pages and for some reason onenote won't accept that this page is the most recent version.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRXctaG5MMXN5VWlYX0thRWJ2UEI5Nk5zd2VqLUJCMVVIOWhDXzRTQTFfNXVyeDlUSTNEVnctNmlTWXBWZFBqM1Z4eENIQUNRYjFGeHR2aVlv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Richard Senior",
        "comment": "It is now a useless...\"Krapp App\" Since update in Feb  unable to open a notebook without it shutting down. Just upgraded 1st March with no improvement. Time to look for an alternative app.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSFlGb01idVBOZ1RuSnFhS2NUalF5ZEY1NjZXc1d2RW9qcUNaWEVHWUVwUmI4dHdXWGlrdGUyNDRWMlVjOVZ0Ym51UmdDSEcxbnJmS3I3VFhF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Great note taking app. Love that all info is saved under my outlook account. If delete the app my info is not gone or lost like basic note taking apps I used in the past. So I just install the app on any of my two devices and continue where I left off. Nice clean UI layout. Great for school organizing and planning etc.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRTVpdl9BbGtNYjZvNzVXTlVaR2VEejVjMEZjN3h6SVdOMy1pOVVhSk04WXpTVTZpR0hFNzFUSVB1emZoUzlnTlNiYWtCeUJ0WW1LRy02eTVn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Abhinav Mahajan",
        "comment": "I installed this App because I was using Onenote in my pc as well but it doesn't move ahead from \"connecting\" and reaching out to support seems more difficult.  Big thumbs down.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSGVVcUt1RE9oTGd5VV96Z2JiQllFQlM0RVRnRHN4Y2Y1eURhdTQ2cW5lbU1IWGtkUVRLQ0VSTFkySkUteFVQU2JUWXoxMHpEd0FISW51bVRn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Destiny Lewis",
        "comment": "Couldn't even type as my keyboard would never pop up when I went to use it. Typing was slow and glitchy if it worked at all. App kept crashing mid use. Definitely not worth the download I had it on my phone all of an hour before I got sick of it.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRzl3OVNCNHNOTUNDSWg4WV92UExJQkpzMDl4eWJGeDJMRWxLeXc3ZE5PVjRWRUxCVHFVSUhsRG9aaXFJdzE3S1YtSkxWQ1gwaHJZWDB0d3NF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Charlene Poh",
        "comment": "Really love onenote but not able to shift storage to external sd card on my tablet. Please fix it as my internal storage is really limited! Update: new update for onenote with the lasso select really just spoils the app. Easily triggers when I write with my stylus, please bring back the old onenote!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPR2gydy1rVFFpZkRwNWRZU3lBTVlfTGw0UWpZUG9IbEIwOTR0VEV6dUhPbG4yTGxyTHVTaldocEtuS212U2J2b0s3cmllV1J5LTFwSkJSMzhn",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Brock Archi",
        "comment": "The recent update is very glitchy. I like now having the lasso option, it is so helpful. But the app still needs a little work to be as good as the IOS or desktop version, but has greatly improved.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRm5NaVkwbEFwQlhKdmE3b0RCcVlLOERGZVJiZG54NGpVa3RrdEFIcmdYdVU4blJxczkzR2swYklRaDU0dmpRNHg5bGNGb3VoRy00eGY4Y3RZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "eduardo ponce",
        "comment": "Was asked to download it for work. Not once has it worked. Always get an error code while \"its getting things ready\" or whatever it says it's doing. Tried reinstall, reboot, uninstalling outlook and any other Microsoft apps, but nothing has worked. Even the guy who was trying to help get it working for work started to get issues. Uninstalling since I have not been able to even use it.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSGt3UUpYaEE3NmlsS1NuWWN1ZFhMMkdhR0FLTTA3OFhYc2hSeTVteG1uUkwyTTFsSXMxX1BKNHZ2bk1LYTlJM3FZSEtrQmFlMjdFWHhtR3dR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "james true",
        "comment": "I really enjoy this app. Only reason for not 5 stars is If I don't wait for my notebooks to finish syncing before I add/edit, I cannot sync again and am reduced to removing the notebooks then adding back again",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSGl6eXEtYXBnX1I5T1dBbkRqM014OHlXX1JZZHBIUmhFTC1PWnZfaFcwWlE0cTNWN24wTEZ5NkhGWDBzYUsxRTd5a3dtYnZyd1l6c3lPc1RF",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "I like the concept to write notes and keep on my tablet, but it is kinda confusing to use but maybe that is me. il have to work my way around and try it more and if is just me, il fix review, but i love the pretty layouts.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPR0U0VXcxMi1CbkR6VUpFMWtmYmc1ekZNWEhRU2ZuZVh5cEwyb3dUVkItYjZzVzVKTTUxaFZzeFd2b3dJdFJUTXl0aWhIYnBoUW1GTVZFa0lZ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Daniel Kreider",
        "comment": "I like OneNote and use it a lot. This latest update is proving to be a bit buggy though. When I'm typing text on a Galaxy Tab S3 and attempt to go back and insert or correct something in a previous sentence, as soon as I begin typing the cursor jumps to another place in the paragraph. Usually it jumps to the beginning of the paragraph, sometimes it's random. Sometimes, as soon as I begin writing the entire paragraph is deleted. Please fix!",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRjNVajBwMV85cndHdmJpNzh2NWFldjItQ0xndGZVbFEtcFplQkEyVG0wLXk3RFRyT0hZQ1ptNVB2NUd4U0VoYVN3Zno5cDI3b0Q4N3FGZEw0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Tanika Mack",
        "comment": "I love using OneNote however, I just tried to login from my replacement phone ( Note 8) and I am not able to. I've used the app for years and this is the first time I've had this experience however, it's very inconvenient. I now can't login with my email (that I have always used) or see my notes unless I go to the online location. Please fix the bugs and errors.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRVBDaW5WdjFMSXpKV3hEMFBuUkhwNEY2c3ZNcHZGT0RjVFlGRFQ4UDFqNFVlc2dzTlJ1dXl3OGJGM2txd29BZnNGeFh5X3pQU2J6TVN2OFdR",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "David Grant",
        "comment": "It's useful and free but it's always been clunky. Every time I use it I get annoyed with navigation and pasting stuff, formatting and even worse, trying to find text. MS just can't do search on ANY platform.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRmQ0Ull0cXNiM0JsXzlTcHo0MUdoX3dGb1BaM1RSWmtZT3VoTW9TSEtwNnlJRTFDZVp6Nmx1SmxqMzBmbGdzR1V2MzBQX0RYdnQ1MDJEZFA4",
        "reply": {
            "author": "Microsoft Corporation",
            "content": "We have fixed this issue with the latest update. Please update to app version 16.0.7870.1767  for arm devices and 16.1.7870.1767 for x86 devices. Let us know if you still face issues.",
            "date": "March 15, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Since the penultimate update the support for S-pen on the Samsung Galaxy Tab S3 has been ruined completetly, even though you can resize and drag images now. The eraser only erases some unknown area 4 inches to the upper left of the pen cursor, not the one you're pointing at. After a while the cursor constantly jumps to the beginning of a note while writing somewhere else. Ink does not appear right on the S-pen cursor anymore but a tiny little bit to the left of it. Performance has generally become worse, as the app hangs a lot more. The 26 February 2018 update did not resolve any of those issues!",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRWNuaHNxd3RSMExpV3NYaE5zY2xYUXFxOXc3RzZwekRYOHdmblczWXZfMlRMT3Jualc0LW5QX3BmZUp6VGRNdFhrNWVqOXZFR2NnRHE5LXlr",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kristiina Heptig",
        "comment": "It's now so easy to organize my projects, files, idea boards, recipes, thoughts,and contacts...everything, really! Not only that, but I can actually find exactly what I need whenever I want to. Thanks for making this creative person's life manageable!🌟🌟🌟🌟🌟",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRUl5b2lDSzJVTW02REl4dy1RbHFOek1OSkZUYlNWbzZTOFdtTnZ2Z2luWnN3TzNxREpBeVdERERrQzljQUppajM2amZIZjhaV3EzYnpNdkRr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Todd Schreiner",
        "comment": "It worked fine for a while on my Samsung Galaxy Note 8. But now it is crashing all the time. I open the app and then try to go to one of my notebooks and it crashes. I hope there's an update soon. Even after the Feb 2018 update it still doesn't work on my Galaxy Note 8.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRkxJYVZNSkxucnh5LWtfRG10bl9wSGRDQjEtU3JCa2JPbVhLWVlXUEQzdGZlSnpLVTgzbXN1S2RpZlZ2R3hZNkp4SHVYbGdBaFlLM2pKVFlF",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Matthias Lischka",
        "comment": "Unfortunately the sync does not work properly. I use it alone every day multiple times on my phone and PC and get sync errors every other day. Would like to see some indication about the current sync state. Is all synced? Can I start typing? Is there still something missing that needs to be downloaded? Is everything I just wrote synced? Can I close the app? etc",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPR1cxbUxwQVFtVW05cC1wXzIxbml3anJSZFdFM0U5TzZRRWhEdnNsM3hmcWFRQldzQ1pUcFRTUEpxb3RWeDdLR0JPX3ZPSkRvNXBWUzA5aXFV",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jon-Paul Nelson",
        "comment": "It's working better than it was. I'm only having issues with the Android version. I use an iPad and that version works pretty well. The Android version is just buggy, and my biggest issue is it being a pain to sync.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRW5LVHFUMmNpYnVkcUxQczNrUXpWY3VITjZYMkpZUU9VVnRNeDM0UnJwcXJ2SVh0VVFpWDl6Wkpnc0xOSUdYNFZCSDdzcnFnNkpKVmhoUmg0",
        "reply": {
            "author": "Microsoft Corporation",
            "content": "We heard your feedback and we have an update which got released on Google Play recently. This update adds handwriting support, tablet UI and formatting options like font types, font sizes, alignments, and tags for tablets. Do try the latest version and tell us what you think.",
            "date": "August 21, 2014"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Gerald Louis",
        "comment": "When using the draw function, the page suddenly refreshed itself and I can't erase my mistakes. More precisely, instead of erasing the location of my mistakes, it erases the notes I made at the top of the page (same for selection option). Sometimes the undo button is not working during that \"phase\" too.   I had to close to app completely in order to remove the bug for a temp period until it happens again after an hour or two.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPR2MtVno4VEdhb3hOeUFlUEoxS2RYRGNMSU1PTzRybGdFQkZNSXN2V0JvYkxZLW9nOW1uMUtWRnZBWmtQRm1MTzBId1RKbXpIZnhfOEI4WlY4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "I have used OneNote since Windows 10 first came out. Its great for sharing notes/list between multiple devices/people using a shared One drive folder.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPSHUwMU14VXM2dWZncU1GeHZNMTNfeE8tVVQxdU1fcVFaR0gwME9uUGNxMUxpVDJXeklXNGF3UGt2Uk5RMEdtWVJhZld5V0NiUW16TGhjdmR3",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Peter Marcotte",
        "comment": "ugh, i was just trying to update a note, and for some reason instead of adding to the end, it inserted it in the middle, and then typing more just blew away the entire note. there doesnt seem to be an undo, and it saves instantly so i cant even load an old version. Uninstall! Unreliable!",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPR0JZaHJRcXBrZTNsUVB1VENNaE1hWHQtLTdQM04wb09zNkZfTnpKanVSMXNMZm1Sd2xzdldkNUxZTS13VEUyS1R4TmhxamJmT1lkc3YyYzNV",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "David Farquhar",
        "comment": "Update 28/2/18 - There seems to be a bug in the latest versions since early February where handwriting strokes disappear randomly when it syncs to the desktop.  sometimes it loses letters, sometimes parts of letters.  Result is some of my notes end up unintelligible, and I have to work hard to decipher them.  If this continues I'm worried I may lose something serious, not happy with this  Update 9/2/18 - Latest version is really poor.  Drawing on my tablet now shifts slightly as it resolves the drawing, and this takes half a second to do.  So you might start writing a word, and the first few letters shift while you're writing which is very distracting.  Its much slower, and occasionally the drawing stops working on a pen and you need to change pens then switch back again.  For drawing this is a much poorer version than it used to be.    Original review: App works well and is good to use. Nice to be able to handwrite on the screen.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRS04RkdMbnEyRDFJNnZkWlZwd0VMeUMwZWI0T0dQeU42bUVaa3BwZ01SM0NfUlNpbHl2US1jaGRBOGJtQW5xb0dyN0ZnaDREd0FDWVBnYmRj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "kundan giri",
        "comment": "The lastest update ruined the app completely. It hangs alot. Thought they have added the capability to resize images but support for S-pen, pencil has gone worse.   Please build more features for samsung s pen and apple pencil. Button should also be supported. I write long notes using my s pen. But the app hangs alot now and all my writing is lost.   Before the update the app handled ink better",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.microsoft.office.onenote&reviewId=Z3A6QU9xcFRPRkRfX25aazdIcXUteXVhTXJhdUNiRTM2eElTcjdWZ1A5Rkt4dURxN3hTd3MtTWxfeEZPdGxEZXlaWWhBRlRoUi1LeFk2anFQMnZUbHdOdHl3",
        "reply": null,
        "star": 1,
        "title": null
    }
]