[
    {
        "author": "Eddie Walton",
        "comment": "I'd like to see the app add an option to save pics & video to external SD card.  But otherwise, the interface of this camera app is by far my favorite of any camera app.  So very quick & easy to use.  I love that I can click just one button and video instantly starts recording.  Versus other apps that require at least two button clicks and sometimes more.  Minus one star for no external SD option.  I mean come on, newer SD cards are blazingly fast, so it should totally be a user option.  And so far, I have not found an Xposed module that works with this camera app to save pics to external SD.",
        "date": "March 19, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPR21uWmxzbDNYLUJNano5dFc5bnZkSVZFZFhHNTBnSHVRbTFIbFA5NHpwa0JXME1HRC1IbVQxeWVNWXNSb3p6SmFkZW9OVkJuUlJDRlR1M1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Chris L",
        "comment": "I love the camera, I have taken pics that I've never been able to in crystal clarity. I wish I could share with you to show you. However I am kinda sad I cannot change settings to polarize or do black and white, maybe even do some effects on it. It's my only disappointment on it. But I love the focus on it so much. I've got this pic at the tulip festival of a bee and you can see the pollen on his legs.",
        "date": "August 19, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPR0ZxMkpKdDRqLUlkV0lMc0hLQmQtR1RTd2c5MkpiOEpWSDNqWTNRR0JkSHFWUWdVRE5rSWdjdUFrM0pzbHdwRDJFWHZQMVYzd2JuY3JpUkE",
        "reply": null,
        "star": 4,
        "title": "Love the camera but missing things"
    },
    {
        "author": "Ayan Chatterjee",
        "comment": "Very poor update.  1. Shutter Sound option has been removed. 2. Picture quality is poor after the update done. 3. Storage location must be customized, not only \"Phone\" and \"SD Card\". It should give more specific option to save the pictures. 4. Auto Flash is not working every time. 5. Quick capture is not working. (Not sure if this problem is happening in my phone only)  It was far better before the update. MOTOROLA please get these issues fixed. I really liked the Camera features and the picture quality when I bought this phone.",
        "date": "February 25, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSEY4eGxPblhaR1UtTkt2VzMyY2tUQWNOeDZlNk5SRVY0SXd2N19uTEMxUXdEc2xfTGhYT0E5a2V6ZWx4UU5aU0ZoVnNkTnVkOXBDbkktcFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Dave Kidd",
        "comment": "Needs file size control Does a pretty good job with everything only problem is the file size. I recorded a video that is 2 min 40 secs and the size is 340MB. So that eats up my hard drive really quick. Same with pics.  Each one is 3-4MB. It'd be great to have the option to lower the quality from 1080p recording to 720p or something smaller. Don't need the best quality all the time. Besides that its pretty good",
        "date": "January 29, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRkpJSHpHdUx1ck5IRF9mNGFFTEhEN0prRFZwRFRBZjZrU0c5ZEdFNE9xbkdyZHJiZ0U1dmhNQVBlbFJWTUdleG1IS1g2UmVzOFNMYVd4dXc",
        "reply": null,
        "star": 1,
        "title": "Needs 720p video!"
    },
    {
        "author": "Svarnjeit Singh",
        "comment": "WOW. Focusing has improved marginally. I can say that now it is at par with iPhone. I simply love it! Now my only concern is the newly added feature, scanning of QR and Bar codes. Please shed some light on how to use it as I didn't find any soft key for this in the app. I unsuccessfully tried to scan a bar an QR code by putting my phone camera in front of the code. Please help.",
        "date": "January 16, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRVJaNG54WER1aW9JSGM0bC12RXpDOGFRT29wTEFXZWVUakdNNVBOTzhvMXlJVENjaVNxWENGYnBOdU5qQXV1RjhMdEVKUEo2Y3NoSml4akE",
        "reply": null,
        "star": 4,
        "title": "Loved the improved focussing, but..."
    },
    {
        "author": "Ian Disney",
        "comment": "I have 4 reasonably good cameras.  The Moto G 3rd generation takes the best pics by a mile.  I went on a cruise in the summer and my camera went walkabouts at Heathrow so I used this phone and app to take all my pics and videos.  With one exception they were all stunning.  The exception was the poor sound having recorded folk groups singing.",
        "date": "January 27, 2017",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSFdkUGdpSm9HcVFuN0RxdmpickF6bjNxb0hqUmhLLWluZjdMZmh0YmNyN1BBcndvRngzQjVNb1hUengzNTFKdmhMelpwbmhsQWRWenlGVmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "joydip goswami",
        "comment": "Yup we got 21 mega pixels but with extremely limited functionality. Like lack of controls ... like no pro mode where one can get a real camera experience. Well it is dead simple to use. And a nice one. But it didn't bring up anything special. More to it reminds me of my first phone Moto v360 and Nokia 6600 late in 2005-06. But I strongly feel there should be a full set of manual controls in this camera. It will surely make it the best camera phone. I can bet on it. And hope to see this in coming updates.",
        "date": "June 15, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRnYxc1JyQVBiTUZrelhPWkR6VTVHb0NSank4WFpqenZfUmVldER3R1NNaUoxaXc0WXBVVU5oQ0FNSEZ1dFRVVXFQUG1OX1pYeERwTTkyRVE",
        "reply": null,
        "star": 2,
        "title": "Lamborghini engine fitted into bicycle"
    },
    {
        "author": "jzuelch75",
        "comment": "Great camera, and great photos unless they are action photos; then it is blurry. Would love an \"action photo\" option. Also, I'm not having any issues with the shutter sound that so many are reporting. I muted mine without any issue. If am action photo option is available or becomes available then this is definitely a 5 star camera.",
        "date": "January 15, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRngzLVJsNmVRUFBPTmY2OHNndFNtMEoyRFFucS1PVk5GTXVQaERJeWlBSDNrR05CV1p5VU9KWGUzNkREYVFsZ3ZZZVJRUjBxM2laaHYzOHc",
        "reply": null,
        "star": 3,
        "title": "Good camera except for one thing"
    },
    {
        "author": "Sai Srinivas -ss kopparthy",
        "comment": "There's a need to add this important feature in the app: The brightness of the screen should not be 'adaptive' when camera app is opened. It should be at full brightness. Because if adaptive brightness is 'on' even when taking photos, it  becomes difficult to see whether the focus is good or not. Sometimes, i noticed that i was not at all able to see what i am capturing when i suddenly enter from dark room to sunlight. So, screen should be at full brightness when app is open. Please add that feature",
        "date": "January 31, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPR1c1b0tLNUo4aFM2OXcwTzduUzlpRHhjNl9nX0w2YzBJUVVFY0VmNWhjT1V0QnhhbXFveG5PakZqTkxoZHk2VWJKNnA2bHFOSTljeF9RNHc",
        "reply": null,
        "star": 1,
        "title": "Need to add IMPORTANT FEATURE IN THE APP"
    },
    {
        "author": "Arpit Desai",
        "comment": "Great app with additions that are useful, scans business cards, qr codes, etc. But it needs a dedicated Camera button to click pictures. It is not intuitive to click on live view to snap a picture. Also needs direct access to menus/ overlays rather than cryptic slide gesture",
        "date": "January 25, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRlRuOGJLNVQ2Wjk1ZmRFZUVMT0JNSzQ4MlpnUEFNTzFOOHd4ajhRSzRZMUx0TmR6Y3pDOUlXTHNiRzBObk9LdUhIMElQNEt5SGhJODBlOFE",
        "reply": null,
        "star": 4,
        "title": "Needs Snap button"
    },
    {
        "author": "Raeef Islam",
        "comment": "Fast and gets the job done. The app might be a bit basic, but it does exactly what you'd expect - takes photos and videos with no hassles. It also has a HDR mode, and slow motion video. If you really want to you can go into the advanced settings and get a lot more specific.",
        "date": "May 8, 2017",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRnR4azFpQlNDY0JEaExFdHdmZFNoa3lpUFM4b2VsaDNxTFQ0emZwVnpNcnFxbS1lRjh1czhIQjN2c0U4WHZDYWIyV1JSU0JPYTJkSV9JbVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "paras julka",
        "comment": "Please give an exposure adjustment feature in front camera video recording at least. Bcos it makes very dark videos in artificial light. It click photos well in same lighting condition as we get manual exposure setting there. Please add this feature to video too. It will become perfect camera.",
        "date": "February 16, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRVNLQVAycUlGTXE1Qk4tZHBROWw4ZDkzbXkwdWZOcjJUUHNLaFBfTmpVS1dzRjg5ZDNpUEFzTjBMWEVjZUtxOVI4RmpYM1JmXzVkelNuYVE",
        "reply": null,
        "star": 4,
        "title": "Camera is good but can be better"
    },
    {
        "author": "Prajjawal Pratyush",
        "comment": "I am using a moto g4 plus and whenever I take pictures in low lighting conditions it just captures the picture when the flash has got very dim and is about to end and I think if it would take the pic .2 sec earlier when the flash is bright enough then the pic would be lot better, for now I have to turn my flash off to get some good pics. So please solve the problem as quick as u can",
        "date": "November 23, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSGNXdlMwcC03X2hKR2h5eFg0ekZ1ZVJQN2RSS2FWMFlOSkdUNFJhX25kWGwyTHJ4SXJpTkU3d0pUVWI5aDZtZ3ZTYXpnaWdOWWZvT3Q2cWc",
        "reply": null,
        "star": 2,
        "title": "Having issues with flash"
    },
    {
        "author": "Arukstein Surs",
        "comment": "I like the fact that you can now manually focus and adjust, but there has to be warmer tones and different scenes. Otherwise I like the simple things you have to do to take and adjust pictures. I like the QR code scanner though as it means that I don't have to have an app for it. Why don't you include a quick translation inside the camera app without using internet and include a history for it? I know that's not the main point of the camera but it would be nice.",
        "date": "March 19, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSEJfRWNkUms5N2V4VllxcGoyNW5CVzNSQzZnSHgyYUlsU2w0bTc0TlcxSUJlQTlkVm5HZEdoRHpPTWZuSG9NZ0J2YkloTE9JdTlLVHlwVlE",
        "reply": null,
        "star": 4,
        "title": "Good app with one touch."
    },
    {
        "author": "Kaitlynn Hanson",
        "comment": "The camera and memory don't have a good connection. I loose half of my photos to a grey or even colorful pixelated icon instead of what I was actually capturing. When it does take pictures, they are great. I like the iso control wheel. It comes in handy when I need different exposures.",
        "date": "April 19, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRmZhNFhFTFRjTnVUNXA3clY5RlBPSjMyY1JPRmJMVGJTU2VzZHNKdXA5ME5BWGFoMURpSnIyMFdyMktUc0JnY1dkOUZQeElCVzhhQWMycFE",
        "reply": null,
        "star": 3,
        "title": "Good quality, poor application"
    },
    {
        "author": "Stefanie Henning",
        "comment": "Updating to the latest version disabled the quick capture on the Moto X...one of my favorite features....  Now I have a Droid Turbo 2 and the manual focus and exposure stopped working on the last update. Had to uninstall the update and turn off auto-updates. 😡 Give us a way to assign the shake to open camera feature to another camera app!",
        "date": "January 26, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSG1JNGYtOEdDaXAzQWc1dEdQSDd3WGVEenlQTERSUVl0SEZqQl9vWGZEa0hROWJmSE5Ed3I0WnNBYkNQSTB6d2xxUldlQnEyUzA2NXFkdnc",
        "reply": null,
        "star": 2,
        "title": "Worked... until the update"
    },
    {
        "author": "Meem Sarkar",
        "comment": "One of my friends using Moto X play and when recieved the Marsmallow update in last January then the 'Camera Sound' feature is gone from the option and he is not able to turn On/ Off the camera sound. How can this 'one-must-have' feature be removed?? There is no meaning for doing this. This issue must be resolved. Although its working fine in my Moto X 2nd gen (original model), but it must be fixed for Moto X play.",
        "date": "February 2, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRTVrbXZXUXZfOEQ0WHVlejd3OUhYOFJ4NnY5OWJTQmR6T2xIRUdjSTRsOXRpOWpKeENvWFZfQ2hXbVJlMmtTOU5xX3dvRUNFV1Y2ZnNVeVE",
        "reply": null,
        "star": 4,
        "title": "Camera sounds feature gone after marsmallow Update"
    },
    {
        "author": "Spencer Wolfe",
        "comment": "I'd like to see manual focus slider in settings.. I get alot of shots out of Windows that just end up being screens and through chain link fences that are only the fence. I know it's not a DSLR but I'd like to feel a little more artistic and in control of the focus. Thanks!",
        "date": "June 9, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRzRJQXNVTHNXd2FxeVZHVmt6RUw1MlV6LXIwT1M4S0hUTHNIOXJydm9zNTZtSjdFazlrdjRfZE5fR0N6U3ZIOXNCRThhZFlIdmhOdW04bUE",
        "reply": null,
        "star": 3,
        "title": "Give me something to focus on!"
    },
    {
        "author": "Bryan Jordan",
        "comment": "The focus is much faster and stable on my Moto X Pure. Prior to this update the phone would struggle to focus on occasion. Not anymore. Thanks Motorola. Keep up the good work. Now you just need to iron out some of the lag the Android 6.0 update brought to the Moto X PE",
        "date": "January 22, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRWpPNnh6ZldORVZDVF94Tm04SU1ENm5CTXl2djVPb3hZdHh4VWYxZU5jYzhxSlVkaUhwb0RkYlVqbGdSaFBONW95UTRTS0hsWEM3OFRxVFE",
        "reply": null,
        "star": 4,
        "title": "Much improved"
    },
    {
        "author": "Suraj Panda",
        "comment": "Very happy customer till now ..I recommends moto to everyone but now after upgradation camera displays good image but after the click image.......skin color turns to slightly greyish ....you can easily observe it in low lights.....the whole beauty gets spoil after clicking the pic.......please release a new update to fix this bug",
        "date": "May 31, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSHpXNTNCMm53S1l4cGs2bGJNVTJ3eHhsdHZTY1FWTk1WaW5IRFp3MnZ1Y1V0dXR5OUR3TmlMRTRwa3R0MUVUZTVkdWZlcS1ncXJRQWVWN0E",
        "reply": null,
        "star": 1,
        "title": "After clicking image front cam image turns greyish"
    },
    {
        "author": "Devraj Creations",
        "comment": "This camera doesn't allow me to click in low light. When I try to click with focus button it's gets smaller and don't clicks.. When by touching multiple times. And again moto camera needs some tweaks.. Please as soon as remove or update this version. Bring more suitable custom settings for phone camera",
        "date": "January 27, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSDFBSEVUNUhXMVdHakxLOThjV1M2dEVMUkZyVWZ2aThiQVllcmE1UFVGRGJFWWhIV204NDB0REZUUXRZSXBlblFrbWhlOW9HY1ZTTnZwUmc",
        "reply": null,
        "star": 2,
        "title": "Worst camera update."
    },
    {
        "author": "pradeep hegde",
        "comment": "Focus and brightness control has disappeared. It never shows up in HD On mode. Used to show up only in HD auto. Now there also it has disappeared and not appearing even after restarting phone also. How are we supposed to focus with this app if we can't even see the controls? Ridiculous",
        "date": "May 24, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSGJQR1A5U25jaXY5R0xrYU4zV044cnlHM1BBVlNhem1acm1xWjhqcHljNHJUVkhMZFg4Y2x2TGI2eGdTX2doVTVuQUNETkdBUWUzUUFsMGc",
        "reply": null,
        "star": 1,
        "title": "Focus controls disappeared"
    },
    {
        "author": "Ben Arneault",
        "comment": "The controls are alright for the camera's software. Not a big fan of 'tap to shoot' with this phone. (Prefer a dedicated button near the right hand side) But hey; the phone cost me $150, it does the job.",
        "date": "September 25, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPR3VmY1A4cWxzYzd2UnNaNkgtM1ZRbF9RTTRWdnNjOExDeXd1U29ycWw4WWlsZ2V5S21xU0J2clFaU2ZuZU5VTEM5TFhabE9EQ2NsVjBfeWc",
        "reply": null,
        "star": 3,
        "title": "Decent camera (Moto G3)"
    },
    {
        "author": "mayank kshirsagar",
        "comment": "Is it just me or the front camera is a total joke on moto x2. Images look decent in view finder but as soon as i open them in gallery.... I delete them immediately. Noise is waaaay tooo much even in day light.",
        "date": "August 10, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPR1drS3JkZHE3a2tSbHMzWTkydzI1YmF5dzdMVURodnJYTGFvM2owcWJNcEtpUXpyR2dCTEFyMFVyZVFOeVQxWFhVZGlFVmJSR05NRU5VOHc",
        "reply": null,
        "star": 3,
        "title": "Too much noise"
    },
    {
        "author": "Katherine Saige",
        "comment": "I think it's a very nice camera. I don't know why all of these people are saying the shutter sound cannot be turned off. When you slide out the options menu you have to scroll down, and it's underneath the location option. Mine was turned on after I updated, but I easily turned it off.",
        "date": "January 17, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSFg3X3gwMUlJQ0VDb2dUWDJnQjlRaW9MM2ptdmJZZmZOb0tHZGRXbHZPdm5ZNjExMVJEZUJHXzlFSVN4T0VaUmpIcUJnX2pBaldXR0E5VVE",
        "reply": null,
        "star": 5,
        "title": "Very good"
    },
    {
        "author": "lhines2004",
        "comment": "I love the Motorola camera app. Paired with my Moto g 3rd generation it takes amazing pictures. Unfortunately from a new update, I can now no longer switch to SD card. I don't know why considering my phone knows it's in there. I hope that they can fix this somehow. But other than that it's a great camera.",
        "date": "February 26, 2017",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRWROUmlMY3lXWjFSV3dVREdWbFl4cVNNNWdfamJIbFF6QlV4eU5fT3VVTGpPWC1kdlU5VXhMMmZOMVlXUjRqUjNnVlg1NXRWRlVycjdwNWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Cooper Dahle",
        "comment": "There's no way to change things like saturation or white balance, and there is no way to do a time lapse or 120 fps video. The camera on the Moto x pure is capable of so much more, so it's a shame the app is not up to par.",
        "date": "May 11, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRjYycHEtbGktbHkxVzhGbWRKLVB4SzJzRDZZQXQ0cGhSZU9rck9BbHh6b3BvdGtNeENTUndsNUxJZmhvSXdpVUVRMDdBLVc1VTlJT1V6ZkE",
        "reply": null,
        "star": 3,
        "title": "Lacking features"
    },
    {
        "author": "KHUSH CHORDIA",
        "comment": "I am using a MotoG2015(3rd generation).Earlier my camera used to work fine,but after the update I can't open ny front camera.As soon as click the icon which reverses the camera,i.e.from rear camera to front camera it says \"PLEASE RESTART CAMERA.\"I hope Motorola would make this app better.....",
        "date": "June 3, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPR0hxVUdESFJWWXAwR1N0aDh2V21vcjE4ZkhENXk0WGZ0R2NJcy1QYWFSaFdHRTNBM216MG9peFFCVDZyS0pFdjVhS1c0a09wekE5bV9Ha2c",
        "reply": null,
        "star": 1,
        "title": "Worst after update"
    },
    {
        "author": "Ayush Jain",
        "comment": "Please provide the option to off the mirror mode while taking selfies. It's very irritating thing that it always makes my selfies rotate and something like it changed the objects from right to left and vice versa. Otherwise it's a nice app. So please provide this improvement.☺",
        "date": "February 25, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRlhjQUxBOWZBekRtaWhCTlNUZlNxUFpKSF9vVXVKaGg0b0JISnA4LXdTWXlqNDUwd3IxUGpsYXpvSGZ6dUZBc3h4MkxWMTdVTXdzZHRrWkE",
        "reply": null,
        "star": 3,
        "title": "Still need more improvements"
    },
    {
        "author": "Joseph Quirante",
        "comment": "Camera was still working a couple of days ago then suddenly when I decided to use a QR Scanner, it didn't work anymore. tried resetting my phone, returning it to factory settings. non of it worked. it just keeps on saying \"Please reset camera\".",
        "date": "November 2, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRUVLWXQtdDlRQl8wOUZUWDEzajZ4c1NOMmJvNkVYX0FNbEJFYXdQRTNwMHRLWkYzdEduanlyODVCXzRrYVJIQ2JTVE5NNy1JdVh6eWNPMmc",
        "reply": null,
        "star": 1,
        "title": "No longer working..."
    },
    {
        "author": "Dheeraj Rajeevan",
        "comment": "There's a problem with the timer. When I set it for 10 seconds, and walk over to stand in the picture, I hear the snap sound perfectly at 10 seconds. But when I come back to see the picture, I realize that it took it way to early- a picture if me walking to the photo position- other than that it's fine",
        "date": "July 16, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSG5KWUh3WUQwa1ZtS2FQblBUcDBROUJpRzMtb2FsOUhpVXNUaC1JYnZNRDlseHRVZkdka3EwVHBqSVZiYTVLYndhTTk2d0RCVnpQdmFFWWc",
        "reply": null,
        "star": 3,
        "title": "Bug with the timer"
    },
    {
        "author": "John Daniel Prosper",
        "comment": "I don't know what happened to my flash on my motog .. it just stopped working. Any ideas ..Oh yeah it says flash or camera not rooted and when I tried to root it . It almost fried my phone.. my USB was just glowing I unplugged my phone right away. Close call.",
        "date": "December 27, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSFJKN1dQb3dqeFZSRVgtNjJLdTF5V2xaT3hPUDBMVUlNYkwxMThxbWZMWHVHbWJ0NEpqWHdsMFh6VFhIeG1QdkF1cHAwZVVQRjNnMTJ1OVE",
        "reply": null,
        "star": 1,
        "title": "Flash not working"
    },
    {
        "author": "Jana Smith",
        "comment": "Please bring back the focus control which was there before the last update. This doesn't make any sense and it makes much worse pictures. I used to love my camera but now I barely use it. Please revert it!",
        "date": "February 4, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRjkzU0U5VmZKY3pJSTNGcEJkT3hjTndLZ3BNaWZMR3FPSWMtVHNsSzQzLTVUU3hHazY2ODRyeHZsYWktV2ZEMTJfOF9BRVZ3NlhTNFMtSnc",
        "reply": null,
        "star": 1,
        "title": "Last update - thumbs down"
    },
    {
        "author": "Laurence Anderson",
        "comment": "Performance was okay at first, but soon the front camera disappeared and now there is no camera at all. Returned the phone to Motorola in Ontario for repairs, it worked for a short time then completely stopped again. Motorola won't do anything.",
        "date": "November 30, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSDU4OEVTcXFqSFBBWDg2OFhnXzlpRENZVm5xbDJIUUNOUG1BeEljNVBKR3Q4T0w4U3BXT01OMHlFMmRZZmgzZ1JRR1R6VXRrcGIyQVZSOFE",
        "reply": null,
        "star": 1,
        "title": "Simply does not function!"
    },
    {
        "author": "Cassandra Mattioli",
        "comment": "It went fine for the longest time .. than every time I came to take a picture, I'd turn it on, click on the screen to take the shot .. and then it would just tell me that unfortunately my camera is not working.. all my updates get done automatically.... Very disappointing!",
        "date": "September 13, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPR0ZTZ3h3Z2M0elh0M1gyaERyZDRJZ2dwamdXN2xwUU1UOV84Vy02ZlhjNWRhREhBTHBZZ295cjJ3emdYSjBHbkJiWFNEb3pYYmxQQzZkbVE",
        "reply": null,
        "star": 1,
        "title": "Used to work fine..."
    },
    {
        "author": "George Thanos",
        "comment": "This needs to be improved! The touch everywhere to get a picture is not practical, but rather irritating when pictures are taken by mistake. You could also add some additional pre-defined settings for taking pictures under various circumstances and in general more customisation options.",
        "date": "May 22, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSG9XbW94VHBlQVZ2SkMzY1liWURMR25jTy1jSUNSb21kVnppQjhSdS0taFFGYkVYUjAzdGQ3Z2dGOUNXRFFYVXJZRVdDZUFUdkUzOVpWdmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Karan Bhagia",
        "comment": "Not really happy with the update. Disables Tap to focus when HDR is on. Plus breaks being able to capture by tapping anywhere. Current workaround is using the volume down button as a shutter.",
        "date": "January 26, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSEZpaWs5WFFnU0NlYllGYkJOd2Q1WEpfaFhKMFJsRHVVZHlDX1VPWkJRb3dlSFpqVW9BVDZWeHlfZ2dJNnRBb1FiSTAxNEEzYjFuc1I3elE",
        "reply": null,
        "star": 4,
        "title": "For everyone unable to shoot, use the Volume button as shutter"
    },
    {
        "author": "AAKASH DAS",
        "comment": "Google please work on this...In Lollipop the option was a there but not in Marshmallow... It's very annoying to catch the attention of other people while clicking. That's why four stars not five.",
        "date": "January 15, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRVptYkw3bGR5N3dSaFp4WVBKVzF0YUdIYU9POERKYlVIUnExUVlDNlBSU3hERVY5dENEUnUwRU1TekF0bFRBZDZCZmpGaUU5UkdsZjk4Z1E",
        "reply": null,
        "star": 4,
        "title": "Unable to turn Off the shutter sound!!!"
    },
    {
        "author": "dinu paval",
        "comment": "Every time I try to start the front camera an error just came up and nothing. \"Camera busy camera unable to start. If this happens again, please power off your phone and restart.\"",
        "date": "March 26, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPSDB1WUh6SExRS003X2gzMHBvRDgtNGJSVVR2YjF3a2EwTUlmcDZWdzZVdTk5bVZNbjRJa3l4VlBNaFAtdzhnOVltRVVVU2o3LWc0MnJ5bnc",
        "reply": null,
        "star": 1,
        "title": "Selfie camera doesn't work"
    },
    {
        "author": "Dhaval Panchal",
        "comment": "Plz add more features like daylight , auto etc.. Need to adjust white balance also... Colour saturation is very less.. We need to add saturation or colour effect via other edit app.. Colour contrast is very less bcz of more whiting images... Plz update or add more features .. Need date and time also at the right side below ...",
        "date": "March 1, 2016",
        "permlink": "/store/apps/details?id=com.motorola.camera&reviewId=Z3A6QU9xcFRPRV9IenlndEhNU05VZmRlUTJrMDh4UF8xVGtzc0QyU1d4R1dneHBsZzBYbHpBRHllb2RNZl9jZ1JaRlM0Y1F3YWVleVpCSlpIWU1HOF9sWUE",
        "reply": null,
        "star": 3,
        "title": "Need to update"
    }
]