[
    {
        "author": "James Sharpe",
        "comment": "It's pretty good. I like it, but where does all the other folks come from on here ( Hangouts ). I've had wemen just hit me up out of nowhere. And the majority of them clam that they are over in some African country overseas doing some kind of Mission work for churches or just for their religion. And there parents and family are still over here in the states.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRUNhbW5XdkJsVGVjQnNOcWVQcVhjVklIQmFZaDZlZGhwSDZCa1FUbFZkMlZxcERlb3JMNzV2UWlUZy1IQUx6SXY0djRPaTVNajJQcjJCSlBv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lincoln Meyer",
        "comment": "Its an ok app its simple and easy to use. I dont like the idea of not seeing contacts online, offline or if they idle the app. It wastes time messaging hoping they reply. If there was online status it would be easy to know the person is not available.... the video calling has bugs like hell. Please fix",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR3JsbWFGdE8zM3FBM09za00ycnhjOEtxdTZoU3MzMEp1S05YQm1yVklDQUxyYzJhNGhNQzNsOHU2Y0hOYjZ4TDZIby1sUnREQ1JiN0Nkc19R",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "pilot 691",
        "comment": "Brings back very good memories. I met the love of my life threw Hangouts. I still use it to text him if my texting app doesn't work, and we call every day using Hangouts. I love video calling him. Can you please fix the issues with the camera? When I video call him sometimes I wanna show him threw my camera, but I can't because my camera goes on and off randomly, and there is no indication of this. The only way to know is if the person ur calling tells u. We both have Android phones and it happens to both of us. Plz fix it",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR01RMDBFbHJja2FkZ3BVWVQ4STBlRU9sdkdkWTdFSmZBT2c0eFlPNWJXN2hUcDFNNk95YnJEWlJ2M1dYbXdlWVdteS1IZmZVVHZKeV9TLXBJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Stefan Walicord",
        "comment": "Hangouts is amazing and pretty much superior to any similar system. Aside from the occasional bugs and so on (which might be my fault), I absolutely love it. Edit 2/16/18: recently Hangouts has been lagging and bugging out. I'm not sure why but I've taken the review down to 3 stars because of that.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR084YTZfQU4yTWE2bkNoY2hwUUp1MWNvbEdMOUZTaFRJYWVQV1pEZTByckJ4ekFIY1c3VkxVZjVVdEpROHR6MDN3TkJLaVlkWVdBYmxvTmVF",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Anand Patange",
        "comment": "Dear  hangout  let people contact there friends directly by knowing his/her email ID or phone number. Because here we are having option for blocking.  Those people who don't want this let them change privacy settings.  This is main barrier which opposing hangout to become number one Application amoung all chat application",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR1o1QWViSnVfbnRWSlFOdUx3SFctLVpqVXJ0RjQwMndZM0dzdGZkWWFCdnhoRUwyNS1NcEhhV2FDS2gxR3pOTXQ0M0hGVk5WWHNqeHpSSWlv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jatin Bandhiwal",
        "comment": "I don't use it at all but today i decided to use it. It does not even show people on Hangout. Me and ny friends both sitting on opposite sides waiting for our no. to show up on any on of our phones but nothing is happening. It is worse than i thought. The app is super, super, super slow in sending media. And after sending some pictures through it it has just stopped working. This should come in the worst apps for messaging.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRmd2emNyWl9WWE1fRk82aUtkVGpRV0htYVFBSUs4V0MwVEJscmRyMGNiaWdaUk5XTzhOSkRZb3V4cjdabEVpYVJ3MlozbDczMHczUWJnR3Rv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Fix Misleading notification via web browser connect i.e. 1. When connected to given web meeting link it states... you are the first one here giving impression i am in meeting. 2. Unless join the hangout button pressed it doesnot connect to meeting. Understood is 2 step process but join the hangout is missleading button when already notified you are the first one here in meeting. Wasted my 8 minutes.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSEt5dHBVS2VjckFRR2ZWSWNyYVQ4akNtV0ltaEhxUzZqZWhXSUp1dVZ3OUxNRjlPUDU2YVlhUmNCZHVsQ3FPb2FEdU5fZVBHelRkcVFheEkw",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "My favorite feature here is the group video calls. The only app by Google that does it. I do feel that development for Hangouts is either slowed down or splintered. It still cannot delete individual messages like in other messaging apps. Why not work on just a single Hangouts app and make that work properly? Most of the other \"Hangouts\" apps have very poor reviews.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRjg0ZGRhOGtxMmJxSFZnLXY4X1N5N3kzN2RfOTlUZy1Sa1VBZndocTRPVXFHM2hyUkFiSjR1NjNXRE5JU2FESHJzTE91YzJNSkVVV2pNOFY4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Foxbite",
        "comment": "An amazing app that allows you to communicate with people. You just need a Gmail to be able to use this app! I would have given it a 5 star if you could change your hangouts background in the chat to any of your choice (prefebly one from the camera roll) also I find that u have to set a ring tone for every chat. I find that really annoying! Hope u put my thoughts into consideration. Hope it comes truew",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR202UXFfQTRNZ2hFTkZ5cl9jMGpUWDZZQWVCZ0pjUW8yc3c3N2ZURF9FX3BGdWhRN0RwdXZNTEJ1ZzlvRV8yaFpMbUdmaWJyalVvMllZLUc0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lalekan Araba-Owoyele",
        "comment": "This is perhaps the most neglected of ALL the apps in Google stable of apps. The updates are few and far between and the user experience is generally poor. I'm surprised at the level of neglect by Google. As an example, the voice call is atrocious. I haven't used any app so bad.  I have never given such a poor assessment of any app I choose to use. Good news is that there are things Google  could and should do. Otherwise, let's forget about this app altogether.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSEVBQmF2R19saWtyZ05jTlB1TG1mX2FfYU1naURDYVdOUFdDMGlfeldvQmNGbTdGUlRMQlAxOElQNGlzbHVzTDhMa29wemRUX1ZhbkV2d2hF",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Barry B",
        "comment": "It is sort of hard to get into contact with a new person, sometimes it works just with their Google E-mail, but sometimes it makes problems and can not find certain people. Also it is not very wide spread so it is not that usefull.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRzUzUHdjSjVoeW1MR01TS2twUThjelI1YVc2d0ZXd0NvY1ZqLWpyV0xSVmZQcldRT3liVVNzYUZRc0JMMWN5TndaVDVzMW1OYVF2TDA5WFA4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Indriani S",
        "comment": "I have been using telegram, whatsapp, line, fb messenger... Now stuck with hang out coz it is easier to use to reach someone on gmail. And took a while for me to see if someone is online or not, and sometimes even when they do it just says \"active just now\" nothing precise/direct info like is he online now or not. Other perks whatsapp have i wish hangout does too are direct reply to particular message/and doodling tool for the picture. So good luck",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSFVUaGppNURBVUNPSUlZLVRnVHh0UnJXME9KeG5CUFA1TGRMTzVrcUsxYUpMblBDLXdfVzJySThhNWc4ZHBjeHJsZ0pJcWRqSzZaakJiYXRz",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Taru Gupta",
        "comment": "Having a really bad experience with the call function.. the call quality is okay but the main problem is disconnecting the call. It takes so much longer and so much time to end an ongoing call. Even if i restart my phone or turn off the internet connection, the call resumes after the phone is restarted or when i turn the net on. Please correct it asap",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRjlqeUVyYjlmQjhqbnhSZUdNQ2M2TUxSYkM5OE0wb043OGhqbUtIVXZWNUZMSTVsbW9wN1QtN1Y1ajNYSk5kTVZnbC1EQUc3b3pSR1BNZ05v",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "CC Gray",
        "comment": "This used to be good but for over a year for SMS messaging there has been an unresolved issue experienced by multiple users where messages don't go thru in either direction. No failure notice or anything. It has caused confusion and even upset friends and clients when you don't respond to their message (because you never received it, or they didn't receive your reply). Happens on all devices, including desktop. Really disappointing despite this having been escalated to support.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRjhkbDhYUkoyLVh6UlNDWUNLQ1FhcmpxS2ZxT2pPRWhTQlZSNEpBVUVBeHltbElVN3ZVc3dsNlNCYnVYbGMwR3NlOFl0RzlLVkFieEJWbXpR",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "kryptonite166",
        "comment": "Google,  This app was perfect a 5 🌟  for daily communication. I was able to use one number and one app for everything I needed.  So why would you break something that worked fine? The developors are losing sight of the users experience. If something works, improve that platform, don't build another one and force user to switch.  Technical vision towards the future is only good if you take in the whole picture. Please allow users to allow Hangouts as their default SMS service.",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRXdJUFdlRHdXNFh2cHV2U05xNnlmemwwZTBGcFFac0JuMXVha25CNGkteHVZM3lXTzgzYzRNcl9pdkVxOW5jWThzUmdVTFVfUXRqM2gzcnE0",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ed Cruzat",
        "comment": "No full sharing with Google photos. UI inconsistent. No true tablet mode. Mms bugs. User unfriendly way to save new contacts. Why does the ios version function and look soooooo much better??",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRVgzMTZWcmtvY0VUNEcwZ1FpVVJHeHpMTVgwVTE0X3dhcllObmZWUWpBN2xWaWlsZ3JKXzNwYjFVektTdHc4RGVMMjY1TXpWRWNMVjd4S3pv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Livy Animates",
        "comment": "I use it to message a lot of my friends, and it works well. Only problem is that if we're in groups, sometimes there's a glitch and the icon of someone that's not active will appear and it confuses everyone a lot, so maybe that could be fixed? Otherwise it's great.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSDZvUGlEdkt5aVNycUV3ZzQ3OWpLalpSUDBubHFmVHZuVjY0aHZzY2tLTU94WFR1dXJaMm5FRHdhTDg3aW52T3p5cklqZjV6RjBlN3lYM0ZV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Yo Dude",
        "comment": "If you can find a plan with unlimited data but limited minutes and texts, this app will be perfect, unlimited calls (with dialer) and texts over data. The only problem I have is that you cannot send videos through sms or hangouts message.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSG5feVZSZE9HRmRvd2QzS3NNQ2lpSk90NDlRLVN6eXd1dzNNazN5cHZLODV6b3VCMWc4dG5fcHFiYmxIWnJZWXZfSHRNZjdvTVNoVHZuM3Vz",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "The Watson",
        "comment": "Major Pet Peev w/ any App is missing or useless changelogs! The video really needs work, or it used to. Was so bad, turned me away from video. A shame cause my half sister is deaf. Its good for its purpose. I use the dialer more than the messaging.",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRjNVcjZCb0JUU1d3cTFwUjQwVmJwN2RFd1d4ekdGZXhSMnJPczhHbVc3V2F4dkpxZkpSNmU2SFF2N1U2alhCQm1NeHptQ3k1bW1GMlVpQ09V",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Michale Knight",
        "comment": "I've been having trouble with this app actually sending the messages to my G3 watch. It worked for a day but then the notifications stopped. I can see the notifications on my phone but if I need to reply over my watch for whatever reason I am unable to. Please assist!! Otherwise I get a lot of solid use out of this app. Thank you",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSDRiU2JjVnQzc1NoWVlndjhlQkxkRDQ2ZzNoTXhSRGhFajMwY0V6YXA5SWlYZ0lFbDBCZl9IVTRDQTg5dXNJanFoOFRkODRxZERsd3ExTDd3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "David Przybylski",
        "comment": "Still prefer it over Allo. If Allo makes available the stickers found in Hangouts, even if it's done just through the gboard app. Along with the read receipt within a chat be the profile picture concept over the check marks. Or at least an option within settings to have users choose pictures vs check marks. Love the group video feature, hopefully duo improves to include group calling. Until then, I'm happy with Hangouts. But all options lack the message lock feature that was found in earlier Android builds. Really helped save important content from being deleted when clearing messages. Wish it was available in Android messages, Hangouts, and Allo.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSGVUaUxYUWVVNmxUd21UZVdnLWhzS1o4OUEzbFZ2eVlLd0NzakRuV2hNRVNxcml5TnUweDN2TFNjNTlzSmtLRlRsb1pPaWpxSXdESm0wNGdr",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Cheyenne Applegate",
        "comment": "App is constantly crashing which is disappointing because I love the way it works on my computer. I'm using the all on my LG k10 from T-Mobile and I'm not sure if its the phone that causes this glitch or the apps programming. If someone can contact me to fix I will leave a much better review.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRTA4RERNVHE0RjY0dXU0RFkzOUNWTnlpblRuVTlnalFDMjdYZWZtZXY0VEZHVW8zYjVCYlFzeWxvTnhLOURBMGhvSTBtV2NDN3pCLVQyN0Uw",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Nazmus Sakib",
        "comment": "This app can't show the users last online time until 13 minutes and sometimes its more. After 13 minutes of inactivity it shows \"Active 13 minutes ago\". It's disgusting to wait for the person till 13 minutes to know that he or she is offline.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR0NCV0NkS19pZU9ZZ0hlRV9sdXRwMklzM0JFRlVfeG1BQ0E5eXp1UjI5a1JPQ0loNkc5b3psV2ZXYjI3NF9fUWlpSmhldTYwanFNUVFFbUlN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Justin Vanpop",
        "comment": "2/18/2018 update: still trash, now unread message notifications continuously cycle when in other conversations on the app. Sad how bad this app has gotten when there are no other useful Google replacements.  Old review stills remains true: I love Hangouts and how useful it is to go back and fourth between SMS and instant messaging, but this app has been neglected for a while now. It constantly crashes in the middle of texts, there is no search function for conversations, cannot send video files, compression of photos when sending and more. Get your act together when this is supposed to be a flagship messaging app.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSHI1NEtkUlRoTEhzVEMzRVY3MlN6SEw3Q09IZUZpbWNmdC13eUFOVlhodDVDWldneU41LXJVTTNQRGVvNWszR2otRHFCeXVGazVlNFZHQ3Jv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "All it does is give me \"Welcome to hangouts\" message. Pressing \"got it\" just gives me the same exact \"Welcome...\" again. Useless. Have to use old phone to use at all. Please fix. Hangouts is one of the reasons I gave my soul to google, ha ha.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRTlnUnZ1NWRxVlNCX3J4dEx5WF9BVzJUOTZpLTdJYkdfbk1QSVJuemZOT0IwdUk5a0pTX2NjLVRJYmgwck5Rd0IwQkFRVV9KbG5qdHRsMUFR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kiki Mellos",
        "comment": "This is a good app, you are able to text, call, and face time friends. But recently hangouts stopped and whenever I try to access the app, it says \"Hangouts has stopped\", and I am unable to access it. If there is any way the help this problem then please let me know. If I can get Hangouts to work again then without a doubt I would rate this app 5 stars.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRlFJT185aUZhdHJKWDRtT0FvcFBBaFhiUC1PeWppV2RWUjJiMlU4WDBEekphY0lhaG1lVGR2YllRRWEwRmVhcktIUlY1SWprVjNJZC1kU0hF",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Krystle Ashley",
        "comment": "Can't turn off vibrate no matter what I do. Really disappointing. I'm about to remove the app until it gets fixed, it's ridiculous Edit: Came back to drop my rating because I made the above comment three years ago and there's still no fix or improvement on my or anyone else's concerns.",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSHY5dG5SRHFYTWJ2WER3WUhpY0J0aFgyZHlVMDBXc2xHdTRZQWNLWFFRRjg4QzlkRlNYVmtSdG1RN2NLV1B6VGkyT0EzMFBkaWtLUUJQVC1B",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ala Hadji",
        "comment": "all Google voice calls use same ring tone. can't be customized. can't block numbers from recent calls list. calls should go through on ringer channel so you can silence notifications and still get calls. no whitelist option... constantly contacted by spam and telemarketers despite being on do not call registry...",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRjRBOUkyUUYzNG1yS2k4WnRGSnN0NThVZm1tVko2MU1HVXI4MjVaRDFhamdJSVVkbHJnVmF6UXFHZGFvTl9vNWlOd1FUMDVBM2xQTUdqaVpr",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Anthony Sevigny",
        "comment": "Over the years I've realize how horrible of a messaging app Hangouts is. You get alerted for EVERY SINGLE MESSAGE either in a group chat or from an individual, with no smart setting to make it only alert you for the first unread new message. This is unbelievably annoying, ESPECIALLY in a business environment.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRVI5cUk3bDQ4TElRbEY0Y2llaEJYaldSWFhzaktESGRjZjFNZUxpX19Cc3lPOFo3dVVxeGpJeldvZXNzS2ZGVmxsNnpRQS1SMDFMLWJMcVdn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Gábor Demkó",
        "comment": "Hangouts often not ringing when calling someone, or on pc still ringing after already joined to the call. Happening for at least a year. Other google messaging apps are also a mess. I am big Google fan, but switching to other messaging service.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR1MtVDd3MVVMeS13NEFvYUJaR3F1MUg0MnlKdEQ5NDFONjdYbnYtblJGa2FVQXRoZzBfdDJGMnNOZHpzZ0p3S0ZtTUNOSzdUQmJXZmhIZHY4",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jesse Brooks",
        "comment": "I wish this was the only messaging app and the system wasn't so fractured. I like that it saves my text history but you need a Google phone to access that feature now. Lame.",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSHYzTW4xblo4aUJzY2F1NXRHQWhVRjdNTi1haHdlY2ZIbW5uUG1oR0VrOUhBd0dmMHJkRlZkOTJja0dJY2Eya2ZCMGt3VWlYV01DVGVudEJ3",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "laurie kir",
        "comment": "Apparently when you uninstall an app, your review disappears. Hangouts will not end calls. I tried force quit. I uninstalled. 2x. Even powered my phone down and restarted. THE CALL IS STILL ONGOING. So. Broken. Seriously.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRUtWeGt4ejlUV3djMm1FUk52S0RIVzhnTWozNTNCMi1VeDZiT05uMV92clJIUTV2U0lTMmJMdzJyaEkwV1J6cjlqaHlxTDJHMXZWR3Jld2RN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Gaurav jain",
        "comment": "Some main popular features are missing in Google hangout app... Sending documents is a must have in hangout, Google drive link share is a way more cumbersome... Person last seen should be there in hangout.... PS, I know google allo project, but it lacks chrome or pc client.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR0lVd3RLSndTN2YyeVpqOUY4em1oaEt1YkRvcmJHR3I4V1V0cWhqRHZrWTBZWUw1ME5IcU9FZzRwVThZTFZCQUxqOENZNV94RkhrZGNtWXJZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "No name",
        "comment": "Everyone pretty much already covered my complaints. Hangouts was great until a free minutes ago! And \"uninstalling updates\" made it worse because then it went back to a primitive looking hangouts.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR0lMMWdxY1VZcUIxSHFaV1VmWTBNWFpVbWpvcmlkSTdLbGpxSzFfRWVqNzdPbWlDcHREZTNDZElkV002RXFLamtJTm4zWVpuUzZmckpzX3BZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Utku Türer",
        "comment": "I am having very poor video quality. At same conditions Facetime gives superior results. It does not compress videos and images such as Whatsapp, so sending a photo or video takes ages. There should be an option to switch compression on/off.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRjFtc0pXYmZaVWxfS0piVU0tbGE0LWRFQzlqLWNfcVYydGtad3VNQlhfX0lSZEw5OGctZVJBbEM3WWxEN0hQTjBuZEpJb0NzZ0VrcC1NeGlj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "david stevenson",
        "comment": "This is probably in my top 10x favourites, and I wouldn't be without it. For contacting friends & family in other countries for free, and being able to share data in real time. Not to mention the fact that it's also really slick & simple in operation too.",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR2lKTHlyVDU1U2p3bWdqeWFPZnYwaGtWdlBNc04tamdwWHhjTHhrcjdOZlRKUXFNOUkzVnV2R2V3dGRreV9qYmVxcFRGaVUxaGhEVWxTd3NF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "XEdits",
        "comment": "I lowkey hated the app because when there's an new version u have to update like there's no way around it. U can't even txt ppl no more",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPR0hNMm1JeVczX0w5VDJVb1BJcHJ3RWdZUXBsektObk96aEY5TWFhM0p1WFRKNjJDYUdhY2VJSm9yRTZGMXVHT3IzSzlvVlVVb18xLWFIaVVZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Suzanne Lampley",
        "comment": "My greatgrandson has met everyone in my family that liv e all over from California to NJ NY to Georgia Florida to Canada! without hangouts this little handsome genius of a three year old wouldnt have met some of them! Its great we love it and thank Google for sharing it! He is the best thing that ever happened to us the beginning of our 5th generation along with his beautiful sister Princess (my name) Nivea! Greatgramm loves you guys round and round and forever!!",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPRzhVSWZhTk1HZlhraENDOVlkZnVFYmVTNTU4T01zV3EzS3AtX2YzS2gweUhCVm91cUktR3E5N3RBanZJNlhSZkF0UjdCaTIzQ0dfQmY2S1VR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Janice Bush Norden",
        "comment": "I never know if the person contacted me tell hours later. Can't backup messages and save them . I have a google contact that won't be removed from my contact and I've even blocked that person.  Plus I was scammed out of about 20,000.00 dollars on here and Facebook messager and WhatsApp these people use these app. To pray on hard working people.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSFVpM2FyTTdYLWUtbUhRM1I2MDVhandmR1FvOVEyYlVvb0hYZzZJODJ6LVJ3TFJQd3BISzQ2UnRVRXp5N3VmWm96Qi1pSnIxaDNjdEo0MjFN",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Rebecca Ramirez",
        "comment": "Because I have project Fi, I can no longer use Google voice with my work number. Now I need to route calls through Hangouts which is a huge pain. It won't load my contacts and I constantly miss calls because the app won't ring. Disappointed in the fact that I have to use the app at all because of the google voice issues. Hangouts lacks functionality making it a poor solution.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.google.android.talk&reviewId=Z3A6QU9xcFRPSEhxamNoeko5RF9ETTRjUWs2dHRFcDZSMHlicm9YY0sweU81TktfWlMtS29CZVJVemZ0bFlaakFJUjU4Y1o0cm1MdHBybFFxd3Z3NjI5aE5V",
        "reply": null,
        "star": 2,
        "title": null
    }
]