[
    {
        "author": "Graham Taylor",
        "comment": "I have many issues connecting my Nixson to my S8+ the app is completely bugged I can not even add my favorite summits because it fails to find the device location everything does not work in the app.",
        "date": "November 14, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRWpXbTJjQ2FIMGNnbm9sU3pITndWVUpYYnMzSWZGZjJ4bWhpUnNFbkJ4dU12Tl9OVEF2RXd1ZkhOWGZsZ29kNk1kMWlWcnJndGZEUGxrNkRB",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hey Graham, See other replies but had outage which is resolved now.  Need any help visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "November 21, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Ok i have had over 5 conversations with both Nixon Europe and Nixon UK they simply do not appreciate that the IOS app is buggy and also when installed on the Mission Watch the information does not update its very sporadic to ask Us to drop over £340 or $400 depending wherever You purchased the watch from,that this level of ignoring Your customers is not on i urge other Nixon Mission owners suffering the same levels of frustration to force Nixon to do something about this work in progress app.Very,very disappointing. UPDATE!!!!!!!!The App on the iPhone 6S simply doesn't work on the Surf spots but as before the Snow spots all load fine just doesn't make any sense has anyone managed to resolve this issue?",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPSHNzOU5HemROS01CbVNURVdTREpncVdFaUdFVDlWVVJRd1ZJNDFoWFRZMWtqSk5tLVN5NkV4M1dTeWhUUHo4dkZOTUdnNE8xSFNNYVRVZmE4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jeremy Webber",
        "comment": "I'm submitting an updated review because you guys have really stepped it up recently. I had to return my watch for a few weeks for service and when I got it back, it's working way better than it has in the past. The recent updates to all of your faces make them more usable, and the usability of the app itself and how that info displays on the watch is more stable. Only thing I can request is that there is additional information displayed on watch faces when they are in ambient mode. Other than that, keep up the good work!",
        "date": "July 25, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPR0U1eUltRTJSVG1JWGNiSUpQbGs3aTBiSjcwOVF5QWhIUnJxOEM2SnNrOGJEX1g3Z0RPYmsxZEwwVHhVcGFZc21nbF9tdkJaUTJNQXF0ZHBN",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hi Jeremy,\nForecast is pushed from your phone app to the watch, so if not matching please check connectivity issues.  The weather bug should be fixed in the 5/3 update. Need any help visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "May 10, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "emmanuel fernandez",
        "comment": "The watch finally accepts calls to be rejected or accepted.   Just wish more watch faces would be available otherwise the app is a cool.   not sure if is the os but I miss the swipe to left for apps instead of using the side button to access apps would be nice if they switched the change watch face that way.",
        "date": "October 2, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRUc4Vlg0azdzY0tXVW5oMTlsdE5GNDBvcGl6RVRZTzlDbFI5MWk2aDYxX1NHRmd3TDVkVng0UHlqb0xpLXRGS1FfSzR6TlVJc3Q5aFVHcDhJ",
        "reply": {
            "author": "NIXON, INC",
            "content": "Unfortunately call handling is handled by the OS and not controlled by this app.  For the inaccurate info in the Mission App, can you please clarify?  Need any help visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "May 10, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "laird stabler",
        "comment": "Would love to give it more stars but it keeps making me reset to pull the latest tides. And then the app will bug out and not pull the latest data. As the only face out there to give a nice tide graph on the home screen I love it. But I wish is would work consistently",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRmlJc0RyMndZSHJwbXdZbThreHM5ZmpJUUZqXzFDM2ZIYlBCS1RuNmZzdGp5UW9tZVdfQXJRbThjZFU1Y2hsOUtDbXJHOXkweUNnTUdZd2pV",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "David Reese",
        "comment": "Love the watch, but recently it has become a regular occurrence where it loses the connection to my phone, but doesn't tell me it did. Restarting brings it back, but I shouldn't have to do this. Problem fixed.",
        "date": "July 19, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPR2dpLU51R3RXaW9rcWp5Xy1IanlJNWdZeEJlNVVSQlk3alY0dVJoaHFic0kxOV9oWG9CaU5FN0RFT1k1WTl0WnRjTUFJMGJfdDR0T0lFZ1Fn",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hey David,\nSorry for the troubles.  We noticed a few crashes the day after the last update due to data refresh but have seen this is no longer issue.  If still having trouble connecting visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "July 19, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Thomas Warner",
        "comment": "The tide data is really buggy. Like other reviews it would be better id there was a degree of auto refresh of surf data. The app freaks out when going from metric and imperial. Watch great the app and its data source/phone streaming needs a tweak.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPR0pqUl9IYVlMVFA3bkxZSW9ocDNIVXJNcThfWmhCNTExWUtCbGhCdXFoV0lXUk4xdzVrY3ByUWpUTmU5X1htWF81S2dIOTAwSGZURWxNaElj",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Salvador Jalife",
        "comment": "Hello Devs.  It is very very clear you are aiming your product towards the surfers and skiers. But what about all the rest of us who want a rugged waterproof smart watch that just works??  A lot of us are buying these for our daily lives. I personally bought it for swimming.   Now, the app is useless for anything other than surf/snow info. Can't even configure any of the basics.   Also, most round watchfaces do not work with the watch. And I have to install the FROM the watch. I can't look for them on play store on my phone like on my moto 360 G2  So far not impressed with the SW side.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRkNKS25nUXhpTGM0YlJ4NVhoLWhsdEpSLTdkTXJ1WVcxT3RiVFY1U2NZd3NFQ0NsN2M1dklRaHk1RDREZW1fNHlXUjVfcnJCaDZoTTh4Nm53",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hi Salvador,  Understand, we built hardware that could be utilized by deve and users to fit personal needs without adding bloatware or software covering subjects we aren't experts in.  Please contact developers of apps that aren't compatible or let us know specifics and we can reach out.",
            "date": "September 5, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Florian van der Hoeven",
        "comment": "Please fix the app, I can't obtain a pairing code for my iPhone. Watch is connected with Andriod Wear app, and The Mission app is running and logged in on my iPhone too... Please fix the app..",
        "date": "December 7, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRlZQNGFGWnVLa2M2Mlczc19pRzdnV3l6ZlRmNE0zOGZfR3hVX1Jla2NPaG1iWkFWazdHMnY3cldGc0RvRXRPZElNc1pqTVdNYnVwSUNqM00w",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sean Evans",
        "comment": "Bought the Mission watch primarily for its surf features. The Mission app and watch face don't push for data in the background and so surf info displayed on the watch is  only up to date if you've recently opened the phone app (which I rarely do). Also, it relies on surfline forecasts which are typically wildly inaccurate for swell size for UK spots. Would be greatly improved if it could drawn on Magicseaweed or Windguru surf forecasts. Tide heights are also all over the shop. It often suggests that the local tidal range is as small as a few feet, when in practice it's several metres. 13/12/17 update - still experiencing all of the same draw back with not solution in sight.",
        "date": "December 13, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPSFJYZ0tQaXRsNHpTX25xXzdjSDJXSVMwR3dfNGMyblRxTC1kMDNVSjNOakdWVnlPTWFOZTNIdGYwV1ZKc2ZPRkNxSFV6bEhBWFAyd2pqbHE4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Chris Haines",
        "comment": "The app does what it says. The frequent updates are appreciated. How about a subdial/complication that shows wind speed and direction? The app already has the info, so it shouldn't be too hard to add. Thanks.",
        "date": "July 10, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRmdNYVpxcmNBb0VMN3R6X01jOW5VeXVXSmlRR1FXeXZDN0pZSmRCN1dUTm84ZjNOOXBsUUhsaGtLcG0wMGc4VmtiVnY3alRHODYzV1J1MEhF",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hi Chris,\nThanks for your feedback. Unfortunately only a few of us know anything about sailing here.  And though we didn't utilize all our hardware in our app, we still included them so users could utilize with their favorite 3rd party apps. So have at it. Any questions visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "June 5, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "johnny d",
        "comment": "I bought the Nixon watch because I read online that they got rid of the low bit ambient mode. I was so happy and it was a great watch.... Until.... They REINTRODUCED IN 8.0 VERSION!!!!  awful watch now. I'm so upset. Stay away! Run!!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRy0zRzdHZ2tiT2dxX2J0ai1lSkRDNXctTThJUjlfQ2Iwd1lWUXVGOFhRYU5TdzdhNEhoUkVveFV1aE44M0tnN2FFck1FUGhuc3BvVlRtWF9Z",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sawyer Berrie",
        "comment": "Used to work great, now the app won't open on my phone nor will it connect/open on my Mission smartwatch. Shame because it is a lot of wasted potential for my watch",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRl9SQ0lIdVdSQndXdU9HXzhzcTBnXzJYY0VJRnFGSHBXRk5lOGs5M25GaWVJTDQyMnZiZDFTM095NVF0ZjFTTmtPbkhmOG1FR24tUTRqcWY0",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Cliff Self",
        "comment": "I love this watch and the hardware (except that the orange has worn off parts of the NON-replaceable bezel after two months and it looks crappy).  The app and watch faces are garbage.  THe app constantly doesn't update my watch face for the swells and about every two weeks will just stop feeding data at all, requiring a factory reset of the watch to work again.",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPSHN3WkVTZDlKUUZRR25qVWRmcWNleHFWTlRiaXktUGtHaHNuZlFydWRZUk91QUNzQkZiNXlJVjQxbTBFcWVrN3ZQSnVfNDhNOW0xOGlTckU4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Tomás Costa",
        "comment": "What about an Ultratide app for Android? Why is it only available for iOS? I bought an Ultratide and now I don't own an iPhone so I'm pretty much screwed, I'm not able to use the watch because I can't sync it.",
        "date": "August 7, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRWg3MUpTLTF6dVhLWTVacWIwRFZlYTNBTVhBRUR3UDBlYVE5ZFZCakpHYlA3OXZQSkZiVFVodlZidmJJampEakhGZV93MzhnOHZGZ2p3ZW80",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I mainly use it for its style & to have my hands \"phone\" free alot more. Dont really use its full potential, but for what it is, it works great for me.",
        "date": "June 25, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPR1BMYU5ZaE82aFQ5SVVaLU14VjhqNHcwSzJWQmN3WHNic2hCWnBXdXRpS201eWt3bnNNYVI1aHMyOUJSaXhqRG1Gb2V5TW90LXlRbXNRVV9z",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Kelly Davis",
        "comment": "What the heck does this app do? I have what appears to be a top of the line 3oo.oo dollar watch that nobody can quite figure out how it is supposed to  work.    Pretty dumb...",
        "date": "December 25, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPSFRCY0NkcjhPcTNCVk1xTGcyNUdwaWhqYlhCd3ZoNnFqdGp2MW5BQzNLX3JlaTBmOVpMN3pPU0J0a1VkWXlzcG1TYlRXYnpmSGZlbkt1RmQ4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Phillip Blasi",
        "comment": "Everything accept the surf reports works just blank blue screen. Before that surf reports weren't even accurate. Very disappointed by the product. Update 3/4/17. Still having issues with no reports coming up and having to uninstall and reinstall several times to get it to work on my LGV20, frustrating especially on a day like today when there are waves all over Florida.  As of 12/8 still same issues the surf reports do not work almost daily and that is the only reason I bought this watch. Tried reinstalling and reconnecting but stilp does not work. Tech support with nixon is useless on this when you call in.",
        "date": "December 8, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPR29vTm44a01mdUdKZTVNaG1ydkZMN3d0RFhHZ2lxX0NmUVNvbzlZaHdMYmw0WkFpd25JMU1nSFJ4MTFsclhZNm9fNkJUR0steVowYWJRLTFj",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hi Phillip, We just released a new update 3/17 which should fix your problem.  Any questions visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "March 21, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "MrCheeseAdam",
        "comment": "When it works it's good, but I've had trouble with it updating on my watch by its self, and now I switch it on today and all of my surf spots are not updating, not happy as this was the only reason I bought the mission watch!!",
        "date": "September 1, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRW9OdWlpRmxGeGhYUldxRFJUOU91TlNpbk9ZYXVsRWlRZUhKUGVHbVhMaU5UWnV6Qmc3RkhhYndxRlBJZmJoZVNpX0dfek1EcDFfVGF4U0g4",
        "reply": {
            "author": "NIXON, INC",
            "content": "MrCheeseAdam,  Sorry for the delay.  Unfortunately those few days there was an outage with our data provider.  We alerted them as soon as possible and they were able to resolve and get back up.  You shouldn't see the same issues now. Any further issues please visit http://www.nixon.com/us/en/mission-support",
            "date": "September 5, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Drew S",
        "comment": "It's nice that it has all the spots for both surf and snow that I go to but the app needs an update for sure. Always says check connection but I'm connected and everything else on my s8+ works so why this app can't connect I don't know.",
        "date": "November 15, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPSHlCNk5kZ2V3UlVJQTdnVzlQSS0zM3hJZlU5bm9TYnJ4WjBuUDc0NGRaTzFUdXNFSnhienZIcVdaZEFjQXJlcmU0cWlFbGJ2S0I3ZU9IeTZ3",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hey Drew,  We had an server outage on 11/15 which has been resolved let us know if you are still having issues. Need any help visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "November 21, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Bo Hill",
        "comment": "I really can't rate the app.  It will not load on to my Galaxy S8...not only will app not load, but apparently rating doesn't show up either to receive some help...okay finaally downloaded after 12 hours...will have to rate later",
        "date": "September 14, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRUZuM0xxd2EyTG45dkUzbGV0RDdjUW5HRzdhelF0UEtyQ1c3X3JJdWtVXzlsclVEaThiT0tydERRcFBPbFhYSHd1OG1EVHZSbV9tNlh0V2Y0",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hey Bo, 12hr download sounds like connection issues but if still need any help visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "November 21, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Craig Joubert",
        "comment": "The wind direction is always wrong. The tide heights are generally wrong. The future tides (tomorrows) sometimes show 4 high tides or no tides at all. The details often don't load. Very disappointing app.",
        "date": "January 7, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRm5Ud1N0TkJWbzFOaVBrODVONVVIc2dDLVpPT2JGdFRzNjhYZjU4Z2dQaHVRRHZLblE4VmlSd3FsbDRoWS1LcDFSamViZWlJbWxWdlJ2dWRF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sol Chaser",
        "comment": "No data for various locations Edit 8-31-16 After new update, woorking great!",
        "date": "August 31, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRXdpbEVaYk1iRDlqZVRadjQ1dDNpWjBhM1p3QXhJUDFoY0NFNkJJV29kbmgzLTNUeGJXRkQ0a1pqSmZ3VjdOMU83ejlnU2VBeTNuNUtvbnIw",
        "reply": {
            "author": "NIXON, INC",
            "content": "Sol Chaser,  If you can be more specific we might be able to help you find what you are looking for. Any questions visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "March 21, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Thor Tepper-Garcia",
        "comment": "I'm giving the app two stars because of the following:  - Tide times are very inaccurate; I thought the vertical line on top of the wave profile should flag the momentarily level and time, but it does not (neither on the phone nor on the watch) - I do not get any wave quality like \"epic\", \"good\", etc. (as seen on ads)  All of the above applies to both android (tested on a Samsung J7) and iOS (10.3.2 on iPad Air 2)  Also, it is still not clear to me whether the \"real-time\" surf condition report actually means my watch provides me the current (as in now) info on surf conditions DETACHED from my phone. If that is not the case, then carrying around my (not precisely small) watch in addition to my phone, where I can check the surf conditions anyway, seems like an overkill.  I'm sure you guys can do WAY better.",
        "date": "September 10, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPSDR0Vlk4N1Vod2FNRkR2clVNUHJsb3Noc2pWNE5MMDZUSW51M00xRl9HMXlpRzZtSldxUEtCTlZKaDgzQ0FrZWt4cFlYY1g2eWVtNmJlSkNJ",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hi Thor,  Sorry you are having issues.  \"Epic\", \"Good\", etc. are from user reports so your secret spot may not have any submitted to Surfline. Real time data is passed when connected to phone or Wifi, unfortunately we can't pass you them when not connected.  If you have further questions please visit http://www.nixon.com/us/en/mission-support",
            "date": "October 19, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Ryan Giffen",
        "comment": "Getting annoyed!  Purchased the Nixon Mission watch/App in December 2016.  Since the Android update to Oreo...the App continues to not work.  I keep sending Feedback/comments to no avail.  Open App, it crashes.  Re-install...try again....crashes.  In sum, I can't use the Snow weather updates for my resorts which is really defeating its purpose for me this winter.",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRlFSSUo5enJaS2YxT3Jia1RpQTJ6bGphWTd4c3h0cEF0Qm1JblNkbEQ3aW1FeTlWa1M5WmZKSGt3UTJLU0VnQldVeEhCd1h2YlYxZzdZTHFz",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Stephane Sonier",
        "comment": "App is ok. The watch look really good but it have a low bit problem when in ambiant mode and the screen look dull compared to other smart watch (diesel and fossil).",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRVc2V2VHampmcjdYRVlMeG9kWmtHeWt2QkdrX3Znb2h1MDg1M3lJelJBLWROaG5VTkkwbWFOekk0c3NLQlp1WmpzTEdjM0lLcEVDWm83WjRV",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Mark Gray",
        "comment": "Hey Nixon... Let me stay by saying you guys have been good to me for close to a decade. I've had to replace and upgrade my tide watches as they've been recalled, malfunctioned or simply failed. With some cost to me and some to you. Finally the Mission. But this watch seems like no more than a glorified remote control with a few added apps like a calculator. Without being a true GPS watch all I can do is wear my watch and press start to initiate the phone. Usually the battery dies before I'm done so....... My time on the mountain is ended by taking out my phone to switch off Strava. And that's ok because the watch is too fiddly and small to use with a glove anyway.  Other than that, wearing it surfing, the water droplets cause it the react strangely on the touchscreen. And don't dare try it surfing with a long sleeve wetsuit. All I feel is the watch buzz buzz as it reacts to the wetsuit arm touching the screen failing to try unlock it. And since it isn't really a GPS, I can't Strava my surf anyway because my phone isn't waterproof or where would I put it and I'm not paying for another gadget.   Most of the time I keep it on airplane mode now to keep some battery life. Going for a run this watch also is seems redundant as I would love to not carry my phone in my hand as I have the watch but that's not how it works.  I get it you're keeping with the times. But this watch is below you. Looks kinda good but rather than smart its mostly annoying and stupid.",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRnVVQ0NSZ1BSd2tiVGNkeDM2aWxweVU0eEJad2tRaHAyVWNjbXFyMTRLRV9nZkhWYVFpZ2lSLXVQTnVROTlYYjJscXMyV0QyaS1mYm1xWlpJ",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hi Mark,  The Mission uses a Qualcomm Snapdragon 2100 chip with full GPS capabilities. So have at it. Any questions visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "July 19, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Alexander Sibilev",
        "comment": "Lacks a lot of spots outside of US. Is it that difficult to add enough of the European spots?",
        "date": "November 9, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPR2FsRFZDb0ZzWFBQRG1aU1ZrTE53X0g1RUhvWmR1ZjVjTVZGQzF0MUVWUTIySEFhZUE2RXFRSjEwSW5CQjk2andhdjBaYmRSLUVqQ0sySUFv",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hi Alexander,  We heard you and just deployed an update so you can get all European spots available from our partners at Snocountry.com  Need any help visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "November 21, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Bruno Pais",
        "comment": "Can't install the watch face on polar m600.   Update: Now I now that the watch face is exclusive for the Mission watch. As there's no other app in the market to track the surf sessions on android wear , would be great if Nixon would make this one compatible with other devices",
        "date": "July 28, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRlljaEpySUxrN1cxR042VG45M3NlYjJOQ0tHUS1oSEJrelgzQU9mcWRJSnNqSURnMl8xX244RzdndkE4XzRIc2NNWW56SmRVNTFRcDVsbU1F",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hi Bruno,  Correct this App is made specifically for The Mission smartwatch by Nixon so won't work on another device.",
            "date": "July 27, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "geok199",
        "comment": "Very good app but can you please include a surf spot near me?? It's called Agios theologos, Kos island, Greece..",
        "date": "July 24, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPSFZzcWc1NXFTWDRwaXlmM01waFNZU1pISU1Pa1VkUk5CVGxVamdMcml6aVRBVXlkMGtuNHZGazYyZ0RsOEU0bXhaNlpfWWVjUFdEQVNwUU9z",
        "reply": {
            "author": "NIXON, INC",
            "content": "geok199, Glad you like it so far.  I will put a request in for the spot but if you want reach out to Surfline as well as their data powers the Mission App.",
            "date": "July 27, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Martin Chapman",
        "comment": "Cool app, need to sort the tid times out as its not accurate enough",
        "date": "June 23, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRTVRZ0dfZVFwQnZkR0dINkpYcEJxU2RULUFkVEJrWUxsazFHd0RLOU90cWJNd2VwYzFidTBDZk0zWTU5SHNON0VUa0NianZfZndYT2drVjln",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Problems syncing with my iPhone to update surf conditions",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPSDBEQXRaWXEwSEp4N3ZBMDN6a0x5eHFSa0ZZMk8ya0tfVWtzaThsamFBZ09JMTEtMWVpaVVYUHRiU2ZlQ3VraTNKUXM5b1VKSjlQRGt6MExv",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Ivan Popov",
        "comment": "The application don't have Bulgarian ski resorts.",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRi1falRfXzhLcXlKYndJb3Z6ZXhzZV81ZTByRFhsZTR0SzFiVi1BajBxcTBIbEpXejF5MWFlbGhVNTRQUVA0X2VldnBMRzgyUWhHdWN2bHNR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "d",
        "comment": "needs a real change log",
        "date": "July 10, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRXZYWktPTk9HbG93U3Y5cFlvWm5XQU8zUHhhRjh4eWdtM2k0ZERhLXlFS2xDZW1oUF9JOHIxb2tQQ0xJVFhoQ1VZV1NzQ19yWVBDSlFYTDI4",
        "reply": {
            "author": "NIXON, INC",
            "content": "Hi David,\nPlease contact us to provide bug report on the issues you are having. Visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "May 10, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Brian Kelly Cox",
        "comment": "After last update, watch is restarting constantly.",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRnJRREYzN0VKSTNsYllTTEpZUjREeTF0M2EwM01ycjNwYUM4SlJleWpwZGNrYm1OdDlCQmhKSFFpWW1lMEhJMkJoWWpYUXNQaDlQMWJIUy1N",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Richard K",
        "comment": "Does the watch face work on Android 1.5, per chance?",
        "date": "July 14, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRjEyZlRicFJ1NEEtaUhFRHRCMVFKWnVJb0NUZ0VINUZJQWxZdzVOa1VuRUFNM0FaODNPTUY0bzc3bzJBZ21EZVUySE01TGtLbUozbFdWcHM4",
        "reply": {
            "author": "NIXON, INC",
            "content": "Most faces work with 1.5.  Including the Mission and Mission Pro faces.",
            "date": "July 19, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Nolan Piacentini",
        "comment": "Great app! super simple.",
        "date": "October 19, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRmlWcC1IdU1sMi1JdzhOUUxTLU9hb0p4SWVSYnVMRnBKYXUzaWpwRnRFX0VWZXhlUzEtUGVlLS1JNzBZemJmYVNfWXUtNzM1Q3FCVnE3cXNv",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Elliott Braunstein",
        "comment": "Bad",
        "date": "December 21, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPR1RlWndraFd3LXpYenZxTndFcU90R0xNcjdqbkRTZ3Npa1BwOFpCazZGa0hQSFF2aDlkVVE2MWR2YnV2Zy1kcHVNS1B2N0dHTWVSTXNhT1hB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ramon garibaldi",
        "comment": "The watch is great but app will not connect to my S8",
        "date": "June 19, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPR3RNR1FjVzJlTlo3aGZGSUY4UWNNTmNtUmJEaXAyemlZYlBDejg1NUozdmQ5dmhidXNkOWVBVDlBMzZaeklkU1FYT1A2WGtjYjZhNWlDeW1j",
        "reply": {
            "author": "NIXON, INC",
            "content": "If still having trouble connecting visit http://www.nixon.com/us/en/mission-support or call us at (888) 455-9200",
            "date": "July 19, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Geoff Barnes",
        "comment": "Finally can have the weather on my watchface...",
        "date": "May 27, 2017",
        "permlink": "/store/apps/details?id=com.nixon.insider&reviewId=Z3A6QU9xcFRPRVZobGhKajJZc0REZDhZSEYydU5ETDRlZ2VfeVJrMWU3U2pJMHlTbERxLXJ1VWdWakFJV3hPQUo0cld4bWJMWlhraC1HOURrSEFRVGRDVFFj",
        "reply": null,
        "star": 4,
        "title": null
    }
]