[
    {
        "author": "Tommy Kiew",
        "comment": "bought it but can't use iso and shutter speed. Samsung a5 2017. please fix this issue ASAP. otherwise I request for refund",
        "date": "September 14, 2017",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRVV1OEVPTXpnX0Y1ZjJrRmZTbmNtQTBOSlRiYldnNDVtd042X3lqVmJ3RzFRVEI1amtZNDhONGxPTmFETEE2Q0ZYcHl3eVluVEloYkd0a3c",
        "reply": {
            "author": "Rollerbush",
            "content": "Sorry to hear that your Samsung A5 does not allow for manual settings. Unfortunately, this is not something we can fix (Samsung decision!). Please note that this will be the same in other 3rd party apps as well.",
            "date": "September 14, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Vlada Djordjevic",
        "comment": "Excellent performance is the reason why I decided to pay for this application. But I have a question: Where and how can I change the resolution and aspect rate? Location and compresion of saved .jpg?",
        "date": "June 17, 2017",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPSHYyeTd6SnFGdVNzR1VFSkNRM0x2V0NRdkZhU2pQNWIwLThsVWZVbmtKcDFhNjZaTEJXc3JkSEhILTkyTG1jaHNJcDJ3WC1uRl9XeDZFYXc",
        "reply": {
            "author": "Rollerbush",
            "content": "Shoot will never degrade or crop native/maximum resolution or aspect ratio. We leave all post processing up to you and your favorite app for that. Jpeg compression is always set to a near perfect value to avoid quality loss. Location is currently not configurable (same as default Android camera), but we want to give you that option in the future.",
            "date": "June 17, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "khaing ml",
        "comment": "I bough this app .I can not open this app.why?My phone mi note 3.",
        "date": "May 17, 2017",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRjY5Q2RzWjZEYThjeEM2RmtWQ1lkT01Kekw1b1V1ajJDb25zdGFkNktpTGFCN2VKQ2M4SUZUcndMbkRybUc0ZVZuVldpSGxjRno1Rk9DYXc",
        "reply": {
            "author": "Rollerbush",
            "content": "Please send us a crash report so that we can follow up on what happened in your device (\"Send report\" dialog after crash).",
            "date": "May 17, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Jon Powell",
        "comment": "GOOD: **camera shows great promise, **developers are responsive, **app focuses on functionality over gimmicks, **app is fast when it works. BAD: **app crashes unpredictably, **white balance setting on LG G4 does nothing - **app is definitely a beta product. REQUESTED FEATURES: (1) make white balance fully granular like ISO instead of jumping between fixed settings (2) ability to save to external SD card (3) bracket shooting like Camera FV-5 has -- customizable by exposure range & # of shots -- to permit REAL post-processed HDR",
        "date": "January 22, 2017",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPR2Mwd1FxU2VHaEpscVdYdUFCZGdQUGNjS3o2UFZHOUdCczRJOTQ5MlhxenJaZEhOTWl3aXZKbXRxQUdiX0diYUhNRFJrdjlFdEZadzlZRHc",
        "reply": {
            "author": "Rollerbush",
            "content": "Thank you so much for terrific feedback! Also great to see what's prioritized by our users. This will without a doubt be included in a future version. Regarding (3) though, you should be able to use touch focus already (otherwise might be an issue to solve). Also, when manual focus control is visible you can touch for updated focus, \"AF-ON\" style.",
            "date": "January 22, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Drew Alton",
        "comment": "Amazing!!",
        "date": "January 15, 2017",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPSEt2LXItWktJRDluMHhwTnRTblRLUnc3emFGdTBwUHdzaTFUVVRBYzF2R3E3YllZMnVvMFNoNDJFdHJRQzBJN01QSEZ0SjJUM0pndXpuRHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Muhammad D",
        "comment": "But photos date are detected by Sony's Album app as taken in 2038 (videos don't have this issue), photos from other 3rd party camera apps never have this issue, there must be a date metadata (created, modified, added, taken etc) field the programmer forgot to fill. Also it doesn't detect my front facing flash which is detected properly by other 3rd party camera apps.",
        "date": "October 25, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRUlhTVhYYklmOUJ4Z0UzM3hta3R6Q0R6dHBPLXB2dHZHTjhnenBZeVRTb0dVVk9GZXIyM3pwdXNYcmRnYUszeldscU1rTXgySnQ0RTZGN1E",
        "reply": {
            "author": "Rollerbush",
            "content": "System buttons are not hidden due to Samsung (or similar) reasons - it's because we want to avoid accidental exists just when you are about to get that once in a lifetime shot! :-) Takes a little bit of getting used to, sliding those controls back onto screen. Will do more testing on Sony devices. Hopefully they will stop limiting their users soon.",
            "date": "March 20, 2016"
        },
        "star": 3,
        "title": "Good and fast camera app"
    },
    {
        "author": "",
        "comment": "Paid to upgrade, nothing extra added, very limited functionality",
        "date": "October 11, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRTk0UUhKczlDVmc0VzdWZG9OempLc3MyYllUNjZZZmFvUW1FYnRwbkpEMUJXVlgxOWFMZDNINDJmVDBvWnExRWNtMFZGRmk5Qk5wbFVnSFE",
        "reply": {
            "author": "Rollerbush",
            "content": "Exactly! We want you to be able to test most of the application before buying it. Also, we focus on doing what a powerful and professional camera needs to do well, instead of cluttering the app and user interface with tons of gimmicky things that do not improve your photos.",
            "date": "October 23, 2016"
        },
        "star": 1,
        "title": "Pro version"
    },
    {
        "author": "Costa Kat",
        "comment": "Yeah, convenient controls that stick, RAW support, shutter speed, white balance (not digital, alas). Live preview, of course. Sadly, controls are a little too accelerated, hard to adjust precisely.",
        "date": "May 4, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRWY3czJxRzk4bXl2cFlhZ3owcEVETDMtMDZMR1Z6bzlwN0JkRDZWMW9jcTRiTy1NZHhSelVDNEt4YlJUbElpNGhRVzV3YkRxdW56VkZDLUE",
        "reply": {
            "author": "Rollerbush",
            "content": "Thanks for your feedback, we really appreciate this! We're looking into maybe adding an alternative control (to the slider) in a future release. Want to find the appropriate mix between familiar UI, control and simplicity.",
            "date": "May 7, 2016"
        },
        "star": 5,
        "title": "Just what I wanted - DSLR controls"
    },
    {
        "author": "Randall Chia",
        "comment": "Good interface so far, my suggestions for improvement would be:  - allow saving to SD card (android storage access framework)  - shutter sound should come AFTER a photo is taken, not after the shutter is pressed. That way the shutter sound can be an audio cue for when long exposure shots are done  - focus override slider should have a little toggle to switch back to autofocus. Also on my phone (LG G4), i dont seem to get any tap to focus  - viewfinder frame rate should not correlate to the shutter speed because for example if you do 10s exposure, the viewfinder freezes for 10s intervals. Other apps like Proshot and Open Camera also suffer this issue when trying to do long exposure",
        "date": "March 19, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPR3FOMll0eGFVODdOSUJ2cko0VGdxeWtYMnpOc2tjN2FYeG05RXdlWlpHQ1RCWGtOMFJxSWpOVl91TXM1YktVakZqTUhRUXpvdTQ3clVoeWc",
        "reply": {
            "author": "Rollerbush",
            "content": "Great feedback! We've been working on finding the best shutter button feel. We have vibration feedback after image is saved now, but ideally, it should be one sound when exposure starts and one when it ends (but so far not good enough results). Focus with AF update will be added. Tap focus: aim shows up? 10s exposures are tricky, will investigare.",
            "date": "March 20, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "I love the interface and the customiseable shortcuts and especially the clip detection.  Please add support for the s7, currently it crashes after the first run and the resulting images have a strange halo, possibly caused by the api's broken \"sharpness\" which horribly overprocesses the images before they are sent on and has caused issues in other apps.",
        "date": "March 26, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRWVwVExKbVVHZW94TVphVlV2NWNFenc1ZEczNHlBa1B1dHQwVExKN3J4eWFJMnRWQ3RvcmRiTVFlY1lZTzF5Q2stZHhwWlBmWTkyc2FUOEE",
        "reply": {
            "author": "Rollerbush",
            "content": "See the crash you reported and will do our best to solve that one! Would be great to get in touch with you via email (plese drop us a line), to get some more details on the issue. Would be interesting to see an example of the halo problem also. Is the \"pure\" output mode available on your device? (shutting noise reduction and sharpening off) Thanks!",
            "date": "March 26, 2016"
        },
        "star": 3,
        "title": "Shows great promise and a great interface but crashes on s7"
    },
    {
        "author": "Andres Meluso",
        "comment": "Pretty straight forward app, still needs more api support.",
        "date": "March 26, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRkpKV3hEMFdWd01KRTZ1Z2hsWWdpdUV2YXFsSmJDanEzZkhEZzJOOUpXTHpDeHN6cXIxRDd2ajNyZTVOdlJDZG4zeHJkSXpLa183UTA1YkE",
        "reply": null,
        "star": 3,
        "title": "Auto focus not working on S5 cdma lollipop"
    },
    {
        "author": "Jerel Butler",
        "comment": "I am used to Windows lumia camera manual controls, they seemed faster and kept my eyes on the subject. Maybe I need to get used to this ones",
        "date": "March 12, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRU5Pb3Zjc3ZHbTdpcWQxdGYybDZrMWw5eC14RktjWEVLaFdPME1hVmlPT2tvb3laTm9MZWNDZDViVGRZOVl0enRhYU9NTGJUdVkwLU5kQUE",
        "reply": null,
        "star": 4,
        "title": "Interface is odd"
    },
    {
        "author": "Deepak Kumar",
        "comment": "Very easy to use controls. And camera interface is awesome",
        "date": "March 20, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRTktOWVsM3FQU1o1ZVpGNUZCNzVjdk9IdW1UaXlrNGdfUkpjc0MxUFBTQWRnb3RieHFiM3hCRTBfeTB2NHpaUHprS2dMcFJrclB5QjNYd2c",
        "reply": null,
        "star": 5,
        "title": "Good camera app"
    },
    {
        "author": "David P",
        "comment": "Just needs a better way to adjust the values besides a bar you can drag up and down.",
        "date": "February 17, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRVZOeXdfdUg0SVBrTDZNN0J6Vk04aWZIWTVUb2NFY05rbDNoLVZiVHViTFZUeUIxbXczWnV5ZW9ScnZ3MWIyUlBVVDBsdzREc2cySXRnRFE",
        "reply": {
            "author": "Rollerbush",
            "content": "In what way do you feel limited when adjusting values? Do you have problems getting photos properly exposed or focused (or is it that you want to set certain numbers)? What do you think would be better in the user interface?",
            "date": "February 19, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "cristian donose",
        "comment": "I just install this. Hope is good ... and I hope you will support this app further.",
        "date": "March 3, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPR0xJbGR1cENPRTZXNkh6cVdaNkpCdDU0WmV3enE3a09NejM0dXJTM0pmZHJPUHE4cXFrTU9ySjR5dzlDLUVSTGxMWFZ4U252bENYaThiOGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Alexander Fagot",
        "comment": "For, what seems to be V1 it is a good start. The app starts and shoots quickly and thats already great. The interface looks nice and clean. For the current price its a no brainer and I am lucky that my LG Flex2 (5.1.1) supports the Camera2 API. However for me to actually use the app, it needs at least the following features: Auto HDR and Panorama mode and at least basic video recording. Also it does not seem to offer a way to save shots to SD card which in my case is a total nogo since my onboard memory is already almost full. Also the app itself cannot be moved to SD card, please change that!! The viewer that opens when I click on the shots doesnt offer a way to delete the pics or move between shots. Let me choose which viewer I want to use pls. Also an app exit button would be useful! ;) For the future the following would be great: Timelapse pictures, something similar to Super shots in the \"a better camera\" app, Barcode scanner, something similar to apples live videos and more advanced videorecording features (slowmo, 60fps, hyperlapse, video bitrate) or addon of filters like tilt shift etc I hope this app develops quickly and stays fast and stable, then I will change my rating",
        "date": "February 8, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPR2tIWHdMQXpDRjRDTERDTmRmN296dUxvQjdfR2hCT3pxcDFsbG5XUEtTaDE1c09SSmxHVkZ1YXVEdEpUaWZWWDJlR1QyVDdoMzJPQjFkcUE",
        "reply": {
            "author": "Rollerbush",
            "content": "Thanks for all your feedback, we really appreciate this! We agree that Shoot needs more storage/installation control and this will together with video be added soon (1-2 updates away). HDR support is a bit further down our list, though.\nThe viewer that opens is actually entirely up to you. I believe you might have to clear some app defaults first.",
            "date": "February 8, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Adrian Ramirez",
        "comment": "This app is really cool and I'm pretty excited to see where it'll go in the future. I probably won't be using it as my main camera app simply because I need video recording functionality on the fly although, simply playing around with the app I had a blast. The overrides are super useful. Maybe in the future think about face detection focusing? Just a thought. I haven't seen that on any other camera app so far but your live warnings alone make this app stand out amongst the others. Excited for this app.",
        "date": "February 11, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRlBSYXNkOEE2SFkxMWFWb05RY1QtbjFzYUhPTV9wSXJleWZlWV9KNnhQYzAydjdEdWlmc2x2cnNmUFFKdGowc0JpbHNCZkJFbXpSSlREMEE",
        "reply": {
            "author": "Rollerbush",
            "content": "Great feedback - thanks! Video is one of our top priorities currently. Face recognition and more intellegent tools for focusing will also be added, but a bit later. Really glad you find the live warnings useful.",
            "date": "February 11, 2016"
        },
        "star": 4,
        "title": "This app is going places"
    },
    {
        "author": "D Nguyễn",
        "comment": "Another solid camera app. Has plenty of manual functions and easy interface and captures in raw.  I wish Google would implement its now API for the camera for the Nexus 6P. I would like to be able to adjust exposure setting and shutter speed slower than 1/4 sec.",
        "date": "February 12, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPSFliY1lhTjF6NlVlSGhoaEJ3MG5BQjFqWkUzdlZKZ1h3MDFrUldFYlZrQ0JQYTdsY05pVS1tSHVZcTg3cWNLS0NFUFVZcW51LXVTaldtdkE",
        "reply": {
            "author": "Rollerbush",
            "content": "Thank you for this feedback. There's no restriction for how low Shoot can go in terms of slow shutters speeds. Your camera device however sets this limitation (usually different front/rear and above 1 second). We would really like to see even slower speeds, not least as we can now control it in a good way.",
            "date": "February 12, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Rickard Eklöf",
        "comment": "I really like the concept of the app. It focuses on what is important when taking a picture. The speed and easability of adjusting controls is very appealing. Looking forward to new features in upcoming releases!",
        "date": "February 10, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPSFM3VFlsV3NYWmJmMXhiUjJJTzdwWFJWS1Yya1dZd0lLLTlpcGtOVzEycGh4VWNxTEQyU3NHWmJzbjRHX1dkT1BYZ0kxYnVhQk0wR3NvX0E",
        "reply": null,
        "star": 5,
        "title": "Great concept!"
    },
    {
        "author": "Abdullah Assegaf",
        "comment": "Why...  Shutter speed, ISO, output, focus, not function, I try with my oneplus one",
        "date": "February 8, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRUU2bERNcHRvYUtaam5mTndXUjA1ak5MVk5Ga0NoQ0NscEpJRE5BSW1sdGVZeFdXVmZHTHFBVkQ2OG41enZ4M0VfY3JpbF92Y2EycjJnM3c",
        "reply": {
            "author": "Rollerbush",
            "content": "Unfortunately, the manufacturer of your device has not opened up these features in your camare for 3rd party developers. We would love to be able to solve that, but we can't. Hopefully your device will support this later on.",
            "date": "February 8, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Tobias Zetterlund",
        "comment": "All the manual controls for me, but less crap on screen. Superb highlight clipping preview feature. Highly recommended!!",
        "date": "March 26, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPR21zaGV5WDIwSzI1eW5EQ051cklIVXNXaXF1aW4tOFUxemZpYkdJNU9JTHZoOUJJNDhzZWY4dDJHM2VyRUowR3NfZ0YwRGxDeFpvX0NGa3c",
        "reply": null,
        "star": 5,
        "title": "Love the interface!"
    },
    {
        "author": "Priyam Basak",
        "comment": "Yet powerful",
        "date": "April 4, 2016",
        "permlink": "/store/apps/details?id=com.rollerbush.shoot&reviewId=Z3A6QU9xcFRPRjJJWVRnYkFSVDdYSDdBbi1FQ2t1aUUyYldqTEM0dnpuQnNzWFZyNHVxWFFmNW5Qd09DcTdXaWVQcHhReG5tSHZfbkpObURGUzI3SU1sYUE",
        "reply": null,
        "star": 5,
        "title": "Simple"
    }
]