[
    {
        "author": "Eugene Kobani",
        "comment": "Galaxy remote is a massive evolution from the days when you had to build your devices using a bit of code on devices whose IR ports were not designed to be used as remotes. It has an almost limitless selection of devices using the scan mode. So far I have not met a device it has not worked with. However if the ability to learn codes from the original remote can be added it will be worthy of 5 stars.",
        "date": "September 3, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRktXTHIzWGhwN1djMHpJZ0NGclJWYUdrY1AwcnAwTEtxWHRIa1dSRUw5amJFVndIS25NX2w3VDNSeXNDRFdkc1h4QnhvTldoa3VpSXdhdE5r",
        "reply": {
            "author": "Moletag",
            "content": "Dear Eugene, we would like to thank you for your wonderful review! We are so glad to hear that you're happy with the app! The learning function is already included in the app, however, it works only with compatible phones with an IR receiver. If you ever need any help, just send us an email. We hope you will keep enjoying your universal remote!",
            "date": "September 4, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "????????????",
        "comment": "This app is much simpler to use and has more brands that Peel Smart Remote. It also has a useful scan mode to help find a compatible device. The new advanced mode for the custom remote works well. Excellent customer service. They reply to emails within at least a day! Great app!",
        "date": "August 21, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR2s0WTNWLXdNNHN2cFhTY3lReEgtU1NlMUJHN2UySU5oRHB2emxIb0FRS0VITWdyVXFDMWgwdTZHODJKRkY5WXJsUVcxbGF5bi1rQ1h3UUVB",
        "reply": {
            "author": "Moletag",
            "content": "Hi Simon, thank you so much for your kind words! We are so glad to hear that you're happy with the app! The new custom remote allows you to design your own personalized remote, without any constraints. We've put a lot of work and we are very happy you like it. If you ever need any help or have any suggestions, do not hesitate to send us an email.",
            "date": "August 23, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Cain Galea",
        "comment": "This is the best universal remote control app i have used. It was well worth spending the few dollars for somthing that does the job well. Its easy to use and has worked on every device i have tried so far. My only problem is not having all the functionality of a device when needing to manually scan for the remote frequency.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSGZnZUZKdTJwdHdkaHl6OWU0cFlrRDcyZDVsNUlBcGRJQ0g3VkZVdTJzelJSSkpJbnBrQWZFM1l4MGpDN1NGbWlENW5oNnc3TXktdUpEMDBF",
        "reply": {
            "author": "Moletag",
            "content": "Hi Cain, thank you so much for your kind words! We are so glad to hear that you're happy with the app! We can send you the IR codes for any additional buttons you need so that you add them in your custom remote. It's very simple, just send us an email at support@moletag.com. Thanks again, Cain! Best Regards",
            "date": "February 21, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Darren Taylor",
        "comment": "One of the bst apps I use on my phone. It's great when staying in a hotel with no access to inputs using hotel remote. Has been so useful to me lost count the number of times it's saved me. Great app 10 out of 10. Shame s8 dropped IR port.",
        "date": "November 27, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRXFwbGhFVHJXX2hVYmxCYmtod3BuUC1oMjlCdzVWRkc0VHdBNE00MGc5THJJU1hfOHZVV3d3MkFEaUxkY2NZcGJPalg4RDlrMEp0QmhPMVZz",
        "reply": {
            "author": "Moletag",
            "content": "Thanks so much for your kind review, Darren! We are so glad to hear that you're happy with the app! Indeed, it's unfortunate that Samsung did not put an IR blaster on the S8, however, we're working to add support for external IR blasters. In case you ever need any help, please feel free to send us an email. Enjoy! Best Regards",
            "date": "November 28, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Cassie Taylor",
        "comment": "Only owned the app a short while but after adding my television in a half asleep panic when my remote batteries died... I'm now looking for anything else I can add to this app. Very well made and worth the money.  Who needs an expensive universal remote when you have this app?",
        "date": "November 20, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRWVPT2E0eTBHZDg1dWZGcWZQNWpwTXZzZFlxSUNMS2N1ZmpSRmVaYkduNXNMQXp2dWJ5TUc4QnFsdGJ3NFljVGJxNHVkeGR0NUlNVkl6b3lv",
        "reply": {
            "author": "Moletag",
            "content": "Dear Cassie, we would like to thank you for your kind words! We are so glad to hear that you are happy with the app! In case you ever need our help, please feel free to send us an email. Enjoy your universal remote :) Best Regards",
            "date": "November 20, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Brian K",
        "comment": "My LG Projector wasn't listed, but this app is phenomenal. Macros(great for entering service menus), letting you use your Android smart watch, programmable , and very user friendly. Well worth the purchase price.",
        "date": "October 19, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR21YM1d3SnRZT25LNDVxako0ZGZ1aHlfOXl5Q1NBZ1VlNWpaaDQ4anRnd3lISk1kUG40cWF2bFVmaGpMOU0zakxETmJJYVVwUV83M243WGlB",
        "reply": {
            "author": "Moletag",
            "content": "Dear Brian, thanks so much for your kind review! We are glad to hear that you're happy with the app! If you didn't find any working model for your LG projector using the scan mode, please send us an email at support@moletag.com and we'll add your projector for you. Thanks again! Best Regards",
            "date": "October 19, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Kyle Wilkinson",
        "comment": "Probably the best universal remote available. Used it on my s6 and loved it. Just did an upgrade to an s8 now I can't use it because of a lack of IR blaster witch make me a sad panda.",
        "date": "December 16, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSHZsNkxCLTlWRXc2MzVXbWpHUU1mQnRDTUtrdG9IQlRMRzhkSXVVdGhWMnlNeUlLZ214QVZMenk5eDl5eE1QamQ0cTRnVDQ4UFQ4QjA5UENN",
        "reply": {
            "author": "Moletag",
            "content": "Hi Kyle, thank you so much for your review! Yes, unfortunately Samsung did not add an IR blaster on the S8, however, we're working to add support for external IR blasters that are connected to the headphone jack. In case you need any help, please feel free to send us an email. Best Regards",
            "date": "December 19, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "James Pierce",
        "comment": "Great app, used it constantly on my S6 but recently upgraded to an S8 and cant use it anymore. Which is a shame but no fault of the app. Would 100% have used it again otherwise.",
        "date": "August 27, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR0JWdWlWNm1uTUJPbktLc3Y4cDFtYTZjeWd3a2w4cFRwU1dSUFp2X0owOUtNQWttUkZaLUNqajN6UnBnM09sSnpJSnBZUHJ3SldiTXRtak5R",
        "reply": {
            "author": "Moletag",
            "content": "Hi James, thank you very much for the review! Yes, unfortunately Samsung did not add an IR blaster on the S8, however, we plan to add support for external IR blasters that are connected to the headphone jack. In case you need any help, please feel free to send us an email. Best Regards",
            "date": "August 28, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sashi Kanth",
        "comment": "App is very good. I have added my panasonic ac remote but there are no buttons for increasing and decreasing temperature have buttons only for fan speed and modes and on and off how to change temperature",
        "date": "October 16, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSFJVd2JZMnRSbGt1NE1mZEpYWVl4V1VFWTRxbE5NMHFKdkg3TkFLUDdDN21qS0lYck5yWkNNNGVUV05qVDIwdGIxOGU1OXU4MUtuN2NnM01F",
        "reply": {
            "author": "Moletag",
            "content": "Dear Sashi, the temperature buttons are not included in the app, because each temperature of the air conditioner is using a different IR code. However, we can send you the IR codes for all possible temperatures so that you add them in your custom remote, each as a different button. Just send us an email at support@moletag.com. Best Regards",
            "date": "October 17, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Robert Simpson",
        "comment": "Never really bought anything off here before but I lost my remote for yamaha  soundbar and it works perfectly so it's already saving me money and I can even use it on any other device in my home. Highly recommend this app and will tell my friends about it as well cuz it's frustrating when u can't find the remote.and who doesn't have a smartphone in their hand now a days",
        "date": "October 29, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSFc4MS1veGZIemt6MjdnZm52UzRyZ2RqLTUtQVdDNWp1dk1mdkF2MFA4eXJjYVV5dVNwbV9oekM3SzRNcHhMVTFjdWIxY3ZOcjJvemxkQjlr",
        "reply": {
            "author": "Moletag",
            "content": "Thank you so much for your kind words, Robert! We are so glad to hear that you're happy with the app! If you ever need any help, please feel free to send us an email. Enjoy your universal remote! Best Regards",
            "date": "October 31, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jason Villain",
        "comment": "This is an amazing app but unfortunately I cannot use it anymore as I recently upgraded to an S7.  If you have a compatible device be sure to purchase this app.  Please come up with a way to utilize this app with an S7.",
        "date": "October 25, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRUtOYjB2Tk0wUkxxTk1Xc0J2RWRWV0k0RW9PcTBsSlZQb2V4TThRUUJBeVlJOXlyZ3RHcExOMUNTNnJEQ3VuZlN3alNvcng5bVhXMWhBMjdv",
        "reply": {
            "author": "Moletag",
            "content": "Hi Jason, thank you so much for the review! Yes, unfortunately Samsung did not add an IR blaster on the S7, however we plan to add support for external IR blasters that are connected to the headphone jack. If you'd like to know more, feel free to send us an email. Best Regards",
            "date": "October 26, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jon Grenier",
        "comment": "Have had app for a while but just figured out how to make a custom remote, creating macros to control mutiple device with one click is an amazing feature! Keep up the good work!",
        "date": "August 12, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR2hYQUtVbDFCYjdXMHB3ZVl3bXJ4M3JER2E5NzB0V0pRanBDdHhLXzM0Qy05NDZ5bFFtUlRZNzROT2V1dFVldXFteWQ1b0pfQklvQzBZTHJn",
        "reply": {
            "author": "Moletag",
            "content": "We're very glad to hear that, Jon! The custom remotes are extremely useful for automating tasks and controlling all your devices from a single remote. In case you ever need any help, please feel free to send us an email. Thank you so much for your kind words! Best Regards",
            "date": "August 14, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sophia S.",
        "comment": "Best IR Dev ever! I couldn't ask for more when it comes to customer service, they are spot on! Professional and this is the best app which works with my LG V20, all of my home theatre system and those \"rare\" AktiMate Blue Speakers.",
        "date": "September 2, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRU8zalB6UlpSRXlSd3g4MVRfN093MzUxQnZGZEhaa1h1SVV5UWdhZEdJZE9acVhkVnZjeE5WRE83VXczOVAwdG1yaC1SRmlhNC1XbThjb1RB",
        "reply": {
            "author": "Moletag",
            "content": "Dear Sophia, thank you so much for your kind words! We are so glad we could help you with your speakers. In case you ever need anything else, please feel free to contact us again, and we'll be happy to assist you. Enjoy the app :) Best Regards",
            "date": "September 2, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jonathan Tallant",
        "comment": "The Best remote app out there. Works on everything. Great developer replies to all reviews and keeps on updating their apps. Can't wait to see what's next. A big thank you.",
        "date": "August 9, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRnRTRU1yNkdlMEVPYnR6LVhxSjF2R18wUlBzYzVRUlZRdG1UVFJ0RGN0NHdldXpPSk5OWk02YUdERTZHNWV1US1ZTE5YcmRDQXBWZUwyU0g4",
        "reply": {
            "author": "Moletag",
            "content": "Hi Jonathan, we would like to thank you for your kind words! We are very glad to hear that you're happy with our apps and our support. In case you ever need anything, please do not hesitate to send us an email. Enjoy your universal remote! Best Regards",
            "date": "August 10, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Roberth Hoff-Olsen",
        "comment": "Works as advertised with ready made remotes for my newer devices. Entering IR codes for my (very) old devices also worked fine, and I found the codes I needed easily by googling the remote model names. A IR learning feature would be nice though. Very easy to build custom remotes and creating  macros. Very happy with this remote on my Huawei Mate 10 Pro!",
        "date": "December 13, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR0VnSEdlYjQzVTRRSGZPRUZTdW44aFJLWWpFdXhvRl81d2paazYxZUR1XzBSUkVmUUNvZnlsRVR3eV94SkRvU3M3UFRUblZiYlRjajlZcjhj",
        "reply": {
            "author": "Moletag",
            "content": "Hi Roberth, thanks so much for your kind review! Yes, the app will work with any phone that has an IR blaster. We can send you the IR codes for any buttons you want, there's no need to search for them online. The learning function is included in the app, however, it works only with compatible phones. If you ever need help, just send us an email.",
            "date": "December 14, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Craig Kelsall",
        "comment": "Fantastic app with superb customer service. Great way to consolidate all of your remotes and especially useful for when the kids lose them!Even Sky Q remote is supported. Highly recommended.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSGVLMU9EVE5NcEM1VW90a2xkcXFjQ282ZkxnQnZucEFHX0xrSW1LMU9FWVVLVDZkaTZ2c3ZIOVdKMG56Zm1YUjJoRWpSY3MzemxhZnpLMFdV",
        "reply": {
            "author": "Moletag",
            "content": "Hi Craig, thank you so much for your kind words! In case you ever need anything else, please feel free to contact us again. We hope you'll enjoy your universal remote! Best Regards",
            "date": "February 13, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mr. Monkey",
        "comment": "Everything else compared to this is not as good well worth the money it works on my Samsung Galaxy Tab 4 but not my Samsung Galaxy J-3 but at least it works I still use it and it is still worth the money like it was when I bought it I recommend this remote if your device has an IR sensor",
        "date": "November 23, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRVNjVkh5T3pxNzh6RUJIWnhUU1U4THp6clhPSnd3NUJaeExSZ3lzQ0UzYmRhdEdXUk1MRzBKa1VTVHVVYXFabmVLaWVWMUZDMnE3cV9IcHZj",
        "reply": {
            "author": "Moletag",
            "content": "Thank you so much for the review, Mr. Monkey! In case you ever need any help, please feel free to send us an email. We hope you will keep enjoying the app! Best Regards",
            "date": "November 25, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Carlos Lama",
        "comment": "Awesome. Works as soon as you click on the brand of your device. MO searching for codes. Works up to 17 feet away from the device. Now I have programed an old android to work as a theater remote.",
        "date": "September 1, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRmJoSWllLWJqbzBhd1FRZTl2ZlYzWmtMT01jVU5JQWd1TlpBeG9uSENrLUVUdUNiSm41TGIzVEhTY0VINjB0eThwREI3VEhUREcxemJBRjE4",
        "reply": {
            "author": "Moletag",
            "content": "Glad to hear that, Carlos! Thank you so much for the kind review! In case you ever need any help, please feel free to send us an email. Enjoy your universal remote! Best Regards",
            "date": "September 2, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tekura Vaka",
        "comment": "I have just installed as it says will work with note 8 but when trying to add tv message says not compatible. Highly disappointed",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRWRxaUhwX0tOZXEwQ1JSNF9tT0xNVlk0aGFsakxWMDZJMThDSUlaUF94bnFVN2lrRU1ucFVhem5janBkV3hkYVA5WVNzSDhPRUV5czNPZ2dV",
        "reply": {
            "author": "Moletag",
            "content": "Dear Tekura, all compatible devices are written in the app description. Unfortunately Samsung did not add an IR blaster on the Note 8 and therefore it cannot work as a remote control. Please send us an email at support@moletag.com so that we refund you. Best Regards",
            "date": "January 26, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "a gm",
        "comment": "I never write reviews but this app is worth it! Worth every penny i paid for it , works for everything from my cable box to my wireless speaker. Try to use it all the time, no more changing controller batteries for me",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSHFOOTlvVVl3SVJkSnIwUUt1ZzJqNTZaN3hKcjFGR09lX05yWnI3N082ZmluV2hXSVNuUDYxUkZDaV9sNGN4WWtZYnctUDZJWHFqVGZ5dzNr",
        "reply": {
            "author": "Moletag",
            "content": "Hi gm, thank you so much for your kind words! We are so glad to hear that you're happy with the app! In case you ever need any help, please feel free to send us an email. Enjoy! Best Regards",
            "date": "December 16, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Martin Slater",
        "comment": "Easily the best remote app I've found for my Galaxy S6, and I've tried quite a few.   The custom remote function is superb and response from the developer in excellent.   The definition for my LG TV was missing one important (to me) function and the developer supplied it overnight.  Outstanding.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR2VfUGRDNl9HX04wUkJPWkxEczZ1bUZxbUtlM21Ta1A5OG5fd0hkQk9xeTZYZTluX1ZnTE1ydUw5RmtRWlh4djRWVnNMZk9kNTJETkNrdXZj",
        "reply": {
            "author": "Moletag",
            "content": "Hi Martin, thanks so much for your kind words! We are very glad we could help you out! In case you ever need anything else, please feel free to contact us again. We hope you will keep enjoying your universal remote! Thanks again for the review! Best Regards",
            "date": "August 25, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Meshanna Jones",
        "comment": "I haven't used my app in about a year and now it doesn't work. I have an S7 now and I guess that's the issue.",
        "date": "September 26, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRUFzNmg3Q01jN1VyZFNka2pRa3R5c04zVGZLZ3EyeHgwZ1B5QWJ4T2I3aTJJQVplNHA1a3FPQVFla0RqaVRORTdHOVJ3ZlNURW9xY2NfWlY0",
        "reply": {
            "author": "Moletag",
            "content": "Dear Meshanna, all compatible devices are written in the app description. Unfortunately Samsung did not add an IR blaster on the S7 and therefore it cannot work as a remote control. Please send us an email at support@moletag.com so that we refund you. Best Regards",
            "date": "September 27, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Great app and even better support. My soundbar wasn't on the device list so emailed support for help and after a few emails and scans they sent me a full list of possible codes so I could build the full remote I required. Top notch.",
        "date": "December 27, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR2pfT3dEdDNMSHJVZ25zYUFTbU5mLXFPei1GVS1nRHFKR3hXbjNsX3VFLXAzMFNvTWUtY0RsMnpxQnMzeUIwRi0tWUtVNjR5N19HeV85NXRR",
        "reply": {
            "author": "Moletag",
            "content": "Dear Sir/Madam, thank you very much for your kind review! We are very glad we could assist you! In case you ever need anything else, please feel free to contact us again. We wish you a very Happy New Year!",
            "date": "December 31, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sandile Hlophe",
        "comment": "I love the app its so good bt can u fix my Sony mgongo the input only give TV TURNER CD but i hav more dan dat on my Sony  PC SAT GAME USB",
        "date": "August 31, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR2t5bHBjX0dVYlpjUFN4LUx5X19UN0dvZlNveDNha3lkNGxXU2swUjBsWXNpMmZzUVJwVXBiLVlIVzZpOElwSTl6dUQ1UDVOQlZKQzVNQzhR",
        "reply": {
            "author": "Moletag",
            "content": "Hi Sandile, thank you for the review! In the AV Receivers & Sound systems category, the inputs are located in the number pad. These buttons are assigned to the inputs of your receiver. We can also send you the IR codes for these buttons so that you add them in your custom remote. Just send us an email at support@moletag.com. Best Regards",
            "date": "August 31, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "MrFrostyville",
        "comment": "This is a fantastic app, peel remote had so many ads and want you to pay monthly fee to remove them, and it wasn't customizable like this... Great app!!!",
        "date": "December 12, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSEROWlk2azNPY3RqWG9fX2stLXp0eWdoYTdPTXFraUo2eVRoMFRsb0tJLTJBRGRGWUFuRnc3RHhodDZNOEUzaFZaSExidmIwSURmbGtjQ0JB",
        "reply": {
            "author": "Moletag",
            "content": "Thanks so much for the review, MrFrostyville! We hope you will enjoy your universal remote :) Best Regards",
            "date": "December 14, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Bubba Merritt",
        "comment": "Great app, the devs responded reasonably fast to my emails and were really helpful with adding my SuperSonic tv to their app's supported devices.  Thanks again.  =)",
        "date": "November 6, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR3YzR3VPZ1J5bUZjVTVVdDJIRDhTd2Y4VkJsWklZOVNXSm1GNFhPTlRrTFRVeEFza1ZOTTBPNWFleDZhX0FFbUcwRml3X0wzQnp1azBSZDBN",
        "reply": {
            "author": "Moletag",
            "content": "Thank you so much for your kind review, Bubba! Feel free to contact us again anytime you wish. Enjoy your universal remote :) Best Regards",
            "date": "November 6, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Vasilis Zogopoulos",
        "comment": "no problem with any device i've used it. never had a single crush. widgets are a big plus.  cheers",
        "date": "August 18, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRlV0ckFmRmdIcnlUdGFhX0FRRFU4dGRna0FDSzZoTFVZRkZVMFZaSnBSVFAwNHBTY21XU19lY3Fva0ZxU0wwa1p0VnhXekx0bloyQjY5V1lz",
        "reply": {
            "author": "Moletag",
            "content": "Hi Vasilis, thank you so much for your kind words! We are very glad to hear that you're enjoying the app! If you ever need any help, please feel free to send us an email. Best Regards",
            "date": "August 19, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Dejhaun Tetonga",
        "comment": "I really love this app, best remote control app ever.Now since I just changed to the galaxy note 8. I can't click on anything now. Pls help!",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRml4b2M5UG9WcUpVSEhib2taNVRSMzFWZ1R3YVRrX2pObnNPekhHMWhwTUJQc1lvVTNjal9Lb2tSVUtyaEJDcjI2di1Cdk9jb2pxLTM0THpB",
        "reply": {
            "author": "Moletag",
            "content": "Dear Dejhaun, all compatible devices are written in the app description. Unfortunately Samsung did not add an IR blaster on the Note 8 and therefore it cannot work as a remote control. Please send us an email at support@moletag.com so that we refund you. Best Regards",
            "date": "December 11, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Edward Cernigliaro",
        "comment": "it is not compatible with samsung galaxy s7. i wish i knew that sooner before buying it",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSHBmb3E0YnUzQ1ZTQUhRX29sWDhHa2tqaGlGRnNvN2ZKaDB0VlJsclpid0NnMGxRaGEyRHVXOXczMmV1a1AwQWF1VGpRNGZSWUZFdUYwanRV",
        "reply": {
            "author": "Moletag",
            "content": "Dear Edward, all compatible devices are written in the app description. Unfortunately Samsung did not add an IR blaster on the S7 and therefore it cannot work as a remote control. Please send us an email at support@moletag.com so that we refund you. Best Regards",
            "date": "February 25, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Donald Iocco",
        "comment": "Only concern is TCL Roku TV up and down does not work.",
        "date": "August 17, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSHdqMmwycnNBeExzWGw5VEFQSEpUV216ZUlLXzFpRjVMWjEzY0wzb1BfZm9Gbk1YRExGVVV4czZ3WXQycXE2Zm9JSmx1cnpadmNzbjV0ZElr",
        "reply": {
            "author": "Moletag",
            "content": "Hi Donald, could you send us an email at support@moletag.com so that we send you the correct IR codes for the buttons you need? Best Regards",
            "date": "August 19, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Nelson Kading",
        "comment": "most complete remote app I've tried. Ability to build your own remote means functions are available some apps don't have. Excellent support.",
        "date": "September 2, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRnRlYWh2VmpiczVsSUdmM0tkaVQyWmQ5c2xMRmluUjRuT1ZIZ0hId1NtVUJEdHBCNDlqQ19ub2k1azVDak5oaHFlOEpBN3B4N2xfMUhzYnJ3",
        "reply": {
            "author": "Moletag",
            "content": "Thank you so much for your kind words, Nelson! If you ever need any help, please feel free to send us an email. Enjoy your universal remote! Best Regards",
            "date": "September 4, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Issam Saleh",
        "comment": "worthless i can't use it on my note 8 for any device  waste of time and money",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRzY4eS1tOC00bDU4UHktSVJvdjBhaTJXQThKUTFmanhuTDkxUTFsM0lBaVJndEZCeTlwWElVZkR4bVp5al9XdV9LRDJOUF8xVTRablgzNEpR",
        "reply": {
            "author": "Moletag",
            "content": "Dear Issam, all compatible devices are written in the app description. Unfortunately Samsung did not add an IR blaster on the Note 8 and therefore it cannot work as a remote control. Please send us an email at support@moletag.com so that we refund you. Best Regards",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "perry defee",
        "comment": "Controls my world of daily remotes..a must have for every Galaxy user that has inferred feature on their device",
        "date": "December 16, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPR0Rfc2hnOHZKT01GaUFGTll5WWNfck53TzVqVjRpME9XNUF6Y2dkZTV0VFM4SEptVENDTXhiVXY5cEpPWXFlV2V0bTJLZlBkOXlWb3JPcHln",
        "reply": {
            "author": "Moletag",
            "content": "Glad to hear that, Perry! Thank you so much for the review! The app will actually work with any phone that has an IR blaster, not just Samsung phones. If you ever need any help, please feel free to contact us. We hope you will keep enjoying your universal remote :) Best Regards",
            "date": "December 16, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jacob Scott",
        "comment": "Will the Galaxy s8/s8 plus ever be able to use this? Ive had this app since 2013. I upgraded phones and this doesnt work",
        "date": "August 18, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRy1MNlJvbWlEalQtenVlcFJCSjFMZF83enZJWG5qZEZyNjctemN4eU5Zd0RxcFUwbG53eTExTy1jTDE1ZUxyUmowbk9pQ0phWkN0Wk10RmJz",
        "reply": {
            "author": "Moletag",
            "content": "Hi Jacob, all compatible devices are written in the app description. Unfortunately Samsung did not add an IR blaster on the S8 and therefore it cannot work as a remote control. If you would like a refund, please send us an email at support@moletag.com. Best Regards",
            "date": "August 19, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Abdulaziz Khan",
        "comment": "why no working its answer me u dont have iR terminal not spurred what this 2 time i pay",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSDc5Z283cVk3eENmVGlYU181WERFWk8xeHhyS0x1QU1yeER0eFVsbkJTSmQ3QVBaNnlBQlZhVWhHc3BUNmNrY0luNzhiUW93Wm0zZmloMEdR",
        "reply": {
            "author": "Moletag",
            "content": "Dear Abdulaziz, all compatible devices are written in the app description. Unfortunately Samsung did not add an IR blaster on the S8 and therefore it cannot work as a remote control. Please send us an email at support@moletag.com so that we refund you. Best Regards",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Andrew Fraser",
        "comment": "Vol operates channel change and mute button brings up input on sony tv .. but works .. at least no ads or tracking ..",
        "date": "September 13, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSHVxaEtsUC1jM3R2R3JHSWJveTItQzlmNTEzczBDQkszZ2o2RlJpR3J0WlljbDdIRklWc2tWYnlMSE5teUNBQUkyTllYYmdXbjUwTHBoZWNZ",
        "reply": {
            "author": "Moletag",
            "content": "Hi Andrew, if you test all Sony TV models in the app, you will definitely find one where all buttons are working with your TV. In case you need any help, please feel free to send us an email. Best Regards",
            "date": "September 14, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Chuck Serdoner",
        "comment": "Great remote app. Haven't found a device I can't control yet. Very easy to use.",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSDVYeGIxR3R2cF9xeG5YOC1HS0RmdXMtTTVlUi1OTWw1a2hva1M4S3dXVzZ5VkxWajB2aW1GTWRNd2VCU1lXSG5URXhHUWZnc0VUbG1LSkFn",
        "reply": {
            "author": "Moletag",
            "content": "Hi Chuck, thank you very much for your review! If you ever need any help, please feel free to send us an email. We wish you a Happy New Year!",
            "date": "January 4, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ergys Kurtaga",
        "comment": "I just installed bt i can't use I don't have ir or my phone don't support please help me on this",
        "date": "January 6, 2018",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRk9Xb015UDJTSjcyRFVBLWI5SDVKaUxvaUpzeVpreGduUzh5eWZ5M2laOXpSa1hZbUlQajZwbjlnZlpkb181YkxMQ1F0YnlCNDcwdkpvNXRr",
        "reply": {
            "author": "Moletag",
            "content": "Dear Ergys, all compatible devices are written in the app description. Unfortunately Samsung did not add an IR blaster on the S7 and therefore it cannot work as a remote control. Please send us an email at support@moletag.com so that we refund you. Best Regards",
            "date": "January 8, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Edgar Moncada",
        "comment": "Excellent app.  It's true I tried others free and paid, but no other like this one.",
        "date": "September 10, 2017",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPSEFvemcwRzJ1Q0dGX3BObFU0MHNoNHFRODl6aTJ0aF9relRQaGVmazFKaThqUEJ3amtMeGNRc1NyQ1M1cDlIdDAza1BkbFE3QnktOWFuTmRj",
        "reply": {
            "author": "Moletag",
            "content": "Thank you so much for the kind review, Edgar! We hope you will keep enjoying your universal remote! Best Regards",
            "date": "September 10, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "rene a lopez",
        "comment": "Easy to use and finding the correct remote  control has never been so easy",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.moletag.galaxy.s4.remote&reviewId=Z3A6QU9xcFRPRjFNTDFwbFI2dWZsa1loRVg2eGYxY25CNU1xaU1lTVFwT2MxM0I0UWVoMkpaOHdqbGZ4RmE2ckRzd2dmT18xNjNqWWNwTFpDMlMwZ1ZydERN",
        "reply": {
            "author": "Moletag",
            "content": "Thanks so much for your kind words, Rene! Enjoy your universal remote :) Best Regards",
            "date": "January 9, 2018"
        },
        "star": 5,
        "title": null
    }
]