[
    {
        "author": "Chris V",
        "comment": "Amazed, finally what I was looking for. Easy to use, HRM live and keeping records of the workouts.  Good job.  Missing: possibility to add text/comments to workout history logs  Works well with Huawei Mate9 and Decathlon chest strap.  I like the DJ feature, but none of my hundreds MP3 have a BPM ID3 tag :-(. Will have to find some computer SW to detect BPM and update my MP3 files.",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPSHRCczNIYzdYNVlpak90eVI1UTYzbUgxVXFtWGRKT2JVR2JnSzhQQ01MSHlTSUdOM1RnUkMwcEhlVEpSeVZObFRHaTFLZnBaOFpFSnBYMUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Yogesh Wagle",
        "comment": "Great app, simple with a great interface. One of the few, simple, non social, no subscription fitness apps which also has an android wear app.  My only gripes - 1. Does not export data in a true csv format. Can't import into excel. Heart rate and time do not end up as columns. You can go through the extra step of exporting tcx and using a converter 2. Export to Google Fit does not work.",
        "date": "April 23, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPR2VvLVlNOEJjZm9RZEZhTFdlRFN2UXE0OWk2N2x2RThVSTJRNHBDSkdKelZ4VkpWdmxBdFBQSUJjSm44aEpjVVNUOHRJSGU0WDRnMkxmNlE",
        "reply": {
            "author": "PNN Software",
            "content": "Google Fit issue appears with tne latest Fit update, now adding support of new Fit api to fix this. Fix planned in a day or two. With questions or issues please contact our support by mail. Thanks",
            "date": "April 24, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Brandon Reed",
        "comment": "I'm gonna give this a shot in tomorrow's workout and decide. After a couple of quick test it appears to work perfect but only time can tell. The app is simple which is what i want. It would be nice to be able to name specific workouts for better tracking purpose. The interface on the Moto 360 Sport is ugly but who cares as i won't be using it for looks. I'll update to either a 5 or a 0 tomorrow depending on results",
        "date": "June 7, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRnItcmlTSmM3QmJXb3FsQzlUcVN2QWtqTVBWaS1yZUlKTVFHRF8zNHlld2xmNUdVUlRPbXBhMnRZU0VBbUNRZzVIV0U1aFRPdjFXZTFpdnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lorae Perdue",
        "comment": "I really like this app. Easy to use (polar h7) and thank you for fixing the weight issue. That was disturbing. ;) I was wondering though, I like to log my strength and cardio workouts separately. I tried today but it looks like my cardio is gone. When I tried to start up my cardio I do remember it asking me if I wanted to continue my workout. I said cancel but was able to continue. Did I do something wrong or is there no way to have two separate workouts on the same date? Thank you. :)",
        "date": "April 4, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPR0lMbUxaWHhxQ1ppUG8zSVE0bXJrT0U2WjV5NDhSUHFBRV9RaElFdDFPa1FkeTkyaXpfWG9OVllKU2NfNVhwV2JNUF9JbFVMTUNOQlVIOGc",
        "reply": {
            "author": "PNN Software",
            "content": "With planned update this should be bit reworked: one be able select the workout type and different types will be stored separably. For now Cancel shroud work, if not please wait the new release. Thanks!",
            "date": "April 4, 2016"
        },
        "star": 5,
        "title": "Great app"
    },
    {
        "author": "Martin Buhr",
        "comment": "Only displays BT hrm device address, not name. Thus, if there are lots of BT devices in range, it is impossible to tell which one to connect to. HOW DUMB.  [update]  The developer claims that this is a limitation of Android, but this is not true. I can see my HRM listed in discoverable devices in the Bluetooth settings menu of my phone, but all the app shows is a list of MAC addresses.",
        "date": "June 6, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPSEJibE9rNy0xT2ZDSGY2MndNamJaV3RLVVlHUG94dFVfVm1PSHVXN0hlWnBoa054MmlOU0lITGZaOXlGSDVla1p6T3gzRDk5SmVtZVZyUWc",
        "reply": {
            "author": "PNN Software",
            "content": "Yes Android is a complete dumb, isn't it? App shows info supplied by android OS and if-and-when name is available, it's shown. Thanks!",
            "date": "June 1, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Martijn Havinga",
        "comment": "Google fit sync works again (without any app updates), stays weird. I got the message that it was unable to connect and that i had to select a different account although no option to select one was given. Anywhoo, stuff works again :)",
        "date": "April 26, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRTNtVGVYcGRwR19DR2JieHdDZDUyMkRITUVFcm4xb3ZSWHRieExhNmpTSk9jeTRRbHpGNUhxelRKTzZ6TUE3dDJrRXI2bEtTQlBlVkhqa0E",
        "reply": {
            "author": "PNN Software",
            "content": "Thanks for the report, program does not changed,\nwe will try to check with Google Fit if smth wrong or changed at their side\n\nThanks!",
            "date": "April 23, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Charlotte Pierce",
        "comment": "I am hopeful, but not happy. This app is wreaking havoc with my Bluetooth connection. It switches BT on and off constantly. It does recognize the Tickr band by name, but not my Huawei watch. There are a number of unintelligible Mac addresses on the Bluetooth list, so perhaps the watch is one of those? What is BLE? HELP!",
        "date": "February 27, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRnNRRGs4aTlJcXM5WVJQbGpmeFlxX2gzcEZQQzNTMy1KSWVwX3ZuMVRiTHNXc2xsMjZJdC1NSjd4V0YxVkZWXzI5LU5NNzJHZUZFNmtkM2c",
        "reply": {
            "author": "PNN Software",
            "content": "Please send corrections and/or suggestions to our support by mail! Your feedback is highly appreciated. Great thanks!",
            "date": "February 27, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Scott Amundson",
        "comment": "I'm using the Sync Heart Rate Strap I bought from Amazon.  I'm running Android 6.0.2 on a Nexus 5.  I love the HR plots that I collect during high intensity interval training.  However, most of the time it freezes the HR or the app freezes.  Restarting the app doesn't help.  When I'm lucky, it's great.",
        "date": "June 13, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRXMwQ3JlWDNFRkVfM1JEX1N4eG5FdW13dmpWUXhTUG8weGtNSFYtcHJiZm1iREpRYldtTjFqRjV3NFZqdWJyNlo1Mll1VVBGN1prSVNvbXc",
        "reply": {
            "author": "PNN Software",
            "content": "Freezing might be related to bad Bluetooth connection or sensor's faults at measuring heart rate. If follow comments on Amazon, that is a quite known issue with Sync, no relation with particular app. Please send feedback from application menu with checked options Send log and Send workout data  and your comments about the issue. Thanks!",
            "date": "June 13, 2016"
        },
        "star": 3,
        "title": "Nice features but Intermittent"
    },
    {
        "author": "Neo Tim",
        "comment": "It worked for a long time before it quits recently. A couple of days ago, each time I started it on Moto360 1st gen, it will start, then in a few seconds, when the first reading is about to coming in, it will vibrate the moto360, then quits. Please fix it I love this app so much and it is virtually the only app on the market to be able to do the real time heart rate monitoring on the moto360.",
        "date": "December 23, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPR0NjdG9jeW9JNVYtOWxCSGZsam1NeTJxY3Vjb3RDajFUYkREc3daZVlVV2ZUdklCb3gtV2FvTTVCV0owTXZFa0FBaDRpMXlCZzFGT2s4Y3c",
        "reply": {
            "author": "PNN Software",
            "content": "Hard to fix that was not changed and worked for a long time... Please first try few times reload both Moto360 and phone. Personally from my experience from time to time Moto360 absolutely hangs jn any Bluetooth connections and this might need the factory reset... With issues please contact by mail Thanks!",
            "date": "December 26, 2016"
        },
        "star": 5,
        "title": "Stopped Working On Moto360"
    },
    {
        "author": "Grant True",
        "comment": "Works perfectly with my Basis Peak (BLE/Bluetooth 4.0).  I like the heart rate graph.  I was disappointed to find out I couldn't export the data to Excel.  Update: Ahhh, now I see.  You can use the Share function to e-mail the data to yourself.  Then load it up in Excel.  The only catch is having to convert Unix time to Excel date/time.",
        "date": "April 6, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPR2hmT29hTUNBMFhmcGNpUUJlYXRORlo5c05vTFNIcE0wSEoyTzd1VEJkZF91SjFVRm43dUJQdF92am1vM1VsWmJyZ3MwMExSb3dSdHEySHc",
        "reply": {
            "author": "PNN Software",
            "content": "Why you can not do it? The native format of application stored data is csv files... If you have questions or issues please contact by mail and describe the issue. Thanks!",
            "date": "April 6, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ralph Steer",
        "comment": "This was the only app that connected mio band to smart watch 3. Latest update has put a stop to this! Can you trust any android app? Just wish tbere was a way to roll back updates.",
        "date": "April 6, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRmY4TlRVb20tWGd0dVNpTVQyUUlaUkQzZ3FBbXhVbVNtY3g3ZVhqbXRkWXhYenJFd2FBdE56VXZ5SzFpMWNSUnh0V2UyRmJBUksxVW5QdUE",
        "reply": {
            "author": "PNN Software",
            "content": "Please contact by mail and describe the issue details. It would be nice to receive the log: use Menu-Send feedback-Add log-file to create letter with attached log. Thanks!",
            "date": "April 6, 2016"
        },
        "star": 1,
        "title": "Used to love this app"
    },
    {
        "author": "Jeff Luckett",
        "comment": "This is EXACTLY what I was looking for, but alas it won't work.  I have an LG G4, and a Jarv BLE heart rate monitor.  I can see the HRM in the settings when I set it up with the app, but when I try and start a workout, it just ... fizzles.  It tries to connect with the HRM and start the activity, but then it just fails.  Two stars because it's obvious you're going in the right direction, but I can't give it more than that if I can't connect to my device...",
        "date": "January 18, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRWFFS0hBelpsZ0FpNlNjN0dmbEVfVlZJdlUxclVOVmRhWFpfMmcteE04d3BObjlVemtReWc0SVZNd0ptYmRwdW5NUWxnbEJ5eWZUclZfM2c",
        "reply": {
            "author": "PNN Software",
            "content": "Please try turn off then on Bluetooth in your phone and try to start workout. If doesn't help use Menu-Send feedback option, write issue description and check both both options to attach log files, then send created mail with log data to our support. Thanks",
            "date": "January 18, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Elij Futlik",
        "comment": "Older version was so bad, I gave it 1 star. But after update - it is a perfect tracker you can actually get on the market! Dews made a great job fixing all of the bugs, and making it literally perfect!!!",
        "date": "June 22, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPR19MaTlxWldudXJBVDF1SkVRLXhlOW4yVV9rdXdwUGJZSjg2RVdnajhwNGhRM2VXdFpwVDYybk1nazlDZEliNlcySTdUbnFrZjQ2T29BcVE",
        "reply": {
            "author": "PNN Software",
            "content": "We are sorry for your bad experience but this does not reproduced with most of the devices. If you have the described issues please contact by mail and give bit more details about the using equipment as well as crash logs. Thanks",
            "date": "May 1, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "I C",
        "comment": "The GUI is fantastic. Under the hood though lots of issues and missing features. Not enough updates, the devs seems to have tuned out. Still no way to pause a workout!! You have to \"disconnect\" entirely. No PAUSE and no END button. So if/when it loses the BT connection it force ends the workout.  You cannot resume, it hangs forever. Frustrating bugs and strangely missing bardic features ruin this app.",
        "date": "June 17, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRjZSUFIyYjRad3RWNEJ0WUN1VGdFRXZtSTQyOWVBN3J5ek84SDhhUG4waUxOcWJWVFZNTkVKUUZISV9FNFZvd2F4US0tSjV5cFVPeklVM2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Alun Davies",
        "comment": "The app is lacking in instructions on how to understand it, it says you can export to Google fit also to share it who or what can you share it to. It also says you can share the tcx but I cannot find anything to read it with.  Basically I want to be able to keep a record of my heart rate and rythym as I have atrial fibrillation I know this is not a medical app but it's capable of reading my heart rate watch a mio alpha 2 but I would like to be able to export it so my cardiologist can see what is happening with my heart.  Thanks.",
        "date": "May 19, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRzgwMmdnVjVSMDVmYmFqMDJwc2g5ZV9uX2ptdGRueVVNMjZJOXV3djVjT2lCbkxPN2FGNzlNN0pWanpLWTI3MFozZkNlZUota2JNZFB3R0E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Brian Ploe",
        "comment": "Not sure what the bluetooth device option is for in settings but it crashed my bluetooth drivers every time. Still seems to work with my huawei watch for continuous heart rate which is what I wanted it for primarily.",
        "date": "January 2, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRXVhaDY3NTZsUkZiblFGdU0zUVRmV3ptMnI4alNfRkcwUG5jb2EwcTdLZEd0RURzdDNDS0gzNUpDWWNKQ2gtVEg3cVFEMWdTSklrNjNxQ1E",
        "reply": null,
        "star": 5,
        "title": "Crashes bluetooth"
    },
    {
        "author": "Carl Bowman",
        "comment": "Once I read the freeking manual for my heart rate monitor, I had no problem using this. Works well. The beeps and vibrations had to go, though.",
        "date": "June 8, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRWF2ZTQzQmFEUEpna1plLVF0VmtKQ1JlbGhLUjJ3OV9vODF3cGs1aXdJd3Nkb1NNUE93VW9iVjItRHl5dE9LSV9fTlo0VkY0azM2WDQ3Vmc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Fazzy G",
        "comment": "Great app. Was looking for an android wear compatible app to continuously monitor heart rate during works. After i tried strava, which failed to show my heart rate history on completed workouts, found this app and it's great. Highly recommend of you have LG G watch R.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRW8xQ3N4Y205VW9OVGVWbVVSOWVTSWZqdTdSemFtNFFJaFkyd25IZVE4dk0wV3N1MjFjX2gydTl2c2pqcE5zQUc1TG9lbUQ5VDZ5dWNMMkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Barley BoBo",
        "comment": "Great app with no ads. Works well with my Mio Alpha 2. Could be improved with a lighter colour scheme so that reds show up better on the graphs & time in each zone (or % of time) shown at end of workout. Overall very good.",
        "date": "August 6, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPSDJHY0pORWkxY2ZjaFFtOUFMbThqUXFvbUNMd0FGQjA2alhQUWVmX29uOGc0ZVl3LTg1R0tkeVZReHctODdwalpDZzNjaUJsR1FHY2xfNFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Stephen Duke",
        "comment": "Great app, exactly what I want. Two points for 5 stars. On the Galaxy S7 edge, 1) I can't access music stored on the external SD card and 2) would be good to be able to change the week start to Monday (not Sunday).",
        "date": "May 1, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRzN6bDlyYXpTOThxclBKRWN3LWgzS0ZpRjRPMG0wd3VDcktlOFFSOVBZWFN3LS1pbVFzNUg1VFVSOF9YNU5XMThlUXR5eUROZ0lBc2d1bGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ian Hamer",
        "comment": "Really liked this app as I was able to use my HRM with my Sony Smartwatch 3 independently from my phone until I recently upgraded the Wear OS on the Smartwatch 3. Now I cannot even start the workout on my watch, let alone use without my phone. Are there any updates planned to solve this issue?",
        "date": "April 25, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRmI5cVU2dllNMnNEQnBnMXlRRklzVDlPN2FzR25WdkpCUjBYV3BwX1dqa3kzTnNsSjBrYUNreVBUdDMtMDZLTENyY2xzUWZoeFBlNER2YXc",
        "reply": {
            "author": "PNN Software",
            "content": "Wear and Play services updates unfortunately brings lot of issues... Usually nothing to do with our or otter 3rd party applications... Just try to reload both phone and wear devices. In rare cases might need Wear reset... With questions please contact by mail. Thanks",
            "date": "April 27, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Eugene Capeder",
        "comment": "HR readings on the wrist during workouts with user defined upper/ lower limits - alarmed limits alongside downloadable charts.  Well done!",
        "date": "June 20, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRXE3ZVdaREI2QWRzOU52Q0dpQWcxQ1AxUjN3MERwY3c4a2dubXpwWHlvdWtHOGZuSjJjNEpab190S2RJNlA1a1M3am56U0pUWEZ4T2VTYmc",
        "reply": null,
        "star": 5,
        "title": "Top Tier Application"
    },
    {
        "author": "Helios Fate",
        "comment": "great app. Still needs improvements but it's a one of a kind and I enjoy using it daily. I use it during the gym or runs while it shows my tickr heart rate monitor.",
        "date": "April 27, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRUxEMFpCTHpONUJOX1BjOXFzcTRnNmZUNkdFQjVpd3RhalJuUDk3OXFOczVWZGdVWExaYWtPcFkxQ1NWd0xaR3dMdG1uNG1adGdXdm93cWc",
        "reply": {
            "author": "PNN Software",
            "content": "Most connection issues observed after Play services system updates. Recommended reload both phone and wear. In some rare cases factory reset of wear migh be required. Next SGT release will be based on recent Play services and shoul be more stable... but anyway depends on core Play services stability. With questions please contact by mail. Thanks",
            "date": "February 25, 2016"
        },
        "star": 5,
        "title": "Android wear issue"
    },
    {
        "author": "Daniel Hemond",
        "comment": "Nice app but buggy. Stops working and also not cooperative with other blue tooth gear is connected to the same phone or device. Its a tug of war for connectivity. I have S7.",
        "date": "April 7, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPR2dPaC0wYnJsSHcwai14VnU2dU1maXl6MVVsUVpSa3pxUVJMcWlDeWl5WTVzeDB3SGdXbGcwZ1JLMlhRN3luRWNwU19MeEdxdzI5RDE0T2c",
        "reply": {
            "author": "PNN Software",
            "content": "Sorry, can get the exact use case and what is the issue. If you have issues or questions please contact our support by mail, describe exactly the configuration, what is \"other\" and what you tring to do. Thanks",
            "date": "April 7, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Hector Sepulveda",
        "comment": "The first minute after starting the tracking on my Huawei Watch it works fine, after that.. the HR monitor is still on (the green light is on), but it stops refreshing my HR, for example, I started the tracking at the middle of my work out, and it said 134 bmp (it was correct, i was also checking my HR in my GS6 just to test the app), then it was between 130-140 for about 1 minute (it was refreshing correctly while I was working out) and then, it started to drop down to 120, then 100, then 90, etc, while my actual HR was 145 (the HR was still on and the app was open too). If I restarted the workout on my watch, it happened the same, the first minute it was displaying the correct HR and then after that it starts to drop even though I am still working out. Hope this can be fixed",
        "date": "April 13, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPR1pEcVdsMkFfdUFmQ2U3NVNScTIxRE5oT1FHek5pcDhUUzlqaTNYS0pIWVdfTWJ3NkNlNjR3ZnQ0X1lzU2ljYmVuVlFmdWx5bTRZMkN4RXc",
        "reply": {
            "author": "PNN Software",
            "content": "We also hope that this could be fixed, but this nothing to do with our SGT application. The most internal sensors of available on market watches are useless for permanent monitoring, it could do only time to time observations. We put appropriate note in application description at our site. And recommend to use external pulse sensors. Thanks",
            "date": "April 14, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Thomas Carnesecchi",
        "comment": "I use the SGT app for my indoor rowing workouts. The heart rate display is simple to read especially at a quick glance on my Nexus 5X. I use it with my Wahoo Tickr heart rate monitor. It works perfectly. Another benefit is the linking to the Google Fit app. This is a simple & reliable app. Download it today.",
        "date": "May 14, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRWQ1ZjE0LXdpUG9Ka0Z1X3FUemdIVHN1WkZUbXBHV05VVEt1MDBhSlhFbTk4cU5rUnduUm16Y2dtWHFDbmhscHA2UklvbFZ5Q3FJa0dfQ3c",
        "reply": null,
        "star": 5,
        "title": "The Perfect Simple & Reliable Heart Rate App"
    },
    {
        "author": "Ryan Hill",
        "comment": "Really love what this app does so far. Finally a good way to add good HR tracking for Android Wear. Please keep up the development!",
        "date": "November 18, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPSDBkYW52SGR4RjVhYWZBYXdfYzd6SE80VFZWRDlrUjlrNFk1U2ZYZzNwb25UcmgySVcwbWNXY2NQRnNzb2xnOGI4TjE2NW03YmliMUdkRmc",
        "reply": {
            "author": "PNN Software",
            "content": "Please note that to stop the workout: tap on main apk screen, than drag \"Stop\" icon from top to center of the screen. If you have questions please contact by mail. FAQ is available at http://www.pnnproducts.com/en/mobile/android/Sport-Gear-Tracker/faq Thanks!",
            "date": "January 3, 2016"
        },
        "star": 4,
        "title": "Good Stuff so far!"
    },
    {
        "author": "Jeff Pack",
        "comment": "I upgraded os. Now it just randomly stops.                                                                 Edit.  Turns out my watch was failing. New watch works great",
        "date": "September 7, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPR2hBcFlWTFR2TENUYVk4OHgwQmpBaEMyeE81WmlwYzM0LTMxa2NabjNkWGJiX0tvdzV3THdZb1YyNEtxVVJWNUpzQkdGS3NBZHljclk4YUE",
        "reply": {
            "author": "PNN Software",
            "content": "If you have questions or issues, please reproduce the case, than use Menu-Feedback option on main screen of app, set on 2 checkboxes for log files and send us that info with the detailed description of the issu. Thanks",
            "date": "August 9, 2016"
        },
        "star": 4,
        "title": "Was a great app until"
    },
    {
        "author": "Eriks Zingis",
        "comment": "Nice application. Problems in sinhronisation with Wear 2.",
        "date": "June 5, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPR3pBQzRwVV96WHo2VjdVR3VIOGl6RGFadGxFZ0pDcml0ZF8tZUJCUDUwTElxUUQ3c095T2pINFdBanFGUFVjbUV4QTZhV3U5MnhkSlZER1E",
        "reply": {
            "author": "PNN Software",
            "content": "If you have any issues, please contact our support by mail with detailed issue description. Thanks!",
            "date": "June 6, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Martin Lynch",
        "comment": "Excellent app - I use it to track heart rate during hockey via a Polar H7 chest strap and my Huawei Watch 2 Classic smartwatch - great being able to track heart rate directly to watch without needing the phone! The connection is rock solid and I've now retired the Polar Beat app, since it can't track my heart rate on an Android Wear watch directly. Extremely pleased with this app.",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRThYM0JXRHRPT3I5UDEyR3VIblRoazgtSkFzU2o1T294Q1p3THd1SUhaSFhFSENqb29YanRfVXp4b1FRcVlEcHQ2UUhYUlJndFlUeHpwWkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Terry Rawson",
        "comment": "Great app, pairs up with a Polar Bluetooth chest strap with no problem. Has all the features I need for a good workout, has never dropped out and I really like the historical look back feature that it has.",
        "date": "August 12, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRllJNDdIbjNSVUJmQjd5WHhRNFRpS3J6eVlyU3ZNMzFZdllYX1VTajJNcE02bW9jdU5tdE5SX2xBWUpGR0dUM3JrNWVaQ3hiQ2tmb0QwMlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Louise Catterall",
        "comment": "I would give this app 5 stars if it linked to MFP. It links to google fit, and google fit links to my fitness pal but it doesn't show the workout and call recorded for SGT so I have to enter it manually. But apart from that it's awesome!",
        "date": "May 10, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRlk3Q2dUOEFzNjZTaUh5djVqZjRjUExBV1ZpWlEzUng5V05CbFhhaFBxMHFHZlNjZVNXNVg4cmRLME0zNUtaV05GTnZRMmhZSkRTVmd5Z3c",
        "reply": null,
        "star": 4,
        "title": "It does what it's supposed to perfectly"
    },
    {
        "author": "Stewart Ayrey",
        "comment": "Unique in letting you record continuous heart rate for any recorded activity. Nice graphics, easy to use and it just works for me! 5 stars if you could export to mainstream services like Strava.",
        "date": "May 7, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRjd3LVNYUlpFVHJpcUg0TS1Db1Faa0hPNkNXTE1fNjRQM0N2ZktpWExRMUxPd0tqVUdiNndvNW5SeXRhWVdnNVlQRnB0ODlmbTNwUnVSZHc",
        "reply": null,
        "star": 4,
        "title": "The best android watch sports app"
    },
    {
        "author": "kerry johnson",
        "comment": "OK got it to work thanks... How do I stop a workout thanks",
        "date": "April 4, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRkJkNjZWWDB0MGhRQXlickVxZlJVRFNsUXlILUhWcDZJT3REam8wNmJKMGFhemJuY3drYTM3bG1MbEdGRktGUXppaldKZGxsVzBhMVZUTFE",
        "reply": {
            "author": "PNN Software",
            "content": "You sould not connect to, LG not a standard heart rate monitor... that's absolutely another device type, you could run it on LG Urbam directly Please check variants of apk usage at http://www.pnnproducts.com/en/mobile/android/Sport-Gear-Tracker/faq\n\n\nThanks",
            "date": "April 4, 2016"
        },
        "star": 3,
        "title": "Won't connect to my LG urbane"
    },
    {
        "author": "Busy Bee",
        "comment": "It's really helpful to set pulse rate and get audio clues even while playing music. I am super happy to find this brilliant peace of software!  :)",
        "date": "October 23, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRkpUMnlmQVJZMkhyWjZXdVhBNXg2ZlhEV0FUQmktX2hqSERZVVItbXlPd0d3aHVpTmdXMXdOekxHYUtJRjdPZGFiQUl4cWFMc1FBelBGdXc",
        "reply": null,
        "star": 5,
        "title": "Best app I have tried with audio clues and notifications for HRM"
    },
    {
        "author": "Dimas Jr",
        "comment": "The best for me so far.... Using with my Sony smartwatch 3 and Bluetooth hr. Please invest to create a watch face... I'd PAY for it.... I've tried 6 different ones... I love this one sooo much. Thank you thank you",
        "date": "February 10, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRmw0OENuc2R1Yk5QN2JiTEVfNzhTbTdhcE9jMzFYYU93RkR6X0pCS211Um4xWW1IVzZ4N0RXRVRhamJRc2RwS1dVVFpPcXFOMy1wbFoxbGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Derek Sturdavant",
        "comment": "Could not get it to work. Just a barrage of alarms. Checked every setting too.  Had to stop my workout to uninstall it.",
        "date": "December 8, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRndfenZFMjMzOFNlQTRUZk9qeVh1OGFFZjNvODhkOW9yeUZBQ3VubFRscnd2c3c1YzhDRDI3NG1aN3U1NlpGSUxQZk1nX0VIQkpTYllkV3c",
        "reply": {
            "author": "PNN Software",
            "content": "If you have issues or questions please just write letter to our support and ask. Alarm is set with heart rate upper and lower limit parameters in settings. or just turned off. Note that you need start new session for settings take effect. Thanks",
            "date": "December 8, 2016"
        },
        "star": 1,
        "title": "What"
    },
    {
        "author": "Rory Maughan",
        "comment": "Love this app for calisthenics and heart rate tracking.  Works very well with my wear hr watch.  Thanks! It would be nice to be able to \"name\" my workouts or edit them and add a description.",
        "date": "January 5, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPSEl1cklBM3JVOHR2bG5nYkRQYU9WOHZyV09mUHhsZUpNdm93UGc4dElMb09hNnFCOUpibXdKLS04Ul8zRkc1d0FXVzdZa094N0Exb0NhLUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Stan Shaw",
        "comment": "I really like this app, but Google Fit does not seem to work on my Nexus 6p.  Fix this, and I would likely ditch my other fitness apps and give this five stars.",
        "date": "April 24, 2017",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRzE3TGJ1eEFvdFZHR3dvRGJQeE5TN1ZhcTJFM0JPc0d3NWQ0TVBEYTRwcnpHTS11aFp2bkpyUC1LTk1QTWU3NE5XeHFyektWelRrZlFhNEE",
        "reply": {
            "author": "PNN Software",
            "content": "That's come with the latest Google Fit update, now adding support of new Fit api to fix this. Fix planned in a day or two. Thanks",
            "date": "April 24, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "It was working great until I re-paired my Moto 360 2. Now the app won't find the watch in setup. When I use it on the watch no data is sent.",
        "date": "June 2, 2016",
        "permlink": "/store/apps/details?id=com.pnn.android.sport_gear_tracker&reviewId=Z3A6QU9xcFRPRTAtbTh5ZlRkdHlkcnQtYV9YUzJQLUpyLVdnUFp5X011LUYtbjRqdFozVDg5YTlfZHd3ZlotREVmQVk1SmtZRW9yU1Nyc2UxVVVZYWVYOGc",
        "reply": {
            "author": "PNN Software",
            "content": "Application have no option and never used any pairing with Whatches in Setup. It's only supposed to automatic sync if Watches are paited with standard Wear application. After re-pairing it might take some time to sync apps and data. Sometimes reboot phone and Watch might fix communication issues. With questions please contact by mail. Thanks",
            "date": "June 2, 2016"
        },
        "star": 2,
        "title": "Was working great"
    }
]