[
    {
        "author": "Lennit Els",
        "comment": "I've downloaded it with high expectations.  At 1st glance not impressed. Not very user friendly, several exercises missing (hammer curles, barbell shrugs, Arnold shoulder press, seated dumbbell calf raises, etc) and no way to add unsupported exercises. Anyway, I've created a workout program and will test it later today.  Update and feedback to follow.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRnRHX29TZ2czZUFuX1RNdk9yNU9KY0EyOHNjWm5fN0xmT01SSnZoOXhVTWNLSGZKV1l3c1VxamJaS0RKNExoV3BFNXJjTE13a2huRmNkNkNZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jim My",
        "comment": "PLEASE fix this for S3 guys! I was SO excited when I found this app only to download it and find the workouts unreadable on my watch. Can't wait to try it when it actually does support the newer devices out. Im giving it 4 stars for now due to the quick response and because I think the more people that get it the faster theyll add device support. Don't wanna scare anyone away with low ratings. The idea fantastic",
        "date": "August 23, 2017",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRmRBaVZTV0d3Qks4LVFfUjAxbXV1bWpBVHM5WkY5SkRlajFMMGxrVzFQdWFkeVBiX1dXS1NOYkdmWHZfRUlFNG1SUmlzSmtGb01ZcG5NN2s4",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Thanks for downloading AMP Your Workout Jim, and your feedback. Agreed, it's in the pipeline - the S3 (and also the Apple watch, latest OS)\nWe'll try to prioritise new devices - we're working on other exciting features for current users/devices, so resources are key. Thanks for your patience.\nThanks for the update Jim. Appreciated. Stay tuned.",
            "date": "August 23, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Darren Grima",
        "comment": "I suggest adding a picture demonstration of every workout, Also you can implement a workout bundle which could make customer to pay to have a different workout like the total fitness app  Edit 5 star for their prompt reply!",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPSGJVR0xwQUg0aVpCSDQzV1B0MzZtMWlTMFJzRERfSmVsalJIdFdTZGhfSDhrN1BaYWFCS21FUG1vREQxVUk3M19IcFk0Q2xVYjJpU1BseXRV",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Thanks for the suggestion Darren. Quite agree and working on some videos and photos. We are also working on a \"PRO\" version that includes some new features including more pre-set workouts for specific targets. We are also working on more device options inc the Apple watch.\nThanks for your suggestion - please contact support if you need help",
            "date": "December 11, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Love this app Paul! The fact it actually learns about you and does all of the hard work by itself is incredible! DO use a smart watch with this though to utilise its full potential. A few key additions to next update I would suggest (which might have not been mentioned yet): - Categorise exercises in muscle groups (to simplify navigation)/add in pre-made weekly split routines - Ignore rest periods of large length (eg. if distracted between sets) so it doesn't affect future predictions, ability to ignore first few weeks of inaccurate results when learning to use app so future predictions aren't affected - Add more touch-friendly navigation (eg. Swipe right from screen to open navigation panel, swipe right to remove sets etc) - Include milestones for accumulated points earned, have rankings based off current points/stats? (Beginner, amateur etc) - Provide more detail on microcycle type effects on future predictions, what each favours what area more  Am keen to see what is included in the next update :)",
        "date": "April 18, 2017",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPR01RQkc1SXBPYkN5YXp6b01FWFIzOWZfbmVwbjVpaU5HUGpGTWpfV0N4cVNkWGhuYTN3VWZxYnA3dl9rYy1VdVJOZG1xek1PUDBtQlVYNlIw",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi, thanks - please note: \n- Exercises are categorised by body-part - to search, please use the std terms; bi, tric, pec, lat, quad.\n- Split routines are in \"Menu/My Programs\" - to change a program, \"menu/change program\"\n- Large rests are ignored - do not affect future.\n- Sets are removed with swipe left\n- ( i ) on screens & web \"support\" for more",
            "date": "April 27, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "How To Australia",
        "comment": "Finally a visual representation of work on my muscles. I have seen significant gains since using this - Highly Recommend!",
        "date": "April 13, 2017",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRnBPYWR0djZ6R0hydHhleVZHZmJhaEx4bFNfQ1pVSm9scEtrcFF5OVVDWHljSkE4S1VnRkRFVmVqUjZuMkFiMFE3R0hyR084ZVBSc3E0clgw",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Thanks for the feedback. Please also check out the support and blogs for more info on the training philosophy at www.ampyouworkout.com and contact us via support or our facebook page at https://www.facebook.com/ampyourworkoutapp/\nThere will be more info coming out on training techniques, combined with the app guidance for increased gains",
            "date": "July 9, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Rony Philip",
        "comment": "The app for gear is not very accurate in counting reps and it's outdated . update it for the gear s2 and s3 and this is easily a 5 star app.",
        "date": "December 23, 2016",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRzFoRjFXamtJQlJNbGRHU2xRRGgwbTE3ZDFnaW52WHVhUTBqODJuWWJYMzVzYWVteTZqUkZJN1czMTdmMXZTbklqZnhxVy1tUGRTQU8zZHI0",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Thanks Rony - yes, we need to integrate the S3 to adjust it for the screen - this is in the current projects list. We are surprised with the comment on accuracy - usually the Gears are within 1 rep accuracy. Please provide further details.",
            "date": "March 28, 2017"
        },
        "star": 3,
        "title": "Update app for gear s2 and s3"
    },
    {
        "author": "Van Palacio",
        "comment": "thank you",
        "date": "July 6, 2016",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRzN5eVEyV2ozaEpic1FNXzZCUDE5TDZ5QTE3aFVHVzlTd1Q3U3l2UWNCNE5JM2pSS1NTRV9sdHY0SEFweWtkSm9qT01SLUdreDNzcmdSZTJR",
        "reply": null,
        "star": 5,
        "title": "Need help fixed issue"
    },
    {
        "author": "Nem Ekpunobi",
        "comment": "Current interface is slow and clunky",
        "date": "July 8, 2016",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRTJpY1hEWF9wZUhyNVRLOXNwdksyYWwtbU13ZnJjSVhWVl80azJ3YUVpRWpJOXdrWmdka2tYeUZlUWZEaTBiOEVESlA1SklzU1gyVUdPRUVn",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Nem, Thanks for the feedback. Can you please provide specifics? We've designed it virtually for one-click operation and it seems to be quite instantaneous with actions. Please provide specifics of what you found as an issue and we can also check how you are using the app. Please also contact support if you'd like more direct and detailed replies",
            "date": "March 28, 2017"
        },
        "star": 3,
        "title": "Please use material design"
    },
    {
        "author": "Kerventz petit-frere",
        "comment": "The title says it all, exactly what I was looking for except for a couple minor setbacks. The setbacks are mostly glitches making it unstable sometimes. I would also like to be told what I need to work on. Not just see it in a start graph if my tension is low have it give me some small tips on how to create tension that sort of stuff and a better tracking system.",
        "date": "February 16, 2016",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPSElDYzdTbWhMQUdWSVZxcE1kcXhuaktSWnVaZTZsaVhTcUNKSzR2NU5pRTNVYkhqNWppWDgwYlBzRkxKV1FwaTBfSkduTzNrXzhjdUZob2I0",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Thanks for the fb. We have had some recent watch glitches due to a new SDK - not sure if that is what you refer to? That is now fixed. Please contact support with specific queries - not sure what you mean \"what I need to work on\"? There will soon be a vlog with tips - hopefully this help. Also, the new User portal gives helpful graphs - out soon!",
            "date": "February 16, 2016"
        },
        "star": 4,
        "title": "Glitchy but I love it"
    },
    {
        "author": "Joe Napoleon",
        "comment": "Try to pack too much stuff on one page. Can use better organization. Could not get it to connect to my gear 2.",
        "date": "March 19, 2016",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPSGYxdFM0MDBMSFpYOFRSTWNQNTRlemtxalZqN08wakFLZV9GblFaSUJMclRKOHl4b0s3MWNTVFRYV0llZW93N0g3c0xCeFIxOWp1RTJ6RDFn",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Joe, Thanks for the feedback. The Gear S2 should now be compatible with our latest release. Please try again.",
            "date": "July 16, 2016"
        },
        "star": 3,
        "title": "Still a bit clumsy to use"
    },
    {
        "author": "Rachael Harding",
        "comment": "Loving the app, really pushing my training",
        "date": "February 21, 2016",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRnk1aXhuREZzbnc1Wk1PQ3NlMUtoRVVoWV9aZE0xTl9JcmE5ZUlUX3B5SGlrSWhKR29BOUhHY3VJYzRjWVd6TEtLSUstWWpHQ2RCMWEya3FZ",
        "reply": null,
        "star": 5,
        "title": "Fantastic app"
    },
    {
        "author": "Burlington lawns and Constuction BLC",
        "comment": "Love it with my Samsung gear s. Developer works with you if u need any help. Explains how to use it. I like making my own workouts before I go to the gym. Hit start.. and it keeps track. No more writing down or logging.",
        "date": "January 22, 2016",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRW5SR1lGbFMtVXQxTFAtTHZUQ0dJNElkQmpuaV9lNW9xTFA5VkdJd1VxamRqN1RtMHVWa1FNVzg4Y05KLVUzdHl2bzlzYUc3QkUzNFo4UmVr",
        "reply": null,
        "star": 5,
        "title": "Works great"
    },
    {
        "author": "Richard Servello",
        "comment": "Just add the ability to make custom exercises.  I have to put something close when what I need is missing.  Every other lift app let's you makes custom exercises.  **reply - but some people don't want to be guided.  Yours is the only app that works with wear.  I just want to use my watch instead of my phone.  No point in telling support what to add, just give the ability to make custom exercises, like every other gym tracker.",
        "date": "June 26, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPSEowdmRXNWNQWmRTMFVqVTUyMlpoUFRXRU93aGg5d1NwTVpHdmFLam5Jc1JvOWdhbXVKQ3o0X3BpWnJBZC01VlpKaFN5LVJ4bW11RXRxZFRB",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Thanks Richard. Please contact support with what to add. You're hopefully seeing that AMP is not like other apps! Most are simply a list of exercises - AMP guides you to your peak. This requires mathematical analysis. Each exercise has key data. We'll keep adding incl all popular equipment. Existing exercises are the most effective basics.",
            "date": "April 27, 2017"
        },
        "star": 3,
        "title": "Really close!"
    },
    {
        "author": "Glenn Lopez",
        "comment": "Have to open the app on my phone then open the companion app in my pebble? It should auto lauch the app iny pebble if I open the app on my phone or vise versa.",
        "date": "June 24, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRkNaOUJYV2s5MEUwVTRlaVpaalZldHlVNnh3SU1aTHJHXzhpa01DUDUtZkxLVHlYU2ZqcGtzdTZWOU5BYnI0dHZCeVVxNC1NbkIwVzZtTzZ3",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Thanks Glenn. Future updates will include this and other refinements. We have concentrated on the breakthrough technology - a revolutionary development in physique transformation. Note we have an advanced system for rep analysis - to be included soon. Please contact support with any constructive ideas - we will keep improving. All ideas welcome.",
            "date": "June 26, 2015"
        },
        "star": 2,
        "title": "Auto Launch"
    },
    {
        "author": "Sanjay Abraham",
        "comment": "Works great with pebble",
        "date": "June 26, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRnVYM0E0dmdaRFR3QV9jdGN4MVlhUFFqd0VuMjVVOTZwQ3ZJRGpMTlk3R3dnRERjRkQ5X0NTS2FUZERCMGhjUUZDb0RqX01nRm0ybFA1UGRV",
        "reply": null,
        "star": 5,
        "title": "Great app"
    },
    {
        "author": "Andrei Katsuba",
        "comment": "- Wide use of abbreviations like \"QCLB-PHDT\" etc is confusing. It's actually impossible to use the app \"in one click\", it should be deciphered first.  - 2 day splits lack abs' workout.  - In some cases I can't really understand what kind of exercise is behind the name and how to do it. Consider adding pics to names or adding separate exercise database in-app or on your website.",
        "date": "May 28, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRVlvZG12TkUzSm9QNXBJeVg3LVNRQWpKNEtDT25PWGM3MmZKYWQ0VDMxbFlzSXZNXzdGSmxzWldPbk14ejkzejc3X3JTaXptZGpOUU5PM2VZ",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Thanks Andrei. Latest version (due June) replaces acronyms with words. One-click operation works once a program is selected - fully automated - no data entry. We are producing videos and GIF's to explain exercises and provide in-app references - as well as brief notes. These will be out soon (our youtube channel) - and links in-app next version",
            "date": "June 10, 2015"
        },
        "star": 3,
        "title": "Confusing at first"
    },
    {
        "author": "Ryan Leaman",
        "comment": "**Still not working** No matter which way I try to register I get an \"internal server error\" on the screen after selecting type of user",
        "date": "April 27, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPR2FCTDhhSXZjX3V6OC1JcWR1bmwzNk1jaXV2VFU1LXc1NklXSndHelVDMG1vTnA4d3ZHNkY0V2g0Z2xEdmlNT0xPdXNwa3FSWGNiQlFYWXJJ",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Ryan,\n\nSorry again! Are you able to please retry your registration, this error should have been resolved.",
            "date": "April 27, 2015"
        },
        "star": 1,
        "title": "Can't register"
    },
    {
        "author": "Art Cantu",
        "comment": "No selection for kettlebell boooo",
        "date": "April 8, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRmJHeUV3R0tnUmdTTXR0Q2d3WV9EVFBWVmo5ZnMxbktqY1NQYUpRLTNySm1HTHlpSHgySDNoWlp3R0ZTUGpfbHdqV3JsSGxfdzN2SndHT2pB",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Correct Art. This is not a Cross-fit application. We have nothing against Cross-fit, but it's a different training philosophy (Cross-fitters will agree) and would require different analysis, exercises, and features. You can check our website and blogs for the focus of LIFT-iQ and see if it is for you. Regards",
            "date": "April 9, 2015"
        },
        "star": 2,
        "title": "Where is the Kettlebell"
    },
    {
        "author": "Epluribus Ford Jr",
        "comment": "Using SN2 and Gear 2 watch. At first it would crash if backed out of program. Once I got it to work, it was finicky at best. I would input my results of a workout set and this program would change the weight input and unit of measure. I couldn't trust it. Now after the March upgrade, I had to delete and reinstall to sign in. I haven't done any workouts yet, so we'll see. I must say, the support is outstanding. Replys from Paul himself. Hope it works.",
        "date": "March 10, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRjJLcFAtY0JzTXdzRUdXQVF0UmVHdW5rUk9Yc3BGZFNXZ1JYQkQ1Unp3LUxtRW00R3doMkpXQ09sSTZ3dFplZmZDc0diMmNVZjNza092QlVJ",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Epluribus - I trust that things are going well now that we have fixed the bug with the Lbs weight units. We will in future have a weight unit default feature. Note that adjusting the units at the moment is a once-off affair since the app will remember your weight units for each exercise. Please keep us updated with progress. Regards",
            "date": "April 9, 2015"
        },
        "star": 3,
        "title": "Before upgrade, needed work. After, we'll see..."
    },
    {
        "author": "Michael G",
        "comment": "I like the idea behind the framework but the program has some work to do. I'd like to see a settings menu that automatically defaults everything to Lbs. I'd like to see a more explained/simplified selection of pre-made workouts. Perhaps have a 3,4,5,and 6/week selection(also give estimate time of completion). And it would be helpful to have an up and down for every digit to change the weight as opposed to a general increase/decrease of 2.5lbs. I've got some other ideas if the developer wants me to email....",
        "date": "January 5, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRW55YVBIVEZXNUpMcTZCQ3dpbnBRV3VSb05saVZmczg0c1VOcjl0NFYtWjZQcmEzVk43aWJSeVRBb2YwOW1UVHkzMmJwQ21HakN6Y3BiSzZ3",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Michael, Thanks for the feedback. Yes, the Lb default will be in a future version, - defaults to the same as your profile body weight units. The new templates in the latest version are simpler. Note you can copy/edit any template - add sessions and exercises to customise. The weight up/down is designed for speed on usual weights available. Rgrds",
            "date": "March 2, 2015"
        },
        "star": 4,
        "title": "Has potential"
    },
    {
        "author": "Chris Deas",
        "comment": "The app is great but it needs a better workout history log, you can't see your workouts until you finish that particular exercise itself and it compares it to the others. Would like to monitor my workout results for later or compare them to other days not when I just finished working out. A calendar would be great",
        "date": "December 12, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPR0ZhTUJCTEZhTlZXYjBtelI5bUtIZmlzckV2RzlJM2ZoalB0eTEtTnNFMDdRczJNdXUxUDZlTk5PdkN0VnUwa1daNEc0WGJSM3p1elV3S0xJ",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Chris. Thanks - yes, the latest version (due March) will have full workout details of the one currently in progress. The next version will also include a calendar to review workouts. There will also be some cool graphs and analytics in future versions. Regards",
            "date": "March 2, 2015"
        },
        "star": 4,
        "title": "Workout History Log"
    },
    {
        "author": "Josh Muldoon",
        "comment": "A nice idea for a gym app. I've been looking for this functionality and there's a lot for running and cycling outdoors but not much for gym based training.   At firstIy only installed the FitIQ for Wear and obviously this doesn't work without the full app. that could be made a bit clearer. Also could include some wizard style instructions when you first use it especially in linking our watch and phone.",
        "date": "December 3, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRmFua1VlX1oyQVpuRzZWQlZ0bnZreFUwcldHWHF4TExaQTVTRERBMUhaNmt6dzlGTTVydjBNdkxwZkt2TlJaX0txc2lwamxxUXp2UDR0dlJ3",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Thanks Josh. Yes, agreed, we are working on a better on-boarding process (included in release late March) and some in-app help. In the mean time, as we improve the UX and in-app help, we are trying to bridge the gap with a FAQ and help section at lift-iq.com. Regards",
            "date": "March 2, 2015"
        },
        "star": 3,
        "title": "A little fiddly but got it working"
    },
    {
        "author": "Tommy Ossowski",
        "comment": "Cool idea but someone has my email..? Tried log in thru google ...error. face book don't work either..worthless unless I have a new email",
        "date": "November 25, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRWJpQktDSk5WbEYtSjliQ2dqT201WURJSW81ZDNkdG8xXzdIOGhkdkpsV01zUWtvV2lEcXhJUFRxdkd0NDJQdWtVOW04T1lnOWJyU29KanY4",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Tommy. Sorry to hear about the challenges you are having. We are perplexed how someone could have your email? Have you perhaps tried to register beforehand? You can test this with our link \"Forgotten your password\". If your email is in the system, you will get a chance to create a new password with the same email. Regards",
            "date": "March 2, 2015"
        },
        "star": 1,
        "title": "Suxs fix"
    },
    {
        "author": "BonzaiThePenguin",
        "comment": "So smart, it needed me to specify lbs (not kg) on multiple pages, only lets you do three sets (not one or two), lacks a search option for exercises, puts vertical sliders inside vertical scrollviews so you can't use them normally, and thinks it needs a dedicated button for closing the app.",
        "date": "January 2, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPR3ZoMm9CUGg4NE9NaUtqY01CODZPaHZGeFFoejM1T0RTWkdySnVZMndCQjNCUzFDdWlsX2o0bE1VUl9hWGtCNWRUd3RNSjAxUlowemZuMjNF",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi BTP. Thanks for feedback. lbs default is in future version - defaults to profile body-weight units. You can do as many sets as you want. Stop at one or two - just select \"next\". Future predictions will be for the same amount. Use \"add set\" for more sets. Vertical movement was a bug on some phone models and is fixed. Regards",
            "date": "March 2, 2015"
        },
        "star": 2,
        "title": "Technically it didn't say a HIGH IQ"
    },
    {
        "author": "Trent Litchfield",
        "comment": "Severely needs the ability to change set amounts, and the ability to add a goal amount of reps.",
        "date": "January 10, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPR3Y4eEJUNVVTNW9JQ2hWUnU1RlhzTlJCNnpfbHpZRzR6RzFlRm8wUXhnOXNCWVBWRHp0dmhDM21UY25fXzRiZTd0NGtsaHBlclZWdERjY19n",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Trent. The app gives rep targets to suit your genetic strengths. You can exceed the suggestion if you wish. The app will learn. Have you tried a second workout? Please see website \"How it works\" - and blogs on optimising muscle building. NB you can simply \"Add set\" - or stop early - use \"next\" to go to the next exercise.",
            "date": "June 11, 2015"
        },
        "star": 3,
        "title": "Alright but..."
    },
    {
        "author": "Sasa Stokic",
        "comment": "Tried it with moto 360 and total failure. Even without the watch app was unresponsive on a htc m8. I could walk to the nearest cvs, buy pen and paper and walk back before the app responded. Sounded like an amazing app but too good to be true.",
        "date": "October 11, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPR1h3czdTbTNDQlJpMDk1UnpRak5aSzJpeHIxVy1yTE9UdkdjRXR2QVNCNWZsTDJueTdfVVVweFpXUUUxTEJ1SkRWNkJwOEw4MTFrV0J3NWVF",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Sasa. Sorry to hear about the issues you encountered. Can you please contact support at the lift-iq.com website and explain what you mean by \"unresponsive\"? The app will work without a watch, but assumes a lifting tempo of 1010, for a time under tension of 2 secs per rep. regards",
            "date": "March 2, 2015"
        },
        "star": 1,
        "title": "Worthless"
    },
    {
        "author": "Hector Ponce",
        "comment": "Constantly freezes or requires restarting. I think the problem is always connecting over the net. I have 4g, but maybe there is lots of traffic. I disconnected smart watch at problems persisted so that isn't the issue.",
        "date": "October 22, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRWJ5cFdxd0JVUy1rWFBNZk5VVGlCc0tDNjBIWXlOODZONk1QZWZGc1h5RjQ3QjdqNzlNQ1BGenlRNzdqY1hlcEdGQjJQYWM4TmRfcHZ1QVlz",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Hector, thanks for the feedback. The problem should not be an internet issue - the app works without the internet during a workout. It will update information before/after a workout whenever connection is achieved. I am not sure why you are experiencing \"freezing\". If it continues, please contact support at lift-iq.com website. Regards",
            "date": "March 2, 2015"
        },
        "star": 2,
        "title": "Great idea bad execution."
    },
    {
        "author": "Kyle Hook",
        "comment": "Paired and working well with my gear live smart watch! keep up the Great Work!!",
        "date": "September 23, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRUx4ZE8xUk5qUXBIY1JzY2w1SXNzbUNQU243a0dpbHBjYU53Z0Y0a0gwaUc4ZWlnVVJfSl9Ba0YzR1ZzZDlQTkZfdzhNWEVEQWdJbUs5TmVv",
        "reply": null,
        "star": 5,
        "title": "Great APP"
    },
    {
        "author": "Imran Sarwar",
        "comment": "Brilliant application. Paired & Working Smoothly with my Gear. Thumbs up.",
        "date": "September 23, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPSE1XLUNkWW00cVl4dE9SUC1GamZPaU1BekZhUDBLWGFSOW8xZ1BhSVFMSTRvVF9oZW1LRVZBRUdHVmxKVUdPVlZLRVJUeTF3ZzFCU2pKVnEw",
        "reply": null,
        "star": 5,
        "title": "Good Work"
    },
    {
        "author": "John Cordova",
        "comment": "Yeah the app is awesome but i cant seem to pair it to my gear neo 2 unlesa im doing it wrong",
        "date": "September 18, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRWljMTVIZmRacE5ISTZEeTdrVUU0Q0ZtZWNhZ2ZOMlpybU9Tb05FZndadjUxNURMR2Q5cms1aHFGTFh0OEhrNHdzdE9PVEpkcG5ONHdaSkt3",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi John, Sorry to hear about the problems - and apologies for the late reply. Please see our help and \"help with your smartwatch\" section at our site lift-iq.com. If you have any issues, please contact support at lift-iq.com. Regards",
            "date": "March 2, 2015"
        },
        "star": 4,
        "title": "Gear Neo 2"
    },
    {
        "author": "Jimmy Palathingal",
        "comment": "The app is amazing but when I try to pair it to my gear 2 neo it just shows scanning and nothing happens.",
        "date": "September 11, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPSDRBRVNudHhya2p0ZlFMZ1pIS0NnS2VtUkQyMm80REtTbmFHWUhpSlgyS21jQ1JXdWZnTXg4bWlXMXpqbU55Zm5aTThCeUJWZ0V6dER3eHhZ",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Jimmy, Sorry to hear about the problems - and apologies for the late reply. Please see our help and \"help with your smartwatch\" section at our site lift-iq.com. If you have any issues, please contact support at lift-iq.com. The \"pair devide\" was a Dev remnant. Pairing is achieved via the smart-watch apps and LIFT-iQ watch apps. Regards",
            "date": "March 2, 2015"
        },
        "star": 3,
        "title": "Can't connect to my galaxy gear 2 neo"
    },
    {
        "author": "Cameron Marsland",
        "comment": "Hi guys,  There is no exit button for the app.  When I click on the back button on my Samsung S4 it takes me back to the login page of the app and can't go any further.  To exit I need to press on the \"home\" button on my device, which means the app will stay running in the background.  If you would like to see what I mean, check out the \"JeFit\" Android app.  Clicking the back button when on the app's home page, it will ask you if you would like to exit the app.  Also for gym newbies/individuals will you include a small picture/notes on how to do the exercises?  Otherwise things look athestically pleasant.  Cheers",
        "date": "September 9, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPSG5aOG9ud1hJcEZiNlBHYWN5UWQ5cEtzTUdlT1IyM2FBcDBldEp1LTFEOFB6ZGhqZ1pOUHVHbm15XzlpUjJ0VEhTQmlvQ2hzbkdCYVA2ZTVV",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Cam, thanks for the feedback. Quite correct. To exit the app, you should first \"finish\" your workout and then you can long-press the menu button and swipe left to quit the app - or, from the LIFt-iQ menu (top right of the screen), scroll to the bottom and select \"Quit\". Regards,",
            "date": "March 2, 2015"
        },
        "star": 3,
        "title": "Unable to exit the app"
    },
    {
        "author": "Nathan Leverington",
        "comment": "Hey guys, would be great to get some images with the exercises as there are so many, working great with gear neo watch in picking up reps, looking forward to seeing how this app progresses.",
        "date": "September 9, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRlZYRVpEVzZPQkFabDhfTDZ6b1NaSjVSTU12NTR0c2h3RnI1UTJUQlhaWDFybHAxRGlJQkZHcjJUSzJ0SDVMZU0xWVpPQlVCTmZTVXNqU1dN",
        "reply": null,
        "star": 5,
        "title": "Needs images /gear neo extension is awesome"
    },
    {
        "author": "Ken Ross",
        "comment": "Flexr6 is excited to use LIFT-iQ as a bodybuilding competition preparation tool ! The future of bodybuilding is LIFT-iQ !",
        "date": "September 5, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPSDVtdllxejZoSHJKTGd6VVdsT3BYZ2M3UXB4NXpObXhqWGRSRlZMNU1RMnVIUzFLeGJqZE00MDFSeTRXeFZxSG4wOS1zYnFPSG1FVnRESnln",
        "reply": null,
        "star": 5,
        "title": "Flexr6 Fitness Solutions"
    },
    {
        "author": "Adam Dorsey",
        "comment": "Awesome fitness app",
        "date": "September 5, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRWIwMkVNblVMQXdUNlMwN1F0T3VveFZFM0lHVUl1enVITm5hSEdpSTdFN1dDcE1FNzBlQzhReDV6TG9XSWhQMDdCZkhYWWJEUlBCbk1hV2dR",
        "reply": null,
        "star": 5,
        "title": "Lift-IQ"
    },
    {
        "author": "Alex Opacic",
        "comment": "The best fitness app on play store.",
        "date": "August 29, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPR0l5Q2VlLTlnU1FfZFVsSFlTb0VuU1kzakRGR3haNVh0MWJIVUlqeXRaWVZCcWJfQkRxOFRrV1JtaVU5NFpfSWo1SEdnMVBPLVVpOTJ2OWpN",
        "reply": null,
        "star": 5,
        "title": "Awesome app"
    },
    {
        "author": "Abram Johnson",
        "comment": "Nice UI though.",
        "date": "September 9, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPR1gycENFd0M1ekNobnQ3NERHdHhlN09DSnJhdHlvemhZV2tMNnVyZW12MEJidndNYi15WG1ZWjBGVmZQOVQ3RUxka0Q2Zl9ueU92UGlPZ1Yw",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Abram, thanks re the UI. Re price, - It's now FREE!. Note - it guides you to your peak workout for your genetic strengths - It's not just stats. Most serious trainees spend big$ (food, supps, gym) - this is cheap \"insurance\" for your time, money, gym efforts! Biggest issue in gym = \"How should I train\". See lift-iq website \"How it works\"",
            "date": "February 16, 2016"
        },
        "star": 1,
        "title": "Over priced monthly subscription"
    },
    {
        "author": "Trent Gardner",
        "comment": "I can't imagine training at the gym anymore without it!",
        "date": "October 16, 2014",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRlZvaHBLQzBDMU9XZGdHcmVjelJ5V2J1SzI1ZEFDRFZVbW9WYUMycFNCMFlJTkpMSFF4emowVmJqWnNrdzhTSkhaVmJhWUNPRGZteW1NWHUw",
        "reply": null,
        "star": 5,
        "title": "Amazing"
    },
    {
        "author": "Ben Hartley",
        "comment": "Wouldn't log in wouldn't register",
        "date": "April 20, 2015",
        "permlink": "/store/apps/details?id=com.getammped.mobile&reviewId=Z3A6QU9xcFRPRTdrNTl5S1RKaFNIRFhHSmFUZ3hldVhWd1JWLWVzUE02NEdYTGlaSW1MQW0tS21reHE4VW1WaU16cU1Ha01NV1Y2QTVuWEFtcVNQckl5STl3",
        "reply": {
            "author": "Titanec Pty Ltd",
            "content": "Hi Ben,\n\nAre you able to please retry your registration, this error should have been resolved.",
            "date": "April 27, 2015"
        },
        "star": 2,
        "title": null
    }
]