[
    {
        "author": "Sheila Schilling-Kreutner",
        "comment": "Honestly, it's a godsend if you have to coordinate your life and activities with someone else. You can share lists and keep others private (so it isn't intrusive). If you have the memory span of a gnat (like me) you can set reminders. Terrific for planning and for backup to personal calendar. I love the option to check off completed tasks (and they're not deleted so if the person you're sharing with checks it off before it's done, you can go back to review).  Even free, its a 9 on the Divorced Mom of Teenagers scale!",
        "date": "December 20, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRWYtNUNNYlJJNFVkVnBTUkxDZ0tFaHdraXVJNTM1SEhKYllQUDhJTkhEbkMyZ3c0UXVGcXdqRlpPOERuV2ZGLXg1cHJPT1A5UUxXTWRsR1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Richard Martin",
        "comment": "This is a simple, yet versitile, multi-list app. I find it works well across multiple platforms (Win 10, Samsung Tab A Android 7.1.1, Moto g4+ Android 7.0). It loads quickly, syncs within a few seconds, and remembers your completed tasks. But it only shows them if reqested and you can permanently delete if you wish. Nice basic selection of backgrounds. Very easy and intuitive to use.   Exactly what I have been searching for",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR0Vra3FDTkcyRGdyQnphRzZ3djdIRVo2dkNqX05ZS3E1OTh6UkpacjlyY2FWSjRYbkluRmpIMFl1ZHBtZDZZN1o4eE9DWnItRGJnVlBiZ2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nicola Onofri",
        "comment": "Lovely app, great interface and gradients, one of the best Todo organizer. The only complaint I have to make is about the widget: it doesn't seem to register the touch when I want to change the list from my Inbox to my Work todos. It is quite annoying especially because the widget can give you a nice, compact view of your tasks but since it doesn't update it's pointless. Hope you can fix it quickly, that would definitely convince me to give you the 5th star.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRnpSUktDT3Q2aS1aeWNBam5TY1BmTmRKMW1ndGpzTlJHUGw0NzZvVk1ORXZvVWxZd1hkQW85bDIxUHI5LUpsc2tqSWRiaWYwRkw5SVBpSFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Eva Francis",
        "comment": "It's so nice, whenever the old man goes to the store for me, I can tell exactly what isle he's on by him marking off the items as he shops. Lol it's very easy to use and convenient. Kinda slow sending new additions to the list though. If I add something sometimes he doesn't get it until after he leaves the store. They need to work on that. But other than that it's a great app. Thanks",
        "date": "November 18, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPSEVDUjhEbG9tYUl0WExHUVF2RHhRRXNPU0d3WHZTMExzU29mYTMxSnpHd2ZlT0tVVUhpbVFuSnlWLVZiajZ1eXhSM3R4UjhTMDVYUDBtWHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "grant heath",
        "comment": "I recently left a business and had my account set to my works email. I changed my email to my personal one but during the process made a typo. Now when ever I try to correct this i am met with a message telling me the wunderlist serve is down. I receive this same message when i try to report this issue via the internal channels. When i try to use the website to correct these issue i am ment with a message directing me to the app. Please can you assist.  Regards Grant",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRnVQYl8tV256T2NWXzVxd0NCZHVEZDc5Um1kWmhmd1VwR09xVEtBeENJOWtpQWxuMm9wVWZNeWczMzJ3NFo0X0N6QnVuNTBZcGpjaGNUcFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Vincent Woodward",
        "comment": "I have used this on android, ios, browser, Desktop, and Windows phone. I have been equally impressed on each platform. This app has kept me on track for school mostly. There hasn't been a single thing that I dislike about this tool and I will continue to use this.  Update: My thoughts haven't really changed much. I still absolutely love it but there's one feature that would make my life so much easier.  Integrate OneDrive and Google Drive please!",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPSENYYlRrZUxaV0VQU0Rpd0diM0kxVUJsZEZ3TUhnbjVMUEFXWmcwV2tSZ1FEQnh1OHppSkFIOWM0ZGgxYmRVSlNOWHM5cks1VVkzRnVrV2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I recently changed from any.do to Wunderlist and I'm so glad I made that decision. It has an intuitive interface, great synchrony between Android and apple devices and better features all around. I completely recommend it.  Edit: I've been using Wunderlist for almost a year now and it's absolutely life-changing. It keeps me organized, syncs without even noticing and the lists can be classified very easily.",
        "date": "December 6, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPSDB0b01FTm84S3ZhQlFxcnUxY1QxbVpBQXo2a0JaQUVOQktFRE5MNkhrZ3h2aWFLSjFNSUoyWk92cUNZc0E4Rms2RFhlLS1jSHlaSEl4S0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Paul Chillingworth",
        "comment": "I've only been using this for a short time, having used Gtasks for years. The only reason I have changed is that I needed something that works on all platforms as this does. I agree with one of the other reviewers saying it would be much better if you could add more than one notification or reminder on proceeding hours and days. Google Calendar has this feature and I use it all the time.  Well done to the developers for coming up with such a solid solution.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRVhwN050Z21GX292VUJSaGlvc3RQUFVfbkFPMjc0bWI3RXdRSW5XN25DWUNwSEJLamdMRkZYUmZxM2pMZzNGaHM4eTdlZTdOVDRVbHpEb3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "I'm gonna give 4 starts cause 5 starts always look fake and shady. For real this deserves 10 stars. I'm an average person but have a very busy life and need to remember important points and tasks. I haven't found anything better like this one. The widget is the MOST important part of all of this. What every you guys are doing... you're doing it right.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPSGpGb0VzTjQwY1BKdGgwNUxQSHM2SU1nTmxPNjFzWnNEWUFFbTFIS1NMZEYtOHNaYjQ4SHFlRUtmaEtDMTVFaHdjaG1hSVZieGJOelA5RWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Amanda Rose",
        "comment": "Great  app for making to do lists. It would make things less cluttered if you could more easily delete crossed off items in bulk, rather than one at a time. If there is a way to do that,it does not present itself as easy to find. Otherwise, app works great and makes list upkeep easy, especially  sharing it in the family.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPSE1vYlBmOEx1cGJBWTNNdHFJd0ZidHRhRkpyZS1BNFJQaUhTYU1SOUluTklmNksxZzN0ek9RN3BjQnZVM0FIY0x4Tm1CUTM0UkRhcWxpVHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Boo MF'n Wee",
        "comment": "😍 I'd never been in love with an app before now... 😂 Top notch, devs 👌  One suggestion: allow each list the individual option of auto-assigning each task to a select person or even just to self, of course with the option to change it if need be. Basically, it would go ahead and pre-select \"me\" from the drop down at each +task without prompt. That'd be awesome!",
        "date": "November 14, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRVI5cm5HN1JfdER0dmpiMzRPNU51V0hYUVVwWVMwN3V1VGdHeU1rNUJZaEJ6aWQtNXFUaXg4SHNuZXVwTXM4dzY2cDRDUW9VX09hU1V1NGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Caitlin Gallacher",
        "comment": "Edit: I'd really appreciate being able to set a reminder on a day which it isn't due. As of now, I can only remind myself in the morning of the due day and that's a bit pointless for me. Still a very good app regardless but that would be good :) thanks.  Excellent app, love how easy it is to edit tasks. I'm so pleased how I'm able to set due dates and it will show me tasks due regardless of what list they're on if I go to Today. Looks great, can access my account via the app on different devices and very user-friendly.",
        "date": "September 26, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR19QV1VoMnQwa2djc3BsZFF0czk0RXh0Y293SGV6aDFkRXlnQjZxeG5jR24yeTB6UG4yWHRUdjVXT0cxZmlrN21YUWFick05bGxsM2dpa3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tisha Perez",
        "comment": "My husband & I use this for EVERYTHING! Groceries, To Do List, Wish Lists and more! If I'm at the store and my husband thinks of something we need, he just adds it to the list and it updates my list in real time. It'd be great if we could create a standing grocery list in the order of the store and have the ability to choose the Qty without typing it over & over. Otherwise, this is BOMB!",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRURKM0JnU2Q4X3RZV216azVDbWdiWkRyeXFRT2FraGp2QlhzMndoTnlkak5JUnA5RUJIaVNUazN1T2c3ZEV3YXVxS0E5RzFYUDVEWnh3a2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Craig Purdie",
        "comment": "Like the interface which comes with many powerful features without sacrificing ease of use, so basically great.  However there are a lot of great to do list apps and you can not afford to have even one let down feature.  For Wunderlist the one thing that lets it down for us is the lack of flexibility of the widgets.  Seriously why does it need to take up the whole width of the phone screen?  Let us make it smaller and change transparency and colours and font size.  I need my tasks on my main work screen but I only have space for a 2x2 or even 2x1 widget.",
        "date": "February 18, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRnJuN051UXhCaFgtWUNoNmRBSHFLVnpOWjR4X1VrQTJWcU9BdU9WYllZM0xuM055V1lESmxnaHB4ZUZ2c0dRalRpS2dyc005V0hlSGdBZUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Rebekah Howard",
        "comment": "I LOVE Wunderlist and use it for both work and personal organization. Being able to break down projects and tasks is wonderful, so I use the sub-checklist feature regularly. I have it synced to my calendar and also use the reminders feature so I never forget anything, especially important appointments, and can see at a glance if I'm free at any given time. Some lists I never check off, such as family medication lists and the usual packing list, so I have those wherever I go. I also use it to have a shopping list synced between all devices (and shared with my husband's account) so I can add things whenever I think of them. I highly recommend this to anyone and am so grateful someone recommend it to me.",
        "date": "July 28, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR2JfTnpjNlJ0QkhXQ2RhVkhRYzhGbUF4aFFQUFdKckV2djJ2UjJEZ3BOVVRIWHQ4OTk4ank4VUlReHFTdy15NlgxQ1FuTFk0TWxSWlFrbEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Intuitive controls, easy to use, and effortlessly syncs.  This has replaced the inefficient written lists for our family for groceries, household goods, kid schedules, house/car repair needs, travel checklists, and even our future plans!  My siblings and I share a list to keep up with our elderly parents and their needs.  The ability to share just what you want with whom you choose is an added bonus when hunting for birthday/holiday presents.  We have been using the app for about a year - not a single problem in that time!",
        "date": "December 26, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR2R6ZV84YjhlSlgyNTB2YzhDZUtxaFc1M2ZuUlN0TEdUVzVHeElRNGtMbF8tRmlOcWNITTZVaVA3c3FWVGpGZUo0dFcxUVk1Y3JldzVWRkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Monnique Arnold",
        "comment": "I've only used it about a week and already feel more organized and ready to tackle my day and my projects. I tried another ToDo management system that was really great, but after the trial ended I would've had to pay $25 bucks to continue using it. I never have, and I don't think I will EVER pay $25 for ANY app. But this is way better than any app I've tried after. Thanks for the easy on eyes UI and simplicity. I'm complicated enough. I don't need anything more complex than me trying to \"keep me organized\".",
        "date": "March 15, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRzZmdjlZMWs3LUZjODJPSEpUZjRXeERqSjBPX0NVdU1FamVHR1ZIYlpxWDBJVnFuTUZ1aDVyREM0Q3o4ejBVODFMYTEyQy16N2thZVZZM3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Raymond Shen",
        "comment": "Ease of use is one thing I like a lot. And face you can prioritize certain task at a click of a button.  Having multiple lists is also pretty awesome. Also grouping the list by dragging them 2as slightly awkward. In that regard, it could improve. 4.5/5. Def better than some other apps I've tried",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR3k5bkZTc3BQT1pvVW1haXVZbjJVZFhkcU14eDFTZ25WX0JlVnpkdDljU1hQdXdJWW1EOG82ak5xM0VKU1g2Z2RlWEp4VnBvcVMxcnpSZXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jennifer Holmes",
        "comment": "I love this app. Used it for 3+ years and despite trying other task managers I always come back to this. Easy to use with a simple user interface. I use it for work tasks, team task allocation, personal tasks, shopping lists and holiday planning on both my laptop and phone. Only thing I can say I've missed is the ability to assign a task to multiple users.",
        "date": "November 9, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR0phRFI5U1JnMFFiaXB2S3Q5MEgxQTk3U2dlczhFbUoyeFpNZlA0dUpGVlR3Z1VQSWRHV0tmWlo5MDRGTzRQMkRGX250dGpXMExWXzJ5MWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nadine Garcia",
        "comment": "I love this app. We used to have a list option through one of our other apps to share. I was very upset when it vanished. However, that forced me over here. I was instantly impressed with the list formats and layouts. We are able to use sublists and chat about even specific individual items on the lists if needed. I am very happy with the app. I fell in love with the sublists... Nothing like being able to preplan the smaller items that go into our \"Construction Plans\" list!",
        "date": "March 25, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPSHVwQk9Jem91ZHFmQ3NJUVBQVmJSOUNxanc1TVNPVVdtVzhNbUQzY3NNNlZzOEo1RjkyT2V2N1RuV3pLTWFjVXRuc0k2aS1LX3ZmZ2lPVEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "FoodifyFlorida",
        "comment": "This app is amazing. Its simple easy to put things in I would only change one small thing, the repeat options would be awesome if I could select the days of the week to repeat. Right now I have multiple tasks for the same thing repeating weekly because this isn't an option. These guys have organized my tasks which I didnt think possible.  So thank you.",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRzRaV1hVVWhMMXc2cTJfNHFkMF95OU1zYlY0QXJuSWYtOFVRS2JpcG5CQ0NkLVIwLWthOWpwb1MxZGh0eWdVNXo1SVFydldTbjFYYVBMZEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Liviu BANICA",
        "comment": "The clean and straightforward interface, the instant sync and the availability on all major platforms convinced me to recommend Wunderlist as often as possible. Although I am very picky with the apps that get to stay on my phone, Wunderlist instantly became one of my default apps. This is the top choice when it comes to staying organised. Congrats to the developers and thank you for your perfectionism and attention to details.",
        "date": "April 1, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR1BuWFVpM3luQWMyR3Y1NkNOeEp4bDVUN3RvenVNaUE1Qm95LUNqelpFbFJVdDBMdFFRaEFBOVo2YXhWdmVxQUpBOXFsSDNuc2g2cWRSa3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "David J",
        "comment": "Excellent app, use it every day, syncs flawlessly with my wife's phone for shared lists (like groceries). I only wish they would alphabetize the completed to-do list (ie. Groceries, once completed they will be put back on the list at some point but it's so difficult to find because the completed items are not in alphabetical order)",
        "date": "June 4, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRUdjTmhnNUNGM1hDdVVTYWtDQWxaLXZ6ZGFPWVNpR1NkRmU2eWU2MW80OHBjNzZ0RldvYllXc2VVMEJTdlIzRW1CeVdvdGZWc1ZjNXEzeEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Vitor Canova",
        "comment": "The app is kind of good but unfortunately it fails miserably when we talk about synchronization.  I created some things with reminders and 30 minutes after it didn't triggered in my phone.  I opened the app and it started to sync.  Sorry but in this way it is just better than a piece of paper. P.S. now that it synced it triggered 6 minutes later. 😤 P.S. Just tested again. Leaving the app opened still didn't received any notification. It just work with manual synchronization.",
        "date": "February 13, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRzBnV0FaZTl0YUo2cnduS0JEVjJtN1VtWjgzU3ZOdTNDcXhzVllkN2JCalp1TVJDZUlJYXplQTNxcGdJZFJYbUZGVGJWZUJWcXc3N3VKV0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "David Harte",
        "comment": "Up-rating my review to 4 stars (from 1). My lists disappeared just before renewal of Pro, but after an email to support the next log got them back. Either it's excellent support or the error was self-correcting. Either way I'm happier than a few days ago. If it stays good for a few days more I'll happily up-rate to 5.",
        "date": "February 21, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRnJqelNJbEZIRG1wSk9nUW9vLWstVUVpV2JZemIxNW5xUXJoWEZGQzZGMkhJdEpWcG9qSnVKR1JoYV91RTN3UVV2dmMwWHFpb3ItQ01Oc2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Nyakwezi Katuliiba",
        "comment": "I love the app! Loved it right from the get go.  I'm a list maker and think in terms of to-dos and scattered tasks.  Wunderlist helps me pull all those together and keep track of my thoughts in various categories. It helps me set milestones within a particular task which helps shorten the entire list,  making it more manageable.  I can also share it with my colleagues and collaborators,  so truly,  I have nothing more to ask of it. Perfect app for me!",
        "date": "March 15, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRXFJR2JDR2RtSkdlX3hxckVOOTc0em1ZMkFWTHFMTXREeTZiN0gybVAtM1d6aGVJdkZKQ1ZYR3hJQjR6c19iVFFuRXR5Z2lrOGtmQkNRbHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Veronica Ugarte",
        "comment": "This app manages my life!! I (almost) no longer make paper lists;)! I keep track of all the adult stuff I have to remember to do from bill due dates to oil changes to wishlists to class assignments to chores! This app is AMAZINGGG!! I DONT KNOW HOW MOMS KEEP IT ALL IN THEIR HEADS",
        "date": "August 5, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR0dBZGlkVzhiTzJ6Y3JiQU5RS2hwS1VKM1FlNzJRNndxeHVyQWV0V28tbERvaEV5djExbkZ6eTRpOUljODdkbnZGTWpTUmNzS25sUDlNTUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Levi Abbott",
        "comment": "Fantastic, cross platform, multi-user! One of those rare apps that I really don't know what I did without it. Having it sync instantly, across users and devices is fantastic. Simple example, shopping list shared with wife on my PC, phone, & wife's iPhone. Note that the Android app experience isn't quite as good as on Windows or iPhone.",
        "date": "November 12, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR3EwdFdjUk9mTndMWHlBa3RxcFlQcGJ4aGtKTVlFdGFzNDJHaVY3RUtmaWJoM0JVd0tpZ2lTbzhYU1ByWkdoR05VWDVvRC1sM0wtM0VPMlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Shivraj Nile",
        "comment": "This is an amazing task manager app  BUT Please add some minor features like  1)Custom sounds for notifications  2)Swipe feature like any.do   [1 swipe for completing task]    [2 swipes for removing task]    [reverse swipe for postpone]  3)Persistent notification for upcoming(today's) tasks.  4)Floating notification bar to postpone/delete task like any.do  5)Everything is very very amazing.......   I did not thought that it was free  BUT  THIS IS WAY BETTER THAN any.do",
        "date": "August 16, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRXlGU19kemRFSlpNMEdYbE9Qd0tXbnRySzhSazBsUUNNVVpMMHFRZi1LdS1jRzdBekFLOWp3XzJuZHBUX0JsUHZIMDFtWW8zb2Z2eGh2ZVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "NITIN DHARMADHIKARI",
        "comment": "1. Very simple and effective 2. However few points for improvement   a. Internal search for key word should be possible   b. If task have sub task, then main task can be complete if all sub task are completed   c. Possibility of adding due date to sub task and Due date of main task can be due date of last sub task.   d. All sub task will get sorted on due date.   e. Recurring task should have three option e1) Create new task irrespective of present task status. e2) New task will be created after closing this task as per frequency e3) New task will be created but due date will be date of closer of present task + frequency  f) In shared list all task are visible to all, But if any tasked created in shared list should have two attribute one - Who can see the task & to whom it is assigned.  g) In shared list any one can complete task, on other hand only task owner should allowed to complete the task.",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR0FQQlF1RGVnT2VzYUl6cDdjWWtfZzBTSng0akVyMEpXU1V0WDV1RlF6YTdPMkdCdEtKNzhDZWlWOFd4Tm9wUXVBaE1YSGlCWWF4NXlLQmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Die Idee ist super und ich war am Anfang auch sehr begeistert. Leider musste ich mein Handy dann zurücksetzen und als ich die app neu installierte gab es meinen Account plötzlich nicht mehr. Sehr ärgerlich wegen der listen die ich bereits erstellt hatte. Die letzten Wochen ist die app dann ständig abgestürzt und hat meine listen gelöscht. Deshalb ist die app im Endeffekt leider weniger hilfreich gewesen als gedacht.",
        "date": "April 21, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR3d2QkZCYlNUeGc2RGdibDVaYWRmS2xWMC16akUzNUdXdFNhd2ZnOTViaGJhVEpiTmJEOHBwLUxjcWlDank0TDV6NEItSWwxMkh2dlh2WlE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Laura E. Davis",
        "comment": "Wunderlist is AMAZING! I've never been good at keeping lists. I always lose paper lists and I forget to look at ones on my phone. Now I use this in combination with paper lists because 1) I'm a writer and love to handwrite things and 2) I don't always have my phone with me but I can have paper and pens all over the house. But you could totally use this without paper. Anyway, I finally have a system thanks to your great app!",
        "date": "March 16, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRXdfZ1o2aXJVa2JMVEM2Z1dUOUFxbllqR3dhVlI3bktCSHZ4ajAwdjNqYWo0a29zS3NNOGQ1dzVtRVlpaGpZNTBKSzNhN21WM1dtdFd6NFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Erica Chu",
        "comment": "I use it to sync lists to all the stores my partner and I go to. So instead of saying \"I'm going to the grocery store, what do you want?\" you can say \"I might go to Target Thursday after work. If you want anything, add it to that list.\" It makes shopping a ton easier especially when you can look back at what was previously on the list. I also use it to keep track of tasks both short and long term. And checking it off the list is always very satisfying. I have been using it for years and my only complaint is the automatic reminders when you mention a day. But it's easily removed. All in all very pleased.",
        "date": "November 22, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRlJ4dDRpZVRhakVBbmM1MnJBdFBrZTI5TmpDLUh2NVd3ODFqeXo2X0FIR0JaMkcybzNYcThPcjhUMnZMcTZhU1Jod3hxcUtmUmFfVFJVX3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Crystal Warrior",
        "comment": "Used to b working perfectly until the dev team combined the due date and reminder. Now I can't input a reminder without a due date, if I del the due date the reminder will also b deleted! I've submitted a bug req for more than 2 yrs now n the dev team refused to chg this stupid design! So much for hearing from the users! For now it's worth only 1 star bcoz of this stupid design, it becomes unusable! I'll only chg to 4 star or more when this is rectified.",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRWZpM2tmTzFBcnFaTEc0N1gtWFlZZzZ1a1NwYXlHd2JTSldXU3oyTUlaczMxQ2NwR0pLOWVNY0tUX2o0WUdKVzlfbE9mMTJkYzByRGp0RVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Brent Casey",
        "comment": "Finally - a list app that works for me!  I'm pretty ADD, and Wunderlist has helped me out greatly. I have many permanent lists - one for each vehicle, telling when my next oil change is, etc.  Shared grocery list with my Sweetheart, a Home Depot list, one for each of my work projects, shared with my boss, or whoever...the list goes on, you get the idea.  I'm going through the \"Today\" list right now... The great thing is, as you go through and check off the tasks, they disappear from the list, so for example, when I'm at the grocery store and the list is blank - I know I'm done.  I've gotten family and friends all over the world started on this app and I've gotten great feedback from them as well.   Cheers!",
        "date": "September 2, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRWFLRzhTNDFqWlpOUW96ZmdhOThZTTZudWlXSVVrZWFiWHNCWkk5Z0FWZ3M5bDR3ZHo3cGZiYU9pX0dxM2NFbGh3eFVjVnU1cnFMVkdRY1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ashley Brown",
        "comment": "Once I made the choice to commit solely to wunderlist as my home for all tasks, reminders, and to-dos, my satisfaction with my productivity improved drastically. If you're slightly disappointed or still feel scattered, surrender to ONE method of tracking everything. That one thing should definitely be wunderlist. It's super simple, user friendly, and very useful. Highly recommended!",
        "date": "July 7, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRUEyQVpOOVJub1VZWHJTWWI1UXR6cFU5WkJHRXpfcnJLUlhjcURyVjNZVENPdjRnMnY0d0ZsM2c2RUwwV2o1clpkNzA5UDB6M1BFeWZHMUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nathan Swann",
        "comment": "This is the best to-do app created, you can store pictures and links against to-do items, I use it for all my wood work projects to keep track of the next steps and for new project ideas, also for shopping lists, and itineraries when we go on holiday.   I honestly don't know what I would do with out this app serving those functions.",
        "date": "July 9, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPRXlGbGlpMkRvSzUzdkNhcTRCdlEzX04ybGpDbzFRX1lyZVEzcWdZbEtzcWlRZzVjZ01wdVY3MUp6TnVrRzRwajBGa0x1bHprWVItX3FsbXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jill G.",
        "comment": "Nice and simple, exactly what I was looking for. It is very quick and easy to add multiple items to your lists. And once you strike a completed item from your list it disappears from view, but you can review completed items later if you choose. I have two lists going currently, grocery and to-do. This app gives you the ability to have as many lists as you like, and you can name them whatever you like. The ease of use is the most important thing I was looking for, and this list has it. It has everything I need in a nice, simple, take anywhere list app. I love it.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR2xCOUtEcC1YOG1CZXRTNHdMRDM1dmdLcEs5cnE4QkhlU1RPeTVsZ2VpdFV3MmhNQWJlQV9WLTM3UWN1elR6bXhGa2pMQUJMSC03UGRmemc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Stuart Scholes",
        "comment": "Excellent system. I'm a picky person but this has done everything I asked for. I especially like the fact that I can input tasks on the computer and edit/see/complete them on my phone.  Only really way of improvement for me would be statistical analysis: I've not seen a way to check historically on progress on tasks, other than looking at 'show completed tasks' which is clumsy for daily tasks.",
        "date": "February 18, 2017",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPSGUydDRWdmJSWGVBNHR1RVBRbkgxQk1sTnRDLWxlZEJXTS1sT3BiSFRYR2VzR3Z1bFVKQmZ0ZjJXNnJZbHZCQ3B4akdOcnZOd0hfOGZIRlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Perfect for sharing lists with someone. You can both add items and tick them off. It has helped our grocery shopping become more efficient... no more forgetting to get something because hubby can just add what he wants to the list instead of telling me and me forgetting! Good for all kinds of lists!",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.wunderkinder.wunderlistandroid&reviewId=Z3A6QU9xcFRPR2pabFVXcS1KdVFsOUFpcVdzVk0xX0FxR3llUEt4RnBabGFONTkzaE44bWk0ZWE5UkFNVEROeHdRMFRpR2d5c1lUVWlaVUVoUnJoX0Fka1E",
        "reply": null,
        "star": 5,
        "title": null
    }
]