[
    {
        "author": "Bjarte Aune Olsen",
        "comment": "I have too many problems with errors in the logs for this to be a proper solution. The app uploads more than one log file for each trip, and splits the trip into several <trkseg> in the gpx files. Usually all the data is there (at least as far as I can see), but I have to manually edit the gpx files every single time to get the desktop app to accept them. I will instead look for another app to log my trips and create the gpx files and use your excellent desktop app to tag the photos. – EDIT: I now realised your desktop app doesn't accept GPX files from other apps than your own. So I'm using GPS Logger for Android and GeoSetter for Windows instead.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSEFsRDVfbS1mY19XYjFFdnJRSmViZmVMWE9pbEN1WTZVRXVWZkR6aEtra2sxdTB6cDZmT2VXd2pwZ2lWWk40cHNZa3M4eUpLWGFwZXg3TmlJ",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Bjarte. I am sorry it doesn't work as expected. We'll have a look at your points.",
            "date": "February 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Kenneth Jones",
        "comment": "I thought I was purchasing a geotag app. Once I paid the small amount it asked for another nine pounds. I paid that and the app doesn't even tag my photos with MGRS coordinates.  Very disappointing and fell ripped off.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSE9jVERtYXp1cHNDaEVDOHRRUGdoR0V6dnFWaFlieTh3eXN6cGRVSUF6V21hUU1GTFpBZUtqVk9QVkg4VUFiekIzWGhlU3gzSVJvNllUT2Q0",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Darin Brown",
        "comment": "Won't geotag existing photos which is the whole reason I downloaded it. Why do I need an app on my phone to geotag photos I take on my phone? Just turn on location services. Waste of time.",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRmZ3eWhRb1h4bm4tVHFrZGlQMVdIMDhZcnF3YzlKcEgyXzZQNm94dFUyMjZQSi1MSWlSREpVWWpaeWo2LTFzUDR6dGJhN3NoS3h2dEpMR3pn",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Sorry it didn't meet your expectations. The app only does, what is advertised.",
            "date": "February 8, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Hans Berger",
        "comment": "Works perfectly.  Not too much power consumption, very quick tagging. Much better than the Panasonic app I used before.",
        "date": "December 20, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRnJnLWNQYWI0Mkt0QzJMUTJDSzR3c0E1SnBHMldYRGdTVWdoQkVmSW9SRzduNGJISzNCNHpkSDVkTVNMeGFWSmdjaEJFOEpPM3lfNHl5cXNR",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you!",
            "date": "February 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Bit sceptical at first, but it does exactly as described and very accurately.  Wish I knew about it and purchased it sooner.",
        "date": "November 12, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSGJ0Zk9sQXdkNTd2WFZWMXQzY2JuYVVRSTJ3Umh4NEhGNDVDZmpEYndKQVJ0VFVxdTl1NGJCNFR6ZlozRUx5U3VrRDFxZm9KTHJFU1E3U25J",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "We're glad you like it. :)",
            "date": "February 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Kenn Tan",
        "comment": "Google decides to break the KML format and you can't use it in Lightroom now. Lucky I found this app. It is smart and won't deplete battery like other apps.",
        "date": "December 16, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRk5vbUFfS2Vmd0d2UTJLWHJXVUJSRVJSbDZuTURTN1FTa3h0cGhTWk5KSW8yNWdlVFFwQVhKVERRUUlUQ2xVVXJYNm9pZUZBX0Jyd0dqYzlF",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot for your review.",
            "date": "February 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Nach erstem App-Update waren alle bis dahin aufgenommenen Trips gelöscht. Von den übrigen Trips wurde bei ca. 50 von 800 Fotos ein Standort zugeordnet. Eine Vielzahl hiervon allerdings falsch...",
        "date": "October 16, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSGk0alpIVlk0WjFjQ1E5LUtXSk54WklhSUZpXzhPNTFPVG4tcVI2WlA3a2dlemc2akM4U2dqZEh2MUd1XzJxWWVBZk16a2RIcWhEV3Nxci1R",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Could you please write us on helpme@tappytaps.com and further specify the issue? Thanks",
            "date": "February 8, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Brandon Gaona",
        "comment": "I use this app everytime I use my mirrorless cameras. It works almost every time and with ease. The only problem is it makes my galaxy s7 edge very hot and kills the battery pretty quickly, it also freezes and requires a force close every so often. But overall does exactly what it is supposed to and am reasonably happy with it.",
        "date": "September 23, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSEVDY2p6RjlXeGZyYnBSaWE1ZzlLNEZXVHBTY1phNGVsQkUwcUwyTkJRa3M4dEJKZVZtUlNJZmtobnotSENaQjAybkZLa01FZTlxRzlyNDdN",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Brandon. Thank you for your review and feedback. The upload might take a while if the trip was a very long one or the connection is poor. Do you possible think it could be the issue? If not, please write me on adam.ludvik@tappytaps.com, we'll figure it out. Thanks.",
            "date": "June 16, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ramiro Garcia",
        "comment": "I bought the full version and it has a strange bug that I never noticed in the free version. Once the phone is locked the accuracy lowers a lot and the tracking points go from every 10 seconds to about 40 seconds. Waking up the device causes de app to work flawlessly. Not sure if it's the OS (Android 7.0) that takes cycles away from the app or what. But it definitely tracks time different with the screen off and on",
        "date": "May 21, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRjFhdHRFSnRsMk9JcjN1bFVqRnpzREZ3TlU4dTZSVGN1RVFxaFlLNHZtZ2I5V281V0NlVDFFbm9qNVE0bm01WVozQndoNmFMeGJlbjRiVUVr",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sean Thurston",
        "comment": "I've used the Pro v.1 app for years and have always raved how great it is for the function. This is no exception. Nice work. For less than a good cup of coffee, is worth the upgrade. Edit: as of June 2016 all I get is crashes. LG G4. I'm going back to version 1 it never failed me and the functionality was flawless.",
        "date": "June 25, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPR2xmd2t0WktLRkFELXZtUUpNbUJXNUExYkhWWW9LR1d6MmUtQm9LbWVUU0l1clh1bkx0OVhrLUVTM28xVW9xNHdjZ1NMN0hsek1MdDVRT0lj",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello. Does it still appear? There was some power outage at the severs, but it should be alright. If not please write on support@tappytaps.com. Thanks.",
            "date": "August 30, 2016"
        },
        "star": 2,
        "title": "5 stars to less"
    },
    {
        "author": "Foil Cap",
        "comment": "The desktop app cannot be opened by Mac OSX without changing the security settings to allow applications from any source. Changing this setting defeats one of the main advantages and reasons to use Apple products: security, protection against malware. Even if you change the security settings and open the app, it asks for additional open source packages. The whole installation process looks very unprofessional. If you cannot do it right on Apple products - don't offer the product on that platform.",
        "date": "February 7, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSHFiTTBmRHQtWjRFUWNKZ0N1MGFNUGtmLUpUaTc3ZWRMQklMbUhSTWwxTU1MUDVTSUdjRWVIVVBKN1hPSmhlaDJBSC1nZm1qR1lvVHluQTE0",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Vlad. We worked on it for the past couple weeks and it should work now. Try downloading the new desktop version from the web and let us know if you're sattisfied. Have a nice day.",
            "date": "June 16, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Paul Coles",
        "comment": "Fantastic GPS tagging app. Works really well, doesn't destroy the battery. You can do a log per day, or just keep pausing and recording, it's all sorted by day in the gpx file.   I load the tracks into Lightroom, so I can't comment on any of the other functionality.",
        "date": "May 5, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSENpZktQZ2FKRmpKWlpPakg2dHRuSjFJSGlVajNLaURwcVJXcjBKYkdaSnc5YmFFMEVualFDUVdmektDNGNXbVhyUGxkNWV2NVRLZF9UcDIw",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you very much for your review.",
            "date": "July 3, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Judith Ferdman",
        "comment": "I have purchased the previous version and now would like to purchase the newest version but it only allows me pay the FULL price.  I have reached out to customer support of which they claim it is a Google issue.  I have reached out to Google and they say it is the app's developer problem.  Please help - does anyone else have this problem? I can't rate an app if I can't use it.",
        "date": "April 18, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSHBtcmUyR0czTkZucFM0b3pQb2tHX3RXNEtfLXBQekZIZlBpNVBYME81cFV3eDlQVTdtYmg4OUo5WlRUemV6Zk11TDBOS0QycWpqWndoUlc4",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Judith, we are sorry you're having difficulties regarding our app. Can you write me on adam.ludvik@tappytaps.com. Write me which version you have and we'll figure it out.",
            "date": "June 16, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Airlie Andrews",
        "comment": "The comments below was how I first felt. But now it has stopped, I have uninstalled, reinstalled, cleared cache and data, but it just says 'unfortunately geotag has stopped working. I have been asking for help for 3 days now, no response. SO MY ADVICE NOW IS SAVE YOUR MONEY AND LOOK ELSEWHERE - they take your MONEY but offer no support. These were my original comments - Easy to use. Bit confusing with the upload and getting into LR, but after a couple of goes it is easy peasy.",
        "date": "June 26, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRXl6ODAwejNReExacFhobnkydUpmZU0yd1FTNzNvV2k3Y3dia1pGelRReTBVc1JSMTdMazV0MFNSVEhnaWVJbDdMUHpnNXBzUG9yWWxWdEtV",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Airlie. We always offer our support as we'll do now to you. We just cannot do it on everyday basis. We'll look at that and figure the problem out. We certainly don't intend to take your money for an app that does not work properly.",
            "date": "July 12, 2016"
        },
        "star": 4,
        "title": "Was Loving it BUT NOT NOW"
    },
    {
        "author": "Manolis Stamatogiannakis",
        "comment": "I like the app but I'm doubting its robustness. Recent (June 2016) server-side problems resulted in the app not starting (crashing with no helpful message). This was a source of great frustration for me, as I happened to be on a trip and relied on the app to be working to have my photos tagged. At the price of this app, I'd expect a graceful service degradation. I.e. the app should still work, but syncing should be deferred. When this has been implemented, I'll gladly raise my rating of the app.",
        "date": "August 31, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSFk4UW5vRTRReXlhWUw5UEFleDB4b2Z2TjhRZ09YN193NEpDRHVkRC1jNzFOblRSUHRfTUU1cFZtWWtKRElncGV0anotM3FiVlhBc1hYYnBz",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello. Does it still appear? There was some power outage at the severs, but it should be alright.",
            "date": "August 30, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I really wanted it to work without internet. I succeeded twice, but there were errors in where I had travelled. One trip \"cpap\" was there with erroneous distances and then it was gone...too bad.  Thank you for the trial.  Jlo",
        "date": "May 10, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRWZIOW1JdWtrYU9sQVptMnl2V0VSTURrOEViY0tZVW9ONDVKRm02N3d4UXVjNVBrVnE4dXFHQm9qVUJDbUdjU2tsdDNLVzlXQ3RLbGc0SVV3",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Luís Veloso",
        "comment": "After instalation the application keeps crashing. I sent severals reports in the last hour regarding the crashes. Hope they solve this because the application has good features.  I am using the LG G3.",
        "date": "June 24, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRnNxeWctUDE5ZDlhaXk2akRyVHhndFFPZExEYWhxU1gyM3BnRGxaYmFrdl9OQzViRFR0Z0FXTDdnSHE3ZmVBaXlSbi0tdHF5MWV4Tl9pTmRj",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Luís. Has it been successfully resolved?",
            "date": "July 3, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Gary Walmer",
        "comment": "I'm very disappointed in this app. I tried the free version and it worked beautifully, so I bought it. I did two photo trips and the tagging was spotty. I discovered that was my fault because I forgot to reset the camera date/time to allow for daylight saving time. So...I got it changed and all synced.   I just went on another photo tour. I did not get a single tab even though the desktop app said it had tagged all photos. Some of these locations I stumbled across so did not have addresses for them. I counted on GeoTag to tell me where I was at the time. Very disappointed!  UPDATE: I just discovered you can change the time on the photos to match the difference from the phone. So I went back and tried to re-tag all photos from the days I had the time on camera wrong. NOTHING!  This App Is No Good!",
        "date": "April 6, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSElhZl9IV3RwQUVfM3N6WFFWNlF4QUFuTE5KRnFjUjlsOXdJN3NYd2lNWWVPMUpDcHYySHIzd09DNDBqaVBmVVVudFNmeWZzQ1dJeXV6LVNr",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Gary. Sorry that you have a disappointing experience with the app. Our support is there on support@tappytaps.com to help you.",
            "date": "April 13, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Mike Newman",
        "comment": "This app pretends to be a professional gps geotagging app but unfortunately it doesn't do a professional job. It fails to track you accurately and plonks geo-positions all over the place often hundreds of metres away from the track you actually walked along.   It's only useful if you want to know which county you're in, more-or-less, and will tend to lumps great wads of your photos in the same location.  Sorry, but I regret that I paid for this. I'm now using Geo Tracker (which is a bit basic) and I'm learning ViewRanger GPS (not entirely intuitive but I'm getting there).",
        "date": "November 27, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRUdHNHQ3Z3ZWM0FHaTFLQ0lTbnkyRDBiZTdwQTNCQk9ibUk1c1VOQUZ0TUpBcEZ5czBtTVR5VHN5dk1qTlVVbzdXNXJUVUYzOEYxVFdLM3ZN",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Mike. If you write us on helpme@tappytaps.com and tell us which devices you're using, we'll be able to figure it out.",
            "date": "December 13, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Andreas",
        "comment": "Keeps my phone awake all the time, the old app did not do this. Still missing option to always geotag (i.e. start automatically after reboot) and constantly notifies me, when upload was done. Please add option to hide this. Also, do you expect me to pay again, after already paying for the old app? Like the new design though. //Update: mailed dev a while ago, no answer, two updates, still nothing fixed, so I have to take away a star :( //still",
        "date": "January 20, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSGpyQ2M1YlNrRk1SNUJHSlRjU1B5NmxkcHVuRU9jcnBlVi15UVcxQV9RNVM1cUJYZ284cXJuUU1kUXRjaEhlTzlZX2FDQjVfN0ROSFNhMzA0",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "HI Andreas, we are really sorry you are not satisfied with our new app. Could you please send me more details about your issue, so our developer can fix it? Please let me know at jakub.snorbert@tappytaps.com and I will do my best to help you.",
            "date": "November 23, 2015"
        },
        "star": 1,
        "title": "Old app is better atm"
    },
    {
        "author": "Steph Parker",
        "comment": "The Linux desktop version doesn't work under Ubuntu and the test run of the recorder not only didn't upload the .gpx to Dropbox it didn't save it on the phone. There are enough utilities on Linux to geotag photos from a .gpx and there are better, and cheaper, .gpx recorders.",
        "date": "June 12, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRkpMT1I1X2JPcjE5b0tHaEFRWlFZckRSSFZQUjVfanVhUTNVajhZdEVNVl9KWW8zanFuZy12UWhMWHRQLUhxSEdCNTdhOXJOMjdvRXlvTkQw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Tom Wong",
        "comment": "I have used this apps many times but suddenly i cant open the apps and then cannot download my gps location whose are my important thing about my life......",
        "date": "June 26, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSG9UdE1peEY1VVFzd05nT1paMVJYUXlibXgtU2c3ZGRWMkJHOFpoZjU4VDhlMTZ3QlV4YnE0MWk1dWRRWGJmYkpYdFYydUpYTWptbUFTbXBF",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello. Does it still appear? There was some power outage at the severs, but it should be alright. If not please write on support@tappytaps.com. Thanks.",
            "date": "August 30, 2016"
        },
        "star": 1,
        "title": "Cant open the apps to retrieve my important gps location...."
    },
    {
        "author": "José Oliver-Didier",
        "comment": "The app does the job. However, I would give it 5 stars if it had a a way to add \"points of interest\"/\"waypoints\". For example, when I travel I like to add the place name to my photos it would be nice if the app would allow to add place name location or integrate using a location source such as foursquare or Facebook.",
        "date": "May 23, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRjdhVEQ0UEF0Q2ktMmU2OGo5UWZVbWlCM3JtcVM3elZjellrZnd2TjAyOVRfZ0JUOE1UcE93NlVYMXhnRW1YQk5fMzJvS0VCVUxILTJhY3dZ",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello José, thank you for your review and your feedback. ♥ We'll look at that.",
            "date": "June 16, 2016"
        },
        "star": 4,
        "title": "Great app."
    },
    {
        "author": "",
        "comment": "Great app.  Best I have ever used.  Very accurate.  Much cheaper than buying a dedicated GPS for my camera.  The GPX file created can be used with many Geotag programs on my PC.  Geotag Photos 2 has saved me time and money.  Great job TappyTaps.",
        "date": "May 19, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRVJjbWpPM3c1dVY2UlhaeVhRc0ZJV2h3T1dPU281Qnh1OXYyS0VtWVBQSnhzZzZKX19NS2NFMHAxV0RTVy14eGZHdTc1VHRrc1NjWFlhWm1V",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Great review, thank you very much for it. ♥ Have a wonderful day, James.",
            "date": "June 16, 2016"
        },
        "star": 5,
        "title": "THE BEST"
    },
    {
        "author": "Charles Wong",
        "comment": "I don't know if I'm doing something wrong but after I start recording a trip, the app dies after a few minutes (it's not running in the background anymore) and I need to reload it manually and restart the recording.  Also, where can I find the gpx files that the app generates?",
        "date": "September 1, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRjBrdGZSWnRTQmVGS3F4bV84dExlSC1CZU01ZUsxUHl3NmJaYlg3bHE5VUhzZ1BXdXdtaFBMajVNd0dRRU4teXRtZlBTa0lWQlVUcm5sU1dr",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Charles, could you please check if your device doesn't have some battery saving functions or if you're not running an application with this functionality? (e.g. some Huawei devices have these savings automatically enabled) If you need any further help, please contact us at helpme@tappytaps.com.",
            "date": "October 21, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Dick Wolfe",
        "comment": "Paid for installation but when I try to log in I'm told password etc. not correct. Help and I will change rating",
        "date": "October 10, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRjBBTlhRVjBNLUhLdUYwRzNMRTF4Q0JXbU96UndCc2ozODJlSHd5SmphZmdKRHppUl9qRUN3VnZOTkxoRFJPZllZWGFvMjFFajA2SDVrVXJj",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello, we are sorry to hear that you are having these issues. Please contact us at support@tappytaps.com and we will do our best to help you solve this problem.",
            "date": "October 12, 2016"
        },
        "star": 2,
        "title": "Need someone to contact me"
    },
    {
        "author": "Trent",
        "comment": "Fantastic app, the best I have found for geo tagging photos. Works perfectly with Samsung S6. The desktop app is also prefect...why spend hundreds on a on camera unit when your phone is free and in your pocket anyway?",
        "date": "June 27, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRnRkcWVlNDhGRU5taEcyYlNVVlU5azZUcmp0NUpPaktNR1YtMkNXNXVEYWFEVlcydW41cmpnd0VLUTlWNm9OTHREU2hRWGxpdmRJaE1ReF9R",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you very much for your review.",
            "date": "July 3, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Amr Eldib",
        "comment": "This is now a must have during any of my camera trips. My camera doesn't have a GPS, and this app resolved the problem very well. The mobile app is beautiful and easy to use. The desktop app is simple and does the job well",
        "date": "March 28, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPR1Jxc2VKNWlBb2JCUHpzdm5uRUdBZkVKYTJFNEhuNU5ldGY1TW9jRnFWSUpHTjM3Q3ZxVWczSFBPcVAwOVFGeUREOG1nZV9RSTlrWGRMNzBR",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Amr, thank you for your review and for using our application. ♥",
            "date": "April 6, 2016"
        },
        "star": 5,
        "title": "Works very well"
    },
    {
        "author": "Xie Weiqing",
        "comment": "It automatically stops Everytime....",
        "date": "June 25, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRXpjSVdYUHFkTzVSb3VBTkVfOWFtTzRnVlp0V1VtVE1ubXpMbG5UTjdlbHlfRHB0eDk2dFZXU3oxV0FQT2RhT2Z1LWctM3VfQlNQWTVLMC1R",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Xie. There was an outage on the servers, but it shoul be okay now. If you have any problem, contact me on adam.ludvik@tappytaps.com. Thanks",
            "date": "July 12, 2016"
        },
        "star": 1,
        "title": "Nexus 6p always crashes"
    },
    {
        "author": "Maxime Gratton",
        "comment": "When I tried using it, my trajectory was sporatic.",
        "date": "July 3, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPR1FYRlQ3TmpTYko5anFvMHN6YmJ3NHR4RUx6Umc5dDlxSTdmRVhiYUttdHFQdS1hLTktTjFjbG1lVjM2aFdTV2J1Mno0NFNxVFFieWpTMEhN",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Maxime. Please try contacting us on support@tappytaps.com. If you specify the problem and tell us which device you're using, there's a very good chance we'll be able to help you.",
            "date": "July 13, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Martin Vines",
        "comment": "Development team very responsive in fixing problems with ap",
        "date": "July 2, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRXEtZWJGMnItdzNIU3ExTDZZOVdWeWhoVGdvb3Nac1lGNnMzM0FMeFZvNzloYjl2Qi1pZnJhX19MYUhKcnlUeWpZUGh6bFlxMFJFZFB3MVNJ",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you, Martin. We appreciate clients' communication.",
            "date": "July 12, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Daniel Lisboa",
        "comment": "I use it with Lightroom via Google Drive and it works fine! The user interface is very well designed!",
        "date": "March 5, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPR0xVeWtSeUIyRkN0Ym0xOFVPcjRaTExfSVZTb29NSTEtcUlWVjFaa0lBTHhiQVQxX3Y2aVcxZE91Unp5SkVNMllyQjFxbWhPeldLVFlycWxz",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Daniel, thank you for your review and for using our application. ♥",
            "date": "March 7, 2016"
        },
        "star": 5,
        "title": "Very good!"
    },
    {
        "author": "Ash L",
        "comment": "...given the number of higher rated free apps that achieve the same goal.",
        "date": "October 2, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRWs3OEJqSkdrb3l1NFIzeFp2emRsdE1GM3ZkRmNBUDZnVUdCdF9aYm4zTHpWODVzRVpQQWRza2RwUVN5bXc0LTZDbDVDVFdsUzVhb1JjV0l3",
        "reply": null,
        "star": 3,
        "title": "$10 in app purchase seems a bit rich......"
    },
    {
        "author": "Shmulik Shuster",
        "comment": "Great and cheap alternative to gps module",
        "date": "January 31, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRk5ZOU45Q0tDT3RKc19UR25LblVDZktrckhhWEJhZnpvTXo1MHFFb1hTRURsamFYNUdFZTFiMEtlakdzLVJCMzdPSGpvNXNQeXlQUVJGNzZF",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Shmulik, thank you for your review and for using our application. ♥",
            "date": "February 22, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Giang Nuyg",
        "comment": "Does what needed",
        "date": "November 25, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRVYtTlV5MFBnaDlMOVU1YU5EWDA4S25QSXBGdmc1aWJBempVdXZCVzlGc0dGRWNrNll4bFZEYnhqZkxCVEZ3WVhwaTBxVk1iT1FwZXM3UTdj",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks. :) Happy to hear that.",
            "date": "December 13, 2016"
        },
        "star": 5,
        "title": "Eady to use"
    },
    {
        "author": "Richard Armstrong",
        "comment": "Used this app both home and abroad and it recorded flawlessly.",
        "date": "July 17, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRUVNRXpGTXhkc3RrN1FXcTFvSi13MlVFakZmWDZ5bzdaMUd6d19jNFB5VnlONUUwOWtwUmpRQ2F2aEpldUlFeGZLTVIyTUsxOFRySnhwcU5r",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Great to hear. :)",
            "date": "August 30, 2016"
        },
        "star": 5,
        "title": "Excellent App"
    },
    {
        "author": "Clem T.",
        "comment": "Doesn't take photo",
        "date": "May 8, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRW1xWmdpTmFUemh0dU9QRy1YM3J2dUVPQ19yUVBpMGdfVHFjNm84TnFXczNlQnprb09pUTBZTWQ4X3VBelktSkNQckt2cFJDRmZkT3pFVTRz",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Stewart Audsley-Munro",
        "comment": "Very good and cheaper than buying add on GPS for SLR",
        "date": "May 15, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPRjF4UktOTWJOVllzVUhhSFFKNDRkcnNyOEpINTZLeEpocDFiSUJfT2FHaGk2UWg0RDZzbDRBQjY0UEFseV9rOElmV01NbkM1T3FkbXlfVmcw",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Stewart, glad you're sattisfied and thank you for your review. ♥",
            "date": "June 16, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Paul Abrey",
        "comment": "Like it.",
        "date": "December 2, 2016",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPR2w5b3VibVBzMWNMVHJfZ080VTl2b0MwZFRPVi1pMFc1RU9DcFppejFpYTJTV3pUWmFDOWZTYmh4bzdQYUFhZm9aQlI1YkNZRHNJVHZ0dXRV",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Glad you like it, Paul.",
            "date": "December 13, 2016"
        },
        "star": 4,
        "title": "Great but a little battery hungry"
    },
    {
        "author": "Chris Newham",
        "comment": "Great for creating a GPX file of your adventures.",
        "date": "June 15, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.geotagphotospro2&reviewId=Z3A6QU9xcFRPSFBBWjB3OUxzTmc3ZTFqeHBETlJTNE5rd1hMcWpGaWxvNDNGUTl3QVRNSVdpd0NZTkR5RlBFRzR3MU5YdGRobU9Qc2R1N2l4QWwwQ1hZandJ",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks!",
            "date": "July 3, 2017"
        },
        "star": 5,
        "title": null
    }
]