[
    {
        "author": "Hybrid Gamer",
        "comment": "Why does this keyboard app was not updating frequently? It would have been better if this app supports more language because this keyboard depends on autocorrect function so countries like in the Philippines where we cannot fully used this app because it doesn't have tagalog.. We can only depend on inputting our own languages so it takes more time in the few months I think before you can be comfortable on using this keyboard.. So it takes so long.. This app has so much potential.. I've been following minuum since it started here i think that was 3-4 yrs ago but since last year im not using it because I was waiting for more support of languages..",
        "date": "August 22, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRk1xMmRITnhuSmdQWlIwbUUxUlJhRjhxZDcwX1dpMHUxV3VxQU51LTJqS2NnNXlDWDVBWXJPY2dMcHc4UHpZTFVrbFFoYVJVQ0MzclZTRU13",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Trevor Waters",
        "comment": "I really like the concept of this keyboard. The prediction works very well and once you get used to typing on it you can type at a pretty decent speed. The main issue I have is not being able to move the cursor with the spacebar. While the amazing prediction removes some of the need for this feature, if you want to go back and correct a word it can be hard to get the cursor positioned correctly without this. Otherwise this is an excellent keyboard,  especially if you use split window and hate how the top window is almost completely off screen while typing.",
        "date": "July 30, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPR3dFSmx0RFM3RmUtVU1UdURlTjVqTERtM2pGR1dSeUN0RmhuTW5NdUxPR1JuOGExdXBrblpKeDB1MzREb3Q0NVFaSEJBaG8wRHN3aVZUOVFJ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Julian Gudger",
        "comment": "(one year later) Punctuation and capitalization issues in Evernote and starting to see same in other apps. (One month later: still using and it's a good keyboard. Don't be afraid to expand it if speed and accuracy are paramount or using esoteric terminology - which I did NOT for this edit.)  Not bad. I assume most reviewers are giving feedback in same day as purchasing. I say give it time and it will become easier.",
        "date": "July 16, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRV9faWo0a3Z3QVY3bXFSbC1UZndMMnR4Q2hrVGdYajdlRGllOExTUVdGeUxONTAtS1dQREVKYmtnNFBGU2dMSmlRX2dlazVOcm55YmtvaEtv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "tastybeets Swashbuckler",
        "comment": "I sadly have to change the rating from 5 to 3 stars. Devs don't respond. Navigation bar has replaced physical buttons for a while now, but the Minuum keyboard hasn't been updated to resolve it. As of now, expect everything in your spacebar row to be completely covered by the navigation bar. Sucks because I loved this keyboard.",
        "date": "September 19, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRlBfZDJCZm9FWkdlbDQyeTZ0Uk05TTNWQmhoNGZrX1hnRTJXeERiamVrY1dQcWhxcHZVRXlhX1ViWm5peS1SdzhEb2s0bHFzamhHaFNMVllr",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Rune Koldborg Jensen",
        "comment": "Refreshing new take on a keyboard and surprisingly beneficial to have more screen estate available to you while typing. However, one huge caveat is the lack of different languages. I would love to start using this keyboard, but until Danish (and Icelandic) is supported, it is a no go. I bought this app before it was out of beta solely on its promise, so I hope these two languages finds their way onto the roadmap soon.",
        "date": "April 7, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRnIzOHNUSTBlRkpXVUMxZDdtcTFGMjI3Y1NPZkM1OXlMR3VhT2lzd08tSVJoN2NqZlJGS0Z6VGtSQXY1ZW1zVWxQblBHV3o2RU9yWWUxV3BN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Steve Monroe",
        "comment": "Great! Drunk typing is dope, hard to switch back. Predictive/synonymous emojis are terrific too. Backspace by left swipe is great. Customization is good. Only thing I hate is doing the damn tutorial whenever I reinstall it.  happy to pay for the pro version tho, this is a terrific, fast keyboard. Trying the Spanglish feature and hoping it works.",
        "date": "May 30, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRTNxbG5QZ0FaQnlaYzBEY1RoMllmam91cVc4LWxfYjN1TXBBMnlpR3RUNl8tSHRjaUNoaFlfdXhfS21WSndOUjBhQ2VrYXVqU3phS3plZzRn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "David Brideau",
        "comment": "This keyboard is truly the best for one-thumb or two-thumb key mashing. Predictive text autocorrect does the rest. And is it ever good. Although the auto-emoji feature should be banned - don't you use that, you monster! Also it kept nagging me to rate it even though I did so quite a while ago.",
        "date": "June 1, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRjNyU3RqaXVlLXpfMUdsZS01OVpBYWdYLVRNQlc5eTBNRFd3QmZySWktMGkyXzNTMVdFZXphQ3g5cXVHWWRNZHZ4WG42RGR2N1lEYXEtYVUw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "ganoo",
        "comment": "Very creative. Very minimal, as the name implies. It's actually quite easy to pick up, and having multiple shortcut gestures makes it even more intuitive. Themes are also pretty nice. You can customize the size of both the shrunken keyboard and the expanded one. There are many other settings to fit the keyboard around your preferences. Also they do not take any data from what you type, as all phrases are stored locally in your phone. At least, that's what they say. There are no accounts to sync any info of your previous settings to a new device, so that may be an issue for some. However, privacy is more important.",
        "date": "November 6, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPSGhKaDZiQmJleFRyTmVCSHBMRm5DUXkwV1BPeU80QnhWYnFOZWZMblRCcWZJYkUtZ2w1Yk5hR2JpUzZ4UW9JbWNsRlRjNWMyQjBaTl9NOGEw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ahmed Al Aqtash",
        "comment": "I was so happy with this new take on keyboards, and the support was superb when it was new.. now it seems like whirlscape has a hard time staying relevant, since they focus more on emoji extensions and other quality of life things, than actually getting support for more languages.. been waiting since the keyboard came out, but alas.. lost money is lost.. don't buy this unless the language you want is already there, in the hopes that they might add it",
        "date": "August 14, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRzU5MVFra0ZUQjhIdm1PX0hnd3BPVUd4UEFFdmJ4Qi1QOFFGbHFOWlBucmY4Uk5nbG1NbjMtRGdrazNmQlhWVWNUSEJyS0ZxSUFFSm81MllV",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Aldo Rodríguez",
        "comment": "The best keyboard out there, not very good at predicting other languages besides english, but it can learn. It was a no brainer, bought it on the 2nd day of my trial, two years later and I rearly change to other keyboards, only for some specific things.   The only thing it's missing to be perfect it's the alt, ctrl, f#, esc,... keys; I only change it for the Hacker keyboard",
        "date": "August 11, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRXk1MHljeWxrdTVic3dKeXoxLXlSMEs3SWZKSFpNRl9SM2xGOUVvY3RyczVCX3J3U2dJVXg3RlVCMVYwQkllZzdLUFdOX1FtOGJtSkY1Ynhv",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Joseph De Sousa",
        "comment": "I love this app immensely. By far the coolest and best app you can buy ..I first was fascinated by its concept and the benefits. I know it takes time to adapt but it's great in the long run. One handed type never got better",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRzZ0UXVURmZaci0tQkdGaC16Tk5vdklXLVRYVnhsTUJZdWQ2aFRJb0dvX3gzS2l3OHZETmo5VklsSXBqOFc3ZGM1dzdoNVJwcnY4N2paMXBj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Michael Hendricks",
        "comment": "I'm very picky about my keyboards and this is perhaps the only one that I really like. It has the most accurate typing that I've ever used. I mostly use Minuum in full size mode, but the mini mode is also good. I wish Minuum supported swipe-style input (ala Swype). I would love to have Minuum's awesome autocorrect with swipe input, but the omission is acceptable.",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPR1dBNWNKTk8xNkJKd2xVeXl1cVJkMTd0NWx0SDBEMkIxNWdCNGVCbTNWZlBmYkI1eEdRNUs1V002MEdWTHZteVZnWmZ3ZERpUlF4WGhlZWVB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Steven Ercolani",
        "comment": "Like anything new, this keyboard take a little while to get used to, but don't worry because after a bit of time, you'll become a pro.  The only thing that is a bit of a problem is that you have to watch what is coming out because sometimes the predicted word isn't right. Would love to see Android Wear 2 support.",
        "date": "July 28, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRTBBQ3dzZFcxRU9QcjMwekNWY0llVWl2NlFaNjhFbkQwaDJ3VnJCZjJHYWdmZUtHeUtVWVVURnJXbTZXRDRYZk91dUFNYVFxV1IwcEtaZktz",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tre da 5'9",
        "comment": "Simply one of the best keyboards and ideas in the smartphone era. I only wish it could be smarter about opening the \"precision\" keyboard. However, I think the value of reclaiming screen space while typing has diminished a bit in the era of the 2:1 aspect ratio phones.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPSENmNmVnZWNaODRySGh0akVNd25tdzZrUG1LVEJXMF9FbVJyeC0yLU56MzlOeUhJbUFYZFFPbi03RFF0UEVnQUphbmVFWmtnZGxSMjNJTm40",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Gabriel Graves",
        "comment": "Sometimes it will randomly make the next word I'm typing all capital letters. This just recently started happening. It will also sometimes suggest that I type the next word in all caps. Who knew a keyboard would want me go be more aggressive!",
        "date": "October 13, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPR09YME41ZTF4eE5aWC1tR2R6TERtNmt4TUVrcHVJR1pPNUtrNE02UnNZb0hHV3ZhN2g4aFhSSVg0aW16UkxUc2JsSzFrbEJPV1RnT2xMV2o0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dennis Drabinski",
        "comment": "04/2015 Nothing really compares to the sorcery that is Minuum. Without a doubt the most innovative keyboard on Android an arguably the best. Pretty much perfect predictions and all the screen real-estate you can ask for. Getting better with every update. Perfect score.  Update 09/2017 Unfortunately it has not been updated in months and is unusable on my G6 due to the app not seeing the soft keys as a barrier.",
        "date": "September 14, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRlc4dko3RndFektDZVVrbHJaZ2ZGaW53YUNjNEpHTE1QVDdYVzh0NVZ0a095MjZfb2NKV3Bqb3dUUUt0VDBiZFl1aW5PZVlWWTZndUdQZTZz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Roel Zaremba",
        "comment": "Use this app for a while, let it learn the way you type and you will be left wondering why you would ever use a keyboard that fills half of your screen space ever again. This took me no longer to type than it would have taken with any other keyboard (except maybe 8pen which I never got the hang of) and I have it set to be the smallest it can be, I've only been using it for a week and mostly in Dutch! I feel like a badass using Minuum.",
        "date": "September 20, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPSE9mUXVldGRRREkyeXJraXY4dEYzaXo5QXJ2dGdtaVBCLVBSMzhNTmZJZzZnUFhtdEZQbTBleENyVHVxVHVQSG1pU3BDUXJRRFVwZVJJQnVF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Garrett McCallister",
        "comment": "Loved it on my Samsung Galaxy Note 3 because of the layout, accurate auto-correct, user-friendliness, small real-estate, etc.  It sucks on my new Samsung Galaxy S8 because of the fake buttons. The keyboard overlaps over the home button. Unacceptable - needs updated.",
        "date": "August 27, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRTVabkJaWDZRczZIZUhyb09aa1VpaXliMVpHZ0VYZzdDWVhIaFZlZnFHOVNKZVcxaUlMVXZNUGVYTWxGSjVzR2IwZlQzUlZqN2hoQndZd0hB",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "ruxahn Kori Wilcox",
        "comment": "Want to see your screen while you're typing in a chat or text? Wanna use a full size keyboard instead? Want to customize the color of your keyboard? Want to be able to text your wife that you're safe but are too drunk to even see straight and need a ride home? Seriously, at least give the demo version a shot, you get used to it really quick, I personally promise you.",
        "date": "November 14, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPR09pTEwyZ2hJQ1V3V19FQXBBOGE3d0lBZFZ3dDlHQnQ2OE53cFdiQnAxZlVPaXZCd2pUbVpoU1A2aWZQbmZLR1V6OTBidlJ1VzNwLUljRDM0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Dave Van Eetvelt",
        "comment": "Hi, I rated the app four stars because I like it but am missing some functionalities. Maybe I just can't find them, but the keyboard layout is different on the screenshot than it actually is, is there a way to customize it? I mean the special characters next to the letters and the exclamation marks and so on. Also swiping for the special characters takes some time and is not always accurate, can a long press be enough if you just want the first or only special character assigned to the letter? A last remark, the auto correct seems to pick the word it thinks it is instead of the correct one it knows and I actually wrote?",
        "date": "July 18, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRzBqU25jNUJxeWVfS2pvbDNPQUM4LW80TndsRjJiVGRqRk5rYXg4ZFRhRjR1RGI0R2tscFktRDJBd2FzZjFsbXo4dzJ5OC1ETkQzWVN0eFk0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dan Callahan",
        "comment": "The keyboard still works well, though it does still take some getting used to with how aggressive it is for word suggestions. Transitioning from single row to full board still works well. If you don't need or want swipe style thing typing, this is a unique take on it still, that has no equal.   I still get people scratching their heads when they see me use this at times.",
        "date": "February 20, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRXRmbDlHNzFSeUdJUnNJVUJsUzZmUUF2bTByQlFDanBlRE5DOHc0RkhIMVJkUVFnNWRoVnRTWlBYeEJUM0hfUlpxbFRKalRyODYxVEt2OXVZ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "ZiCott Ameda",
        "comment": "Been using this keyboard since beta,  and I never want to try any other keyboard....ever. Love all the screen space I get back, but for some reason the sloppy typing is not as good as it was before.  Not sure why, but the predictive typing is worst now than ever before.  I will continue to use it, but my patience is wearing thin.  Lets hope an update can fix the prediction acurracy.",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPSDQtT05EMFMtQzM1NjVoYW04RXlEUjA5ZVRMOXREdkwzN0wzZXNEQUF6UzhiZjczZHQzazNtOHg5VDZIRGg4anNUci15cER1Z2NkN3RnS1p3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nathan Stanley",
        "comment": "The sloppy typing word prediction is really good. It gets it right 95% of the time. What I find is really lacking is the \"next word\" word prediction. It doesn't learn which words I personally string together often and offer them in the word prediction bar. If this could be improved it would be GREAT!",
        "date": "October 1, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRW5CdE12aHZPVFg5VEw2VlNnakZ2TlQ0TGlXcVNUM2NzSWF1S0xfTmViZ1ZZNTkwbF9uMUV5c3Fmbi1DaGtOLXFjUmVPR01LN1VaWTJ0aXFn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Andrew Elie",
        "comment": "This is quite possibly the greatest keyboard app I've ever used. I can type exactly what I mean to type while also going as fast as my brain + fingers can possibly go. It's truely the kind of thing that Arthur C. Clarke was talking about when he said that \"sufficiently advanced technology is nearly indistinguishable from magic.\"",
        "date": "April 26, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPSC1SWElmblNUVm40M0FfZ2doZHVLbkVnclRyVUt0ZzBQdWZ4OHh6T1ozam4tTUJpUFVQdEtmVVE3MDg4eWNFMUZjZ3l5MEJmMVVidk5qRG9J",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Leonard Young",
        "comment": "Very good. One thing I wish this had is swipe typing, although it might be difficult on such a small keyboard. Also, the letters on the keyboard are always in uppercase... So sometimes it is confusing to know what case you are typing. This is rather rare, however. I love that the size can be changed.",
        "date": "July 21, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRnJSX0g4SDROdEhTRkNwbTVabjB5dVlFaEo0Ykl6Ym9mU21ZSmRyQm50bTBPeHFiUFdrNDV3djV0X3oxSTB0bUNDRWpjZzk5QzNnNG5LNHpJ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Caw109 Na",
        "comment": "Is there anyway you can make this thing stop auto correcting actual words?  When I type or I want or not if,  of, it or anything else.  Really frustrating.",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPR0drVWRVdG0zNFVnVlZ2YWxxSmtCN1d1aVYyeE1ORG1UTl9yQnRTQUUyMzA5ZXFaMkxyTUhUcFVBeEZJQ19LWGF2LUZKY1JxZi0xY0FjN2Y4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Albin Karlsson",
        "comment": "Awesome app but there are still room for improvements. The thing that really anyone me is that I can't have äåå enabled at the same time I have both English and Swedish enabled(sorry for my bad grammar). plz fix dis",
        "date": "October 28, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRVVzNVh6SWhXQ3dyRFNKSU94dG5tWUxJaHczc1F5LUJuVnVxb1M0SU9pb1dvMXZQLXVzcmtTd1NTVlNzNjR2ZXM0bEJ5V0hOSjBVeDBvM1ZJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Scott Johnson",
        "comment": "Been using this for a while now and it does learn.  One issue is backing up my data. The uum file doesn't show up in downloads. Would be nice to send the file to another device. Also I'm not a fan of transparent keyboard when it's floating.",
        "date": "September 23, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRUNVTDk3ZEJoT1hlZ3R1ajRNbXVEYWVVMEVBdzhOLWhQVzlwdnVlS1pCOTJBZFZSdjZiQTFXQWRFMXFRNXFLNEN5VzhQSHlfV3dOUU95WFU4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jiunjeh Yee",
        "comment": "The keyboard is being covered by the navigation softkey bar on my LG G6. Had to increase my spacebar height to the max so that its usable. Please fix it. Update: e-mailed developer but no reply whatsoever. Very disappointing.",
        "date": "May 26, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPSFNhVUt1VTBMd3I1STgtXzVXVDJNQ2RtY2FiTm55UnlMOHpINkZIMkRqVzJtbV85YnkweURtbUdMODY3cUIzSlpxcUhwMU41dlpYVmpwVjNZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Cobus Kruger",
        "comment": "I've given up on this. Nice idea, but a keyboard that depends very much on auto correction needs proper dictionaries. Only four languages? Okay, so six billion people don't matter, apparently.",
        "date": "March 10, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRkppMmdRZHdmWU1DZ3lzNlJBRW1XMHgtX1VXQjBNVC04X2xGaVVyT1NtWGMtZ21lQW55UV82ZnZYUXd3NnRJbkNBU0xsNGhUajVxRmtManZZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Stephen Dockendorff",
        "comment": "Gave the paid version a try and did not like having web addresses 'smart corrected'.  Very frustrating to learn.  I spend more time correcting it's flawed 'corrections' than I do typing.",
        "date": "February 22, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRVdjMjlkRHMyLVJrT21NMzJtOFp1T29pZWxsdDM5UGFsUHFLZGMtWlh6RlJHRzRBNTF4ejUtVktzUUV0TFF4MDhlWHRMOUtVU01NUExkUl9r",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Roger Toledo",
        "comment": "I've been using this keyboard for a while and I think this is a fairly good keyboard.  Yes, it does make mistakes sometimes but not all time and most if the time of works pretty good. Apart of this sentence was typed  without looking at the keyboard and most of the time it chooses the right words.  I'm pretty happy with sometimes it thinks that I finished typing a word of it adds the space way too early and that can be pretty frustrating,  but nothing is perfect and this does the job most of the time.",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRjJnR0JPbmRWT3RmWm5SbzNDbERVV19LRXFNSzJpdEFYeEFDRm1VbUJNbjBXYWpJRDh1QXJ3ZkV2ZFFVTFJhZnExbTRjZ0FTbmVjeldFeXdR",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Precious Athena Padua",
        "comment": "In love with this keyboard and can't use anything else but I just recently switched to the note 8 and it's not really compatible. The bottom area where the enter key/punctuations keep getting blocked by the navigation buttons on most apps.",
        "date": "October 14, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPR1JKZUdwbkVVTmhQemhKR21VSHV5REl2X1ZYMHlPMmU2dzdTX1J1N1c1TVo3VFZWWDhrNzQ3eVlPRVltR2ZjbUNNWVZ5VC1iWmFMNmJua3BF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Benjamin Coo.",
        "comment": "For years this keyboard has worked well in every app except Google Docs. Input delay skyrockets in Google Docs to the point, Minuum will simply crash. The developers have yet to even fix the issue, it's really disappointing as I love this keyboard and want to use it 24/7.",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRW83OFVoZk5BTTdTT1FCZXFuVG1QS2hyUURiaWRYU1l4dFdpcTB4X3Uzd0JiSXlnVzZTVXVZcU1hbnBQYmFhTEpCbFRJMmpLVFBrNzVZWmln",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Devon Mullane",
        "comment": "I liked swipe features but the speed and accuracy of this keyboard means I spend less time correcting and makes it totally worth it.  I hate rating it badly but I took a star for a lack of a dollar sign on the full-sized keyboard.  I will up my rating when this is fixed.",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRWNKaUNIdllYWEVTWkM4ZkxaOWlSRzMzenUtMDBqYW1NU0xKMDlIQkJTQjRaWnZKVGd4b2dRRnpLaUUzUEpZNDRQcE1pUEhGLTY5OHJWTVdJ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Robb Craft",
        "comment": "Ive honestly tried to switch off of this keyboard after a long time of use. Nothing else compares though and i will always come back",
        "date": "September 27, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPSDhBX0otT2NWLUl4NHpHeXBpdzE3NDJiMUR4ZWNOR3FiWG9nWmR5YXUwankxcUJLYzJYSWxZMVR0ZEowT05GUnBaOUhkTG5Uc1hKUkhJWFZF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I own a device that is used in landscape mode and any keyboard I tried took up the screen.  Minuum allowed me to be able to see what I am typing and did a better job of auto correcting any errors than the stock Android keyboard.. This is the first app I purchased in the play store and possibly the only one I would willingly spend money on.",
        "date": "December 27, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPR0tCbjV5b09kVVVycElWQ0RtXzNON0M0ZGxxMHNOZ2dWTXhNNTh4a0VpcWVCd3lWRGZBY3NJNjV3QktxSXVMMVlfNG9iZjgyM29SQ2xXM2Q0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Matthew Stango",
        "comment": "So far it's pretty good. However, it's not patched to support the galaxy s8. The navigation bar cuts off the entire bottom of the keyboard in both Minuum and full",
        "date": "May 29, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRUg2ZDNCTHAzN2ZNeUJhUHJrTUl5bW1ocW1tNm93eXFaNHlxV0ZRMUdSbDFDM1UwN0JZMHdDOHllTWhDRklZam9CX1hHSFdCbkNIVzEtc21J",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Will O",
        "comment": "This little keyboard can be tricky but it's aware of what you are talking so considering how tiny the keys are it figures what you MEANT to click and corrects your unavoidable typos quite well. It even learns your typing and gets better at correcting typos. It's not the easiest keyboard to use but it leaves so much more screen space for your apps that sometimes it's essential. Amazing tool for guys like me who use apps that get blocked by the keyboard.",
        "date": "February 26, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPRjFLVWVraGZqbWg0RmxCWkNWT19QbzhuUkcxOTdGZWo5R1JHLXRMTmZ0YkRhS3dTZjJMREtLTy1CZk5DUFVlSi1KMWg5bGRzdm55djNOWlpj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mark Bold",
        "comment": "PATHETIC...  IT INVARIABLY CHOOSES POOR PREDICTION OVER ACCURACY...  IF YOU WANT A KEYBOARD TO TYPE EFFICIENTLY... PLEASE DON'T BUY THIS AND GO ELSEWHERE... THEY ARE NEW AND DON'T HAVE A CLUE... PLUS, THEY WILL IGNORE EVERY EMAIL YOU SEND",
        "date": "February 27, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumkeyboard&reviewId=Z3A6QU9xcFRPSDJOMDA3Z0g2UkF5d0xEc3ZibC0xcUtRWkdSNF9VQ3E0RWRITFZfbEdaSGJ4ZjIwcFhocm9tOXZ0RTRsWTNRRG1qclFlYmRsLU9tSmFuMG5j",
        "reply": null,
        "star": 1,
        "title": null
    }
]