[
    {
        "author": "Andrew Hollier-Day",
        "comment": "A fun aggregating journal, surprisingly enough this app is not too demanding on battery usage and still remains very functional, an improvement that I would like see implemented would be greater control over the sleeping record. Being able to manually add sleep eg perhaps if taking a short refresh nap would be a great help. The same goes for other events such as when hit phone is not moving or being used, you might be watching TV or on a game consol. Please keep up the good work",
        "date": "August 17, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPSGZFT0JiZWpzWWlhOFo1RWdXQmxLaUhoWTdSMDlMaWplbWRyczdtVUxOTks1RmljNF9ZaVN1LXk5YWdYQ3Z0X2Q5SGpsN21HbzNhd1ZFakE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Anni Koch",
        "comment": "Lifelong has a lot of potential. It's a shame it's not got the motion accuracy of others like Shealth and Google fit. The weight tracker could be improved by adding St and lbs rather than just lbs or kg. The sleep detection just detects the time the phone is unused. An eating plan or something where you can record your intake would be a good addition. Overall the app is worth having but the developers could make it so much more.",
        "date": "July 25, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRnduWlR1SUNkQ2dNenpIUlRLTUZld1dLbHlhTGR0Nl9UNVU0ZklLT1NIUWpUdl9tY0hkOTNGUzZnUUN3TDZNZU9zTFg0UjV6OUxaTTJ2YVE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I agree with Anni Koch, the app has great potential. I have seen some unusual occurrences though. For one, I can walk over 4000 steps but the animation shows that I only walked for a few minutes. So what happened there Sony? If I don't fall asleep until after midnight, that nights sleep doesn't show up on the report....it's like it never happened. Maybe I dreamed it!  I do like the animations and the reports though. That and the ability to add the different apps on the dashboard.  Basically, the app will show the steps you take during the day and isn't bad at others but they could be improved.",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPR0VLZ3JCM2NnX1BjSnY4WDRybkdrT3M0eDJwTFZZWXZrSG9iSXV4MUJsUVlMbGJSb0VXYWhCNXVfM0VTU1V1ZlFHTm1ta1NJekpYNUVTSWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Zupergurkan",
        "comment": "Didn't understand that I wasn't home for a few hours though it can see where I am. Should be able to manually log time spent in car/bus. Why can't one log 2 moments of sleep? Never woken up in the middle of the night, unable to fall asleep for an hour or two? Other than that, it's definitely impressive!",
        "date": "November 5, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPSHN3MnFuYVlTX1BibHNEZmJhdmJNQzRQLVJwd2w0NVVDUC05cWx5WFpNRjJZQWFLSDFIVlFzbmpZMjB5RHhjWlh5bjJYSWFudktGc1IwdkE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jacy Lyle",
        "comment": "I really do love this app. Even when I don't have my SmartBand 2 connected, it's nice to have a comprehensive view of my activities throughout the day. Throw my SmartBand into the mix, and it's even better. It's a shame Sony isn't selling them very much anymore; I had to get mine off Amazon. Regardless, this app is definitely one of the best activity trackers I've ever used, and would recommend it to anyone who is interested in the field.",
        "date": "December 24, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRmx0TjBYWjJTZFlzN1UzRHFTNkNNWmdfSk9seW80WjBKLXItY0JvaTNJMWpSSnZ2cHNXSDV6SUFLOTg1YkpIZW14dG54ZUY3R0stMk12TEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Karen Hennigan-Thomp",
        "comment": "As others have said, cool app. Love the potential of the animations. However, unless I'm missing some secret controls, it's usefulness is very limited. Especially if you're a person not tied to their phone.   Please, developers,  allow manual entry for all activities and creation of new activities (for instance, exercises besides running & walking.) Provide integration w Fitbit. I'd definitely purchase a full featured app like this.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPSGI2bkp6dWFDaU1OTm00WU9UWXhubWlPdV93U0RpZmJCaWpaVENIR2FHOUZMMHRDVDFPNVlaU1lzeHdGUnNuMkx4TWEyLVdhSElhdDJMelE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Adam Millward",
        "comment": "It's ok, it tracks my driving time, walking time, cycling etc. However I've not found a way to share this info like fit bit etc you can have competitions with others this I can see any function for that. Hopefully with time they will make it compatible with networking sites etc",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRjRTNXRtN2tvYV8ydXBQT3BxRXVJd0ttUGJUSjBwMm5qdkVlcHViVGVBUGNhOURLR2VxQUJsYkIxVWduZVA1aW42dDhJWW1NazFUZlZrZ2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "The app is good overall, but there are some big inaccuracies in its step recording and smart alarm. For example, according to what it tells you, you can take 30 steps while just sitting at your desk. As for smart alarm, it doesn't care what time period you've set. If you set the period to wake you up from 6:30 to 7:00, but closest REM sleep starts only at 7:50, the alarm will ring at 7:50. I recommend to set no time periods at all in order to be certain that you will be on time at work, school, etc.",
        "date": "August 29, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRU1DREVYbl9vVExmS3FSSVNnRVVpZll5bU9la1RmOUJCQTZVYVBrVzRCSFNiUDE4YndHR25wR2s4c3AzbFI5aE5uYnd5X05SWGZlZ2FVOGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lucy Rose",
        "comment": "I love the way this app looks, and am really looking forward to a new more accurate smartband release or, even better would be that it links with any smart watch- you would get a lot more customers then! One app tracking rather than two would be better, I don't want to have separate apps. When will this happen please, Sony?",
        "date": "November 21, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPR0RTRDhtYngxUnpaMGZzOVRKbkxPczctUGlUalV3T2NTMkd4aWgwZVdVWm5yRkh2QmhfTnVqeVNOa0hfN1RwaFBEZlVZNHFUVExIYkRJUnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jamie Axup",
        "comment": "This app is very good and is quite accurate. I recommend this app to people who want a fitness app or generaly want to track their activities. The reason I haven't given 4 stars is because I did about an hours cycling this morning and it recorded 8 minutes of it. I have got this app recently because I got the sony smartband talk swr30 which works well with this but there isn't a cycling tab on the watch but that's not that bad as the app is quick and easy to use",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRXJZblEwbmthLXlIamJ2N1IyVE00RXB6VVRvOXVSYkRwSWM2WWNiMTlnNFNFSE5Zc2RqOW9qMm1VTUhMNm8xR2pPT3Z2YjJseEludnY0S0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Karl Horrocks",
        "comment": "Has got more and more unreliable but in more extreme ways recently, latest error, for example, is recording 700 steps and 18hrs! of driving despite the fact I walked 3 miles to and from work and drove for about 8 minures. It's incredibly frustrating when you are aiming for a target, which for me is 4 million steps this year, and you consistently lose 15-20000 steps at the end of a day. For that reason I would suggest not starting down that road with Sonys lifelog.",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRUxfSFI1bVl1VmlRYkU2dldqS0Y1N1JEb252NVVpOTVLSC1Ua1QySkphZ1NYOWNtLTlmVTFfZE9zZzl2NU9hZXBKTklmYnMydlhxYWh1U3c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Avishek Banerjee",
        "comment": "This looked amazing but not working!!!  I am walking /running around with the app on and yet it does not show any readings. It only shows the passive burn of cals and the manual sleep pattern that I had myself logged. Kindly fix it!! I need this to work... This is a potential revolutionary idea",
        "date": "August 4, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRmJXQlA3TG5ycTRyNjFCVE5RYXBfVF9mMWJGTV9JTlRzekJVZTVfUkFzWUJkRFVoSUtyWW9MNnJyZHg4QU9DZFBGYXdtMDRWVU5Kam8tNlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "jessicaleonie",
        "comment": "Dropped the rating from 4 stars to 3.Used to be good. Used to track different activities accurately. Now it can never tell when I'm running or walking. If I'm in a car or cycling. Also walked around my house to see if it registered all my steps and it was way less. Changed settings with no difference. It's a shame it doesn't have a function that let's you add activities as I get frustrated when it says I haven't done enough activities to reach my goal that day. When I know I've done a workout on top of my Normal walks",
        "date": "August 25, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRlJTVV8tQnF4X2VuVnk0UEx0V3g1eDNZbUxBelp3VE52UnhLdmtnTjlJRl9jQ2pETkNscGFFZlAtTG95cTRBVGJkTVBKRENDMndSSzJOYUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Pressy Kaburu",
        "comment": "Sleep detection doesn't work. Also it would be nice if it can indicate quality of sleep either light or deep. I have to carry the phone everywhere for it to calculate my steps. Would be great if it can indicate what I must die i.e steps to take, calories to burn to achieve my ideal goal",
        "date": "September 3, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRkl5azQ3TmhpNGxGY3ZwZThLbGQ5QVFMVDUwdUNnSlFEWkhRRzduRDNOX2Z5SEhxR0ZMZUhtN09lMnVNbWxfT0w0QVBOV1ZOT0x2S0hJTVE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Arvind Nanda",
        "comment": "The sleep tracker can be improved. It just tracks the time between start of unused time of the mobile phone in night and the first alarm. There is no heart rate monitor in your series of smartwatches.  How about introduing a improved  smart watch with heartrate sensor, SMARTWATCH 4!!!! Because I dont want a SmartBand!",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRzBsOF9GeEVyTm84NDFTR2JfR3A3a1QzeHlBWHg2MVJIZ0pobjFFbV9SY0lYRFpYVWpiS2p6dGhiSTBVa2FHcUx0ZjBvWVFkdE1Fa3RuTHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Murray Neish",
        "comment": "I like the design. It gets a bit old to manually record sleep, but at least there is a good estimate. I'm not sure if I will keep using it as it does drain the battery a bit. Have also used the google app and s health in the past",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPR1FmcHY0Zkh6QUpnS1RPQWdLU3pXRl9MSURXUkVHa1hndWwtcGVsOXZVSGY3RXB0RUtsZXRCRjZkd3pkVXgtd25xOEZQaVVHa2JDWWJQR0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Elisabeth Bradon",
        "comment": "I like this app as it looks so pretty and is easy to use. I've read other reviews on here about sleep not registered properly but I like the manual edit, easy peasey. However it doesn't register when I'm driving or other activities for when I'm in the gym which would be a great addition. Overall, good. Keeps me motivated which is what an app should do.",
        "date": "September 29, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPR3BsS2daWHF2U0x3NWpId2lpRll6eEhjVnFBcUpjNUN4QkNrZWtQdVRaNE5LcHhpbjVmM0VoS0NrX1RocGg5UnJZbnRYSTZBekJMYmlJT2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Mehmet Akif AKKAYA",
        "comment": "Every update made this application worse and worse. Able to identify I am cycling but even though the location services are always on app doesn't measure the distance no more. Cycled 50 minutes but took 1 km according to Lifelog. Bring back the outdated 2015 Lifelog.",
        "date": "November 9, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRkJxcnpsRV9BclVJNWFzWG1KZGxZbUVmMHB3X01vWGtGRzVxSWN6QU9lU2xnaWpockw2VFljOXMwemk5MFBKVjFXMFMwdlQyV19XaXdzZnc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "David Ford",
        "comment": "Fantastic App - 5 stars easily if only the widget didn't disappear FOREVER once you've accidentally deleted it. Looked online and the only advice appears to involve the words \"Reset your phone\". Extremely annoying; come on Sony, you can do better than that surely!?",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRjJKMHl0eXZTUGRkZ0REWTBoYzExYjB3VWNGbXBKNk81dkgxMFp2M0ZURnMxb1FXQnJCWThDVExodFJ1enNQZ051U2JjdnNsaHVXYzdRRXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Cameron WiseOwl",
        "comment": "Out of all the fitness/health logging apps Lifelog is the best. The timeline based UI is neat and clever, with a very clean user experience. My only suggestion / feature request would be food logging, or integration with Myfitnesspal as its the only thing missing in my opinion.",
        "date": "November 13, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRmxLUEEtSTJIMG5NTVJWY2hhSVEtQ3dNR1NzNzBQOHdaYlkzYVQtcE1nRUhmNTBSRzYwT2Q0V1hUWGlHb05kTTU4WnNCeHdBcDdoM05TbUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Neil Dunbar",
        "comment": "New Sony phone so thought I would give it another try to see if it had improved. Like that it now allows a degree of editing but would be more impressed if it synced with my other devices because I don't always train with my phone. Still poor at step counting. Don't bother because there are other, far better options available",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRWZQYUpPQld4eXNtaUppTVROblVkelE1VjNEa0l5bnpzU1EtSjV3RGxuREI1RFNnaDhOR0k1V0M3WHNta0dtUm03SG43X1E2RWdMSU82eWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sarina Ciaravella",
        "comment": "Customer needs? It's a big shame Sony are so stubborn. Many customers want to use this with other apps, my fitness pal for example but Sony aren't budging. Same with the variables. It's put me off using and buying the tech. A shame really. Why corner yourself instead of thinking about what the customer wants?",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRk54eUo5SHBzRmxxUGdZWmdYaXlKa0VidjJ6ZDJaRDgxbTRmekhRcURNZmxOY0FXVUxISUd1N3ZUaXdQSUR0dFU4Zjc4bGd3MHJfVGhiVXc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Kurt Heinrich",
        "comment": "Lifelog is an excellent app that I use everyday. It only gets 3 stars as I can't use it with my Fossil smart watch. It doesn't have to have every feature unlocked like with the Sony watch but at least step count would be nice. With the Sony watch it must be an excellent daily tracker. Kudos to Sony!!",
        "date": "September 3, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRVFGTE1kY21lNnBTX3g1OHRZcmpPak56c0VTM09QQmNKc2RjbTVQRVQ1MDg0X3l0RERDblRlaHdhaFdPeExBOHBZWHhOSnJGeTg4eHNxcWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "dawn Roberts",
        "comment": "The latest update has changed the displays and they are no longer immediately easy to interpret.  If I had scored this before that I would have given it a 5 star.  It doesn't detect sleep accurately now each day it seems to think I have slept for around 15 hours, as it duplicates my sleeping and I have to change it manually. I really only use it as a pedometer now since it doesn't seem to recognise when I am driving or riding my bike, and I really hate the new graphs which are meaningless to me. Very disappointed,  bring the old version back!",
        "date": "October 7, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPR3VPVVZMa0VROEpYRUNBV2ZnVGNONlZUZkxVRlJsZHdaU29nSVpGeHpCTHZva1B0RE4tQlhuejFmN1ZJclVUQWs3Z19rNEFVXzhzX1pKSUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ian Emery",
        "comment": "It's good,  but a work in progress. I have enjoyed using for 4 months now. It does log sleep but on another day will miss entirely. When I skied with it thought I was driving. It confuses cycling too. Love the steps capture but doubt that it is accurate. Overall love it thanks.",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPSGRBd1RGaUVLTG9WaUY0bGVXS3B4ZkFKTzN1cjBKXzZiQk9iYTJ2Q1poVlhHcUhna1p4WWpzcDJmeWR3eTNfTVpPR2JjNjhZS0ZRX3ZmRnc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Elena Ivachtchenko",
        "comment": "I am ok how lifelog tracks my driving time that I don't care about. I am also ok with the steps counting. But I don't like that the running time suddenly chages from the right one to the different one.  Let's say I run for 15 min and I can see the right time when I open my running tracking first and it becomes 3 min instead. I hope you will be able to fix it.",
        "date": "July 21, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRlhKUFk0SzZCb2dMdFgzcTFxRlJXd1p2SWwxRVpwMHdCbDVQdkJWbm9RVFIwSGh4VlBSR25meElSbWV1VWREYTZYaUpEVjlfU1R5SDJ5dGc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Dianne Hickford",
        "comment": "Useless app. Only records sleep fairly accurately. Nothing else seems to work and no facility to adjust settings. I do about 8000 steps a day and lucky if it records 1000 per week. Unfortunately unable to uninstall only disable on my phone",
        "date": "September 30, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPSFBlMTF3Yng5UFJVVVlscmtLcjhmOEFKYlY5Z0p3eHVVVFlZS2FBcEdyM1hpUC01WHVNVDQ1OXhkTTNyU2RfN01IbmRnakQ2OHFDZ0tsa3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "John Jennings",
        "comment": "A nice, wide selection of stats are recorded. And they're displayed in a good way. I really enjoy using this. I discovered many things about myself in terms of my habits! Now I know how much of the day I waste, aimlessly gaming or Web browsing :D",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRXpLUUJjNHdjZjFOWnpxM3FzNWo3N2FHdE02VTFZRUFJbVRDaExMSFZJWmdMclZGUTlVWHBMRC1JOURxYXFtMnljcTNjQzRnNHN0NGg1Q3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mark Lee",
        "comment": "Would score more highly if it integrated with Myfitnesspal. I don't want to be logging weight in two different places, or being unable to adjust activities, for example phone in golf bag gets recorded as cycling, and I can't change it or add the 8000 steps it misses.",
        "date": "November 23, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRklfOXhrT3BIRzFFMU90SGt1a0VGdktkVDdaNk5JX1hoQm9KenR0THZPTlNFNDFEOG1fYnVlMTlReXA5bVlILXZ4REtjS1U4SkNUZDBaamc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Mark Harris",
        "comment": "How do you get rid of the notification icon that it is running from the top bar? If I want to see something there I will set it, no choice since today's update, give the option to remove it, otherwise it will be uninstalled!",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPSHpvQXR2LTBUUzNlRmRtSjBQNk5UTkNGNkc1YlBLSlJfTEhKaFlSRHdBWXYtT2pELWJzOUpkN1NLQmw3cTNmSkdneUh6cFp0REpDVTMtVUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "KD Johnson",
        "comment": "This is quite useful for comparative analysis of a day's walking - but it doesn't allow recording of additional activity - like digging the garden (for example). In the latest version I can't dismiss the \"Sleep\" dialog from the screen - it says: \"Did you sleep from xxx to yyy\" and I can adjust the dial, but neither Cancel nor Confirm seem to do anything - I can't get out of that screen.",
        "date": "September 11, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRlp3RW01V2lOLWotMTNJM2hOVlFiWFZJbGlxUzNTdjk4QTM5U3dBQXRjZDUwREdBUm9iTkJ5ZEtsUmx5N3pjSHVQdUxtODJuV1E0RUpiRUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Přemek Brada",
        "comment": "Actually pretty versatile, useful and relatively accurate, as well as easy to use (compared to quite a few similar apps). I like the fact that it does not need any smart gadget to collect the data. Could improve, mainly sleep tracking, as others write.",
        "date": "November 26, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPSFhNdDBiSHVvdXhneFdZYkJ4clpRVnoyQWl5Y3JQeVhKcjFxRDFHMFNDcFplaWloNlJ4S1hGdTZUZllFajJuZjRxNVhnbGZXV3dQRjNBTXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Charlotte Smith",
        "comment": "Used to love this app, had been using for almost a year with no problems, but now it's not registering activity correctly, if at all for some days. Rather frustrating. I keep checking for an upgrade to see if that would sort it out but it's apparently up to date. Please sort it out as this app used to be brilliant but for the lady few weeks it's been a total disappointment",
        "date": "September 27, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPR1BpZGVNTWtvVUx4STNvME9HdHBtTXRlak8temo4cEhDaHlzV1dhVHJiSlRjNTVKUkgzOGh6OWNiaXZ0c0JOTExoZzdLYU95WV9kVkNKbUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Marluce Oliveira",
        "comment": "The only feature I want to track more is my sleep and in this app is a rubbish. If I have slept 30min, add the time in the chart or allows me to add it and change the data. I can manage better. It is frustrating I can not uninstall it.",
        "date": "October 24, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRmJrdTFnSkpFZjNYeGhmc3ZET1dQNWZWZUc4N0NHVDlMT2YyVXJuVkswQlBoMkRjMkRJOVY3LUdUY1RjQWFwVzZ6QmdBZ1ZLemxLVFRBTlE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ian Maunder",
        "comment": "Was working great until upgrading to Android 8, now doesn't log everything, all movement (walk, bike, vehicle) stays in a faded format and I'm unable to edit when I click on them! Have restarted app, switched off phone, but has not resolved the problem. Update....has now totally stopped working",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRTh3dE1yalRrVHFabnFjWklrbFZqT0Y0OGxPVWlGaFlvUEVHakNPdmtVbEpXMWdNY3MwdlhTLVVjT2RFY0EySDJNWFFlb3FSVksxQi1yWGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Mel Khoo",
        "comment": "i could sycn in my new phone, but cannot track heart rate and sleeping time after i updated. it has been few days, even i can see the heart rate and sleeping hour on home page, i still cannot get it on lifelog. please fix it. Also this app seems cannot trace weight change. same problem after last time i gave review.",
        "date": "August 29, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRlpEd2tQcGczekFvWm43TG44dGxoR1lLZXpoNmZLVEkwRElmMFc4VF9ZSkE2dTVLMTV1blJvSVRUeW5EMnZGdlQ3V2wxeUR0SkM3NjRMdkE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Vicky Kewley",
        "comment": "I really love the graphics of this app and line watching the timeline graphic of what I've done.  Very novel and great fun.  I like it's simplicity as well.  However what could be better is the accuracy of the step counter and the recognition of different activities.  It tends to think going up and down stairs is cycling etc.  It could also definitely do with an altimeter device to say how many stairs up you've climbed.  I agree with someone else that had said you should be able to add your own activities.  Loads of potential.",
        "date": "September 22, 2017",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRVlzUXhidWxlQVRmSjVGLWNZcDFYcGtfZjlwb2plVTJHU3dNYnhSYmRnampDU19lZjl2Zk9PdDBVRjJuVWdybEkya1VVN0YtVWd3aHJpN1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Epic Bob IO",
        "comment": "I personally use this app with the SmartWatch3, it tracks my steps accurately and sometimes tracks where I've been (when just walking with phone). On the adverts it shows how it detects if you are staying still and how many floors you've climbed. Yet there is no feature like that on this app. A bit disappointing as any other fitness tracker (e.g fitbit and the apple watch) can track the amount of floors climbed and they will notify you when you need to move. Even if the stair tracking is slightly inaccurate it should be a feature just like on the adverts. Please review these functions.",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPRmYydFM5bTlwRDlhdFhfdU16NUgyX2dGcGotZzh4Zzk1M1NnbXhQTTN4emtTWHVOUUxEWVAwT0JmTnBwUDYyQUxPR0JOVERqVkRhaWNXbEE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Bruce Schorschinsky",
        "comment": "The app changes the settings for miles/pounds back to kilometers/kilograms every time I open it, which is really frustrating. This forces me to change the setting every single time I want to add a new weight.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPSGM4QWI1dzRTdGxpcDFJSUhSUnFwdmFZV3B6LThwQUtoeExFTjhod2VIMTJQV05mSnU3SUR3ajlFUlFJX2dnTnVrZldvekVCS2tPc2FJeFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "animesh jha",
        "comment": "It takes my idle time as my sleep time. If I'm watching a movie at night, it prompts me to add that time as nap time. Also, tge walking steps are not very accurate. It still needs a lot of improvement to be the best but overall it is a nice app to have",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.sonymobile.lifelog&reviewId=Z3A6QU9xcFRPSGJvQV90NldRN3oyS3h1bV92ckctUkJKaG40cm1KSW16dzZyTHBWQmpnYktaTmRDOXlGdGpfX0UzSU9qeVFubEFzRUVhRHFzT2szWFJmTGc",
        "reply": null,
        "star": 4,
        "title": null
    }
]