[
    {
        "author": "Justin BentRails",
        "comment": "Installation was easy, and the setup was painless. When I downloaded the app, it initially stated that my Galaxy S5 Active wasn't compatible, but I was still able to calibrate both it and my key fob with no problems. It operates just fine on my Galaxy tablet as well. The software update downloaded and installed successfully. Now I love my new door lock. Just don't keep your key fob anywhere close to the lock, and you won't have any issues to deal with.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSHdmQzRCdmMzWlk1Vk13WTlmV25MMkJhdEEta2ZXREgwM29JR0hPWHZsRkZtaGRPa2V4MU5CNVlkUkdqOS1MUTc4VVVkN2lJZkl2ZHBtaXNr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Erika Torres",
        "comment": "The only reason I'm not giving five stars is because the app has stopped showing all events in the lock history. It shows most of them, but not all. For example, my husband leaves for work and then a few hours later I might leave for work. It will not show me locking after leaving. If that were fixed, it would absolutely be five stars. Otherwise it is incredibly useful.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRU5IVEhDVTI2Um10WHNEZ0F1cTJLRmFNTFVYMlRVa2NndUdFLWF0OUlkSmpfSTA2UENma3czMVhDZWdsZG85VWhrbVFfemk0OG9oLVB3RUJZ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Bradley Wuthrich",
        "comment": "The privacy policy us almost as bad as Schlage's. Like most corporations they share with their partners which makes sense; however, how that information is protected and used beyond them is unspecified and not protected by the privacy policy. I would prefer apps and devices independent of GPS tracking, cloud based services, and data collection.  They should work independently of their creators. I like IP enabled devices that can be managed outside of their creators. I would be more comfortable with Quickset if they offered an app and device that did not collect or connect online. Just solely Bluetooth & NFC",
        "date": "September 28, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRlNtNmhBRWZ3dEFVWWd3UXBtQkd2NVhVZ2NkTXkyRm9raWtBRGt2dWNIWEZPY3duSHU3X1BZYXBMcF9SSXJfajN3Wk9xTVhEMVNpdC0yR3VZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Stephen Thompson",
        "comment": "This app has been working great since February 2017 but since the last couple of updates it doesn't work properly in any consistent way. I'm using a Samsung Galaxy S7 on Android 6.1 and its reliability has dropped to such a low point that I now need to carry physical keys with me because it only works less than 40% of the time. Sometimes I log off and back on the app works and sometimes it doesn't. I'm having the same issue on a second phone an iPhone 6. These are both Kevo 1st generation deadbolts.  Same issue with both locks.",
        "date": "September 30, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSGpDazRIT18tNmlNdm1fcUNxVm5pTWN6VjNUQm1ScGRxZDhjTWlnRGhtNUJGdFVaeFlfbThlcXByWjllVjNnUHNpbDUtZ2F4aFFCUGNIZ2I4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Heinrich Schorzmann",
        "comment": "The touch-to-lock/unlock functions work fine, which is good and the primary reason I got the lock in the first place. The Android Wear compatibility was great too! Then they broke the Android Wear aspect and haven't fixed it.  C'mon Unikey, you're a big company with a lot of resources: put more into Android and AW development!",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRTBsbGhXZG5fYXFieGxoNHlNNTM4SHd4QWUtUGJBNTA2eWFOT0JuWjg5RGFZSmJjQ0EzekxuOUVnX2ozRFRSTmw4dkRRcUZBcjlKa0pJaEVB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "jeff strong",
        "comment": "I have a Galaxy S8 plus. The app used to work fine on my phone until the most recent update in September 2017 and now it hasn't worked since. I feel like I've been scammed on a $230 lock that I now have to carry a key with me all the time. TiVo needs to step up their game quickly! This is baloney",
        "date": "September 26, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPR011NnZuel91MHRrUFBkdzlmTXhKSTRuOUh3NWhWekxQenVyN1RUaGt0NHhMTUM0NXd0MmxRREtVNUpLdDcxTjh6WDZJMW1HSkZYbGd0RVhZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "richard g",
        "comment": "Works pretty well!  Using Motorola Z Force.  Even though during app install it said a lot of the features would not work, including touch to lock/unlock, EVERYTHING works!  Maybe they just have not tested with the Moto Z models yet.  No matter, all works as it should.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSDY4N1JLeklsU2I3WmxiX1pPeHlTbmdHbHN2X2x6dXNVdk9fWmN5V0NHTFpLLVF5TEdEZG1TS0dHQ3RIUUtEMHMwTkp3aWMwM0FWM0hVeVNv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "mauricio santiago",
        "comment": "Note 8, no app support. Based on other user reviews, apparently most android phones aren't supported. Prior to my note 8 my moto z would constantly stop working or reading the kevo, same with a pixel. It's apparent android isnt supported by kevo, but if so it should not be marketed as such... save me the headache and I would not have purchased!! Anyone reading this, don't buy (assuming you dont have an iPhone, because why would you be in the play store?)",
        "date": "September 17, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRXJ5OFk4N3IwUmpXNWtKSm5mUlpHdGVqOUplX0FOSE1oTWVGbk83QXdNY2NHRy01eVFOVGJGQTRiU3ZHWkN1NXZVS19aVUdjWEdyTklaVkhr",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Candycane",
        "comment": "Phone app doesn't work. I purchased the key fobs. Those work. I recently purchased the kevo plus. Found out my phone isn't supported. So, I have to go out and spend another$600 on a phone ? I bought this to go with my nest thermostat. I wind up going I to the nest app and hitting g away button since the kevo isn't communicating with it. 2 stars because it does work with fob for me.",
        "date": "November 2, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPR3R2SDFxU2gyMGVocXVQMVZDU1FIcUVIU1IyM2hRdm1qeWk2VnVuZWVfYXlBNjNMdmZzX3Y2OHdLWGkzZjZLSURaaDZMZ2VmR01DbU5CRk93",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Bat systems Inc",
        "comment": "If your phone isn't compatible just get some cheap used fobs on eBay!! Says it isn't compatible with my moto z2 play. Used my note 4 to setup and do firmware update. Now it works with my phone and has better range. My key fob would only work if I held it in my hand as I touched the lock but not from my pocket. Did a recalibration and now it works from my pocket. The app is slow, takes about 30 seconds to find the lock each time but the eKeys do work when you send them to personal with compatible phones. Verified on iPhone 6 and note 4 and note 5.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRnhHQUU1SjlFeWIwRmU2MGtQekM5eVppSl8wZmdvc1JZWk00LW10YmdzMF9KTkNBb1RhcEdzNFplTnhwUTlYVmg1UExMdGE4NGhBd2pUUl8w",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Il'ya Yatsenko",
        "comment": "Was sceptical about the app. Had an earlier version on my Note 5 and it drained the battery. Uninstalled it the next day. Had the fob since. Figured I'd try the app again. Works great this time around, opens the door faster than the fob does. No noticeable hit on battery performance. Here's hoping updates don't mess it up",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSER5Qk9ISjRnVDdHQk9rVGQwOW1QT01Zb2FXa3lxT1d5TVFBZm9uLXpycTgwTFlIMk85bWE4ZU41LW9oalVUbXZGb21FYVBNeUFhb2xsY2Iw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Evan Labbe",
        "comment": "The touch lock works when it feels like it. I carry a physical key around at all times since its on a business.   Setup is simple, easy to manage, battery life is ok.   But phone support also seems to be an issue. My brothers galaxy s8 seems to work, but my note 8 doesn't. All of our other phones are supported, but how well they work is hit or miss. My IPhone 6, fails almost every time. The iPhone 7 works well, and my old note 4 works every single time.   It's a terribly frustrating system from a reliability standpoint.",
        "date": "October 3, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPR0JXUGRwMlZHRVF0ZHJNempPUGFaMTBZZjl3VVFubUF2OG92UTlyamlmVFJnLTRlYWhISmFzRVZENlE0OVo3cUdxZllFZ0dKNmt6RVNXV3Jv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sam N",
        "comment": "Was okay when it worked 50% the time. Now it's more like 4% of the time. Doesn't work at all on Android Wear, despite having an  option for it. Even after a factory reset on both devices. Cool idea. But one thing it's missing is the whole \"being functional\" thing. It doesn't actually do anything. It's okay, didn't really want that $200 anyway. The Kevo lock is relatively heavy and makes a decent paperweight. Thanks, Kwikset!",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRktNOVlmcGcxLWZvSC1qVnhiM0ZVOGJ4bUtZRE95SzRFc3JzMGxzVUl6empUMzM1OUhFRW9CMWZ4OC14SWIwcUxBOWN2TmtVQlQzWDR0bUpz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Graeme Taylor",
        "comment": "Using s7. Latest updates have broken this app for me. Never unlocks anymore, without taking phone out of pocket, opening app, waiting if it to finally tell me it's locked (after searching) then another 20 seconds or so later it opens! Useless. Used to work perfectly. Now it does not.",
        "date": "November 21, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRTFsejVrSUtNa2o4aDQyNVJ6eTBCOFJUZ2h1b1NhNTdZSjNLOGlfMEJxbXVqUy1YS3k0dnpmY2dGV2czVlNpbmhXbUtXNUh1cUN3MWxDSmhz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "WiseGuyEddie",
        "comment": "I give this app 2 stars because of the idea. The app is so unpredictable. It works, SOMETIMES. We got the KEVO lock for our front door to make it easier for my kids to lock the dang door when they leave the house (millennials find keys a nuisance, I suppose) but it defeats the purpose when the app works part of the time. Very disappointed, we will find a different solution soon.",
        "date": "October 18, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPR192YUY5a1ZFU0tzV05pdWZkTjBaOHpNNzFwcG43QUkxU1ZXTUMtNVRRVm84aUtzeUgxQVRHMVlfOHluSUxBcVJYQkhQQ2NPd3NNTGFhNmFJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Tyler Beckett",
        "comment": "And back to not supporting my phone. I just picked up the Essential PH-1 and this app does not work despite having Bluetooth LE. Can only manually unlock in the app, cannot unlock using the phone as a key.",
        "date": "September 19, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRUs1cTVqcEdMUThORnJPRWlGeUN6RXNsVWtLUVhIVnd5YS05TDJ1a1FQcmdCT1E5SHF0U2JLS0VCMU1ySkZpdkFhd1lpeVdDYWkyeko1S19n",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Nancy Wilson",
        "comment": "I have the Kevo Convert.  Basically the inside portion only.  Took 15 minutes to install with a Phillips screwdriver.  Worked.  I.m not experiencing any problems as reported by others but i.ve only had it for a day.   It is Bluetooth not wifi. Surprising Bluetooth works from back of house approx 30 feet.  I have ring doorbell to complement this setup.",
        "date": "December 13, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRlZDNGREa0dqTnE2YUZfbVFKMGVjVzl2MS1BQTJRSEtsX0xXbXRJNE5uZ25oTkRkcmNUaFhKQWRielFaekkwN3VQb0lPcnBFY3pZenB0d2J3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Amit Nangia",
        "comment": "Can't use the app in an other phone besides Samsung and IPhone. I have LG Android phone and this app is useless. Not sure what is the big deal to make it compatible with other brand phones.",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPR1o2QUpIaEZ1SmRXSFF0MkNUOGVqOXpTSEJyU2Jtc3RpbHR4OWZramlZYkJCVlJRdmlOaFpiOTFEVktiY052YXluN3hTdS1zQ1M5VUhlOGpV",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "dragon788",
        "comment": "Friend wanted me to stop by and pick up something from his place, \"get the Kevo app and it'll let you unlock the door\" he said. I signed up for an account, logged in and got the guest eKEY he sent me, went to his place and couldn't unlock the door with either of my phones. One is on the supported list and the other is new enough to have all the Bluetooth features required, yet neither works. Guess I won't be buying any for my own home.",
        "date": "October 14, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRTdYZkR0LU5EeUVfNUtHR004UFMtWUZodi1va3lLb0dTNEdKX2RFWE1GWldreTg5SnVyN3duZllXQnhsaXJ2dGl1ZzJEVXdsX0tDNUM2UUNJ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Karen darmoyan",
        "comment": "Ok this product seems like it came straight out of R&D. Let your engineers debug before selling a product. Anyways i had tons of issues with the lock \"jamming\". Apparently that was from the battery. But i have an issue with this thing working on Android. Update this app and fix the Bluetooth issue. It doesn't work until i restart my phone, then it works for a couple hours and again won't find the lock. It's obviously a software bug because iPhone works fine. I use pixel 2 and nexus 5x both same issue.",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSENBc2dhWUxFOW5lek83c21kZGwxUHlTZG9YbjNqbjJoazBnQ0F0Mm11dDZOWjJLUHU1TmlvSjNoazNKa2s1cE9SSXk4Yk9nS1hmcUdJUHBz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Humberto C",
        "comment": "I use to have a note 4 and just work fine, now I have a note 8 and is working even better.  Bluetooth  On all time. Works on saving battery mode also. Opens the door at 1st touch",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRUdGcllpZFdGMkFSNGpyb3BQa1djRjRkQVY5S1FHU2dWQzRFMzV3NldEZEJMbzZEUWl5dlhhNmxEVFB6VE9FQTU2REVhdlhHd0o1T25fNEZr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Russell Eas",
        "comment": "Won't allow me to do a lock update. Times out about 1/3rd of the way through it every time. Must have tried bout ten times, so now I'm stuck on the version that the 2nd Gen came with. The lock itself is working great so far. If I could update the lock firmware I would give it a 5.",
        "date": "December 26, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRmhJYVZVcVdGbXNNZXJYRlpYOS1tRVplRmplOENvdU84ejU2dFZQQkt4VF9GRHo3OXo5cmpVeFowNmtBRUZvVTR5WTBIajRPcWp2Vlh6ZlQ0",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Steven Kachtan",
        "comment": "The only positive experience I've had with my kevo lock & app: I got locked out of my house again today and drove a 3/4\" drill bit right through the face of this horrid piece of equipment. Felt nice.",
        "date": "December 26, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRUNILS1xM2xURldTdHc5UjFXYmhjRmduUktyTTdoYm1zX09iQlBZamFXWTBucWJuU01COHNSN0FQNUljMWVPXzF2MnlXNHpOOHQ0bFhNcDFn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "George Sovinsky",
        "comment": "Kevo needs faster updates for compatibility. Had issues with my Galaxy S7 before this phone. Super excited and impressed by the lock at first but where is the tech support??!! Other than that, really convenient when it's functioning properly with your phone.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSDBiWnRodDM3VW9XYlAzSjlhSThWMWNGeWRINVdtQy05YzVHNHliSHM4VUQyWDQzY0lMU1JXLU5UYXp1NURYaGppRWpUTnFGME10R2w5ZnNB",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Sean Conroy",
        "comment": "Great on my s6 edge plus but now on my Note 8 it's not supported. So now it's useless! Not sure why it takes KEVO so long to send updates for Android phones! Don't buy if you have a newer Android device!!!!",
        "date": "September 27, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSFNhUWpWZVAydG9PdFhlQjF2NWE2QkxTelhIQ3JCNks3cC01ZlNnX0xFN2ktb1ZfcVRBc3RXaHBfcVNVU2N0aVVyZ1E4MmQ4ZUt2b2pROVg4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Paul Eckenrod",
        "comment": "Love these Kevo locks what problems I've had are user issues or letting my batteries go bad. Customer service has been very helpful but it does take awhile to get ahold of them. The ability to send e keys on is awesome.",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSC0zcjZFbEh4NmtjRXhmZnczMzZHLWE0dXM4Y0M2MUJyTms2anJBNXVwVm03RmZ3aENZUVZGX2MyeDNtaXJMNEhfbkVyNVlCSGVsaDczYzhJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kenneth Foggie",
        "comment": "The Samsung Galaxy Note 8 has been out for almost a month now and I'm still getting unsupported device errors. $229 for this horrible support. Also there should be an option to send an ekey UNTIL xXxX date, or for x about of days. In case you have guess until a certain date. It to let a handy man have access until a certain time. Or you use it with a airbnb. Right now you can only give unlimited access, nice access for exactly 24 hours, or a weekly schedule that I must always cancel. If I am away and I have guest I want to have access until Thursday at 4, I should have that option. I should not have to give them 4 daily passes or weekly and have to cancel access, what is I'm s place with no cellist service or Wi-Fi",
        "date": "November 7, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSHNVeGN4OXRDUlNXRGdwQ0tVNjlxNl8yck9TelVqREtQQkdUYUZ4ZG1LSlE2cERHdUpGWXg4TFBvN3BYTkVJRW9WT2M5MXpfVnNPN3d6bHNz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Henry Happy",
        "comment": "It unreliable it works when it wants too and it takes forever to connect, it's faster if u use your keys. Also doesn't connect to Android Wear which it would be great because you would not have to pull out your cellphone. It's a nice gimmick.",
        "date": "October 28, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRUFRejdFYTZGQ05JSkNlOVg0ZzhHdDlWalhEcVEtdmZlZUZmbVhVRDNhUWxNU3BSa3hrZ2EzMVdMT2h5MnlXbWJpekNXMlNVNjJrRXRIQ1d3",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "John M. Tighe",
        "comment": "Makes life easier. Works as advertised. I use an S8 on T-Mobile and works like a charm. I just have to remember to have my phone one me.  Even the iPhones work well as long as they have the app open (That is an Apple stupid thing no Kevo).",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRlZQemNZVTI5VW5mZUY1QlloUkVtTDVuaWhPcFZNb2xEc0pleTAweUlGd3NFQWNvX0haeFAzanlPbVIzQk5zcTlPVUdiMFkxajZiSVBmMEln",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jordan Barhorst",
        "comment": "These developers are garbage. I installed my Kevo locks two years ago, and at the time they worked like a charm. What development group drops support for an UPDATED PHONE??? How does your product work with a phone that's four years old, but not for a phone that's less than a year old?  Get off your asses and make a product that's supported by all Android devices 5.0 and higher. Every other app in the app store does it. I now have a dumb lock on my home that cost me $200. Fantastic.",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRWlFVG8tcHA5dGg2ZDhtN2tndU1WYlA2WVRUcndJS3pzNm1KUlp2aXMxaFJBOFlHd1dwdDF1dmZieXlrN3IydVAtSDdwVzNKX1hKSWphUkhB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Snow Opal",
        "comment": "When I open the app to unlock my door it doesn't find it. It just keeps circling searching. I go to tap the lock it attempts to find the lock and doesnt. My Bluetooth works fine as it connects to other devices.",
        "date": "November 16, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSHVnQVB6ZXdNNmNxSGJYN1FzaFA4dTZub3VscGEzOUVHZ1gzVzN0aFlWZzhPNWttSGVMZ2pLVkZybEdVOWkxNG94b0xqbUQyS3NaMUlkajNN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Deric Jennings",
        "comment": "I love the locks, they work great, when the software works. The problem is not with the physical locks(that's a good thing) the problem is with the software for the locks. The app loses the locks and will not connect anymore. This system works great for about a day or two, then I can't connect and have to completely uninstall the app, clear the data, reset my phone, reinstall the app, sign back in and then the system works great again... Of course, in the time that takes me, I could just pull out my old keys and be in the house with a cold one.  Please fix this app, I really want this to work. I invested two locks and want to add the plus system and a convert to my third door. However, if you can't keep up with the software development, I can't use you and that sucks.  Please fix the software. It needs to have the Android Wear connection fixed, or the option removed.  Also needs Google assistant integration: \"hey Google, unlock my front door\"",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRWIwc1JQSnoyTjN0eDAxbHlpT09kOE5iVjFRRFpxUGtjVlIzZzcxb1pReVEwVkl1OXNqWjd0ZnNoUWJLMWVqdko4bVlxQ1JoTkdnX3N1WHQw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Scott B",
        "comment": "constantly having to take my phone out and then have to open the app to get my door to unlock. of I had known that, I would just fumble for my keys as it would be faster to get in my damn house. does not work consistently",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSHlNNlhjdHF5clRGcjBxbGhhNnZLSnhOVU53S0FPMk4ydXNreUFSTXhodWVkYUZDeDFiYXdsdjB5QzU3TlJJZ29xRFZsMTN5MTFkcXZlZEhV",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Horatiu Druma-Strugariu",
        "comment": "Works great, but keeps asking me if I love it. I'm not sure in ready for such a deep relationship with my door lock. Besides....its a door lock. I'm glad it lets me in...but I'm afraid my tapping its shell has made it a bit needy....",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRlJ2SEw5dVpiamNVZUZ4Z3hobWdTX1UyaGRpdDJZSTlhVTB4Z1QxTXk1dHRtbEFFWmtuN05BRFhSN19jNEM0VzBEalRuWGxXUmpmc1cwcFFR",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Rob Brawders",
        "comment": "This lock has come a long way. The latest updates really have improved the range and consistency with which is detects devices, and has eliminated most of the lag between when you touch your Kevo and when it actually unlocks. Not quite ready for prime-time yet, still a little flaky and will leave you standing at your door touching the lock wondering why it's not locking/unlocking every couple of times you to go use it. Fobs.. those still seem to be something of a dumpster fire. But hey, at least with the app on your phone things are improving!",
        "date": "September 26, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRjFVSDZLbUNrYnNNazJ1RWo4ZHF6LUFsbXNHQjc0dWNvUU1XZzdLTVUwZE9zRlRGVExVVGw0bEs5d3RoWEU1bDRUUXhBMkhVZ3c3ckNQeGF3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Patrick Crumpler",
        "comment": "Not fully reliable. Lock doesn't always engage or disengage. Force stop and clearing cache do nothing. Needs full uninstall and reinstall to work properly. Returning.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSDFHWG82dkJJUHFzLVVJUVFnRGxkREVwS29qa3lkUjAxV0lyQXBJOWVJMVB6dGFvdzZoZl9CLXV4V3l0RXlQSzR0M0RKMTZSTUVMTGVDOEZn",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Sean Bello",
        "comment": "It doesn't work really at all anymore. I'm at the point that I'm surprised when it does. I've allowed the annoying persistent notification to see if that would help, uninstalling and reinstalling, and even having the app open when trying to unlock. Useless. It's a pointless thing to use, since the idea is I don't have to take my key out but I have to for when it inevitably doesn't work.",
        "date": "October 29, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPSFBvWUIwc21nQTc4X1R6MmpMZW5YdG1CRDNZR1NGSTI3TXRDQW5fTWpBN0EwR0Z5TkYzZGd4QjAxU1FMRXhfYkk1cXhFR2lpYmVPSTdobkZz",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Kevin Wescott",
        "comment": "I have this paired with the plus and so far it works great. I can send keys to people and take them away. Works with alexa to lock it or tell you the status of the lock.  I love the lock and ease of use!",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRU5FcGFfMm0yUFFwdFJ5LTg2Ym5kMjZvWE9iZ3hmSlpMWFlpbFEyZGtFamJPc2NOaG8wS0J4cl9SSTVlc3dWbm9DeUwtT2ttUC0tSEljandz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Yousef Al-Nafjan",
        "comment": "The lock works fine, but the way the app and the service works is iffy in so many ways. For example, getting full connected features requires a $100 add on device that needs ethernet and was frustrating to set up. I was hoping to link it to my smart home system but it doesn't support real integration with anything except a very limited Alexa skill. Still waiting for Google Assistant and SmartThings integration..",
        "date": "November 25, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPRmRsSGlfNUFyVXFLYUlUMEM2RXNkWm5VQTktUUc1MWJwR1U1WFFhdENwMmtjZDl0eFN6NDNOVWhKMUZqX3k4UE1NTHhyck1ybXU5ZkF4aFBn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Brooke B.",
        "comment": "I am getting a \"unknown location\" every time I log on to app. Where it lets you unlock the front door from app. My boyfriend has the app. And has a galaxy 6 and his can unlock the door from app. And it shows the location. I have the galaxy 8 and I can't. PLEASE FIX this for us galaxy 8's!!!! Other than that love the app.  Very handy when you don't feel like digging for keys in purse :)",
        "date": "September 18, 2017",
        "permlink": "/store/apps/details?id=com.unikey.kevo&reviewId=Z3A6QU9xcFRPR0N6MTNiQV9XRnJxaWhzNjB1Nm5mTEJ6Sl9KY1plY2MzTDlyN3BRQ1Q0N190ZzhkWURLWWZXa3BkQjZjX3dER2dkaTRpdFhUVUs4NlFrRy1z",
        "reply": null,
        "star": 5,
        "title": null
    }
]