[
    {
        "author": "Man James Li",
        "comment": "A very informative app based on your selected (favourite) tech topics/interests. Mostly I like that you can set the reading settings to night mode so that it's easy in the eyes as well as change the text size if I remember correctly. I've downloaded this app since day and on every new android device I've ever had and will have; for me this is an app worth having n' it's staying. If you're into all things tech this app is a must have :)",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRkVCUjNjaE8xZHdod0RyWUJ0MVJkaFZjc1dMMlI0ak1YczE3U3kwX1hHeHdlOER3VXRTZTJERTRCTy0wWXFUazZDd2hld2NXVXFxcGtNeGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Seth Harrington",
        "comment": "I like this app a lot. I am very interested in the tech sector and this is such a useful tool to keep updated! It gives you a lot of options for topics to follow for your personalized section. They have the main screen that has various topics. You can search for different topics (ex. technology) or different companies (ex. Google) or types of objects (ex. phone) or specific objects (ex. Google Pixel) or operating systems (ex. Android). Underneath the search it has breakdowns if you would like to further search your term to get more specific articles. You can save articles for later. You can \"react\" to articles which helps the app know what to recommend for you to read. You can adjust notification settings a lot, which I appreciate. I haven't had any issues with the app so far. Great app!",
        "date": "September 12, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRU1RYzdON2YtUXRJN01fSXczY2dtRmJqV3JKMl83UVZnRHpteXdwQzVaQnFHOUdHbUQ4cFdadTJQMUEzYnZrYjR2TU5FbE5idE5LSTF0TFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nadeem Rahimi",
        "comment": "I had to change my review from 5 stars to 3 for 3 reasons. The positive side, that's my go to tech news app.. negative side, been a few months i get a notification that I can view new articles but when I open the app it's the old one and doesn't refresh to the new one. 2, it used to read the articles but doesn't anymore. 3, I contacted the developer by email but it was failed to send cause the developer's email was wrong!",
        "date": "October 1, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRlpHOFlHeV9lY09wb3lHNjJiNWYwazQxVy01Sl9QYnRILUtQNW5Wa3pYUXF3bGl3MTBjSTBjMkNxdEtHam5tYmxuYTZ4MXlZWnRFd2xZeFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "William Helbing",
        "comment": "All my favorite news feeds in one app! BUT, I keep getting article in different languages that I have to copy/paste into translate to be able to read. Since this app has no copy capability, I have to pull my S pen out and force it to select and copy text.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSE1zekJqZzZQRFhSbXdmWDdEQkU0aTA3ZmVDZHRVNXdWeWRDSjMtcGtzenZ2Z0lybXhPcTY0TjhkV0lzeW4zMEdnQVZFbl9jVWhKejNFblE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "S. MCCOMAS HOOD",
        "comment": "It's awesome so far and I have had it for like 3 mos. Has tons of story's and news on a variety of tech topics from lots of awesome News Sources. Have had no problems at all once I got signed in and completed my profile all the way. I had a tiny bit of trouble only the very first day I got this but that was all due to my own confused self lol. You can even use Appy Geek as your screensaver on your phone. It's awesome!  Thanks guys for the app an all your hard work on it.",
        "date": "November 18, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSHJrQk14ZWt3ZFlwUlBNNXdxTzdhZ3JlTWc0TERjZThkX055b0Jxc1BWbzFGM2J0UEI1VjBFa2JoMmxmZGRFbVJWNkh1VHJyZ3p6WmFKYnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Tells me everything I need to know for the tech I have. Sales, updates, changes, new products. UI is silky smooth too. Update: this app is better than ever! Can we please have an alternative to FAKEbook for commenting within the app? Thanks!",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=bGc6QU9xcFRPRjIwNEM0aGI5aGZpVXdKVnRRSWZvNFhvcE15eHlyQmxEZjQxbVJWNDZUTEV4dzZ3aUhhRXVYRmg2VlU1RVU2SHFQWlljYXRYNVE4LXdCaXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "joe blackwell",
        "comment": "It's a great app but sometimes with all the different feeds I have and nothing new pops up for days. Then all of a sudden 99plus stories are available..... Maybe there servers go down all the time? I don't no",
        "date": "July 29, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPR0dfSFM0VkZyR05FME5LM3d6a3dxR0pseWxYRldfc1BoMHRRMVhOblNKcU1uNmhheVVFc3hRUm5NckdfRWZ5T3hSbGJOak1na2RFRUwzSVE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "J. Mac Jordan",
        "comment": "I enjoy this app quite a bit - it is catered to virtually the exact topic(s) you want and the presentation is top notch.  I do wish, however, there were an easy way to remove approved news sources from the overall pool.  The app is regularly adding new sources to the pool & will confirm if you want to inlude whichever new sources that are available - generally, I think a broader pool is better - but, after approving, I can't figure out exactly how to go back & exclude a previously approved news source.  I mistakenly approved a Spanish-only source, it pops up across my list of topics fairly frequently, yet my Spanish is not good at all &, therefore, the source is not relevant/wanted.  I have yet to be able to remove it.",
        "date": "July 25, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRnJJSUExMG1jN0N4b1Q0OUpNMUxwMUlxV1AxaU4tRnVFcGRnTXJ2WC1YalViNFZkRjl1bVZVZ2tQMjNhdF9sOHdlWW11NWlPcE1TeFdxS3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "ARABIA",
        "comment": "Why don't you people try being more transparent about what you charge for your subscription. Subscriptions are typically a racket and people like you try to be sneaky about it it only confirms this. Also, everything you provide for money can easily be done without your app by taking advantage of Google alerts.",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRkM2WThIYzVlTWNlWTlkR193MVd1UVQyelVYaldjekJvV1dYNjJCYUlLOHRZMlN6NEQ2RGtLODZabmhxdDJZQ0JDT1BGMTVRQUJSRTJ2SXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Nujitha Wickramasurendra",
        "comment": "A great app for everyone without age limits.. no nonsense are included here... recommend in adavnce..... nice way to stay in touch with the tech world n daily updates easily at just right through your mobile.... also they support widgets.. n i love it..   super awesome...",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRWxJVHpmRllVY0lHR0U1WWVQRldWZlY5SXVib2R6N1YwT2hoRGNhZ2NRY1paYXJwWlhCZlVPVjdaZi1mM1IxSlF5WmpBZzE4Qlo1ekU5bkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Anushree Kar",
        "comment": "Yeh they are pretty annoying. Its like you are in the flow of reading the title of each news and you go on to read the advertisements as well... untill you realize wth are you reading about. Already they are flashing below the screen..why add more in between the news....thats really annoying",
        "date": "August 9, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRkdKemtsckZIblRTLXR1WFEwU0xNcm1vSDdySnZlcDJzbHIyaXo5YzlwVmNWTlBnVUJidjVma0pGbFpzNVNXMVdiaU9SY3pnOG4yNVpRdGc",
        "reply": {
            "author": "News Republic",
            "content": "Hello Anushree,\nThanks for the feedback and sorry for any issues with the ads. It's the only way we can offer the app for free. I have forwarded your feedback to the team. If you have any questions please email us at contact@news-republic.com. Thanks from the AG team.",
            "date": "June 15, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Brady Deslippe",
        "comment": "Pretty user friendly. All content is from third parties so I can't rate the app based on how repetitive some of the articles are. I find the \"my topics\" section to be a little chaotic but that's about it. The \"web\" of related articles searches is pretty nifty.",
        "date": "January 12, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRXZEX3YxWFJnRDV1RUhQOGZ1Z2RrVVRCZThTZm5ERDlzV3VQZHM3Umo0N1JzZk0xU0JlT2ZHdlhXaVpwWnNuRWZfSzV6TkRheXBIVjViMGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tom Gudmundson",
        "comment": "I am a tech freak and I love this app the only issue I have is I tried to set up an Acct through the Google option and it won't let me contacted News Republic who owns it and they said they don't support the app any more. So strange such a exellent app not supported strange, I read this app daily.",
        "date": "July 21, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSGp6eVlJRGxRQ0FXWWxjVUlvd3RwTHh5VnczcE1aX1lMNXoySmZIanpsd3BIZkxEOTRCWGdRR1ZtVW12UzBSZTh2ZlFXSjdCNE1ES0s1UHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tony Russell",
        "comment": "Very good app for tech news and I love the black theme. I just want to know what is the purpose of its \"PresageService\" that it has ALWAYS RUNNING in the background. Not sure why it needs this. When I disable the service manually, the app frequently crashes in the background.",
        "date": "October 10, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSGZ5dFJhZWw1YV9LLUlEZVByY1U5UV9QRGFUcjdReFVXVk5Ta0d3TzJIdEFfUzgzaVRWWTBXRFJFUHlNTTlTZ3FLLXZSeVZsdHNtNmxaZ1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "zameer fouzan",
        "comment": "It is a great app for me to get updated on all the tech I need. Recently I switched to new phone and trying to login using Facebook to sync all my subscribed channels. But unable to.  Tried on iPhone 6 and Sony Xperia xz1.  Please fix it",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPR2J4RFVOREl0T3RXSDlaV0w5REJCWFdKVXYySlpqdVNOM25WM1JaSDVuRXB2UDkwWERaUW5sR3B6d0c5RlNUWVNPYjYtVkVaeXkzWk5aQXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Benjy Bunny",
        "comment": "Lots of missing articles. I have just transferred this to a new Galaxy Note 8, and get \"No articles found - Network is disconnected\" for lots (but not all) of the categories. It's almost useless.",
        "date": "November 4, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSEl1SktrQlVrTnF1UG9TT21MaGs1TkRLYmg0NVBYbHZFUkhSR1lLaVNOSHFjTWgwRmJJZjJpX1NyaUlnU3FvZ0JHUHZVcnZQTHFIeTJkZ3c",
        "reply": {
            "author": "News Republic",
            "content": "Hi Geoff,\nThanks for the feedback! Sorry to hear this is the case. Our team is working to improve categories and tagging so this doesn't continue to be an issue. Please do not hesitate to contact us further at contact@news-republic.com regarding this issue. We appreciate your input and patience.\nBest,\nAppy Geek",
            "date": "July 14, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Informative, but drives sales.  Business interests over the consumers.  Gimmicks concealing a movement toward tech conformity.  Still, I need to keep up with the latest, despite the controls on the tech market and relative information.  App updates required for organizing purposes.",
        "date": "September 3, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPR2FKMXd4SmR5WmRUWFkxMEF6a0ZWZXpEOFhnMC1fMmZlRHloTS1udW92bG44NnpEQzEyVUpwZk9vRWtielZBYngtMTdzTWtFTDVSSmJ4aEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "adam trefry",
        "comment": "Best place to get all my info on the tech world from science to smartphones this is the #1 app I check more than any other. Since I work in Telecommunications the benefit I get from this app helps greatly**but network disconnected error is not allowing any articles to display!! What's going on?!**",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRlFkZnFhUEVpQlRnODFEYkpFOWhVNU8zMWlUWXZKQjNWNEptZ1hGam54WmpQS3doSVMybG5TOVk4M092dDNyQW4zZnBjZFZ2aktNRkFpQnc",
        "reply": {
            "author": "News Republic",
            "content": "Thanks for the feedback Adam! Sorry to hear this is happening as we want you to continue to use our app as your main tech news source! Would you kindly update to the latest version? We improved the offline experience and resolved some issues. If it persists, please email contact@news-republic.com \nThanks from Appy Geek",
            "date": "June 21, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Samuel Ferreira",
        "comment": "I am not giving a 5 star cause after a while of scrolling lot of the articles are about the same news. Never the less the app is great, really nice looking and really interesting stuff! Keep up the good work!",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRk9CbG8yNHRfQWlKN1QtU2dQVjJWaXNMcWV5SlhMT0w0NmJ0T3JIUzdMNGR6UzZ6di1NUlVScG1wUGtmSFJLdTBJZThYbHFHM05uRmRFLWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "James Frary",
        "comment": "It has changed so much. Not simple to use. I just want to read stuff I care about on my 15 minutes of break time. There is a clutter of swipes and junk before I finally find what I want. Uninstall.",
        "date": "November 8, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRXlUdVdDSDVZZDMzMGxQdFdJV1g3dEJTZzZNamtGeTZpc2t2SU9IYkNtS3JHTGdGQ1JiS1VvZ1FFVEUxaGNmY0Q5aW5ZaUdVRWJBSGVnX3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Richard Lucas",
        "comment": "Now that you've able to get rid of the ads for a reasonable subscription fee there's little to moan about really. You'll need to fine tune the notifications then sit back and enjoy the app. It really is rather good..",
        "date": "November 27, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRzhKQko0REdOR3llanhRNkFRZFBfNTl4SU9SVDF5RzN0SnBKZXYzSHdzOHhjb3VwYmFMT3JwS18tYkdhemQ3alVZMEtXQ3RmaklPdVZCR1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Andrew R.",
        "comment": "AppyGeek offers up a plethora of articles from several sources with plenty of choices for tayloring what you are interested in.  The main problem I see with this app is that it feels and appears very cluttered almostbas if it is struggling to show too much. I am no graphic designer but something need to be done to make this app feel more streamlined and visually pleasing.",
        "date": "November 20, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRzFCT2RiR2pSdEtIaTFaeXgzMlhGQ3ZRNVIzb3VmSmg2ZjUxV0ZRS0FVWnhXN1VyUS0yX0hBTUdBaTlGNmFqNzhxMmZyVWFJUGplYnVDYlE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Paul tiffin",
        "comment": "Good if you are an iPhone geek. Most of the articles refer to the iPhone and apple products. It's a bit frustrating because I have always had an android phone and most of the articles do not interest me. Will give it a couple of weeks more. If no improvement, I will delete",
        "date": "September 26, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPR0tBaXFRVktlMVR3aGY3VUJxVDZsd3ZqT1ZibXRQc2tiT2ltRmstbHlndEpFX3VoMlBvNC1vNXM4WEdJWG1NWEI4R2xMVW5IX25aRGpXMHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Amit Gumber",
        "comment": "I like this app for tech news but I don't like political news in this app. It feels like same propaganda push all over again. However it's good they have option to exclude main stream news websites...",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRjhsUS14Zk1vTmdJVkRrT3U0emd3TENTTTRoaWx2MXNUZVpFZnVWNWhzWUFGaEJUQ2h5SWlfLV9aOHFSejJUWkRnb0pTR1dHN2lWMzF6WVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "winston choy",
        "comment": "Not terrible, but should be better. For one thing, it's unreliable. Sometimes it doesn't pickup any articles for some reason (yes, I verified I had an internet connection). Also, tagging doesn't always make sense, eg almost no articles in the digital camera category are actually about digital camera.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSG5wWGxXVFVCdl9MRVpQNW1qZVhhLUZncVFIUlJRMEl2YnprZWJWN19kTTRQcjBIcjNUYlI2VnhES1BMXzY2RGkxRHdhcG50YzRSU3lFenc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kai Löwe",
        "comment": "Beware! After having the app installed for a couple of months, without any problems, it suddenly suspiciously downloaded 1.4GB of Background data at 4am. I have tried to contact the app \"managers\" but have not yet received a response. I don't know what the app may have downloaded but considering the time it initiated the download and that it was using Background data, I am concerned that it may have downloaded personal data.",
        "date": "October 12, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPR3ltQkIySWZYQTRaZ0IwU1BpQ2pwMXRNUUFJN21qRVpCbTdCdmdOQ0RoUXZXcDlkeVY0a0NyUGJFczNIMVpVZHBzczFpUUhvSEJ3RUY4UkE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Mikail Koca",
        "comment": "\"Easy to handle\" comme le disent si bien les anglais. Les centres d'intérêt sont personnalisables. Système de \"like/dislike\", de commentaire, de sauvegarde de rédaction, etc  Au top!",
        "date": "December 20, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSG9BaDFVT18xNWdyS05KMjUtMXkxUVZYc182bjNSMGl4NW1TY0FMMWxQSWk1V1E3WkhqTXlFeG1jWndKRUR2YTBwU3YzSDI4VURFamhBZlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "RIC RUDKIN",
        "comment": "I love this app. I reckon I spend an average of 45 minutes a day flicking through the articles. Love the fact that you can easily click to read the articles on the Web as well. The only minus is the comments section but I'm not taking a star of for that.",
        "date": "September 11, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRVVCbWRBWUNNbFJpVFIteW5jU2E0bGJaS1JnVVMtcEJtUm9XdVNzd2w3bi1lMnFMWnZ3eG42UEpHUV9WLTUxSXJNTE5HUldoZVNuTGJ1T2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nathaniel Clay",
        "comment": "*DEVS WE NEED AN UPDATE!!!* The \"Network Disconnected\" issue is a major let down and still hasn't been fixed MONTHS LATER. I constantly have to disable my connection then reconnect it to get it to work. Fix your article update issues.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRzdjaVRyeTFIXzJTSlJlTHNGdm5idmRObFJxWXJtbGhiWGxibTdDLXR4RW9ScGpBWGZTZ0t0YWxrQUotdnFGZ1R0OE9ncmE1ZzdrUWt2X2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Sam Quirk",
        "comment": "Paid subscriber that previously liked this app. Unfortunately recent problems have emerged. My topics function has stopped working consistently. Link from notifications to article in the app also bit inconsistent. Search function indicates multiple articles available on a topic, but then prevents access either through search results or equivalent My Topic. Multiple support tickets submitted & no response so far.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRm9YN2xhNHNZQS01cXQ1b05kSWN5Rl91SHdrRjIzYTRtekZMSTE5ejdHU0ZpcVJrc2dtT0ZDSV9fWmVZSTIxU1VfWlBJR1RlZzZJMHhmMVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ji Luo",
        "comment": "Good source of news. Need to frequently force stop before new articles will load. And every time I open it it says 99+ new articles in all categories which is meaningless. Why not have a higher new article count. 999 or 9999.",
        "date": "August 27, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRUNoby1Tcmp5UDFIcms2MElFZUpMUzFuNFQ3NXgzOWVodmJzTDJneVpsclZlem9GVmNWTWN1eDFWMVdlQ09pRm1GVGM3UFFKSVZaQ1dteEE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Scott Gunther",
        "comment": "Does this app support  anyone s application app idea and securely so that people can submit their ideas to be created into an app. And or have it so it's Pay It forward for the persons application to be created from the idea they come up with in exchange for maybe a percentage of the profit from if we are successful depending on what agreement can be arranged",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSG9sS1BtUFFVNnp3a1EzOUltek9ULUZEazRkbTJsTkMxQXJOOVJGcml3WFZWTGdmaHlJTUFsa3VqSjFVUlZtaUlFYTBjTC1qdFFfLXJaV0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ahiesh PVS",
        "comment": "Gr8 work guys..Keep it up. One of the best tech news aggregator. Although..the widget version and the app are quite slow for Indian networks. Pls. optimize data usage and make it lighter for my phone. :-)",
        "date": "August 4, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSGY4VW1WY2RRd2NoOFBrNEdjcjNNSEx3d3BwdklMR3N3Q3J5ZVZtU3puM1dfTzJRS3NhaHR4ZFVfdWh6RkNhV2xURDdJcU9ITVJqUzE5WUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jacob Flynn",
        "comment": "Working better than before. Still cannot leave comments on articles because you have to use Facebook. Why? That's stupid when there are so many better commenting systems out there. Discuss is a good one. It is the only thing keeping me from giving the app a decent rating. Facebook isn't the center of everyone's life, certainly not mine. So I don't integrate it into everything I do. I'm really getting tired of needing Facebook to do anything online now. Plus guys, c'mon, it's not very geek like to force a standard.",
        "date": "October 31, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRXhzaENsc2szdllDd3Q0VGJkVVU5Vjl5OWlwRjN6cDFnOG5jMUs1d3d5ZHB5M3cxT2pzOHNpOWlKZHVpQlROSjBBWUJwRG9CRkZrdTAtWFE",
        "reply": {
            "author": "News Republic",
            "content": "Hi Jacob,\nThanks for the feedback! We are hoping that with our latest updated the display is looking more clean and the social media feature appears less intrusive to our users who prefer not to use that option of the app. Our tech team is also currently working on content duplication! We appreciate your patience and support!!",
            "date": "June 7, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Brad Pfannmuller",
        "comment": "Not impressed with no ads being a subscription. Will up the rating if I can get a statement regarding how the personal data is being used (ie not creating advertising profile and monetizing that as well)",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRk84VFBPTEdLWmhCTVp4cTFPOFFFR0tiRnRBMzA4YjJDUEVGZU1aOXRlcF9kd3FqWm1RY2dHTjFQVGhxSktfV1VtQ2lpVE9jT3Z3Zjl4WUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Darren BATES",
        "comment": "Always brilliant&gt;Appy geek should be a standard part a user's core app install ( if they want to know what's happening). I read it several times a day.",
        "date": "September 19, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPSEFhY3BHWG9iMVpWam1HYjI5a29SSndXY2QzbDJjYjhnRi1vRTBRZTVhc1V4emRkUHhmc0dkQTlocVk0MHJPWTc4MlNrMGxhY0xsclhnY3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Vladimir Stojanovic",
        "comment": "For me, one of the best mixed news aggregators. They improved much, my first experience with it was not so smooth on Nexus 4 or 5, can't remember any more (had some problems with interface rendering) . Now is smooth as a silk (on Nexus 6P). It works fine on both formats, phone and tablet.",
        "date": "September 16, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPR1A2TzNmM25RMzQxTUVlYkhiaFZrQnhmZ3A4TDNnSkxwTk10REZtRkswWEl1Vm9jb3FnZHBsQi1sLWRud1Bid3NZVVY5aXhKcjZ5dFlWdkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Shannon",
        "comment": "Was okay until I started getting flooded with articles written in Spanish. If I wanted to read Spanish articles, I would first learn Spanish. No way to tell the app to only show me English articles.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRVBtSVhfelo1MEFRaHE1dHRZVDNWeVpxNzZkUTl5UmVBWlVoNUt1Uk5OOWt4M2lJNDlzTHI4MkZfV2NfVTdjcF9IeEU0NG5ZV2RWa1JpWEE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Kwan",
        "comment": "It often does not refresh and keeps getting Network Disconnected message. Menus are too confusing.",
        "date": "September 25, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPR290aWFZc19seEg3XzJ3dzM4SGNOZEdxM3ZMYkJuc1lWY3NRLU5GLWM4N2FLTEE1Z2dONEl4Qi0zYWtTYkJHSm1XdW83X1dBdk9CaF83N2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Caleb Cole",
        "comment": "Best app for everything technology. You can update your profile, rearrange your stories, save your articles, and share them with friends with Ease. I don't review apps unless I'm extremely impressed.. This, to me, is absolutely the best application for knowledge on things you care about most!",
        "date": "December 24, 2017",
        "permlink": "/store/apps/details?id=com.mobilesrepublic.appygeek&reviewId=Z3A6QU9xcFRPRXVUUUZsU0tVbzNrdU1UdmNrdWp4TlFSUlBRcmprT2pENFpMYmQxdnV1RlJ2NmFPQkFkZlp6QmNnQmwxNEc0ZXl1V0s5dnhpN1NRLW1LWFE",
        "reply": null,
        "star": 5,
        "title": null
    }
]