[
    {
        "author": "Travis Simerly",
        "comment": "Checked the battery stats and Commandr used 13% of my battery. More than the display. Wonderful app, but don't want to lose that much battery. The app is definitely donation worthy. Can't believe the kid is in high school. I will check up on later versions to see if battery use goes down. To previous reviewer: take a selfie works perfectly on Note 5, even with 3 camera apps installed.",
        "date": "September 10, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRTlYLUUxcURBYWtSbXRTUXUzYXdzaDNVNjVQa0NWcFVEQTFJTDFaMnV6cERwV3RHNjI2TERKR2Nkemx1STBKUzFkZ1dQVmdwUW0xc0JuUnc",
        "reply": null,
        "star": 4,
        "title": "Great... But had to Uninstall due to Battery Use"
    },
    {
        "author": "M. Riza E",
        "comment": "When giving a take a selfie command,  Google Now opens the camera app but the camera is not automatically in Selfie mode. I had touch the back button only then the Selfie mode is activated and it will snap a photo. But Strangely none of the Selfie photos are available in the gallery app.  I am using an HTC One M7 running Android 5.0.2 in case this an important info. Hope you can help to fix this",
        "date": "August 29, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSG1IQUJsbkl2aE1FRzkyT3pfRFFmMjVJRXpKb2lNejZ3aExJOThpQjFfVFpxRnJtYVAtOEZ3c3VzMGMxUVJXX01VeW5OWGdHczNYNFh1Nnc",
        "reply": null,
        "star": 2,
        "title": "Selfie command not working"
    },
    {
        "author": "Paddy Whack",
        "comment": "If you say, \"OK Google. Play Sail by AWOL.\" It will goto YouTube and play Sail.  This would be OK I guess if I were at home using wifi. Most of the time when I need to use voice command though, I'm in my car and don't want to use up cellular data. So with this app, I can say, \"Open Amazon Music,\" and with the AutoInput app it will open Amazon Music and start playing a play list of local music. I can't figure out how to make it play a specific song but this is better than nothing.",
        "date": "May 1, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPR0hYVGlQcmZEYndNdW9Uc2xPUGVPa3NYNFJZMDQzTzlmOU5KbEdTa2J2WndkcjJHMU4tWUhVOG5NMTZKQ0VSZGdrOWZ4cERkY0dtMHJEMUE",
        "reply": null,
        "star": 4,
        "title": "It does what I wanted it for."
    },
    {
        "author": "Tucker Karman",
        "comment": "This app will make Google now do practically whatever you want to do and you can trigger any of those actions with any words you type in for each command. I love this app, you still go to Google, it's not a separate app. It's a little buggy and a little slow if you don't have a good Internet connection, but 99% of the time, it works like magic. (I had an issue with the chat bot but I think that's something with what I told it to respond to and for a quick fix, I was able to just disable the chat bot.)",
        "date": "June 2, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRzJva2FJay1vclp1MzNka0JfOGxOeDMwRklseklQS0RrTVZSVE1vVTZZbkx6SEw2WTZZVnJ2S05lZzkwcV9oRE9JMl9BQXVYUmgxMXF0THc",
        "reply": null,
        "star": 5,
        "title": "Awesome"
    },
    {
        "author": "Ian Odom",
        "comment": "Ever since I installed this app,a couple of settings started changing by themselves (I.e. vibration on keys) and my phone switches to the home screen without me pressing anything. Other than a couple of the voice commands Google searching instead of activating (I.e read unread gmail) and strange settings changing, it works fine. Will give 5 stars and donate if help is offered. Using galaxy s6 active.",
        "date": "January 28, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRzJnZjF5OGR0VEV4Wl81Ynhnek5jRG91RkNlSkxIeUU3TWdrN3B0V2hiaS1keGhOWXp3OTlpZFBIdHBrc3ZFSEhoN2VDT2N5a0hMS2ZJZlE",
        "reply": null,
        "star": 3,
        "title": "Bugs?"
    },
    {
        "author": "Ronda Bernstein",
        "comment": "I was only using this app to turn Bluetooth on when I'm driving. However, due to what I imagine was a change on Google's part, Google Now just opens Bluetooth settings, ignoring this app altogether, and I have to manually turn Bluetooth on. If I wanted to look at my phone to do it, I'd just use my Bluetooth shortcut from my Power Toggles App toolbar. Unfortunately, the developer is now in college so probably won't be updating this anytime soon. Too bad cause it was really good for a while there.",
        "date": "September 27, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRWFEVl8tRndTUHI2SFZaX0F3SV95VXFkbnlfR2E1UkpLYlhMUGIzdlpwR0NDakpfcjVFc04zYmtGNmdHdTZKY2NkczZJNXhseWoteGRoelE",
        "reply": null,
        "star": 3,
        "title": "Unfortunately not working for me now."
    },
    {
        "author": "Mitchel Wood",
        "comment": "All I wanted was a simple OK Google command (\"Play Music\") that will start my music playing. I have created a Tasker task called \"play music\" that does just this, but am trying to use Commandr to link this task with the voice command. Without this app, Google just does an Internet search and shows me a link the the Play Music app. With this app (and accessibility options enabled), I get the exact same results. I have even changed the command name to \"this is a test\" and Google still jist does a search!",
        "date": "May 27, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSGtFdWk0WGJfSHk3dlJxRW04ZzJJVTVKTXlDSXhqSGYxckI5OFZTdnFYU3FwbWlHYWlTVmU1RUQ1WlVqSVM3YXl6Z2dGOVo4Ykhva2V0c1E",
        "reply": null,
        "star": 1,
        "title": "Doesn't work"
    },
    {
        "author": "Harshveer Singh",
        "comment": "I just checked few options and it works well. I can reboot my phone with voice. But I still can't find any app that can work all the time in background processing our voices as commands. I wish my phone to be fully operational with voice only. I want my phone to listen even if screen is off. I can't configure google now for this to happen. Please find some solution. THANKS and ALL THE BEST.",
        "date": "July 10, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSGpLc1NqY1NOWE01VG1uY2Z3TzRhNElQamM5VVJXelAxdHVhT2VoUHhMY1BDSkZpQkhhSFk0akI5dmF4OU5BZUhlLTZVNXdrUURYWFgtSFE",
        "reply": null,
        "star": 5,
        "title": "Please make my dreams come true."
    },
    {
        "author": "Crosby Harbison",
        "comment": "Lock and unlock phone don't work. Take a photo and take a selfie photo orientation is incorrect on Nexus 6P Many commands including battery, tweeting, and Wolfram Alpha searches only work if you click on the transcribed query. A few of the default commands are enabled already in 6.0 (at least) and work better natively.  Would love the \"what's up\" command implemented.",
        "date": "November 8, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRUNyeGV1bmowMEF1WTdsQl9rUDAxc2NnRGdZb2dKTF9oc2JGLVJJRDNBY0l3azUxLUFQdm1UYkxEN3BPeHljdzlsQ2tvNXJXS1p0MHgza0E",
        "reply": null,
        "star": 1,
        "title": "Doesn't work well on 6P/Marshmallow"
    },
    {
        "author": "Steven Heibner",
        "comment": "After about an hour of playing with it, the only little thing I noticed is when you have it read your unread texts, and then hit the back key, it will read them again. Not big deal, just hit the home button. I'll keep the adds on  for your college fund. Keep up the great work.  Oops, one more, If you don't clear the notification for the unread texts, and you ask it to read unread texts because you got a new one from someone else, it will read the older ones as well.",
        "date": "June 22, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRVcyV1l0VUdVZWkxLTk5ZHhJekl6eHFtSHFFajIwMGFyTm1kRjZEdlMyOG9kcXJLa290TmZ2OURlU0F5bkQ2SWFMcFZiN0tHYjhDZ1Z6NGc",
        "reply": null,
        "star": 5,
        "title": "Great app"
    },
    {
        "author": "Kory Wiesner",
        "comment": "Pretty great app with lots of features. The only gripe I have is that, on CM13 anyway, each time you issue a command, commandr sets an individual search page in your recent apps list. This can make it hard to navigate through apps that you use frequently, especially if you use commandr frequently. Thanks for the great app.",
        "date": "May 11, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPR1FsQWJYd09vaU01YjJtSW9UbGE5SGVZT1p3aURoT18tWDZXd3NjX3hUYWFZR3pXVkUyLUVIS0xoZkhDbG5wZV9BcG1CWFdmblItYTMwS3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Mike Alexander",
        "comment": "Unfortunately has an infinite loop problem with Android 6.0 voice parsing where the two fight indefinitely. Doesn't really do anything on Android Wear. Worked great on past versions of Android, but feature set is extremely limited unless you just use it as a simple interface to voice controlling Tasker task triggering",
        "date": "November 28, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRW1UUWZ1Vks5Y0xMNWU3dG5iRm9PYmtoWlhTbVh6VklvdUswdEdtQWtnZWFFeEVVbXlOemxCd1BzQm9KUlBjazJtaW5kWmFHbzNGdF9pX2c",
        "reply": null,
        "star": 4,
        "title": "Good for quick voice triggering of Tasker tasks"
    },
    {
        "author": "Jeff Thom",
        "comment": "Been using it for a few months and I am really loving it. It would be really nice to have an option to ignore errors.  When Commandr doesn't recognize something it give an error.  It would be nice to have it just ignore this and not give a message that then has to be cleared.  I regularly get this for common google now type commands like 'current weather' or 'sunrise time'.",
        "date": "January 31, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSGxSRjF0WGNrUGhQNmNwd3hGandSLU52WFRMbTA0ZzRDRzJBS1h0c3djbmhvSmJNV1RsdFdBYjRZWEh5QzlneUx2MWpGZkExbm5NUHVvMXc",
        "reply": null,
        "star": 4,
        "title": "Almost perfect!"
    },
    {
        "author": "Matthew Sykes",
        "comment": "Was just getting really good was considering 5* BUT then lollipop... had the app a long while. It work intermittently and even when it does pick up the word, its intermittent if tasker runs the task.",
        "date": "June 26, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRmhIRlhDaGxfTTZqQWx4MGlkb3ZVbzdNT3hHWGdpMWEzMmRjWl9KeDBjMlFGc2FmU005OUZSS0lKVnZlWU1xMjctUmRtMllHSERJSmZLeUE",
        "reply": null,
        "star": 3,
        "title": "Love it but needs a little work."
    },
    {
        "author": "George Adams",
        "comment": "I love Android. I love the Okay Google function. I have been struggling because the function works completely on the Motorola phones however I recently purchased a Samsung S7 and the function with only work when the phone was unlocked. With this app my phone only recognizes my voice and I can command it from the lock screen!!! This is the first time I've ever donated to an app but these people are heroes.",
        "date": "June 1, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRnRMY0dTOHRmeElXbFpWSkhWVDhsLTlLeEs5UVc0akNIOVI5dGlDdG9QbDdhYklkVlRhTk94VGFSX2pxLTFqRE1SY2lqS2E3amJjWjl1VXc",
        "reply": null,
        "star": 5,
        "title": "Finally found you!!!"
    },
    {
        "author": "geek dude",
        "comment": "Asking for continuing our using limited version. I went for continuing, it says it is integrated with Google now but any of the commands entered in it is not working with Google. Useless app, and just in few minutes drained a lot of battery.",
        "date": "June 29, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPR1NtLVVNMEpmTHBYdTQybzcwejRfUWpJd2h5dHZuWWNXY2dYZjAtV3hIYWxZS0RCTzBMel83SDE3U3dUNjd2VE4wWGphUWdFLWF3UVEzc0E",
        "reply": null,
        "star": 1,
        "title": "Not at all working....."
    },
    {
        "author": "James Burn",
        "comment": "Moto X pure, Android 6.0. straight up doesn't work, maybe not compatible with Android 6? Trying to get voice control working for my Phillips hue lights. Hopefully it will be updated/fixed soon, would love to donate",
        "date": "August 1, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSFA1OTVfZWJrR0J0bTBFclcydGRzbEtwdXFYOExsZDVtRFFKWlNxemxYQkhkVzVtSmRCLTJLbXFNRVVmM0gzdGtodjltbFo0M3VJc0c0Rmc",
        "reply": null,
        "star": 1,
        "title": "If it worked I would donate"
    },
    {
        "author": "Ken Weise",
        "comment": "i relly love the additions this make to OK Google, but it is a battery hog. It consistently is the #1 battery user on my phone. My Note 5 could easily do all day before this was installed, now it won't even make half a day. Uninstalling fixes this problem.",
        "date": "February 8, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPR1dqUXoyTDZ4UWl1WGszZ2tUaWUxMzlQTGFnUVpSMDNYOU5Na3d3NlNQVFh0NW1TUXJYUHBISlhlNHB4U250LUFrY2M0dGpJZzlIaDRoaWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I have just installed this app and now I CANNOT USE MY PHONE! You have absolutely no idea how furious I am. Samsung Galaxy S6 Edge. I am unable to unlock my device with either fingerprint or password. One star seems far too much to give this app. Need a solution from dev ASAP!",
        "date": "September 11, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPR3NJNU5yUWZaUHl4QjdCZHlzS3dqVzVLMlVWSlBlQ1lLRnkxYWlUUWtia3R5S2l4TEMwWmlJdlJ3Vm5xQks4ejRnMEFZRFYySWZwRkxIc1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "JT Lippert",
        "comment": "I have an Amazon echo and I've been in a state of confusion because the echo does everything it can do via voice, but if you need more than fluff the echo can't deliver and I have to use the phone which does great with the info and weak with voice. Commander brings the functionality of the echo to my phone.",
        "date": "July 1, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSExSRktVQ3dKUFduTENVWlE4TkFZZVAtdlBwOFc1eF9vcUFJV1h0Z0ZzRmdqTEhrdDhUdVBNRDhScjFjNTM1NHFNaDJIZEhzdWVaRk5GM1E",
        "reply": null,
        "star": 5,
        "title": "Makes now actually voice responsive."
    },
    {
        "author": "Brian McIlwain",
        "comment": "Great app, but add option to only run once you say ok google. Runs all the time and drains battery like crazy. Please fix as the functionality is really good. Hardware- Samsung Galaxy s5. Had to uninstall app until this is fixed.",
        "date": "July 7, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRWZBc0s2ZE4zdmpoM0R3Q1F0elVpa0pwMEFkM19WTUNUQUdYTWE1eWhVYlRjTmxVNjYzZTFqXzFFS0NwdEdvcmhyVzdSN0dZX2s4MW1nbFE",
        "reply": null,
        "star": 3,
        "title": "Great app"
    },
    {
        "author": "Misti Rivers",
        "comment": "I downloaded this app to be able to control music playback with voice. It works splendidly! The only issue I've encountered is that the app crashes when I use the voice command to turn on the flashlight. It happens every single time. Maybe just a big? Overall, fantastic app.",
        "date": "May 26, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSEp3UlI5XzZvNVUtV2xLajhkdk9VMFh5aDdHRG1UeFhPUVhVMkxIOHV4MWQ2djIwc1JTOVlOOUR6aHExelJfNnd3N2NXb29McXRudHZyR0E",
        "reply": null,
        "star": 4,
        "title": "Great app, occasional crashes"
    },
    {
        "author": "Chris Keller",
        "comment": "Sorry but this app sucks! Ok Google now pretty much stopped working out was painfully slow, took 30 seconds to do anything. Deleting this app restored it back to normal. Not sure what happened but this worked fine on my old Moto X 2013 but not the 2014.",
        "date": "October 23, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRTcwemxwS1c3WlpsRkFfb3dOZm9ReXY5NENyemhYX01xaDhBcHBnUGZ2eEZLUjVCSFBjaTBqWGQ0LUpMRzZFckd5NW1teWhmYmI3akRZVlE",
        "reply": null,
        "star": 1,
        "title": "Slows down my Moto X"
    },
    {
        "author": "Howard Sturt",
        "comment": "Developer, thanks for this great app.  I have a nexus 5 and apparently every-time google does an update this stops working.  I mainly use it to hear txt messages in the car.  Stopped again a day or two ago.  Thanks for your time and effort.",
        "date": "May 30, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRS1QN21QTjNSdlk4bWJscnI0NFUwUEZvLXktWkdWS2txX3FQSzhkb1o0QlZjRzJ0ZVVHdkI2M0o4RlB6RjZZOFhWMUJfN1VkR1FUaXdvdVE",
        "reply": null,
        "star": 4,
        "title": "Fantastic app when it works properly"
    },
    {
        "author": "Jimmy Crackorn",
        "comment": "Not intercepting like it should and doesn't save me any time or battery because of that. It misses the trigger more than half the time and is killing the hell out of my battery. Cool but is unfortunately a future install when the issues are fixed.",
        "date": "December 31, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRjQ3OXNCRTM1TXRxbTNjQUdTdjAxYnlqQlVYa21lbGsyalpoeXFIM2k1UHltSk5pdEJKTmlSYkF2TEUybE5EMGhERXl0YTQ5Z0hyWlhTN2c",
        "reply": null,
        "star": 3,
        "title": "Barely works"
    },
    {
        "author": "Don Stauffer",
        "comment": "Can't get it to work. It's not clear but it seems like you would still have to say \"OK Google\" first; that could be disambiguated. My OK Google already can do \"Flashlight On\", but doesn't respond to \"Torch\", so I tried that as a test after running the Setup Wizard and turning on accessibility service. It still brings up a browser with a Google search for \"torch\" instead of turning on the flashlight. Nexus 6p with 128 GB. Powered down phone and restarted. Now \"OK Google\" is unreliable for what it worked with before - half the time it ignores me.",
        "date": "August 7, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSHRQUHJJMXZ6cWJXODRUOVE0Nm85MjBvWGFob2owaF9uZVEyRWU3QzZaV2Y3UVltN2VBbWF5UXgwTWtZbE9IakhUaXA3UmFJR0V3R3AzT2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Braden Dodge",
        "comment": "After the last Google Search update, this app has become deprecated and at this time I can not get many of the commands to work at all on any phone. Primarily I can't get it to play playlists. If I'm doing something wrong I would appreciate a bit of help on that. I suspect that Commandr is no longer capturing voice from Google Now though. This app needs to be updated pronto or I'll have to find something else.",
        "date": "July 4, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSEJpam9rS1QtRW10SDlxc3hXb1Q3TkxxTnNMSC1yaWJBSlptMTFlMEJha2tlT2w3dXlaMV9Ia2d1bGhONm5XMnpxRDEycHpWMl9FM0d5amc",
        "reply": null,
        "star": 2,
        "title": "Was great, no longer works"
    },
    {
        "author": "Matt Pieterick",
        "comment": "Nice UI and good idea, but can't get this to work with Tasker commands. Hears the command in Google Now, but the task doesn't execute. Most the other functions are now native to Lollipop, so will leave it off until next update and hope for a fix!",
        "date": "May 19, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPR18xWi1IWUJMcEItcVNWRnN1WWhPRURHVXRPSlRpT3hEcVlBRFoyUmJkOW5GYWNKaWZkREViN3NpVXBkN2JRM3J5TnpHYmJRUTFlMEhRS2c",
        "reply": null,
        "star": 2,
        "title": "Doesn't work with Tasker"
    },
    {
        "author": "Richard Hagen",
        "comment": "Google command&interphase tool. Looks like a VERY scary & VERY handy tool. Getting in touch with and control of Google isn't always as straight forward as you might think, but getting Google to do Exactly what you need can be EXTREMELY important. I haven't started using CommandR yet, but I hope to very soon. The only thing I need it's the knowledge to avoid making a Ness of my OS & the hardware setting it depends on. Is there a good way to transfer you doc. to EverNotes? Galaxy S5",
        "date": "November 24, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSGVNajhoZ1dqQW52SFl0d2oyNm13WDQ3eG12UzJkTDNDUlBONXg4OXBLc0ZONTR4OGFUaEQydkZWZVhYcldoRGRtdDZoNFBsN3hGc0d6OGc",
        "reply": null,
        "star": 3,
        "title": "CommandR"
    },
    {
        "author": "Joshua Griffin",
        "comment": "It's been almost a year since this app has not worked with Tasker. I've tried multiple devices, and nothing. I have tried to email the developer multiple times, but no response. This used to be my favorite app by far. Now, it just doesn't work. Might as well just delete it and forget it. Fixing the issue probably wouldn't take more than a few hours to do. I always like to give people the benefit of the doubt before submitting a bad review. I have done my part in trying to reach out with the issue.",
        "date": "November 29, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRzhlSkFVTUdCN1BnQzEwam5nTzRNaTJIM0V5aXljX0trVnhFUFV0T2lPNDFxTWp5VmdNaElMOFdqckM3NlFxaVR5NlE3eWhjbzd3QldBcXc",
        "reply": null,
        "star": 1,
        "title": "Not working and no response"
    },
    {
        "author": "Kevin McClain",
        "comment": "Dev last updated the app 6 months ago, and it fell apart to the point that it no longer works at all. Loved the Tasker integration, but that stopped working in July of 2015!",
        "date": "October 20, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPRUk5S2tJb1ZUeTJIZ19sNm9yZHp6T2NoamJVTGhteF9UdXJleFRmbF9BcDF0ZUJJMDlyVk1ZS29OUzFaN0Fub3dFRU1neERKTWVzVEJJaEE",
        "reply": null,
        "star": 2,
        "title": "Broken for months - Dev dropped the ball!"
    },
    {
        "author": "Miles Irby",
        "comment": "It worked on my note 3 and 4. Also on my nexus 5 and 9. When I get my replacement moto360 were going to see how it works on that. I gave it 4 stars only because of a small lag between the app and Google's servers. Otherwise awesome!!",
        "date": "June 10, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSG84Z1Voc0xOYzlydFpmRG5NbDZXWXdxQVNGYXpvXzZNdFpyWjBxU241R3hkY2xkUU95d213UXNZRUVTSGNkYjVZSDdRQVVGZk1rS1ppYWc",
        "reply": null,
        "star": 4,
        "title": "Shockingly it works!!!"
    },
    {
        "author": "Alex Warner",
        "comment": "I try to open the app, but it instantly crashes upon launch. I really wish I could use this app, I really do. It sounds like such an amazingly useful app(combined with open mic+ would be amazing). I really really want you to fix this so I can write I proper review.",
        "date": "June 27, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSFV3bllUTUFXcTR1VFdLTHBEVlQ5UE9pcnBkc3ZmTDB5a081V2I2aldjWXRLX3BwZ255Nm5lWE5ESGxYQUxpWGVacEFjVXJ4MzNTOExOV3c",
        "reply": null,
        "star": 1,
        "title": "Totally unusable"
    },
    {
        "author": "Nicholas Sklar",
        "comment": "Great concept. It's what needs to come pre-installed on every Android. Unfortunately, though, it's difficult to implement for to the way Android is built. Both a Galaxy S3 running KitKat and a Galaxy S5 running Marshmallow, can't seem to get any commands to work. Would love to work on getting it running, but my java skills are horrid. Feel free to contact if I can provide any more info to assist with devel.",
        "date": "December 7, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSGEwT3FrY1dHMEJKS20zenNIbDRpdVNMbTlRQlFOMjBJcllCM2ZDVFpYdFd3QWxDRXZXR2hzOGVRMDRPWjRLN1o1YmV6bGExeHI0LV9BWGc",
        "reply": null,
        "star": 3,
        "title": "Great concept, difficult implementation"
    },
    {
        "author": "jOnAh HeX",
        "comment": "Command with Commandr has a simple interface and easy set up. Now with using google now launcher tasker and utter!,  I control almost every single thing thru Commandr. Thank you for keeping it simple.",
        "date": "July 26, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPR0JBQ3lUc0JRRV9IVTFnYVZtUkhDd3RnQzlERU1fM2QzQXdWNjRFdE0wTGJkd2ZIN05BYXpySm9EeVpNbU1FVkVHWU1xR3dORlFkVlp2d1E",
        "reply": null,
        "star": 5,
        "title": "Nice integration"
    },
    {
        "author": "Lung Chen",
        "comment": "It sounds like from different websites that this used to read out text messages. Now it just opens them up. Not sure what happened, but it would be great if it did read them out loud. Otherwise, pretty interesting and may be useful.",
        "date": "August 29, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSEpEUDhFcG1KVzUxdTRvX0lUZEpvRE0zY2NmamV0bDhOdXFJOTVKVDByc0sxeVNkcF9ZdUdfZnJ2Y0dIR2RxSVZRd1hDUmVmZUw0VzkyNHc",
        "reply": null,
        "star": 3,
        "title": "Doesn't read out loud text messages"
    },
    {
        "author": "Shaun Ehrgott",
        "comment": "Theres nothing wrong with this app. However,  if you have low memory due to all the apps consuming processes on your phone's, obviously some of the features will glitch.. What's surprising is that most people are so unaware of operations but so quick blame a single app for glitch malfunctions in their phones lol  There's a patch (fix) or separate app for every single problem I've read in this comment section... literally every one.",
        "date": "April 13, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPR0lJTGNLZDZaTlR5U0x6VFU5YmJ1bFZ3cVI5cTJpejZsY2hGNWgyd2ViUlFIbUhPVmhTeFlBWmw0NlFaVHY5dVkxVmwtaHNvQ0tmRkZlcEE",
        "reply": null,
        "star": 5,
        "title": "Works great on a modded tab 3 with low memory"
    },
    {
        "author": "Lecnaj Sinalem",
        "comment": "I love this app because it works it really works but I hate the fact that  you have to be connected in the internet first before you can use it and i get tired of pressing the mic button on the screen every time i want to open an app or widgets. Hoping that the next time it updates theyll put in the setting that you dont have to press anything like mic button, All you have to do is give a command without touching the mic. I recommend this to everyone. Love you guys keep up the good work and God bless :)",
        "date": "November 14, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSHJNdkhOMHRBMlI5dlhBRmFFTlJlcW42LWdtRmpSWE4yT0NkNEFNSWh0VWVEVElHdWxxcUh5clZheXhyQ1B2cEFUQmcwWVFmdVptQlRNTnc",
        "reply": null,
        "star": 3,
        "title": "It works but....."
    },
    {
        "author": "Michael Davis",
        "comment": "Downloaded to use with my lg g3 and moto 360, but cannot get any voice functions to work on my watch, all commands either crash android wear, or just do a Google search, wanted it to work so bad but had to Uninstall",
        "date": "June 26, 2015",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSEttMnFZMW5lX095ZHZma1hkTlBCMHRDQ0ZGeEVrMUJicjdDUkRlWWhVNFJnOWhjU2JYWGVHRzBjUlBzMnZBUEdCUFpLYkFwRHh0bzZTX0E",
        "reply": null,
        "star": 2,
        "title": "Good concept but doesn't work for me"
    },
    {
        "author": "Ian Macdonald",
        "comment": "Perhaps superseded these days by AutoVoice, I nevertheless wanted Commandr for its alleged ability to interface with Wolfram. Unfortunately, I wasn't even able to get the basic Google Now integration to work. Commandr steadfastly refused to hear my spoken commands, even after enabling it as an accessibility service.",
        "date": "January 9, 2016",
        "permlink": "/store/apps/details?id=com.RSen.Commandr&reviewId=Z3A6QU9xcFRPSFFOeGZJQnFtOEtTS3BmTThrNUthdjJrWGl0RzZjTW44ZzM1TTJRWklhWGUyazVaSmhVLWhWRFZSdHZ3TDVUUFJieVZoMEI5RVJBSUUtQXc",
        "reply": null,
        "star": 2,
        "title": null
    }
]