[
    {
        "author": "M.",
        "comment": "This is a great app! I subscribe to alot of Podcasts and this app lets me store them all in one place & even have them download automatically! Lots of good features. definitely a 5 star app!  Except now when the widget and the menu on the pull down screen has STOPPED WORKING! Will give 5 Stars when fixed. Thanks",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSEsyWmI2OFRLOG5ubXI4YVktNGV1dlU0Sk5DN1dwR2wxVkU1MzZRRjJZVzZGZDJQTnE1SzhrYkY2NWpTaDFzakFDeXgxbkR6QmpRV1pfRlZn",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "EDIT: Please contact me first in case of an issue before rating the app, so I can know about the problem, gather more detail and help you (Settings/Feedback)\nThanks",
            "date": "February 27, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "David Ullerich",
        "comment": "This app is excellent. I haven't tried any other podcast apps, but that's because this one has never made me want to! Ability to set bookmarks and listen to the time-stamp instantly, ability to download podcasts for offline listening, this app has everything. I've found every single podcast I've looked up so far. Extremely satisfied.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR1N1eDZiczZIY3NUWHl4RGt1bUtFNUE4cmVzaGh3REg4NW1DUW5uWFd2aUNJaWVtV3RZZjMzX2NMTTdsX3hiLTd3ajl0dERzSFZoc0EtYnpJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jevan Saks",
        "comment": "I love this app, it's simple and the interface is good. But lately it has been draining the battery while in the background (not playing or downloading anything!) and I frequently have to force stop it if I want my battery to last all day. :( Fix this and this would be a five star app.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRlMtMHFoanVOd253czNvTTlYVi1qUU0zNnRSVzlmcHR2cHE4NHlkb29PMXpmTHFkTmZZeFNCX1d0dXBsMmZFYnJBVkRVYl9IMTlqNDRWRGp3",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Please contact me first in case of an issue before rating the app so I can know about the problem, gather more detail and help you (Settings/Feedback)\nThanks",
            "date": "March 4, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Nick Maludy",
        "comment": "This is a great podcasting application, the best I've found. My only criticism is that I can't find the \"New Podcasts\" or \"Downloaded Podcasts\" pages. Periodically when the app syncs it gives me two notifications one about X number of new podcasts, another about Y number of downloaded podcasts. Clicking on those notifications brings me to a nice screen with those new items displayed. If I accidentally close the app, or silence the notification I have no way of returning to those screens until I receive another notification (the next time one of my podcasts publishes new content). Please, if you could, add links to those pages so they can be visited on demand, instead of simply through the notifications.  Edit: Based on you're comment I've given this a 5 star. I have to say this is exactly why I love this application. Everything is configurable!!! Also, amazing support, thanks for your help!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSEVHdTdVTWFySUdGd215WkJfSE9Fd1Z6MlY2YnJDRi1OS24xUjNYdXFEMnotNThhNE5fY3l5RXBEOFFzNnY1TWoxbmgxX0l2YTlETUFSLW5r",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "You will find the downloaded episodes page in the navigation sidebar. You can open the Recent episodes page to see episodes published for the past 7 days. They will include the latest episodes. If you prefer to access the new episodes screen from the navigation sidebar you can go into Settings/Sliding menu to add this entry",
            "date": "January 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I like this app. It is easy to use and I have found every podcast I have looked for, so it has an extensive library.  The only issue I have had is that sometimes it stops working. Even when I'm on WiFi and my phone is not moving, the app will stop playing the podcast. It is not that it is searching for a signal, it just stops playing. But that said, I still recommend it.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSGNjdGFDT3BfWVNpcFYxT0VRZkc3RzlvRy1JcXZJX0VYbVFLQzFLTDJnX2pWVEFEaVFidm9tMjg5bTFsbHZibEVOSHNVVk5NUUxqSDF4WVVv",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Please contact me in case of an issue so I can know about the problem, gather more detail and help you (Settings/Feedback)\nThanks",
            "date": "February 25, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Matt Jones",
        "comment": "This is a fantastic podcast app with a lot of functionality and customizability. The UI seems a little daunting at first but you just have to play around with the app and the settings a bit to get it the way you like. I've used this app for a few years now and I've never wanted for anything. Definitely recommend.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSDhlM0c2M1RRdVVYaUFJa1g4aFpsMWFGMnpvYk5WdTFqd1pqa1cwRnBHZS1INGNFR01JRl9EYXVXMWlqUEdRMkdFczFMYUFvd0g2OXlrRndR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tom Koslo",
        "comment": "Google Pixel XL (first version).  Great app, hope it doesn't change in ease of access. Well organized, efficient, great download speeds, and intuitive.  Only criticism, and not so much a technical one, UI graphical interface can be improved without a deficit to performance.  I downloaded this for function so 5/5.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRXU1RUZQUTFnRG84c280aDVwbDd0YlFLWllaTDExVzNfTUhKNGk0SWZUcmFmTTF0emVXTjJScUF0RWZSMnhka3lvNUF6WTYyR19QMWgyTkJV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Amanda Artusato",
        "comment": "It works good, I downloaded it because it is works with Android Auto in my car. Initially I thought I would have to download all episodes to listen in my car but I got a message from the developer saying I would fix that in my settings so now I can stream them through my mobile network. Thank you!",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR1ZyNlZ3Y1FZNzJTNjFVZWQtdml3V21BSXByUHEwWVJKWFhmVFh0MzFXTHJqWFhZbXdQUkUtcW5mVDNLWmtPdTdlRnctUWtPUzB6Z1FkbmU4",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "You don't have to download episodes in order to listen to them. You can stream them if you prefer.\nJust make sure you authorize the app do download over mobile data (Settings/Network)\nPlease contact me first in case of an issue/question before rating the app so I can help (Settings/Feedback)\nThanks",
            "date": "February 27, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Austin Wilson",
        "comment": "A massive upgrade from the other app I'd been using. I'd really love an option of fast-forwarding 5 to 10 seconds on the player, *especially* on the lock screen. It may be there already I just haven't located it yet.  Edit/Reply: Right, I use it to fast forward, it's just incredibly inaccurate as is.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRmVrTEJLUVZwYVltcXM3OE9tY0htUl9uZnhSYlR2RE5NeG5GcWpDTmE4TUZsN3lTYlNYTWpiNUdjOHBfakJRMGR0VDNVY0R2a21BUlIxNEpJ",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "You can press on the player screen fast forward button to do so. This button is also available in the app player notification / lock screen. Feel free to contact me if you have any question (Settings/Feedback)\nThanks",
            "date": "March 2, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "2Karl Tessier-Ashpool",
        "comment": "This was the first podcast app I used. I see no need to even investigate others because this does everything I need. Download immediately. Uninstall all other apps. This is the only important thing in my life now. I have divorced my wife, killed my dog and burned my home to the ground. I live in the woods and I'm slowly starving to death, but it doesn't matter because I have this app, and it's the closest approximation of God that mankind has ever discovered. Playing multiple episodes of podcasts is a little cumbersome though, so four stars.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSEZPT2xFeGhtWTY3N3puVjY5Rm1aSk9qamYxa1BkbVlUQy01SzMzQ3NSQmtOdDlubm1DNFktRTc2djk0WVp0UEVXUEJ2WnR2SGJSRnJQOEY4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "gregory barton",
        "comment": "Oh, if only there were simple basic podcast player. This one is overly complex.  Different menus are complicated and too many advanced issues obscure basic functions. Unfinished podcasts appear in the player by default and are difficult to over-ride.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRllDakhmRWxQWExmY2RiSzAyenFFMG10SVdlc1VZb2stTXVUV29UdzFQb3l3MjVtYmRJbEJUZmxxS1hTcjVQZ0ZZSW9lRW1LS1J2LTZvM1BR",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "When you open the app it displays the last unfinished episodes in the player bar so you can just press play to resume playback. You don t have to use any advanced feature if you don t need them. In fact you can use the app without opening any menu if the default settings/behavior suits you.\nPls contact me in case you have question Settings/Feedback",
            "date": "January 9, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Martin Atkins",
        "comment": "I was looking for a replacement for Google listen, and this fits the bill very nicely, with the advantages of not being linked to the defunct reader, and having great lists of popular podcasts. The only thing I miss is that there doesn't seem to be a way to only sync when on charge.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRXVScGVDVktzaDNPUDV4bWpvejh6UWlURkh5Y3hzdDdoMHJaRWRjQm9IYS1yVWRuUVJ0OGFKalEwV2Y1T0VKdmFrU292cUxHYlVCQkpWYmxz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "James Chauvin",
        "comment": "As someone who switches from android to iOS every few years, this is the best podcast app I've found for my tastes. I'd say both this app and Apples native app where both equally fantastic, until that is Apple conpletely screwed the UI for that app last year. So yea, this is a pretty great podcast app.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSHF6Sm9yeDRfSDg2RUlsS29sb3p0UlpUNEIydGhSMDZGbERScTdMT0lnLS1GZHhKNm56b09tQnpsdmNRWjFjQmxvTHRWdFlfMTh1ZWh5TG9J",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Cheryl Barron",
        "comment": "Nice little pod cast player that could. Easy for us older folks to navigate. Still mystified by seperate small app to remove ads but guess he's got to pay the light bill somehow. Go ahead -get it!",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRjViazFCQ21ucFJoN1R6ZE55ZnkweTdpSGVBaENiZF9tUEZhQkFCaXh3NFVGWU5JNGIwUk1RRGJSVEw3cFFhLVlMcUZwUlk3MWwyQXpQX3k0",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "If you buy the Donate app, then Podcast Addict will be ad-free\nFeel free to send me an email if you have any question (Settings/Feedback)\nThanks",
            "date": "January 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "A D",
        "comment": "Like the app in general, especially the fact that it can automatically start playing as soon as earphones or a speaker is connected. Currently the skip/forward buttons don't work well since it doesn't easily rewind to the beginning of the episode.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRmprUHpBenZQaW03dTc3NGo0bkh0ZkZ6d2NBalI0b1gtQjVRUFpUdjhuT3l5aGlCZTZBOEpXaDlScUViUEMxNGptVDQ3eG9XZVo5bTZCT3Fn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Craig Felder",
        "comment": "Playback is inconsistent, at times it spunds as if it is buffering even though the episode is downloaded.  Pauses by itself and wont play after hitting play button sometimes.  Easy to use and has the podcast I like, that is a plus.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR2p2UjlHV3Zkck9HNTRIQnBqNWdHSjlMWDV4bThNS0cwUkVBaElmT1NvYzhPWXdGalZXVm1lYlphVmttS1hsRGhlOWJYY2JoTExybnI5VXBr",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "What you describe means that the app is streaming and not playing a downloaded episode\nPlease contact me first in case of an issue so I can know about the problem, gather more detail and help you (Settings/Feedback).\nThanks",
            "date": "February 21, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sara Fz",
        "comment": "I really love this app, but IT HAS NO SYNC, or cloud backup. So when my phone broke down and I had to reinstall everything, all my podcasts and episodes are gone. So that's a bummer.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR3QwblJPcGRwMEZsMl9JMmZ3X1p3R0tkMTYzdUxMSU1TNzBBMkRodFlfWHFQNkxlaXUxQXpoWEtNdWxXZXNocWt3TUNDdHptZ0cwT0hqQW9j",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Walter Bartek",
        "comment": "I loved using podcast addict, until I tried using it while I wasn't on WiFi. Even though I have everything set to WiFi only and have restrict background data enabled, podcast addict used 200mb of background data in a day of use. It looks like I'm not the only one with this issue as I found many threads about people having the same problem. If they fixed this problem I would love to keep using podcast addict but as of now I'm going to delete it and try something else.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRWdlU2ZyTGlpR2JHUVRwNjlBSWVudTdFWTRMY2QyaFpMTlhqUFdDa2haZ1Bpb3o0eG5vanBxaGplUmxmeUY2RDNJcXJpMmNJV29TX1pHelBZ",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Please contact me first in case of an issue so I can gather more detail and help you (Settings/Feedback)\nPlease give me a chance to help you especially if you 'love using the app'\nThanks",
            "date": "February 28, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Daniel Robinson",
        "comment": "Love this app, very easy to use. Been having an issue since the latest update though. On my S8 I keep getting system maintenance alerts saying the app is using to much power and needs to be closed.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRTJXbG9lV04yUDZHZnl3MGY2OFNrcjVqdFFrYVhzOHB1UlpXNzUxUk43Vlh0MDQzaG1jckZaRU5wcldwa2FfemFVbmswcm91YjlfNkd4Sjhz",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Please contact me in case of an issue so I can gather more detail and help you (Settings/Feedback)\nThanks",
            "date": "March 2, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Gus Stotts",
        "comment": "This app has impressed me every update. It works really well. It has all the scrubbing features I could want. The search tool is a little weak but if you know what you're looking for, it's there. Highly recommend it for podcasts. I have Spotify premium and I still prefer this for podcasts.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRWdIN1NiM0lGSENiak50eHBHSzdMS3hWWWJNLXpNUjBrZTliRVFxTXJob0FESnpfcXQ3cFJvVXpvWFBBTVdCeng1Y2JvMTFPYWV5bUt2R21v",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "What do you mean by \"search tool is weak\"? Please let me know what the issue is so I can help (Settings/Feedback)\nThanks",
            "date": "February 21, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jordan Earle",
        "comment": "The app is OK. Does what it should, but the interface can feel clunky, can't change the font sizes to smaller. Other small issues. I like it though and I would recommend it.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRXhHTXlnTmRGWkoxSjBEN3pZZUlxWmVHd1JBbVVZUDhUNXlRdFNpaUwzVW0zdUdwRUd0NFRQdm1mV25Pd1BKdGhZZlpnQVctdHBSR2hQVDNF",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Please contact me to provide more details about the issue you're facing so I can help (Settings/Feedback)\nThanks",
            "date": "February 27, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Nikita Ostrovsky",
        "comment": "I've used quite a few different podcast apps on the Play store and, although this isn't the most aesthetic, it's unquestionably superior in functionality. The most glaring omission by all other apps that I've used, is the ability to search episodes of a podcast you've subscribed to. This app has it, which is a lifesaver. It doesn't look beautiful, but then again, it's a podcast app. As long as it let's me listen to what I want to listen to, I'm happy.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR0llMmpEdXpGTzZoSy1MWF94TndGWmtMeEdFaDBLejM4OW1WWkRGa0ZPUUg5NnVUNE9wUTl6b3dtZXd2OC1iNm5NVU96aE9nZjB3TDFPMkFJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "D & N Hole",
        "comment": "So far it doesn't seem to 'eat' my battery like the app I was using previously. I'm also having fewer buffering pauses. Like the previous app, the volume of podcasts varies quite a bit forcing me to adjust the volume frequently. If enough people contact the app creator asking for volume normalization he said he will address this issue.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRUx2b3cxTmZnV2VXV2JsVm91OTlxaTJEaWF0VVdIVnRyajI2bkMxYlFwcU9ZQXpHTm9YbkcyVThocVJjZ3dRX1BCY3dyVDZjNFJITzRMaW9Z",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "patroklos ana",
        "comment": "Great app!  I recommended to everyone!   I had a problem with the audio resume and the developer replied and helped me in a few minutes.  The problem is fixed and i am making this app my only podcast app and deleting the other two i was trying out.  Thank you Xavier :)",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRnQtNzFBV0pkTGg5cFptSUJ1QW0tOVBDZEpZM1R6d2xwdF9GWGE4WHp2SDlSd2hkWkpxZnh3Y0MzX3g2andlR0FNZHhUT2ZwQllJdTNHNXZB",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Please contact me in case of an issue so I can get more details and help you (Settings/Feedback)\nThanks",
            "date": "October 14, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Chad",
        "comment": "The app is wonderful, fast search engine, key words, etc. My only issue is that after I have downloaded a podcast and I click on it, no videos show up except ones I have downloaded no matter what I try to do. Often times i have to unsubscribe and resubscribe to access other content. This is tedious, but otherwise great app",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSHNQVlZLblhSYXlRRlM5REVQQlBOdTFKM18yOVVNbXhieDFfWFREcnF0Wl9oY2o4U0lZVzFLdEdkQXNqWTF4N09JSDJveFJVVnRzbWJ5MDZR",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "I'm sorry but I don't understand the issue you're describing. Can you please send me an email with more detail so I can gather more detail and help you (Settings/Feedback)\nThanks",
            "date": "March 3, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "André Lopes",
        "comment": "The best app available. It does anything you can imagine, have all the features you may want. You can personalize a lot of things. Ads are not annoying and the free version has the same features as the paid version. Consider buying the app to support the developer, I did so.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSG5hTU9tZEtLSnhFTTQ5MHUxSXNnTUhuWS02VGJ0X2FfcDFnLWsxM2w3N1FIOE9Kczd6b3pVeXNvdFZvbEhBTXg4N3p5Ql9oV01yeGp2cFl3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chris Homsley",
        "comment": "Changing my review to one star. The dude who made it goes to EVERY SINGLE slightly negative review with a smarmy attitude. Nope nope, my app is perfect! Must be your phone! This is not just sour grapes, my initial review was 4 stars, as were many other high reviews.   If he wants to stay on his high horse and blame others for the bugs in his app rather than own up to it being imperfect and attempt to fix them, that tells me he is not someone I want to support. Will be uninstalling.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR2Frb3JydzNnNV9WT3o0UE5ZbWptQjVWRFFMa2NQUjNxQk4zT2dvbnhVR2tnQWtOQ09VRmNiLWp3a1E3NFQ1c0ZXdUhDemdzSHJkTlVkWGdZ",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Where did I ever say that??? I spend my days fixing bugs so I can assure you that the app is far from perfect. I'm just saying that what you describe is the device killing the app. Then I'm just asking you to contact me so I can help you fix this\nNot sure to understand why me trying to help makes you lower your rating to 1 star...",
            "date": "February 25, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Henry Mittelstadt",
        "comment": "A totally unintuitive and cluttered UI combine with unlabeled buttons to make a throughly unpleasant experience trying to switch from a different podcast app. How can there not be a search option available from the main screen without going into two different sub-menus? If there's a way to listen to episodes from oldest to newest I haven't been able to find out how to do it. From a technical standpoint at least Podcast Addict allows RSS feeds and doesn't constantly lose my place in lengthy episodes. I plan on using this app exclusively for my podcasts going forward so I may update this review after figuring it out but my initial impressions are not good.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR2x3VGNNcFZBTnluZmYtUU1LNnpxX2xVUHhSVjdSWTVLZHNfSHZZZE83MHJLdThoTzF6UzBtRUg4Ykw2T3V4clpfVVBhSzRxVnIyUGdUcEdj",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Every button in the app is labeled. In order to add a podcast you need to press on the main screen toolbar + button. Then you can select how you want to add the podcast: search engine,  RSS feed or browsing popular podcasts. You can listen to episodes in any order you want to.Pls send me an email in case you have any question(Settings/Feedback)\nThx",
            "date": "February 22, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jordan Brooker",
        "comment": "Finally found a podcast player that searches multiple engines and plays with ease. Haven't explored all features yet. Will be paying to non-ad version to support a great app.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSFE5OXB6UWVJTHJ3TzRLYktXS3dnTnNzNlRqMGNPQlIyM2w5WkxheFd1VWNONUJjRlB2WXFZVmRXZHhKUXphcjAyN0pET0RZTVZHUmVpVTVj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jason Rogers",
        "comment": "The app doesn't load and freezes on start up.  My podcast subscriptions art work doesn't load and seems to cause freezing.   This has been occurring for a month,  sent countless feedback to no avail.  Enjoyed the app for over a year,  have to move on because of the lack of support.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSEREbTN5NG9nWlpWWHBGWXoxakJVY2NabVp5dUxmX25JR1BiTlUwbkNIbmltZHl0TDNISGVzYXBRaFpQOG5sZVpDREhnaDd1NWliRVM0U0pn",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "EDIT: Please contact me first in case of an issue before rating the app so I can know about the problem, gather more detail and help you (Settings/Feedback)\nI'm sorry by I didn't find any email from you. Which feedback are you referring to?\nThanks",
            "date": "February 20, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Montey Nelson",
        "comment": "I've used this app for a few days now and like the player control real well. I also like the fact that I'm able to control the settings so that it does not automatically advance to the next one in a series. One thing that I cannot figure out (and it could be I'm not looking in the correct place) once I've moved on to a new series, the previous podcast still shows and if I'm not careful I can easily accidentally clicked on it instead.  I like some of the content that I have been able to search for and find. Thanks!",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR1NtTC0ydlhPRl82SU8zc0lEbDByLXU5TWNCdWM4TS1FUERJY05NMGQ2UzhCYllOOVRNZVhzRDlvVVE5WUJkRVhoQWJ2OFVIRlV6SnRGS3I4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Aaron Hantsche",
        "comment": "Coming from Apple's podcast app, I was looking for a user friendly podcast app. I tried stitcher for a while, bit became so frustrated that I went on the hunt. Podcast addict is the friendliest podcast app that I have found on Android, so far.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSFB3ZWRjS0xfano0OVFzM0tBOHlsYTZEWEdMVmlyVnJNS1FIWUdYNlVwbDY5SG9PZ0ktajU5WkNHUkhzMjZVMVp3eVlZQzlSU3BwRWxoVHM4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dalton Symington",
        "comment": "Best app on android for keeping up with your oldest brother, Justin McElroy, your middlest brother, Travis McElroy, and your little, baby brother Griffin McElroy. Oh and their dad Clint McElroy and the adventures of Magnus Burnsides, Merle Highchurch and Taako... Y'know? Taako the elf? No? That's fine... ... ... ... Anyway, the app is great. Download it. It does all the things and it's mpu mjlf ju't b qvaamf up vtf ju or any thing it's super simple and I'm probably too exausted to be writing this...",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR3RsLWRwcEotY1FOdjRhQTM1TW0tWjZ5d3BSV09Hd3JiazNIRmtXdFBZTjN4QnljMTFFLU1pQVhVU2xoNjdWaVRsNk84ZEdhUEcxOG1ZbzNZ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Bobby Evans",
        "comment": "I love the selection of podcasts this app offers, but it has had a few \"in my mind\" major bugs that have existed for months since I have used it (on 3 different phones). When listening to a podcast it will randomly skip backwards like 20 mins but the time stamp doesnt change so you cant really even rewind it. On the note of rewinding or selecting different times, you will select, say 24:45 and it will just put you 10-15 mins ahead of where you click. Very frustrating.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRkRZMHVrMEJOS1Z2dDFyUXBBeko1RFVuTFlxaV8tVnRTcnpSV1VtTThnNDBRTExVb3BuUjA3LXBoYjZfOGptMzdXVUNYdDhNNWZKMFJWcnNn",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Please contact me first in case of an issue before rating the app so I can know about it, gather more detail and help you (Settings/Feedback)\nThanks",
            "date": "March 1, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Michael Scott",
        "comment": "If you are about customizability in terms of your podcasts, this app is for you. It can be a little complicated but has way more features than you would expect.  I actually switched over to Castbox because of all the advertising/great reviews, but I hated that it lacked so many features that podcast addict has.  If you want something you don't have to fiddle with for a little then this isn't the app for you, but once you are used to it, I think it's the best free podcast app out there.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPR250dW5oZENBMWozbW9KWXNST08yYXMwMWwyejUtQkFlcTdVY0kzYjdxVWU4NjlwYVBpblFtR0M2SUc5enlENjdUWGhvZEZPUE5CMkswSFkw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Matt Raymond",
        "comment": "Pretty good, except that it doesn't download the podcast tags properly. Minor annoyance, but a pain when you are using the podcasts on another device (eg car headunit)",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSFZXaFlSUXM2WWNseHFVU3V2N1JtX05CZlplZXVieGV4cEItcGEyY3NaMGFFUThCM2ZNRWQzZFl3NFNfclJRc2lrSjZmeHJzT21ZdVFhSkZn",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "What do you mean by 'podcast tags'? The app gives you access to the full content of the RSS feeds you subscribed to. This means that you have access to the episode description, content, artwork, ... provided by the podcast owner.\nFeel free to contact me with more detail so I can help (Settings/feedback)\nThanks",
            "date": "February 19, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "C. B. Thomas",
        "comment": "The content is very good. The player on tge other hand is difficult to deal with. Trying to play consecutive episodes has yet to be achived. May need to shop around for another app.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRUZrcndDV0VkQzBYVnRmMzk2N2ZCZmp4UDZtMFB1RU9HdWpGallzaVlhU1dCWjFfUkpGaWhRdWU4bllCNDd6WmRTMTBZeXk0MHo0Nkx1OTJn",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "What do you mean by ''Trying to play consecutive episodes has yet to be achived\"? You can add any episode you want to the playlist and the app will play them in a row. You can also use the continuous playback mode if you don't want to manage a playlist so the app can create playback queue dynamically.Pls contact me so I can help (Settings/Feedback)",
            "date": "February 20, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "App overall is good and functions well  A good range of podcasts. Downside when finished with the app and have closed and it remains running in the background it puts more of a drain my phonbe than other apps",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRzZwODVMSFdhTHZHVGJlb1h1LTNnaDB1ZUh0NGRpbDF5WUh1RGJ3dU1kb0d1dWl0Uk90SV82TTE5cmZOVUpSdzQwdDAtRFhxcmd0QjRtczRz",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "The app background service doesn't use cpu/battery when idle.\nPlease contact me so I can gather more detail and help you (Settings/Feedback)\nThanks",
            "date": "March 2, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Joe Doe",
        "comment": "Really love this app, unfortunately doesn't sync with anything or offer a web version, so after years of using the paid version I unfortunately have to leave for a different app. Still, thanks for your amazing work!",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPSFp4NlBOWWV2TXBVZnJndjdzV3F4Z09EUGlzdGJrTkt1cmRPRzAzYkxiLU5rYng5MmNvSzFRZHQzTXlkOHFrdjFzNUhyUm93VWR0M0NKUkRr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Meghan Olree",
        "comment": "This app is great. I tried several others before this that were very buggy or didn't do what I wanted them to do. This one works and is very customizable.  Edit: after using it for a few months the bugs are showing. It shuts itself down or pauses itself. It no longer auto plays when I connect to Bluetooth despite being set to. The app seems to shut down when disconnecting from Bluetooth, vs. Pausing, so when I reconnect I have to re open the app. Also, how the heck do I listen to podcast is chronological order?! I'm sick of listening to them backwards and I've looked through EVERY setting and camt figure it out.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.bambuna.podcastaddict&reviewId=Z3A6QU9xcFRPRi1kclN3ZjZQVVJ4dHhEb1RoVWxZeS1hTDBBQVNydkxITzZ5RGgxSEJLX2dDaHJBRjhlN1BsVGVYNHFiOFRzNWk3VzlnY0Vyckd4eTVEU1l3",
        "reply": {
            "author": "Xavier Guillemane",
            "content": "Please contact me first in case you're experiencing issues so I can help you (Settings/Feedback)\nThanks",
            "date": "March 3, 2018"
        },
        "star": 3,
        "title": null
    }
]