[
    {
        "author": "Festijeo Ramadan",
        "comment": "better than textra IMO though wish they had minor cosmetic details. for example screen animations, emoji animation support (like mood and messenger) and the read/receive checks to be smaller. overall pretty by good.  edit: actually just noticed group messaging option to \"mute\" is NOT AVAILABLE. feel this is quite an oversight and might make me switch back soon",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRnIwRmhIMzlSYmp3Q1BoSlE3djI3UXBtS2tuUTNIRExJRXpDei1PUjhZWXQ2R3JIaG5kLWJUUWRfeTZucFZCSkwySGtMS1RZSGY2RGZZUEpj",
        "reply": {
            "author": "Delicious",
            "content": "Thanks and feedback noted Festijeo.",
            "date": "November 29, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Iahel Cathartes Aura",
        "comment": "Love Chomp!! Been using it a very long time now, on several devices. It is the only decent texting app out there! So feature-filled, and devs really design it according to actual user realities, no grandstanding, just honest excellent development. Many thanks, you are truly the greatest text app of all time!",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRW9UVXlVLWdGb1dhU0tQZWVxTGNRYnFNVDc2S0dzcHFLeDBJVkFrUFZKX0NIaVJ6VTZVV09mR1llM2IzeU8ya1ZQY0FES2Y5V3dtczBUU0s0",
        "reply": {
            "author": "Delicious",
            "content": "Thanks Linda!!",
            "date": "February 21, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Don Armstrong",
        "comment": "Chomp is hands down the best texting app I've used. Highly customizable and no annoying habits like the others. I really like not having to show the avatars (contact pictures).   If you don't like the ads buy the pro version. It's the last texting app you'll ever buy.   Chomp gives you a clean functioning interface. 👍  It's dark mode is awesome!  If I had to nic-pic to find something I don't like,  it would be it's full immersive mode behavior. It's not as seamless as other apps.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRjVEQmw1aUdjNmIwVTlkT0xkZE5Cd25nVFZRWUVCcFNYeEk4TUFpNkF6bjdESnQ0VVQ2Wlk3VkR4WEx3dEc1MTlXY3J6U3hUQU5TbTd1eWxz",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind review and 5 stars Don. Feedback appreciated as always.",
            "date": "January 4, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "John Ree",
        "comment": "I tried many messenger apps, and this one the easy to use and custumize. As I really am only using it as SMS app I haven't searched if it has any other features like video calling/group video calling, group messaging (saw MMS but haven't used it yet),  or other features some other messenger apps have. So if you want a easy to use messenger app that focus on texting and allows you to custumize with easy with all the gimmicks this the app for you. Even the ads unlike some apps don't get in the way.",
        "date": "November 22, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSGw0WkNTM0Y4TjZjU1k5WVV5WkpCb20zOVRXRGVIbmJyYTRwemtVVy1JTXJxT2JmVzZoNFU5WFdnbE5xdXA3VHRXSVQxdXdxRXhZTW1GdjNv",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind review John.",
            "date": "November 22, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Moazzam Ali3368",
        "comment": "I have used a dozen SMS apps. And found this is best app... for dual sim mobiles as well as single one.  It contains a lot of other options one can wish for.... best thing is that it is perfect ....no bugs... no issues.... Even adds are in a very sober style and don't irritate at all. I have changed many cell phones and after using built-in SMS app I have to switch to this app. Because it is very handy and no bugs at all.",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRTU3bWZQWVdvNnVjNWZ4Y1JUd2FQd1N1QnppQnhGU3RQdkpWcURkdEp0NGVtcEhRMEk0SkdfMkFpbU9VSU8zeFBlUDhsMkxocEVvTEd2TlMw",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the 5 stars Moazzam.",
            "date": "January 17, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Su Hu",
        "comment": "Fabulous Cell Text App. There are many options and choices which I love. Thought it was all pretty self explanatory as I went through the settings. The only thing that stumped me was the new message counter (or badge) not being a choice in settings for the home screen icon. Went to FAQ and found my solution....put the Chomp Widget on home screen. It will show the new message count. Love Chomp, works great!",
        "date": "November 6, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSElGNVNWUU5BNmFRc29NckdvT241c3VUaVB4b2RRUDQ1akRLUklWWFR5VHZGUnRZbTQ5b3lCSWQydzhic1dydmRSZWluX25JRE5zOVpBREV3",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind review Su Hu.",
            "date": "November 6, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "GREAT app!  But lacking 2 very basic and VERY much needed functions. 1) message count limits per conversation. This has been in the top 3 wish list items on the developer feedback page for at least 3 years. 2) The widget icon can no longer be added to the app drawer on the bottom of the screen so it remains visible across all home screen pages. Used to work, then didn't since Marshmallow. Ugh!",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRkM4ZGVFSE84TVo1VXd4ZjVzMEtkOGtHeVdlc05XNFNXemJaSXdqX094MTYyUUZNMmM0YUx6MUhvY1FVS25EVTdwRjNRRWp0R1JvSUFaa2Zn",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind feedback.",
            "date": "October 26, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sourav Maiti",
        "comment": "Using since long time. Premium version is worth buying. But now more features are needed. Competition is high. Other apps are also offering some cool features. Please add these features so no one can beat chomp. 1. SMS grouping (Personal, business etc.)  2. Animated Emoji 3. More customization : new bubbles, colorful send area etc. 4. Hyperlink preview",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSEZVWXVaVlY1bTFkSkR0bmUtOGhsdVBEczB6dnBCQlc5bms2dGtrZXRZUkF4b08tZV9JUXhscVlBTGxYb2pmd2txbGtMaldXQ25QNHdIZmpj",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the feedback Sourav and the 5 stars, much appreciated.",
            "date": "March 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Love all the different things you can do with this app, I like how u can chng notification sounds for different people. The changes they have made are great. I had an issue with my team not saving and they fixed It. They really listen to your needs. Thnks Chomps!  Do you have apps for themes and contact theme for LG Style Plus?",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=bGc6QU9xcFRPRUlOWDAySnVTMDhwdW9CVE9FUm5mTlVUeUc0dzZZR0JSZjBfNkI1ZDBQU2dkMk1CZ2hSclR4ZUE4WUpJb0UyT0l2M2JZRXBIRlVIV2Znd3RF",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the 5 stars, more themes being added weekly.",
            "date": "February 22, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "This is the best text message app I've ever used, EVER. Hands down. The customization options are insane enough to please a graphic designer, but still be helpful for newbies! Even other apps that have similar options don't perform as well. I know, I've tried almost all of them. I LOVE the custom theme feature with so many options! The developers are super nice, helpful, and give you what you ask for! I'll never use another text app. I've been using Chomp since my first smart phone, and it just keeps getting better without getting rid of the options I loved the most. I don't get worried when I see an update. These people care about your experience using Chomp, not treating you like a dollar sign, so they get major respect from me! #ChompForLife",
        "date": "December 7, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRnQ2dzlvbGRuSHE3Ym1YR3NTeFlCTU1wc2NDbFZHTjZYVU1DQmpoVnBrMV9tUHR1OXkxeXduU0luWXl5Zlh0aTVBNE5ST25rUDFUSmdBbDJV",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind review!",
            "date": "December 7, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mark Sullivan",
        "comment": "Handy app, but can't send or receive MMS with android 7 data saver on (support unable to help). The app works well, but is noticeably  slower to do everything than other apps. Also seems a little pricey just to remove ads. I suppose the ads aren't too intrusive...",
        "date": "November 19, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRU5yazFZVlo4dkN1b2dpRDl4RXBQeE9RcWtOQVBPS05fakRuTV9LSXFxUjEzZU5DWmlnanhTamlDX0VGV0JFTGpUNDVJRHNaMUpXS1FPLWpJ",
        "reply": {
            "author": "Delicious",
            "content": "Kindly email help@chompsms.com for assistance. Thanks Mark.",
            "date": "November 11, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Vash Sant",
        "comment": "Easy to use and very clean appearance. Didnt care much to have to pay for no ads but seems to be worth it. Would like to be able to color code message notification icons with various contacts though.  👍after upgrading to Marshmallow on my Note4, not all my texts work. Not sure if it's related or not. 🙁 update. Uninstalled as it seems to be causing my device to overheat.*update * works smoothly on my S8+",
        "date": "November 12, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRi1yejEyaUVvOWVxQzBWNlBNc3VZZVFvT1pPY0lyc196UE5jSWxjRFU5MzByT1NyeW9nYWdQVFE1T3hFd28wckJpTmZaVXR5b2hYUlU2eVRV",
        "reply": {
            "author": "Delicious",
            "content": "Kindly email help@chompsms.com for assistance Vash. Thanks.",
            "date": "July 13, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Courtney B",
        "comment": "This is one of the best, if not THE best developer supported app I have ever come across. If you have a problem, just state it here and Jason will reply with how to get help. He is quick with help and works to keep you happy. Hoping to see scheduled MMS soon! And the group messaging setting to actually work (have it set to NOT be in group messaging, but still does) because group messaging sucks! Jason, how do you use the gif if you don't have a compatible keyboard?",
        "date": "October 30, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPR0lXcVBDdllWbTBLSEJGaGk3bDZsSnZ3bkU4S0hOeUNzaWQ4SzJzOE9JTXJPS0FseWZqOWRBM1hvUHdVQV9HUHVsaTNHX0ZVN3h5T0lDTTAw",
        "reply": {
            "author": "Delicious",
            "content": "Sure, pls email help@chompsms.com Courtney. Thanks for the kind words and 5 star review Courtney! No current option Courtney. Thanks for the feedback though on adding GIF support via the + panel in chompSMS.",
            "date": "October 30, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Bryan R",
        "comment": "I have been using Chomp for years, I have tried other sms apps, see if anything is better, my humble opinion is there is not. It is customizable, but simple pretty simple to use, if that makes sense. This is the only one to stay up with the android OS changes , no crashing when new one comes out. I don't feel it is a memory hog or data hog like some other sms apps are. I am using s S8, works great.",
        "date": "December 13, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRjZDWW5xQnlpX1c3WDJTeXppbXpzSXNKZVROb0dlMkNRMGx2UGVJMVliTDMyVWo4WDlRWnVnaTQ2ejMzbE5GYWhoZWk0U2JWTk5icm0wODJv",
        "reply": {
            "author": "Delicious",
            "content": "Thanks Bryan, hope you can rate 5 stars soon.",
            "date": "December 13, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Paul Richards",
        "comment": "I have used this app across many phones for a few years never had any major issues highly configurable good theme system (imo).. only problem that ive had is that ive never been able to send pictures via text message however its not really a problem as I use whatsap for media. And I've NEVER seen an add.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRllCRW5vaklrbDF0TDhEOG5fZ1R4YV9oTVlHV0REelBLYzhKWnQwTzg1QjZ0RTduamY3c0FnTmRVc0tLcWQ3V0xVajZLbThKdkhjX0VXV3hv",
        "reply": {
            "author": "Delicious",
            "content": "Thanks Paul, sure we can help with your MMS issues if needed. Please email help@chompsms.com.",
            "date": "February 18, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Marcie Bouton",
        "comment": "There's only 2 things I'd like to see change, and I mentioned them years ago. First, is the ability to customize the notification icon for individual contacts. I don't like having to use the same icon for all contacts. And second, it would be nice to have a secure private message box like go-sms has always had. If these 2 things change, I'll gladly change my rating from a 4 to a 5.",
        "date": "November 10, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRWthQ0FKTmNFTzZ2NUc3ZVF3UU10NDJMRURsa25BVVdrLTdPLTJxd291ZGF5Z1d4VjhjT2IxMG50WGNGb2ExX0RaUktZcFR0T09xbDJEc0hR",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind feedback Marcie.",
            "date": "November 10, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "tam strong",
        "comment": "I absolutely love this and app, but since I've had the Galaxy S8 my MMS is not working properly anymore. For days at a time I can't receive any MMS messages, then one day I'm flooded with them. People are telling me they aren't receiving my messages all of a sudden. It's so frustrating. Is there a problem with Chomps and the new Galaxy?",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSHRUZTM3cDh0eE5McmxmV0lOVjFNeUNwMHMyQVN5OVlHVGEtRzJNSkx5alJnbUNHTXBhTDBYSlNSc0tIS3NBQ05aLV9KNEIwT3ZyaDJSOEZj",
        "reply": {
            "author": "Delicious",
            "content": "Please email help@chompsms.com for MMS assistance, thanks Tam.",
            "date": "February 21, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Peter Honeysett",
        "comment": "I've tried 100's of different messaging app, & nothing comes close to Chomp. RU sick of using default coloured messaging app. I use the colours of My People, the 'Indigenous Flag'(Black,Yellow &Red) to represent my culture. +many more worthy settings.&@ a very reasonable price...                     [-0-]                 2BLACK                  2PROUD                2DEADLY                   [-0-]                                      R.A.B.                    4eva",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRTVoVkRnMlJwRk8zZy1LSmxXb2VzWFhIak9lWkJJcXhJczhpQWh4ZEswajFJRUtnVzBRQ2ZlVzRhTnJHcEhTc1VxSHE5ZHZ6eXFFNDVqZXpZ",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind 5 stars PETER!",
            "date": "December 30, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ean Lindblom",
        "comment": "Group SMS works here! This was my main reason for getting the app, and it is worth holding onto for that reason alone. Also the color scheme is entirely customizable, which I enjoy. The menu for doing such customization could be streamlined, however.  Gripe: when in a message window, if you try to scroll up when a new message arrives, the window auto scrolls back to the bottom. This is frustrating, to say the least, haha.  All in all: great app, and I'm glad to have it!",
        "date": "November 28, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSFdudzNjSmcwRTFaTjBQLW1IbW1pX1FqQjNNQkFFd20wN0RnanFIYzNFLS1FM1Z3VUZaSmpYLURkdzFONFFKcHRGMlM3YnR2TmgzQmJVZlFV",
        "reply": {
            "author": "Delicious",
            "content": "Thanks Ean. Pls email help@chompsms.com for help, thanks again.",
            "date": "November 28, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Barbara Cummings",
        "comment": "FANTASTIC!!!  I love this app!! Thank you so much for making this happen!! I can't tell you how happy I am to finally have something to look forward to each day. I had another app that came with my phone. There were no colors, it was giving me problems every time I would try to send a message, with no response. Well when I found this app, I found a true blessing!! All of what I had been working hard to get was right in this app. The colors are so unique and vibrate. All of my messages are getting where they are suppose to get to. This app is fast and the best thing I like about it is, it actually does things for you before you do. I don't know how it even knows how to do that,but it does. It's remarkable and genius!! When I go to write, my spelling is really not all that good at times, so I depend on the box above my typing to get me through my words because without it, I would be lost. This app to me is a life saver. It gets hats off I tell ya. It's a really good app and so anyone that is looking for a classy and a class A ★★★★★ app should get this one, as far as I'm concerned it's the best app I've ever seen or used. Thanks again for making my life much easier and fun!   (+_+)",
        "date": "January 12, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPR2xmVFgwYlNXa210M1loT0xLRFFoblpwUEZxcGtXaWxsWnEtcUIwb3FuVUR3RkROQzBfSmtsbGt0Mk9IVkU0TUZfUDU3WUdzX1RyZVV0M2RZ",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind review and 5 stars Barbara, enjoy chompSMS.",
            "date": "January 12, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jordan Demesillo",
        "comment": "still no change to the horrible handling of group MMS, i cannot mute group, i cannot leave groups, i delete the thread only for it to pop back up when there is a new reply, and this forces me to uninstall because i am annoyed with a chat i do not want to be a part of. UPDATE: Long hold that conversation - Blacklist DOES NOT WORK",
        "date": "November 14, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRkU0U2lDMDFMd3VMNHNQMTBDbFRiSjJPYU9SazJ2OWpGcjRKelpVZHR4eEVlQWg0SHQzSDBuTE83cDFYSTUzd19jNjMxd3puTHRwcmJiaVFJ",
        "reply": {
            "author": "Delicious",
            "content": "For options to mute a group message, try our sister app Textra SMS. Thanks Jordan.",
            "date": "November 14, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "JokerVictorDelta",
        "comment": "This is an awesome, 5 star app. Unfortunately, I'm having trouble with sending & receiving images via text. They will show up in the chat, but when I press to view the images in detail, all I get is a blank screen. Hoping the devs see this and can help me, I couldn't find anything in their support site, or a support email. I love the app otherwise",
        "date": "October 31, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRWQ4RVRIeDVrbjhhNl9YMElxblhhcVBRNW9tYmlsS2Vzd2lEUC05dXJlUi1iTlV1dkhfaERsZ1c5V0EzWFAxWnRCZy1JcXZLekVNMmNVT1hv",
        "reply": {
            "author": "Delicious",
            "content": "Sure we can assist, please email help@chompsms.com thank you!",
            "date": "October 31, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Ronald Owens",
        "comment": "This is an extremely good text app. I have used Chomp now for about 8 to 10 years. I'm not sure exactly when I started using it, but this is the sixth phone I have downloaded it to. I have found that it works exactly as they stated. When I get a new phone the first thing I do is disabled the native text app and download chomp. Try it, you'll see what I mean.",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRzI3engxdVZYNThSdjkxZTZZYkFrV2tiUm1MWl9pdnJoTWtYeEQ5b0hmMVJ5cm44ZHo2dmphX1lmX0tkdU5GSXlHZ0M2YWtoWWdNeWRjSHBN",
        "reply": {
            "author": "Delicious",
            "content": "A very kind review Ronald. Thanks heaps for your update and 5 stars. Enjoy chompSMS.",
            "date": "January 9, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "My galaxy 8s active that I purchased from T mobel would only send group chat when sending group text no way to shut it off. But with this chomp sms app now I can send group text with out that annoying chat thank you",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSGtqOW9LM0ZidlN5X05ESFJaMTZUYUNqczJuTnlBQ1dEcDBpR0Z0T2JEWHdRSUdoOFFxOHh3Zm95M01YaUduSS1ZbHdHWFBLVDZMMWpSOEh3",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the 5 stars.",
            "date": "January 26, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ron Shumate",
        "comment": "Seems to work smoothly, delay delivery is very handy to allow people to get to work or wakeup but I already have text written and off my mind. Resend option is quick and easy. Also like two second delay before sending so I might notice auto-correct changes I didn't want.",
        "date": "November 9, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRzhzOG9vR013VHhGVkpNNkE0enh1R0ZyVi1VZWJYTXhlZktGYW9pSHdyMFBvX21vNHpjNU5EbEktMno1Qm1OUDdpSlZtaTc2dW9qVHA0d3Bj",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the updated 5 stars Ron, we really appreciate it!",
            "date": "November 9, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "glen ventanilla",
        "comment": "Good in customization of lay out. I enjoyed using the app. Though i have one concern but not a big one, when you send to multiple contacts in one SMS, e.g, to 8 contacts, the text bubble also appears 8 times in the thread. If you send to 5 contacts, the text bubble appears 5times too.   But overall, a great SMS app.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPR1Uxd3hoeHZ1TllYaGdmZkF2ZE52TFNUdmJ3VkFnelRvQ3FJUVFWeXdEVXA1WDAxUm5mNnBrbWNvXzhJM2wxQTFGZ1Fjd3Rkc0g4ZVVzRkVV",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind feedback Glen.",
            "date": "January 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Christian Steinruecken",
        "comment": "An excellent and beautifully designed messaging app with great customization options. The only design problem is that the \"compose message\" button has an incorrect shadow, i.e. not as suggested in the material design style guide or most other apps. Please fix it, it looks wrong in an otherwise flawless app.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRWZfQW1kQU4xT0VNcExrYTdxbGpBbnhOcURCYnFieWtCdE9VSWxlWWVFTnY3WTh1bm5wV0o2NXZ6RU9PY2RzQXpfRjNZbmRCZlBtTzNVZEk0",
        "reply": {
            "author": "Delicious",
            "content": "Pls email help@chompsms.com for help, thanks Christian.",
            "date": "January 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jaron Lee",
        "comment": "Want to use this app as my main messaging app, but I use a lot of MMS messages and it's annoying that stage fright slideshow shows up everytime someone replies in MMS even when there isn't a pic involved. Also would like to see the pop up quick reply in MMS.",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRkhIdEtDZ0llczFTcXVVTXNsd3g5VEtMX0V4SEJZSjRyY1dvUHdaMG1sTXZXQmRNa2lKX05WRUFza19Nb1VjTTgzUjd4cUtoWmZXSUNnbnNN",
        "reply": {
            "author": "Delicious",
            "content": "In chompSMS settings - MMS - Stagefright Protection = off. Thanks Jaron.",
            "date": "January 10, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jim Yau",
        "comment": "The app is a great replacement for stock SMS APP and has great dual Sim features. It remembers which Sim you used to reply to a contact number.   I am using this app for my LG G4 which has a terrible dual Sim feature for SMS.  Suggestions for future update is to add \"reply via same Sim\" as a default choice.",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSGc4c0NSaHFaMFRQTDdPWEZkTHByc3hVTTBLTXlOUEhfTTVXRWNpTXdLdE5NbU11d09YV1gxYlJucFNlQXdHajdiR1lBdVJYcW9FV29pT1BJ",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the updated 5 stars and feedback noted Jim.",
            "date": "December 11, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I've been using this app for quite awhile now. I had a sudden problem (probably caused by me) and I contacted Chomp support. Within two hours they helped me resolve the issue with back and forth emails. Excellent support!",
        "date": "December 22, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSEFyWDRfamNWWXFNRWZRMUlnVWhzcnFuNmQtcVp6WV83THJiQzBSNFlpdXBfZV96TklLRVNXanZDeU1Tei1wM2RkdGk4bTJCTEk0bEVPN1lJ",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind review and 5 stars, much appreciated.",
            "date": "December 22, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "TH8 Gate",
        "comment": "Default SMS on LG X Charge left lot to be desired.  Went to Textra… better, then went to Chomp SMS… better yet!  Love features, especially customization.  Only other feature I would like would be \"share to printer\" for dumping SMS message to my Epson wirelessly.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSFExc3ZXSnFlXzlNVkJURDFjSGJLd2VRYWhldGFCZHlQQXZ1Wkx3T0tKRzVXZkRveWo4cFNfOXFIdmwxUzNVV0VkNnlrMnVHLUtSOEdrekFz",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind 5 stars!",
            "date": "February 22, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Brant May",
        "comment": "Good Sms app, great if you want to have a custom theme to your phone. Only gripe is the trace texting seems a little off and doesn't predict your words that great, minor annoyance since I grabbed this for the customization.  Edit: my apologizes to the developer, Im using a third party keyboard and had forgotten since I customized is around the theme I'm using with chomps. Disregard my review on that. Chomps is great",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSHd2WHIyRFJHSU1wYjJZZWlLdm9RUXpoVUNlVVBXWDhMclpOM0tqbklUVTRNMDVUYTFaZEtqbTJlbTFqMmUzYy1iU1pUOUphSWc0VFV4ckxN",
        "reply": {
            "author": "Delicious",
            "content": "Thanks Brant. FYI, word prediction feature is provided by your keyboard instead of chompSMS. :)",
            "date": "January 6, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Been using Chomp for 5 years now!  Best messaging app available!  The only thing I wish they could change is to have a picture preview available for the new themes in the app store 👍",
        "date": "November 16, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=bGc6QU9xcFRPRjRzVk5WdnBRdHJBenBwbjc0QU93UW9VQ2lOZTh1ZmgxeC14WHVQQ2xHY0hldWxLakNQaFFFYVBCX3BTU1BLNGVIU3A5MVJsbkVUQlRTRVNV",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the 5 stars and feedback noted.",
            "date": "November 16, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Cheryl Tash",
        "comment": "The best text app I found so I stuck with it....  I've been using  Chomp's 4ever & have had no real issues.... When I did have a minor issue it was a quick fix & not the developers issue (they still gave me direction to get to the problem = good customer support)...  I also went pro years ago so no annoying ads for me... The customization options are off the charts with awesomeness & really easy to set up.... And I love all the different icons & there's an icon for every convo or situation.... The absolute best!!!",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPR2FhdXJIT3pnaDJYeWdtUnhhcFJldHVqbzg0WnROLUkzNGp2VjI1VGV1VnFZUW0tT3pfTG9NaWVHU0FEVUFvRzUyTGIxVXh5UEtDenJHUWVB",
        "reply": {
            "author": "Delicious",
            "content": "Thanks heaps for your kind review and 5 stars Cheryl. Enjoy chompSMS.",
            "date": "December 29, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Danielle Sutton",
        "comment": "Would love to see it integrated with the S6 edge+ notification edge. So that missed text show up on the edge screen.   I've downgraded my review only because the above suggestion was made 2 years ago and the response given made it seem like it was in the works. Although this app is great, it is still behind in functionality compared to other SMS apps. If I hadn't purchased the ad free version I would have removed the app.",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRS1lT1BjdTVEc0d0b1dsVkhkTHc5WTcwRWdYRXhyRjlYc1dFVW44akdnczlPVWI1ZGRES3ppVENVejFlektWbHhEbWFXQ0dQbENHaGhZWE9j",
        "reply": {
            "author": "Delicious",
            "content": "Appreciate the feedback & feature requests as always, rest assured, lots more coming to chompSMS.",
            "date": "December 8, 2015"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "mike smith",
        "comment": "I text regularly to friends with older style phones and this is the best app for assuring that they are able to see my messages.  Of the other text messaging apps that are easy to use this is the only one that shows the character count so you can see when a message is about to be broken up into multiple messages in for older phones.  Since I have started limiting my messages to the maximum number of characters older phones can handle I've had no problems getting my message through. If I depend on the carrier to automatically break up my long message for older phones it gets mucked up half the time. Thanks to the developer for keeping the character count feature in there. I find it really annoying that other text apps have removed that feature in the name of \"simplicity\".",
        "date": "November 4, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRjBCZlBCelp2N3V0TDRCT3FucHJ2RTdfSU1MX092UHdyVGFidEhtM0VlZWczUkVsX3YxVjJNSWdZTHhlS2F3QmhqeUxveExFVXJVZV90dTNJ",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the kind review and 5 stars Mike.",
            "date": "November 4, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Why should anyone have to pay to have a add free app? If it's about the \"people\" an making users happy, this isn't it. Regardless of the price to upgrade it still comes back to money an not the user's. Very disappointed, even more so with the generic response!",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPR1RMWk91M0RjYjRXeVo3V0NuMGkwTnM1YlRud19EZFROTHZMR3Rfa1V1bWdwVXdvZGVjTDhndFkyOGpvMzNnM2EwNGdFN1lETDk5eEI5dXI0",
        "reply": {
            "author": "Delicious",
            "content": "Thanks for the feedback, we appreciate it. FYI - chompSMS Pro is $2.49 USD and removes adverts for life, it's a one off payment. We hope you reconsider your low rating for chompSMS. Thanks again.",
            "date": "December 15, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Richard Brackett",
        "comment": "You guys are getting closer with the MMS issue. At least I don't have to try to pause a slideshow to view a picture as long as I want in the app. Now if there could be a setting where I can see each separate picture instead of a slideshow icon like I can in my stock app that would be great.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPSHFkZndqQWFvRDF1RDBIaTVkUThMQXhOMV8wd2Q1dnVzLW1lRnhLSk50VDV0bmRQdVZiUWFDak1FODJrdVREMVpQZlUtVWZuWnFSa1BrQ0lr",
        "reply": {
            "author": "Delicious",
            "content": "Noted Richard and thanks for the 5 stars!",
            "date": "January 20, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Genevieve de Lacaze",
        "comment": "I really liked this app, had given 4 stars. But I'm starting to get really annoyed with the app opening spam in my browser when I use it. I have to swiftly delete the page before it loads hoping nothing infects my phone and I don't look like a perv!!! WTH????",
        "date": "November 13, 2017",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRVZyM0VqTkxUN3k5YThSMEVDajNFSGM5aG1FLU9Wbi1qUmtsbXFJQU4yOVpSQTYxVTF0TGtHZW1zcHJBTkN4cUktdjBiWGtCYS1tOHdWb0R3",
        "reply": {
            "author": "Delicious",
            "content": "Kindly email help@chompsms.com as we're not aware of this, as is typically coming from another app. Thanks.",
            "date": "November 13, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Vicki Hendle",
        "comment": "Always loved Chomp, but I am noticing now that messages I get from iPhone users have symbols where emojis should be. Makes reading a text difficult. This problem is not in Textra so sadly will be switching back until its fixed",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.p1.chompsms&reviewId=Z3A6QU9xcFRPRUNYZ3FEdE5VczAxSXMwT1RMc2dxY3dVb3laWG13S1VTeTBhV082SlZLUGxhRzVOMXBHR1NhS3RNcVFrLVlkSzlNUDJ3WkhQVjNCVW00dVNN",
        "reply": {
            "author": "Delicious",
            "content": "Kindly email help@chompsms.com for assistance. Thanks Vicki.",
            "date": "February 3, 2018"
        },
        "star": 1,
        "title": null
    }
]