[
    {
        "author": "DaMario Mitchell",
        "comment": "I have noticed such a difference in two weeks. This app is the absolute best. I didn't notice that I wasn't drinking enough water before. There are alot of ads but you have an option to hide them for a small fee. (I'll deal with it...lol) I feel so much better, even my psoriasis has improved. Great app!",
        "date": "November 14, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRzlpb0M3RXQwcEtkVi00Yl9zM1VCcWhwN0FzeEtZTm1BaFRFeTVFaHRlNnJ1dWZhN2RIOU9CTmxmN3U4U3hUZEk3Zm1PQ0tHVnRuOWo5SkE",
        "reply": null,
        "star": 5,
        "title": "Awesome"
    },
    {
        "author": "Angela Myers",
        "comment": "This app was great for the longest time, but they must have updated it and it is full of bugs.  The app shuts down on me a lot when I am using wifi or data. When I am not using wifi or data my water data amounts flash like a strobe light and it takes forever to submit more water data after I touch the add button. PLEASE FIX THE BUGS!!!",
        "date": "July 22, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRzc1NFY1d09Ed3VhMm5EeVdSeENxb3FJaDNBOFJVR1cwUzFFMGRaNlNDVUpEQnVEQjhYSVNpTjFQVHRLdmVLVFhxcW4wcndMNV8wSzRPNWc",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Hi Angela! Thanks for your message. We are very sorry for the troubles. We currently working on a big update and a complete redesign of the system an will solve the problem within. We hope for your understanding and patience! Have a nice and top hydrated day!",
            "date": "July 22, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Tabatha Delp",
        "comment": "I love this app it's so super easy too use and makes me realize how much water I need and how much I was lacking.. I've drank so so much water since I started this app. Some days are hard cause with my height and weight they recommend 97oz a day but I'm getting much closer every day. I try so hard to achieve that goal it's got me back on my coffee,tea,and soda so YES I RECOMMEND THIS APP TO EVERYONE!",
        "date": "February 28, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPSFFpREMxb3NRdGotQWxnNkI1QjdKU1RBcDg4RzlHa004bUk4TkpWZ29QbHRzdDZDa3NrdTBlVG9rb2ExWnFadGRjUG5LdFlJVmVKVHRfTUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marina Cash",
        "comment": "I didn't know how this app was going to work out for me, but once I set it up a bit better and all I love it!!!! The reminders actually help to remind me to drink more water rather than me just ignoring them. I really do like it. Like any other app I wish there wasn't a pro option and I would like to be able to add my water through the notification without having to go pro. I work with children so I can't always sit and load up the app but all in all I really love it!!!!",
        "date": "November 29, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPSDlGWDVwNnlFeVdEZnp5TG45Z1J6LVgwWFlodUVORV9neUE2aUZqM2FOS0VYVFNqSVo1OGwtSzdoVExfbWxyQko2ZkNZRXdKRUR3M2lLcFE",
        "reply": null,
        "star": 4,
        "title": "Amazing and surprisingly helpful"
    },
    {
        "author": "Gregory Jackson",
        "comment": "Love it! It's been a great help with staying hydrated. As an aircraft mechanic I'm in the elements alot as well as on the go with changing shifts and schedules. With that being said I often forget to eat and most importantly, stay properly hydrated. With this app it helps me maintain a healthier lifestyle by keeping me mindful of how much or how little I'm getting in the way of daily water intake. I give this app 5++ stars.",
        "date": "November 2, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRmM5MmxpZkVxU3NRY3hvTG9hbV9jZEdNWXVUOC1FM185b1gwbDBtOHd3dHQ3UVJmM25VenNKX2lhbVp4TngyMGFJNExaSlVYM1d4cmw1U3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Shey May",
        "comment": "I appreciate the scheduling component. The ability to accommodate my schedule is very useful as I don't want to constantly be interacting with the app unless I'm tracking water. Additionally, it would be nice to have the ability to automatically set water mounts for certain days of the week when activities occur like workouts, cleanses, massage, or with certain meds when increased water is important. Possibly a manual option to increase by percentage in the daily diary. B+ bc the ads are over the top.",
        "date": "December 6, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRkhSSWY5OG00YmZPS2RUcWxUTEYzNDktTndNS05MaFlUWDNKMjhXOFJDZWVsTmc5ZjNpSUpTQm4wZkwtb0cxS0dDcnNMMkl2RXNKRDc3T1E",
        "reply": null,
        "star": 5,
        "title": "Can be personalized to your schedule!"
    },
    {
        "author": "",
        "comment": "Pretty nice. Has a widget so it's easy to see the status. Would be cool if you could customize the shape and color of the containers to make them match real life. The amount the app tells me to drink seems low. O_o Would be nice if I could mark which days I train/sauna and it would make me drink more on those days.",
        "date": "August 5, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRU80T1U3V3hHUW1aUU1IUjJxVEJxcDdxMXNWSXQ1cGRZR2NYbDdPU09odjV5eEpWYkgyQXc2dnYtN3dvZVZ4UWZqM0J0MVNxN1k1T3k1ZWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Adam Grace",
        "comment": "UPDATED: After uninstalling and reinstalling the app, twice, the ads finally disappeared.   With that issue sorted, the app is handy and well made. I would like to see custom water sizes to reflect non-metric measurements. I usually drink pints of water (560ml), which I cannot apply to glasses within the app, instead I must use bottles 1/2 full. It's a little issue but with all the customisation options, it seems odd to not have pints.   OLD REVIEW: Paid to remove ads. Ads were removed. Opened the app again later and the ads are back. I select remove ads and I'm asked to pay 99p again.",
        "date": "June 6, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRVU5Q2hQQkplRHBqZEEyaXItQU9CYWN3Nm1meVRVZFpab09yVXd3SlZqODlhSVlKYkhxUk5GU2VOZUh0eFNabU5GeWRoVTMzWjJSSVQ4cFE",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Hi Adam. Thanks for your message and sorry for our late reply. This shouldn't have happened. Please write us a  short mail and we will help you and of course we will refund your purchase. Looking forward to hear from you! Hydrated greetings!",
            "date": "June 6, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Rahul Jayakumar",
        "comment": "Allows you to keep track of your daily water requirements with ease.  I really like the function wjere you can choose the amount of water you drink in ml for every glass of H2O you drink aa it may vary. The only real downside is the ads but they arent long videos,  just popups. Small price to pay.",
        "date": "January 7, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRmoyUnVscUIyQ3doZE42ZVh3M1cwUW9fcm1CM0lHX0NIeVNKYVFMWEdSQ0t0WC05LTdlYTI4em5tYzlPQVBESV9la0lNRWZZQ01RaWd3SHc",
        "reply": null,
        "star": 4,
        "title": "Very nice app"
    },
    {
        "author": "Himanshu Jagtap",
        "comment": "*Update: Reduced the stars coz the app plays video ad after every log, very disappointing!  Almost perfect app. Easy tracking, well made notifications and water intake is adjusted as per the weather conditions 👍 I didn't give 5 stars because the basic widget to update water intake needs pro version!",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPR3lYMGlzekYwOG1qTy1WWDJucnUwU2p3RUtCTUpDMUNsRlQtWktTaVk3aDZjdjlPTk5GR2YtZmdfTW8weDVXV0lZdVRZQVlKejlmaVFRWWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Bree B",
        "comment": "I'm always wondering how much water I'm drinking. This is a great way to remind urself or just keep track. It allows u to create any amount, dif notifications & no ads. I thought that since it has the game symbol that u need Google Games to play, but that's not the case. It could be considered a game if it helps u, but water is a necessity. Drink up!",
        "date": "January 15, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRkRLSGdjRnZoWU9YUU11TjJFVy1Sb3ZUUnFfVGg0NE8yYzZER2NKUHVQb2tFUUVvSWx2VFhHS3lrOFBxQ256aWFKUmlqTkJCVWtwNTRhMWc",
        "reply": null,
        "star": 5,
        "title": "Very helpful!"
    },
    {
        "author": "willaim pishotta",
        "comment": "Within a few days I went from struggling to drink one 8 oz. glass of water a day to easily drinking more than 60 oz. a day. I think I finally understand how water is good for weight loss... drinking the right amount of water AND drinking it at the right time. This app is awesome!!!!!     Two things I would change: 1) I don't think other drinks  provide the same hydration as water so I do not think they should be displayed. 2) I wish there was a quick numeric option for logging (ex. type in 8.3 oz.)",
        "date": "November 7, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPR1RQd1ptUFJGX19BTTZwMC1uaU1STjdPYnhBWWVtQjFjYkZhZ0c5ZGhnQnFkQmh0VVRGdldRTVlKanRSWmtiZHJNMTh2bEZwTDM1ZXM4dkE",
        "reply": null,
        "star": 4,
        "title": "Wow!!!"
    },
    {
        "author": "Rebecca Lawrence-Higton",
        "comment": "Love this app! I never leave reviews but this app really has helped me remember to hydrate. Before I would go all day with drinking only 1 drink without realising . Now I'm starting to recognise when im thirsty and drink something.  I tried many different apps, this one I like. Thanks a bunch❤️",
        "date": "August 23, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRk9rOElKdURtT2tZdTNpYzhUMXdONlVKRDZ4NlJUbllEZmcxZk04NzZqdERmQlNzcVoxSVZaZng1cy05ZElSVTJqZnBDTktmZGhtdmFWNFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Susan Rostkowski",
        "comment": "Love the helpful water intake reminders and characters! Keeps me motivated at the right times to drink water. Feel healthier and not as dehydrated. Feel fuller so helps in weight loss. Flushes out toxins. Easy to use and connects to other apps I use. Very thankful for it! I now like plain water whereas before I needed to have it flavored.",
        "date": "September 16, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRXlvZ0loVHVMVzNBVnNROGRSdEprZ1BHX1BRb0diNk1QbWdfVThMbm5idjk4NzQyNWNHUU1HWkJ5UTJWbm5uOFFQUjl1Ri04VmlXUDYwNHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Nicola Lewis",
        "comment": "This app is amazing. I did not know how much was the proper amount of water in take until I started using this water app, omg hands down one of the best app for me. Before I start using  this water app I would probably have like one or two bottles of water for the day, now the water app having me drinking LOL  9 bottles of water and am speaking of 500 mL bottles. It is a blessing, I know that water is important but first time I would only drink water when am thirsty, but now I have a better understanding of how to drink water. I also noticed that I would go to the bathroom way more frequently now to do # 1 and 2, my skin is glowing more than ever and last but not least am losing weight. THANKS WATER APP! 😗",
        "date": "April 16, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRnhQM1VCVm9NejRGYnZqa3o3Z1JDS2NqZmxfcjJWRDJYajdwZ3p3TnZEdnN3ZTVjOE9xZzBmNkVRdF9VSlNwajR2QTI4TWJtVUJMZEc5b2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Elke K",
        "comment": "This is the best app that I have come across. It has motivated me from drinking 5 cups of water per day to easily consuming 10 cups per day in less than a few days. I know that this app may not be suitable for my following idea, but I now go to the toilet more frequently. Being able to track my urine could be an idea.",
        "date": "November 13, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPR1FKM2l6UW1HSVJFeEhwYjByMkg2RDNmNS15c2hsTWI5RHNzdFczOEpFSFJlOURuS0tCaUNqMXhGYVVwcEVXblh0Tl9xWHFKdmQ4cjIxMEE",
        "reply": null,
        "star": 5,
        "title": "Fantastic app"
    },
    {
        "author": "Jessica Fix",
        "comment": "I'm the type of person who otherwise won't drink unless it's offered, or set in front of me. I'd only drink 2-3 glasses per day. The reminders are needed. I've noticed an elevation in my mood, as well as some weight loss. I've also tried other apps for this, and they just aren't significantly easy or good-looking like this one.",
        "date": "December 18, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRzV5OTVhUER1RGctbW82NTFPVGhkQUVPQmVUS2J0ZXdtME5GNFlTakJLejlSRkx2LXBrampVaDlILVVuV01HekFLWkZJcGZITDgxT1ZUbWc",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Hi Jessica. That's really great to hear that you are happy with the app. Thanks for your review. Keep hydrated! Your Hydro Coach",
            "date": "November 5, 2015"
        },
        "star": 5,
        "title": "Fully hydrated, feeling AMAZING"
    },
    {
        "author": "Destiny Kat",
        "comment": "I like the aesthetics and customization of bottles, but It needs more options for how often to be reminded. I dont want to drink an entire bottle of water at once, id rather have notifications more often like 'hey, have you taken a sip of water lately?'  So i can drink throughout the day rather than drink a whole bottle 3 times a day.",
        "date": "June 6, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRkp0OTNNQVNCd0JVckg5Qy15cnVLUnU2dUREV2R2U3owenlQX1RkZ1MwRnNyQzdPTjFybmo5T3B5YldBWThWUGtwZlZ2OE54NW5oSEh5RHc",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Hi Destiny, you are absolutely right! If you like to get more often reminded you have to adapt your standard volume in the settings. Choose a smaller size and you will get notified when you have to refill your glass. If you need help we would love to hear from you, also by mail. Keep well hydrated and have a great day!",
            "date": "June 6, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I used to be pretty unmotivated with drinking water- barely consuming half a litre each day, but this app is simple and efficient, which is why I love it. It doesn't take long to input how much you drink, so I don't see it as a chore everytime I log in my water consumption. It makes drinking water fun and I feel amazing!",
        "date": "November 22, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRVAtekRxbTM4aThzSGI3UldaMjBFZmlCdnhkVUcwOERrdkFaa29xdnpRcmVPY0t0YnFKbDFyTGV1Qjh5c0dnUEJhZG15NFhLX0d4Q0J3TlE",
        "reply": null,
        "star": 5,
        "title": "THIS APP IS EVERYTHING"
    },
    {
        "author": "Mark Simms",
        "comment": "My wife told me about this app and I decided to give it a try, it's fantastic! It Calculated how much water I needed to have daily and now I am not only drinking my water but I'm drinking the amount good for my body and then some. I've told so many people about this app and the benefits. Great job Hydro Coach!",
        "date": "January 14, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRzcwbXNocXcycUFVM2xYZXZhUjgxVGQzbWNtSmY1Y2pZczJIZmdldVJjLUh0TU92SGllck9XR3BiR1Z4bHoweEFzLXU5UVpZelFlc01iR1E",
        "reply": null,
        "star": 5,
        "title": "Fantastic app!"
    },
    {
        "author": "Lewis Carroll",
        "comment": "I used to drink less that half a liter of water per day; in barely one day, I started drinking four times that amount and, somehow, I feel so much better now that I do! What did the trick were the constant reminders to drink water: I didn't just have to record the number how times I drank but the amounts, too, and I was reminded to drink when I wasn't drinking enough! This app is just awesome!",
        "date": "December 1, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPSHlEN1ZoNk52Uk9OWjI4ZlFIM3doR3NCalRBa3dpNHhTcVQ4ejJRVHhlUm9tMWRnbzRLWWdkY2JCcGtlM0VoRVk0TjdKcjNRaGh4ZTd6MHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Good app. Almost done with/chemo so I can get dehydrated. Waited from Windows phone to Android and found this little app. Still learning. Please know it helps. 😊. UPDATE ai guess app updated and now it wants me to check in through game app which I don't want to do and it just complicated things. Went from 5 star to 2 and this might be uninstalled.",
        "date": "February 17, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRU9vTnRiaTVObENiTFRvQVdoT2tpZFlFZUFmbGItNTR6UFlkWHFYckhoUzBUa3BwbmtFRjZfdUEyc29iSzN1ME9kencxV2luYnRsQ1JPNFE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ryan Schneider",
        "comment": "Like that it syncs with fitbit--and fast, but the lack of a smartwatch alarm is a deal breaker.  Didn't remind me via my LG watch to drink like a competitors app does.  Also, adding reminder times didn't work. And no option for coffee.Fix those things I'd pay for pro. Nice you can change reminder sound.",
        "date": "November 27, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPR0l3a1dmeDZmU2xScnYyU04tT2VFalZSV2lpa0NVT2FXZGFKYkhDQ1d5WjcwZzZQajR2YmlVMHdrZkVjTXdZRHdDeW9RekE0NnBCLVdyOUE",
        "reply": null,
        "star": 3,
        "title": "Needs smartwatch alert reminder"
    },
    {
        "author": "Charlotte Sarah",
        "comment": "This app seems like it's more for people who have the time to take health/fitness super seriously or have to monitor their fluid intake really accurately. I'm just a normal human who doesn't know what an ounce looks like. So if you're looking for an app that just says \"drink a cup of water now\", this isn't it.",
        "date": "October 1, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRU9uUGMwNDVVR0lxQzlLWG9GUkdZczdLLVRqSUQ5T1MwdEFoXzVfVGRQNVdHZ25lN29WaF84M1NaX3owVmhQcmROZGFJelpGMVNTaVpQemc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Hr Prk",
        "comment": "It is a fully functioning app, no complaints just one (the reason why I uninstalled and used a different app), it doesnt show how much water you have consumed. For me knowing so helps me input how many ml I drank from my bottle in case I forget (i use a 750 ml bottle -no glasses). Also it motivates. So I was disappointed when I didnt see the amount of ml consumed",
        "date": "February 13, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPR0ZFb3ljUVFnVmpfUEdJMHJvZllob2l4dnd5dnlKVFVQTTBIeTlKOEZNWGZMUjVIYUJpQUZQRWV2WWZ4WDJHSHc0UkVIeG9oUXVyRG1xaXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Joanne Lee",
        "comment": "It notifies me to drink water throughout the day. Not annoyingly but noticeable enough. I could not ever hardly hit my daily goal but with this app it's not hard at all. One less star because of ads... but I can bear with that as long as they're the ones that keep this app free.",
        "date": "December 9, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRy1TY3JHZWo0bzB5aXYzMGJOVEI4MExrTTJTaWoydVY4NlQ4TTdhVktaUlhZMWl2WkQ0ZGtVY3BSSXpGN1QtUGEwZjhYejlfQVc1YmNrSHc",
        "reply": null,
        "star": 4,
        "title": "Very helpful"
    },
    {
        "author": "Divina Siler",
        "comment": "I have downloaded new water tracking app after water tracking app. I have given up over and over. HOWEVER this APP is the best!! I can see a visual dial to see how much further I have throughout the day! Not just some random number that means nothing to me! I started doing this myself on paper but this app replaced my pen and paper!! And the reminders throughout the day actually work!!",
        "date": "June 13, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPSEkyV3dJS05IMzRVdVlwSGRzRFRKUkpkSnNidDYtUnp4ZGVLSDFCZ1RDYkRPVEJRQzFhNndBa3ZPMkFyOXBqZnFaRUF4enNBNTMwSlF5THc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Carla Abbott",
        "comment": "The gentle reminders and constant encouragement helps me a lot.  I love this app.  Have had it installed for 3 days and it reminded me to stay hydrated.  My skin is feeling wonderful.  Definitely worth installing.  The ads are annoying, but everybody's got to make a living...",
        "date": "January 6, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPR0NvUFNqQnJRcjB2eVFjT2JsS1NLLXdKRElXc1ZTTk5HcjE3QW01U2hKNkxBdXVvWEFSOElRQWlZRFQ0Y0dobEhPZHpVOW5Ec1htTDlEc3c",
        "reply": null,
        "star": 4,
        "title": "Super helpful"
    },
    {
        "author": "Ann",
        "comment": "I always knew that I wasn't drinking enough water but only after installing the application I realized how little  water I was actually drinking. The application uses simple and funny techniques that make you want to drink water. This app is funny and effective. 5 star from me as far as the application is concerned. However I like to suggest a paid version without ads",
        "date": "April 28, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRjZzZzhmY3JVNWJETEN0WXV1NUMtc0JCUjczTFVuVFpzaUpxVkFUZ0NSeXpPQUltV0RFUGNibDk3d1NySHh0bXZxclczQnZfVkcwMXo5NVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Allen Branch",
        "comment": "Overall pretty good. The reminders and information on why water is so good is motivating to me. The reason for 4 stars is that the syncing with fitbit is a little sketchy. It doesnt do it automatically which is weird.  I have to go into fitbit app and open the water section for the day, then it is pulled over. Maybe its fitbits issue.  Suggest in the future linking into myfitnesspal since its very popular app.",
        "date": "March 2, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPR1dwc09UYWtUdk5GOXE4eUdfeGNTbTZId3ludDNub1FqYTlwV08wbGlqSmU4Qmp3RVRoenNpQUtjUDFkdThTTndLTnZudUMxRW1vb1d3RVE",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Hi Allen, thanks a lot for your extensive feedback. We are happy to hear that you are basically satisfied with the app. We currently working on improvement for the connection to fitbit and hope to solve all issues within the next update. A connection to myfitnesspal is on our wishlist too. We are only waiting for an answer. Have a top hydrated day!",
            "date": "March 2, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Simple and easy to set up and use. Didn't realize how little water I actually drank through the day. This app prompts and reminds you to take on water at regular intervals. A good way to help you lose weight, flush out excess salt and keep your skin healthy. Its a win, win, win!",
        "date": "December 20, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRnp5MVRDQmZlZTFmVFV0S2xXekdROGZZaGxOQm9qaDR0c3NLaU8ya1lxbXY3VzUwbnpHUE9kZGVxR3Bza1BwZmxrM0FmYjYwWk1CdXZRZ1E",
        "reply": null,
        "star": 5,
        "title": "Great app!"
    },
    {
        "author": "Philip Banks",
        "comment": "This app is bomb and helps me keep track of my daily water intake. I've been using it for about 3 weeks now and ever since, I have not been tired during the day. I have been sleeping better other than the fact that I have to get up in the middle of the night to go WIZZZZ!!! It's great and I highly recommend it!!",
        "date": "January 15, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRk84Rk5Xa3AzN3RSUXNlNVFwVHpwYXpVSHU0Zkx1YlMxRVQya1lIQWtnVktXOThvMW1mNHZzTjY1WmtEelBqVC1wYUNPbE9zNzFfUFlydHc",
        "reply": null,
        "star": 5,
        "title": "Great H2O tracker!!!"
    },
    {
        "author": "Lee Powell",
        "comment": "The app is great, my only problem is that I work 12 hr rotating shifts on 4 different rotations.. You can only set the reminders for time frames with no overlap with days of the week (basically, if you have a time set for Mon, you can't have a different time frame that includes Mon)... I need multiple different time frames, some for weekdays, some for weeknights and some for weekend days and some for weekend nights, and some for off days... My schedule is crazy and this app doesn't accommodate for my schedule very well. (I hope this makes sense.) for instance, my alarm clock app offers multiple different time frames to set different alarms. This would be a nice addition.",
        "date": "July 9, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPSEszYnMtLXlEVWRYdFJNRGJ5R043QkZhZmhZTFpWRVRsM2xlZ05DaHdBZXl6TzkzSzBwRDZOaF9XLV8yZU5TRWVWUjBpbThMVXYydnRqclE",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Thanks a lot for your your suggestion Lee. We will discuss your idea in our team. We continuously improving the app and are really glad to hear about your ideas. Have a nice and top hydrated day!",
            "date": "July 18, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Gosia Hana",
        "comment": "I tried a lot of apps to help me track my water intake, this one won. It has a nice visual to help you see how much you drank as well as reminders to help you remember.  One think I would like for you to add is the option to add random amount of water, without creating a glass for it. Sometimes yoy get a bottle that is not regular size and you would just want to add just the amount from the bottle once, withouth making the whole glass thing",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPSEZINXhsZWNleDRLaWFJZTBqOFNRNTNMT21UWkpyeDgtNHJxYk5JMW83V0FMSU04N01fS2RsaE9DMVRVVlZwTngwWmZsTm80RV9hQWo4R0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kerri Whittaker",
        "comment": "No better way to detox yourself than with water! This app is easy to use and helps you set realistic targets for keeping up with your daily water intake. I feel better for it and this has definitely helped me with my weight loss ☺",
        "date": "January 11, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRUJpUzhwejJmbllxUF9ZRy10TlVyNjZ5bGtuXzgtNWFNcm1VNncxYkplMHI5MFpEYTZKSDhhYUJvZEotUzRZcW0tb3RKOGRYV1VIMV9fckE",
        "reply": null,
        "star": 4,
        "title": "Great App!"
    },
    {
        "author": "Michael Caldwell",
        "comment": "This app makes it very easy and convenient to keep up with how much fluid intake you've received. No excuse whatsoever to be dehydrated while using this app. Well, unless you're lost in the woods or the desert lol",
        "date": "November 22, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRmt6NzN5Tkd3OThkV1RZMkU0RkpQVHZXNFZMNEozc3A4bnNYUTlmbmRzNFFnaHVJWU1MQllmSXJrMHFwT0RlalJKSHFTSmpyZC0xWnBRYVE",
        "reply": null,
        "star": 4,
        "title": "Very good app and we'll put together"
    },
    {
        "author": "Happy Independent",
        "comment": "I wish there was a reminder i could set to remind me to drink more often then to just tell me im behind cus 16 oz in one sitting has me going to the bathroom too much. I work in an office. Remind me every hour to drink 4 oz instead of make up 16 4 hours later.",
        "date": "April 21, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRVJuazFsQ3R3bEVwY3hiczQwdDNlakdWUFNVS3ZvVENOMXF2Vkwxa0RxZFFwbXNZSFhkLThoM19TNmJLYTFNcXdnZnVfa2xaY2Zod3R2ZXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Renelsa Inniss",
        "comment": "Great app! It has definitely helped me to improve my water intake. Love the reminders and that I can set different  glass sizes. I think that the calculator may be incorrect though. It said I needed 2.4 litres daily but most other sites indicated 4l. I was able to override the calculation in the app and manually set my goal which was good.",
        "date": "May 2, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPSFJSUHBIUEZxQ3BoTlN0N2t2YXpxVEZrak9wOU5CdW5yR1JOc2E5MVFUVU1aVnpheFJxb3c0OEstT1AzdHJmYXM2RTl4c1o4Nkc3aGMycUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Devin Laviolette",
        "comment": "Great for keeping track, reminders are nice, info with the reminders are fun to read. The only thing I dislike, is with the way the ads work. I like ads, they keep things free, but they pop up when you are trying to hit buttons which results in clicking on the ad. I don't like that. 1 nitpicky things is the containers go from 8 to 20 to 40 oz. I sure you can adjust the 40 down but with most containers being 20 or 25, the pics look half empty. I would like a 30 Oz container to choose.",
        "date": "January 30, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPSElGVGdwcWxjYTBQb2lDUldyNHctM3ZqaHg0aklyNEFrdlNHZHJkeTU5UThBT0liME0zZTB3bGJkb3BiV25GWVVyMHRLTEhnbGltdWlDMEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "DachshundPower",
        "comment": "It's great. Incredibly easy to use, very helpful as it takes into account a lot of factors to suggest the required amount of daily water intake, it's got a fun interface as well. My only gripe with it is 2 different things to pay for, premium automatically changes the water intake based on local weather but removing ads is then another separate cost.",
        "date": "March 10, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach&reviewId=Z3A6QU9xcFRPRkREMmtUYk40aFR6NEhMbmxZeHlDajMwVk55cTFhaVhWX2JuRTBqTmFIVHg1aTlYd0d2WnJOUHlCTWxtYVQycTNoMjlydTFJckdHcHRkSmc",
        "reply": null,
        "star": 5,
        "title": null
    }
]