[
    {
        "author": "thomas beuligmann",
        "comment": "I'm kind of a keyboard geek, always looking for a better way. I've trialed Minuum at least three times,  but this latest iteration is psychic.  I've always used swipe style keyboards because I'm so sloppy at hitting keys. Imagine making beautiful music on the piano- using your fists.  That's Minuum.   It's creepy cool.  You just gotta be patient and realize it's just a QWERTY.  Try it for a week. It will blow your gourd. Do it just for the entertainment.",
        "date": "April 5, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRldMcnpRUkdTeEIyRGhUVkdFcXFJalU2My1XUldNRl9sQ1lMcl9IZmxnMWVsRUZIWE9MXzVUSVNYcTVNQXo0M1R4cXlab3RheWpNdVhwcTZN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "David Maz",
        "comment": "Took about a week to adjust but now I can't do without this keyboard. It really makes a ton of sense when you think about the idea behind it. It just removes the need for vertical tapping, and the predictions are astounding. It even guesses things like my crazy email address. Pro tip: use the clipboard for easy access to passwords.",
        "date": "May 8, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRmhnbnNpcUVoSlpPOURCMWhQZkNQWHd2Ulh3aU5kMWU5bUE0cElqNV9CMTY5eUo5VVRiWmJuSFA1dmt1WUdwYzFXVXg3cUVLWXhTZXV2NGY0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jake Thornton",
        "comment": "Let me just say: I love this app, I pay for it and I'm prepared to changr this review once this issue I'm about to describe is fixed.   Other users have made note of this problem. I have recently just changed phone to a galaxy note 8. The note 8 has software nav buttons at the bottom. After a while of short use, the spacebar and bottom of the keyboard becomes hidden under the navbar and the only solution is to use a different keyboard.   Please address this issue in the next update so I can keep enjoying this fantastic app. Thanks and excellent work.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPR3FuSXA1U3FrWW4yMGRzRkRkMkZob0IybjU4YXEzWnVDdE9URkJmWThzRHptU2VzaUZxVU9tN2VCMGZ5NDF2MzJUeFNwV0lqdVhMc0c0SlI0",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "reck1111",
        "comment": "It's OK. Not great. I never use the mini keyboard and I like to have a number row. I also don't like the sloppy typing feature.  When you try to type a password or a name or something like that it tries to autocorrect it into a word. And the word prediction is better on other keyboards. I probably wont download the paid version.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRTVjRGpqZzF0WHJpWXF0ZEsxMkF5a2hRaEdzdkJFRFd3N0F3d2FYak5LaXJyQ3l2TGs2clJETjI5aWY4WFhvSWVBY0RMcm9xMVhrRm56QmFR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "KIRAN V NAIR",
        "comment": "App is so heavy. Why does a keyboard app has to be this big??  I have tried Minuum several times before. App has improved very much. To save several taps the prediction engine has to be improved. Please concentrate on improving predictions, next word predictions and personalised suggestions. Then I will consider buying this app for sure. Don't forget to reduce the app size though. Good luck. 👍",
        "date": "July 24, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRjBJZ0w1QXB6RGtSM2xGUzdldzkxVGxrYzNaYUdHWkRCQVpiWjBSc1VNRjZhQnRJbUdUQUtGcVZvMzZWOEhkLXFTVW44bmZ3MTBLOUoxRVhr",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Aritra Chaudhuri",
        "comment": "Update: Facing issues on the Samsung Galaxy S8.. overlap with the bag bar.. my space bar and lower buttons are barely visible. Please fix asap.. can't do without my minuum  Love the way it knows what I'm typing..  Prediction accuracy has really increased and makes typing a cinch.  Needs further improvements to remove sluggishness",
        "date": "May 3, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPR0JVcnY5VlNBaEc3dmJsQXdMNnRwc3V5MFFNSVpVa1pVZjZXQWJPU1A0b09KZE9OUjNTVXBUS3QteGxFbGEyd3JXdWhoUnY1UVdBU1U2aEdN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Rob Bl",
        "comment": "I don't use Minuum's trademark feature (the one-row little keyboard), but I really like the full-sized keyboard. Being able to swipe keys to get secondary characters instead of holding down a key (which interrupts the typing flow) is a feature ALL keyboards should have. I just wish you could swipe up for capitals, and swipe down for the secondary characters. The other gesture features are great too. This isn't my primary 3rd-party keyboard, but it's growing on me and may take the #1 spot soon.",
        "date": "November 24, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRTFNT1NtRWNkbTQ3Zm1XNDBQMlY4LU5XOVFQaWVjU0sxWGQ3Tm1QbjBIS04yMlRaUUk3ek9WeW10dk0waWJDenlFcG03cXdWenVEb1Z5MzRj",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Aaron Gagnier",
        "comment": "One of the best and most unique keyboards I've ever used! Tried the free version for less than 5 minutes and immediately wanted to buy the full version. Typically I'm a sworn swipe typer, but the sacrifice of not having that option with this one (makes sense though due to the way the keyboard layout is heavily condensed) it's totally worth it! It's great having all the extra screen real estate back that gets wasted by some of the other keyboards that don't let you resize them too much. Can't wait to see what new features they can come up with.",
        "date": "June 18, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRS1HdEgyZU96enp1dzJubXRzTWd6OXRqUHVXTWFpc2hVWi13ZjN1V3Q3VDlvV2pCTHk1UVRTdDQ3UmllLXo3cmM3SW9KMkFkWnNKeHRxZTdN",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Brett Pierce",
        "comment": "Please fix the issue with keyboard being partially hidden by the navbar.  I sent a support email. I really like this keyboard! It takes some getting used to but when you do it's great! It made me switch from thumb keyboard. I bought the full version within two days!",
        "date": "June 17, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRzFaQXltMHByRjFSNGo1akg4MWxlMnFYVF9kck5PSllmN21JaHhVUmd3MEJ4MHU5cVdNU2Z4MlpvSXNWWGpaRllJbzhRMkcydXBkdGRZanJn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Alec Resha",
        "comment": "I love this keyboard, I only switch when my phone is bugging (dropped it,  bottom bit occasionally stops responding). Other than that I love the keyboard. It's very intuitive even with my crappy precision! My only complaint is that it doesn't have swipe while in full mode, but it certainly isn't a deal breaker.",
        "date": "May 29, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRjFMREN4REpTVWNCb0JRSmV0RWxYV2J5b3RhbGpKR3puekdiUVVmRnRYYzZzWjNnbFRoR2dZdE5MVFNKckxBQTJKNjI4RDBuMzIySHBPZV84",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Eric Diatta",
        "comment": "Hi Support  I use Minuum on a Lenovo Vibe K4 Note. My device is locked by McAfee Antivirus since I tried to change a sim card.  Since then I am unable to enter the correct security pin, enven though I changed it. It seems there is a mismatch between minuum keyboard input and McAfee.  Urgent support needed",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRlpIeVdaVUowWmRteXZORTRJZThHUjBEcjRsSFVTTFZodjhlR1UzRFN5OHF6bnZaT2VKOWo4QVRMMm9hazM5MFFIMVV2MzRlb2VjTi01Vm04",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Daniel Theriault",
        "comment": "Spacebar row is hidden under the navigation keys on my LG G6. Loved this on my old phone so hope it's fixed soon. EDIT: forcing 18:9 mode fixed the problem. Guess it's LG's fault for bad defaults.",
        "date": "June 20, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPSHozYlg2RG1fSHZ2Ni01Ui1DNzc4NG5HVDVpcGJ5MlRUS3AtYjF2bzd2YjA2UFJTN1pSSmp3TWtuTmZJVk9WUEo2dE5kQ1ptVEItNks2Z053",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Okay most of the time but seems to have a problem with prediction when writing emails.  Words predicted well in SMS completely misrepresented in emails.  Also does not predict English proper,  only US English so puts z in places where s should be.  Sent message to dev but no reply.",
        "date": "September 27, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRlQ1MnF6VGlqY1B1QVBlUFZqSjdGQ3dUSUp1NXRmVmdVcnU4dnRzNW9lUEYxQXM2dEN1TkdHWHRvRHFYeElxdnBxVHVldkdRNEN2SFEzVFpN",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Raymond Wald",
        "comment": "The AI at the core of this thing amazes me. It's so close to perfection. But the app crashes every 4 days. And it crashes when I tell it to import data for contacts. And it's a little bit slow on my shield tablet. But it's so so close to perfection. These nit picks don't keep it from being the best virtual keyboard I've ever used.  And they don't keep it from a very enthusiastic 5 star rating. Oh,  I typed this review at 30wpm according to the keyboard's tracking.",
        "date": "March 12, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPR2dwT2E0ckVyZVRHSW40cWpYLW5DYWlESFA1STZmX25KcnVsMTNKSmNOOG9fSmNEbzBMTzdOU0dxWXBsNksxVXM1RGctdW5ubzd2QldOeW9F",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Thiago Assunção",
        "comment": "It takes time to learn to use. This explains why people are rating it badly. However, once you get used to it, you just can't use your phone without it no longer. I'm happy to have made this investment. It was worth it.",
        "date": "September 14, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRzUyOGVvdVFmUU5KUzVuYm1KalBsSUc3MlhHbFRSUVU4eTg0M29ha2JHVnpjWk1DNTh1T2VhOUpvOWpIV25xMlZkcERuTVM0OC10a3g4U2lj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "D Campbell",
        "comment": "GREAT for sloppy typing, but so very annoying when trying to revise or correct. Also, should be able to figure out that \"cNdy\" is meant to be \"candy\" but I hit shift instead of \"a\". I hope it stops nagging me about a review now.",
        "date": "August 23, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRWk1M3o5bkJYVFlDU21QZjNWeVNhUDI0RmNocEtTVnRSVU9uV0QxLVBENndYV1ZpZF9seUpKUS1Xc1Y1Z3ZWMF9ud3cyb1NtNXZVNVpuMVdV",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kenny Lalrammuana Sailo",
        "comment": "Hey man this seems to only predict English, is there anyway you could include cloud where all our data gets saved, swift key does that and it really makes it easy. I'm sure you guys are already working on it. Once you get used it, it's hard to let go.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPR2xoalhDaGdrR0ZqVjVkT3k4V2d3V1ZiMEcxeTZKel9tUlJ1Ml92UlNiRFlfaWRPZFBWdUUtSGs2VFNLc2JSQXpoTjFHOUx6RjFlNnIxSlhV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lamslagen Kaktus",
        "comment": "Everything it promises to be and more! Takes a bit to get used to, but once you do, it's a great app! It's a great keyboard functionality wise, and it's especially great if you have big/small fingers- you can make it smaller or bigger, and it learns your typing style easily, making the recommendations and auto-correct functions useful, rather than annoying. Amazing app!",
        "date": "August 3, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRjhwbENrRlFrbFA4VDNrd1VNSWFsR2hqcm5nTVdxbGtPYkp5SGlIZ0xXSzAzbk9EWTlYVVFUUGczWEZrdlJYNU13YXRTWWw1YlEzcWYxZnBZ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jessica Leigh",
        "comment": "I found the compact mode intriguing. The aggressive predictive text was a bit annoying, but I felt like I could have learned to love it. But when it started predicting my Lastpass master password I decided to uninstall. Very alarming.",
        "date": "November 10, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRl96NFZONEplQVBzQlJyUE1oSE44dHd0U1gxeUREa1hzeTN6czZhcGd5TXp1dURhdzhPUkNYeWlfX0o3WU1Qd3NiS2l5OVRGd2hCZ1pqWS1r",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Matt Novak-Zarate",
        "comment": "A pretty solid keyboard. The predictive text is among the best I've ever come across, and the tiny keyboard design is really, truly tiny. Gestures make deleting and whatnot pretty easy, though they by necessity preclude any swipe-to-type style input. The smart punctuation is pretty on-point, allowing the predictive text to function as it should (treating the different words between dashes, say, as different words, instead of just giving up on them like other keyboards).    Now, why remove a star? Several reasons. 1) The theming is kinda weak. Namely the color selection. I want more than just pastels, ya know? This is my main gripe. I WANT A REAL ORANGE COLOR! 2) The lack of some features I've come to enjoy, like searching for gifs straight from the board. Fleksy kinda spoiled me there. This one's pretty minor.   Other than that? It's pretty fantastic. A truly great, and novel, keyboard, and well worth the slightly high asking price for pro. I don't see myself using something else for a while to come.",
        "date": "May 4, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPR2VrSWR6UDNRNEVtOVBxSW8td2FEQ1A1cWdldWZZRjBCNmlQcUlVYXIyRHppZTJ5YjNQZ3E3NlFyWm5xcEpITThtZzRuQk5PSlYyT2RqNlpV",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Darin Gemmer",
        "comment": "I've installed this multiple times and never been happy. I really want to like it, but it gets the simplest of words wrong, like swapping \"why\" for \"any\" and little junk like that. It's great for long words,but with shorter ones it doesn't have enough information to go on.",
        "date": "December 24, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPR3FLZ1BfWGxUT3RTbFJaeXZXTUpTVDRDSy05RXJVdzNMUDdWcVZWZk85eFhTaXBQS2dTeTd5YkJ5ZnVTc1drcExWbUdBVGc1TmtQZTIwM1BB",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Daniel Schmitz",
        "comment": "After having to learn to type using such a small keyboard for a week, it becomes an incredible time-saver. The emoji search is also pretty useful although it should work with languages other than English as well. My only real complaint is that there should be an option to choose the currency symbol displayed on the primary punctuation pane",
        "date": "February 18, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPR3pwcTZJVmljU3hLN3lPMGF2RzZWcW9lQURiU0F3QW9QeXlpNlNaY01TeGQ2RmRQM3ZsY0R5QlJKVnJMRzJ4VGtJZWRrTUloRUsydVZUbmxr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Hardeman Jérôme",
        "comment": "Was looking for a powerful keyboard , totally satisfied ! (far more powerful than swiftkey and flesky). That was at the beginning. Auto correct (sloppy mode ) corrects your stuff in other words even if your first word is in dictionnary. Happened all the time. Glad I didnt pay for this s***",
        "date": "October 10, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPSHo2RlFIYjJRS2w2NXRneGVXV3RETUVBSmxZME9TcU1DaFo1Y0F0bWtqQ1FLbkxiblZkLXprczdTc0JFeDhYX0oxSEZHcndlU1RZLW9zY2Nj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jonah Oxenhandler",
        "comment": "Came to this app after I got sick of TouchPal's increasingly invasive advertising. Took some getting used to but very fast now that I'm familiar with it. Happy to pay the 5 bucks to get a nice keyboard with no extra crap piled on.",
        "date": "February 20, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPSFFaaUNHVHVQZVVqb3dLS2NnSXlsbjYxcnZaN0h3OFNMRUE4ajNqN3NnZzhMV3lDQ2pZbDZhYWV1aFJ1MG9OVGpkZmNyOS1YUjdmSzl6OEVr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Caine H",
        "comment": "This keyboard was great for older devices. When I got my. Galaxy Note 8 I was super excited to use the keyboard....but it doesn't work with the Note 8 properly Its spacebar and bottom Line are covered by the software keys. So sad and would love to know a fix for this.",
        "date": "October 1, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRmtfcEU3S19XMV9zNkozOUo0T2hrSGQzUENsNW81Q1dpOGtpanl2SGFHOTVtSGVDcXBpcWpLYVdXTkpzRG1CVmJkckU0Z3Zvb1VYOGFleWw4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "ThisNameIsSoAwesomeItHasMuchWowSrsWOW Bob",
        "comment": "best keyboard app. it is extremely fast, learns and is the only intelligent keyboard that isn't monitoring you. so it is even good if care about your privacy and don't want others to analyse your chats and passwords",
        "date": "July 11, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPSE5GMmt1a3Vhc0Z0SDRBZm5DNjd2dWJhcER4ZXM1LVhzZjRhNXNOUW05MFQtT2ZyUERYVWN4bjBRekJYSWthT2Z5NUkxYVFSVDVSZXgxQTFV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jon Lytle",
        "comment": "I'd give it five stars but it keeps giving notifications to rate it even after paying for it.  So here's your review,  morons.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPSDdiS29tb2NrT1VxWUxoeGdOLUlNTGl1ZHotQllGT3VON1dSV2NSM2pldlVJSWJhQzVZWHI3bFdKbjlQWmI0cm5teVZtWkZSa3l1WFY0RjB3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Michael Flint, SR",
        "comment": "This is just as bad as when it started out! It works nothing like the video claims! Please make it work as it suppose to not take it off the market!!",
        "date": "May 23, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRUNYaHlfd1R4U3ZkdVNsQU11Y0xuMlBtSkd2X2o3VGRwRXlxNTZ3Tk9yUWMxZHR5cHVVVnlPN2NSWkNMdXJXVGh0emVTcWd2WlIxVzBaZklB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "John Scotter",
        "comment": "I have Parkinson's and was finding conventional keyboards I kept pressing the wrong lets. Now with Minuum I have no trouble as accurate key press is not so important.  It's a great app disabled or not.",
        "date": "March 12, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRkY1TXdJR2lLcE5yeFVBNi0wRUdUM0otYUdrdXBjWFpnSTZpWmNEOVRPMlJpczFMc0h1WEpWczJudV80VXpPTlh2U3FxNFJBRHl1MXhRSEZn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rachel Beinish",
        "comment": "Very unique with amazing word recognition and resizing capabilities. Sloppy typing button MUST be turned off for passwords. Thought about purchasing but seems abandoned, no update in over a year.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRWI1bUItUkNOSGdlcTFhSjFzMnZqUldhTnVEZWY1Ni1nd0F1YnMwZjFiT3RpRGJFRG42RzRUVC1xTHc3X3dvbEFIVWgwZWc2NkxoenVLdlVV",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Stephen Ramirez",
        "comment": "I've had this keyboard for 3 years and absolutely cherish and adore it but it doesn't seem like it's being supported / updated anymore (at time of writing, last update was July 2017). Unfortunately, I recently bought a new pixel 2 and this app keeps crashing and stalling, so I'm assuming it's got compatibility issues. I got my money's worth out of it and hope it's supported again in the future. Great product.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRVNkcll5ZGx0SzA4aERSOGEwQU9meHNxZ1dwMkVxN2pMazBSc0F3UldPQjB0WGNqaTBSdE8tclNzbDdvbjdjbS0zMHFtOTVYb0doXzBXLWxB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Günther Tuben",
        "comment": "It takes a moment to get used to, but it comes by almost naturally by the time you do. I've been using it for years now, and I still consider it to be my favorite keyboard.",
        "date": "March 14, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRmFBR0xIbHFxWUM5MUYtMHhfWTE2V1paYkdrZ2NFbm5TdExJbkJ0MndxMjRPMXlQbnFPeHpMQmhETzBvS1hlT0pzYXZTLTZLSEdxR2h2bVA0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Neil Verbeek",
        "comment": "Minuum is successfully dancing close to the most efficient use of phone real-estate. It works. It is, however, a prude. Curse words take significantly more attempts to be teached.",
        "date": "August 19, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRWpRY05PaVU0U3B1RU1uTGRkSHlRX0dFQ0JId2dOdXhTOXZ4U2EtenZ5YVJEWXJ6VFlvZTU1dEF6TUtrdWQyZ0NJLWZHQnFsV0p5U2hFSjRJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "John Dickinson",
        "comment": "Has some border issues with the s8. It goes under the navigation bar, making punctuation hard to use.. Otherwise great keyboard.",
        "date": "May 13, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRjJCQ29WUjRKaHlEdER5V1QyM0tBcWtWTEN2d25Cc2ZCRXEwTTZvelpLNkN4Mk5TcDVTMHFMMUF0TTZ1V3VKd2Z4WVUtYWZqSFNpd3NpLUxR",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Zolika Sabo",
        "comment": "For now SWIFTKEY is the best keyboard. When you gonna put Serbian language? This just good looking, but not helpful!!! No Serbian language! No five 👎⭐!",
        "date": "September 13, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPSEd6YV9hX2tPZEJvU19oSmtsZ2wtZjF1ZldHd25xdEpScnZHNWlzTlJaVzUtTjFwQlFwQ09oZ2lWUDJnR2ZLLUVmSDcwVnRqdjFQdE9pdVVz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Brennen Hicklin",
        "comment": "auto correct has stopped working and is changing the letters that I type. simple words are becoming hard to type (advice becomes ascle) and the predictive text has stopped recommending relevant words when I misspell things (like switching the i and e in receive won't show you the proper spelling even if it is just two letters off.",
        "date": "November 13, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRmdWZDMyTTdRWXA5RWs3Xzl5UEJsVm5WdWRMMkpDcmZaMk5rMVFlZ0MyX2RzWGh0MHRPcVh2b2l0Zm1ITktXT0h5MlpCWGxKbEdpMVNPclhJ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Enes Demirel",
        "comment": "It's great keyboard application. I'd love it. But I want to giving advice for being better of application. One, add all currency. For example your library have'nt Turkish lira sign (₺). You can add it. Two, add clipboard. This function are very useful. For example it can keep e-mail, password, important things.",
        "date": "June 27, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPSGoxX1d2RU56XzFfVWRUT3M5SmNWazlmWFFzeHcyNUpyNGRxa0N2UnBLV2VxcVEwWVdqa1lyRE5PQVFqMGhWQUwzSGdQRzUzcHVWVkRxeFhv",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Laura West",
        "comment": "TRIAL  In the midst of all the hype in the information section this little fact conveniently DOESN'T stand out. Conveniently for the devs maybe- but not for users! Please change the title to reflect this.",
        "date": "July 15, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRkdGY1lFcU1Ub2VsVm5neVFBOGpXVjgxby03M3huS1B4Uk5Lb28wNWJlS2hsVmVLeVBtbmk5MU1VWUVtcXZtYVFSYjEtanJGMjlnSmUzdWlN",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Andrew Horne",
        "comment": "The great thing about this keyboard is that it is soooo configurable.  You can shrink it down to the size you'd use with one finger on a phone, so typing is really fast, and, unlike every other keyboard I've tried, it then doesn't occupy the whole width of the screen. You can float it around and put it wherever you want, and as it's semi-transparent you can still see what's under it too.. And if you switch on the bonus panel you can set it to display arrow keys across the bottom of the keyboard. I find them really useful for adjusting the cursor position in very small fonts.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPRlRaN0FhOVIxSWNWMHN6cWV6MzFUbWNGSHBNMmE5ZnRVZzFJRkx2SzdnRVRlZEI0YjRtaXNBeVBrUm9ORVd0MXpwbUN2ZWRZZnhodlF4R2w0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "ebbmo",
        "comment": "The general idea is great, but adding custom words is super tedious. Smileys and special characters too, especially for me as a German writing in English and German at the same time. I'm yet to make a comparison with which keyboard I write faster...",
        "date": "May 23, 2017",
        "permlink": "/store/apps/details?id=com.whirlscape.minuumfree&reviewId=Z3A6QU9xcFRPR1dmTTRoYkcwM0xDTjU0clFDbFJqbVRmZW84U2Z1cks1UGVMZnJBeTRLZWZPRmE3XzZtVVBmN2tUVmFVVVJGOTF3WGlOemRnTmVLUklDUmhj",
        "reply": null,
        "star": 3,
        "title": null
    }
]