[
    {
        "author": "Hughnique Cawood",
        "comment": "A waste of money. I had to purchase the app twice to use it on android and iphone. The dog station keeps disconnecting after one min and can't then reconnect without someone clicking on dog station again. Unfortunately my dogs do not know how to useca smart device. Our Internet speed is fantastic. I wish I hadn't wasted my money.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSEJ4UTMyXzhFbFBuVEpoY19RaGdkd0hna2RUck5VMnhLdkIxenVna0N4YmpiSnROR0JNMU4wMEhmYllpenBOM0Y3M21qVTlISTZ4UnY5Z1E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Sorry for your troubles with our app. Could you please send us more information about the problem? It would help us a lot to know when it happens and if the app \"says\" something when it happens. If you could send us screenshots, that would be great. Please get back to us on helpme@tappytaps.com. If nothing helps, of course, we can offer you refund.",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Kylie Seabrook",
        "comment": "I have been at it for hours now and I am beyond frustrated.  I am absolutely stumped as to how to get it onto a second device without paying again.  I have set up Google Family as instructed however still cannot get this app on a second device.  Surely it shouldn't be so hard??  Sorry but not at all user friendly.",
        "date": "November 1, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRkU2bE5sQVRLa2lRbTM5eEdqNXFWZ1A3MDJQR3FjVzByWWJXbkd6YzRBdGpqYXZiRHZ5REJyaVRKdWlhcVZ1d0NDN3VwaXFHNXZ5MHdIQ2c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Kylie, we apologize for any inconveniences. What device are you trying to install the app to? Here is a guide on how to install the app on other Android devices through Google Play Family: https://support.google.com/googleplay/answer/7007852. Could you please write us at support@tappytaps.com what exactly happens? We'll help you!",
            "date": "November 6, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Alicia Giles",
        "comment": "I love this app! I can check on my dog at anytime, watch her, hear her, talk to her, take snapshots, and even listen to her surroundings! The log is pretty neat too! Having a list of her noisy and quiet times are really useful. It's an amazing alternative to the expensive monitoring devices out there. The only feature I wish it had would be a 2 way camera so she could see me too.   The downside, I had to purchase the app from both Google Play and the App Store. My phone is an Android, and I don't have another Android device so I had to use my Mac. And an FYI, this won't work in BlueStacks on Windows because of the cam and mic functionality, and has issues with other Android emulators as well.",
        "date": "November 30, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRWJKVWsyUm4zbDJ2c2dtc05Sclpwdm90cjFjWlFrTUNFTXlzYnFfYWJ0dzA2SXpZVTRxNFAtUTZyeEh2bURjdi1WaERWUUZwNXVKOVoxTGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you for your review and your input, Alicia. :) We'll have a look at that two-way camera feature.",
            "date": "December 5, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "wendy patterson",
        "comment": "My dog trainer suggested using a camera to deter counter surfing. I set it up in front of the food and with the preset command button I can yell at her without screaming into my phone in public. It works perfectly for what I needed.",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPR0c1cHFpUUVBQmJsam9NZzd2ZHV3ZlFQSVdITWhiMzlEZWo2cktweGRDRlRQb1BsNWpZbXdScDhpeE40Z1E3YWwwWExsNXFyOEhOMW9RcVE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Prefect. We're happy you like it. Thank you for your review, Wendy. :)",
            "date": "January 24, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Thea rose Hamilton Mcbeath",
        "comment": "Some connection issues but easily resolved by exiting the app and opening again. But this is exactly what I needed to help my anxiety leaving my dog inside while at work. .  Turns out she just sleeps all day haha",
        "date": "December 27, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSDdzRzZvYlRaSVVSeFU1eDJZNEdwREswVWd2Q25aWGtkUG5NdmZmY0hqNVdvNEI3empqU1NDa2FudUdvWTdaWlVBSFBieG5FcnFLOWFZaFE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Glad you and your dog are happy. :) If your connection problems persist though, don't hesitate to contact us at helpme@tappytaps.com and we'll you with that.",
            "date": "January 2, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "David Ramalho",
        "comment": "Very handy if you have older devices to use as the camera. It is a huge battery hog when you have it running in the background. Since my place is rather creaky, the app tends to pick up people in the building as dog noise which is annoying but understandable for such a simple app.",
        "date": "January 16, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRkNKMUhKdjNHTGdieDdNV09zekFkQktCcmZZZ1JRV2ZzV3hoRmxSc0djbWhLNVJ4aTdmNzFmeFprQks0Tk81YlljTzIzRGZuNy1JTHR6VWc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi David. Have you tried adjusting the sensitivity of the microphone? It might help to lower the settings. Thank you for your review.",
            "date": "January 18, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Heather Riley",
        "comment": "Love love love this app! It gives me so much peace of mind to be able to check on my little kitty while I'm at work, and she comes up to the camera if I talk to her - so cute! One thing I would recommend adding is two-way camera so that my kitty can see me while I talk to her. That would make it a lot easier to practise her tricks too since her cues all involve gestures",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRWREYlAtdmV2RXVQQXZYTXZ4RVNzNEcwR3hzTUk0LXNGcFd4MUhxOF9PMFdlMW9BSTIySEVDWWRsQmR5R2tPcktPc2F0LVFfTDFON1JQdUE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Heather. Thank you for your review and your input. We'll see what we can do. :)",
            "date": "February 12, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Frédérik Beaudry",
        "comment": "This app works as intended. Allows my girlfriend and I to watch our dogs via our tablet. One of our dog suffers from anxiety separation. He used to be in his crate all day and would hurt himself chewing the bars. We tried locking him in the bathroom and he ended up chewing the wall. Now both dogs are free in the house while we are at work and we can check up on them and correct them via pre-recorded commands. This is without a doubt the best 7$ I could have spent.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRURfQTh2WUsySGc2cV9VWGFvdXFITEJqVUpTWmRPbnhENEgzR0FPT3YwMVpKdThhNTlsbE1EQmVwZVFNWEplLU96cTY2UEFOVFlpb05RWlE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks. We are so happy to read these kind of reviews. Glad your dogs are doing well now.",
            "date": "February 15, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Dave Roberts",
        "comment": "I really wanted to like this app.  However it constantly disconnects Within moments of monitoring. The sound quality is horrible. the video is shaky at best. Lots of cool features but the connectivity is terrible.",
        "date": "December 9, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPR19OOVI5VXFUQlE2cFkwZGVPWlZLQmEyeXRrVjgzb2RDLU5XT3RLRjZ5NnNTUTZvSHpnOUxCekc2R0hWWUM2U1BHWlhVMG0yMTZyYUU2WFE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Dave. Really sorry for your troubles with our app. Could you please write us on helpme@tappytaps.com? I am sure we will be able to help you. We need to know when the problem occurs, what network you're using and which devices as well. Thank you.",
            "date": "December 11, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Christina Tobias",
        "comment": "Just downloaded this app and used it for the first time. It was wonderful and so easy to set up!! I loved seeing my boys and knowing that they were just fine and not barking when I'm gone. However, I would be awesome to have the ability to save the actual video footage. Would also be nice that to be able to watch from my computer rather than my phone. The app is on my galaxy and my computer is a mac. With some changes I would give is a full 5 star.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRVRvcmVnNFE1eTgtdTRZeGM5RWxvSWhTRzhxOFBTdUZsTXBIMXV5d3NlMi1rdzgwVFM4UjNrN0pGQkM3RTNtc2poRnF5QWJzeENlOWV4T0E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Christina. Both of these ideas are in our backlog so it should be implemented in the future. Thank you for your review. :)",
            "date": "January 8, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "CarolAnne Rogers",
        "comment": "This app has helped both my dog and myself haha! It's perfect and a great price! Rarely disconnects anymore! Typically reconnect when it does.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRnBFOXBKZmpLNGQxTHZnSWViVnJ1bjF4V1gtUFFQTjlMdXpkLVd0YjhqOXRTMkFDcVBVMTFOMmdCUi1IbjFxRHlaZS1UU09adDNzZFNqbmc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot. Glad you're happy with it. :)",
            "date": "February 19, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "rhylie young",
        "comment": "I cannot get it to connect with my other phone as I asks me to purchase it. If I you can help me get it to work that's great if not I'd like a refund  please",
        "date": "November 12, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPR0lwV1Z0UEFDWVZENTMxdlhNNzYyU2VQR0syZ0JnOUU3bTRhWUEyVDJ2UVRSbVQ1V1hyY2pQSlZPdzRfaWo2OEhiOS1aT1JCank3NEZDZHc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello. I am sure we will be able to help you. If you want to install it on another Android, this is the best option: https://support.google.com/googleplay/answer/7007852\nIf you have any struggles with it, write us on helpme@tappytaps.com. Thank you.",
            "date": "November 13, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Fantastic app!! My dog has separation anxiety and this allows me to monitor her and give her commands while I'm not home. Love it!!",
        "date": "January 15, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRlJaclgyVzJqbmVhX2ZqR3pCU0xKSXZWeHNvU2RmeWhjMUxwY0FWOHBjYmpqMU9henMzclBQaTdNOWRETDh6aEUwV3ljNXBMXzByZTUydnc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "We are so thrilled to read those comment. Hope your dog gets better. Thank you for your review. :)",
            "date": "January 16, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Steve Boatright",
        "comment": "Very useful app although sometimes it picks up noises I'm making not the dog! It has really helped me and.was well worth the £4.99  X2 !",
        "date": "December 15, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSHdpVXBrYUs4NjBOU0lMVVRhWDBwWVExR3JrNmtFM1R0TVR6S2VpR2x6VUhudl9PWG5LdkdocG95U2FwQTlZZml0WGJjWjhNS2VUZHRES0E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you very much for your review. :)",
            "date": "December 18, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Although the dog station camera is working fine when it streams to person station it is distorted and lines across, not viewable at all. Very frustrating when  i have since used free apps that work fine.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPR3JQRDJiQjhoMlFzdlBHRFdoR2l0MElXeHoxanN1T0hqQ2tkeWttdjV2RnhESkVmU1JCOF9XQTl5N0tqczZ5NVYtVWVadUtUbUk3REVpZXc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Sorry for your troubles with our app. Could you please send us screenshots so we can figure out what the problem is? Please get back to us on helpme@tappytaps.com and we'll do everything we can to help you.",
            "date": "March 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sina",
        "comment": "Truly amazing app, a useful addition I can think of is if the dog station logs activity the entire time so you can access it from the person station without having to have the monitor running the whole time, saving battery life or if you're busy and can't be monitoring at that moment but want to check back later. Works great between Android to iOS as well. Please please please add wide angle support for LG phones and others that support it. It would make it so much better on video to see the entire room at once with a wide angle camera. A Windows/web client would also he valueable but I cant complain with the platform support as it stands. A dedicated video button would also be nice since running a VPN or Adblocker seems to stop the ability to view video. Ideally a voice button, photo button, and video button rather than let the app decide. Thanks.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRS12OW1RdWdWQ3NzYkc2V0xEZldhWi1vTWMxaHhfbFRXdjd3eTFBSHBHWkFMOUhxelVjOUNlNmZNTndCbWZVX3psc0JISlNtNnhxRTJnbHc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Sina. Thank you for your review and all your inputs. :)",
            "date": "January 11, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Joanna Goodman",
        "comment": "When it works, it's brilliant. I do find the microphone a little sensitive but if you use the video feed you can see what's really going on and the image is fairly clear (and really clear on WiFi). We do not speak to our dog through  it as this would just upset him but it is great for checking in to make sure he is ok. It's a bit of a battery drain at the dog station end but then this may also be because I am using an old mobile for that end.  However, it is very unreliable and frequently loses connection, even if you are inside the house on the same WiFi connection for both stations. Earlier I had a great video feed of my dog, I decided to stop the feed to save battery, now it cannot find the dog station. When it does find the station, it tells me it cannot connect to it. This is very frustrating and makes me feel anxious that  I cannot check my dog as often as I would like to. For a £5 app, I expected better reliability.",
        "date": "December 19, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSDY0R2k5cl92bVpzN2xORVFEeFpXczJiOVI0VHVTcDVEeDl2Y0JYTlE2Ums4bWdXSXhvbGdrR1FfeE53dUdMd0hpeHZhMEstbWpvM2dBUGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Joanna. Thank you for your review and sorry for your troubles. I am sure this can be easily solved. Please write us on helpme@tappytaps.com and describe when the connection breaks and what devices you are using. I am sure we will be able to help you. Have a nice day",
            "date": "December 19, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Michele T",
        "comment": "Fantastic! Sets up in minutes ( but I did need to purchase the app on each device... Apparently there is a way around this but I couldn't figure it out) however it was well worth it and I can check on my dog from my phone any time through my I pad set up at home.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSFZ0V3FkdkxhXzdTMHFLUGNrY2hfVzJBQnZoTERqSmtQWFRCaVQwWGdkWHdjdWNuTXRfMzQwbFZmbEtza2oxc3FLV2h6SXFhMHI5dnJZU0E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Michele. The double payment is only necessary when using both Android and iOS platform. If both devices are Androids, then it can be installed within one price on several devices via Google Play Family Library. We are glad you like the app and thank you for your review.",
            "date": "February 12, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "julia .equestrian",
        "comment": "I was nervous about sending money but it was way worth it. I got it for mg guinea pigs since they are just now being in a cage alone all the time together. One of them wants to. Lain dominence and somtimes gets a little aggressive. This helps so much",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRjRTYldvUlBaeHRtV1pYSEdka0czWnRJWGlBN3BDcDRralFnenBTRjhudFpETTZxRVJBQzlpWHZ5bVYyVFB4Mkl0TVBfY2NKTUlnd1BlQUE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Guinea pigs ha? :) As long as it helps... Thank you for your review.",
            "date": "January 22, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I have been trying to get the two devices to link for over an hour now. I cant figure out what I am doing wrong. Sent an email to the support tech....I am hoping to get this figured out soon. I have galaxys4 and I am wanting to connect it to my laptop (Dell).",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSHpxcFhJRktmRmJodmJFUU9pQno4dDQ4Y25nN0hWb01FY2xsZXl1ZlAtZG96S3lDTWJoYUFFbkZQYmVGMzFwWGNzNmt6YXBMZHZUcVVNb0E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi. Sorry for your troubles with our app. Our support team has contacted you. With any other problems, don't hesitate to contact us again. Have a nice day.",
            "date": "February 19, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Anonymous",
        "comment": "I love this app I use it to keep an I on my cat when I'm at work! And it's so easy to set up, you can even turn on the flash. All at a small fraction of the cost of an actual pet monitor. Highly recommend",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSGFmTFdlNUJvYjJEVlhKMjFiTWpoanZhWUM2TGxZY3hhcGY5NllqVTZXc2xVSEc0RkhnX0RnVnRoalVjNDZrdi1fNVhlQ2ljMnVROWNhTHc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot for your review. :)",
            "date": "January 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Stephen Tarver",
        "comment": "It's a pretty good app. It's easy to use and does what I need it to. The only constant issue I have with it is, one second it will be bright enough to see and then a minute later, the picture gets really dark.",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRXhLVkpSU0NoVUhaSEI5NU5VZDJVT0hnTjFzeW5OQnM4WlgzeWotSnlxemY3dEZ1dDFZSkZCX2NPYm9BVWZ4cGFYWFhiZWs5LWdBX0FFZGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Stephen. We're glad you like the app. As for the issue, we cannot really tell what could be causing it. If you could sent us a video with this problem on helpme@tappytaps.com, we might be able to help you. Thank you.",
            "date": "January 11, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Carlos Henao",
        "comment": "Does what it says it does.  Go through all the settings, the app's alerts can become annoying but can be managed.",
        "date": "December 26, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSFpoVmt1WFhrS09Tcm83aEJRQkpYUmJSNDN2UmNQWHRwUkd4djljSDUyMWgyUkM4N2pKWlVuRkZjN2lNZkNtSGpxZVoyd0VCTi1DamVVb2c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you, Carlos!",
            "date": "January 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Shaun Gladdon",
        "comment": "Excellent app to see how your four legged friends are doing when you are at work. Just need to find a way to download the history of what it's recorded to my pc so I have it for future reference",
        "date": "November 15, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRTRBNWxTVEhCOVlBMzJOSzRfYVUyRnNQVHRzNEhRUG1HMG1IVThEeW9pWUFmOXhOdEpzS1R2cmNmd2hibG16eVVxSDJUeXVULXhveXRhNmc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Shaun. Yes, that is a valid suggestion that we have been thinking about for a while. We also agree it might be useful to look for behavior patterns in activity log. Thank you for your review and your input. :)",
            "date": "November 20, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Nikki Rees",
        "comment": "The app keeps disconnecting and adds keep popping up. How do i request a refund!!!",
        "date": "October 25, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSGJ2dVVnZTlvcVBZOWFkZTdObjNRcVZxZlBibzVzUUJSVV96dnhId2s2LWY1ZmwtMU5DTUJ1WFhxWnBQU3JJa2U4RGNvYVdhbmkxQzY1SUE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Nikki, we're sorry that you're experiencing these issues with our app. We don't have any ads in our app. Are both stations connected to a stable internet connection? Please write us at support@tappytaps.com, we will help you with the app and the refund.",
            "date": "October 27, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Chris Plevin",
        "comment": "Stays connected for a time but then loses connection can't reconnect from person station.  Have already turned off autolock on phone but that didn't address it.",
        "date": "November 9, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRUhIcmV0cUE4LWhRWmhRdE1scWRTU1dwMmNBQzBIYTY5bHdxZ2x2NXZ3T25EMzRBV1lnU0VnTFREUGd6UURGMDlSX0MtVHpMSDB1ME1JX3c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Chris, sorry you have troubles with our app. I am sure we'll be able to help you. Please, write us which devices you are using on helpme@tappytaps.com.",
            "date": "November 13, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "bojana chalakova",
        "comment": "Hello,guys. Did not know I can't connect to my laptop.Why is that? It can be only a tablet or a phone?",
        "date": "January 15, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRnpkWUxfUWRzVHhCSzNlMDB1TUJqRUY0OHdGdERmRk5vOThBU2xVb0w4WUFESzRTc2VtekpIRnRXYS01U2RET0RnTzJZRGFDSHZQMS1USGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Bojana. If your laptop has Windows, than unfortunately no. Among laptops, our app is only supported on Apple Mac.",
            "date": "January 18, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "simtysims",
        "comment": "Very good that both my partner and I can watch our baby while we are at work, just need to use Google family in order to let both of us use it at the same time",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSDNkV0JTMDhuQVNkSllQSDRORlNLbUR0bVFHMGNVX3JEa2pQaC1RRU0tT0R3Y2JPUGttbWxsc3RMZlBWVGZfTWRtZkN3N0VnSjZ3M0RjZ2c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you for your review. We're glad it works well for you. :)",
            "date": "February 8, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Chris Hoskinson",
        "comment": "It works but its slow and runs down my phone",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRWFxUHBSbnpnbGFKM2k4ZmNpMGlnS3pIZlNtQjhfTGhmbXUyWFBhVTVPTWZuQXprUk93dUtOVkxZU3VOOG9mU0RxQU0tTlVhNXlFQUZlN0E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Chris. Could you let us know on helpme@tappytaps.com what phone you use? Maybe we'll be able to help you. Thanks.",
            "date": "January 8, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sonja Martin",
        "comment": "I feel it's wrong that I have to pay twice for each phone using, I would like my money back,",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRnNpYnU5aXUxRGRPWGF1MXFfb0YtZk0xbC1IcmNPQUlINTByclZfWC1hNmVZS095bW1YTkh6eXlsY183V20xbjJ2LXdadTVKeFZPVlE5a2c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Sonja. As long as you use two Android devices, you only pay once using Family Library: https://support.google.com/googleplay/answer/7007852?hl=en\nIf you're still unhappy with the app though or just want one of the payments back, please contact us on helpme@tappytaps.com and we'll help you with that.",
            "date": "January 8, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Kylie Gstrein",
        "comment": "Such a great alternative to expensive pet monitors, just make sure you have good internet connection/wifi!",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSHI2NVlEX01Eejg4VG8wcHNGTW5KTjBVN0FvNFNWZG9pZHptdUdMaDJYbjQtSjBzeXpYX3djMDN5ZlYzVURFRnpITjJrdDRwSFZ3VFRjZVE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot for your review. :)",
            "date": "January 29, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Stefania Mesoraca",
        "comment": "Everything works brilliantly...amazing app! Wish I coul use my computer for the dog station. That would be a game changer.",
        "date": "December 28, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSFNFT1BEakcxbVV0akpuQVFZOEp0NjYtSkdKeDM4WUMzMHpCSnowSVVibVdsc2pqWEk1VzY1bXplLTRpNTlMWG5uaWtuQVpET3lYSDM5Zmc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Stefania. Hope to add \"the computer version\" in 2018, so you're fully satisfied with the app.",
            "date": "January 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Nicoleta Nuta",
        "comment": "The dog station is constantly disconnecting although the wifi connection is very good (you can not monitor your dog for the rest of the day) and the sound is not very clear.",
        "date": "October 12, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPR2dmR3Rkd3MyYW11X0V2dW1ZaHZsMVhLZGFjV3VYUGhabXgzOEt4dlUySHFRNGp0dE1jQ29WbkZLZ1NSQl9ZZmkwSnRhTkdOLTZ6b2NvbEE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Nicoleta. I am sorry you have troubles with our app. Could you please write us on helpme@tappytaps.com and specify which devices you're using and when it disconnects? Thanks.",
            "date": "October 16, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Michelle Morgan",
        "comment": "I love it but can't see the lightbulb icon to turn the light on when its dark.",
        "date": "December 9, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSG5tbTdkZVpaVlctMkVpSFlOX2xBUFpaZWJNNUtXWlRtVG85RUphOHlieXBVSHNPNjhfa1NYR3ZtdVRxSDU5N0FIRmxNb3JjTEpOVjkxb1E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi. This icon is only there when the video is running and it is the bottom left icon looking like a torch.",
            "date": "December 11, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Donna Wood",
        "comment": "I felt so much better being able to see my pet when i had to leave for the night. 👍👍",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPR2xTb1FiWkNSeVRBckpZbnhHVjhRdHJIajZjQTZhZFhtcXMweU5VSDJWSlZDMm9mMWRJckV2VkxtUXIxM2huUEVhanRzeThOVk93b0toTGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot for your review, Donna. Appreciated. :)",
            "date": "February 1, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sarah Kolberg",
        "comment": "Very helpful! Easy to install and  setup. Customizable and can watch her all day : )",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPSDZ1aW5KYlFGTEZuMDdDTFpMVEZFVlY2WEpBMHdOY21jcTIzN2I4ZXFudml3Y1NRVURONFlyUE4td0twQmlhUVpDOXVrTWs2RzFIM0EwOWc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot. :)",
            "date": "March 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Howard Sohm",
        "comment": "Seems to work as advertised. Very cool app",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPR19HUGY2VmQ1RVF4TGpzd1JiN3BndG85RG9wODNyVVlZYm0za0lyQXpPdHRNSHFvcUdvQkRiMDA3aGZ4aVlFbWZPR1BxdHpsWnptV05CVFE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you very much, Howard!",
            "date": "October 30, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "michael winston",
        "comment": "This is a great app! Gives me peace of mind when I'm away from my dog",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRmlGRUtMdFVCTFR0M29SRFplM013RHY5cU5jcUF0b0UtRGRxaElLMHp3UTAzVFg5U21UdDlGRnhQWHJHVGswMDdDLU9JRU1Qa0tRZTdZWnc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot for your review. :)",
            "date": "February 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Nick C.",
        "comment": "PLEASE add the capability to switch between front and rear camera from human station.",
        "date": "November 16, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPRVpTalZXRlp4eG42aWM0aExobExKeFg1eHM2Vnp1R1RBUVVNLVRrT3FlT0ZiZXdsdU9VWmVSeWJ2cm9DRHRJQ3dpbE8zRGJhc0tORlo3aFE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you for your review and for your input. We'll put our heads together.",
            "date": "November 20, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Odette Lours",
        "comment": "Great app! Would be nice to be able to download the log afterwards.",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.dogmonitor&reviewId=Z3A6QU9xcFRPR1BHMV9jN1JUcFBTOHJsQTRyNlpBUTlST0pfenUwMlBhNllQTWxBNXRoQ2k3bnFBMEExNWRTQ2VSMF9hanRsWk5taVRMWVdjb3h4MDZORnc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Odette and thank you. :) It is something we've been thinking about for some time. We'll see what we can do. :)",
            "date": "December 5, 2017"
        },
        "star": 5,
        "title": null
    }
]