[
    {
        "author": "Karthik Ark",
        "comment": "You guys need to write a better algorithm to allocate cabs in busy areas. Its taking a lot of time to get the details of the cab after we hit confirm.   And also, you should provide some compensation of any type  for the time we are made to wait before the driver cancels the ride. Some drivers are making us wait for 15 to 20 mins and then cancel out the ride stating no reason at all. And we have to go through the pain of booking another cab again.   It would be great if we are provided with an option to switch to another cab if another cab is available and is nearby.  Its a great app but we need it to be an awesome one.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRVdtU2RTR1Y1aHN4RElSeUdXRWNJVm00YXZROGhtTGRsTVloLXB5LTNEWGpQd3l3RW41VVVob2IxRDhlNVJUcDBsTG9Hc0dNbGU3OXVadzdz",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Hanz Ramos",
        "comment": "It was good about a month ago, but now, everytime I open the app, it doesn't show anything. I need to close it repeatedly and even restart my phone just to make the app work. And also, when booking multiple stops, its not working as well, it won't let me book. It doesn't show the last stop and it doesn't compute the total fair. It only shows the map and that's it. I already reinstalled it many times and still doesn't solve the problem. Already clear the cache and still nothing.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRWVKdUswVG1WU196ZUI1NGN0Wi1OX3FaUlNVMWkzRlRYZWZxZFdHbXZ6NTV3Y1A1V2pLUFhFQ1Z1VlJfbUJnRXh3cUc0cVR3UXVvYnhlOElz",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "maha Rajan",
        "comment": "Actually i was comfort with uber till yesterday but today i encounter an issue. That when i plan to visit my relative house i booked the cab and an amount showed, when reach the destination the amount almost dabbled. Its Sunday after noon no pick hour found. But they mention surge pricing, I think the amount showing is nothing but a business tactics. Immediately i tried to report this but no reporting system available.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSDVsdFRmS1hsZEQ5TWFDUGxmVERySlhlcFA2UkN0YjJsclFHWDFqSGdUWUxfSVRSclJ0NGpqLXVmVzZyNTJoU2poZFZCWDRqN3BQM2ZLb1hr",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi, the amount shown on the rider's device is the estimated amount calculated before the trip. After the ride has concluded, the amount shown on the driver's device is the actual amount to be paid. The fare can differ due to change in routes, traffic conditions or time taken. For further concerns or queries, write to us at t.uber.com/contact .",
            "date": "March 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "madhu sudan",
        "comment": "Service is great. But app is pathetic.. it gets hanged and was stranded in middle of the road just because there was some server error due to which I was unable to process old dues.. please try to work on your app because changing the appearance does not increase the performance of the app and your drivers are working too hard to be deserve such an experience",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSG5VcFRlN0Vja3RUV0pIZnNmOTFTNGoyZmxqZGlid2FoUFN0aFJtOWd1Nm11MU5QOW04NFF4bHhiM0ZtTGVPMDZQckEtZzB3TWNCRE5SbzlV",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Madhu, we're always looking to improve your experience with Uber and this certainly sounds like something we need to dive into. We request you to send out a description of this at t.uber.com/contact and we'll connect.",
            "date": "March 2, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Varun Lohia",
        "comment": "I am writing this because ur app is not working properly. The issue is, i forgot my password and then tried to reset but it is unsuccessful.Also, weird message are poping up which are programming error.  I am software developer and expect that i will follow instructions properly in resetting the same. Also, few weeks back i tried the same but all in vain and also put a mail in sorting this out but no response.  Thanks any how. ☺☺",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPR3pNOVpmanJfM3BKTFM3c1NOWHA0ZkF6LXlPTERXcmdhRDNmWS12X0hwNWI0WFJETGcxaHlJVXk3Z25vcHhyZE92UmRjWjVhS2tnMUVZYzdR",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Varun, this certainly sounds like a frustrating experience. Please visit http://ubr.to/2hjby2C for any password related issues. If the issue still persists, let us know by heading over to t.uber.com/contact and we'll connect.",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "süleyman gökdemir",
        "comment": "I've been using uber more than 2 years and I was satisfied! But now, I have been trying to add my cards which types  are visa, master, and amex and uber giving me error for 4 days. I texted uber support but they sent me that how I can add card to uber ridiculous! Can you believe that this?I was using same cards since when I signed up to uber! Now please cut the kidding me and resolve my problem. Thank you!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRVVaUVBCcFRiaV9DY1pxMTJwdGNMMkppV1dwWVMwbjVzMXdrY3J3WFdJQ2Y0NDg5aFdFTkVWeGZQMDNMemx4bjljS3cwNFFrcE12RExjbU84",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Brianna Allen",
        "comment": "I've had three extremely bad experiences with Uber in my short time using the app. It's the worst. It charges you even if your driver cancels on you. It also doesn't locate where you are so your Uber can pick you up from where you are exactly instead of having to walk to a spot you didn't pick yourself. I'm going to try Lyft and see if that's any better.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSGxrQjEzcC1LRWk3ZHFEMVo4NUlYM1RmLWVEcDJlYkoxQ2tyOUNoNC1vaXhRWmZBMGRXV1dEbjktZE9UNUhOVjBPQmhhYWhqQU12bG5UaEFj",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Brianna, we understand this can be frustrating and we are working towards making this better. We would appreciate it if you could send out a description of this with details at t.uber.com/contact and we will take it up from there.",
            "date": "March 3, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Priyanca Nayager",
        "comment": "Why isn't the uber app working?  It's not allowing me to get a driver from location!  I use uber regularly & today it's saying no drivers available. I thought it was my data but I had enough data.  I use uber all the time to get home from work..  It's saying no connection!..  Please can yourl get it sorted or is then any other way I can get an uber ASAP?",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRXBXdFVLM1NyX18wUnpHVnpIUFdKZlJYRW5wSTM3SmVQcGdYV2Y3Rlg4VDJKa1MwUXkydlVJemRDY0VReE1JYnJ1TG5DMjFUbTJPaXlCT3Y0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "F$%^& app has completely messed up my day. I've deleted and installed 3x's, still had to set up new profile still couldn't request ride.  Tried 5x's keeps saying internal error. Just downloaded Lyft, paying much more but at least app is working PROPERLY!!!!! Unbelievable how horrible this app has become all of a sudden",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSEJRUlJhS0ZwWFI3TVI4VHlnaGZnLVB0STR0Vk52Wk8xRVRodEp3ZjRaZ3pYaEU2WU1PbVFrd19odjZIZExocFRKcWl1MERPNV9FMERDbjFB",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "This doesn't sound right. We want to take a closer look into this for you. We would appreciate it if you could send out these details to t.uber.com/contact and we will take it up from there.",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "ASMR Rey",
        "comment": "With the new update it takes WAY too long to request a ride. Even making me late to work. And driver's 10 minutes away can accept your ride. This needs to be fixed. When I request a ride I expect someone to be there in 5 minutes like it was before. Also, some drivers will sit in one spot and wait for you to cancel so they get paid for doing nothing. No way to contest the fee they charge.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPR01fZ0p2NHZVbExnZ19XeEFnTkFiQTM3WjFNZEh1bGJINmpJNlB4bWVRU3ZzTGNtSEU5Y3VUQWsxdnpTUDVPRENUcWczcFltY083WGF0cUhB",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "We understand this can be frustrating and we are working towards making this better. We would appreciate it if you could send out a description of this with details at t.uber.com/contact and we will take it up from there.",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Rajnish Saini",
        "comment": "Poor / adamant Support. Don't even try to understand your payment. The driver took cash and now I'm being asked to pay again.   Even after paying again, the outstanding trip still shows. Guess something wrong with their payment system.   Won't use this app much.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRWRFUFBHYndocWNYMGlwNzk4S09IQ2kxdXBvTkhCTExDNkp1WklDdWhjT2IxSU91LThWYURPNVBvcGh2MHQ4WVVPd3UzV0tnSkxKdm5wUGFZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Baracudajones",
        "comment": "Map not updating on drivers location, and not being able to call them to cancel. Being charged £5 for this isnt very fair, and as it's my means to get to work, unreliable. If this continues to happen I will take my time elsewhere, but I do support the drivers, no complaints about them at all",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRzVxWm5qckthb2dnZjhUcWlCOUh2NVEtVHF2MmxXdFMyc2NVMkdUeU1QUFExVzRXVmh5UzRZLXowUFBVWkxtV19sQ1BMN2VLTUtOTkt2YjRV",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "We understand your concerns here. Looks like you may have been charged an incorrect cancellation fee. To know about the cancellation policy, please visit https://help.uber.com/h/eebc0564-5228-4d70-997c-0fe63f0753c2 . To look into a specific trip, send a quick note to t.uber.com/contact and we'll follow up with you.",
            "date": "March 4, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Arjun Manoj",
        "comment": "I used it in my old phone it was a very nice app. But now I have had changed my phone I am not able to login the account when I enter my mobile number it is asking the password . When you hit forgot password that is not at all working.  Please help me to retrieve my account back....",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPR3d4Ml9jTThVVVczbFN6V3NWVkNkR0JTWWRiLXNfUjBsOGtXTnNHMERTZTRleXFWYkFhZ1c2NjVtOWlyWF9ubXNZUjk1c0hvYjZVdFZTcUtv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ashith Shetty L",
        "comment": "Now a days it's going to be an very bad experience with Uber service. They'll charge toll gate charges in the bill but it the route travelled there is no toll gate even there is no toll gate near by. Uber Support team not able to establish toll gate detail in the route. It seems like money making policy.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRXU1R2VWZ3ZWeDRtQzRhV3N2UEhyREtGZ2RYQWg5UlB1UVJKZ0owTm52aVJkd2pXcGhPS1poY1ZodVFNdURZQVdTSkFacjBMNWhtbWw5Qmxr",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "We appreciate you reaching out to us with the feedback. You can reach out to us via the in-App HELP option or on help.uber.com as it allows us to collect more information so that we can resolve your issue quickly. If there's anything specific, let us know by heading to t.uber.com/contact and we'll follow up.",
            "date": "February 12, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Vidyanshu Vishal",
        "comment": "It was working fine untill last update. Now its crashing on every launch, I need to close the application and relaunch it.  Latest review: 2 March2018  Crashing crashing and crashing.  It crashes everytime I open this application,  i reinstalled it, cleared the data, logged out and logged in gain,  nothing is working.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPR0RDZUZadFVZdTY2QW9SR2Q5bUppbnNyTjI5X0JLOFRWRWZUMDcxTXAzSVdySWJDTk5CclFSRHhNRkdIZ3daZmNhdFJocWhGTUZnUmhXcjhJ",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Vishal, this certainly sounds frustrating. Let's make sure we follow up with you regarding this. Please send a quick note to t.uber.com/contact so we can connect.",
            "date": "March 3, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Don Shakey",
        "comment": "SHEIKA135UE = £10 off first ride.                                          I like it, theres always drivers about at anytime and have good looking cars too.  The app does still freeze now and again, and when sharing status of your journey, it freezes too, making it less accurate.  but otherwise still a very useful & must have app.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSG1QeldXY01GM20xSVN1Q1dZZDlwOW13YWU4YUp4cHpvcHJtOGpzZDYwU0pVTWN2OVMtS0FfSjluVnU3SFY1dlJHQ09mRGpxaWwwMzd3UU8w",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "What's wrong in registering a customer. Been trying to add a new mobile number and register. The app doesn't want to go further getting my number and OTP. Goes on in a never ending loop of doing the same thing. Seriously??",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSGNTdmV3OU9VekU0QTdYeXF0eFhKMkV1UjV2azNHX1ljVjM2WHdxb21UTHBnd2pXanIyYkV6dTl3ZzU4QTRRN09HZDl0N2lodjAydmNQTjVB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "S.Mukund Pillai",
        "comment": "Uber is worst, doesn't generate bill instantly after ride, drivers make you pay without bill and if you do it with a pure heart then uber doesn't refund the bill difference. And coustmer service is very bad. Every mail is answered by a different person.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRzF5dC1oSmlIMVU4VndLZGx4ZWNuc0FyMUdaaUlNMzNFNkh4RUsxYzMtcmxPV1NSVEtxSnNUcTdWX0dUN3hNcGJRSnhrWHhjWkRIQnV0WEdn",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Mukund, this doesn't sound right. We want to take a closer look into this for you. Please send a quick note to t.uber.com/contact so we can connect.",
            "date": "March 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Maqsood Khan",
        "comment": "The ETA time in rider and the driver's app is not the same.when the cab has arrived but in my app it shows in 2 minutes the cab is reaching.can u pls fix this problem. Its not very difficult for a multinational company.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRkpSTDRjYTZ0MW9mMEhNbUNldWtOeXhLZGRXV05BVnRYRmU2QXo4dnJ4THJTZG5XZlZaelZDQW9kX21GZUQxYkIzWFE4VklySEJrSm5vUFVz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Angela Colleen Payumo",
        "comment": "The app is ok, not always very accurate with PIN drop locations.  My main issue is not being able to adjust rating. Our driver was great but the one star was accidentally entered. Couldn't adjust it. There's not even a way to contact the app to explain.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRlg5ZTR3WTkzOEEzT0VRUjVsRXBPU1U4QWRpRkV2a19vNnJRYWgtTVg1cGJHRDlqWktWYkpRcnhEcHJKU20zM3dBblFRcFVjMlFZWXQ0dlRZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "geetha geetha",
        "comment": "Worst service ever!!! How can you people charge me a amount because the driver cancel the trip. Another worst part is the amount is not same like when we booked it. The amount is increasing when the driver follow the route on your map too. Totally unfair. Please get a better plan or idea to increase your income.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPR0xJeTY2ZGVsdGRyV29Zd2dBNEJRb1ZaZFFhb2dEcDBJdjBJck51dnJFQ0ZOeXhKY2p3Ynl3REdJY2V0R2FNb0x3eWtlM3YybEF1RXViRktn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "All these days I was using without any trouble now from recently it's taking lot of time to download the page where I should confirm my pick up location. This is really frustrating",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRWRaT1kxSUs2Ykh6eDJmWWl0Vy1GUmF0WGhjM0pjZUxRelRWZ1pkZm1fMkxVSDI3V2NMaWZzbmdQUkFVSW5qelExOXVteVdjUldlZnpoa1Nz",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Nilesh Shinde",
        "comment": "Driver didn't arrive at the location where was waiting and your APP kept telling me 1 min and arriving!!! Finally after a long wait I call up the driver and I get informed that he has cancelled the trip. Very BAD experience with Uber for the first time.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRzJ1NmxrQ0NINFRxdVpOVXhnVnptM2tFcE1qSG5wclNVdE82Tjg3N2V0UW9sRU8tYTZhMi1vWl9fSjg5WS1STm5BOHQxRFU1cmlZbXJzdms4",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "This certainly sounds like a frustrating experience, Nilesh. The feedback from our riders is vitally important to us, and we always want their expectations to be met. Let us know more about it by dropping the details at t.uber.com/contact and we'll follow up.",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Knapa pndai lari dia punya pin .. First cari driver ok.tpi bila dapat driver trus lari pin nya. D tuaran pula. Driver call ckp jauh sdngkn ak d tnjung aru ja. Ak gtaw salah and lari dari tmpt ak pin.. Dia ckp ada problem. Please fix the system.. Coz i truly love this apps",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRjUyNTNEdVlCM2dyaXMwcUJaYS1GYmlaMnpYZjNOV2VSZTBwVVVFMVFtSmFNUGVyb1VYRjRyajNkVFl0UFl6ZFp4SE5MQ0V0UzZlQ2V5cTQ4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Karishma Mahajan",
        "comment": "Deactivated my account without prior intimation and i have been mailing them for the activation process but i have not got any revert. Have directly said that it can't be activated. Suggest some help as i want to use my account. A bad support forum of Uber issues",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSGM4M1A4a0RWV0RFN1NTS0xaekNhTDRRSzZCTVpfQjRqZGljdGM4VlNoYVR5eGFpYzNPWGttOEhUZEFaTlhOZnhWMWh0U2ZWclVTa21HVDI0",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Karishma, this certainly sounds like a frustrating experience. We understand how difficult this may have been for you. Let's make sure we follow up with you regarding this issue. Please send out a description of this with details at t.uber.com/contact and we will take it up from there.",
            "date": "March 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Iliana Trifonova",
        "comment": "I don't know what happened to this app but the last week. I can't request a ride i can't see the map. Nothing. I wrote to Support team,still nothing uninstalled as well nothing. Does anyone else have similar problem?thanks",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRTNzbHhoMDNFZ3c4YzM0OENVQ2N3YWxOZ1pxZVRQNEVEZE9aN2JvcXFTYWZ2N1hKMEQyZGk3amNTYUZwTnFiVVNRZGtXSDZHUFowdlpaUXo0",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "This doesn't sound right. We want to take a closer look into this for you. Please send a quick note to t.uber.com/contact and we'll take it up from there.",
            "date": "March 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Jimmy L.",
        "comment": "At the time they didn't offer it so someone entered my email to sign up & eventually owed money so I had to create another email. Had they required two-step email verification then this wouldn't have happened. Weird part is I never received any emails from them prior to signing up. Explained my situation & got forwarded multiple times only for them to tell me there's nothing they can do. For a company that's worth so much, you'd think they'd be able to setup a two-step email verification system. I've contacted them two additional times yet they won't do anything.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSGlhTUN5b0MxcXA1anhmOGtXcFV6Q3lmOXNnSUxKYXlLam9qN1RZbWxKZ3BTSjQzUlRiOHdDV0JqUTM0clF2YjZyUHJwOUtiWFhuZTRSSzdz",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hey Jimmy, we're always looking to improve the Uber experience and this certainly sounds like something we need to dive into. We request you to send a quick note to t.uber.com/contact and we will take it up from there.",
            "date": "December 10, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Inka sarina melayu",
        "comment": "I order Uber X yesterday from Soekarno Hatta International Airport to my Home, in the app it showed me the price around 90k when i arrived at home the app was showed me not 90k, but 339k!! The driver is kind enough to told me when i just booked the Uber X, that the price that showed in the app just the estimated price, but... it should wrote estimate price (but there's no). And in the details of my trip in my email, it wrote the distance 89 kilometer, i was like.. whaaat??!! But from the airport to my home is like 29 kilometer and i pay the toll too.. I feel this so unfair, i like uber but yesterday was really bad experience, i feel decieved. what i like from yesterday is the driver (even that he's different person from the picture)",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRUVYUktrMmIxSnhVMFJCUjVYS3M1NmM0OWd3QzZycUJJOV9hMHA5M3BKZnFnWTdOM3JhRVBjY09ZSENhWVBaWk94NEt1eTBjNzE1RjBZNktB",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Arun Kumar",
        "comment": "Uber when can we get Android Oreo PIP mode. I believe this will be helpful for users. They could do some waiting with out getting bugged up as you are waiting for your Uber to arrive, Especially on a rainy day",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSHRGaVBtZ21qakFkYUV4ZnctdG5KYmo0Y09jWm5GUWNXdEtTWjBkdTRtZnFZaElfLWxEOTRNMFdIM3B3NERzV3cxMG5Xalh5WmRkdlhWUWgw",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Mohammed Abdul Rafay",
        "comment": "Isn't there any way to get Hyderabad Ride Pass sooner? The uncertainty to get Ride Pass is leaving me with no other option but to switch from Uber to any other service provider. I use cab daily and without a Ride Pass, it's not at all worth it.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSGlhSl9VNHgyMTZ4ekRxVXRHRkgzaFZsSEJ0d2dkSF9UMENmejRkdE5rYm0xWUJNVC1VdU4tQWdndUc2S1lXRUpELVJmdk1TX2xnZU5kU0J3",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Chris Jacobs",
        "comment": "It would be nice if I could cancel a ride within 5 minutes when I see the driver has accepted the fare but stops at a coffee shop on the way to pick me up.  Drivers like that are wasting my time and making me late for work.  I don't feel like I should have to pay them the convenience charge when they are inconveniencing me.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSDV5ajZjRXVwTVFLN3VmdU5aY2xNQ2REaHpsbkpLTk5PQldZNVdYcWc3TWE0VERQRjdiOHZrOXh4MGdKalV0TlpUdlZzZzZPZ1FoczlUTU1r",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Himanshu Bhutani",
        "comment": "There's no way in app to report a fraudulent driver. The driver never picked me up but started the ride. He wouldn't respond to my calls. I was charged for a 10 min drive which I never took. Couldn't find any way to report this in the app.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSHduNVNjQTBsNTUzYkVnZHVSeUczQWUyRkRkRS1UbThVWUdvVld1eDZUY09QWWsyMGNPX1F0SktzV2V5LS1KSVpJaE9SNXBQVF9ubUM0elR3",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Himanshu, let's make sure we follow up with you about this. Please send a quick note to t.uber.com/contact so we can take it up from there.",
            "date": "March 3, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Ritu Gautam",
        "comment": "unable to login..trying to go on forget password getting otp but its not allowing me to get into my account.. this is really sad.. i tried many times.. same thing..i am really not happy..",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSFM1NTcwT1FUNkZyckIteERKMGdhaWZLaVlyZk1STWF2ZUpGN25CS0dvZW1PVHFtN0sxQjdJWU5GelBqb3owNVE2MnJ0S0J5aFl6RGJreU5j",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Nikunj Kumar Singhal",
        "comment": "Really annoyed as many a times the drivers make us wait for a long time post booking and then cancel without informing. There is no intimation/notification from Uber as well that the ride got cancelled. Apart from that a good service to use.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPR1BxUjN0N1BqWUFBT29uT0Z4YUN4Zm1RVkZPM2d3SHFEbWsyM0owV0Z2Nm1LMkF3Wnh6aEtRNlB0aGRSRFNYYXBtalZ5Q2h3SlQzQnFOWlUw",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Nikunj, we understand this can be frustrating and we are working towards making this better. We would appreciate it if you could send out a description of this with details at t.uber.com/contact and we will take it up from there.",
            "date": "March 3, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Kailash Choudhary",
        "comment": "Uber is the worst car service app in India. They loot people. I have do a pool to a place  for Rs 60 but they charged Rs 124 and I forcibly have to give them since I was getting late. Later when I wrote them they have not given any proper reply.The attitude of uber drivers is not good nor their cars condition. I will never again ride from app. Try ola as Ola is best car service app in India.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSFJVQXc5a2pHc20yUlBZNUpBQlkxU1diNXI5bmZKX3VzRnBvNzJORVZQRndTTXdBamY3VU5yTnN0WHlmRkFsTkpkdVdpSndmUmdyd1RzU2JJ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "You are less than animals",
        "comment": "They stole $31 from me and refuse to issue a refund. My account is unable to use my uber gift balance for a $20 fare when I have $31 left. These people are terrible at customer service. Go Lyft  PS stop trying to save face with a clean up reply. If you idiots wanted to solve this you would have 4 months ago. You're customer service is completely worthless to the point of insult, and I've literally never hated a corporate entity as much as I despise you. Congratulations.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRlhLWHhyVFk1YVpmYzAtOXBnSzdSZzlJWWZuNktYd09aTG1kOVJKcUtnU0wyTFJveGkxY0dxWncxekt3QWxfU002RjBaamF6MjI4cGd5Y1Qw",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi, this certainly sounds like a frustrating experience. We want to take a closer look into this for you. Hence, please send a quick note to t.uber.com/contact so we can connect.",
            "date": "March 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Conley T",
        "comment": "After i have updated my uber app from version 4.198.1002 to 4.198.1004, when i request a car, it just stops there, the app just comes to a stand still and doesnt request a driver. please sort. out this problem for me.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSE43ZnMtNGluZWtyaWtOcnNXcTRRR3pvc09hRk92NHV2S1Rmdk5pa0lhQUIzMkxUbjFvanFGb2ZsYlpPYkJsRjlLSy0wa3A3QWdBdnR6R2dv",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Conley, this doesn't sound right. Let's connect. Please send a note to t.uber.com/contact so that we can follow up with you. Also, have you tried uninstalling and reinstalling the app, updating your device's operating system (OS)? Be sure to do this for the best usage of the Uber app.",
            "date": "March 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Anjan Roy",
        "comment": "Using this for long, but find today that screens are getting hung, when a payment method appearing by default is attempted to be changed for second time. Further, while trying to purchase Ride Pass, the app is saying 'something went wrong with payment method' ; although I have 3 cards listed as approved. Wonder whether Uber is going to remove bugs quickly.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPRlN3QTZnNWh3OVJOelBmeW04eWpLQ19kVEZYbVN3MzlfZVJqelp5eFU2TFh1TXQySDdwVlhFeW85Qk0yNkNUOVU3YjVUZ0Itc2N3NUNZS2Rj",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kavitha Nair",
        "comment": "Noted that the drivers insist on paying the toll charges in cash even though it's included in the bill. Also the app asks for payment for the same trip again....although the payment has been made. Proper instructions should be given to the drivers and the app needs to be updated.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPSHNQS3J3aDVhTkdxV1JqMVE0QzNjVmNmanpYRERlX3lTTHBSalY0MHhqMmJ6STVpRmtMbnN4M2ozR2Zwbl9DQUVhamxoLVVSd05QaUFFZ19N",
        "reply": {
            "author": "Uber Technologies, Inc.",
            "content": "Hi Kavitha, we're always looking to improve your experience with Uber and this certainly sounds like something we need to dive into. We request you to send out a description of this with details at t.uber.com/contact and we'll connect.",
            "date": "March 3, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Karryn E",
        "comment": "I had to give it one star.  It's a load of BS I tried for over 30mins trying to request a lift.  All it kept saying was something went wrong try again.  I'm standing in the outdoors trying to get a lift. Thought I'd give uber a go because everyone raves about how good it is.  Well the App sucks.  Won't let me book.  Fix it pleae",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.ubercab&reviewId=Z3A6QU9xcFRPR2pPUV9hRGxKWmdzVWliWER3cURKU1pabXdWbWxyaGdxUHowSlFBVmhPbUM4X244N1dPMlhZNWoxZ08tU1VOTWg5WU9SUmdiTXd0U3Utb1Jz",
        "reply": null,
        "star": 1,
        "title": null
    }
]