[
    {
        "author": "joejoe",
        "comment": "Have motorcycle with air shocks and air compressor. Would like to have designation in app for air shock pressure. I don't understand why app must have 'location' on to work. Why must a tpms app. need to know my location. Other than that, works as advertised. Battery lasted about one year. Im ok with that.   Please explain how i add the air shock ....as i bought the trike package to get the three sensors needed.",
        "date": "December 19, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPSFdhTjVSbzJteDJlbXNjODY2Rk94bHVWbmQtdWRYQnloSGgya3JhRTIweDVhRFIxWjFITUR2SVVvTm52R08xeEw2MTlvNFlpWDBPYjhOU2c",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, thanks for the feedback. We do have a bike with air shock profile in the app, at position number 5 when you create a profile. By the way, since Android 6, Android has lumped location service and Bluetooth service together. Rest assured, we are not tracking your whereabouts either in app or cloud.",
            "date": "December 19, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "dennis lane",
        "comment": "an app for my tires that collects data and requires a log in.is a drain on note 8 because always searching. i have messaged fobo on many forums with no reply.can't disable without redo tire pressure for winter use.app is ok but needs fix.i see replies on here from fobo and they are not helpful.",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPSEVmRjJ1b1o1My1VWGdVTVg4LXdWVk1qeXk3MzYxVmJwTWZSU3dzNzVZaTFxQVViaUVHWFM4NW9LcGZyNVJBS3ZrQUhMR0w0RXh1STFCMUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Tom Pasto",
        "comment": "Useless with Android 8 Moto Z2 Force. Waiting for future updates. Will not connect to the BT sensors.",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR1hFcW1SOHlxNm4wX1FvWXlzT2FiaDQxbzBSYkFlWU9pRzN2Z3Q2NWxsSklXQ0Y1Y2FPUDBrTVZKWW42UGVHTlY1azV3SHRxZDh1SzY0Ymc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kelvin Lim",
        "comment": "Cannot connect to my Samsung note 8.. followed the instructions but still cannot connect. Very frustrated",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRlIzMlZJSzVscWs1Y2tjZi0yaU9Jd3Rub21lWFhDNVVuRGxTR3dWdm1tNGE2OUhxRS1ZUkZZaFl3dGpjZjlESk5lM0NlckZCVDBCZ21udUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Hammering Howie",
        "comment": "The app seems to work as described for the year that I've owned the product the only problem is It appears the only way to turn off is by aibling the sensors then you must go through the whole process of enabling them again you can't just turn the app off on your phone of enabling them again you can't just turn the app off on your phone you must have the sensors with the phone and hold the boxes for 5 seconds. Since I don't like all year round I have a problem in the winter time with my phone constantly beeping when I'm in the garage it forces you to continually keep your tires up to specks even when you are not using the bike lol going through the whole setup process again is very annoying just to be able to disable it it should be an on and off switch on the phone app even though there is a disable pop-up on the phone app it continually pops up and does not completely disable it just quiet sit down for 1 few minutes",
        "date": "December 12, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRWMtZ0VhSmFiem1yTXRwbkpWU0NWSTFPZW4xLUhibnVKMEt2dE5Hc1RvVDFUcXVTaVRqQ0pXck1yX0FZWm5XVFRidk9wd01vREltTWhTb1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Terry Hull",
        "comment": "It sometimes loses connection to the sensors while I'm riding.  Otherwise I like the app.",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR2tlbkoteGpsTlpQcVhxRGNFWjhINnF1T0RiUV9nRC0yZldTQjY4TWs1dm0yWVhvd0pvNEdtMTR6QWZFSUw3WjBRYUhhUDAzU1lxNlZaSWc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, please write to fobo@salutica.com.my to further elaborate the above issue. We are here to help.",
            "date": "January 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Eyal Lior",
        "comment": "Login?",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR0VpVXVmZE1Cb1RocnhZNVlOWURMS2VuV3M0cUMzYXgwRDRtSHRZNlJiNnU4ODJaTkR0YUlSN2txdE9hSUxpbTYtSWFycTByWm5hLUNqTnc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, please key in your email address and you will receive an activation email. Kindly follow the link in the email to activate your account. After that, navigate back to the app and press the login button again. You are good to go. Enjoy using FOBO!",
            "date": "January 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Chris Stockard",
        "comment": "Great product. No problem installing once I figured out how the locks worked. The only thing I don't like is that there does not seem to be any way way to stop the app when you don't need it. It uses a measurable amount of battery power, and on those days when I am not riding I don't need it. The only way I've found to stop the app is to go into apps in settings and do a force stop. Kind of a pain.",
        "date": "November 25, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPSFptc2FDejNLQi1DLWpDakQtNHY4YmQtSS13S1B5cXdsb3lxQ01DbThRS0lCSVB0bkRvR2FXUGpYUjgyYmNsUHhkQnZZVENyNzJNSzdBZUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Brian Carter",
        "comment": "What a nightmare. After installing and reinstalling the app several times and after installing the units and reinstalling several times we finally figured out all the issues this thing has. After watching all the video's we found out your problem Phillip. Don't install the sensors until right before it wants you to sense them otherwise you get the unable to communicate.   After spending a good 20 minutes researching everything it's actually a pretty good product. We'll give it a better rating after a month of no problems. Best feature so far is the overlay.",
        "date": "August 27, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPSGtPMHZsV1doYWhUTzREcXAtQm9GTXA3S2U1X0V2ZndVbWdnQmFiRllmNXpKTENUMURiNnFFd0ZVSlZDUGNvV0Y2Qmx1bEZmeWNzX0NMNXc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback. Please write to fobo@salutica.com.my for further enquiries.",
            "date": "August 27, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "James Sweeny",
        "comment": "I give up. It's impossible to make this piece of $&!+ work. I've tried every ordering of installing the app, sensors, toggling Bluetooth and other radios, replacing batteries... Nothing. All I can get is the ludicrously unhelpful error message \"Operation was unsuccessful, Do you wish to carry on?\"  Even the logs are empty. There is nothing else I can do to troubleshoot this garbage besides reverse engineering the app.  DO NOT BUY THIS. Worst $100 I ever spent.  EDIT: After talking with their support, they ADMIT that they KNEW their product was defective on Android 8, despite advertising support for it. To get an updated firmware, they want me to send the original to Malaysia AT MY OWN COST.  I can't emphasize this enough, STAY AWAY from this garbage.",
        "date": "October 30, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPSGVldkVPWWNUazM4dEFsTEV6aWo3OGw0MnVmaUxNLWZNc2pGWWZPajR3d0l3QnBxc2ZSdW95cVpyZjQySHVBR3VEM3lmZFE4Skh3Y1RCbFE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi James,  we are going to have a re-flashing tool somewhere around November 2017 and it will be available for iOS only. You may either borrow an iPhone then or accept the replacement offer. As a one time good will, we will insert a prepaid envelope and what you need to do is just drop the existing FOBO Bike set in and ship back to us. Thank you.",
            "date": "October 30, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Phillip Montgomery",
        "comment": "Having real trouble with installing sensors. Intermittent connection at first, now both are 'undetectable' Really want this to work, but it just won't. Tried all the troubleshooting guides, but nothing works",
        "date": "August 20, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR19fRlk2bTY0SHZQRmlteDV3YkcwNVdQZDlnSG1RYXpjV2pWWEhaZ0c3blNqdzItRG9VTmRRWkk0VzE4MDFweG5xTExjalVBVGRwS1I5N2c",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback. Please write to fobo@salutica.com.my to further elaborate your issue. We are here to help.",
            "date": "August 20, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "ahmad bintalib",
        "comment": "i need help..the device cant seem to pair to my oppo or other android phone.. it reads \"operation unsuccessful, do you wish to carry on\". i have to use apple phone to pair before im able to use my android to check tyre pressure",
        "date": "November 7, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRXphTVZBRU9CTlY4bkNGUjUySXNzSXk5bmIwdWhaVmpHRnZGLXNLNXc4LTgwU0c0cWdudFBKOUw4WkJJVGZBRVFPUmNzWUJjRFRIN1dOamc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Henry Kong",
        "comment": "Works good. Can you please modify your logo and the graphics to match google's material design / minimalist theme? Please create a dark mode version. L rate up if you do.",
        "date": "September 21, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR05kdzRqb2FXWUpMVmNpZXVYakdqVDZIeHJmMDZoUk5jRnp1WGRFQ2dpaER0aGZDUjJ3b0NGWlJpczZGNWUzVHlad2pQWUxjamN6Mnd1QVE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback! We will take a look of your suggestions. We do have a auto night mode feature which can be enabled in the general settings. Enjoy using FOBO!",
            "date": "September 24, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jack Frost",
        "comment": "The need to use my gps is annoying GPS just eats up more my battery.",
        "date": "August 29, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRzVMUEVFZHRULVJSV2hVUlVfd3lEM0VJU0hfWkFESXJHRXpIdnpQU0JjQXRUQUY2S3JsRXdlNTczT215THp3RUxQZ01XVXBpcGtJSFM5OHc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback. Please take note, starting from Android 6.0, the app needs the location service in order to monitor the Bluetooth devices.",
            "date": "August 29, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Trace Myers",
        "comment": "Device and capability is great, the app and implementation sucks. My trading is continuing on its downward spiral because developers are not fixing issues with the app, only the hardware.  Must use gps which draws extra power. Developer says this is required to scan for Bluetooth device in Android 6 and above but FOBO tire does not require it. What am I missing?  App overlay comes on any time Bluetooth is turned on. No option to turn it off and you have to go start the FOBO Bike app in order to close it. Let the user decide if THEY want the app to come on with Bluetooth. Give an option within the overlay to minimize to notification bar or turn off service entirely.  Transmitters are updating every 15 seconds but app only displays update every minute. Allow a real time refresh mode so that we can see tire pressure updating while we put air in instead of adding air and waiting a minute to figure out where we are.  App only warns in single tone or catastrophic event. Add a way to audibly discern between an incremental overpressure that is usually the result of temperature change and a reduction in pressure that is not related to temperature. Your device is monitoring both, should be able to put a bit of logic into the app.  This is a motorcycle unit, we often are not able to look at the display, give us a read of the numbers. And don't re alarm every minute of the pressure is only changing in relation to temperatures.",
        "date": "November 6, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRVpJUUZQY0xEVjcyNkdiZkkxQTJObE0ybjVPa052Y3RydDdKZU9OVl9TNkpWZEJReDFSUEFpU2JHN1pGaXhEbDZma253QlN3UHFKN2xxREE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi Trace, thanks for your feedback. For Android 6 and above, we need location permission in order to scan for Bluetooth devices. The moment you shut off the service, the app is completely killed and not using any resources. Any further inquiries, please send your inquiries to fobo@salutica.com.my.",
            "date": "March 22, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Restored to 5 star after latest release.  Works great again with developer very responsive to user feedback.",
        "date": "August 7, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR2Z1LTR3eFNFSmJuVGNQNU1JSHk4V1lqdS1WWUdfU29uZExuZi1VNi1Pdjd2V01relVRVm0xRXdINXVvY1hyOThCaUVpU1pJajFoQW5FZ0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Lang",
        "comment": "The app works beautifully with the Fobo TPMS. But there are still room for improvements: 1) The overlay's NUMBERS could be bigger, as they are hard to see while riding motorcycle.  Or better yet, make them user-configurable.  2) The Fobo TPMS hardware is sending a new reading to the app every 15 seconds and the app only updates the NUMBERS on the screen once per  minute. It should be able to do better than that. I like to see updates more often than once per minute, as a lot of air can leak out in 1 minute before the app can notify me. Make the timestamp on screen something like hh:mm:ss so we know when it was updated.  Again, make it user-selectable.  Thank you.   Update July 14, 2017: I just updated from version 4.2.0R to 4.3.0 and I don't know what was changed in the app, I noticed the following differences: 1) When \"gauge pressure\" is turned ON, with the tire recommended pressure set in the profile to 42 psi front and rear, the app showed on the bottom \"FT:42.5psi  RT:42.5 psi\". Not sure why. When the gauge pressure was turned OFF, it showed \"FT:42 psi  RT: 42psi\". 2) The tire pressure readings on Fobo app in 4.3.0 is 0.6 psi higher than 4.2.0R.",
        "date": "July 14, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRXBYSVVXR2ZIbmFydFJKbzdpMmlJaFFsbFpQdWcyNDk4cFlYVFBTV2hBVkotSjFSUk5MNDN4cFBabkQxQkdJUzVsZmNqWGp0ZC0yZjR1SXc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback. Your suggestions are well noted. Enjoy using FOBO!",
            "date": "July 11, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Karthik B",
        "comment": "Brilliant",
        "date": "July 27, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRmZlOTdrUWtXdEkxbWlkVUE5ZktkcTN5WWlPNXNKOWlSdnR2QmJwd1l1WFd2eTZfaHk4TDBDZk16QzBhZXN3NVpFV0lhNVZlZFVWSTVsVHc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback. Enjoy using FOBO!",
            "date": "July 27, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "johnny boyle",
        "comment": "I was a bit nervous buying another bluetooth product. In my previous experience they don't connect easily, consume battery, need resyncing. Not fobo bike. I've had nothing but a great experience with this app & tpms devices - connects easily & gives quick, accurate information. Thanks",
        "date": "May 8, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRWhFWlVfSzdDeG5uN0xLTEtxSG5qR2NZQURWa3Y2azJZZVpLLWlnbHp6YW94Zk92NEFNQmh1VE1pUDhfVTVMU1pycjBqVUZYQ2w0VXBIUnc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback. Enjoy using FOBO!",
            "date": "May 8, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Karan Chugh",
        "comment": "Unable to access it...keeps taking me to the permissions page for access to draw over other apps. I have given that permission, re installed but nothing works. Was working perfect last month",
        "date": "July 4, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR2dVMXBySnl3SVdQSHc0WHFlQklIQmk4dVBKT1dhNXlnX0xxamVsbDM4QVEzdGEwelRZUHhxdGc1U2NvVnNpTkZQdjZETXBGZXNEMENQOUE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, please write to fobo@salutica.com.my. We are here to help.",
            "date": "July 4, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Erik Groen",
        "comment": "The app recently alarmed me of a low tire pressure on the bike before even starting it. I decided not to use the bike that day. A couple of days later after inspection I discovered a big nail in the tire. This saved me an inconvenient or even unsafe moment along the route. Well done Fobobike!",
        "date": "April 22, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRTVyU2tpZEJkRmk5akZ0VmQ0YndOUWwwVGlQbFRsYk1WRHRwMGphRUpKbC1ISVNQQ2VEYldEMFdMb3ZYZjdDTEsza25uYWVrcmdxQU5LSWc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Glad to know that FOBO Bike helps!",
            "date": "April 24, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Phil Pace",
        "comment": "Product is awesome - best solution I could find out there. App is bad. It eats my memory (~100MB in constant use) so if I'm running the app, my battery drains before the end of the day. If I kill the app, I'll make it until after noon the next day before having to charge. Took a while to figure out the issue cause it's the memory being used that drains the battery, not the app directly, so it's hard to determine the root cause. Anyone using the car app on their bike? This app is 12MB while the car app is just 3MB.",
        "date": "April 24, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPSHh2b0xXR0c4cTdPVDlHN09mRC1BRnQ5Y1NfLTRDbnZhVlgwelU0YVVBRi15Vk1pNHBFTXBfa1Znc3RUUEljYlQ2cWswUXNtZ3NIQThOcmc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, thanks for your feedback. We will look into the issue. Please take note, starting from Android 6, it needs location + Bluetooth enabled for you to run the app. These may further drain the battery as well. Should you have any further enquiries, please write to fobo@salutica.com.my. Thanks.",
            "date": "April 24, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Bill S",
        "comment": "I would have given it a good rating but it requires gps location. There's no reason it needs that to read tyre pressure. My location is none of your business.",
        "date": "April 29, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRmVLY3B5aUxUaWNZRjJQeUFIRkxIbVNWR3ZaZ05zNzV3dms1aWh2UnNnVGNaUHlHZ1Rxd0lGM2MtNnRLZk1jX2RnWVJWdGFucnNTTmNYUVE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, as from Android 6.0 and above, Android lump Bluetooth permission part of the location permission. We need the location permission to scan for the sensor. Rest assured we do not keep track of where you are.",
            "date": "April 29, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Burn sie",
        "comment": "Great product. Both batteries had to be replaced. Wish list would be to log the data for historical / charting purposes",
        "date": "May 6, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRTA2S2lnTzNCR3FTM2RORTJpb05YN1M3YlZqeGRRcDdwSXhLTVYyejBVVTNTdTJWTDhGWjVhbVRmNDB4MVR6c21JeV9VY2NRMEJ1SmptRkE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, thanks for your feedback. You can navigate into the settings page and press send log button and send to yourself. Enjoy using FOBO!",
            "date": "May 6, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sindhoor Bhat",
        "comment": "Good app. Please create widget.",
        "date": "April 25, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR0J1ZmVwOXRNMUdrSzRpUGl1MlVJNnltdnA4UXJUNk0yblRKQUFBXzFDakszZjZaT0k0Sl9wc0hFcDJzVEhHWTJNVGdVX01qOTV0VXlzU3c",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, thanks for your feedback. We will consider your suggestion!",
            "date": "April 25, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jeff Nickell",
        "comment": "Won't pair to the tire sensors Moto Z Force. Phone sees sensors when I look in the Bluetooth menu. Tried to pair, replaced batteries, pull batteries for 15 sec, rebooted phone, turned on all resources including NFC, just will not connect. I'm going to contact Amazon for a return of the hardware.",
        "date": "March 23, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRkFiVVdwV2tPSUY2bHl4a3hRbS1KY2EwX0dNWEY0cTFwUndsRDZiRm9xRTQzc3Y5R0NpdjgtUWlIeGtKeGhsRVdvSmZpUnlHcjJpemxZcXc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, please write to fobo@salutica.com.my for troubleshooting guides.",
            "date": "March 15, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Luis Figueroa",
        "comment": "This app is the best thing since sliced bread! I had a tire pressure loss problem before I bought this. I would often find my tire pressure was too low after the ride, meaning I had put undue stress on my tires by allowing them to overheat unnecessarily. Now I know the tire pressure from my bedroom and I never have those unpleasant surprises anymore. I love it. I'm buying a set for my van which already has a tpms installed but this is so much better. It tells me which tire, the battery level, the tire temperature, the actual psi, and reminds me what the tire pressure should be. And it is super accurate. It also has a theft deterrent system that alerts you if tampered with and is useless to thieves as it is locked to your account. Also this app does not drain your phone battery. It does not register in the list of draining apps, How is all this possible? How do I purchase stock in this firm?",
        "date": "April 5, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR3hrVW96VEQwMHJtdXZza0dPS0ZRdmJ5MmVQOTZuMVFIcVNGTG92ZjkyM2JzRy1vZ1RPUWZjMEhUcGpWQXBOaFNTNkpQd21uUzRVem5sRmc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback! Enjoy using FOBO!",
            "date": "April 5, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "William Patterson",
        "comment": "The widget and main display are different by .4 lbs for both wheels, which is the accurate one? The display always goes to about 50% brightness regardless of day or nite. I keep my phone at 100% all the time. Using samsung G6 on latest OS. Otherwise this is an awesome product. Any fixes possible?",
        "date": "April 9, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR25KOVFHTFNQX0c2TUR2UUhDNHhKaDZBdURFdmRWTmszdTlOSEFmVEhSWGtTdTB0NFNXRnVJZkNQWmRrMWhDV0NJV1lWZmUtdFBieUdCM3c",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, it is fixed in the new version. Enjoy using FOBO!",
            "date": "April 24, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Dax Games",
        "comment": "Love what this software/hardware does for me.  The only shortcoming is I wish I could silence the app when it senses a low/high pressure situation or set a silent vibration tone for a low/high pressure situation. I cannot always immediately go add air and at this point I have to silence my entire phone to get it to stop alerting me.",
        "date": "March 4, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR3FTVkYzNld2dmxmajRaV3NSTHpob09kcUJLOFVBR0Q3RE5NRFJTYWxobllsdUhvdjNla3FEekwzRnhsdVpuckNGLXQ3dENyQko5QXBvaFE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, once you have acknowledged the alert, it won't bother you again within the same trip. As a TPMS, it should give you an alert every time when you are about to start your journey. Right?",
            "date": "September 25, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "stu gibson",
        "comment": "Crash's after update",
        "date": "March 6, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRVhmeWVpdU1rLXFHQ2cyejJYTzhvdGlWMVRCbUhlVHY3a2IxcTBIZDVzUzRveUZ1N0pSNkNpeEhUdklqMVUtdEw2azhIVFFoTkZNdzljbHc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Please allow \"Draw over other apps\" permission if you are using overlay feature. Sorry for any inconvenience caused.",
            "date": "March 6, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Greg Hassler",
        "comment": "A must for riders. Knowing your tire pressures is critical, and this system lets you check every ride from your smart phone without getting down on the ground or getting your hands dirty.  The app works well but of course could use a few tweaks.  I'd like to see pressures in the main screen without having to click into a bike.  I'd also love to see a widget for the home screen. And the overlay service should be more configurable - only appear over certain apps or only when sensors are in range.  But overall I highly recommend this system.",
        "date": "November 20, 2016",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR2VMYmhjWmVHN3VOT2NhQllIcHlDcEx2MlM1QWpVNm5vcFFvX2NmVGtjc0tYSi02OHBsTWRiS0dDN1dNN3hiSlNXbFJhdzZhbmdhQ3g3enc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi Greg! Thanks for your feedback. Your suggestions are well received and put into our idea bank. Enjoy using FOBO!",
            "date": "November 20, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Martyn Wright",
        "comment": "Love this for a simple after market tpms. Love being able to configure multiple phones....Just wish I could acknowledge a low battery once and not again instead of each time I open app.",
        "date": "November 4, 2016",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPSGFUZ0U2OHE1QXQxSllxQnFWREcxWmE5MW1fWDRfVWhiNjY0THlIckhocmFQSWZndTBXU2FfTkp1aDJoTmtYQzBCNUJPUC1xODZkM3kzY0E",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi Martyn, thanks for your feedback. Regarding low battery alert, this serve as a gently reminder until you have changed the battery. Hope your understand that the battery is very important that may save your life.",
            "date": "November 5, 2016"
        },
        "star": 4,
        "title": "Great app"
    },
    {
        "author": "Charles Sumner",
        "comment": "When you only have 2 wheels you need to know about your air and temp.",
        "date": "November 3, 2016",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRUUtTlhobWNzWmxqNDJlUXkwY09raDRGRktzeTRvZS16cmI1WVZEZjA1dW9sUWRaQV93dDI2WjRNZ1E5ZnFTaFNxNXAzcnJYc1ljWlVDbkE",
        "reply": null,
        "star": 5,
        "title": "Great"
    },
    {
        "author": "Pedro Gorosviba",
        "comment": "Excellent. No regrets",
        "date": "February 25, 2017",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRUhYbU1fTnhlR2hOaGxWN1BueC14RWctWVlWdEljSlRNM1puUnlERlhDbzloTFFPYVNtWUhYNXd4TTdJeFpoTlBsWjBlQW5Mcmh3MkNqRUE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback. Enjoy using FOBO!",
            "date": "February 26, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Rekoob Wiskee",
        "comment": "Love the FOBO tpms and it works great. I would love to see both tire pressures when I get an alert instead of having to open the app to see the other tire (Galaxy S5) . I think the info might be there on the alert but it's just to much to show in a single line. Maybe just minimize that info down to FT psi and RT psi. Really like the system, after having mine for awhile I got another for a friend. Plan on adding another to my other bike at some point to.",
        "date": "October 11, 2016",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPSDdwWm02bEx0X1dvZ05MZUZiZWt5cHBwcU1GbERhTzFLYnppTV9FUENZd09fQzNEcFJIMUtYYzBjdDhRNWJsaGhEMWNVSGhpQTZyM3FrOFE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Thanks for your feedback! Enjoy using FOBO!",
            "date": "October 12, 2016"
        },
        "star": 4,
        "title": "Notifications"
    },
    {
        "author": "Matt Maynard",
        "comment": "The app works well, but don't expect to see tire pressure when moving, it only works when you are parked. However, alerts will work when you are moving if your tire pressure goes above or below the thresholds you set per the developer.",
        "date": "September 27, 2016",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRThtVTlXV2dtV0xDRnRjWFhPdUtER0RMMlhPRDJUaVFEeDZQbFBINGJ2SW9hS1FFYS02Q2lfYm8xR3pvN3BWVmUwLWRZc1ZaNU5Qdzh4eFE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, you don't need to see the tire pressure, do you? You will get notification if your tires breach the limits. Have a nice day!",
            "date": "September 27, 2016"
        },
        "star": 4,
        "title": "Does what it says, but only when not moving"
    },
    {
        "author": "",
        "comment": "Initial problems were overcome and units are working as described.",
        "date": "September 29, 2016",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRmdtaGdqSWMwUHhhYnc5R3lSUXhfOGVjQ1ZzNHNNdVQtQlg1ZHJ4S1RJN2p5QlNPUDlHS3BKWHU2NWhYN1lzZ05kcjZnWV9vSFAwTnBOaEE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, I'm glad that you've sort it out. Enjoy using FOBO!",
            "date": "September 29, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Thomas Dell",
        "comment": "Wish there was a way to turn off when not needed. Every time I turn off Bluetooth to save power this app scolds me for turning off BT. Resides in background constantly using battery.",
        "date": "July 24, 2016",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR2g5R1FoMnB1VXdZZlpIbThya212R3k1aDJOYzVzRk4wWlRDU0s5N3BidnBISUIwRWNQM0xOQlVVMUpkNU1STVJBTnNreUpwVk4zaDF5OEE",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, you may slightly pull down the service notification and turn off the app. Have a nice day!",
            "date": "September 25, 2016"
        },
        "star": 3,
        "title": "Love the product, app needs work"
    },
    {
        "author": "doug freson",
        "comment": "Android 6 needs location is garbage.  It is also always turning itself back on.  Now I can't even turn it off.",
        "date": "July 5, 2016",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPRThMUVhNNXhJSmVyRGRnVWtSZTU2U1lodVRNYW1KLXQ3ZWtvcEJNUnNiWXIzcUdlTjc3NVZsY2Z6Tm5iWEF0bXJLd1J3OXBsRmVtTGloM0E",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, you may slightly pull down the service notification and turn off the app. Location service is needed for Android 6 and above in order for the app to work. Have a nice day.",
            "date": "September 25, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Dennis A.",
        "comment": "Great combination. Responsive developers added code for Tasker within a few weeks of asking.. Nice! Basics: Intent Received: action:  com.fobo.bike.scan  Task-Flash (simple display or add to overlay screen) Predefined local VARs: %airpair %position %macAddr %pressure %battery %lastreadtime %temperature",
        "date": "April 25, 2016",
        "permlink": "/store/apps/details?id=com.fobo.bike&reviewId=Z3A6QU9xcFRPR05vUE50ajRUVjl3dm1vWGdaRTJuY2piZ3NwQ0xVSkpPTzdlSDVBNEk3ekxNb0VaYjVsXzFRRTJNUDZLVlozdXdCT0lHSEk5dTRZRUc1WHc",
        "reply": {
            "author": "Salutica Allied Solutions Sdn Bhd",
            "content": "Hi, thanks for your feedback! Enjoy using FOBO!",
            "date": "September 25, 2016"
        },
        "star": 5,
        "title": "FoBo + Tasker !! Cool !! MUST HAVE for Motorcycles!"
    }
]