[
    {
        "author": "Lino Ramirez",
        "comment": "Very poor functionality compared to the great desktop version. Buggy timer, often times desyncs and causes massive time logs because it kept tracking time. I had a 250+ hour log one time and no way to undo it or edit it correctly. Slow to load and can't turn it off once you started tracking time. Good ONLY if you use the phone app alone, not alongside the web one. Needs a massive rework.",
        "date": "November 2, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSFRCNEtSRXFtajVxODFGbVpSYmVRMmNLd2xjRkV5b3ZLVUJjbE1ORUF0aUI1RjdlMmphbE1BQmZDdGZpdzRvemRfd3l4TlNWM0c1aXZxdlE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Marcus Widerberg",
        "comment": "Toggl is a great service, awesome even. Custom, responsive apps with a potentially very responsive and non-intrusive user experience. Currently, however, the android app is very unstable for me, and as been for some time. It works, but you have to wade through several crashes and restart it to accomplish any task. Toggl desktop rarely works behind a proxy. The site works great, but is a website, and cannot offer the smooth and efficient user experience the applications can.",
        "date": "July 10, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRlR0NmRiV0FzQVdvenFaX2hyNzhnU293T25vWlR4LVctUElsZVZob3VRa0J3S0l5X2llZXlQbmZqWFRzYjV2d3psbVEtb1o4c3U0Z3RmbkE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Victor Elias",
        "comment": "It's an okay app for its core functionality. Even though I understand and agree with the limitations for visualizing the data in the mobile compared to desktop, I believe the mobile experience should be really focused on quick start/stop timer interactions. The only facilitation I saw was the stop notification, but none for quick starting a timer. A few really simple ideas would be:  - A default project just like there is on desktop;  - A simple (and please, small) widget that is configured for a specific project and can be toggled from the home screen;  - A public action defined for other apps to quickly toggle timers. Especially useful with launchers like Nova for defining custom gestures in home screen to toggl.",
        "date": "May 22, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRkRVUlU5XzhoZlJmTVhyOWp1TnY0Mktjc3BCN202M1ltam9iS1NrQUt6LWdJbVRfeWE3VXpRaFFTNl9HOXAyNDRxc05VaFlGMXlYN19HVVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Trevor Allen",
        "comment": "Using Toggl heavily since Feb 2016, even turned a couple friends on to it. UI is smooth, sleek and shiny while not being ostentatious. The defyingly simple Reporting capabilities add a tremendous amount of flexibility to glean insight. And to top it off, I don't think I've ever experienced better support/service from, well, anywhere.",
        "date": "August 30, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRnZGLXJWVjNwSHZQa0VyU2JSdVJBYW5qTDRHVGd5RXRFTW4wU0M3UWNjbHdQeV9jbFhVbGJTNHZTSUNMbHpUbEdUdkItRW5kVzdtWll3QkE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jennie Robinson",
        "comment": "Would give five stars if there was a more useful widget for this app. When you turn off your android or close out of the app you have to open and then start or stop your tracking. Thats seconds that when in a rush can become tiresome. Would be great if it had a widget you could see at all times on one window screens like the website. Hope that makes sense.",
        "date": "May 17, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRmN3RTUwLURwYTlzY2xRYlk3eklOZW5tcE9QVkFjRE02Ti1fVFEwd1dsdEhhZHY3NHEybkJGclhlOEZYUHVrZVBWbF9CekV4QjZyN3FDdGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Phil Bagley",
        "comment": "Within minutes of making my account it kicked me out. When I subsequently attempted to log in, it told me that my email and password combination were invalid. So naturally I tried to sign up for a new account. First I tried with my old password, and it said it was taken. I tried with a new password and it still did not accept it. I have been allowed minimal exposure to this app, but so far I am extremely unsatisfied with my experience so far.",
        "date": "December 24, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSHBTVlhhSll0SGR1OE9SeXlFLXF4ZE9OV3pILUdVeHhVSU5CbVZNWDN6TzBwYUczcHJCOFlpMkxuajVmQ2NfRnJNYjJaUFlnUHY2Y3BkRlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "George W Langham",
        "comment": "Pretty great for the most part.   The widget is shocking.  As it only comes in one large size,  and if your Android screen items width is set to more than 4, it doesn't care (unlike every other widget that's on Android) it's only going to let you place it 4 wide.",
        "date": "November 22, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRmwtUVhYdEN3dEZNWGFlN2c1THlDejJXTnZ4UFRMa3ZjTFhWRHF5ZUhTMXc1UWZMYTZCcVk2RkZSbDZ2bWZBS2lmTjJ4QXUyRHpSdjd6Q2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dev Kra",
        "comment": "Extremely buggy. Projects are constantly restarting on their own. Sometimes two projects will be running simultaneously because the one I just ended restarted itself. The errors thus created are then a pain to fix because of bad interface. Also crashes a lot. Also missing extremely basic functionality in the notification bar. Will be switching to a different app.",
        "date": "September 27, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSDRINVRCWjlJZDliSVdneldKUnRrWkxuLV9IUGtRcEtCVTdmTFQwMVRDM0FOOW8zY1JCT0dkT2xjRnFUVUJxRFZuZzhUWWNWOUJaZ0pMTEE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Andy Cottrell",
        "comment": "It's nice when it's working, and the staff have tried to be helpful.  But basically it's not fit for purpose.    I've lost the entire history twice now from my mobile.   Fortunately I am recording stuff purely for personal interest.  But if you wanted to use if for any serious time tracking/billing then it's just not reliable enough.",
        "date": "December 28, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRk8yZnZDVDliOXRIOTZJSFZHN1lkc3ZicVhlc05Nb3ByOEFseTNicW54Y0lDVVFpM3R0TURIWkJteG1fdjk0STI3TERNazhJRGp0dm9NbEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sasha Safonova",
        "comment": "Crashes basically every time I open the app, so I have to open the app twice each time I want to do something with it. Often clicking the stop button won't stop the activity, and the app keeps on tracking the activity I stopped hours ago. This has a nice web interface, though.",
        "date": "November 12, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRTh0RFV1b2hnY3UwYkVMaTZRcm9XYVVwd3ZCS2tOSzc5UE5IXzdGWTRfdXFkNENaSW5EbU1paHhRaGppcU84S3ZnVW1MTW5tWnAtbDl5TGc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Zach Purcell",
        "comment": "The toggle mac app and website are great. But this mobile version doesn't properly sync new projects so I've had times get lost. It's weird they even offer it as a mobile app when it's got so many glitches it's a liability to people who get paid by the hours logged.",
        "date": "July 12, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRVdXZFdnb04yb3Z6UUFkY3BzVzhpcmR6NWZoMjM0b3pLbjh4eUM1VnRsUl95M1JmWEZXXzdNRmdmaTZPbUwycXYzc0pEX0tEVGxmWTVXNXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Paul Noonan",
        "comment": "Like many others have said: Toggl is great, but this app needs work. Syncing issues and frequent crashes (often related to syncing). I haven't lost any data, but those two problems make me nervous.",
        "date": "September 23, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPR2FmWTdJcXU3VkhtdXlObXJJclZuR3hRcC1RYldVOXJxOUZucERobUNhTXNQMWxfR196OE1pb2NaVXZDSzVCaFlqa1VWZkJyZUpGdW9QRnc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Anas Shalan",
        "comment": "I Love toggl, But Really hate the android app.  It crashes A lot!. It doesn't sync tracked time on mobile , and when it does it duplicates the entries missing up my entire day.  and the app feels unstable, like its still in beta phase or sth.  I'll continue using toggl on the web .. but wish we had a better app.",
        "date": "September 20, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPR2FzcjN3VjdFMzk1a3pfeERFaU9MR3NuTnhXZmxXNUJyVE4xV2tuOGNKR0g3My1ibGxlTWd5UEhTMDJ5TDdHUFpWTlFNbGhsQkJPc2Fmbmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Orlando Wethered",
        "comment": "This app crashes every time you use it. The desktop and browser version are fine. But I need to have something that works on mobile and I just find this simply terrible to use. It crashes when you pause or start the clock. It also doesn't sync properly when using Mac app and mobile.",
        "date": "June 21, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSDhTSEl5a2lwamJGRjdPVlhpWnEyQ3lmd3g4cTQ1akg1UC12YzQxdU9kdVVjSHpQTGZDcnFvRHRTUjR1MzBjb0g0NDVLdVdLVFl1SDVpSEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ed Godbois",
        "comment": "Good app that I enjoy using and helps me immensely with tracking my time. However, it crashes a lot. It may just be my Note 4, but I get several a day completely randomly. It's fine it's running in the background, but it'll randomly crash if I try to change tasks, end tasks, etc. It doesn't happen all the time, but often enough to be frustrating.",
        "date": "April 12, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRmNpUG1rVm91UmdydmFYbnk5eWZvdnJFSFVTUUtuUjBrSXNOWUhZZjUtT1R2Z01ILWlWSmxvMFhua1JiX01MbUE0ZUl1SHNIUGdaS2gxbEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Caleb Christopher",
        "comment": "I like toggls website and really need his app to work, but it crashes constantly, primarily anytime I click in to edit a start or end time. I have to restart the app several times every time I use it. It's functional, but barely. I would be much more tempted to pay for service if it made tracking time on a phone an enjoyable experience.",
        "date": "September 29, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSDhIc1dZX0U0bm5sMUY4M2xYbjlOc2EzQ2llNFRKZVVOeVgzZmtSUC1xaTJDZHkyeGI2cmVjNzV2X0tjRGtFbHMtdURTOFpycmJYWXFGaEE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Michael ten Den",
        "comment": "OK app, idea is good and enjoy it to use it in combination with the website and chrome add-in on the laptop. It syncs fast and accurate, however it crashes a lot. I limits me to only start and stop my timer with the app, the rest of the functions are of no use on the phone",
        "date": "April 16, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPR0J1aVVxUFAtZVFTa2dCdlUyN3dPSTNSbUhSTWd0RDh1Yi1Xb0NDWDlMbkFoNGNXaXhINU9lMkJKOXlfajkyT1RvZmI2REZPdzhrZjhaSXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Daniel Harris",
        "comment": "Not syncing online. Glad I don't pay for this service because it is not syncing the time I keep on my mobile to the online platform. I'm having to manually enter it online. Not cool.  You're online mobile rendering isn't bad in landscape mode, but it'd be nice if the screen real estate was optimized better in portrait so I didn't have to rotate my phone. If your mobile app looked like your online version and actually synced with your services, I think it would be solid. Love toggl, but not happy with the app.",
        "date": "July 17, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRWlFU1F4U2oxYXVYY3Y5emh1ZDc2ZlR4ZXJTRzN4cTlyMDFSczJjOUVvSXFfTDdscnFOS3hSOV8xYnl1Tk80ZjZmVHBzZ2dDUmw2bGJ0U0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Dimitar Pouchnikov",
        "comment": "This is a good service that I've used before on the web but the Android app falls short of the mark. Crashes frequently very frequently - about every second time I open it, and it does not let me delete time logs. I really want to like it because it does what it needs to very good - track time on sufferer projects and display analysis and breakdowns - except for the constant crashes. It's time to look for an alternative app",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRlhNdHFDdENDMGVVdzZrOGZ6UWpPS1JFeExpbGtNUDV4TTY3NnFUcTVOVXpqR2tHS2E1VUhwQ2ZybXdERGcxcHVSWFpzb1RqZXZFa0RWNGc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Maheemal Thilakarathne",
        "comment": "Synching issues with the web and frequent crashes. Contacted support and only help they had was telling me to manually transfer my entries to the web version. Shame. I hope they get their act together. I'm going to keep my eyes peeled for something bit more reliable",
        "date": "April 26, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRmJVTnR5U1l1MUc1MXNUSTVMWjRhRFdtNElvcTRUQ1VyaGN6Mi0yOVplWnZFR0NDTjhXUHRmYnIxWmdrOFl2S1FVVzVBLWdIQWw2b3VTYlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Marcus Hast",
        "comment": "The service itself (the web site) is pretty good and stable. The Android app has a couple of annoying crashes and just poor design choices when used in conjunction with the web app causing it to delete data when syncing.",
        "date": "October 23, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRkNWUTdjMWpmMk5xYzhlNGxSUWh4T1hyRWU4eWR2VTJBQm5DbUJhclJTeUd2LURVU2RROUpVRnpMOEh4N1Q2cFZuaXBYM1JYVmRROTlna1E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Liz Donnell",
        "comment": "I love Toggl - it has all the functions I need for timekeeping.  But the (Android) phone app crashes nearly every start up. Which is ironically time consuming.",
        "date": "September 4, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRWNZRjZnMEprUDI0Sm9LWnhuRkw5ZmN6aGx0b08xQW1uX1lZakZLdlFISThGNjg2YmU5TkJjbExRY3RGQmlNOFFwb0NqU29tSGs5Vm9DTlE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Android version used to work great, but can't login as computer says, \"no\". Have tried to setup new account and also login with Google but still no joy!  Really annoying as desktop version works! Would be helpful if there was a \"forgot password\" or \"reset\" option.",
        "date": "November 15, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSHpQbTBKVFhmek5EemRvc2dXUkdDcTN0UGpBa18wVm9YSDhYVzdYLS1RT3N1Z3V6YnZtdzlhY3ZLeXpGZmR2UW1mdFpQajZtOWFxNi1WMXc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Derek Nedveck",
        "comment": "At first glance the app is great, but it crashes multiple times a day when I go to start tasks -- fantastically frustrating. I reached out to tech support, installed a custom app to help them track the issue, and nothing came of it. These issues were on a 2013 Nexus 7 and a Nexus 5X, so it's not device specific.",
        "date": "July 13, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRlhiZlBVRjBkWkJuVW0wbTUwXzhpS3dqNHgyMTZNMHlRbWlwb1htU0c1d0Y4TjZwTWJ3S21GbzFvUElOUGYzMEdKMzZKMjRfX0RZWFNBLUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Steven Dall",
        "comment": "This app is frustrating, and doesn't sync correctly. And I can't even use the website, because it doesn't support mobile devices. It is honestly easier to mail myself, and track it on my machine",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRklZSnV2LUNyOFlnMGpTZ1RMSUhhZjA2YnpaM3BweFM4bWdVOEg0aWd0MWFEbldFV3Z6UlctOUQ4VkFnMmE4bUd6MWRkcnBGVkNuLTlDX1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Josef Adamčík",
        "comment": "Toogle is good service and app would be good to. Byt it crsashes a lot, multiple times everytime I try to use. After a few weeks of crashing a some crashreports sent I'm givimg bad review. Nothing has been fixed and it feels like the app is not mantained anymore.",
        "date": "June 26, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRWVKeWVBWEtOUHlUTDB3QjB5bHJxTVRPU0FEZW1ncUNtdEdPR3VQU2tyemJrWlNzX251QlptVXROT2Z1UjhNUWp3VzA2MjRobEkyZEI0Qnc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ford Davis",
        "comment": "Difficulty logging in. I have my password saved in chrome and signed up with a Gmail but it still can't log me in with google? Also no password recovery link on the app but the main website just says it doesn't work on mobile and boots you back to the app.",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSGtYNVY2QmQzVGVpdnZoWUk1RUgybmFvblIwQmdaUjJNWDBhY1EtcFZPcEZkYzU3QlgwekFSb3AyWktBTmwyb1VGZ1N3SFVwdnJaQmF2V2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Lee Nelson",
        "comment": "Overall good. But it crashes, doesn't save tasks for quick selection (like it does on desktop), and the report is all in one color instead of the project colors.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRW1XQktwSHFFeVhhSktXRmJtbWRJTDc5Q1lsa2ZyTHhrRU5yMGJySkh6d1RPOVdfWUlWWEdQRTE1RVdrdlZTb2pOTGh5Q1JFMEFQMW9GMVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Em Pulse",
        "comment": "With more and more people using tablets in workplace and school environments to have a productivity tool like this with 0 tablet support is ridiculous. Either this app was made years ago and has not had a visual refresh or the developer actively turned off tablet support and rotation. Get your act together Toggl, would be better to have a wrapper for your website. Uninstalled.",
        "date": "July 17, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRjlxM1NsWGRQNjloU1ZVd0otTldtdElmZDZXb2Z6OEZodnF0Q3dQeDh4Y3RielRCTFlmSllNZGQxOXlIYUxoVGFJcVJid253Y0htdXRPT0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Juan Jansen van Rensburg",
        "comment": "Syncing stopped working, and reports only works with synced data. Why? Weekly reports should work with data on hand. I could prob. force sync by logging out, but then I lose months of tracked data.  App is broken in so many ways. Please fix it.",
        "date": "October 17, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSFYyQXJaLWR1bkphRVN5Y2U1S2xvdEp6cTJ4M0h3MTFOTGZwd05MZU43Z1B6ZXdXOE1oR3VMelRfb0RrNWM4ckowNHBfZkZuOTlIZDRDREE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Hans Cronau",
        "comment": "Web version on mobile is better. (Update: the dealbreakers I report below have not been fixed for over a year now. Update2: Two years now.) Minor issue: Google login button doesn't respond. Huge issue: slow sync. Often results in accidentally mutated records or trashed changes. Example: start a task on Toggl for Web. Then open Toggl for Android, press Stop. Toggl will realise too late that it's due for a sync and you'll have stopped the task that was running last on Android, destructively updating its end time. Request: make Top Projects optional. I never use them and would rather sacrifice the screen space to a search bar for my many projects.",
        "date": "October 24, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRUZjRnpGQndJQlJubGc2RldtRF81QWF3TnN2VEZaN1dIaTVDYjNzTlJmVUxmSnBMQVdCWkNCSndwMnJnZm91TFlOT3BQLXd1eWEyYk51WEE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Tristan Krug",
        "comment": "In concept the app is great, in practice it falls short. Crashes frequently and repeatedly, syncs inconsistently, and generally performs poorly on my pixel. All these things could be fixed, and I hope they are because I like the core time tracking concepts toggl employs.",
        "date": "April 21, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRlc5NHZuX3pWLTMxaFNGTVdqTTNlQU9SbjZ2WVZUODlYbUVzYS1CLXV0T0xmLXZDZy1MOWJVT1NGLUF1ZlY1UzZFcl9VbnJFVmc3QU1OS1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Tormod Mathiesen",
        "comment": "Crashes all the time! I really love the toggl service and use it on the desktop. However when I'm out and about I have to use this app and the crashing is really annoying! Please fix!",
        "date": "April 27, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRXgycXBITFJHaE1Zb2NiQ3c2c2pPbUlpT3VDR2pNSEJQWUIzQTFFQVhDWGNTQ3kyc2FHYmVSY1NJSW05TnFxWlpwR0NsRjNGeFBYOUpNaEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Patrick Wolf",
        "comment": "Works, but it regularly crashes whenever I hit the play button on a task.  Update: Lowered rating because still after many months the app still consistently crashes. So frustrating.",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPR2pfbVZWRzN5Tk90dFlONVh3M2N2Ny1vdlF2ekR2cVhhS3R6WjhfWW1UN0did1N6LUZsSEpwekNpWGNhVzgtckluWlRnYUJKa0hvNzJyeGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "The website app is great, but the android app is awful to the point of unusability, certainly if you try to use them together. A real shame, as sometimes I start a task on the web, and just need to pause or amend it from my phone",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRmFvd2hsNXhYODkyaXIzcy1LSVVWeWozamJqVVBKclFKUG1CUkkxeFVnTzMtSVBndk5LX2RnOXZMNmptYVh6ZV9hX0JhOUJJMDFZZFN1bUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "A great app, beautiful and easy to use. Yes, there are some bugs and crashes, but it takes part of an application. However, I noticed a bug that is annoying. At the beginning, in the Reports tab, the projects were separated by colors ; now, I have only one color. If I checked on a browser, each project has its own color. It becomes confusing and hard to quick know which project I was working hard on.",
        "date": "June 5, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSGE4V2ljNnZEd2xxZ2ZqMUpQWGs4SkdFOEY4M1NwcU1iTWdTNWE3Wk5FbURKc0tSOUFzTUtBLUJKUjVWaE1wU3dFdTNRVjdmblhrOXRreHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tina Danielsson",
        "comment": "Still has reoccurring connection problems when it can download but not upload. Still missing functions present in the web app, but it's gotten better at least.",
        "date": "September 5, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPRnJaWkhaalRCOVZSN2pFN1gyWGg5dG5LSnhJczJFaC13RzdpeThfWTFzckpMcWpKM3VKS0NUVFdwcV9vZDU5d0NxdHBRMUtfUFJ5Q1k5THc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Andrew Arkwell",
        "comment": "This is a good app but there are a few things that are extremely simple to add that should be added immediately. They include:  - Letting the app go landscape (on my tablet if I have it slotted into my wireless keyboard, it is very annoying to have to rotate it when using this app. No other app on my entire tablet has this issue. This is not a difficult feature) - Add a \"syncing\" message and disallow pressing buttons when you first open it. Sometimes when you have it running on your computer and you open it on your phone it will initially seem like you haven't stopped the timer, or it takes a few seconds to sync up and tell you what's actually on your Toggl.  Other than that, great app that provides a very valuable service for free!",
        "date": "April 17, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSEtnd2ItNFVLTEgxRkRBSnMxelR5TnItajhUWUtvdUcxTC1lV0pUZ19ueFRNM19EMVN1bU1aZmYzMU01am82ajZ2TUgxdnZvN2hnTVBmblE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tony Gambone",
        "comment": "I'm a happy user of the Toggl web app, but the Android app is unusable. It does not sync project and client names reliably, so items from the web app are often listed with no project/description info on the mobile app.  Worse, it often happens that if you stop the timer on mobile, you'll come back to the web later and find it's been running the entire time.  One nice feature of the mobile app is that it will notify you of a long-running timer that you forgot to stop.  However, this doesn't happen reliably and even when it does, sometimes stopping it on mobile does not register.  Ultimately it's just not reliable enough to use. Otherwise really happy with Toggl and the value it provides for free.  I'll stick to the web app.",
        "date": "October 24, 2017",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPSEVIdUNydHlBNFk1WnBKM281QS1sNEc3aDZNSjU1amk0cm5qUW9sUFBYVnVVd0ZXVEtvMmY5RTJFUVppTjRtN0hORWFyOERFQ2RyVjB3YVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Tristan Schorn",
        "comment": "Has great potential, especially because the web version is great. Crashes frequently though, and needs some more features:  Need: Long press shortcuts to start timers Stop and pause timers from notification Tasker integration Sleep as android integration",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.toggl.timer&reviewId=Z3A6QU9xcFRPR3V0ZTc1UjY0U3hUT0VIa3JUc21OSmdjTk9lR29aSFR1VkdocmNfNElYY2xvT3puak9FNkhYcFVrRUVlbzZ0Z1pqV2lGdUZFcEw5WjkxT3c",
        "reply": null,
        "star": 3,
        "title": null
    }
]