[
    {
        "author": "Jantzen Deppe",
        "comment": "I don't take the time to review apps often, only if one is particularly bad or good and this one falls on the good side of the spectrum. Overdrive makes it really easy to browse and check out library books even if you're busy or on the go. Highly recommend. If you have any trouble syncing books across devices make sure you have logged in the same way on both devices (overdrive account vs library card info)",
        "date": "November 18, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSFRNLU9UUExJaHRuM04zejlwbkhjcUNlM2R6VmpwRnpJTDJYY2hicTVqZENqZGU5cy13UnVlV21mbEF3TE9TWTZ6Q1dTc29tVGJTYkdsNHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "The latest version works great.  I have not noticed any issues! I could suggest the following. The history only shows 20 books and that list doesn't carry over when you replace your phone.  The cloud account could be better.  I would like the cloud to store and suggest.  The ability to add notes.    I have been using OverDrive for years every day.  It is easy to check out books from the library.  You will need to download an Adobe reader to read books, but after it is set up it is easy to use.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=bGc6QU9xcFRPRUVOWlhZNXhMY1VhTVhDRm9JVUpYTHJTcGkwTkFsZXktQkxNcExDa1owX3dwWm4yRlkzaHZhVm5Ud1J1WFROU2RNZGlfYk5JSEZNTlNkYlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Amy Ford",
        "comment": "The app is great and works great, except for one issue and there's no information on how to fix it. The books that aren't at my library can be recommended for the library to purchase. However the process doesn't work for me. It opens the page to recommend and the email/hold notification option is given but once I select to either recommend or cancel, and I hit recommend, it doesn't go through and send the recommendation. I even went to the browser site and tried with the same results. I need to know why this isn't working and how it can be fixed. I Would give overdrive 5 stars if not for this VERY frustrating issue. Help?",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRTVKbVBzZUtTOUpxZWJwdWcxRjFkRkkyQ2xvVENYXy13eDU3XzNiLWdNN1c3eGdEUVpNYXBrMngybko1S3pBa3U5MXJvX0lMUnZtNF9Eenc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kathy Wood",
        "comment": "I use this app daily. They have a wide selection of books,both written and audio. The system works well, and does not crash. I read 3-5 books  a week for entertainment and it is very handy to be able to check out a book any time day or night. I can read books on my phone or tablet, listen to audio books at home or in the car. I can adjust the brightness and size of the print so reading is comfortable. It is easy to carry several books at a time, you can set your checkout periods, and I don't have to worry about misplacing books or have them overdue",
        "date": "December 17, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPR2hkMVZ3aG8wRUJxUjh1WEJodmJhWjBIRFNGYTRLMlBtbzB2eFhweGk2d3E2b0w5MkV6WGxPX1RIY3l5Z25LZ190V1VabkZqbzhFblJjVEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "I've tried about 90% of the ereaders and this is the best for what I need.  What I needed is the ability to sync across platforms (tablet and phone), ability to borrow books from the local library, and the ability to read open ePub books. This does it all.  I do tend to download the Kindle formats (if available) as Kindle is a better ereader. The built in reader could be better at reproducing the publishers format. Some ePub books don't always render correctly, especially older books.",
        "date": "November 15, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=bGc6QU9xcFRPRUU2SlZGM3RqMFRkVHpjQ1pHZWdvTmNrU0tUUDJ3ejNaRUtKQVpZaDVqQ0NLRm05SjFsVzdSZ3ZGbFNNLVRkZUpXN2JmMlZ0ZkJOWm5tOGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Gerald Hawkins",
        "comment": "Generally excellent with one or two quirks. The player is well designed and works great for selecting and playing library audio books. Two details: the pause button doesn't work on the lock screen. I have to log into my phone to pause. Also, audio players should have a selection so that I can choose if it should come on automatically when I start my car.",
        "date": "October 29, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRTBvSHNobUhBc3ItMkRwaWV6dkktd2Y4bnZtY1RFMEhHMkZfQjZKNG1uM2JsaGQ0SnI1NzU2bmVZOHFZbkQyYXBVSl9hY2d2YmdvbkNBb3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "This is an exceptional app for access to library books. It puts books on hold and will let you know when they are available for you. There are sooo many books available for your immediate reading or listening pleasure also. They are put on a \"bookshelf\" for easy access and you will be notified when your \"return due date\" is nearing. It's an e-library like no other and perfect for bookworms like me! Happy reading!",
        "date": "January 7, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRlNGLTZMZ0swc09naGZkeUU2Yk85dUowSUtWdzFfQnBYV1lnX19oTXh2QXZYSDdTaVN3eUs0bmM2ZEVERTZmeGZyTGNDb1RiZzRJSjdkQmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Linda Ewart",
        "comment": "I read every day. Being able to access my local library's e- book collection is wonderful. The audio book function is great too. Font selection & sizing a real boon as I often have problems with my eyesight. I found if the library is missing books in the middle of a series I can simply email the branch the info. Added to my permanent Kobo collection I never have to worry about having nothing to read. Thanks Overdrive.",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSEFkVUtHcHFIMVMtVFFmRmZSYjQ0enUyUmRsQ3pMM3M2Vm9NbzB3dllZQzRRcDk0cnliWVdJOGxkOEI5cnFHMXB3UWlwektReF95NUxqSXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I love this app. It works great with both ebooks and audio books. I especially appreciate being able to increase/decrease the speed of narration. Comes in handy with a slow reader. Easy to use. Can rewind/fast forward when needed. One thing I would like, and perhaps it's already there, I'd like to bookmark some books for future reading without taking them out. Sometimes I see a book I'd like to read, it's available but I don't want it now. By bookmarking it, I'll know which book I was interested in. Excellent app otherwise. I highly recommend it.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRThrZm9HVFMtX1pyN0R4NUNBYjZ0VENrcUw2QVJwd0RnREEwTXVoQ0l5Z2k4RjlwVEticXNacTVzQzRkVUNodEdpbXZ0VEJPczUzaGhJdGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Fiona Mwacharo",
        "comment": "I have used this app for quite a while now and while most of the time I have enjoyed it, there are some features (or lack thereof) that are really annoying. I hate that there is no zoom in feature. I have read books that have pictures with some kind of caption on them which I could not read because I could not zoom in. Also it does not allow me to jump straight to a footnote so it is absolute torture when you are reading a book full of footnotes which are at the end of the chapter (or at the end of a book) so you really cannot read them unless you are incredibly patient.   For the love of God fix the footnote issue!!!",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRVJzN0p4eXZXRER6S3BOaXo2REZpT0dfQnl3YW9uWTNCR0J2cm4wTVpHemFkdTFiU3czSkROelB6RThlM3A3REJsc1NYUllCQjh0Z29Md1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Siej",
        "comment": "I mostly use this for audio books, and it works great. Playback is great, keeps your place will, easy controls. UI for finding the things you have on hold takes a bit to find, but once you figure it out, it's no big deal. Great resource for free and with a library card. Pretty sweet. Not much to complain about for something entirely free without ads.",
        "date": "November 16, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRUtycTdFclhJd2JXVkctdnVQeWNtT2E2cTZiZnB6X2xXa1JIVkpYczB6SnMxWWtnNmc1dUxYbDJtcmNSZGZlb3ZOQmhQc05DdFNETkszUUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Meng Xiong",
        "comment": "This is a must-have app.  I have used it for years across many Android, iOS, and Windows devices.  I like that even with all of the updates over the years it has continued to be smooth, stable, and user friendly.  I read in night mode since the darker background is easier on my eyes and I'm convinced that it helps with battery life on OLED screens.  I don't like the number of taps it takes to get to the Loans screen to download books that I've checked out now.  I recall when it took less toggling.  However, books are very easy to access once downloaded.  Bookmarking is also easy and intuitive once reading has begun.  Of note, I still make trips to the library as well since I don't want those to go the way of video rental stores when digital movies were universally adopted.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRkRKbGtjZ2Q2NDY3WXRQZ3ZNQ0o4UkF3S1E3ZzlwMW15eGpFeEJ0d2ZzYm1wcFJZSHlValhvRllqZms3TTZLeFFraGhWbHhqSmZGTlFPWnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Stella Partheniou Grasso",
        "comment": "So convenient. I am not a fan of ereaders but this app is really well designed. You can tell a lot of thought has been put into the user experience. I like that it's easy to switch from night reading to day reading. I haven't come across any bugs at all. That's what happens when a company invests in development instead of marketing. Picture books don't display well but that is more of an issue with the epub than the reader.",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPR1dqZGllZzBDcGx3YjdaREtXYW9IVTFmOEt5SkYzLXBhSVI3YWJEQWZMSU1PVjVrM0ZLUThWUVdKYk5nNVFSbjA3T29zalJRSHlDMTVsQnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Des Taylor",
        "comment": "Been using overdrive for years now. I absolutely love it. Anything you can check out in a library, you can check out on here. Even have a waiting list if it's already checked out and they email you as soon as your book becomes available. Plus if you're not finished with the book by the time it's due back you can recheck it out so you have plenty of time to finish It! Really love this app.",
        "date": "October 15, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRXZRZjhyOEc2cWE4bmhwSDdUTDFmTVpOeFJNMVByRjFsaGU3WjBEVjBob185OWNWV0V5TnJ1eGNJd1gyT3ZRS2h1U3p6MUc2R0ZSZ2NLenc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Alex Hoy",
        "comment": "It's good. Audible/kindle app is much better. One annoyance is reading books on here. The light on phone turns off after like 20 seconds of no activity while you read. Cannot adjust font text size either so you are stuck with one size of text. Listening to audiobook was great though.",
        "date": "December 19, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRU9DaUpSdWNJX0JwclRvSTgyVnVLbUJRcV9jaEl1WGhjMjNVdU5MaFFYWm1wNDFhNFFjbWQ0Y1Rkcko0TVk1VVhWbGlYcXU0dnlESmp1d1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Really like this app and would give it 5 stars but I can't send the ebook to my kindle like I thought I would be able to.  I find reading on a kindle is so much better for my eyes and assumed I would be able to send the book to my new kindle as the option is on the app.  However this can only be done in US, not the UK.  I was very disappointed when I found this out.  When will we be able to do this in the UK overdrive? I will be happy to give this 5 stars, or more if they were available, if i can send it to my kindle.",
        "date": "December 28, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSGo1eVl1UER5UTZIN0pKVk9fUHdsa3paRXFUa3RlWXVqWkY1T0RsblFkb0l2c0xISTFYc3ZQS3pMSGdSdWpUZnhHeU9nR0I2UGNhSmJyZVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "MozFireFox",
        "comment": "Ah this app... It really is frustrating sometimes! Seriously! I have to turn in a DIGITAL book. Although it is for safety to the original writer it will continue to irk me til' the end of time. Other then that, God Bless the makers of this app! It is reliable and a great find for old and new readers alike!",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRUlwV3hjQ3NBSVlnMmV5amVsN3ZXQy1tdDBKaWd4ZEdrQ3NZUzQ4YXNqcUVIY0x6aE5QdGkzTjNkcGs1aldQM19vS0M1Y1lQa3Jsb0tIZnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Amy Jo",
        "comment": "Great app. Can get a little lost clicking between loans/bookshelf/returns. But a small price to pay for such a wonderful opportunity get library books without going to the library. However, if you have not been in a library recently you are missing out on ALL the other cool things they offer.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRTZUTUZXdU9TTjdzVzNfcUNoX0JBYVNsSUphV2E2QzFQTC1rdFo2ODFSNzZySEpBX3EzMHNZN0xvbW1BeFA0Z0diX2xjUmQ0eTExRVpTT3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Rory Little",
        "comment": "Other than audible, this is the only audiobook app I have used. The app is great and the availability of items depends on the library you use. However  one small issue is when checking out items, the default is 7 days however you need to dive further into the menus to change that to 14 or 21 days. Could be helpful however, shortening the time of holds by other people. Overall I am very pleased with this app.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSFY2bVNsSHV3VXZaVmRmSWI3b2lTWmpMVzgtYjFlOHZ2dDNMT3R3aGk0dG9NczlycnYtdFVtYldsdkdrT2ZjcDhOeUxuSURBbUdKX1B0OVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Cassandra Telenko",
        "comment": "Overdrive is a great service, but the app needs some improved functionality. I would love to see libraries engage other services like Axis360 to improve the competition and options and possibly reduce costs. Neither of my libraries have axis360, but I'd love to try it.  The links inside overdrive ebooks don't work. The library access has greatly improved by saving my information and reducing sign in burdens in the app. Online is a different story. It sometimes loses my info and makes me re-sign into overdrive.",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPR0FxMWVTY0lkNG53THNrZjBxZzQtWlFkaVZQQ0kxdENyMC01YzNFNFljMVRkek9LUHhZSEJmQnJfZUVmZHpjNEdmaGtNd2l1WmQteU5HT0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Grace Carleton",
        "comment": "I absolutely love this app! I started using it in college to read books so I wouldn't have to carry around another book in my bag, and it's still one of my favorite ways to read when I can't take books with me or only have a small amount of time. Really got me back into reading for fun!",
        "date": "December 24, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSHhFSDZyQUZIRU5USFdTS1JySGVOSnF3Y2VYVDBCT0xCS055blhTTUdwdzEwVFREY1lJZnlWSWoxQU9zMDBpN2F0cy1sNlFMWllUVUo1cFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Quick and easy. Lots of books to view and the best part is i can download it instantly, if it is available,  put the book on the waiting list if it isn't. No thinking when should the book be returned as it gets automatically retuned for me. Life couldn't easier and all done while i am at home with a glass of wine, yes and a good book.",
        "date": "November 7, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRjNlbktoLTBLdkoteUlmb0YtYmc1UVF1blRfWWtVSW93Wmc3SVI3YnlmTElNMEg1Z2thZDBUazItMGFMdFdlajNaUjNMQ3ZxUnhIQlpMSWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lania DeMers",
        "comment": "I LOVE Overdrive because I can always have my choice of text books with me wherever I go. Also, the thousands of audio books available make it easy for me to get through some classics that might otherwise be \"tough reads.\" I often lusten to them when driving or waiting in the car between stops for my job.",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRW1KcEZaNlFEM213RG10Zkk0TV80TGlQVDFMcHFrLWxsS0V3QTA1eHpxZXlaSXJaM3dvN21NcWZJZGI3eTJBdUcxZldjZXhiVnQ0b01rUkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rob Kachmar",
        "comment": "This is a great app to access eContent from my local library. Awhile ago I made a suggestion to add better functionality for moving forward and backward through the audio books, and recently I discovered that you can turn on seeking in advanced settings. This app just keeps getting better and better!",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRkVGcmVCbm4yYVNzR2NsMEVkR3JvcTd3bzZabFc1TGd4bEp2Qm4wOUZpMnVOY25Sd2RQUkRLMnpjR1VEeGFOVlU2aDRaS3F4UW1vSHRQOGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Karen Robertson",
        "comment": "And saved so many trees, as well! I'm an avid reader, but making frequent trips to the library was difficult, because... Life. This app is a time, money, and often a sanity saver. I enjoyed checking a book out at 2 AM, from the comfort of bed, when I couldn't get to sleep.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRmF2bDhwdkhFamtuVm1DX21tRTUzRFMycWtfRHkwbW5KaFZreWEyOFpORHJWcDgyVkZkckcycjduNkd5enJZVXdzYjM4MEZFZ2pZMEc0eWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kristi Rodriguez",
        "comment": "It's an awesome app! It has plenty of books to read and listen to. Sometimes, if the book has a serious, it might not have all the books available. If you request it, it also takes a very long time for them to have it available, if not at all. Over all, it beats any app out there. You can download any book and have it offline to listen to so you won't use your data all the time.",
        "date": "November 21, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSGoxWFBRMG9wdnl2SGk1NDdKSElIejNaU1gyNlVua3J1N2ozN0hEMklablVZcGhZcG1HM2ZFV1gwbjVpR0xJeFQ5S2V3ZjR3aUV1YUxra2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ray SemJawa",
        "comment": "Library access via library card number granted. Not all books wanted for reading are available. Other apps for reading are better on my eyesight and allow better font choice, so I prefer them for reading. This app only good for when you run out of money and can't download books.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSDdEdEhrWldIN2k1V3ROcXJVN2NTOC1iLUM2a25ncHhLZW5NWTVOSTEzS3YtZVdUZFVtNzZIdDY4T0FDNnNFQWhXQkFyWFptMFdIZDZaTXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Christopher Mandarano",
        "comment": "Love it, but a small request to developers. Is there a way you can preserve user data like library card information during updates?  It seems like I am having to reenter all library cards again each time a new update happens.",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRmV2NjItX2o3Vk5wT2IyQjh3TDFFTkttV3p2dVFCYWI2VmlXbG5rbWQ1MFdwTEJ3a2hTUUtqU2VQSy1LampWMWQ2SFl5c3E1RlR1dldMbXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Nunyabizness",
        "comment": "I was pleased with ease of use. It reads well and affords easy access to my Library account.   The book suggestions are horrible, nothing like what I read and the selection in the library itself was mediocre, especially video as my library has a huge video section but none are available online.  I for the most part am happy, no issues with the app itself.",
        "date": "December 21, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPR0VSLUNWVGY4SlZiX3JtSDdUeXNxOHdLdU03cTNzUy1ReDNxSWZqbC1HT0RybHhMRlpFaFpTU3R3OUk2Ykh0cXdYdVlHZ1Y0RmNROEg3VUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "BeeBee CeeCee",
        "comment": "I really enjoy using this app. It has a few flaws, such as on audio play, it has no lock feature so when on my phone listening it is very easy to skip around unintentionally. I find that if I bookmark often, it solves that problem.   It interfaces with my libraries extremely well and automatically check out my new books available for me and sends me E-mail updates.     I have enjoyed it. But I'm not that picky. It is free!",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRllDcmxMWWIwYUN4a1JWMGI0ZlZrRndiamZ1NklZSFRBYmpHcmlzMk9ZUEtHSnRsNlJBelJoVVhWTHFSdnZ1YUxjTWxDR3R2THBaS2daVWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Will Packard",
        "comment": "This app is very helpful and easy to use. I love that i can read a book wherever i go. The only problem that i have is that i can only get books that somebody already checked out. Since this is digital it doesnt make sense that that would happen. Other than that this is great!",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRzFNSzRjdDdrTVJ2R0FycXluejN1czVnY09zajFZeFJoRUtDZlljT1k1dVo4TnhXYi00bC1uUTFYYWhXVnZBYjJOUjY2bUpsVkZOWHhlTWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Casey Pham",
        "comment": "It would be nice if there was a cleaner, better page turning animation, like an actual book for those reading on the app itself. It's the only downfall of the app. Other than that pretty good (disappointed my local digital library doesn't have \"Amulet\" to read online... ☹ )",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPR193VFJKU3FGd2FWOTlSSUFpQUx2MzFQc1F1NUMyay03bm5IRWxtbWM2OU9kQk1ua290TGd2WEVqenZ0X1hsbDJ6VXBNMFQ2VXBjcFlSMXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Works flawlessly with my libraries. Some PDFs don't show up. I'm not sure if this is the app or the book. Perfect for audiobooks and I really like being able to add a title to my waitlist. Bookmarks always work, even if a title express and you borrow it again later it will pick up where you left off.",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPR1M5ZTdzOVlBcktrUldnLXBOUzBWVEUtTGhqWm5pVkZfYXRTbE9DY01RU3ROTzdnZDFyRVBhMXBhdUxYYU9LMllSRkJ2NGE3dHdYelJXUkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Dynasti Carson",
        "comment": "I've been a fan of this app since I got my first tablet... it's perfect and reliable.   Im a staunch believer in offline access.. this app does it all... I wish I could check out more than 3 books at a time; however,  they are reasonable.  This app is the best of the best.   You'd b an idiot to write it off as anything less.",
        "date": "December 15, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSHZRTDUwZWF2Q0FfQktTbHBNTWYtRVRZRkxLV3hCRVFjWWZkZmExZ3pXSmJ3M3RGYjFQVTU4V21RLUtYTHNTOXBqSVBubnlRQ1VJVmdIalE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Valeria Inoscencio",
        "comment": "I like this app. It makes those boring traffic full drives much better because I can be listening to an interesting audiobook. Only thing is that some items don't have enough copies and you have to put them on \"hold\" and wait until another person is done with it. If it's an e-version of an audiobook I don't get why there can't be unlimited copies of each item. Overall I like this enough to give 5 stars.",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRmF4VFFtQ2FxUzhNYmZQQy1Qb2FKYUl0d2ZqYTVEMzJLTXR4Z3VUNGFteUpOWXVhV3BuM2JyU3RPMVVIbmQxbF9WZU1wT0NMczdoc2VpMWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "gb jennings",
        "comment": "Overdrive is easy to use. BUT both Over. & Libby should disply date published, or book # in series on the search function, so you don't have open each book.. Tried Liby, & like that you can keep track of what you read through the Tag system.  But everything takes an effort to do, ie adding the 2nd tag to thumbs up, thumbs down to keep track of read books throws me everytime. I get it done, but because instructions do not flow: i stumble: displaying the book cover with Tag symbol below. When I get there,  I've tried so many ways don't retrain the steps. The taged books I think are in\"order of adding\", instead of alphabetical  by author, & date published so easy to find.",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPR0NhSTdwbjVkU1c3SVVPUG5XWmlwZmZpeFAyanoxelRyZlhoMm5xa0xWVUJqemVocnA4bFljSkdoSUVEWV9fRlNOTXRBcmQ0LWpCcWdsLUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Vicki Cook",
        "comment": "It's great to be able to access library books so easily.  Unfortunately I can't find for size edit so words too large.  And I don't like the layout there are no boundaries to text on page and reading on phone it closes page down too soon so have to keep touching you hold page open.",
        "date": "November 10, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSDRmTUxISjVmZ005aU0tajJQSll4aE5Ud2hfdWVKUldsdndJdUE0S3VCVjFCeVVZcXBmdjVuMzFUbXM4bGc2OFlTRTRJUElFdmlYb0YyZ0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Book Worm",
        "comment": "This app has saved me from many weekends of boredom. I am thankful the app is free and my librarian signed me and my entire high school up for it. I love just about everything about it expect the fact when one looks up an author/book and none of their books are within the library, one does not get suggestions on other authors or books like what was searched. Although, you do get to look at books by the author and recommend some to the app for insight on what they should buy next. Good for every reader type.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRy0tTEgyRUEzSGtvT0pCUWc1U2czWHZCODZpeV9hWFRwcDBCSGVXNUppSVhPcWRjRFF5N1FXMWtKRGFoUFg4QXFKMF9VWk1TMEZraE12Umc",
        "reply": null,
        "star": 5,
        "title": "Thanks a million!"
    },
    {
        "author": "Holly Buderus",
        "comment": "I read a book or two a week. With Overdrive, I can get those books from the library and save myself a small fortune. I especially love audiobooks! They're perfect for road trips and passing time on long walks. Easy to use, and super economical!",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPRXI5QlQ3RWRKZzI4RGxZRXdjOUdXakIwZ29OdVlLV0RoY0R5c3p0Z1B0cVhia3pjVnc3YUdVWm05dHBuWlFjZWNMODFuenQ0SXctUFJjWFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Cristopher Dominguez",
        "comment": "I am so glad I came across with overdrive. It is a great app! It has clear sound audio books and the best of all its free! All you need is your library card. I cant say any bad things about this app. The only thing I wish it had is more books.",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&reviewId=Z3A6QU9xcFRPSGo0SEVuN2M0a2RNVWg5blpDNzJXLTN1ejBQX3VMdDZ3MlFJVnZ0Q19hNTFzX1cxOEdwWHZNdWJVazlWTTA0UUtHeVZFYkJzR3RzWnJtSHc",
        "reply": null,
        "star": 5,
        "title": null
    }
]