[
    {
        "author": "TiNNiTuS TQ",
        "comment": "When I first launched it, it kept force closing. After a few reboots managed to keep that at bay. On a few occassions it wont project the sound out to my BT speaker, had to enable and disable BT a few times till it works. The EQ control is good, maybe thanks to the good audio hardware bass is maintained even at full volume on headphones.",
        "date": "April 27, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPR1ZmbWZrUG1CVEdWRkR0VXQtdVdiZjljLS0wYTNyX2lzX0VxUDhHaTVRVVRKMWIwQjVsVHBzd2YtelRXOUp4OWltR0xpVy0wc3lkVDFjWmc",
        "reply": null,
        "star": 3,
        "title": "Works Fine but Buggy"
    },
    {
        "author": "Viknesh Vijayakumar",
        "comment": "I really like this player, but... One thing sets me back from using this. The Equalizer.   Updates after updates equalizer stays the same. Any idea to make it good like the other top music players out there? I would love to get back to Asus Music Player :)   Also need to know if this player supports Replaygain tag.... Great work guys...",
        "date": "January 12, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRjZXN0hnOFhUeDhlMDdvVFNMYTBReUdpcnh6cExYamxwNW1lY2JDZG5tRkZmM0dpRzBSV0d1NDRDUkN1WHVYbUo4S19PMjhrVUMya1llUHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Abhi sharma",
        "comment": "Im using Asus Zenphone personally and I liked the pre-installed Asus music player. However, im a weird issue of \"Album Art\" under \"Edit Info\" of songs. It show same \"Album Art\" for same songs from different albums. Could you please add a feature like Sony Xperia where music player auto update or auto correct all songs information with their correct album art. Thanks!",
        "date": "June 13, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSEIzY1VaUGxNSUFCeFhBa3hwZUxrckwwckVrRlBROWNQbWNYbl9TanM1RVBRbmdkRUtVbHdDOEx1cGJ5NjhJdm1seFVDS3VkbndHNjYxOGc",
        "reply": null,
        "star": 3,
        "title": "Album Art issue!"
    },
    {
        "author": "Faisal Rasyid R.",
        "comment": "Please ASUS Team, i don't know what's going on but recently music player often stopped while i opened several apps (mostly social media such as line, whatsapp, twitter etc). Please find solution for this issue. I wish i and other zenfone user who might facing same issue are able to experiencing the best music player once more. Thanks.",
        "date": "July 15, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRzNKd0JSSkduUklEM2NYcGQ0QURmMEtodlpxRkNZb0d5YWV5QklWY1V1WlV5VVZ3RWlza25ZZ0pIZTdma0VMX1VzMFVDaVNfbTExekVWTWc",
        "reply": null,
        "star": 4,
        "title": "Used to be the best music player!!!"
    },
    {
        "author": "Vivi Yunika",
        "comment": "A lot of bugs. First, when I open 'Folders', all of the folders that are shown become double. When I close the app and I open it, it becomes normal. But when I close and open it again, the error happens.  The second bug is when the song is played, the display time of the song doesn't run. It stuck on 00:00, although the song runs well. For the beginning until the end of the song, it still shows us 00:00.  The third bug is when I play one song, and then I click back, the song that is played on the screen is the song below the song. For the example, I play \"I Love You\". The song below \"I Love You\" is \"Zombie Everywhere\". When \"I Love You\" is running, the screen shows \"Zombie Everywhere\".  I don't know how to explain it clearly, but I hope Asus fix it and it will be perfect.  The last, please add 'instrumental singing version' built in.",
        "date": "August 28, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRlczVG5hSmdoOGxZZ1FKTUZwQXd3QVNGb3dtMjIwbG9OeWdBN1JpdUlnYTVlN2FrTzlvNEFEdEI0SGl5Zk1oSEZPWW9xM1FJVGNzQVJSYmc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kirtish Sukhija",
        "comment": "1. Add forward/rewind from notification bar or the song player live bar.                                2. During continuous playback, Name of song to be displayed automatically of every new song in notification bar. 3. Recorded audios to be added automatically to music player - newly added. 4. Default player for playing downloaded files to be music player and not the live bar that pops up to play everytime (not in background). 5. How can we play whatsapp mp3 files through music player? Having a difficulty.",
        "date": "February 7, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRW9CYXladGtrTDI0UGJGX2RZMDhCVFlMejc4YTBYNm5scWtHV2E4OHBfanZsLTg5blFmOVZ4b2hHTW1XclZrMVRUc1FJdWw5SHNZOVkzUWc",
        "reply": null,
        "star": 3,
        "title": "Please add these useful features."
    },
    {
        "author": "Michelle XøXø",
        "comment": "I like this app but I think in Most Played it should only go up to 50 instead of all of your music. Also, when I close the app, my music stops, so maybe u can change these things or not. But other then that, a good app. There should also be a trash and share button just to make it more easier instead of clicking the arrow of the song. But good app.",
        "date": "January 2, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSDRuWFpXbHdlMlJneVRqZ2xJQVlubVlsM0wwSlpYMjVXaXlyM1U3ckV4ZEIwMkJDU1JncDk1eXlqaHFOZW45RzEya2tKSV9DaEtwamxVYVE",
        "reply": null,
        "star": 4,
        "title": "Amazing but..."
    },
    {
        "author": "Viacheslav Bazhenov",
        "comment": "When I open the list of all files and select a song it takes up to 3-4 seconds to start. Not connected with the speed of SD card,  other players work just fine. If colors could be changed on demand would be great! Otherwise great app",
        "date": "January 26, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPR2pJYWhZdExsM2lOQkZkekxwX0tuWnFlaEx6R0lrdWpvbHVoLVdQM24tYmhWQU5pc25VaVpzUVpQRm50cmtGWVdoaXBBM2ltLXdUVHJBNlE",
        "reply": null,
        "star": 5,
        "title": "Freezes, color themes needed"
    },
    {
        "author": "Julian Hubbard",
        "comment": "I was happily surprised that it plays all mine music and all I did was drag the iTunes music directory to a 128 gig we card. It was such a pleasant surprise to not have to jump through hoops because I made the mistake of buying music from Apple when I first had an iPod and it doesn't play in most music apps. Additionally, this music app seems to have everything I need for general listening though I haven't started the hopefully easy task of creating playlists.",
        "date": "February 22, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPR3NKQWh0bkZLM2IzZFNiX19idm1lMEZYUkxVY1FuLUx2VVBwcnUyUld6bzVpNmhPVW5vOEVleW9PMnd4RDk4b2JBYkwxOThHcDlCOGh4UXc",
        "reply": null,
        "star": 4,
        "title": "works for my iTunes mistakes"
    },
    {
        "author": "Gerald UY",
        "comment": "I'm really upset on the display of the track. Can you make it more beautiful, like change the background color that matches the album cover of the song? Pleeeeeeaaaasssseee. I beg you, because it'll look more beautiful. All the other things in this music player is good, but the display of the track need to be improve. Please make it more nice. Jeeeeeeebbaaalll juseyo",
        "date": "April 30, 2017",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPR2RlbmQyS01MUmRQRWd0b3lxWGp5Njh3Z3MwNzZLdXlyYXpESUFYWDRnX3RRbms0YmJYYjdseFdXMmNkLWxPUG02d0MxSXJUaV9GYm1fZlE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Koxis Verserken",
        "comment": "Making playlist or queue list is not as easy as other apps do. Why do I have to go as far as opening each single album, and add all of its song before I delete the songs I don't want, or playing each files so I can access the menu at the right top corner. Man, you can add press and hold pop-up menu in each song which also includes \"add to playlist\" menu. Press and hold is more effective and intuitive than your old-school-corner menu.",
        "date": "June 20, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRzVMdDBiaHBkc011TjBONEwzRHZ5SjA0LU0yOHR4b3BrLVk5MmIwTFp4MnFJV1RGcExXWVJvMV9ROXo0V296azNic2ROblJ4dDVEUVN3VHc",
        "reply": null,
        "star": 2,
        "title": "It's not intuitive"
    },
    {
        "author": "daff zv",
        "comment": "i think the layout is too stiff, i mean if i use oppo music player, it is more elegant and catchy. and the lyric displayed properly. but here the lyric is put on small square. hard to read. i wish asus team could make it better next time. keep up the good work!!",
        "date": "December 31, 2015",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRnlnWlEwMldRYTNGVThuSWVraWNoZi1SWDVjR3dBaEJtaGZPVHJjWUF2T09ud2ZtSjlKNHk3ckpONDVOZkd2d3lvYm1KN0h0MHBuZ2NJSWc",
        "reply": null,
        "star": 4,
        "title": "5 stars if"
    },
    {
        "author": "Anna Wang",
        "comment": "Hey guys, can you make an update for wma files? A lot of my music files are in this format and it will cost me money or affect its quality if I were going to convert it to mp3 formats. Thanks btw.",
        "date": "May 8, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPR1dmLWtXM21ab1ZYSFJSMF81Y1NWYVgteGxHZ09OM1JONWc5aTVXZmV1ODljWC1ZT1dFbTBaRFVVYmJjWVdVamZVSTZ0TEU2VG13bk5LcXc",
        "reply": null,
        "star": 3,
        "title": "WMA are not supported"
    },
    {
        "author": "Hani Karmilah",
        "comment": "you know what, i remember those days when i swipe and clean all apps out, but the song still plays. But now, whenever i kill apps (it's a habit i can't control) well my music stops as well. not to mention if i'm using another apps, the music player will stop to play suddenly (AND NOT TO MENTION I ALSO ENCOUNTER THE SAME THING WITH SPOTIFY). But 4 stars for you coz I can edit my song's infos, adding album cover, organize all my album in an appropriate order, lyrics can be embed into mp3. so yeah. pls.",
        "date": "October 6, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRlBiYXRCbGhDRlh5UE1oZ2RkcDZ4cFFMRm02ek1pQzBSVFljZUxlU28ydG53SlR0elZhOEw1c29Na1NhSFhlNTR3NzhFNkJ0bFNGNFRXWHc",
        "reply": null,
        "star": 4,
        "title": "excellent music player, BUT.."
    },
    {
        "author": "Ashish Sinha",
        "comment": "It's nice but lacks some features like I can't search a song and share or delete it.. Songs can be searched just to play..No other options....Second thing is that, I can't select multiple songs and paly, share , delete etc..Third is that, It doesn't show the shuffled list.. Even after shuffling songs, now playing shows songs alphabetically...Fourth ... no update for a very long time... Earlier I used to get frequent updates..",
        "date": "September 28, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRWZteFFjem9rbE16VW5HOXJZUlVESWhZTk1rajhUeVNiZUE4Uzk5anpwdGlaRFFIVFpBa2hxeTNQcnhYWm9SX3dnZ3dTSGVtUFlMeDZfYmc",
        "reply": null,
        "star": 3,
        "title": "Needs improvement"
    },
    {
        "author": "Miss Hanah",
        "comment": "Can you make the option to blacklist folder in the Asus Music.. And also recently I have realised that everytime I reset or shut down the phone the album arts will not show by itself until I click on the album or the song section.. If you could look into it I have no more complain of this amazing music player and will give a 5 star right away. TQ",
        "date": "August 9, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRjB6NVhCU3hPek5VbDBCTDNzOTNZWlYwQkE5X3BFblZfTVlWclBaOG1aVkRTZ3hCR05vOERMMVhaWjRLQU9MUFZVbFR4YkZqTVZ6bUI3aHc",
        "reply": null,
        "star": 3,
        "title": "Blaclist folder"
    },
    {
        "author": "Reinhard Linardi",
        "comment": "UI simple, interactive, and easy to use. The only bug is when you have another app running, the music sometimes lags for half a second. Please fix it in the next update. I am using Zenfone 2 Laser 5.0. And please support wma format..",
        "date": "June 6, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSGhOZXphWkhOb0xFNWI5RGtZUGJSZFFVeXpLYWlyRHpod0szejAxRkgwNlRBSFZNT3VkQUNNR0hRZkMtNmNJdmxQWUJRakZKZEhMbDNRMWc",
        "reply": null,
        "star": 5,
        "title": "Excellent"
    },
    {
        "author": "Cezar Marinescu",
        "comment": "At first I was skeptical but after you listen you won't believe; I have ZenFone Max and I listen Radio Tunes Premium and I tried the equalizer settings,so it just worked.All in all this is the only app which have equalizer function working also on internet radio and not only on local stored music.",
        "date": "March 9, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRzlXY1U0WGtJUjVTa0VySnBLemFob1JjMDY4Y21jUjNFZ19LZzNhN3NjNkZpRmFNRDBjT1c5ZnRZTGxfMy1nQ0NUYmx5UExyMmNoOWl6ZXc",
        "reply": null,
        "star": 5,
        "title": "The very best!!!!!"
    },
    {
        "author": "Matt Nabavi",
        "comment": "Thank you guys for improvements :) I came across a strange issue after updating to latest version. When I start this app, play a song and then go to \"Telegram\", the music will stop automatically and I have to press play again! It happens every time I open the other app while playing music. P.S; every time I'm finished using this app, I \"force stop\" the app through Setting.",
        "date": "February 19, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSHdzcnNZblJ0MTJfZzR6cWdkYXRuWV84dmVMa3MzaWN1X0E4bUk5TEYxM0lub1ZjdWVJN2ppVzUza3M2NXk3Y0F5N1lBLVlXY1AwUENmR2c",
        "reply": null,
        "star": 3,
        "title": "Strange issue!"
    },
    {
        "author": "Husnur Rizki Maulana",
        "comment": "It really is a very good music player. But it should have multiple selection feature. Isn't it easier to, say, remove several songs from a playlist at once rather than to select one song then remove it from the playlist one by one? I'm looking forward for the feature to be added in next update. Thank you.",
        "date": "January 15, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSC15VW5iYzctMmloYy1XMTM1cHNObm5YUFRqMk1FYjcwd2Vwbm90TW0yY2NmUVk2VnU4YUhoN0VDWWNtYUQ3V1dLbmlvUklVNVYzU3pRQnc",
        "reply": null,
        "star": 4,
        "title": "Multiple selection"
    },
    {
        "author": "baker jones",
        "comment": "I love this app and use it all the time, but recently I encountered an issue. Whenever I try to change the cover art for a song, it changes the art for 4 other songs for no reason. I've tried to change all 5 but it groups all of them together so they're all the same. Please fix or tell me how to fix it. Thank you.",
        "date": "June 9, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRmVjZElwN1prMW5LZnBoLVNYSnZ2YUFPbUhOQm9CUkpkZnc4Q2hCdE01MU03amp6VUpZTkJlYTJwLU41dzZLTWZaczFsWTBDTWVMTTA0YlE",
        "reply": null,
        "star": 4,
        "title": "Good but..."
    },
    {
        "author": "Jeffery Wongs",
        "comment": "I have uploaded 1000 songs but Zen Music only show 680 songs. WMN n other formatand are left  out. My Samsung phone got no problem playing every single song. Please fix this problem",
        "date": "July 9, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSHVLbl84b0NMS2E1NFJpSjlRWnVXRG5rXzU2VEhlMnBBM29ROUtfTG9XNGtQNUN5ODRHNXVCdFliNFlHT1o4OUZDMGpNd3pjeTFiZGpFb1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Rishabh Nayak S",
        "comment": "Would've given 5 stars if they hadn't changed the sorting. Now my songs are sorted from A-Z and then you have a-z. It's annoying. I would like the non case-sensitive sorting back or at least add an option to do so.",
        "date": "March 2, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPR0o5XzVmME16ZWdWVVJGdlM1NVZfVVRfMkVzSnJWNnBuSFB0bmJHVm5vNU5kNlU0RHl2ZzhCb0RSLWJHcV9wZ0l5MW1fSlFFLWhxb0U0N0E",
        "reply": null,
        "star": 4,
        "title": "Nice to see constant updates"
    },
    {
        "author": "Anza Hanif Athallah",
        "comment": "This app is great, and its new \"edit info\" feature is great, but i got a problem... i accidentally changed some of the album covers of my songs, and i can't delete the covers (changing it back to the original \"no cover\" setting). It would be great if you added a \"Delete cover\" option in the edit info feature.",
        "date": "February 5, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPR25NWGo4NWhZY3plZFNKblBUQVUyUG9hR1gtc2xEdndpXzhnbkJLQjlKZzdQV0ZTaFNlR0pDN3drd2RzX1lVdEtQdjRhYXBUQktMa3JseWc",
        "reply": null,
        "star": 4,
        "title": "Great, but with one problem..."
    },
    {
        "author": "Joshua Takahashi",
        "comment": "The personalization of my music files can't get any better than this. Way more satisfied with this app than Google Play Music. Glad I switched to ZenFone. 👌👌👌👍 ... Still believe on this review but there's this bug that annoys me. It happens when I unplug my earphones and it suddenly plays music! Even though the app isn't on and hasn't been for hours. Please fix!",
        "date": "March 21, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRlFxdmV1Q2RRQVZqLTNvTU12c0M2MU84NTRXWjNZYjBfSUN5WEMzSnE5Vzl0UnFQczM2eDdza0RsX2FxaTdnWkY2UzVBV2tXTjEtWW84TkE",
        "reply": null,
        "star": 5,
        "title": "Very handy BUT THERES A BUG"
    },
    {
        "author": "Shuying Hew",
        "comment": "At last multiple skin available!! But still there's some minor error like I change a cover for a song but it turns out a few songs affected with the same cover? Fix this and I will definitely rate 5 😉",
        "date": "February 5, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRXd2eUVCdnZwZEJmRXpvcGt4TGdEaVZLd3NSbzh5dDRqWVpxbWg1TFJVNm5ZbHZZNXNhVlBYY1B5WW9HMVN2dmhRVEFpdUtDV3p5d0FoMlE",
        "reply": null,
        "star": 4,
        "title": "Love this music player!"
    },
    {
        "author": "Gujju Ganda's",
        "comment": "after force stop the app will play.. till than it will not open ... plz solve it its a wonderful app i loved it..... after that i will give five stars",
        "date": "April 16, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRmNveDdyM2w4U3JBSTBPU01lRi1DWjNpcEFESWVPa2ZuREhrNGp4WHMwR0huU05LMGRCaEVvaGljN3pYQjdiRmdtWWlYYTF2OGpqZktUZkE",
        "reply": null,
        "star": 5,
        "title": "I have asus ZenFone 2 deluxe ...After 3- 4 days it will say unfortunately music has stopped ..."
    },
    {
        "author": "Mirja Sadat",
        "comment": "This phone is greatly used in Bangladesh but the regret is that there is no authenticated and reliable eminent service point even in the capital, Dhaka. Necessary,  measures are asked to be taken immediately. Otherwise, mass tentency and prone to this phone may die out sooner !",
        "date": "March 10, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSG9iU2g3aVVwYnB6c0pUY2JDN0RyZEJ2dzFZZmJFd0Z5b2J2MlN4LS1XaFZKaXU0Ml9OT2JzVXdjeGl1RHEyd2VEQlNrVkVXQnFHcmZYRmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kostas Taros",
        "comment": "I've been using my asus zenfone 6 for the past 2 years, and it was awesome. Just today, the music app (asus music) for some reason, decided not to show the tracks I have on my micro sD, although I could listen to them from the file manager. How can I solve that issue???",
        "date": "December 17, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPR3JRZnFCOXFaSVBFZ0ZGZUg5RzhqU1Z2VW5wbjBDQmVXTENTZzZjOTIwYmFJakZVRjFVSjR4dFprUFI3VjVqQUJ6dU5DdHVYT1RLcFVDSUE",
        "reply": null,
        "star": 2,
        "title": "Wut?!?"
    },
    {
        "author": "Josiah Horton",
        "comment": "I'm 16 going on 17 so music is a big part of my life. This means I need a good music player. This player is great! I love having access to my drive music as well! The themes make it even more awesome! The equaliser is especially nice! Not many people get the equaliser right. I don't know how I've been getting on without this app!",
        "date": "December 31, 2015",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRlB3SjVYSDNsS3FWNXlwY09KWFh6QktTMmw3RWJRT0VUTWMzYzk3QnB5V1RIQXdDOHE4ZlBTOTEybFkzVkItZWM4SjBueVhCcU44UFZUN2c",
        "reply": null,
        "star": 5,
        "title": "I love it!"
    },
    {
        "author": "B SIBARAM PRASAD SUBUDHI",
        "comment": "Observed a peculiar defect or bug. While playing a song, it was in middle of the song and suddenly it started from beginning. Though it is intermittent in nature. Observed many a times. Please have a long and debug the app.",
        "date": "May 26, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRmpCdkdIT1k0T0hvaDRSSklPOG14Y0ZLaUNHQ1JFakE4dzc4ejR4aDU4ZUtia1MtVmdLYm1LU2VDaFNDSHJqcl9BWVVhaks4QzFWSUhYRmc",
        "reply": null,
        "star": 4,
        "title": "So far no issues other than auto restart"
    },
    {
        "author": "Yonakuni",
        "comment": "I don't know if I'm doing anything wrong in particular, but the shuffle isn't much of a shuffle. It is more like a preset que or something. It's not really a shuffle if I already know what comes after a certain song. And even if I try to listen to another song, it plays a song I knew was coming still, it doesn't shuffle them at all; like a mixed up playlist or something.",
        "date": "December 30, 2015",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSG9tMEFUajZpUGMxbTZJSlg1Vjg5UEdkbTZ0OWZfdGxkVnNxcHZ1M2JhQjNuSWVQdnhyRUdkX3ZxbUJZYVlaXzdaYkVzMEotNVo1Nl96ZGc",
        "reply": null,
        "star": 3,
        "title": "Shuffle Function?"
    },
    {
        "author": "Paras C.",
        "comment": "Older version i could ramp up the bass quite high and I would hear the difference.. I the new version, weather i increase/decrease the bass, makes no difference.. and please add lyrics that generates automatically.. I'm giving 3.. for the sleep timer .. awesome Lil feature..",
        "date": "March 19, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPR2dDWHNjaHZqX0xiTmZiMFFKVGZLSlVUU1pvbkh6NTZxbjgxdWJaQnBBUy02a0hud1JfYV9hZ2l2dVVpR2VGVGpWR0tpZUZMMV9ZUy1tZXc",
        "reply": null,
        "star": 3,
        "title": "Equalizer issue"
    },
    {
        "author": "Kalimuthu Manikandan",
        "comment": "Everything was Fine and Sound Quality is Just Great ! Only Problem is Thumbnails of Every Album goes missing often... But The THUMBS VISIBLE EVERY-TIME I OPEN EACH ALBUM INDIVIDUALLY....PLS FIX THE THUMBNAIL PROBLEM FOR ALBUM. FIRSTLY REPLY TO USERS QUERY                      Otherwise FIVE STARS.",
        "date": "January 24, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRzljb1dhV3NTN3otY2dmVkIxU1U1RkRiMUdFUUxZOHJGcG1HLXN2YzdfeWpqUDZLN0tNU2hnS0pRVVp0SGdzQ0tMSXZKenhaam43OUg3blE",
        "reply": null,
        "star": 3,
        "title": "AWESOME, BUT FIX THUMBNAIL ISSUE"
    },
    {
        "author": "Gopal Krishna",
        "comment": "Music player stops automatically while playing songs. Sometime song continue playing but the timer doesn't run, It freezes at 0.00.Showing another song playing while ut plays another song. Songs not suffling.It's a very annoying. Please do something about it.",
        "date": "February 3, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSDdGQW05SnIyYzNPREc3Yk92dTB6RUlaV1M2QncyWmNZUnlSZ05NYzhiWmNyaEJvV25ndGU1Z1BLN1BfNEtOc1NqSkRsb0lYQlRFeVdpWnc",
        "reply": null,
        "star": 1,
        "title": "New bug popping up every day (edited 3rd time.)"
    },
    {
        "author": "Richard Knox",
        "comment": "Where I live, it's illegal to drive with your phone in your hand.  My Alpine deck can get menus, if sent by the phone, like my old Samsung S5, where I could select \"song, artist and album.  I like the app, but it needs this feature.  They did add gapless, like I posted I'd like before, so plus one star for that.  Keep it up Asus.",
        "date": "January 18, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSEVwemwwalViYzBiUXZYcEd4cFVuTmpUZVF6TVNhNzlGVzAxMjh6elFsUzdvMlpNek5LalhTNVZVdy1iaUhCNlAtWEk0Z3ZBT1JJei13aXc",
        "reply": null,
        "star": 4,
        "title": "Needs Bluetooth menu control"
    },
    {
        "author": "Rushi Deshmukh",
        "comment": "Overall good app but I'm facing one issue. While streaming over bluetooth afrer I get a phone call, the music starts from the phone speaker even when the bluetooth speaker is connected. I have to disconnect and reconnect the speaker. Thats frustrating. Happens for JBL go speaker and Honda car's bluetooth.",
        "date": "February 3, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRmZqY09YX25OSjdGc0hqcHZRUTNxbjVhb1dIdGxuUU5pemgyUjFRZUt6UHhNYnI5YlJEODZBVXk3QWotcGF3TzVwZGVXWTY5dTZ1UUxoWXc",
        "reply": null,
        "star": 4,
        "title": "Good app"
    },
    {
        "author": "Samuel",
        "comment": "I have Xperia, Lumia, but I love this one way better. Great job. But I wish I can have more than one custom equalizer since I have more than one headphone for different listening session. I am a music enthusiast, I have FiiO M3, have audition iBasso DX80, FiiO X52nd Gen and I would say in term of sound quality they are on par or this one (ZenFone 2 Laser) with its music app BETTER. I have Xperia Z1 Compact but it have a disappointing sound quality.",
        "date": "January 9, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPSHNPTHI2SXRlenpRemhKbklNVFpZNDVGLWFmczljVUsxNXBLZTRLMDNKTlNqSWhQOWlQYzA1WVYzdGtoVko0Yng1dmxnYmp1RTc4WjN2ZHc",
        "reply": null,
        "star": 5,
        "title": "Gorgeous"
    },
    {
        "author": "Dimuthu Janaka Abeysinghe",
        "comment": "All mp3 in my music folder does not show in the music player and also this player can't play some audio file type. (.wav). Please fix those problem.. anyway asus products are awesome.. (Y)",
        "date": "February 29, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRW12NTFfOEFGdHlVUDEtNTVzSWluX09pVDQ0c3pjRkRDczNDNmVQdWFHNEg4WXJEOEtzU0VJdE91d1JuYXNEY2ZqZmEzT0NpazBTT1hzaWc",
        "reply": null,
        "star": 4,
        "title": "It has some problem"
    },
    {
        "author": "Sricharan Chery",
        "comment": "Had there been control to change the song without seeing the screen, something like long press up volume key to move to next song and low volume key to move to prev song it would be helpful to use the player while driving.",
        "date": "February 2, 2016",
        "permlink": "/store/apps/details?id=com.asus.music&reviewId=Z3A6QU9xcFRPRXNZVTJyTjdMX0tQN192bW5OZEJ0Tlkxdk1kam5TOFg3YmVnaFFmQU1LcU5nWi0tVEYxR0dwMEVKd19xMkU4d0JUYUVLMllXbG9KZXoxWHc",
        "reply": null,
        "star": 4,
        "title": "Features are awesome!"
    }
]