[
    {
        "author": "Connie Boyer",
        "comment": "I LOVE THE BOOKMARKING FEATURE.    I LOVE THE NEW INTERFACE TO GOOGLE DRIVE - THAT IS REALLY SLICK - JUST WHAT I NEEDED!!!!  I LOVE HOW DICTOMATE FOUND A WAY AROUND the Android 4.4 OBSTACLE - GOOGLE CREATED - preventing apps from recording on the extra SD CARD!! I LOVE BEING ABLE TO RECORD PHONE CALLS!!  AND NOW I AM CHANGING MY RATING TO A 5 because the developers just released multi-line descriptors for the NAME of each recording AND for each bookmark!!! WONDERFUL!!  This developer is the most responsive Android developer, I have ever worked with.  THANK YOU FOR AN AMAZING APP and for RESPONDING SO QUICKLY to questions and new feature requests!!!",
        "date": "August 25, 2017",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPR0VudUMtakFQSTJ1eHRFVDliZFdueTVSTGowaFBBLXpZS0VoSDk2QzRHOGlpSE5iS28zLWRaWlAzaFQ1M0lzaUtsdXRSWEt4YUw2RVU",
        "reply": {
            "author": "Handroid",
            "content": "And we LOVE reviews​ like yours Connie. Thank you for the feedback and we'll investigate your suggestion. Kind Regards, Matt.",
            "date": "March 20, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Baker",
        "comment": "I had an initial problem, but realized it was not the app, it was me! This is an amazing app that I end up using once or twice a week. It works great and I compare it with other apps that I've uninstalled because this one one out!",
        "date": "September 7, 2017",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPR2tJTVl0NTlNZnpvVmZKdG1DUjJTTjRHZThvVll5TG5TUnlWRXkySjlIZzk2dWNybVZoWjN6Z1pQY0NLUDh6ekdQZkFSalp2bW9kSzQ",
        "reply": {
            "author": "Handroid",
            "content": "Hello Mike, We apologise for the issue you're experiencing.  Could you please give us the make\\model of your phone? This is the first time this has been reported so we would like to make sure we can get this issue resolved for you. We would also like to understand what you would like in terms of editing a bookmark. Sent reply via email.",
            "date": "July 31, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Majid Hussain",
        "comment": "Overall the app is very good for recording. Excellent recording features. But some of the things completely drive me nuts.  1. No option to change the flippin file naming convention. No matter how good a mobile app is, you will alwaus have to apply some noise suppression and some editing after recording, its a nightmare to find the most recent file by file name. 2. There is an option to save files to SD Card but it does not work. Each time I try, I get an error that SD card is not accessible. Well it is accessible to all the freakin apps in my phone. So every now and then I have to copy the data from internal memory to external. 3. The rename and delete function does not work. 4. Why do you have tiny buttons when you have a large empty space in the recording screen. Why can't you use it for something useful. Show some stats, warn for bad recording, noise, do something for the sake of doing.",
        "date": "September 22, 2017",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRVMxNWxNdk9xU3FuRmRUaXpHVnZFZXJFVVRnS29NcjlMTTZzZTRZMnpXWkRYLXpHejlXMkJqNGExMjZBMlBxM0tlQXhqdTNwbHlhUmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Robbie Frame II",
        "comment": "I've been looking for a while for an app that uses bookmarks since I got used to them on my old Samsung Note. Recording quality is sound, interface very simple, like the rotate 180° to make a bookmark automatically, only thing I wish it had lock screen and notification bar integration. Love the updates! Last one gave me the option to upload my recordings on Google Cloud now so I can listen to them from my PC.",
        "date": "August 8, 2017",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPR1hjUzU1V1RMSFNwV1VoQVR5X1czMUZDM3M3dkVkUEU0Z29GVnZCNDhqS3Azb05Xc0dIRG8yZUtGRG9icC1JUnRBajY0MkxDZTF1Qmc",
        "reply": {
            "author": "Handroid",
            "content": "Thanks for your comments Rob. See preference-&gt;'keep screen on when recording' for the screen lock. Dictomate should appear in the notification bar when a recording is in progress for easy access back to the app. Also you might be interested in the desktop widget for being able to start\\stop bookmark recording straight from  the desktop. Thanks!",
            "date": "February 6, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Adrienne Grabowski",
        "comment": "Great app",
        "date": "March 12, 2017",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRVV1SEl6RURQX3M1OFcxZXhka2dpQzdnR0p3NHEyVVduTzRoUUc0OWNNZUpERzNsdWtFRTk0UGtTSUp1VmEtV19TaTdVZm9VbVZFTDg",
        "reply": {
            "author": "Handroid",
            "content": "Thank you for feedback we really appreciate it. If there's a feature you think would help benefit you or other users please let us know. Kind regards, Matt",
            "date": "March 12, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Lee Kendall",
        "comment": "Does everything you need it to. Quick and intuitive. Recommended.",
        "date": "February 3, 2016",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRUJXZzJYdUFkY0JpanlDazlQSi00bmwtSFR4U04tcW5DT2liNHFBVU5DSGg4WEZucWNfVkFFdEFqQ1hGV2trLTBkQl9pdldlOEFYbXc",
        "reply": {
            "author": "Handroid",
            "content": "Thanks Lee. If you have any ideas that you would find useful in the app please don't hesitate to contact us.",
            "date": "February 6, 2016"
        },
        "star": 5,
        "title": "Awesome"
    },
    {
        "author": "Tim Weichman",
        "comment": "1) Bookmark feature is buggy. Made 22 min recording w/29 bookmarks. The last two wouldn't play. After trying them, none of the other bookmark tracks would play. 2) Stopped recording after no activity at the 15:20 mark. 3) Widget has no way to pause recording - seriously! 4) When you play a bookmark, pause it, then click play again, playback starts over at beginning of bookmark instead of where you paused it. 5) Timer display scrolls off screen when you have &gt; 10 bookmarks. Poor app.",
        "date": "July 9, 2015",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRTJHMTJOTGs0cXBZTE9NZnBWYTM1QzRTUkhrXzI1SDlqOVU5V2h1WVlLbUI4ZkdRSnBXODVKNVBqY2FTV1ZaTEdJZXR0R2EwM3BRd3c",
        "reply": {
            "author": "Handroid",
            "content": "Hello Tim, We would like to understand bugs 1 and 2 you describe above better. Would it be possible for you to email us details of your device make & model. For items 3 - 5 we'll investigate addressing these issues in our next release. Thanks for your feedback.",
            "date": "July 18, 2015"
        },
        "star": 2,
        "title": "Buggy and needs user interface enhancements"
    },
    {
        "author": "Joseph Mwila",
        "comment": "Love it..it's so easy to use and does what it says on the tin!",
        "date": "July 9, 2015",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRVFlYzU0UDBKVnpNUUUzRkVrSjlYWFRhNDhGc3ozdlJCTkpzZ1VURmJrdmdNTnh4MC1ud1E2TUpDLTN0MldFamh1cS1lcTU1TnVNb2s",
        "reply": null,
        "star": 5,
        "title": "Wonderful"
    },
    {
        "author": "Nick Hackett",
        "comment": "Intuitive interface, small file size, easy to place bookmarks. The perfect tool for research interviews. Even better, the email support from the writer is quick, extensive and very helpful. Brilliant!",
        "date": "March 12, 2015",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRlBRTFhFS1JaZHRVWmt1c3dnZzJ0SEtCUEU4dEQ5dXBWclhZOGhsSTVGYXFHVExIV0M0UURFcjVqazZrWjlRNl93Ym8zYl9yNVBRTmM",
        "reply": null,
        "star": 5,
        "title": "Research tool"
    },
    {
        "author": "Darren Holmes",
        "comment": "I love the interface, control, everything... But it would be awesome if you could mention what isn't permitted. I found out after buying that sd card recording is not possible.  I'll come back and rebuy if this changes, because I love this app otherwise. Best wishes, d",
        "date": "November 23, 2014",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPSFZLVThqanl1U3M0STB3dTdDZl9MTjFLU1kwV2dKOGtKUVhza0dscTRlNnBGUU9zdWhId0U1eFdTeFRESDJQWExSaFlHZ1F6R0lqb00",
        "reply": {
            "author": "Handroid",
            "content": "Hi Darren, if you are running Android 4.4 (KitKat) then apps are restricted to where they can write to on an SD card. If you point Dictomate to store recordings at: SD_CARD/Android/data/com.handroid.dictomate/files/ this will work. This folder is automatically created for you.",
            "date": "November 24, 2014"
        },
        "star": 1,
        "title": "No SD card recording...."
    },
    {
        "author": "Kenneth Edelstein",
        "comment": "I had an issue with how to configure the program to meet my needs. They answered my issue THE SAME DAY. I wish there was a way to mark this for a hundred stars. THANK YOU.",
        "date": "November 16, 2014",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRS1KU2w2dHJMQy1zc1FvazN1aUlKV1pWRktXdTgxeEdWeDFRTVFOUWw1SlF5TkdGb1RDNTRET3RpU3MxcmRIUVEwdlBsTXY2UjROcm8",
        "reply": null,
        "star": 5,
        "title": "Amazing support from vendor"
    },
    {
        "author": "Stu Hughes",
        "comment": "Great little app , so useful when revising for exams",
        "date": "November 2, 2014",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRlVFX2FaUC0wUzlaaVp0NklDc0FqM2dSbTVOZGVGeV9ZWEdtUnhrSnp5RmtLX3JWbG9XSExnY1JQSGFvT2Uyc0I3Y1JZVWNESS00S3M",
        "reply": null,
        "star": 5,
        "title": "Great !"
    },
    {
        "author": "Ben Baker",
        "comment": "Brilliant app, I tried a few audio recording apps but the recording widget makes instant recording possible and this app wins hands down.  Also regular updates, good job!",
        "date": "October 21, 2014",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRkdNc2R2bC1SQ2pMN0Nkc2duUWpBSmMySVNjYnFsZjZ4eFVRQUpfRlhhWFZ5RnZBTk05WFRxb3dnc2VFODNBNFdmSXBWbXJHZXZCQ2c",
        "reply": null,
        "star": 5,
        "title": "Dictomate"
    },
    {
        "author": "Helen Bullock",
        "comment": "Just what I was looking for, has turned my phone into a fully functional dictaphone at a fraction of the price. Even has a widget too!",
        "date": "February 19, 2013",
        "permlink": "/store/apps/details?id=com.handroid.dictomate&reviewId=Z3A6QU9xcFRPRnpVaE9mLVhRZFBXUHRUY2o2b0JzQzd4M29BSjduQ2NacENmd3dNb1lfVE1jRUZZQVg0cm9SeFFsLU8wS0IydkFFbHhTcWxBbGNVZzA",
        "reply": null,
        "star": 5,
        "title": "Perfect app"
    }
]