[
    {
        "author": "Keegan West",
        "comment": "Okay, in short it's great. But a few things. Even though it has family buying available, my own tablet seems to need to purchase it, even though I've bought the full version? Furthermore, the Android TV app is buggy. It can't access video first time round, but if you leave the app, and go back in, it reverts back to a phone mode and it works, but the whole UI is screwy as it's the phone version,  I've lost the nice looking TV UI. As well as that, the picture  I in picture mode doesn't work. Ionly bring this up because you seem to respond to reviewers, which I think is awesome, so maybe you could fix these things? Even if you didn't, still a solid app! If you did fix these, it'd be a five star from me as it really is nice",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPSEEtUkRXLXgyX3U0RENsQzE5NEF0cThoR1R6OHpBajZqcWFGcWJITWcwX2FITm5CYUE4VklnaW0tZzRGMjRHeTh0MWxONUNMZV9BMlRmZGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you for contacting us! It's because you are trying to run a mobile app on Android TV. We have Android TV version (https://play.google.com/store/apps/details?id=com.tappytaps.android.babymonitor3g_tv&hl=en) that you can get for free to your current Android version. Give it a try and let us know at support@tappytaps.com if everything's okay.",
            "date": "October 9, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Barbara Vreede",
        "comment": "Excellent baby monitor, I particularly love the lullaby-option! Unfortunately there is no way to play the lullaby without connecting to the server, and sometimes the volume on the baby station gets turned way up without warning (or the option to adjust the volume from the parent station). With these things fixed it would be 5 stars.",
        "date": "November 6, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRXA3ODVRSXJISE9UUkZJbldJbmJ1czFVTWxfUXhoNDFldDFVbkhJd2p2SXR5ZVczNTlOOXNuLXVCNXZ3OHhhZG9LZktCVVU5SGFmRkZnekE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Barbara. Thank you for your review. Do you have the latest version. There shouldn't be any problems with lullabies there. If they persist though, could you tell us more about when it happens and what devices you use? We will find a solution and help you. Please write it on helpme@tappytaps.com. Thanks.",
            "date": "November 7, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jin W",
        "comment": "It's great, but would love an extra safeguard to preventing torch turn on accidentally. One bad tap is all that's needed to wake baby. Would be best to had a slider switch to enable all transmittable sounds/light etc",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRVBSZlcyQ3Q1bGJDZ1Rza1dUaFpERlA0b2lhTlBuaDRRWVBSZUlXVkNCZW9pN3VoQkFaT3djenJYNF9iU0tTVnl3X2JfSHFXRXcyY3VHRWc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you for your review and your input. We'll have a look at it.",
            "date": "January 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Chris Kyungwoo",
        "comment": "It works; however, the device on the parent side gets hot and loses battery really quick even after I close the app. After I uninstalled the app, no more issue on my phone. Edit: Reinstalling the app fixed the issue.",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRjBDSGZmeXk2MlhueGN3UlFDT19NeUJsQUd0cnFIbzJEdVViQTdzWXpRQTNVeDllVEw2SmE3bW9uZzBheDRrUnZnYlNBblZGdHZ5NmlZM3c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot. I am glad everything was dealt with.",
            "date": "January 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ashley Sommars",
        "comment": "Return your expensive monitors to BabiesRUs!   This is a purchase you won't regret. Used it for years across many different devices and iOS/android combinations.",
        "date": "October 30, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPSHIzazFGZWxrMUFaam1ZWlhvY1FvMzFpNWxlQW5lUms1N1NBajNvQy1wRVlyQVY1MlFlZ0h0THFLUWlYYWtDOGtoLWVibW93RnhLXzlWR1E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot for your review.",
            "date": "November 1, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ramona Paunache",
        "comment": "Definitely worth the buy. I use it between my iPad and Android phone. The connection works well, I love that you can download your own lullabies and control them from the parent station. One thing I will say that holds me back from 5 stars is when I turn on the video from the parent station, the volume of the lullaby playing on the baby station BLASTS out loud usually waking the little one. Both apps are up to date on both devices. But other than that definitely worth it! I love that you can have multiple parent stations too! Even from work my husband can tap in to see the little one schnoozing.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPSFVnWWJ0cnQzUEZBZDdOMkItS28xMDBrNmprZU92dFBVZW50blhuWHdqNTJacUVTNnZIZklJd0VueDFTOVFxUUNpaXNiWGhPbVhKMkJmR1E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Ramona. Thank you for your thorough review and thank you for a very good point. Right now it is necessary to set up the volume on Baby Station in advance. We will think about the possibility to adjust volume of Baby Station from Parent Station as well.",
            "date": "February 1, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Dan Budai",
        "comment": "Overall I am pleased with the app until recently. Somehow it keeps crashing (constantly) on my wife's phone and last night our kid woke up and we did not realis immediately. Not cool. P.S. yes we reinstalled it and it is a Samsung Galaxy S8",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRjRHSTVwSkpWbW1mbUJEbFFJYW43b3pXY3htelVqOE9DcW01Q09xS0VjVzNlMWk1N25hc0FnVjhFNURYMXJMdGtxaENSbzhPQVNIWmpZZXc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi. I am sorry for your troubles with our app. Could you please write us on helpme@tappytaps.com and specify when the crashing happens? Is there a pattern? The more we know the sooner we'll be able to help you. Thanks.",
            "date": "January 16, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Analecia Qarau-Francis",
        "comment": "Soo handy! Especially the talk back feature, genius!  One thing that would be nice is a zoom feature (you did it, love it!) Other than it does disconnect sometimes but it's a really good app .... The new skin tone feature is cute, you should have an age one now so the baby can look like a toddler",
        "date": "November 3, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPSFBILUhKMUthQlFadXpaUkhMcVc0N2c5RjJsWGdfTzFibVBEZ1pCblQtaFNRYW9MOHNQVVBXUDQ2bkRyc0VyM2VZZG1WU3oyY2h6ZHFOQXc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Analecia, thank you for your review and for using our application. ♥",
            "date": "February 22, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alex Green",
        "comment": "Great app. A few issues for me though, 1: the Android TV app video and pip doesn't work on the TV 2: I have it on family sharing on my Android account for my phone and another tablet. Paid for the app on my MacBook and still have to pay for it again to use it on an iPhone which has the same Apple account details as the MacBook which I think is unfair as it's both the same platform. Had to buy for Android, MacBook and now have to buy for iPhone when it's all the same app and company. Glad to give 5 stars if these things are rectified. Thanks",
        "date": "January 15, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRl94QVg3V0RJUWh3MHhRekVGcDVPcWowTGZmempPMDZRX0pKM3UtVlVpWmo3VkdyYmxXTE5mRlV2VTBvWnpNeHNYNEVMWkxWMWZoUk5PZkE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Alex. Thank you for your review. Unfortunately for now the user pays one payment per store the app is downloaded from. At the moment we are considering a cloud version of the app that would solve this issue.",
            "date": "January 16, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Steven S",
        "comment": "Constant disconnections even with just audio, maximum stable connection I ever got was 3.5 hours. If you can live with that great, if you can't, I'd suggest looking elsewhere",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRzN5aVljQTdpZi1uX2pQZ2FPVVpPNDNERkJYZ0Y0YnV0czBfaTJwR0hWdEZoNlhhTlFEZk9MRVd4ZDRIUnZ1a3o1YzF4MUQwSHRCM0U5dlE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi. Sorry for the troubles. If your problems persist, please, contact us on helpme@tappytaps.com and specify when the problems occur and which devices you're using. I am sure we'll be able to help you. Thanks",
            "date": "January 22, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Justin V",
        "comment": "Super awesome!  Simple basic functionality for sleep-deprived parents,  but it also has some really thoughtful features tucked away in the menu like an alert log (including playback) and sensitivity thresholds.",
        "date": "December 7, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRWtpbk5MUTZycUhXMDJiNEhzbUV6Y09Rdk5IZXVyd1NzdGVMTUxoTHA0ZFlqSmdTR1AwWldRVnRIUGFkMHJ2cU1reXQzcE0yZU45WmlWT0E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot for the positive review. :)",
            "date": "December 11, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Iacio Umbra",
        "comment": "Great app.  I use it to monitor my dog when I'm at work.  From that perspective it would be nice if you could export the activity log so you can see if the pets behaviour in your absence is improving or deteriorating.",
        "date": "November 1, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPR1p6WVhGd1dTVVhCc3JtTmhTYmdhUTBIamFvVmlBQXE3UWxoZkIzMTREU01vRGRsVS1NazJpdjRZUUYtbm1mTmZPYl91MkVXeW1PLWctb1E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "You know there is an app called Dog Monitor (www.dogmonitorapp.com)? Check that out. It doesn't do what you're implying yet, but it is definitely something we're thinking of adding as we are now trying to adjust the app as much as possible to those who need a help with dog separation anxiety.",
            "date": "November 1, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tomáš Heřmanský",
        "comment": "Last version is crashing upon every launch :(. If this won't be fixed, I'll have to ask for refund.. Previous version was fine",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRXU5Wktqb3NUb2tfUUlETzZsZ1dUa0NtdllyZHVCMS0ydjZINVpTdVpCeVNaYkt5cUFiLXNDM2JUQmVRR1c5ZXdCS2JwYS1PM1VGaWV1M0E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Dobrý den Tomáši. Napište nám prosím na helpme@tappytaps.com, určitě vám pomůžeme. Zajímalo by nás především jaká používáte zařízení.",
            "date": "December 5, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Rikin Shah",
        "comment": "I love this app bought it for iPhone and android. One thing I would really like is getting activity log as notification on Android. It already works that way on iPhone. It will be super useful when app is running in background to have notification of activity.",
        "date": "November 26, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPSDJMbEpNMGJfT3pzeThsR0dlUVlpQ196bHdZYVk2WF84VWMtUEp5NkpIUkh2UElhSXNuTXNhbXQ2YnYyMW83ZHRRRGVRcGd3M1lmSmNyS2c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Rikin, thank you very much for you positive reply. :) We'd like to help you, but right now, it is not possible to do anything about the notifications on Android. If something changes, we'll be happy to integrate it.",
            "date": "November 27, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Stéphane Benhamou",
        "comment": "This definitely is the best baby monitoring app that I tried. Good mic sensitivity, nice features, and mostly, reliable because it lets you know and reconnects very fast in case of  disconnection, going almost seamlessly from wifi to 3g/4g. Works also super fine between iOS and Android (baby station on iPad, parent station on Android phone) Thank you from a very attentive dad!",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRnpWRkhRWjhTRUdrcXRjaU1KQXJNelJmWktWbWV1RldKd21leFlqckZFSE5KOWV2TkFfY19mR29LcVVzOVRnWWZjUjZvUjhLMmJXOTRkQWc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "We thank you very much for your thorough review. :)",
            "date": "February 20, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Joel Snyder",
        "comment": "Fantastic app for traveling. We set up our iPad and Galaxy Tablet as babystations (on wifi only), and was able to use one phone to switch between each station to watch babies as they slept as we sat outside our hotel rooms without worrying about being out of the usual limited range offered by a typical baby monitor. The feature allowing us to turn on and off the light on the tablet was fantastic for night time.  We have already recommended this app to many people - a \"must get\" for travelers with kids!",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRlFGR0pNcUNZUThqT0JiRWR1VFRIZkZXbkJ1cmUzcEpFSVhqbVZTRXNWTmpSaU9BUDB5aDhEVl9UU19ITzdqSW5FOWhRaHdZN3BENm44N3c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot for your awesome review. It is much appreciated. :)",
            "date": "January 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "cyndi Archer",
        "comment": "Very good app.  Works well but lately the device i use for the baby keeps going off and baby isn't awake",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRWJNQi1pcHl3NWpLX2NDUnNzUzJBc0dFWmpxOE1fZTZsZlI2cnE3dmNDSkJCQmI2Z0dnRWRZUHVWenBoY3lDclVOUTR5RUhVTEJXcExjYkE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi. Sorry for the troubles. If your problems persist, please, contact us on helpme@tappytaps.com and specify when the problems occur and which devices you're using. Thanks",
            "date": "January 22, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Kevin Lynch",
        "comment": "It is very handy, expecialy seeing as i was going on holidays and could use my phone and my wifes to monitor the baby but then i discovered it has to send through a network and wont use wifi direct so i went through all my phone data without knowing. I like that you can acess over the internet but it needs to have a wifi direct or bluetooth option that does not require internet",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRWpVQnZQRU5FeDROdElXdGxKMnBTTWNGWmF4TF85OTk2d3RpZXA1ZU1wZGQzdGc4TXdhb3JyY0hRQjVmdlNMQWVEdlctdmhCTHAwRldCaHc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Kevin! The app requires LTE/3G or WiFi in order to work. We don't plan to adjust the app to be able to work without the internet for now, but thank you for your suggestion.",
            "date": "October 30, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Gulfraz Raja",
        "comment": "Its gudd idea but its stuck too much i can't seè my baby properly so not impressed",
        "date": "October 18, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRUFMLTZZUXFVRGZaczdDYk9aVUNhVkVvSnU4LW1McHFxNGZtSmZiODdIX2ZhS1pBMTZaVy1SMWZzQ3o2MU9NUUE4bHRjODZkMzNEY3lXRmc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi, we're sorry for any inconveniences. Please write us at support@tappytaps.com, we will help you.",
            "date": "October 19, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jessica Perkins",
        "comment": "Love it!! With all the baby necessities I didn't have much money left over for a new or used baby monitor. I decided that for a few $$ I'd give this app a go. It hasn't let me down, and I use family sharing to make it available to all of bubs carers. I would highly recommend to any new parent.",
        "date": "November 5, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRkRqNFF2c25IVXVua0Fmd3pVLUlEeHV1Z3lMd3R4ZWFNR0prMGh1YmFfRFhIdVYta1E3Q0huaDBiNjFXX0V2bVN0anZUeC04SHFPMFZwbnc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you very much for your review. :)",
            "date": "November 6, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Holly Atkinson",
        "comment": "Great app to listen in on my twins when I'm out in the garden. Only one request, is it possible to have the app running in the background with the screen off? Similar to how you can listen to podcasts or music with the screen off. Would be a great battery saver. Thanks for designing such a useful app 🙂",
        "date": "November 26, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRVdac05YVEoyT1pTb20xTWRxLVIxR3R3SU5OdFlXUzV6b1czZDNfVlVsU2lCRlJTZWVMaVQ4OXBZRl9vVWlSdWhmVFJBWUJDWTJ5QkJVR1E",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hi Holly. If you mean on Parent Station than you can do that. On iOS it sends push messages, on Android it vibrates if there's any noise while in the background. If you mean Baby Station than it isn't recommended to put the app in the background, some Android devices don't support this option at all. With any other question, I'm ready to help. :)",
            "date": "November 27, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Tamilosai M",
        "comment": "Really like it. I would love it more if the video can be Chromecast'ed to a TV. Nice to cast it to a big TV while I'm working on something else in the phone. Also the option to choose baby or parent station should not be asked every time. Please save it and use it as preferred option. Thanks.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRjhYTDBDNXkxNm50MHYtcmVFcF9xWXdVdm9rbVJoaXVIQlB2d3RpUEJlVGZWRlhpQk1xazZJc2h4ODZsMUVRYlBKTnpSTW9RcG9COTl0VGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you for your review and your input. :)",
            "date": "March 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Cecilia Hine",
        "comment": "I can't keep it connected to monitor longer than 30 or 40 minutes. It defeats the purpose of having a monitor if I have to reconnect several times each time my baby naps.",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRVZJLVJSQ1AxVXZqb2dYVmxabmxpNXVFLU8xSUM4ak5BeVZRRlZTR0czY2w3R0c2QUJDVGJFQi1QRmR3T1pGaldSQjdkMVNBTUVzOFZoNGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Cecilia. I'm sorry for your troubles with the app. Please contact us on helpme@tappytaps.com and specify which devices you're using and what it looks like when the app stops monitoring. I am sure we will be able to help you. Thanks.",
            "date": "January 16, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "David N",
        "comment": "The app is great. No doubt about it. Has almost everything you need compared to a baby monitor. In future realeses I would like to see Spotify integrated for lullabies as I already have an account with them and room temperature. Maybe air quality? Great job!",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPR3pDZDBIWEVsSVV2TlN5SUNzYXFqc1pVbk9NN25jbTZrTEh4bjdfdTMxeE5HaXk0Sm5Hc1pLWGZPVGI0UEZKMG41eUlVTVV6T0NqWnU5dFE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot for your ideas. Appreciated. :)",
            "date": "January 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alexander Geniatov",
        "comment": "I like the idea, but my baby station phone (redmi note 4) vibrates every time I turn on video streaming on parent tablet, it can wake the baby up. Is it possible to turn it off?",
        "date": "November 2, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRjJzTVptcFQ5cU94Ym92aE9GYUktVUxPWE9ZTHozcl9uaGREM0p4U3pUamFxampEd0pINGdCdUxyTjR5RGRyLWVEWklCalhjQ0RBS1c2c3c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello, Alexander. I suggest you try to go to the phone's settings and in that the camera settings which should allow you to disable vibrations during using camera. We cannot do anything about it in the app. Hope it works. If you have any other problem, don't hesitate to approach us again.",
            "date": "November 6, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Tim Dressel",
        "comment": "Great substitute for the $100+ monitors you can buy at the store.  It works seamlessly between Apple and Android devices.  We love it, but after using it for over a year, I have found a few things to be aware of: -Be close to a power source. This thing will DRAIN your mobile battery.  I installed the app on my Mac to save my cell battery the abuse.  -Make sure you have reliable Wi-Fi. The monitor only works when connected to the internet and we've had a few cases where we lost connection and woke up to the baby screaming from down the hall (poor kid!) -I JUST learned this today and it's what prompted me to write the review- THE APP SAVES ALL ACTIVITY!  Every time you start monitoring it records every noise made and saves it to your devices memory.  There is no auto-delete setting. I found this because my phone mysteriously ran out of memory and I found 2 GB of it was used by EVERY SINGLE SOUND the baby made on the monitor over the last year.  Devs, if you're reading this , PLEASE patch with a \"delete activity log after __ days\" setting!  If you don't mind dealing with this sort of stuff, this is a great app substitute for traditional monitors. We love running the Parent Station on multiple devices, being able to check in when we leave him with a sitter, or keeping it running if we're working outside while the baby naps.",
        "date": "January 16, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRTh4YnhSNjZSckdWYlVkOUpLRFdSQ09oREYzdE5RSnpUODBHXzZPeF9YTkk5N01yNjlPMXpBbU1qYjAxTmFJWFRmWWc1NFhXczBDelctbnc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "We're reading this, Tim. :) Thank you for your review and your inputs. We'll definitely have a look at it.",
            "date": "January 18, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Elizabeth Webb",
        "comment": "I love this app, got it originally for when we are visiting other people's houses, use it on the tablet and phones. Now also used in the nursery because the original baby monitor is in the toddlers room.",
        "date": "December 19, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPSENBa2tDZjZhU19BUDZ3dzNWdnE0YjRlUy0yb2Rjb05tMW82dFpvelFnMkJTS1pCQUprWndJU1JNRXU2Vzc2VDZwUl9ON1FUWWNjMVRsZWc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot, Elizabeth. :)",
            "date": "December 19, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "dylan bennett",
        "comment": "Pretty good for a $3.99 app. I like that i can login,  hurry up with chrome and android plz!!",
        "date": "December 9, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRTV1RE4xV1pVNmRRdlBwb3dBMTJmT1MtQ3BZM1Z4TWhfaV9PYjExTDlKbEUtNUYwZ0dXNGlIeGNkWkVIUGk4YXFqTzNabC1JdmZXM3d2dWc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello. Thank you for your review. Here you can find which devices are supported: http://www.babymonitor3g.com/. Windows or Chrome versions are something we have been thinking about but are yet to be realized.",
            "date": "December 11, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Rich Singh",
        "comment": "Just great. Easy to use and simple to set up. Highly recommended.   On a side note, any way to get multi view with out switching the selected device. Thx . excellent work . keep it up.",
        "date": "October 31, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPR0VWa1ZsWXNFLXRfX2ZiRS10SXN6U090NGc5azFUclE4OUFIbFVUN0Ntak1GUG5hN2VBTlg5ei14Si1LN0dUc2RFbVNHY3N2OTMwQ3k4dVE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot. We'll do our best to maintain the level of our work.",
            "date": "November 1, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alice Sawyer",
        "comment": "I use these baby monitors for my little one and they are fab, beats spending over the odds for ones from elsewhere! Highly recommend",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRWx3V2Y4bDRUUHp3eUZ6TUJhRGZMaEVpYWVUVnQxMW1uU1oyU1JPRFNwaHpsSkFzTzV1WE1selU4LVZleW5Xd3NGVkc0aXoxdmI2X182X3c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you very much for your review. :)",
            "date": "December 12, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Bastian Passchier",
        "comment": "Great app! You can adjust the microphone and speaker sensitivities and even use video if you want, and all for a couple of Euros",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRkR6T0NPVW0wdGNseWp2WVMyZXlWelE5VG9xcmp5UUFZeVVIMU5BdWFBTUkyMFpQVjFNbk5scW1OTE1URVZrSlVReUxNMVpJUWhGVS1aS2c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you for your review. :)",
            "date": "February 5, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tanith Grant",
        "comment": "Uses far too much data",
        "date": "December 24, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRnpiS0IzZUtlUmFGUDNXdnZHNVR5ZjNLRER0dTB0RTVrX2tTdHlFd3dQZ0xtMEt3YjlGOS1JR2hnVlJJUEZDTmpEb05RTW5LLU1aUzZvMUE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello. Thank you for your review. The app works on wifi as well and we have optimized the data usage as much as possible.",
            "date": "January 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "painterkatelyn katelyn",
        "comment": "Great monitor! No need to buy a standard one. Works great between my iPhone and Samsung Galaxy.",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRWlzMllnaWxKYVhqcTFyQUp3WkVxTk80bnk4QVBIZkgyemJUVWhNcE5tVDFHQ3ZNbkVYRXI3ZWt2THBJWUhFcW5uaDYzMGJ1N1ZmYTBSaGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you! :)",
            "date": "January 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alex Gryn",
        "comment": "Can't watch video feed. Only have option for sound and photo. Why?",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRm5GV0RxVDlzSEJaX1JIVUk1bjV5UjM0cV9qaXlPVjZrTzFfdVFHZWdXZThqWE5sZEw1TzJtbWdKMC1vSldiNFctR1ZoandNN29wellueEE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Hello Alex. Sorry for your troubles with our app. Please send us to helpme@tappytaps.co which devices you are using for monitoring. I am sure we will be able to help you.",
            "date": "January 2, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Debbie Smith",
        "comment": "Great app. Works perfectly for our baby and handy if you have a spare phone. Would recommend.",
        "date": "December 25, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRnlIS2xTa2RpQm5OY2d3ZmlVSGpuRUhIQjEwalo5eFFFVldsMndrWkhSdUlLVFhyMWc1dFFPbGduNHJwbDhSUzczZjJTTUM2NzY5ZlFBN2c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot.",
            "date": "January 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Victor Bevilacqua",
        "comment": "Love the idea and the app works great. Cant see anything when the room is dark.",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRjIxdWhnME9wQllYN1JKWEVuZVJseEx4UjBXNnFsT0l6TGlxeWxWTTlfeGNUNVY3OTBSUlVObllBN2JSR0RTZmc5b0tmSGFrc2hVU2VVX3c",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot. :)",
            "date": "January 10, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Charlotte Hardy",
        "comment": "Perfect use for redundant phones! Doesn't miss a beat",
        "date": "November 13, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRjlGUnhBRnluMmFCMzRwSy0yUVdSVkFNR08xaTM1MUZoM28yU0hPcVF2emxRODBBQXhqYnV1Qjh0dXNMZGNJZGJjMDBjWVVTZENIQzBlNGc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thanks a lot! :)",
            "date": "November 14, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Niklas Melin",
        "comment": "Lovely app that is exactly what it says.",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPR0NMR1NyREg4OFVNUlZQeEc0OXJjRDc0U3NDcWV3eW1RTThPa0Rma3RxcVlDX0g3VzdIX09aQmVBSzk2STlZNEJPYmVjRTg1ZkFyTzFnTnc",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Awesome, we're so happy to hear that!",
            "date": "October 11, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ali Hood",
        "comment": "So good, already have the hardware in phones, just use this excellent software!",
        "date": "October 19, 2017",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPR0tyQ1pYVGFUOUVwVlo1NVZQS1NNYmFHZldkQ3haWHd5RDNlZGF1Mm9EYXZuRmFCTEhfcnVhRHk1WjNuaGo3NUNxVTd4NHR3M3Y3RFdCUUE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Awesome, thank you very much for your review!",
            "date": "October 23, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jason Ivers",
        "comment": "This is great... I use it with an old phone no longer in service.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.tappytaps.android.babymonitor3g&reviewId=Z3A6QU9xcFRPRlBOQjRnei02X0lwam9VV1dLdV9RNVVXUURaV0Q1SzF2QzJNQUJyUGRCTDhZaUhkNVVzQ0NZYjdmeDB2TUZGMWdYZEZGT3VrbHdkUVMzcFE",
        "reply": {
            "author": "TappyTaps s.r.o.",
            "content": "Thank you for your review!",
            "date": "February 12, 2018"
        },
        "star": 5,
        "title": null
    }
]