[
    {
        "author": "William Lindahl",
        "comment": "Really disappointed in this app.  Unreliable.  It frequently fails to operate, leaving a message that says \"server busy\".   When it works, takes way too long to start your car.  It won't warn you if your doors are unlocked, you just have to wait, seemingly forever, to find out, then you have to repeat the start command.    The absence of a fob-based transmitter is a MAJOR deficiency, in my opinion, especially for a so called luxury vehicle.  It only takes a couple button clicks and presto, car starts.  By contrast, this web based app is total aggravation.",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRjdCSXlQSlBvX2dWRTF3TVdUeHZwOF9ZdlhVTVFSbUpnc2Q3YW9OZ3ozUHpVZURmZXduTW0yeHFQNGE3dzFwSDg2QUs4Z3hmajcxeTl6OUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Johnnie McDuffie",
        "comment": "I've had this app since car purchase 2.5 yrs ago  and the only thing impressive is the apps look.  The app has many flaws and yet they do nothing about it. If I was late with my payment they would be all over me so why not give the paying consumers the same sincerity when ensuring this app works consistently. Please do something soon as I will drop this app and get my balance paid.",
        "date": "May 4, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSEJJVUNpLXFxR2E1dGFIa0k4SDNWbE5jOEVXZkhfdXN1TW9NbFJsQlJhdFNyTWJWN3V2cUlCZG1OMWk1V1RUOFNFbnQxaGFuVG9BMklSYWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Alex Kudinov",
        "comment": "Horrible idea to take over my calendar events. I don't need calendar reminder from Genesis app, I have a calendar app for that. In addition it's a battery hog, and that's on a Galaxy S8+, which so far (before installing this app) showed stellar battery life.  OK, the problem with the calendar is solved by revoking calendar privilege from the app. But it's completely unacceptable, that the app doesn't even wawrn the user that it's going to read it.",
        "date": "October 14, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPR0piNThrVkRGMnlDZHZZOHRJZUxHMjRLRkJXWDlUY2ZKRlIwR1ZuYlFKeVdEallqbzJoX25hakRBRFBMUTRlOGhPUzVjbzNzc0hmZzF5eGc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jeffrey Cohen",
        "comment": "The app does what it says it does. I've had no problems remote starting or licking my vehicle.  The main issues is it keeps my phone awake and drains the battery constantly. The only fix I've found is force stopping the app after I've used it. Otherwise it wake locks.",
        "date": "July 31, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSE5HWThtUXBSWDV5aWtQYlNZWUQtU1BVdDlkSGt5TmJTdDVKTFM2UnZ3QVVkQVJKMVNMZDlxQVhHNG03M1Y3U29mOGdPNW5fQjVuNm9tbHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Corrie Spaulding",
        "comment": "The app itself is great. It has widgets which makes it super useful. My 1 star rating is because the Android Wear app doesn't work at all since the Android Wear 2. 0 update. I was hoping they would fix it but they have just ignored the problem.",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRUpwMXBQNEVLVUNsQV91Tk1RZVhjRU5Kc3hOSkpiOS1rVXRaVU42ZkNrbmxoZEdqbWpnQnh1X0xIaGluOGd6ZkVNY3hIcldVVUEzaHlpaGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Robert McGuire",
        "comment": "I heard Hyundai received notification about a vulnerability in the Hyundai Bluelink app. Does Genesis app have the same issue?  Hyundai Motor America (Hyundai) was made aware of a security vulnerability that only affects certain prior versions of the application. Upon learning of this vulnerability, Hyundai promptly took immediate steps to remediate the issue. Hyundai has released an updated version of the application that eliminates the vulnerability.",
        "date": "April 26, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSDlwd3ZNVGtMT2otSE1CTXBaLUF2dGx1Z21WOHhfdHA2MlFpb2ptTGNaQkdGc0p0RTZYNnpNRS1qTC1CLWFaWFhNYnFaTVlrNHNSRnBFMVE",
        "reply": {
            "author": "Hyundai Motor America",
            "content": "Hello Robert, glad to see battery fix is working for you! Unfortunately Galaxy Note 4 is not an officially supported device yet, so you may experience stretched images. To prevent the tutorial from popping up again, make sure you have \"Do not show again\" box checked on the first screen.",
            "date": "November 20, 2014"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Reji Alex",
        "comment": "1) The concept of the widget is great, but execution isn't.  Why can't you set default temp setting as well as whether you want defrost on or off during start?  2) Why can you turn on front defrost but not rear?  3) would be great if you could turn on seat warmers /coolers via the app  4) widget icons don't look very good.  Horrible battery drain if you don't kill the app after use.  Android Wear app works fairly well.",
        "date": "June 20, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRXRnUGc3OEdzSXBrOU9Ca0lwckdOWVZzdlRvaVRRYzkzOWQ1RTM5c3pOV00yMDRhQkk3V1Fja2Y4Q2hlNEYwcktPS1JISi16WVdyeXFhS3c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Eric Ibison",
        "comment": "App just kills battery. Would be great if it knew the status of the car as requesting an update takes 30+ seconds. Would add to the battery drain though I would think.",
        "date": "December 28, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPR3NHMlpCZGFKajVMS2lZa3pwcTIwU0JObFZOS0M2RHEzeGJJMUo4OElzdTBOTmVrZmNZbkR2alhoWW9FMFdUcTJiUUJGNW1hcEozSl9naXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Steven Cook",
        "comment": "Phone app works as expected. Watch app is worthless to me. It opens fine and acts like it will work intil after keyinf in my PIN, the it gives an \"attempt to invoke virtual method error\" and fails to send. I have uninstalled from both phone and watch and reinstalled and fully reset warch but still get same error. Neither device is rooted. Phone runs Android 7.0 amd watch runs Wear 2.0. If I install the MyHyundai app, both phone ans watch work fine. Just need the watch to work, much easier to twist my wrist than fumble through my pocket.",
        "date": "July 6, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRUFIR21CczFhTkZzSFZFcDlpeDRXSjhUaWZJbDlwZGVfNHdDSDFCNnJIcE1sUDE0QVhhTy03V0lYMTliNUpWeGRtMWFqTVcwNkV0NkhXSUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Carlson Cox",
        "comment": "So, this is basically the Hyundai Bluelink app but Genesis branded with battery drain in the background and an unnecessary hook into your calendar. Some of the GUI buttons are not intuitive. The Android Wear app keeps crashing with a Java error. I have to say that so far my success rate of remote start and car status is 100% for the last 4 days. This means the system has gotten much better. Since I used it 9 months ago. But the can still be a bit of a delay in commands being sent to the car.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSEdxM2xFNS1zT3FQTndScmgtVEh1Q0FnRnVxTWt6NlJxbDNuUmxXbFFUOC1HcTVuNWhtU0JiVGFRUy1vcFlPRFBnMmZOQXgtclpTV2tkNmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Eric Gregory",
        "comment": "Always give an error when trying to start the car. As the service costs money, they should work on the bugs.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSG03N21RbV9CRVprOUcwUXE0Z29WUURnQ2xyQmJmQW9kcloyYmN0Q3lkVXhLQ3JtdXBKaVFiM2ZuMl9uZUVGR3hFUjRuYmFsOFM4NkxFY0E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Trey Carlstrom",
        "comment": "This app seems to be killing my battery.  I like to remote start but it's not worth the drain.  I will have to uninstall.",
        "date": "November 16, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSEdjUkNIZ1AwckJrQWI2VXJJX3BkUFVoY1VIVzQwOWdWSk1kOXdDYTlnem54c0V4VE1LcFVsOWFYY0ZOTk5XZlRGQkh1WFhUZGRObld4T0E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Teresa Negron",
        "comment": "I love my car, but not this app.  I get kicked out of it almost every time.  Although it usually works at first, the longer you stay in the app, the likelier you are to get an error.  I wish Genesis would perform some more bug fixes.  Also there are some menus that's don't pop up correctly, and I am unable to type. It's like my keyboard is hidden and I can't see it. I have a Galaxy S7 Edge, and I understand this app does not yet support that....BUT already the S8 is out, yet this app only support S6 and below. Come on, it's 2017. S6 was released 2 years ago  -_-  Do some updates.",
        "date": "September 28, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRzlXbHZnWDAxVTdpTmkzRDZJVnpmZHN0Yl9ZdmtUUEItTGhaMzlWN3BUMEpFNDdvNTdGd1ptMFV6RVY5X1FRd3puZ284b2JXSUcxYzNMVVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kimberly Baker",
        "comment": "I recently paid to renew my subscription, and now the app won't work. Customer service is a JOKE.! if I could give negative stars I would. Can't get anyone to respond to my concerns via phone or email. Am going to contact BBB. False advertising and theft at this point. Paid $97 four days ago, uninstalled and reinstalled app five times, called numerous times, last time was on hold for 51 minutes and then got hung up on after being assured they would call back. DO NOT BUY THIS PRODUCT! Beyond furious at the lack of communication, customer service and lack of functionality of the app.",
        "date": "January 6, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRzBjaVhvcmRfV0ZZRXZmeHU5NDMtOFA5QWhUeUR4T1M3Z19raWZWM2JZV3MteDN0Z0l1aE13RHNfYkR4N25hR1Q2dlFxLWRHb19yRFQyTGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Teri Szlosek",
        "comment": "Don't waste your money paying for remote start on your genesis that requires this app. I've had my genesis nearly 3 years and this app seldom works.  Now that the cold  weather is back,  I'd  like to warm up my car and this darn app hasn't worked once in 2 weeks! WTH!",
        "date": "November 26, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSEpVVmxGLUpSS1prT1R6alFkNkxySHZuclFWby1KcGltLUYtZHNMOUFINkRxVmhUSFdFVlFQaWlEV3R3cTNBd2xUcmJfckRFTjZod3lKTkE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Michael Cook",
        "comment": "Works great, sometimes it takes a few minutes to start, lock or unlock the car. I use the auto start with climate control the most in Fl if parked outside. It would be nice to be able to turn on the seat heaters also, not that I'd use it much in Fl. When turning on defrost it should turn on both front and rear.",
        "date": "September 5, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRTVfNFJoc1VUaDlTdmZBVnhMdVhHc25tYklIX0FXX1BJMllqMS1YMDVYY2dmOUFrMGJQZFdtSUhHYmVmZDFnUU44UERRSE9QeUhMWnR2SkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "frank mainolfi",
        "comment": "Update:the app has gotten worst! What a joke .....    I don't think it's too much to ask for the app to actually work most of the time if not always......... I pay for the service and 75% of the time I can not start and warm the vehicle,lock or unlock or even check status because (service not available at this time).also When the service does actually work it takes up to 4 minutes.i will be canceling my service and requesting a refund... Update: 3/14/17.... hyundai offered me 3 months service for $14.99 so i accepted..... unfortunately nothing has changed! Horrible service with horrible response times.... i can walk 2 blocks to syart my car faster than the service can do it. If it does it at all.... i will not be extending the term !",
        "date": "March 14, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRXFmYWVXQ2NOOHRBOU1VbTdzdnpSOFY2cVBCTDQwZWZDbHZob0NtSUJyU09LSkc0c05kemk5M0ExakFIYW5LVkhjOXZucVBETWRETHA0b1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Doesn't appear to work with Android Wear, the app crashes every time and displays a Java window error on the watch. The app opens for a second and quits.",
        "date": "September 13, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSDRQUFBtdWRaUEJoZEItTzJTc1I0bmpPSVJrMDJSb0FoUzM0dGUxcVZraUgwckRFSmFmUzdoS0dZVTBVeUxHMk1EdHhCQ2N6emtpX1l2WlE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Rudy Kazudy",
        "comment": "Give yourselves 5 minutes to go through the steps involved in remote start.   The only reason I still use this at all is for the occasional time I send a location to the gps.  That works most of the time.",
        "date": "June 23, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSG5LMHR6QkJXRnRIMXFkeEgtR3NkVy1rX2xBQ1l4eDY0M0I0WmZpdFRhOW9QOHhMRWEwNEVWZGd3aDhfd2xGeFBPaExFbTZWRmJoNnFCZ2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "wai gei yau",
        "comment": "Find my car says my G80 is 12.8 miles away! Then who's car is in my garage! Imposter?",
        "date": "May 26, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPR1JEVTZFWFR1MUlRNDFIOXlsZGhuaTZkdUs1SGlrLUI4QldveTdRQVhvenFhM3VoWW5KSG9qQ0NlaWQ2X3hyMkVNMnQwVXM4WmRzektmVmc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ron Ronald",
        "comment": "Overall ok...  I'm still trying to understand why on a cold morning I can't turn on rear defrost, Steering wheel heater and seat warmers???  Someone from Genesis please respond if this is on the roadmap.  G80 Sport. Thx",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPR0lvUU5SemRsUWo0ZTJ1enh6b3dIQzZjTU5CaXluQXcwaTJHZXJVMHY1UFZoM0hsMl9KMlh1Mnc3bG1HMW91SE15VGZNakxkcXdqYll3Vmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Scott Plamondon",
        "comment": "Out of date and posing a security concern. App needs to be converted for new version of Android. Also interestingly enough it requests root access...",
        "date": "May 18, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSHpCaVpRWFRuVjhjMnJmb2xXY3JrYnpoOGVOUVhPeDVtdW40aU9nMXBnamJaX3pZYXk2QWhTdTRrdlhTYnVqNWFXY2xiVlZ5T2UzcXFfc3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Brian Hanna",
        "comment": "App works well, but is a large battery drain even when not in use.  Tried optimization with android, but it just keeps the phone awake anyway.",
        "date": "July 6, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRld5TlZ4bHJNZ3NtUE5XenpLbGh1NFBVN0x1OUJFWnBTVEJ6TENQeWE0dFk1bkkyTE83UXpYMGI1VU9iOUh0a0s0Zm4zWHVBajIxak04T0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jaavid Ali",
        "comment": "The app constantly stops working.  Unreliable!  I contacted genesis but they are just as useless.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRXVhMHBaNFAzRHZaYk5NYUtZLTFqWThlS2NaVUlObjFSZGFXRmRTQ2R2aW82clpJYmJKU01hYXBZcUF5NGVlWDNXTXBCdGpiYzd5bVo1RGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Thom Childers (NASE)",
        "comment": "I mostly like this application on my phone...Haven't really had a lot of issues with it.  Had a couple non-starts last year, but working every time now.  However, when I set it up on my watch, it worked for 1 day until the Android Wear 2.0 update was applied.  Now, every time I try to do any of the remote features, it throws a \"void javax.crypto.cipher.init(int, java.security.key, java.security.spec.AlgorithmParameterSpec) on a null object reference\" error.  I have tried to uninstall/reinstall, clear cache, reboot phone and watch and it always comes back to the same exact error which makes me think there is something wrong in the code...especially with the null object reference error.  Looks like it needs an update for Android Wear 2.0.",
        "date": "June 22, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRVIteWIzN0s3LUp6YTJuQllOWGt6OGw5eUpUNTc4TmVGbG81Y2VocmNRQUtTZHN5X1Zrb254T2VRNlhwMFM1ck1fbWZ3RG9qZWU1YUdPVGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "T Laryea",
        "comment": "App seems to work fine on my phone but on my LG Watch Sport it crashes whenever I open it which is the main place I like to use it.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSHRla0NTTE1YZVRKWWtxaHVwSy1KSElmWlFTdndrU1JzSVVPMzhrM2FpTm5yaGVSVC1DRk1yMmcyMGtrVGVZY25LeUhQd2RHVnNXVWdIeHc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "jonathan caruso",
        "comment": "The remote start feature is always down when you need it most. Been down almost 75,% of the time when I've tried this winter",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRUhxYkxYbG14anY3dWlTNTVtS3BXRjFhMEs2b1lMYjZyOGRfT19uU1JHc1NMNzBXeXp4N0tjVHJuX2RteHFFWGpGS3N2ZkhOZ1h3S0tjOGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Criscoe Johnson",
        "comment": "Why isn't this service offered with the car? I cannot pay so much per year for service where the app freezes and, or, the command never makes it to the car.",
        "date": "May 1, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSGNNeXZhcGJrTEpGdTNMVWR5VklLNUk3Zmc4Z0pfaVFnbTFqNm91UDJqZXVtRU1IWlZzaFZtX2dCYzdSVjFoMlMtdGhXTlp1N1UxMDNsWXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Rick Angell",
        "comment": "My issue is that the app is a power hog, routinely using more power than the OS, screen, etc.  If I use it, I try to force it to stop, immediately after.",
        "date": "August 16, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPR2g2aDNrcVM5bVZ5NmNFakJrTHpkZ1Q4OURFbjFYeFdRYktLNjZRWTVkQ3lIWkZfNUt3cmEwWWtUc1h4end0WHNrcFpBVkZrTTYzNEl0a0E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Alicia Rodriguez",
        "comment": "Unreliable app, so much for making the process easier or more convenient.",
        "date": "May 21, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRWlLcEtqdzQ0Z0ZWTGZ0YWdyZFJEdzE2MjJuX1NKUDdVU0VDejBwSFR2Y1M3Q2lFcVo1eEVhTjVXWDY2V01LYUN6MHNfWXFid3RIT0tlWUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "David Thomson",
        "comment": "Huge battery drain!",
        "date": "June 18, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPR0dPUF8yMkJzWi13M19ZNWZiTlZsMGpHUnB1WWJGUS1sYXNKVFFHSXlYWlZJQXZ3MVhaSDZHVEhvSi1kaWRIdXg4WWwyNTNlWTBjNm9TX1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "J W Witherspoon",
        "comment": "Simply unreliable.",
        "date": "March 19, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSFJ2RndsSkoxcVI2a2szcm50bTB4TU5QeEVnSWxFMWU4UVA5S2VUekdDQndiQWxnOWRTbzlOSm1oa3d1a1lkd2Iwa3NiSjlTNy1LS0x2eEE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Garak",
        "comment": "Works fine, for $200 a year it would be nice to be able to roll down the windows",
        "date": "August 2, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRzFSZ0h1ZUs4RXZNMlVsVTJoQUZhR1VualhwT2FvOFpxT1V1SHhJZkN2Q3BCX05McDhzaU9NYnNpbzJaNzlha19tOVJBQVMxa2swRkkyYXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Xavier Diaz",
        "comment": "Cool it does its job cool",
        "date": "March 13, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRTJRVW56NGVXaG1xWWJ4TWE3NlFXa1lOMGFhZGVDV3pUYmpUX0h6aVg4X3JUY2kyZ3l2WldFMldQUUNzTVpEd0l1N3M1V3huSGxVYmlZQkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marcus Terry",
        "comment": "It works, good functionality.",
        "date": "April 5, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSFJhOXIzNjR6dGo4U2h3YmZId09sbFVjMzRfWEhGWW9rSTR0S1BvVWxuVUltaFB3dzMxenNIeWkwbnRVdm9uWXlfQzg2UzM5dW1XZ0pUZ2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Gregory Higgins",
        "comment": "Unreliable: \"service unavailable\".",
        "date": "March 5, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPR3FuaVdCdVdiNldPYktKb0hZODhJUDRjQjdRMmRWSXNYdHdSV015dDdRU2tkcXdXLXgwOFVIczZyUXYyMXdOZjllcmowS0tRb1FNbC1oWkE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Henry Erich III",
        "comment": "Or about $25 a month. I get unlimited music streaming 24 house a day for $7 a month, unlimited TV and movie streaming for about $10. But blue link takes the cake with a feature I may use twice a day during winter and summer. Hyundai should drop this rubbish company.",
        "date": "December 18, 2016",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRWRyY3VpUUdhdkM2SENMUmxteU5tbFlPYTRxc2E4bElIZXJFTXJpdzVzWjRaNTJZVDFZZ0NNYmowZi0ybm1HT3hod3A4NkdlcjBwSUFhYnc",
        "reply": null,
        "star": 1,
        "title": "Can't believe this garbage costs $300 a year"
    },
    {
        "author": "Jared McDonald",
        "comment": "Remote start is a great concept, too bad it rarely ever works. It's a joke that they make you pay for a feature other luxury brands include for free on the key fob. Don't waste your money.",
        "date": "January 2, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSDRyMWVBR01mY25oVHFPU2ZKMnNCVllKanVLTGpPUnVjSFI3X29rNWtvYW5LY2lacF9IZjNfczNNQW5BcFZ5OFYtR3dLVlZaNFkxcGlISHc",
        "reply": null,
        "star": 2,
        "title": "50% of the time, it works all the time"
    },
    {
        "author": "Joe Barnes",
        "comment": "Better UI than the my Hyundai app, still just as slow but I rarely have any issues with the Nexus 6 and Verizon network connecting and starting my Genesis. Only issue is it won't let me keep my phone rooted with Super SU, but once phone is setup, that's easy to unroot and then it works.",
        "date": "January 5, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPSHR4bTVQN3NFWFRyTjJ4eXVJZWU4ZUszX0xQbTNmZGItcnJNZ1BRTXMxaGJJVFpnUUpvcFRId1FhMktqQnRTWlpfcVY3WGtyMFlreVFBMkE",
        "reply": null,
        "star": 4,
        "title": "Works on Nexus 6 with 7.1.1 update today"
    },
    {
        "author": "Elliot Cash",
        "comment": "App and features are amazing. You can see the status of your car and whether it's unlocked or running. The best part is remote start/stop with the ability to set the climate control temp. Amazing on a cold winter day or blazing hot summer day.",
        "date": "January 4, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.genesis&reviewId=Z3A6QU9xcFRPRWFKQjR6dnNzb1ZWbmZMMkgyRlc0NUNnR0xPYVNtVnFwQTBCbjRWVWJFdWxVZy0ydElRbkVCUV9jdERzd2RxaHF1VnRLdVZUYmNqZExRdFE",
        "reply": null,
        "star": 5,
        "title": "Works with Pixel XL Now"
    }
]