[
    {
        "author": "Green Rita",
        "comment": "After losing expensive ear buds in the past, pleased with app's potential assist to locate lost buds. Don't recall that Underarmour + Jaybird had that upgrade. Also, must admit, after trying lots of competitors, returning to Plantronics Backbeat FIT was smart move. Their bud design offers the most stability + snuggest fit in my broad basis for comparison.",
        "date": "November 15, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRUJMRlNTRE5BSHpZbE40dzlJRjhzeUFOci1ERmo5UHVmWFVPQ2UtRllzTm1LSWxkdG1rTENmSi1MaTQzRmlEbXJKZFVlZ2JKblVDeUtKaVgw",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Guy Lazarus",
        "comment": "CAN YOU PLEASE FIX THE COONECTIVITY ISSUES FOR MY HTC 10???  I have an up to date Android OS, running Nugat and after updating the firmware on my edge, the connection keeps jumping in and out. Thank you...",
        "date": "July 14, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRlRNdWNNcnc5Y0k5NzhhLXZfbDRYbGdjcDAwdFlFVFNnMjNVd2lIMW1ldGJNaEdfR0VSVV9oanJoeW5XNUZwM0Z4NmdIbGV0VkR4UllTTTFj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Taunja Dickens-Harrison",
        "comment": "Best EVER!  I lost when I was at the grocery store. With the app I tracked it to a cart in the parking lot!!!!!! Awesome!  If I got too far away from where it was it would tell me it wasn't connected then I go the other direction and it connected it and we searched every until I heard the signal@ found it sitting there waiting for me in the grocery cart stall with 4 baskets behind the one I used!!!! AWESOME!",
        "date": "November 10, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRnNBVGlUU2hvamMzaS1NX2xvTjlUOFMzQ0Z0eGJGVjRkdFp3RS1kbFpVRDNoSFdlamsyYmhTSFFMbm1LSHdNbXNaOGtJb0lVTzRMWXJOaXFz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ernest Cate",
        "comment": "Do security lockup at my church Hope Chapel of the Valley got home discovered headset missing. The find my headset worked GREAT.  GPS indicated within 10 feet and with the annoying sound found. I do actually thank my LORD AND SAVIOR JESUS CHRIST for this application.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRjlOSk80NXYydEdJbHFmTUQ4RFR2Z09ISjlLWjlSZGZnNGxnS2s2QU5rX1lkaW5FNlVTTUxjaXRnbFA4S1ZoQTVMc0t6OExFVjk5SDZkeklz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Walter Teal",
        "comment": "Awesome app! Once again, I just found my bluetooth headset underneath the covers in my bed, where I most certainly would not have looked today. The other day I was in the store trying on clothes, and when I got outside to my car realized I had lost my Bluetooth. I actually had to ask them to turn the music playing over the speakers all over the store, which they did, and subsequently found my bluetooth in the pocket of one of the pair of pants that I had tried on. That was awesome! And I knew it was in the store because when I turn the app on in the store it was showing it and when I got to my car it said not connected anymore so I went back in the store and ask them to turn the music down so I can listen for the tone.",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR3d6akg2bkl0cDA1WEJhVnk5N1EyNURSc1NzWWphbmVzWXJGYmprSDdNbFV6c1RHaTJXWGFMQTBRdkR2WHRaNTFIOV9CR1hKVHN5cVM1Mi1J",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "S Ka",
        "comment": "I do like the app. But the app is not necessary in order to use the headset. The one thing where I can find fall is with the button labeled find my headset. Unless your headset is sitting or perched against something that can reflect the sound then you will never find it. The only way it might work is if you drop it in your car. If you know the general location you can use that in order to locate it. I would have preferred to be able to change the voice on the headset. There are a lot of things I would like but those are not considered in the versions of the app so far. Other than that the app works perfectly. I am using the Motorola Droid Maxx with the latest OS version. There is one additional problem which is easily remedied. I don't want the app running all of the time the. I believe I will choose which apps we'll run all the time and which won't. When you close the app it is running until you force it to shut down. Like I said it's an easy remedy.",
        "date": "July 12, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRVVpUFl0Y2MtWUEtcWZDYnNScmszYWFBWTBMYldPM0NKbnhySjQ4ZlRUQ2xVWTlmb2t0R1dQZHNOMHl2eXVqZFFQNVhwOTFnWVRNbW5YSWxV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jennifer Bristol",
        "comment": "Not impressed by this app. I have Explorer 110, and all it does is tell me how much battery (earpiece does that already), and locate it. The sound isn't very audible, even when you increase the sound on the phone. Not very helpful, especially when the earpiece is turned off. I'll find it the old fashioned way, like I've done before.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRmhwRE9WSmdJdkJOTFh1VW90bUZ3aUxjbk8zUmwxSlpYM1BVWFR1U2g1X2UxV0QwMWFOMnU5MnFybmVBSGQ4M0RMYVktcmtXR0hDbnNyUHhN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "As I remember, seem better about a year ago. (2016) The Find My Headset feature is now nowhere near as loud, so no where near as good. I came back to Plantronics because I liked the features of their products. This time around... I'm disappointed.",
        "date": "October 2, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRl9FeEFBOXdXX2o1azZ0VzJOTWFVWlBnZnduOXhLbkZubUlKQkItelR3T1E1azhxNGhhLUFrU1UwajduZ1FhTjdaOXJfODdXbTBkN0FVUEt3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Allison Wall",
        "comment": "It is one of my most useful apps. Several times a week I will set a bt down somewhere, and for 1 reason or another I can't recall where. This apps find my headset option saves me every time. I also learned a lot about my headsets from this app.",
        "date": "November 21, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRzk4WlFQTGc0Q1VYVGxwS0J3bldCYVFJNXJpR21YMjBFN2VaMDdQTWdjRkwtT1JCM1d1ZkQwdUpMQmtRc2h2aUpuOE8wczVyUnF3ZUQ3VWhJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Святослав Шапкин",
        "comment": "Why the hell do you ask for location for actions like \"Headset connected\" and \"Headset disconnected\"? Also, is there any way to completely stop logging? It is quite annoying to have very long .log files in the root of internal storage.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR09QX29BcDBuWHhTNUl4VkJjRFNXMkRhNGd3UzcxdFFYclM3Z0hYTU40MFRoSTJCUnd0NmdWUF84RVFYUEt3M2RWel9OX0pMOUlkaWxDcWtR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Mick Black",
        "comment": "Would give it 5 stars if all the features worked with the new 5200...   You all need to update the app so the \"find my headset\" function works instead of it insisting that I either have no Platonic headset connected or that \"Media\" must be turned on... which it is...  at least the backtrack works.",
        "date": "September 22, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR2FkWF9rdExRZ21tX1o5eDJIUGRaWUkyczBmUmVHRHZadE1fTERHUjlYSEJkY2lRQkhxUlFMdDJyLXZsdkJldXZkVUNIV3ZPWnZ2VzN4d0JZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Frank Martinez",
        "comment": "I like that it let's me know how much battery life is available but my Bluetooth does the same thing. I couldn't find my Bluetooth tried over and over for the phone to send an alert it never did I just kept getting a pop-up telling me to enable which I did each time. I had to look for it the old fashion way and I found it.  So really why do I need this app",
        "date": "November 17, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR04tUTJ4RUk0NHk2SUo5RjVZd2FnNGtfWXlGamxMbmtqb0lRd3FxWWZSVGRfVnIxWFNNNjR4TnkyUWZ2Vnc1eGVUR1gtMVRQeDFEdHhoV1JZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Zylo Xeros",
        "comment": "In fairness, the Explorer 52 works and fits just fine. However, this review is about the app. It's not that I hated it, but it's just useless. The most important and worthwhile feature, find my headset was a total waste of time. On the loudest volume, even using the \"Loud&Obnoxious\" tone, I couldn't hear it at all. It was only a foot away from the phone, and I could only just hear the tone as I raised it to my ear. Once the headset is out of sight, or arm's reach, it won't be found with this app. Unless you just need a reminder of which ear you're wearing it on, don't bother downloading the app. Aimed at Hero, landed on Zero.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRzgyLVlUQjRHMmFZMzJNak5VY2FqeXJWMTN1YkFZb1RYdXBHLW9SekQ0b2huZk1GcWg2N0F2YmtybkcxeG9WVHJMRGRnREJ0MGFDQkYzREQ4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ricardo Fernandes",
        "comment": "it sucks. I have the top of the line (s8+ and legend UC) and it simply won't recognize until I turn off and on again. And it disconnects my gear s3. Every time I reopen the software it tries to reconnect. Poorly UX. Hate it",
        "date": "July 25, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPSFZSU2lJcHFXYTF0RTlqYUZHWW1WTUt0ZGtRTW53RVR2RktqUE1tZWhnWEJjREVVMTBuYXlKUWo4d1o0dGthaGRlZnB2ZkFOc28yeXlGaUFv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jeff Goff",
        "comment": "The app allows you a back track feature to find your phone on a map.  When close you can make the ear piece do a tone.  The volume is pretty low, so you would have to be close.  Making the led flash too may be helpful.  Overall, a good app.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRy1yWFlyYmJqeTVtMDhpQzJscE1aWFNOSlIxTHZFM0d5aW5zc1BtMDNRRlk5MnBhRHNmd0xsYWZGZEoxU2Fxb3RZeGZ2VFpUT1dXTGtLTHVj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Paul Glynn",
        "comment": "Very handy. Was accurate within  a few inches, actually. It was under the bed right under where I was sitting. Used it before, found in a 6000 Sq foot house. Has several screens, use not too intuitive. Doesnt always refresh very well or quickly, causes some confusion. Knocked off one star. Needs clear, concise instruction screen up front, first screen.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPSFJRamRkNlo3by02dkJyajVaeGxiVlhVZlZpeXVSU0N6Y2xQLUljTW00eVZ3UlNaVE1kLTdsdXZmcE4wNUxDN2kxMWtHZTY5azYyTDNDRk9R",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Greggory Youngren",
        "comment": "The app is useful if you are looking for the last place you had it. As far as the tone aspects, it is very disappointing, useless at best. With volume slider all the way up, it is only audible if you put your ear right next to it. Sorry plantronics, does not work as expected.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRWlxeERTMnBLbWVFZUYzbnB2OTR4MnlpMkdPTDlZbVBMdG02eGYtZFFEUXNCSi0wN2VTT1dEVG53TWo1YmV6c19ZMHd1cF9OLWYtdy1Db01N",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Bjørn-Erik Bjørklund",
        "comment": "Iv a Voyager Edge.  When I try to send a tone to the device it's impossible to hear anything.  You need to get as near as 30 cm / 1 feet from the device to hear a very low sound.  You can not use this app to actually find a lost Edge but maybe it works on a other device.  We need much louder sound to ve able to find the device.  I rate this to useless as it's today.  The though is nice but the performance is 99% useless.  Needs a great update.  Voyager Edge is so expensive so it would be great to have an app that actually works.  Headset is extremely well made,  works flawlessly at alk tines.  I would hate to loose it.  Pkease make an update so we can find our headsets.  Best regards Bjørn Erik Bjørklund,  Norway",
        "date": "August 26, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR3NvZDBWbUgydVBxaDZSeTg4UDc4ZmwyYlloTnk0UlMzM2dteW9pQnJCZ3ZBVnZLUUgydDlmRm9qMDNXSlhpYkpkYTdaNWdtRWk5Y2RmM1FR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Douglas Wright",
        "comment": "Device was found using a combination of history and the location feature.  A little dumpster diving due to the connection between my Android phone and the Bluetooth and the expensive device was found in the parking lot next to the dumpster of the apartment complex.  Great APP to have!",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR1JDa1JJb2Y1Ni1JWmdkOVJjWmExdkwyV0JFdmFWZ29PaEpWdE9yQlQ0RkN4dXNrSmZhSnFyVEhOci12U1Bsa01aMGhGRy04N2l6RzNsM09V",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Andromeda StJohn",
        "comment": "Most of the \"praise\" reviews sound and company paid.  I am disappointed in that the sound and connectivity to my Samsung J3 is horrible.  The app is not much help.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPSDdwa3dBZGFTXzl5aVB0Qm5fLURjSVpPQ2hNMEhDeExNdEdzYUpydkZmVEVWN2NNNldkbWpWOFdrcGhzaWk2Z3hOOGVhd2EtTXgwUzZaU19R",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Tim May",
        "comment": "I think this app helps support to your headset. includes theft prevent and recovery and it offers a way to keep your product working. Easily a no brainer if buy the company's hardware",
        "date": "August 30, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR2tPanZHZU4zOWJsSE9XZVZMbi14cDN0QkV5RzJDUkJ0dTB4clVhdWVJdVAzZXRwdFdLTEhIRVk5ZVR1RUI4M0ptYlVNZXl0ckVfMXdiamVz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Dustin Buckles",
        "comment": "Easy to follow instructions about your specific headset you have paired to your phone come up without having to search. The sound is loud/annoying enough to actually help you find it when you put it in a stupid place and forgot where.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR2FNcmlrRVlOaVBxRUZSTzN1ajdTUkVVWEpqRzhIdE9vMEtOejR1dUZyejVuX1JuN2pSdGZFVE5LYkVGOTNmUFRsdnhoTUhIY0VuZzVvUmlV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Michael Mancini",
        "comment": "Apps kind of pointless, doesn't add any extra or improved functionality! Was hoping for some audio controls, like eq options for tuning or improving (my already fairly decent sounding) BackBeat FIT 305's ..but no go! App has useful info but all the same info that comes with the device so really just a wast phone resources.. Only setting option of use is battery percent and notification, but my phone already gets that from the headphones and displays it for me if I want, so again not really useful",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRnJRb2pSUFMyZy1HbjZ1ZXM5RklWdHhERTNqNmthRTlnTjZKcTBjdzF5RWJ1aGxxZm5sZHotblp0R0tTWXpRTi16MTdpLXAyeTRwOGdlaU13",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Bart Rybarczyk",
        "comment": "Works great with my Plantronics Voyeur. I did not realize my Bluetooth headset supports HD calling. So I am very happy I downloaded this app because it does make a difference for me.",
        "date": "October 11, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRjBldndBVWpzUDZnWENua1M4YUpCand4c0lUNHpvek51OXd6MUN4VzhQRnRzUVNEbE12dTNnckIyVDBiT3U5Y3h2RU0yeHViT3NZV3B4SklR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Atanas Penchev",
        "comment": "M70 - Battery status unknown. Running 7.0 Nougat. Disconnect /reconnect. Power off/on. No result. Good headphones but app...bad. Very bad . Fix please.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR1NNb1I2QjVsV21DMGlKTkxlRXFaYzZHbTk0RVVFUFljeUZZd0tFSXJsVE90UTlVQ05vdUFIbmMwaTl6emNUdjZvYmpTVGlGaGtKa3hQSllr",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Ross Tancred",
        "comment": "Not bad. A left behind feature would be good so when your phone looses the bluetooth from the headset you phone would ring.  Stops you leaving the headset behind.  Reverse could also apply for a left phone.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR2hfT1pBN216bERQUGNHTWFCTnMyMThMb2JFUmFZZExBVURIbU1lSW9SSjBLMzlOWmdjcjBzd0RLN1lmUUdIVmIxS1dmTEh1OU5FMWRUaXlN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dave Harris",
        "comment": "Can't even detect what model headset I have. Bought a New phone, tried to connect to headset. I need to know what model headset I have. Bloody pathetic, app should be intuitive",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRXdyb2RsbXNieDJFb1M2cTVDYWM4LVFsUy11SmZad3BzamRGMDhmbDliTS1JM2dQZENKYnhqVk1DbGRNb1k4c2V3bnFieFZqaUxLR1IxeHhn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Gary OConnor",
        "comment": "I lost my bluetooth headset in a parking lot, used the app, saw where it was used last, drove back, and there it was. I love it. A must have. But download it before misplacing the headset.",
        "date": "September 7, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRXZ5OG1TNmpKQVpHQ0l3UUJCUW5ibXRhX0ZHMXpCSWFtcjZKWkJOREpGX081Z1VRM04zbUxaYnVJbThRcEJXM3BEeEkwcnN0N0M2SVRKX0Jv",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Only1 Kapone",
        "comment": "This app works perfect with the headset that I have which is a Plantronics headset Bluetooth Voyager. Sound quality is great crystal clear and the mic picks up everything I say all while blocking any outside noise a regular Bluetooth mic would pick up? Good job Guys keep it up.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPSEU1d2plWkhJNlEtT1dLeUh5bnp5cjBjNVVoRVFmYlhKUHhZd1pDc2VsY1BvRWNjODhLb0Z0N0hCWnpiV19lUWd5MjBJM0ZNVkE1elRpQWhV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tampa Native",
        "comment": "This app is awesome. I'm always misplacing my headset and it was a pain to search for it. But not anymore Thanks Plantronics!!!",
        "date": "December 18, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRjV4TDF4ejd5ZHVzMVdwcWNxTEc3Q1FfcE5xVTY4d1JxZmIyaWpmVTZqcUlCeHg1MzhrRGxXUjRMN05YczVVMjlLOXUwNHBXZGxHN3lTczBr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nezar Shehabuddeen",
        "comment": "Keeps requesting to enable media pairing although it's enabled. Utter failure.",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRUtfa2pFU1UwbGVHRDkwQ2xzOTNwQXRiRDNLVFoyQWRPeHNpdVl0UzRPYklqdnRud1BQckZ1UjE3bGxSa2E1ajJsbEtSNWZkZUYwNWVyWGw4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Marcellette Riley Donato",
        "comment": "I only buy plantronics and they are the best. Longest talk times, clarity, and lightweight. The find just headset is a lifesaver!! I once tossed it in the trash and found it!!",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRVlGX0NCSGQ2NWZSRFI5dXU2VXRScFZRVU1IaUx6TFM0MXBleW1GNFNLRXhuV3hUSmhXZi0wVVBuSy1CTG52VUxqRzRSYkpjdmdpRlB2elpJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Fantastic app and products but when Plantronics HUB loaded, it came or allowed with a nasty virus to come into my phone with Google Play Store.  \"Spyera\"   The only app downloaded.  Shortly after, virus software alerted.  Never I have to spend five hours relating my phone apps and data.",
        "date": "December 8, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRWJiMTVyYi0ycDktQ1BXVk5iV3R6WktOYVBsY2JCenY3aWtFZUUtWTl6WElvb0p0bUtSTUttcFM5UDBjTGlfdnh0UjlfZ1VYZWtTOUR3N2Jj",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Shawn Warren",
        "comment": "MEH... moreso after attempting to update firmware. App crashes and NO I am not going to waste my time on an  800 call or reply to any outsourced script kiddie comments to waste time via email. I'm not your beta tester and diagnosis technician.",
        "date": "August 30, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRlk4VkRXZ1gxV2FsS2R6ZXdoUHVSbUhDXzJaLVY0VWhRUVR0R29La0ZKdUU4RmJweURPakNIckY0d1U2M0NUT3Z0ekdraEU4NnMwV0ZFZnBn",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "US Bachu",
        "comment": "Voyager 5220 does not say contact name on incoming calls. Just says incoming call, answer or ignore. Need it to say contact name",
        "date": "July 12, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPSDMyaFd3VUsySDNFUlozMThCT2F1Q3ZYeVg3bi1qakdrNjVXcHFuMjVKRUlBcWZ1M0wwNTBoRmJSSHZ4MVNwcTd2N2pMbjlvdUpGeHFJVGw4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Tony Lopes",
        "comment": "I love it!! I recently lost my other identical ear piece!!  ;( But got another because of the great working capabilities. I don't usually care for something that cost as much as this... But it's worth it!!!! Right after my purchase this one I found my other one.",
        "date": "July 27, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRTN6a2QwRUNVVUJXM29DaFkyQk81eWxxMHlsVE5SdHYzVHBGMzVHaU83SGdMN0ZaWWFoaGdxRllwU1JxdkF5a2ZOWXhYcHBRRmhWa1FXS2xR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lorena Anoceto",
        "comment": "I bought my Bluetooth because it had a find my headset feature. The app worked great in helping me figure out where I lost it.  It would be helpful if the app had an alert as soon as you lose contact with the device.",
        "date": "November 7, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR3JhVlNVRnpkT1hYYUZOMFcwU2xTaE5rZUpNX21nUHVVTDFvYWxNX2s3SktuZzFKOE15aHZWemJlMWhsMHFxWGRtRnpidFY5OWVyRGEybU5r",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Saham Ahmed",
        "comment": "99% works great, except for the latest firmware update for the Voyager 5200 series. It didn't update off the phone, had to use my PC. Other than that, best bt series I've ever owned.",
        "date": "August 29, 2017",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPSDh1SzlBRWE1U2ZYT21UdXp3Q2JhTlM1bTNrdUtvX2dPcnppS2tlLU5SRmx1OWUtVXFYVWRRejBxcF84WGJkRTdlYnhqNGNIbHpEOC03a0JB",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Will kill",
        "comment": "I been with plantronic for over 7yrs had a voyager legend lost it and bought another one tried using app but wouldn't recognize Bluetooth uninstall and reinstall app restarted phone and cleared cache on phone still no luck tried on another phone still the same problem thinking it might be the Bluetooth  going to try another voyager legend just to see if it's the app or Bluetooth",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPR05RamgwMjZWbmV6VXlkYXVtM2hUM0hZWHNhRzV4bHpnN1pFN2RVUS1SMW80M0NkS2k2WFpyU1B0bW10LXdVdFNmTGs2emg2bVlmUHFEVHhz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Find my headset use to work great and the tone was loud. With Hub the tone is lower than a conversation, I walked past my BT 3 times. Couldn't hear a thing",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.plantronics.headsetservice&reviewId=Z3A6QU9xcFRPRTRTMTQwV0RlTzlSZ2c0T1UzREJNRHZGNHRUZXRJbHRBWGwwM2lEeHgzN242cUhrc1R2WVl5bDJGanRva1BXb1pqVGVVZmlDQU9IZTl6ZEZr",
        "reply": null,
        "star": 2,
        "title": null
    }
]