[
    {
        "author": "Diego H.",
        "comment": "Just bad.. my first experience I didn't even get the discount for the first ride. Not to mention, the driver got lost after his GPS froze on his phone and I even ended up pay more for it",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRWxhM0dackRoYlRESkk4andrRG9nYWgxVUpXWDZ1LTJkUEctZ3ZQa3loMFdVSGJPVV9od08yQ3k0UlpxQTBiVG01ZG5PeUxmanYzU2hM",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Diego, como vai? Sinto muito por essa situação, realmente não é o que esperamos para nossos usuários. Para que possamos te ajudar, entre em contato com nosso time de relacionamento. Acesse: www.99app.com/contato. Abraços!",
            "date": "March 2, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Eduardo Avallone de Souza",
        "comment": "I didn't use much on my device because if this app needs the permission to see my photos and files in order to work is because something is wrong. The app literally don't open if i revoke this permission. I check Uber and Cabify and none of them need this permission to work properly. Only the location.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRm5LLXFKVVB5TWVmSGJUTUtjREVKN0pIX2d3eEh1RDBoNjR5Rl9SWEM4MDBSZHJuQzlTMVc4QWlBWTV1aDZ1SnNzbHlTY28xZkEtTUc2",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ricardo Padilha",
        "comment": "Aplicativo se lança sozinho, sem ser chamado. Adiciona notificações com propaganda. E agora inundou o YouTube com propagandas bossais com volume altíssimo. Não é a toa que serviços alternativos estão destruindo o mercado de Táxi.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRURPNWFqSUhvc2ZGbHdwaFFGb1BXbndyV1lkd1c4T1ZJSVhYbDJoYmo1Y0hxUnJqRUpFdTBaQmxlb05aYS0tbHBJSHI3NXl3R3UwQjAw",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Oi Ricardo, estamos sempre desenvolvendo melhorias para o nosso aplicativo, incluindo correções de bugs e novas funcionalidades. Agradecemos o seu feedback e vamos compartilhar com nosso time de desenvolvedores. Um abraço!",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Marcus Vinícius",
        "comment": "Perdi tempo e corridas já (e os motoristas também, por consequência) pois nessa migração para o aplicativo novo, com os dois apps instalados, fica fazendo logoff toda hora, e pedindo senha, etc. Deveria ter sido instruído para desinstalar o app antigo antes de instalar o novo",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSHFjRTFTNkJKdzBKMmYxSEZwcXNuZnM5Y2xBazc1SUhDR1ZTdEpIdnVyVGdVMUNKWWJkVXJIaE1GTlZYTHVEZFBucDNYZDBKSHpkOXBp",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Doug Ninja",
        "comment": "2-Isso mesmo...inovem...  1-Nenhum desses aplicativos de transporte tem opção para passageiro escolher motorista bilíngue...em certas cidades isso deveria ser obrigatório... Tanta propaganda em aeroporto pra nada...",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRVdWanNLLVYtT0hqYnNDS2ZRb3B3UmhuUXQxamI5QVN4OUV4VTRyajRTZ1Vsa2tUemZHNl9IczlxZjVpdENlajZVYUlzanBBanVreDR1",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Oi, como vai? Adoraríamos te ouvir mais, conta pra gente onde mais podemos melhorar. Acesse:  www.99app.com/contato. Abraços!",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Lazy O-Matic",
        "comment": "Qual a intenção de vocês com tantos anúncios no youtube? Lavagem cerebral? Pq a única coisa que estão conseguindo é deixar as pessoas com raiva da empresa. Se for o caso eu pego táxi na rua ou vou a pé",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSGdjODYyaEZQZ3BmZFFZNGxidzI5dFlOWjIxOTByU2xTVWI4OEtYOGQ1aDc1VDRPWGpkbkJCWFRTVFk3S1lSY0RvMk8yeGlfYVJnbDI3",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Olá! Temos recebido muitos feedbacks com relação aos anúncios, pode deixar que vamos compartilhar com o time responsável para que sejam feitas melhorias na nossa comunicação! smiley Obrigado pelo seu comentário! Abraços.",
            "date": "February 16, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Infelizmente não instalei por me obrigar a permitir acesso aos meus arquivos e gerenciar minha agenda telefônica. Uso outros aplicativos como o Uber e o Cabify sem precisar ser tão intruso com meus dados.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPR1RGMDNXbm92SXdhUTEzUllIMXhjbVJNc2o0Y3RqRHlnWHFyTXVIbHRxTkVhZGdKYkdmbzhYTFZOZFJYdURDZThRZjVNejdjV3dNSmdh",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Demora excessiva para chegada do motorista. Valor cobrado diferente do apresentado no momento do pedido. Desconto de R$ 10.00 para a primeira corrida não foi aplicado.   Utilizei o serviço uma vez e pensarei muito bem antes de utilizar novamente.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRzB4dkFoc3R4MlVhUG9Zc0x2d3I2dy1tbVBTV0ZUM3pxRDFfeEU5dF9aNWYzZ2hvWDZtcTBoSnZEUUkxNGlsZzhqS0JQaEJsTFRvbkJy",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Artur HP",
        "comment": "Como muitos, só instalei para dizer o quão insuportável é a experiência de ver essa propaganda toda santa vez. Assistir um documentário ou algo tocante ou tenso e ser interrompido por esse locutor é a pior coisa que eu poderia querer no YouTube. Eu não uso nenhuma porcaria de aplicativo de transporte e tenho que ver esse saco toda hora. A única coisa que contribui é a vontade de nunca usar isso. Se querem publicidade positiva, esse é o modo oposto de conseguir. O Brasil e o universo inteiro já está ciente da promoção do cupom10. Quando isso vai acabar, peloamordrdedeus?!?!?!",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRkJVWHl3VGc3YVZJLVRqdXVUTThZcE5sNnROc2hLdnBUQ1dMalNLVi1BTTVsTlpJSEhndmN1UXZqLVZ3OGRvQjNvNE04aE1oQ3pEWThl",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Raphael Vale",
        "comment": "App horrível. Enche meu youtube de propaganda e quando preciso de um carro, não consigo nem na região da Av. Paulista.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPR2x1U0VkQjVsNENiWnpyLTdGYzNvV3luZmd4d3BrbE5aSEdSNXhYNldvOVBHLUZmd0t6NEs3UFpqdTdPREpIaXhyU3J6aXd0U0ZERkhR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Não sei o que vocês querem tendo acesso aos arquivos do meu celular, fotos e vídeos, mas enquanto essa permissão for obrigatória eu não uso esse app.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRWx6Z2ZlcXk2LXRjLUdhM2ZHbXRURFJfbDZpMkVtTVdMdnZTcEdhSFo1UDBnNmtSNGZ3SDgyajI1ODFiWjRlR3FaeG5rVVhNWU5tZE5n",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Olá! Nossas permissões estão de acordo com as politicas da Google Play! Caso você tenha alguma duvida sobre isso ou qualquer outro assunto, pode mandar uma mensagem pra gente em www.99app.com/contato Grande abraço!",
            "date": "March 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "davi vidal",
        "comment": "Outra atualização, mas continua exigindo permissões demais. E \"Nossas permissões estão de acordo com as politicas da Google Play\" não responde o que vocês querem com meus arquivos. Ou contatos.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRkdzakMyT09KNDRQckR0TXJOekRyVG1hamFjUFZxckhRZE1CdnpMWnBOck1PeXFKTFNLRm1tc0pteHBRQVRiYUZaQ1JWY1M2MTBEb3FJ",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Oi Davi! As novas permissões são para acessar sua câmera e tirar novas fotos, assim você consegue atualizar o seu perfil com sua foto preferida. Já a permissão para ligações, é para facilitar seu contato com o motorista!",
            "date": "February 16, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Nathalia Reis Teixeira",
        "comment": "A outra versão do App era muito melhor, isso pq não era o melhor app de transporte. A lista corporativa demora pra aparecer e parece que a lista de motoristas diminuiu, sem contar que agora aparece que o motorista vai demorar 35 minutos pra chegar e a localização não está funcionando.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSFZkZUlvd2pNRGRPMkJtYUdXVi1Wc3pBNURvSEk1eDg2NG1FMDAwZVRSU2p5Vl9YUEtJaXllVExLUEdyamNqZ0VDLVByWWJfVTZ5RTZD",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Caio Srulzon",
        "comment": "Alem do erro antigo o app consome muita bateria mesmo quando não está aberto. Espero que corrijam logo isso pois vou desinstalar se continuar.  Erro antigo: Mais de uma vez o carro não corresponde a descrição informada pelo app. Quando você irão corrigir o erro?",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSEJWVTkwNHdyTzBWOVdyZGRkTTNkeGJlQWZzc19meHJsVVNiaDFFQVZIS3ZydnVHZXdjMTBaX1lKUDdQNVZfNlNtQ1VNaDRCVnMwblBh",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Oi Caio, estamos sempre desenvolvendo melhorias para o nosso aplicativo, incluindo correções de bugs e novas funcionalidades. Agradecemos o seu feedback e vamos compartilhar com nosso time de desenvolvedores. Um abraço!",
            "date": "February 27, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Rico Rodrix",
        "comment": "NÃO RECOMENDO!!!!! Sou usuário do aplicativo há quase dois anos. Depois da aquisição por outra empresa, tanto os serviços, quanto o aplicativo e a qualidade caíram a um patamar deplorável. Todos, absolutamente todos os usuários e taxistas reclamam. O que era, sem dúvida nenhuma, o melhor aplicativo, passou a ser o pior. Usuários saem prejudicados, taxistas também. Não é por acaso que muitos taxistas estão evitando utilizá-lo. Para nós, usuários, só nos resta ficar à mercê das chamadas canceladas, tempo de espera absurdamente longo e falta de interesse por parte da empresa em aperfeiçoar os serviços.  Tenho que aguardar, em média, 7 minutos para localizar um táxi disponível, independente da região ou horário, tendo que cancelar a busca e refazê-la por diversas vezes.  Eu gostaria de avaliar este aplicativo com uma nota negativa.  SIMPLESMENTE HORRÍVEL!!!!!!!",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRVNaQVdUWVRrYU9yLUR1UE9CUUZUcFo1MXpnTGc4aG1XeUxleEZTRGt4blpjTG5jQm1mTGhnNk1xUXhrNGtuTjlEcmw2V0doeGI3WTlT",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Oi Rico, estamos sempre desenvolvendo melhorias para o nosso aplicativo, incluindo correções de bugs e novas funcionalidades. Agradecemos o seu feedback e vamos compartilhar com nosso time de desenvolvedores. Um abraço!",
            "date": "February 28, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Norberto N.",
        "comment": "Saco cheio de tanto comerciais chatos, repetitivos e mal elaborados no YouTube, pega os 10 reais e coloca naquele lugarzinho.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSHZPWGJhMkZQb3YtZWhPYVkyLV9qcER1MHFYbTUxYzRZSm5UVnA4ZXpUbTVMTEw5dWU2aGxPeEtIMTBtMGgweTM0VTJabk5vUHRGLTN2",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Yann Lucas",
        "comment": "Corrida finalizada sem motivo algum e ainda consta como corrida em andamento. Não consigo mais solicitar nenhuma outra e o suporte não resolve o problema.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSDRfNU13dnJCaTJ0WXAwUW5DbzQ4N2xMYW8zR1k0M2FFdUZwSDc4TlBJVTBsOGZOTzB2R2lqNGprRmdGN3plbkVWRjhnT05SNmZIUTRo",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Domício",
        "comment": "Spam de propaganda constante. Vim aqui dar uma estrela de presente.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRUdRampXMXlnZk1EMzYzWGNHWngtc2JmNEhmdDFHN2ltN3pxTmRBMEtFODEtYTlkSnJLeXFRUFlJVGlCRjkyTHN3Z0RDV3pyUzFvcFhG",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Olá Domício! Nesse canal, eu realmente não consigo te ajudar, mas entre em contato com o nosso time de relacionamento do cliente 99, lá você terá maiores informações: wwww.99app.com/contato Obrigada pelo seu comentário, um abraço!",
            "date": "March 3, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Gilmar Caldas",
        "comment": "Nota baixa, pois simplesmente não consigo abrir o app. Instalei ele, usei uma vez, dai na segunda tinha essa atualização que não permitia fazer a corrida enquanto eu não a fizesse. Dai atualizei e o app parou de funcionar, frustrado duas vezes. Nunca tive problemas com as demais concorrentes.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRzJMUTZnUW5kbGVGOV9sZWJtbDZ3MTd4R3JkUUwzVU9wQk1qaU93UnUwd0swUkx6T0tuVVhiWm00ZldNeGNFc2l4dWxmU1hldlc4QVpq",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Olá Gilmar! Entre em contato com nosso suporte! Temos um time especializado que vai poder tratar do seu problema com a devida atenção! Manda uma mensagem através do nosso site em www.99app.com/contato que a gente te ajuda! Grande abraço e boas corridas!",
            "date": "February 15, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Rafael Pessina",
        "comment": "Essa nova versão está Péssima!!! Está drenando a bateria. Além de consumir muito a bateria ainda está lento demais na hora de solicitar um carro. Leva mais de 5 minutos para encontrar um motorista. E tiraram funções importantes como \"abrir corrida\". Enfim, um App que era tão bom ficou imprestável.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPR05sNWMtcHhMdWN3OS1Zamtja3o3MnhsMHRNakVxOFRySXdpSWthU0IxUWlRUlNULU44N1d0TUZock1jODBXV1ZIZmJLYVQwRFl1elpz",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Oi Rafael! Entendemos, e pedimos desculpas pelo inconveniente, mas a gente vai ajustar isso o mais rápido possível para que vocês consigam utilizar o app com mais segurança e conforto! Muito obrigada pelo seu feedback, ele é super importante para que a gente possa melhorar a qualidade de atendimento. Um abraço!",
            "date": "February 27, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Mari Friederich",
        "comment": "CHEGA DESSAS PROPAGANDAS INSUPORTÁVEIS. DE ONDE VOCÊS TIRAM TANTO DINHEIRO PRA MONOPOLIZAR O YOUTUBE ASSIM?",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSFlOZDh3anJLeEdRSEZfRjBERXV5d3NMU2xOYl82WG9iSENoQmZMSGFkNnUwNzRqbTFfdmUtaVBMenU4Umh1U1JTTVUyd3BqNzRlZlda",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jose Papo",
        "comment": "O aplicativo ficou péssimo e cheio de bugs após a migração. Parece que depois da aquisição pelos chineses a qualidade foi lá para baixo. Vou ser obrigado a retornar para o Easy",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRjVMaGVpaHRtdG5qdnM3RnhBQ0xQRk1vSW5vLXFQSGkwbUlVb2t4bUJIeGhHTWlkdFBFV1VGSG5wVUdTMUVUeG0tNHgtRWtSYkVxV3dP",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Marc Schipperheyn",
        "comment": "The new version has problems with the map. You can manually adjust your pickup location and on my phone it picks the wrong street. Annoying",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSGxLMjNMcXVCd0JJcGJiVjcweWQ5ZWtUVEVtUl9jSFFtMlYxUWxlTXF0QkNvLTVLRkN0TmdiSlZZUGp0SWR3VHVFOGNyd1BaekFjSGhu",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "lucas lopes",
        "comment": "In this new update, the final destination or method of payment cannot be changed during the ride. These are a MUST HAVE",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRUtfRWxiQWJlS2piUTYtbmNqWU1RVlRxdmZlalB6a2c5aWw4TDVJUnJKX3lUMFlPOXNmNlhPbzVLSjhvVEdocmxLVlpjZzZ4Q0txMHZ0",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Olá Lucas! Estamos cientes desse probleminha com a localização e correndo pra resolver o mais rápido possível! Muito obrigado por nos reportar! Abraços.",
            "date": "February 15, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Danilo c",
        "comment": "Depois da última atualização o aplicativo funciona MUITO MAL!!! Não acha motorista, perde o ponto de referência de saída, os taxista cancelam. DE TERROR!!!!",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSDdFaWZQNFdSS1B1akNPRGtNX3htYTFyVGRLYlVUdGh4dFVPYWFEbHI3YzBTYkJIWEgtOW1CT3BwZ19zajduUDdIWTNmMjRPMGcwLXZG",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Dinar Fernandes",
        "comment": "O App é muito primitivo se comparado aos concorrentes, mal desenvolvido e com opções limitadas. O sistema de estrelas aparentemente não funciona para nada, pois não sabemos a nota do motorista nem a nossa. Uma motorista fez uma corrida inteira sem eu ter embarcado no carro e tive que pagar por isso. Aparentemente não há nenhum sistema de triagem de motoristas qualificados (como nos concorrentes) se uma motorista fez esse absurdo comigo, imagine os outros motoristas. Péssimo App e serviço. Péssimo atendimento ao cliente. Não recomendo e pretendo avisar a amigos e demais também. Não utilizem!",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPR005WW1JTzh0Y184aGU2NzFUUDNFMzB0ajhfdXBySGh4TWNjUWdtbmJTUHR1by0tRjZTM21sNHZVUXE2TmFSMjFFcHF4TTJpU2lKbFFP",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "André Clug",
        "comment": "Pior aplicativo de mobilidade disponível no mercado! Atribui corridas para motoristas que já estão realizando outras corridas. PÉSSIMA experiência para o usuário.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRTkwZHBScnJORlE4bzF0VEtTVmtGa2lURHJEVVI2ZHFJa2w1allFOW1CczR4SGp5UlNPbHF4WFhiQmEzSzloSXJRdHZvTUFFMXhpN1Nf",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Felipe Todeschini Bortolon",
        "comment": "Primeiro, essa jogada de marketing no YouTube é péssima. A cada vídeo tem 5 comerciais de vocês que ao invés de motivar o uso do aplicativo, da nojo da marca. Outra, não vejo motivo de misturar os aplicativos de taxi e transporte privado. Claramente eles atendem públicos diferentes que usam um ou o outro. Essa união só da margem pra pedir o serviço errado. Por fim, o app é horrível. Sempre da bug, não acha o meu endereço (ele sempre troca pra casas do lado), enfim, só é famoso por ser o mais barato dos aplicativos.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSExWM2NHS2JHQy0zZzRpMmtoaXFCMEs5aDVYVE5xWk1SMndmSjBNU3NYVEFDY1FMT1I2VGV1SUtKaGpud0VCQkVhNy1ibFBJVjRFdDJU",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Gabrielle Pataro",
        "comment": "Não consigo usar o aplicativo por completo. Os motoristas que aceitam as corridas não chegam nunca no endereço em que eu estou, não respondem as mensagens, só perco o meu tempo com esse app.   Acabo tendo que usar o da concorrência (que está muito melhor).",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRmhpNE02bnJJdFJKLXRJc2pKdnpsZWJ5RC1TRzlWRUhFWWVab0o4RkJZNnlEUTQtQThKX1p5cDgtbGhIaV9EMXhsb1VZUGZSbG1Bb0Zp",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Não aguento mais a propaganda no YouTube.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRVctVFpPclJRWTF6UWMxYW1VVTVMWlY4VE1QQW1WbFk0Q1ZGR2d3MlpENVlQVWlOVTBKS2Z2c3FBaHJHX2NEemRNQU4xRzNjbjgxX1NM",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Janis Carneiro",
        "comment": "Serviço horroroso.  Dá uma estimativa de preço e cobra o dobro, que culpa o passageiro tem se o motorista não sabe usar o GPS?",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSE9YdlFncWRBaXFwV2I3TkNDV1NpR3BSdmRucGhEZXpDMHlCTlp2Qlc3NTdyalo3U2RocGhuWDZrVmhiQWxCWFIzaDZ0Y0d6WWJWWlNo",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Carlos Caporal",
        "comment": "Não aceitou PayPal e agora não aceita mais meu cartão de crédito. Chamei o Uber e tudo certo.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRVdmcW1RSEFPZkhwSjFlUGVBTDRmX0ZCcFBUMU81V0JjVXpETFpBV1M3TTUwVlJWaGllT0ttbk51Ujh1QVgxVHdFQ1Z1UGpsY0FyTmZB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Felipe Mônaco",
        "comment": "Enquanto não for possível só chamar motoristas não fumantes, e fumar no carro proibido, esse serviço nunca será 5 estrelas. É um desrespeito com o usuário obriga-lo a aturar resíduos de cigarro. Acabei de fazer um corrida e estou enjoado e com dor de cabeça.  Estou pagando pela corrida, ninguém está me fazendo um favor. Falta de respeito! Quero ter a opção de chamar somente motoristas não fumantes. Não adianta pedir pra entrar em contato como se fosse a primeira vez que isso acontece, há 2 anos venho fazendo a mesma reclamação. Não se façam de bobos. ;)",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSEhNNi0yaldOcmpzQzlWanZuaEtPeUZ3RnJwWlVVYU1uUFowRDlqakZXd05aMGVjWmUyOElCXzkweUNNaEp0cVpCSzJabE5wNHd2cXJW",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Felipe, com seu contato e feedback, conseguimos entrar em contato e orientar os motoristas quanto a esta postura. Qualquer problema é só chamar. Abraços!",
            "date": "February 15, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Rafael Taizo Yamashita",
        "comment": "Cedeu cupons para uso e não descontou do valor final da corrida.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPR09zZ3JVelVlSTdkMDQ3cmhiS2FaSTdTNFFYd0VOb2RiUW5sdUo1NWp6U1FMTkVjSUVaTkFDM1JhbGh6WUdpWTM3YU5FYkMyY3lwazN6",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Oi Rafael! Manda uma mensagem pra gente em nosso site www.99app.com/contato Por lá podemos ver qual foi o seu problema e te ajudar! Vamos ficar esperando seu contato! Grande abraço e boas corridas!",
            "date": "February 16, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "David Tiago Conceição",
        "comment": "Usei a versão anterior e não tive problemas, mas não faz sentido ter que liberar várias permissões para rodar o aplicativo. Porque essas permissões são necessárias? Quando for possível usar sem as permissões melhoro a avaliação.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRmdoZk9sY09zeDBUVnRycV8tY3UwcGNjem1HVnJwZHh6SXI5WUo5b3UzZzhtZHJvaUJzY0NmRTlqSGRya05ObFo1QjY1VjdSOWxSLXBh",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Vadim Peretokin",
        "comment": "Works well, but the car colours are not translated and the in-ride distance estimation did not always work.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRkdVdEJQbmt3U2RHS013TWJncXVJcjFELXFFbVExOXg4R3lSYVRSaXprZ0J0djhjLWlxOEJodVlPWjN2MEZ1ZGtwZkRpdVBydXNWaEY2",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Matheus Gelinski",
        "comment": "Simplesmente não consigo definir o local de partida, precisei chamar para minha esposa que estava em outro lugar, o app me força a definir o endereço exato, sem deixar escolher no mapa!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPR0dqOGVaY244S1FPMUZaLUlCMkJvYXdBcGJDbmx1VGVGdWt0ZjNwWHlxcEI2MDVZSWtfb3JDOHlRdFcwOXBiZ1EtbzFiTWZiTGxNV1RH",
        "reply": {
            "author": "99 Tecnologia LTDA",
            "content": "Oi Matheus, estamos sempre desenvolvendo melhorias para o nosso aplicativo, incluindo correções de bugs e novas funcionalidades. Agradecemos o seu feedback e vamos compartilhar com nosso time de desenvolvedores. Um abraço!",
            "date": "March 4, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Rafael Ortiz",
        "comment": "Tem sempre aparecido um erro ao compartilhar uma viagem \"Não pode encontrar a localização no momento\" desde a troca de aplicativos. O mapa fica em branco marcando somente horário de embarque e desembarque do passageiro.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSHpTUUpZdndZeng2OTJIRUJnUzctMWxwcU5DanE4VF9HeUNaZ09nVE9iN0VoTnZ6VnVObVJJWlNIbThlMmR3M28yblg5QzBMTUpJVzhZ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Feel_the_Beat",
        "comment": "App cada vez pior, várias corridas com problema e o suporte não responde nem soluciona nada.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPSDQyd2oySUd2WXhwcXNubTEweU5tTGdqVUg2Y1ZEZko1bGlGcVJHaktCLTBpUC0xb0o5cGhrYVhWZ2tTRnNBQ2xieEp4SzlRaUdDZzlJ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Moyses Souza",
        "comment": "A nova versão do app é péssima. Não consigo estar um endereço com precisão.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.taxis99&reviewId=Z3A6QU9xcFRPRUtfQzZKSzZaR2g3QU1BQlBIbWZkWi1PS2wxR2tiRXN5YW9HcGdWdFB4TXJZN2p2ZVQ0LTI5LTUxbWtZVkZ4Z1JDeERvUzFhekhWemxH",
        "reply": null,
        "star": 3,
        "title": null
    }
]