[
    {
        "author": "Trincay 80",
        "comment": "I have used McAfee Mobile Security free for for my phone for over 2 years now and am very satisfied. Notice it doesn't have a firewall like my PC Total Protection. Had to use another app. for firewall which allows  me to pick which continents I can block. This would be a great feature to be added to McAfee Mobile. Also noticed you can restore  contacts but nothing else. Instead of paying for Mobile it would also be great to combine with the  PC Total Protection. Love my McAfee products!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRXRJUjRYTTZxeExNN2tIWTR0azJrYU9uTWVDMzUtX2Y5UE5xZXRjc2ZZSF80VmlIajJhWXYzR0xlYldPYzBtQy15ZHg5eEg4RmtieFVTeXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sharon Briggs-Bumgarner",
        "comment": "I purchased McAFee Security Software for our family. To be honest, I wasn't expecting much security for the price I paid for the McAfee 10, which was at as a Prime Deal on Amazon & even though I had used McAfee before at a much smaller level, it wasn't anything special, if you know what I mean. Man, was & have I been totally shocked. McAfee is unbelievable how it protects our family. Excellent purchase on my part!!",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSGNiZ2w3RThwZzZEZ3Q2bFNIRVo0OFJybWx3dTNKdkxSWWdEdmtheDlGRG1UT0lkSzFYQU1ZVzczakV3S05zV1N4WmhYRUo1TjRhSEJMVlE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Sharon! We are super excited for you! Thanks for choosing McAfee. We always strive to give you the best value for your money. We are glad you are enjoying our security on all your devices :)",
            "date": "January 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sam.L AV17 [SamAV17TM]",
        "comment": "This apps using a lot memory make my budget 1gb ram phone slow and lag. I really like that concept shows my phone performance on right screen this should be every 7 minutes to tell your phone performances.              Thanks. Regards, Sam",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSDBWVTdiR0pRNmk4dUhyd3cxRW5nejJsSFVSUDRrMlpxSHhyVThMXzJlZ3JIR2puTWZYNEE5c0VCSUlGaENoalZMdDlVRVUxQUhJM2VvdXc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Sam! Thanks for reaching out. We would like to take a look at to your configuration to see what's causing the problem with performance. For immediate assistance, please reach us at service.mcafee.com. We are available 24/7.",
            "date": "February 23, 2018"
        },
        "star": 3,
        "title": "I like it but using so much ram memory"
    },
    {
        "author": "Stephen Gallop",
        "comment": "This app is great at protecting all of my devices with the exception of my huawei mate 10 pro... As it keeps switching McAfee security off not sure why this is?UPDATE 25/2/18 problem seems to have resolved by deleting a duplicate network provider app thanks for the response McAfee",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPR0ZhSzczNG9JWUp4azZuUW81WV93MmlRSk9rbXdqSTl0TVVwOGI0bTNKd05FSmlKWGlPRFlnVVh5MW5nbjIwQ2FyQjc2YVVPRllFWFJReUE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Stephen! Thanks for reaching out. We would certainly like to take a look at your huawei phone to ensure the app and device settings are configured correctly. Also, please check to see if accessibility has been turned On for Mcafee mobile security in Android Settings. For assistance, please reach us at service.mcafee.com.",
            "date": "February 23, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Bells and whistles,ahh,no.that's for kids! 100 percent detection of newest and oldest viruses by AV-Test?...YES. McAfee keeps me from having to buy a new phone and keeps me safe on the web. One of the very best in the security business  and they are known for it...I NEVER HAVE TO WORRY WITH McAfee. They are only rated low because of people wrongly wanting fluff instead of realizing this is TOP SECURITY. PUT McAfee on your phone and play and go to sleep with peace!",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSDdtTFpBYUIwNzh1c1lkSEdsTVpIejdwTVlELWRIYkFyQ09DMkYwTDNzQTV1QzhvSkhKSmZDa1JYU2Fxd003Si03a050X2dJZHlBV1FWbVE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! Thanks a lot for your trust. Glad you like our app. We are sure you will continue to enjoy our security experience :)",
            "date": "February 24, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Chris july",
        "comment": "Was a great product for a smartphone. The latest updates now don't allow anything to be done other than optimise all. Other options are still available but you can't access them. This is on annual Xperia and same issue on Samsung S7. Please fix!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPR19uTE1oN2tyZkd2d1hkSkM5MUg2eFRTNWplb3NQN1c2NHhYTW1nSHVwbFJKTnVDT0F2eVZ5Q2tuYXdWSVE2M1NjV3dVUzN6eDdidk1rZWc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Thanks a lot for the feedback! We are glad you are enjoying the performance.",
            "date": "August 15, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Feel like Web is safer for me, always informs me that I am protected when on web. Have had no virus, adware or other problems. Warns if a website is dangerous or suspicious.  Definitely Do recommend McAfee for your protection.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPR2pCTV9kUDM5VnN3Rm1zYzJicE11VVRVMy1yaG9NcjVXQjBMZ3pFejFabVZhSUU1RDFXR19QNVh6UUh5ZFhzM0ZxdnU5NTRfTEhuV1g4N0E",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! We are super excited to hear that!. McAfee has one of the best virus detection rates.Thanks for the recommendation, it means a lot :)",
            "date": "March 1, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Steven Wicks",
        "comment": "The latest update is draining my battery. It's using like 10% an hour even when my phone is idle. If it carries on i'll be unistalling the app.  It's kept my phone, PC and tablet safe so can't complain. Feel safe browsing on any platform now with the warnings about the safety of certain malicious sites",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPR2VsOVBUVmg1LTIwdmhjN0taQ01ieVBjUTdzZEhVSlZ1WkkwdXdnMFF4YWs1SWlYcklGc2tkcXREdEZMMXl6Umh0TVVtWFl1d3ZKN1AzQ2c",
        "reply": {
            "author": "McAfee LLC",
            "content": "Thanks for the feedback Steven! We are glad you are enjoying our security on all your devices. Regarding the battery consumption, we would like to take a look at your app and device configuration to see what's causing the issue. Please get in touch with us at service.mcafee.com anytime. We'll gladly assist!.",
            "date": "August 16, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Fred Burden",
        "comment": "Have used McAfee on PC for 24 months now added it to tablet and phone. So far very happy with all platforms. Bit of a problem with my kindle fire HD 10 so trying to install from my account does not work as the app is not available in Amazon app store. Managed a work around but can't use find with it so only 4 stars.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRUJqZVkySXNraUxoSTZmQW9kNTZnUEdqU1dTSEJwTmlfR0pYdzUzMGVyWC0xeEd5dzZfNWxaZVZ0Q1hFNUVwR3RvVmctUm9lNjlUb3h5S1E",
        "reply": {
            "author": "McAfee LLC",
            "content": "Thanks for choosing McAfee! You're a valued customer and we're really happy you're enjoying our security on all your devices :)",
            "date": "June 29, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Elwin J. D'souza",
        "comment": "After the just very recent, the app had made my MotoM phone hideously slow. I just uninstall the app and it's working fine.. thank you.  Dear McAfee, please rectify the application and I will install back",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPR3ctRVpqQ21rMUhrM1NYSC0yUWZnZmFpTjRBVkRoeGlEbjI4QVFPZ3pqNGk4U1FLQ3FuMGZfVEV6SWNKYnNPWEM1al8tdUFVMDlZdVVCbWc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Elwin! We're sorry to hear about your experience. We would like to take a closer look at your app and device configuration to see what's causing this issue with performance. Please get in touch with us at service.mcafee.com anytime. We'll have one of our senior level technicians help you out.",
            "date": "February 21, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Jeff Brown",
        "comment": "After recent update I forgot that McAfee appears to require you to reactivate the app. Started that process but it continually tells me it can't connect to the network. Everything is fine with my Wi-Fi and I'm concerned that in effect McAfee is no longer working on my phone.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRmNOYUU0a3pCTEFNOVdKbUEtY3lCSllENk43aU5sVDhoUHhOZWxqRF9fRHA5SHhRYVVyX3FFbi1HOTRqS3RfQi16bG43YW9zMVZYOU1Pdmc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Jeff! We would like to take a closer look at this to see what causing the problem with storage. We will certainly share your thoughts with our development team. In the meantime, you can get in touch with us at service.mcafee.com for any clarifications, we are happy to help!",
            "date": "September 17, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Ralph Pacheco",
        "comment": "Amazing app! Easy to use and does everything i need. The security makes you feel comfortable especially the browser it doesn't give you a fake website and if you lost your phone just simply turn on the tracker. Great app 5⛥!",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRnpHSHpueXAzZXJKZUJUZ25sVlA3Vm80aGhiVTBSWWxibXZvTHdmSEozQmQxd1NydUhpWkRCd2dfY05MYndSU1NocDVaLWNLRU82ekRQdGc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Ralph! Thanks for the feedback. We are really glad you are enjoying the features and functionality of our app :)",
            "date": "February 21, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jatish Shah",
        "comment": "A class apart. Absolutely superb all round protection. Very easy to use. Updating, locating, wiping data, locking device, blocking phishing, whishing mails and malicious viruses, trojans, worms and fraudulent websites. Everything needed to protect your cell and its data is there. McAfee is just fantastic.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPR25yS1pZWWxBYnBqb2JMZHZpRFRqZUllQ2wtVnMwUDNiMUN0cGVyQmo1dk9WakFqR1dhVHk4cTN5VVRkZ0NKel8wekVKTzNwdWsxajhMOEE",
        "reply": {
            "author": "McAfee LLC",
            "content": "We are super excited to hear that you are enjoying all the features and functionality :) Thanks!",
            "date": "November 10, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jeff Leech",
        "comment": "Was a great app until latest update.  Now all the functions go to a black screen.   Uninstalled and reinstalled, 2 days later same problem on my galaxy s7.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSEtNaUY4T01NSWdqRGh5VEZEWlNKVmtKMzNHdkpKVlhsRDhmcHJSWGlEdjI0QWNBS0R1V2Yyd2UyN0RlRkVVcEZHekp0clg1NHhyZEl1aXc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Jeff! We're sorry to hear about your experience. We would like to take a closer look at your app and device configuration to see what's causing this issue after the update. Please get in touch with us at service.mcafee.com anytime. We'll have one of our senior level technicians help you out.",
            "date": "March 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Thomas Simon",
        "comment": "Great app, easy to use and does everything I need. I only gave 4 stars because they don't allow a second device for the annual fee like other companies.  If you are like me and have a phone and a tablet then the $30 each annually is a bit much. I had Norton before this and had problems with it crashing but at least the annual fee covered both my phone and tablet.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRm96ZFYtQlg1X3Z1d0FfRkFSZmNMbG5GaVhGUlR5ZTJBcjcyNGl5WkhLX2VTMHNZTTJwR0Z6U3ZyLVVIR2czT3FRbDdrMU5hV20wV1E1LWc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Thomas! Thanks for reaching out to us. Glad you like our app. We do have subscription packages that can be installed in multiple devices. We would like to talk to you about this in detail. Please get in touch with us at service.mcafee.com. We are available 24/7.",
            "date": "February 14, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "R B",
        "comment": "Sticks its oar into everything & McAfee seem to think they have the right to rule your life. Privacy nightmare.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRnZRckc0V29KRnVxWmRBUmZtTE9TbGtYdG9FWDJVekJXREpkLVMzNWpRUDdpUlNaclBFNGwxbUYzRWNPeXpCNC1SWXVuc2ZHQjBzX1lGX2c",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! Thanks for reaching out to us. McAfee requires a few permissions to ensure that your device is secure. This permission helps with backup and anti-theft security. This is done at a device level and we do not have access to your personal data.  For any clarifications, please get in touch with us at service.mcafee.com",
            "date": "March 4, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "John Moore",
        "comment": "If you like your phone that slow and needed to be permanently connected to a mains supply then go for it. Yes it does what it says ok but God I just wanted to through my phone at the wall the only thing saving it was the cable attaching it to a power socket. Since removing the app I have charged my phone twice in four days instead of putting it down on a charging plate everytime I sat down",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSEllU0N4ZEZubktvSjFMbWQxZDRDVWdKakFhTG9ZamlpRVd6VmNVNUt6NW9UY3lOd29ZeG4wRnBnTVBnOTRubEF6bjFyVEZrT0Z0Z1pZRUE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi John! We're sorry to hear about your experience. We would like to take a closer look at your device configuration to see what's causing the problem with battery consumption. Please get in touch with us at service.mcafee.com anytime. We are available 24/7.",
            "date": "February 23, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Pat Bubba",
        "comment": "EDIT (2-12)I like it again.  I did have to wait about an hour and a half before seeing the next screen which was the update info.  After that,  the menu came up. I'm thinking maybe I'll be back in a bit too re-evaluate the five stars.  I usually don't max out, but I was impressed at first,  then the most recent update hit.  I'm still trying to see what, if anything it will do to my battery life.   EDIT (2-11-18) I did like it.  However, since the most recent update, I click on the icon and the app page appears but nothing after that.  My phone turns itself off before anything changes (2x so far).  WTH?",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRnVKNEZEV09TRFVTUk10RUN4d0VuUVJJcFIzcjdsMml4YXVUQkF3TXZ3T3ltVDlvVU5oRnNaYTFYQ0FTLTJnamVKT3RORmNTd2Q0UlctMVE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Pat! Thanks for taking the time to post a review. We are sure it will meet all your expectations. If you ever need anything, you can get in touch with us at service.mcafee.com. We are available 24/7.",
            "date": "March 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Niamh OSullivan",
        "comment": "Everytime I update this (fully paid version) it hangs opening and I have to uninstall it again. Sick of it especially when I have paid for this.  Thanks for the reply, it's actually working again after a few hours!",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRmdhNE1CQTh1OC1KX3k5SWNxbmo1N0pULUV2YXo2dTVZem5MM1lwOWJiR01PS1Q4c2lTcGxVNlp0NnNOVXAyMGt0ZVByOWNoRW5OX0ZSZEE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Niamh! We are sorry to hear that. We would like to take a closer look at your app and device configuration to see what's causing this problem. Please get in touch with us at service.mcafee.com. We are available 24/7.",
            "date": "February 15, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Been using freebMcAfee since the early 90s on and off. Just came back again, I think  that this is one of the best or the best A/V they have on the market right now so I bought it u should too",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRklPbGVpMmJZclhVaEtPelNHUXJxV24zMUNVeFF4d09fMGdsQkZVSUY0Yk5LTVJXbDVNclBiRGxPU3BLT2F0M2FjSHkxMWlVY3pyQnBLVGc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! Thanks for choosing McAfee. We are constantly working on bringing you the best security experience. If there is anything you think would rate us a five, please feel free to let us know :)",
            "date": "January 13, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "My previous review was for 3 months of use and I haven't anything more to add other than to reinforce what I have already said, that it is worthwhile having. I still feel safe and secure whilst using the app. I have now been using the app for 6 and a half months. When using the internet on my phone I would prefer it if the apps web protection would highlight either the good or bad websites so I would know instead of guessing which ones are safe. The app has had a revamp and it looks good and performs well, keep up the good work techies.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRWI4c1JYdUV3YjF4bXdtVkQ3STlZYWtyTndJVEE3Zk55SWl6YUE0VEpUdjFBdW9GOGlHazlBUDVwYjlCZkhJaS1nbVludnBmcEEzSGgxYUE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! Thanks for the great review. We are really happy you are having a great experience :)",
            "date": "March 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Do not Download this app. It creates 2 malware folders on ur phone called air and gosdk. I read all about it online by google professionals. It says that their goal is to try and get ur credit card info and other valuable data.....\"U'VE BEEN WARNED\" ❌🛑⛔",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRU8xMkVEal9YVURvcGVpeG9OMjRjNE9wb0hGb1hNS0FCSWhDbU9ZY0U5TTQtTDNTR0h4RUtINGF6YnJmdlZOcVFiM1lNSkV6cVFIaEI4bGc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! We are sorry to hear that. We would like the opportunity to speak with you and clarify all your concerns. Please get in touch with us at service.mcafee.com. We are available 24/7.",
            "date": "February 13, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "PanKaj SiNgh",
        "comment": "Installed it as an antivirus. Bt damn i wasn't sure what slowed down my phone. Damn after uninstalling my phone is so amooth. So came gere again to give it least score.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRkNydV9fSEFTZmZZS1lJOWR0RDBsVUJ5UzU4bkVHc3VURVo0eXU2M3ltYUFIeDlOMW9ESzNjNXNESFA2cE1CNDFfb0F2RS16QzZsNUhUNXc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Pankaj! We're sorry to hear about your experience. We would like to take a look at to your configuration to see what's causing the problem with performance. Please get in touch with us at service.mcafee.com. We are available 24/7.",
            "date": "February 15, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "after using for long time  i found some issues booster and cleaner does not work properly . it shows 150mb-500mb junk removed  but in reality zero mb junk removed from phone and consume a lot of ram and cpu usage",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSDFvbE5DOV9QMlUwSmFOQi1QQlNMMjI4YWczZ3dwRGxTRGozdGNZOWphNnE5dk43VUxIWDB0V01FcFNmRGw4WjdtVE5XTTFYQmpLb2xPQUE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! Thanks a lot. We are glad to bring you the best :)",
            "date": "December 15, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "McAfee: Sorry! But not having a call & text blocker working above \"kitkat\", well! That's a \"BIG DISAPPOINTMENT\" for me! so unfortunately it'll be Goodbye from me at the end of this trial period!! 😞",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRmVPYzBWRlBZcFM4RDBWWVgyb011TUtOR29zN1A0VWtMaWZqeXlULXh5TUJGNUdoeVI2SGkzVmtmZjBWcHRHdlNHYVJObkx4Y0NtMTdyUXc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! Thanks for your feedback. We always strive to give you the best value for your money. We would like the opportunity to speak with you and address all your concerns. Please get in touch with us at service.mcafee.com anytime.",
            "date": "January 13, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Ally Hull",
        "comment": "This app was a total waste of my time. I factory reset my LG G3 and it completely locked me out of my phone your company cost me 8 hundred dollars. Thanks.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPR2NoZUNwN09WcVU5QmhEV1VCNXhwclRCWWlfaXNFMGdicG5zZl84eVJpeHVqRVdmcEtRNUFMNlpmTk9razBzWUhRV0V6OVBWU2FxWUdfMGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sojankchacko Chacko",
        "comment": "Actually it is a good software and my other mobile devices and laptop are secured by this. But unfortunately it's not working in my Nokia 9 mobile since the last few days. I don't know what to do",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRWl6Wl9ITVBZcUxZdl9YSFVTUjBqSUR5ZG00S3hRMWRlTHd0QlltOU5pSVlxM2dHczJYelZPSkZuWkpxLVdRT1JHZnE3SUdvYVRyZmF5bnc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Sajan! Thanks for reaching out to us. We would like to take a closer look at your app and device configuration to see what's causing the issue. Please get in touch with us at service.mcafee.com. We are available 24/7.",
            "date": "March 2, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Greg McNamara",
        "comment": "Some good features but shame about the call blocking feature not working in Android 4.4+ (basically all current Android smartphones...). Wasted hours with McAfee support trying to get call blocking to work, then just read on Play that it isn't compatible with my phone. Why even have the feature appear in the app?",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSDNFekxhS3V6b0xqdlB2eFYxcTVTRTZxdHlhTjlGbTRtdWJNRFpwenp1QjBjU2ZyOHRNNWlqTUVoX2duUEpNUHB0S3h6SkFVbldYeTNNaHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "jeff gorton",
        "comment": "I figured I'd give it a try since it came with my subscription,  and I'm glad I did. Works great , seems very light on the processor,  and let's me know so many details . Review is still just as good, feel much safer having it on my phones. Used it to locate a stolen phone update: worth every penny. Thank you for an amazing product and ease of use. Saved me 800 bucks and let me catch some worthless scum. Update on 9-27-17. Review is not even enough to say how much i like the product , and I've added a smart watch since and it's been great. 12-15-17: update review. App update ruined it. I no longer can do many of the options I loved. Cannot locate devices anymore. Gives me a login screen where the map should be. Even when I login, it gives some cookies error. I can verify I let cookies be set and yet locate service still will not work. I loved this app for years until this week. Fix app and I'll review again. So so sad they ruined the app for us paying customers. Pay my fees every year . If they don't fix app I'll cancel and find another provider next week. 2-11-18. Bugs seem to be fixed, back to 5 star review",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSDZhbU50MFllb295RS1hZTc5Q3ZvMm4yMmljVzF3VDY0M0lLVFJGaEJxTkJNOHhfMGlvWVRKQ2NjVUxqMTVnOWhxMDN4cjhNYm9TTnlFRFE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Jeff! We always want to bring you the best experience. Thanks a lot :)",
            "date": "September 16, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "After the latest update of this app and my Oneplus 5's update to Android Oreo, it stopped working.. Whenever I open the scanning option or the battery optimization option, the screen goes blank..",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPR2luam1uN0RSZzNrSzdRMEpFTWlKemgxMk1OQnFjY201a2Y2NUxRcE1uTTlrcURfNl9sMWJZeEVWMHpJeWQ1U3gwWm05NVNrR0hsWVhDZFE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! Thanks for reaching out. We would like to take a closer look at your app and device configuration to see what's causing this issue after the update. Please get in touch with us at service.mcafee.com. We are available 24/7.",
            "date": "February 19, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Roy Eastham",
        "comment": "I have McAfee through my T-Mobile app and it's supposed to protect all my devices... not being able to here.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRXRub2tOUEJPMFc4WFplNG9rcl80X255OHB5U0VHQXFjQWgwaVF4WlFJU2lHWVBKNml5NmdONkJXZVp0OFBJczF6XzlJV2U3STBsRDhhclE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Roy! Thanks for reaching out to us.  If you have any questions we would love to clarify. You can reach us at service.mcafee.com. We are available 24/7.",
            "date": "February 24, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sunny Ahlawat",
        "comment": "App is great but drains more battery. Please add some security features like : Remotely wipe SD card, whole phone and lock the device by simply send a sms.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSGRob1oyT290RVNndXJQOW03WUdrb2dkbG9nVnhQUDNyaWpkem0wWnA0SkVkcFVtT2xWRmY1VnpzVFhJN091UWlxNWV1WUVQMElFa2tLYnc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Sunny! Thanks for reaching out. You can send the text 'Secure lock ' to lock your device. We would like to talk to you and address all your concerns. Please reach us at service.mcafee.com. We are available 24/7.",
            "date": "February 24, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Nicole Joyce",
        "comment": "Bought the Total Protection service for my Laptop and synced it with my android. Feel better knowing that both are safe. The programme is easy to use and setup and can use on five devices which is a bonus. So far so good!",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSFpBdnZVazVkWXlOUXUwLU9QRFVVSE1JSUFZRUNyT002UkkzX0ltTm1aSUQ1RXMxZFRjYklCNVFCaldlMWIwMDlOUGdxampzUmlaSkJVZFE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Nicole! Thanks a lot for your feedback. We are sure you will continue to enjoy it. McAfee has one of the best virus detection rates. Your device is in safe hands :)",
            "date": "February 21, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "riddick",
        "comment": "can't get it to quit sending me notifications in my status bar about running in the background.if i wanted to use all the features i would.don't need constant reminders popping up two seconds after i swipe them away.so frustrating i'm thinking about uninstalling.....dumbest response ever,just stop your app from pushing notifications to my phone about turning features on i don't want to use.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSGhwelVWMVk4ZFUtNFdQOWRlSFJjUmVDdUtXeHY4ZHBxbDU2SzJFVVNhTnd5SU9yU2I3UUN5a2wzMVB0TVBrbk9jb0RJLVdleXN0Q2piR3c",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi there! We are sorry for the inconvenience. We would certainly like to take a look at your configuration to ensure the app and device settings are configured correctly. Please reach us at service.mcafee.com. We are available 24/7.",
            "date": "February 15, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Mark Linehan",
        "comment": "Originally bought this app to protect home PC and laptop, added bonus of protecting all devices including tablets and cell phones. Can locate lost phones and remotely take pictures of people trying to access phone illegitimately and lock and wipe device to protect data. Can also copy contacts and media etc to copy onto new device when you change phones.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRndLcXBQYzQ1eUpPTnVOaU5CM2RpMXpTU0NuYmtwMHJ3UTFzdENwQkVHY3NKel9TR1F3N2ExYXc2MGJEcmRrWjR2LVFIblVsUWRfZjBJZnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Clive Hull",
        "comment": "This app was alright but since the latest update you can't do a security scan, clean memory or  clear junk.  It might allow you to do it sporadically but it's not performing now.  Hope this gets sorted soon. A brilliant antivirus app!",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPSGRrQjdzZndNbkEzdGVIc2pPbHl0T3NXcmZWZXljRW5hejd5LU4zT0hiUnJqd0J3bC11RVlVc3oyT05NNHpOcF9HQ3VLQkpYMGRDRVoyRWc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Clive! Thanks for reaching out to us. We would like to take a closer look at your app and device configuration to see what's causing this issue after the update. Please get in touch with us at service.mcafee.com. We are available 24/7.",
            "date": "February 28, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Steve Da",
        "comment": "Its good. Just using a pin to open up whatsup every time is a pain",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRkFQejFnLVg3Q2Y2cTVjWndzWlgzVWRITlVBaGdzU1JpNmZ5WVd5WXFzaXFaQmdWVlNpbF9MSVVCT0d5TURZdm5nbFFRdF9LOTlLQXVSTEE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Steve! Glad you like our app. If you have any questions we would love to clarify. Please feel free to reach us at service.mcafee.com. We're available 24/7.",
            "date": "February 20, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Ben M",
        "comment": "Nice easy to use security app. However, I don't like to be suggested to download the VPN app every time I am on a public WIFI, while the VPN app is not available in Google play for my area.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRWpaX2RiNks4RlRPQ0k0YThra0dWcS1pbks2S2x4OHNOaThHQVV5VjJKdFN4VG83bDBpVnFWYWZWUDh6RWZsdmpqVS15Y1k4RDZJWDc0cFE",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Ben! Glad you like our app. We would like to talk to you about the VPN app in detail. Please get in touch with us at service.mcafee.com anytime.",
            "date": "March 2, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "John Graham",
        "comment": "This app is superb and offers so much. I have paid for a year subscription so if i want to reset my device and do a clean install how to i activate my subdcription again?",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPR0ozTV9kR1RFTW12U3EwRDFYZHJLNlBGeDhoTjRZNDNPcWs2VVJvc0xJdzJSTklVTXNpVXU0THF2TFR2SUxFZDI4VnJGWU42MlBfZnRQNmc",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi John! Glad you are enjoying our app. You can reinstall McAfee app from Google play store and activate the app using your registered email address and password. For any assistance, please reach us at service.mcafee.com anytime.",
            "date": "February 21, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Subrahmanya Kumar",
        "comment": "Hi I have issued many tab for billing and feedback in hotel setup the employees end up using all data and the application slowdowns once that monthly quota over. Will this application help to log there activity so that I can track them.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.wsandroid.suite&reviewId=Z3A6QU9xcFRPRUxZM3N3NmV3N2hLRXl1UElNTTduZXRyb1p0RnB6XzZiNXdVeS1TMnh5WGhlTEg2QXJyU0FBSkQzVGFOLS1MTEZXZzFQOHRTMjc0VzNoS0E",
        "reply": {
            "author": "McAfee LLC",
            "content": "Hi Subrahmanya! Thanks for reaching out to us. We would like the opportunity to speak with you and clarify your concerns. Please get in touch with us at service.mcafee.com. We are available 24/7.",
            "date": "March 1, 2018"
        },
        "star": 5,
        "title": null
    }
]