[
    {
        "author": "Soa Firdaus",
        "comment": "I've just upgraded to annual premium user. While it may be pricey this app helps me to track my nutrition intake. I hope the nutrition information will also includes the micro-component of foods such as vitamins. You guys also should put the suggested nutrition intake should be taken daily by each demographic. I believe the apps will more worthy with such addition",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRUwxSHJDOVV0RV9oNnY0c0dvTW9jejdseGtJMEJDYVBKZ0Zta2tqa0lWOFNnYWdFUGt0ZFlOREJ2N1lpZXJ6SWJBNGlKM3ZiTGdaRnJjOFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lee Ford",
        "comment": "Great app. The only issue I have had is some on the foods I scan show up with improper Marco counts. But other that that I cant track the calories pretty close and my exercise very well. The app allows you to really focus on other stuff while it keeps focused on informing you when you need more food or more fat or more carbs or protein. Thank you life sum...",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSEVYNjJBcTBBai0wNGpvUERod3o0YjdqXzI1MWc2M2dONU51WU5OcTBYblRndkpvQno5dTlKbUdrb2Zpa3lUdVZ2aDlOTFg4VExaYk9mUFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Taylor Robb",
        "comment": "Slightly disappointed. I chose to pay for premium after selecting to do the 3 week challenge. I wanted to start with that to change up my habits, but after I paid it took that option away and selected the keto strict option. Now it won't even give me the option for the 3 week challenge and I feel I just wasted a bunch of money.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRXl4NTlmclFTWnJuMmp1eWxSNW1EbkowQURhaC1BRHFKTTE5Q0d1X1ZqVVRLZks2MV9adkdCSHB0VENtdC1RWF9iXzJNdGs1b3FfaVhUSnc",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your feedback! \nIn order to use the 3 week weight loss you must have the Classic/Standard diet so you can see it under your Plans. \nPlease read more about the 3 week weight loss here: https://lifesum.helpshift.com/a/lifesum---healthier-eating-better-living/?s=plans-nutrition&f=3-week-weight-loss&p=all",
            "date": "March 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sam Evans",
        "comment": "great app however I think your premium is lacking for it's price. A few things I would like you to add are: •vitamin tracking and information  •More of a social aspect like Samsung health has •Cost information on foods and diet plans  •More customisation in terms of the colour of charts and maybe add some themes",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRTJBWjF4WE9ycjlWQXQ2VS1HMGZObWpYUkh2ZVFGa3hZczlud3lTWm5Eem1PUThXNEtzRnk5SFFhekY2Y1pTQXNQUDNYV3gyeGRCaTM0TFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mariya Dawson",
        "comment": "I like this app but I think the work out section is too simplified. For example: I worked out on the treadmill for 30 minutes, going 3.5mph on average, and a total distance of 1.6 miles. But, when you search treadmill on he app to add your work out, it just asks for the time spent on the treadmill, but distance is just as important. I love every other aspect but I'm not sure how to keep track or how many calories I am truly burning on my work outs",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPR1pZTlNUcHBLMlRrbnVMbTNUbS10WllNODE3aUI0ZzdRUW9CR3dTYXJacTRfY2piclhndmc2VzJtTWQ4c01qMUpwVXQ2R00zemh6ZXBfUUE",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your feedback Mariya!\nPlease feel free to create your exercises under your Favorites.",
            "date": "March 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Bradley James",
        "comment": "Great interface overall, easy to add foods. Database is large enough I haven't encountered any issues.   *Edit* a bit challenging to fix incorrect calories or info on food, have found a few more errors than when I first rated. Social tab is sorta worthless as it just reposts your foods which isn't really appealing. Notifications are encouraging and great though I wish you could edit time for regular meals as I'm a late riser and it always asks about lunch when I get up . Water tracking is great and adaptive with exercise. *edit*",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRmU1U1g1eW9HckZnY3NXcnBFYllRa0lKSWlqc3N4VmVkLUlJT0wxUUlWeEJEcXg0RS0ySDhjZWpzTmhaaS1yd2pscDA2elRaQ3ppVEF6d2c",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks a lot for your feedback! We are very glad to hear that you like our app!",
            "date": "January 29, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "esther jung",
        "comment": "I ABSOLUTELY AM IN LOVE WITH THIS!!! It's easy, fun, and helpful! Out of all 7 apps I downloaded this is the BEST!!! O habe one problem thought I don't know where the diary is..so that's my only problem with this app! Amazing 10/10!!  😍😆😋",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSF84ZFBEV0pBX0trSFdrX2llWUplM0ZNS2VJZXE0VjRQQzhMT1NPaXFBZ2oxVjFfOUliTmZVSE5lNGZYdGtjU0hIVnIxOVlNbjZPVkJVbkE",
        "reply": {
            "author": "Lifesum",
            "content": "Thank you for your great feedback! We are very happy to know that you are satisfied with Lifesum! Your Diary is your main page - the page where you lend when opening the app and which contains your meal categories and life circle where you can see your calorie allowance and rest of your tracking details. Good luck with reaching your goal! :)",
            "date": "February 28, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Vocanime Productions",
        "comment": "I love this app and I use it everyday, but can you add a time stamp to when you add foods? Also a recommendation what time to eat...? Please consider, thank you! I have hyperfocus with my work and I skip many meals by mistake.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSDdQV3lZWldTV0JWVG9tM1VzV0ptcGE5UF82STV0Q3JfZzU0eDlIZDRlSllUNWszbDBBdjFKcDFkU2dNT00tZ0hHdW1pdTU5cDN2clZzWXc",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your feedback!\nWe have fixed the issue. We apologize for the inconvenient.",
            "date": "February 28, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Philip McElroy",
        "comment": "It's a really great app for tracking food and workouts. The only problem is the recipies. You can easily find them for free online so there is no real need to buy the subscription.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRThOZ2lBb05FcUxFNlA3VTJhYm1kcFpVTGJxb0Q4T0RsNVFsa1dWbzd1Tk5pYzNMdGNtc2lWUThNRXRTRmhkY2VmVy1YdkNvTDF6aFhMelE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Natasha Haworth",
        "comment": "Love this App simple to use. A few entries are off but I just make my own and enter them in. Always check entries just incase someone else has entered it wrong. But yess would recommend to anyone.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPR25FRllJMURqbkpfWHJ6V19pVjFpRG02bzRSZk94c2gzR2Fod0NOU1gwVGNmTGhoMGFzTFFxaTNwTEZXbmlPZzI2RDlHM2NYTW4wUmdHcnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mohammed Alhusseini",
        "comment": "A fitness tracker that is fairly simplistic and sleek. Although it can probably do with addition of a few more features as it is lacking in that department compared to more established fitness and nutrition trackers such as myfitnesspal. This is regarding the free version and not the paid version of this app so it may not be so fair to be too judgemental of this app based on that fact.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRmNLSTByMUQ1SzJqM2NUSG1laUxNV3FjODU5WkZ1M0lZZWc0NWxFY3RJRllyVHRfZzdDdFRSbi0yeHotY0l0OWFEWTFTSGpkMFRzZFJMOEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "MARCUS ROSCHKE",
        "comment": "Very good at all.  Only problem: the \"update your weight\" function has to be set two time in a row, because the the app doesn't save the first weight",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPR3gwUm4zSXgxZ1dWLXc5cXZpVVN4WXBJUWYxZk4xZ0pWLTloUWk4UkNqcDVLU2JUdFVfWFZGby1sNV9XdkRVcjdFdzl4TzFVeW1BeE0ycmc",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your feedback! We apologize for the issue you are experiencing. Please feel free and contact us with more details at contact@lifesum.com so we can start investigating your issue. Thank you!",
            "date": "March 1, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Great app for getting you into the routine of tracking your exercise and eating habits. I'll continue with the free version while I'm getting into a good routine, but as the weight drops off (fingers crossed), I shall look into what further support I would gain from upgrading.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRmhrQ3Y4dUNrbU1LcE5JZ2xRMWs0UW9yZW5iY3BrZFZ4aUhPWFhTbTZuamlmYVJJb0FYYjJldHJTal9GLU5venJyeER6ZTlUQnp4S1Z4TFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Stefanie Hall",
        "comment": "Over all I like the app BUT the food part isnt good. I paid for 3 months so I could save recipes and look at a breakdown of the foods I eat per the grade but theres not much there. Also i think a lot of foods are missing or the same food will have a bad grade and good grade. Makes no sense.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRXloajVyOUJsZHJtS1JrWXZoVk1QaW1hMmZaY3pINml2eGJNejNURU55d2x4cWs3eGhLVXJzUzIzRmpUMEo4MFQ1MmVuMV9hRHc3WWpsWVE",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your feedback. We're working to add more recipes to the app and please read more about the food rating: https://lifesum.helpshift.com/a/lifesum---healthier-eating-better-living/?s=life-rating-life-score&f=food-rating---that-s-how-it-works&p=all",
            "date": "March 1, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "J Davis",
        "comment": "Nutrition info is all wrong. I just got the app and almost anything I put in for a recipe has the wrong nutritional information, particularly about serving sizes, sugars, and calories. I'm not sure if it's because I have a specific gluten-free diet and use obscure brands because of it, but I am upset. The app itself is well organized and has a lot of nice features, but if the nutritional information isn't accurate, then what is the point?",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPR2ZLTEJPZFB5Z25LaTZ5R0lJNGdSMnRrYjU0dGdSUmJwYUUtTTJ4cUF4SE1ZX212a3hBWU9udG1VX1R1Q2ZJODZ3Y2hLSHoxQTJ0d1lER2c",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your feedback! We apologize for any inconvenient. The food data base is also made by our users and some items might have wrong values. Feel free to create your own items under your Favorites.\n\nBest Regards",
            "date": "March 2, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Douglas Friedman",
        "comment": "Overall it's a good app but the nutritional info on most products is inaccurate or incomplete even when you use the barcode scanner. Easy enough to enter the info yourself though",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRlVENmVDUTAwR0hRcjRhclFnTnJTcl9DbW5iaGVnSFlOMmxQQ1hRYTRlQVFEUDVycHR1NnhURE9RQjlOMTdKVTg4YkYwVnYzM01jWHdoSVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ashley Quaass",
        "comment": "Came up as a partner up in S Health, so obviously I thought they would work well together . . . They don't. Thought it might be because I didn't purchase premium version so subscribed for three months. Still does sync well so I've wasted my money. Also refuses to work with my Samsung Gear Sport. Very disappointing",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPR1dRTFgzTy1GeGlVOUFmOGU5akhhSUozaF9oS0JPbS04QjV3RlRDcS1tdXp5MHY2VnNURWREVVhrRGw2OXdPV3J6cFQxM1BxX2xHS213S0E",
        "reply": {
            "author": "Lifesum",
            "content": "Hi Ashley,\nWe apologize for the issue you are experiencing! Could you please contact us at contact@lifesum.com with more details, your email address and a screenshot showing where exactly this is happening? Thank you very much!",
            "date": "March 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Sharon Morris",
        "comment": "I love this app for everything it does. Syncs perfectly with S Health and my wearable device. So easy to use, good for setting goals, reminders are great, very intuitive, it tells me everything I need to know. I would give it 5 stars if I could adjust macros in the pro version. Funny because I can in the free version.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSE1FRFd5a3ZOX1J4RjlPTFhscTA3M29qQWMxcWdUWF9uLTZOVjB1RVZBLUpodlZral9SUnRQSm80N3lEWUlzRnVkbUo0NGQ0VFlSR1NEbmc",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks so much for your positive review! We're very happy to read that you are so satisfied. You can customize your macros only on two Plans: The Classic/Standard diet and the 5:2 diet. \n\nBest Regards",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "The very best of the best apps that enables one to count their carbs daily and adjust accordingly to make healthier choices. Awesome app. Not sure how you can improve on perfection, but I am sure you will find a way. Cheers.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRmFPUVM5OWk1RkVGaTlpRllMamZWamFpYzZfRnFOOVBBLUJ5LUMwby1LZEdNQUFuYlNUN0l4ZmRFVzNxQWlZWXowUXkzUGwyQWZ2YlFFdlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ironwood Tribe",
        "comment": "If this app had the ability to share recipes then I think it would be perfect, there are not that many pre-made recipes and so it becomes frustrating if several people are using the app together and each of us has to write down the recipe in our phone if we use it often.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSEdlT0RBT0o1MHhoZ09nZllwSVpMNDVCMUN4UEx5YmNkby1XUkZfZW9JMDVxYzBNXzdJNVh0eVlVMFRRZXhLcXgyYl9TalVLaDdwZ3pUM2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "faith omoregie",
        "comment": "AWESOME I would recommend this app to 13yr olds and over I love this app so much helps me alot I love my body thanks so much can you guys please track periods it would be much easier.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRUg0S3lhaHd2UFRxazJfczRZVW12NkI3SlFGMkZZSmRIWm43RVpQN2ptUGxfa0pVYnR0NU1jaWxBMzh3UnZ2SzFra2RpZ0Fmazdnd0Y3QWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Craig Washington",
        "comment": "Overall it's a decent app. The database for barcode entries seems to be limited? I wish the meal planning portion would actually plan a week of eating suggestions and generate a shopping list. I think this should be a part of the paid subscription. There are other apps that do this for free.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSEJKakVPNmZMVHY5NUdVVW5uZmFPYXRUci1VSFlwMHY5dnNGb2dJR3BCZGx1bjF5aGpWUzNsczhGNjEzV243QTdkRDhzdmZSeWZiVGJBZ1E",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your feedback! Currently we only have the 3 week weight loss with a shopping list and recipes. \nPlease feel free to leave suggestions for improvement on our UserVoice: https://lifesum.uservoice.com",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "1800JCful",
        "comment": "I actually think that the water tracker should be customizable based on how much water we intake rather than the size of the bottle we're using. Other than that, seems fine for the free version. 3 stars because I haven't experienced the premium version.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRVpoaC1GcG80QXVDYWJUMDk0dFdnejJleE1VeXVZYkF4OUNOWTdTQ19BZ0FFc3FHZEVPdVdNOVJwUGRmWGh5b1RaX3hSc1IzU1BISDQxOHc",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for the feedback! Please feel free to leave suggestions for improvement on our UserVoice: https://lifesum.uservoice.com",
            "date": "March 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Liviu Tanasoaica",
        "comment": "It's by far the best-designed app of its kind. Still looks in places like you guys were lazy and just ripped off the iOS design language - you could try to hybridise elements more, make it more integrated with Android's Material Design.  Content wise, it's full of useful and thoughtful things that don't make me feel like they take away from the simplicity of using the application for its primary purpose.   However, the number one gripe I have with this is its inability to export to CSV. There is a request logged for this you have not updated in 2 years! It's functionality that an intern can push out in half a day, unless your backend is horribly unstructured and more intense infrastructure work is needed.   This would be useful for quantified-selfers, people who hate proprietary databases, people with illnesses who need to keep a journal and show their doctor, data enthusiasts, so many people...   We are on Android, not in the closed garden that iOS is. Give us our data and I will give you 5 stars and recommend your app to my friends in the medical community.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRWNvUXRjS1p2bEsxcHAzVnZvRFdKelFjX1NhYVF5cnF2MnNqX3FEVGVTQ3FGcXhGb1dqM0lVaGNERXM4ZTJfTzNhRlZHa0pXMmFGVU9ZeHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Stacey Marchak",
        "comment": "You can't see what the suggested meals are unless you sign up. When I did sign up, I found the meals unappealing and time consuming. I also did not find it easy to use the food diary.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSC1Vb2QwRjM0dzRNWWtmN01OaFB2ZFhNRmxnZEJ5VjFxZHFTTUNIdUgxZXFNNmFDZVIyWk13Z2Z4dUZsRVhTTUZWbWk5ZWNNTzFwbFJoZmc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Great app for tracking calories and water intake. However I have added a carrot stick to my snacks and it puts on a gram of fat to my daily intake? Not sure if it is accurate enough",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRWw5MHIzRXk5YXZielpsVHNLWVRZS3FaWjBvNzZwenBaVExsSWNrTm5IMDBkOExUcS1nd3ZSSVlaSmIza29IaTVPNUp4dFZhNzFxcGNtM2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jessyca Roy Landry",
        "comment": "I like this app a lot, the UI is magnificent! As a feature request, I would love to be able to track vitamins intake from my food. Is it something that would be possible? Thanks so much for being a partner in my health! Cheers!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRk1ueTY2b3NueEg0U2lfT29oZncxOFJ2ZjlyOEJpYjkzcTE4Q2JScl92M1hwbHRSX3VfZVJ5MVhSOUJOTjlfRENtLVNJRTF2UjBKVlNLQ0E",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for the feedback, We hope we can add a vitamins feature in the future! Please feel free to leave suggestions for improvement on our UserVoice: https://lifesum.uservoice.com",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Red Rose",
        "comment": "Good to use on my 7 inch tablet. Shows good stats and offers suggestions on how to improve your eating habits. Free version is good, offers basic info on the food you eat like food calories. Paid version will be even better.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRTVaMnA5MUJxVVI3QWNoT3FJUWxHZXAwNFY3VGxhdkhyVVljQXpUNUMtelhpSnNaa0syaEU4MldNR1c1UmpXd05VQ3E1YlFZMmlzVDAzSGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "It would be nice to view the tips after being rated without having to buy premium! You don't even give the user a chance to get a feel of the app without harassing them with premium. Unsubscribing",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPR2ZmaW8zZnRHdll0TFJES3ZkWVVmalAwc0FETXFDbVZuSUEyUTY1dG9LcEZWaDQ2VFRCeWxTeEdEajR5MVJDdmhRempWTkZSMEtxSkw0aGc",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your feedback!",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Shirong Huang",
        "comment": "Honestly a very well put together app. It helps track my meals and calories. I don't know what I'd do without it.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPR1kxaG1BUFFMd0lmME5EaEdhaGkwbUtHMDNTLVhvY3hqV3VqSzZ1cHFRemxVZHpFaHlneGUtbkZxYXdJQ2dUV0FQQ2hxOG5jM18zX0g0aEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Regina Evans",
        "comment": "It's the app I've been looking for.  I never knew I was eating so many carbs, and I love the messages of encouragement I get everyday.  This app is a keeper👍🏾",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRXduSmRoWEVvd1ZzRHd5MG1BeUNRdmlDUTFXTUJfaVlOSTlzR2o1RjBqRE55dFQtTzk3UnYwMTYzZnh0WG9GQkNwWmhpTFJQdzlia0pfVEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Amanda Roe",
        "comment": "I love using the app, especially where I can actually open it now :)",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRkV2Q1JUMnZCUEFwREJMLUs4RnQ3LUV0X0JVeEZ3UXZqM29mTTg5WElCcUVTZlRlSDhaUzk0Zi1FRXpmQ3FFcFFCUkE5M1NNNkVJVHZTTkE",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your feedback Amanda!\nWe have solved the issue. Please let us know if you're able to access your account now. \nWe apologize for this problem.",
            "date": "February 28, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Bonnie Johnson",
        "comment": "Simple, easy to use. Has so many foods, you just scan the barcode. Also has a section where you can create your own meals by adding your recipes.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPR0JFS1A2aW52LU05Zkp4azBVbHk3QndrVHlzbGhxd3ZYN0g5U0dCMm1hTkxNSnJHay1sWDFpM3pEQUlHYndxeS1WdGtUMDhPQkdseXRGN3c",
        "reply": {
            "author": "Lifesum",
            "content": "Thank you for your review! We are happy to read that you like Lifesum!",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Kayla Jonker",
        "comment": "Pretty good, just wish there where some motivational quotes to go with it... Been using it to keep me on my diet. It has really helped me.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRjJIREdsLWdOOVpxYkk0b1c2Z3lEblhRcG9faUtNY05VamdLcDNjd05PSHRyQVlPLUZnU0NYV2k1cUpNRWpHUnJpN3BwSHk3Qm5uODJxZlE",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks a lot for your feedback! We are very glad to hear that you like our app!",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Diane Shaw",
        "comment": "I lost 8lbs within 6 1/2 weeks with the assistance of this app.  Exercise area could have more options. I just used the basic app and was happy with this.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSHQ3RHJoSEsxWDdaYlRIY05Ra09VNDhSTzdFcjd3V01qN3VKZ0RST2ExTGZVQ0hqWVhjS01LcUtyTjhzWHhvLVJtOFJRdDZESnVubTd3b1E",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks so much for your positive review Diane :) Congrats with your goals!",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Finally drinking enough water, for the first time in years! Having you write down everything I eat keeps me from snacking.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRkppRWZtaU5NRTh6RFRmOE1YTzhkS05EQncxQXJON1I2OXFOc24tSF9VQmpBS214UWlKV0xFdmkzNG9xbjdZU2U3eU9VdHlDMk5rQlFkS2c",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks so much for your positive review! We're happy you stay hydrated :)",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Nanis Gui",
        "comment": "Definetly useful. The free version does more than expected. Easy to use but you do have to do some research on the side to know what to enter.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPRjJlVG5vVEEwRC1GcmhSOTNCdld2VWNKR2NUZzYxTm41cTJfRkJjbTdnTVVsYUNiTWl6S1BGbXJFTVE0NmY5cjNrbzVVbkJtTEtoM3hqcmc",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks for your review and rating Nanis!\nUnfortunately we will introduce the Net Carbs feature in the spring, so at this moment is not available yet. In regard of more Partner apps, please feel free to add your suggestion directly in our UserVoice.",
            "date": "February 21, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Ole Jørgen Egner",
        "comment": "Bra for å holde oversikt over hva en har spist. Har ikke funnet rapport funksjoner som ukes rapporter om hva som er spist og trent.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSHEyRHc3UWkwMHA1U2gtcnBMUTZhazRhMjZJd3JieGNSY3RGVHVGNl9xbEZxVlMwdFlLNE1TMHlFSVhHVFpvVnNEV0RUbExXWFUyUTEwUHc",
        "reply": {
            "author": "Lifesum",
            "content": "Thanks a lot for leaving your feedback! We are glad to hear that you are satisfied!",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Brooke Ambrosio",
        "comment": "I love the level of customization. It's been perfect for tracking my weight, measurements, and foods, all set to my keto diet! Very helpful.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSG9jVHhEZG9uSGhpczhxVUx5Z0VXYjgyR2JGTXRLd0pOVGo1X0JLWWFQYWxQaWNGQXB0a1JOYjY0QWI2N2t1aTdVZGZXUUk0bGpraDZEVEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Helen Winzar",
        "comment": "Love it for tracking foods.. needs a separate alcohol bit .. and an easier amend button as having to delete if I forget something on a meal",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.sillens.shapeupclub&reviewId=Z3A6QU9xcFRPSFc2azRhdU5FNVk1QWNQQ2RqbGk3NGFTV3c2a3VqYS1ZM1BWZHE3VGIzZ05RWHBLRWIzTE1RaGgydnZlSHBla2ktbDc2bWxsQkVneGxGQUE",
        "reply": {
            "author": "Lifesum",
            "content": "Thank you for your review! We are happy to read that you like Lifesum! For suggestions please visit directly our UserVoice: https://lifesum.uservoice.com",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    }
]