[
    {
        "author": "Bernd Khalil",
        "comment": "Very good and useful app for all people who need to be better with their fluids intake. Needs more explanations of some features, e.g. hydration factor of common drinks and what constitutes warm/cold/hot weather or a very active lifestyle (all of these you can use to modify your daily water goal). And why can you page your water diary into the future if you can't see anything there or at least set up future activities?",
        "date": "October 31, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSEdnOWQzUVd1NmFvOGRBbGtqZ1pjX2ZkUHN6UjJVcDBBOEd1UzNFMEl0QWpfYV92RVVTdjV3NWhSMVI3ZlQ3b0ZOQ2JYWmxTZ1RyNjFqSnBB",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Hi Bernd. Thanks a lot for your useful feedback. We are always working on improvements for the app to make the user experience even better. So we are happy about all suggestions. Thanks for your ideas. Have a nice day and keep well hydrated!",
            "date": "October 7, 2016"
        },
        "star": 4,
        "title": "Very scarce on explanations"
    },
    {
        "author": "Adam Irelan",
        "comment": "Great app. Use it everyday since i bought it. Everyone should use it. Keeps my migraines down. Wish it had different styles instead of the goofy face. LOVE THAT IT WORKS WITH FITBIT!. Only thing i would like to see is a more professional style. The app logo is awsome but the little drop charecter makes me feel like a child. And i recommend it to everyone because its so IMPORTANT.",
        "date": "April 17, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRjc5ZVREX21MWkJJTzdlYmV0Nmlha0FBTll1UFROekhaWTdiTGU0YlBoUFZXOHRucWdGcEJPMTYxRGpBVzdUQVBzS0JsUE0wLURSLXNBSkZr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Taylor Brown",
        "comment": "I love this app. I'm excited to see how I feel after drinking the amount I'm supposed to to stay hydrated. I'm also excited to see if I lose any weight by drinking so much water. I love how you can set the amount you want to drink for each day and it goes up if the temp outside gets warmer. It also has reminders you can set and the app will remind you to keep drinking so you can reach your goal. You can also customize how many oz are in your bottle or cup. Your weight can play a factor to on how much your goal is. What your supposed to drink a day is half your weight but in ounces so I'm supposed to drink 171 oz a day. I'm really happy I found this app and I think it will help me live a healthier life!",
        "date": "June 5, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRjVVc2tnelB0LTRxamNtV0FFREtraFkwZURXaEtKdlZNaW9qWHdkeHo3VW12SkRNMVdDSGc3V3lNVHZMc0wtWW9USm1RVUliaGVUX3RjRUFr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jan De Schryver",
        "comment": "The app works nicely but there are some shortcomings. Drinks you added via widgets while the app is open don't show up in the list unless you close and reopen the app. The weather function is not very precise. Today it is -4 and the app shows 2. Finally, I don't know when to pick 'active' or 'very active'. A bit more information would be nice. With these issues resolved this app becomes a 5 star app.",
        "date": "January 18, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSDYtZjlQci11YWlYTzRtWkRmLVNiR0l2YUxHcloxVHJRYzJjZ3R2bnJEX3RnLW9udC16UXNjWlVDWnZDa2lQcVoybWdaME01MmtkS0x4WWpZ",
        "reply": null,
        "star": 4,
        "title": "Good app, improvement possible"
    },
    {
        "author": "Char AXiD",
        "comment": "My weather thing never adds extra water........ so, i think Pro was a waste of money. I would rank 4 stars if it calculated \"equivalencies\"... such as 8oz of black coffee = __oz of water, or 8oz of skim milk = __oz of water... I drink skim milk, black caf. coffee, sweet iced tea, soda.... I understand they may not want to list everything, but some basic options would be nice.",
        "date": "May 4, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRzJCa2VWanJyZWUzcXF4NHlxZmpIN3VNTGYzV3h2TmZjbG1ETEVXZk5DUGdva0dPeXJFWklLS3JiZ1VPQ25nazJiVG10YUJrQkFNZXZyRTBj",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "GCAT01 Living",
        "comment": "I have sampled quite a few hydration/water tracking apps and this is the first one I am willing to pay for. The interface is great, the widgets are very useful, and I really like the way drinking reminders are handled (popup with options to dismiss, snooze, etc). I like that it takes into account environment, activity levels, and weight.    A few improvements could be made, however. First, I wish the environmental/activity levels were defined (what temperature range is \"hot\", how active is \"active\"?). Also, I would like there to be an option to add extra water for that day. Say you have a cold, in which case you need to drink more water. It would be nice to be able to add an extra glass or two into your requirements without having to tell the app that you are extra active that day or that it's hot outside.  Overall good app. Very helpful to me.",
        "date": "November 17, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPR29CSWh4anJheWMwcFpEZTlqbHlTMUUwT2xlMlRkcGl0UmJGeU9iRXo5ODladEVjTFNOT25OUXJidnAxS01GSEJVOUVlQklhV05ERERuT1BN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Junkity Junk",
        "comment": "It is good for keeping me on track. I could do without all the cutesy encouragement BS.  The fact that the app can't export because it keeps crashing is a real disappointment, though. I had to sign in with my Google account and grant contacts permission to save my data which absolutely infuriates me.",
        "date": "December 1, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRzdQRV9HSzBPaGN6OGU1cTBzZm9PVTd2WmxwVWgzc0RQc1JNM3UzR1VyMFQ5STV6eWNwZll4YV9WZkJuTnVPaGhhY0Z5OVFwOTBacFZPSWZ3",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Thanks a lot for your feedback. We are currently searching after the problem with the export and hope to find a solution soon. Hope for your patience and understanding. Currently we need the permission because of the login with your google account. But we working to change this. Hope you are glad to hear. Have a great, well hydrated day!",
            "date": "December 3, 2016"
        },
        "star": 2,
        "title": "Good for tracking. Export crashes app."
    },
    {
        "author": "Tom Goozen",
        "comment": "Both weekly and monthly stats are suboptimal in that they are not intuitive and causes one to scratch their head wondering what the developer was thinking.  For the monthly chart I would like to see the last 30 days not a calendar month.  I've given up looking at the stats and just aim to meet my daily goals.",
        "date": "November 16, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPR3c0OGVheVhFRDF6akVLQUExNWItQ1dPTUhJbHhwMk5kTUE4cE96TnpyZG5hT0N3TTk5ckRDdFRVRXB0VnQxbnlHSFc4WnFpQXJZMWJ4dWJj",
        "reply": null,
        "star": 3,
        "title": "Statistics sorely lacking"
    },
    {
        "author": "Michael Schmidt",
        "comment": "I am horrible at drinking water. I don't like it and I barely drank 8 oz. a day before I had this app to show me how much I need to be drinking and how often during my busy day. The app is easy to use and syncs with Samsung Health. I love how it takes into account the weather and your activity and automatically updates the weather.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPR3FUMnhwM0gteHRreHM2cWthOXlYV2ItTFFuQ0ZUazhqU0VSX0RhRVFWWmJtVm1ESEh0T2VxbDQ5YmkxV0dnVnExcVNXZlFSbHVUWThwSTBN",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Daniel Zikmund",
        "comment": "Great app, forces you to drink. I have two suggestions though. First being the hydration factor. I used WaterMinder on iOS before and the hydration factor is set by default for some drink types by the developer. That I liked very much, because I didn't have to set it myself. Secondly, the dialog telling me to give a rating to this app is kind of annoying, since it pops up every time I add a drink. Otherwise, thanks for taking my suggestions into consideration and keep up the good work.",
        "date": "October 28, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPR2dQdDV4blByb0VIMWhOMjFTeGptMFVDYnJnX2JrMnpHbDVPa2FwTk1FVVJuQmRERnJ6QzhnWTYxLTJPZG1KU2JIZ2RkVlFXOE04cEl4aHRN",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Liz Hinds",
        "comment": "If I pay for an apple I expect it to work. If I log drinks from the widget/notification bar it logs them twice. I've not actually been achieving my goals as it has been logging double. Good app but slightly disappointed at having to modify my data constantly.",
        "date": "January 16, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRjFZU3VPdU4wT1NfQWNyNm9mZ1p4Y0pZdS1iVVdvVGM5Z3BHZ1JtQkJhS3Ntbm9iU3gwb0VaR0VOd2pEVERrdktvWDRPS3V4ZHAxYjJyZ09n",
        "reply": null,
        "star": 3,
        "title": "Great concept but"
    },
    {
        "author": "Lochlan Broughton",
        "comment": "Update: This app has not been updated for almost 2 years. It has been abandoned with huge issues with Android Wear sync issues making it unusable on the platform.    Has this app been abandoned? There are bugs with Android Wear that need fixing. It would be great to have drinks imported from/exported to Google Fit.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPR0ZfUDJqNXB5a20tTmlKSHFzelcyRS1hRDJyTU9kTkhLX3hTbHgyY2NWdEJ2UU9JVGRyMWdRZ0ZoVUp1SEVxZzRWMEUtcFFsT0ZQNm8zR253",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Hi Lochlan. We are very sorry for the troubles! We are thinking about to make a complete new wear app. But before that we will publish in a few weeks a very big update with lots of improvement and a new design. We hope for your patience. Keep well hydrated and have a great day!",
            "date": "June 7, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Steph C",
        "comment": "Love the app, just purchased the upgraded Pro. My water intake has dramatically increased since using the app and the timely reminders help me spread my intake out over the day.  Get it, you're probably dehydrated right now!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRm5DWVdXZUNuaXRPTjRUal9mVFpmTkVWTkNsbzBkZTRuZUV0U2ZTME0yVnkzN2dMdVl4dHdGQjRYanMwTnVvSDgzTGhfWmtvV1I0b2NjM3VF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "D Salcedo",
        "comment": "Double notification on Android Wear. Any time this app reminds me that I need to drink water, I get. Notification from the app and from my phone, essentially giving me 2 notifications that say the same thing. This needs to be fixed because it does not happen with any other app.",
        "date": "January 17, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRTVlLTdNcGFxeW55c1MtdzRnN3FWQnk5U2c2MUt6X1hzazU1ZldtUF9SVzh2bTVocW51LVJBUW5vUFhFMGpZcjY2d3c0Z1FRM1pmMnZmZUI4",
        "reply": {
            "author": "Codium App Ideas",
            "content": "You are absolutely right. This shouldn't have happened. We already working to solve the problem soon and hope for your patience and understanding. Keep top hydrated and enjoy the weekend!",
            "date": "January 28, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "why is it mandatory to connect the app to google plus?? why is it not enough to connect to google play only? I don't want to use google plus, don't want to have an account there, I use other google  services, that should be enough! yesterday I finally deleted google plus and now I realized that without that the app does not work! and I even paid for this. please fix it, I am really disappointed! I can not reply to your answer, so I edit my coment here: thanks for your response. it is no problem that ANY google account has to be used but I don't want google plus so what I need is to synch with my google account without adding me to google plus. I use gmail, calendar etc, so there should be a way to use my google account WITHOUT google plus. is this feasible? if yes then I would like to use the app again. when is the next update of the app?",
        "date": "September 4, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSGdRcW4tX3JYa0EwRjFvekduQ0RsMTFpVWxnQzktTUNZa3d6ZVR6ZEp1eGlCYVdkRzA1UUlvU0lVMVdTOXdPMGViTVdkRjRIOEJOXzQ0THA0",
        "reply": {
            "author": "Codium App Ideas",
            "content": "We are very sorry for your troubles and the lost data! Currently you have to sign in with any Google account so we can sync your data. But with the coming update this isn't longer necessary. But we can totally understand your disappointment, if you like a refund of your purchase please write us just a mail within your order number.",
            "date": "September 1, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Matt Stocks",
        "comment": "This app is great and has impacted my life in a good way. However, hydration factor needs explaining. I'm not logging things like coffee or soda because I have no idea what the hydration percentage should be. Maybe some preset drinks with the hydration factor calculated would be nice so I can log my drinking habits more accurately.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSDlpRHhhOGhDS3RkSUZNTk1tS1kybmRNc1A0MERnUlF2cll5Y2tkNndycktkNDN2UHlGQVJ4U00ybUUzODA4SmZHTTRlMzdET0lpdW9kYldN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "S L-R",
        "comment": "It's ok  Need a way to change the sounds every week after I tune it out. It does help increase my water intake but only if I'm near my phone and water. I think it's still worth the small pro version cost, but the effectiveness drops off over time. The widgets are handy though.",
        "date": "July 25, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSHJFVThCZ0xrd1M2Sk9BdmU2M09NTTBrdUhmVlZfeWdUZzgzSWwzVGl4dEQ2Y0xIMDI2VXZjTW1TcHZxeFZ3LW5WNDVZUV9NVUxZY3V6QjRN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Twisted Mobbit",
        "comment": "I tried several apps to help me increase my fluid intake and this is by far the best. The alerts are customisable, and although they nudge you they don't become so intrusive it becomes a waking nightmare that enslaves you.  My saturation levels were around 40% when I began using it, I now hover around 90%. Thank you, I feel a LOT better 😊",
        "date": "January 4, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSHJtTU1NSnMzaXdWNWVhNWRUWlN5M0xrMlM2QXJ2d1Z2SWZWS2QyTm5NdklKVFIzQ1U0SVE5d2k1c3Y2QUJ6MTJua1JNQXkwOFpUcFAxa2tz",
        "reply": null,
        "star": 5,
        "title": "The best of the lot"
    },
    {
        "author": "Holly Arnold",
        "comment": "Great app for getting me hydrated everyday. As for the percentage a caffeinated drink hydrates me though I have no idea and the app doesn't suggest but gives you the option to put in. So I'm not quite sure how that helps.",
        "date": "December 7, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSGRTZE5mX2l2RkJQNVo2bmdtVFZhYS0zbWdadG0yc1RLUW1ydlNBRE5NUkloTDJBdHBmcVhfekNpaDVXMV8zdDVFdmVlZi1UU1hZNWs3djdr",
        "reply": null,
        "star": 5,
        "title": "Like it"
    },
    {
        "author": "Milos Hyravy",
        "comment": "Great app, it keeps me up with my water drinking goals. However I really do not understand how synchronization across devices work or not works. Must have sent my new phone to service centre and now on the old phone I do not get the data from new phone. Not even my details :/",
        "date": "March 1, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRWxzcmdOX3F0OEVIQy14ZUJobzBrcDBsUzRGcWplUXlRRHdDbVo1NHM1eUhteTBuTTJDbjY0Y2ZoUmVLOFBBN1JKQ3VOOVNXUjBzX0FxTG1v",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jonn Wood",
        "comment": "Does what I need. Reminds me to stay properly hydrated. Linking notice to my mi band 2 worked perfectly through a 3rd party app. Wish it used fit to adjust intake for exerise water loss. This would make ot a 5.",
        "date": "January 18, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRjJ0cy1UallCVXBGaFgtSlRUZHRIdjVqM0Ria1ExVUlpSTdFZ2VoaVJFZHNNWXdxM1ZJUnpMelRid01iXzVnLTNCVzRuSWlieUNTTnpxYTlJ",
        "reply": null,
        "star": 4,
        "title": "Great app"
    },
    {
        "author": "Charles Collier",
        "comment": "I decided to buy this and it seem to work well with the exception of percent is like right now it says I have 15765 percent which is wrong. It a simple math fix i am sure. I think if this was fixed I revaluation of it at a later time. I would not recommend this at the price until the math part is fix.",
        "date": "October 31, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRkwzY3BoUFdkUjVQUzkyYXNrSFllSFdzcUFmbU9UM25DckpHb3BQUjNhYjhzWE1uVGxBQWZsVkMzNUpIR3BsYTVsY2FjTzB5eUhfUFJqYTEw",
        "reply": null,
        "star": 3,
        "title": "Percent way off"
    },
    {
        "author": "Ben Thirlwell",
        "comment": "The app really helps me stay on top of my water intake, which I often have trouble doing. Some liquids like coffee make you more dehydrated though, so I'd like the ability to add things like coffee and alcohol into the app. So for every cup of coffee, alcohol, etc you drink it would add an additional cup of water into your daily water intake. Otherwise I'm quite happy with the app and would give it 5 stars if it had that feature!",
        "date": "November 5, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPR1prb2oxVC1XelY4SFM3N01DV3hIdTdYemM4UHFmZXY1R05Dc1ZLNVNOc0N3clhsd19VVEhSMXYzTms4WWFOa2VkQWZJS2VtVWQ4QklkcFM4",
        "reply": null,
        "star": 4,
        "title": "Works great but I'd like to have a few more features"
    },
    {
        "author": "Kimber Grey",
        "comment": "All widgets in the apps section show number of ml/oz consumed so far. The moment you drop them onto the screen, the message reads \"no reminders scheduled\". Why does the appearance change the moment I try to use them? Also, with pro, the different cup options should be included.",
        "date": "June 18, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRUt0MVZQajBBeGNZZDdSTnVHdnBONmxURzBta2VEdnU3VFFZSDNHV0M3MHV0ZE4zWnl5alFLMndLMzZQTmxON0xjckU5aXBIRjBDbGxyekV3",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Hi Kimber, thanks for your feedback. We are sorry for the troubles. We currently working on a completely revision of the app. Within the next update we will publish improved widgets too. Hope you are glad to hear. Thanks for your patience. Have a nice and top hydrated day!",
            "date": "June 20, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Angela Kimbrough",
        "comment": "Great for just keeping track. No 5th star because I can't seem to adjust my profile to give it weight loss status. I can't even almost down the suggested amount in a day. There is also the fact I have no clue how hydrating coffee creamer or the occasional soda, wine, or beer is. If it could automatically account for other drinks hydration or dehydration that would be awesome! All in all I really just needed a reminder to drink more water and this it does well.",
        "date": "September 7, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPR0ozLVNCMkVVTk43VHpZYlNCWEViNjRPVnUydFI3NG5UQ3JoUlpLd0ZLNFc4SlVUcDVFbVJqa2g1WEh1clJidXdzRFZtUlhLQVdtUjVPaHhR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Frank Taaning Grundholm",
        "comment": "The app works fine, but the watch part of it is really crappie. First of all you get double notification and secondly the intakes are not in sync with the phone. It shouldn't matter if you enter your intake on the phone or the watch, but it clearly does on my Zenwatch.",
        "date": "October 13, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRWI3eEpoOUFmVktUbm5NLVZJcnQ2ekpWaEV4dWdwR2xLNFUtaDE4bTV5bmhtTy15SjllamlRUVR3bUJvZzdfTVNqQl9HZVlOeHlTcmROeThn",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Hey Frank, thanks for your bug report. We are very sorry for the troubles. We currently working on a big update and a complete redesign of the system and will solve this problem within. Thanks for your understanding. Keep hydrated and have a great day!",
            "date": "October 13, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Raman Gupta",
        "comment": "I often forget to drink water. This simple app helps keep me properly hydrated. I had some pretty major issues with syncing when I got a new phone, but Codium helped me out. Thanks!",
        "date": "November 8, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSHFiYjlrWndib2V1eGRmVjRlbERZYXlnbXNUNlVPYjVlbG1wS2tmRmFaZGVQRDFFZGZ5SjJpN0g5eTNHZEpEYVRsMmd1QTZXU2FpdnJzZkxj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Soen Trueman",
        "comment": "I love this app. The only thing that I would like is to change the time at which the day starts. I often don't go to bed until after midnight and so therefore really want my water intake to be allocated to the previous day.",
        "date": "May 4, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRzg4cVFXYlZVMFQyOExKbU5Qd0ZDTFE1Z0s4alJfS01OOW9fU3I1S0w3NmhPTjhMR1NhR0JuNWZqNWxsbmlqSEFPNjBHVzZqejFHOURQZklr",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Joley Sullivan",
        "comment": "We all know it's important to stay hydrated and this app reminds you to drink and rewards you with points for doing so. It's like a game. It may seem silly, but it works for me.",
        "date": "January 10, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSEpzRHIzYVJXWTQ0RnNiR28wdUhtLXFMblQzS0ZYNnVnZmtTWjhieFN5aEN3aG5wZ19LMUJKUkFzOVBKNTVwTFJVWVJKWlJEWkhnUUJPd3l3",
        "reply": null,
        "star": 5,
        "title": "Adds fun to staying hydrated"
    },
    {
        "author": "Tristin Christenson",
        "comment": "Once I purchased the Pro It now links to my S Health on my S8+ and My Fitness Pal...... I'm a very bad water drinker but this helps me to drink it.  Now I'm finding myself trying to beat the coach and staying ahead of what I am supposed to drink.  It's makes it fun you can earn achievements.  Worth the $.",
        "date": "July 12, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPR0NZOXY5eGY3S29jeTBOS2tZUjZKOG5Gdnd2UmNaSkZRU21EVmxENFhHN0pDWmdob0ZqaHJfMWlYQlFpVGFpc1dnLUI3bUFjQnVwRnE2bDQw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lisa Wightman",
        "comment": "Great water tracking app. I'm really, really bad at staying hydrated and this really helps me along. The only small problem is, snoozing isn't working for me. My pop-up comes up, but there is no snooze option. I've tried clicking cancel and later, but neither give me a reminder after the 15 min snooze interval I set. Definitely a 5 star app if this were remedied.",
        "date": "November 18, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRTIzaEtmTVNKTks4eUdUS2hJX3lWU1g2VlVMT2FuRno3aFJYN0tNUFlrbTM1bnMyeFRtQUlFTnRXdjUtTFdrZmttVEMzZXB6cTdoZGxVbDFv",
        "reply": null,
        "star": 4,
        "title": "Great, but for one flaw."
    },
    {
        "author": "Henry Chang",
        "comment": "Progress and alerts are wrong if you usually sleep after midnight like I do. It assumes the alert after midnight is for the next day. It should allow to set time of reset to, say, 3am to allow more accurate representation of a day's water intake.",
        "date": "September 10, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSDdUTFdyelplSE9pUnctNVdmTUFKbnk1V01kUmlhUURVdmUwcGo2aWpmbnhna1RQNVNBU2p3VzNHQlBuSi1LSVlhdVhzUWViUjFGaTRpNmVF",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Alexandra Sevostyanova",
        "comment": "Percentage, Statistics and REMINDERS - all of them are broken! Don't buy. I regret I bought pro. Uninstalled after a week of struggling. Customer Service never reply, I reported of bugs, sent screenshots, all in vain.",
        "date": "November 8, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSF9ZWGlOOTdNd2V4bC1LMXVYZ0NjTlpmcW5nQ2VTZmFBaGpFTkhEUTRCT0JwMElmVVAtQ0doWHlpV0FSZ20tVHpWRHV6amo3LVEtc3Bsd3Fj",
        "reply": null,
        "star": 1,
        "title": "Garbage"
    },
    {
        "author": "Siobhan McDonnell",
        "comment": "Best app of it's kind I've tried so far but I wish it would let us know the hydration factors of common drinks. I tried searching with google but no joy so it's not going to give me accurate readings based on my uninformed guesses.",
        "date": "December 19, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSGVIektPT3EwY1dfUTBiX3BhOGhzXzdPQzAtc2NzSGtfYUI3Qm9GVk9vYlh3R3pQdmxIUjZFVnR0NzM1ZFIwUTlVTkZEOVZobnZ1T2pBeldZ",
        "reply": null,
        "star": 5,
        "title": "Good overall"
    },
    {
        "author": "Justin Wypij",
        "comment": "Everything works great EXCEPT when Samsung health tries to write water intake from hydro coach pro. Every time I launch hydro coach it writes whatever number is there to Samsung health. For instance if I recorded 2 8fl on coach and went to Samsung health it would show 2 in Samsung health. BUT! when I went back into coach to record another glass (total 3) in Samsung health it would add 3 cups to the 2 equalling 5!!! Sooooo annoying. Anyone else get this error?",
        "date": "September 3, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRUZFUXpHUUhqZXZ1YVBvcllyaUQzS1lNUjJJeE9yRkFCVEc2aWZDT1hwc19oMDBmRG45UkIyTkR0VkM0NGx6WGgzbUNscS1SWkppaWZpd3dR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dávid Horváth",
        "comment": "It is lagging on my S7 after Nougat update, slows the whole phone after opening the  app...  Could get back the 5 stars, after the issue fixed",
        "date": "January 28, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRTBpaG85TEJRNUhnSjFuTEhqUEtWYW9WN0ZJbE53OS02a0VMdU5vQ2x5a0dDLTNWNGItMzMtNU1vOTlEVHc2bTJnUWllQjlERFBRMVlDWjIw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Maciej Jakub Bańkowski",
        "comment": "The app is good but there is a bug. When you add an entry and edit it right away, it reverts back to default settings a moment later. Extremely annoying.",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPRV9GOWFhSjhCVlJBQ2ZuT3VOcmdfWE5UNU5uc21OQzhqWGxyVzJQcWVpb05WXzVCM0xQOHAxb25NQ1dnRURHWE5MMzlVemFVM3JaR3d5Nnkw",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Andi Wilson",
        "comment": "Really like it. Ensures I keep my water intake up with helpful reminders that don't get irritating. I did by the pro version though because the adverts can get distracting",
        "date": "January 16, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSDRSR0thV05ucFdLOUtNT0JjNmN4QjJaYnRFOFI1NGlSQkR2aGxiNWVHWldBaFE4RC1zaUpxRU9UMDFZamJUUHJyVXNIZ1B5Q3VMd1FUY0Q0",
        "reply": null,
        "star": 4,
        "title": "Great App"
    },
    {
        "author": "CJ Fravel",
        "comment": "Works well for making sure I get enough, notification quick actions means I don't even need to open the app. The \"information\" in the notification is kinda useless though.",
        "date": "November 25, 2016",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSFI3Q1I5MVpDYUM5Ykp4a0hSNTNfXzVOSnVwR2VrQzcwRk91bUI1ZHBxT3lSRzlDQVVrVTJyQVpOMUxQSTBLMDZwN1hESG9Ra2ZTenY2MHRR",
        "reply": null,
        "star": 4,
        "title": "Works and useful notifications actions"
    },
    {
        "author": "Matthew Wilke",
        "comment": "Love it. I'm relatively new at this health monitoring stuff but if nothing else, its made me conscious of my water needs and i haven't missed a quota yet.",
        "date": "March 23, 2017",
        "permlink": "/store/apps/details?id=com.codium.hydrocoach.pro&reviewId=Z3A6QU9xcFRPSHhjU0s0bHZsXzBTZ2NSUDBvVms4WGtNS1lZczRha2pCSUVVZEVmN0pjR0pJSmZRUHd2cGRBQmhrUjNoMXcyOG1BMk9QZEFxNlRCZV9HNERv",
        "reply": {
            "author": "Codium App Ideas",
            "content": "Thanks a lot for your praise Matthew. We are very happy to hear that you are satisfied and would be glad if you recommend the app to your friends. Have a wonderful and top hydrated day!",
            "date": "April 3, 2017"
        },
        "star": 5,
        "title": null
    }
]