[
    {
        "author": "Shadow Wolf",
        "comment": "It does precisely what it says on the tin, and then some. There is some lag between sending commands and the car responding, though that is likely due to the time it takes for a command to traverse the network to BlueLink, then make its way out through the network to the car. Smartwatch support was a pleasant surprise, and it works brilliantly. I love being able to remote-start my car from my watch!",
        "date": "March 8, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRzRkZ3owdy05TjlLVnhrdmp3a2V6WlRXSTFMbTI4Z3N0RlRmMUVUU0dKRzVVM3IwSFJBXzdyanJOQ1dlN3prbzEtTGVHdDFTVzFrYi1YeFQ0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marc Choa",
        "comment": "Doesn't even let me log in anymore. Checked my subscription, still good. I think I'll just end my subscriptions if this keeps up. UPDATE 3.13.17 It's been three months in the cold winter season I haven't used this app. Reinstalled it again and logs me back in quite smoothly. They need to make this app more reliable.",
        "date": "March 13, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRzd2dWVrcnBRZEtpY1dpNHZWcGw4RkYyY0FveHViMEtmbEx5c1ZYemFoV2ltbUlmbU1OR3M1NFBHTUdSNmhrbnlyRFROd3RxMG1fd0lNekFV",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Ryan Siemer",
        "comment": "HELP needed: I have had the app for a few years and loved it until a few months ago. I am encountering issues when trying to use it. I install the app, use it for a few weeks and them I get an error saying \"device invalid\". I them uninstall and reinstall the app and it works fine (for a few days) then I have to do it all over again. This has happened on 2  phones, the Nexus 6P and now the new GOOGLE Pixel 2. Please fix so I can get this back to 5 stars.  When it works:The APP for the parking meter is great downtown. Auto star with temp control works and is great for a hot day at a baseball game and having the car cool before making it to the car after the game.",
        "date": "November 13, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPR2ZPVDZNSVp4bnREVGllbXVYR2FXSWktcE1fUm9ja1NuWlVjdzJQbUIweU1GcWlTbGdRNmEyUnZsWC0wU2twT1VZZmhYWjdyb1otN3FKcmFZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Tonya Hunt",
        "comment": "The features never worked. I let Blue Link know but they never helped to fix it. I wanted to take it in for repair at the dealer but Hyundai was clueless as to how to fix it and wanted me to pay high diagnostic fees even though the car as a whole and the Blue link system were still under warranty. In addition, Blue Link accidentally cancelled my free trial and I would have had to pay a subscription fee to be able to take it to Hyundai for diagnostic. Wasn't worth it given it may have never worked after all that.",
        "date": "September 18, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPR3ZlUEt5aGRsSHNKZTJJYUYyMGFyWVg2dDB3aTRqVF8xYjA5UnhVNGpEdGZ1ZTgxbVlYdjRIZTVicVJTbXZQTmlVQUJqekxSWW1TYUgzR1pN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kim Parker",
        "comment": "Purchased both packages and unable to use BlueLink.  When I call for support I wait at least a 1/2 hour to have a tech answer.  Than, they can't fix and I'm told that it would be 3-5 days for someone to contact me to fix the problem.  Bad customer support.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPR2Z2XzhGZ2Vpb1VQeVVXa1ZwQkdCV2JMZlF6cmFFSUpNZzdEbFF1Nlp3LUZsYUJLRWZyNnVVcEwyeDlwSEdmd1dscjllS1BSR1l5UTVvd2sw",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Rick Gourlay",
        "comment": "I had to submit a review since I was a previous hater of this app. I recently upgraded to galaxy s8 and all of a sudden this app works perfect. No more repeated logins, request gets sent immediately. Car starts in 5 seconds versus 40 or more. It might be nougat that fixed app but it works great now!",
        "date": "May 25, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRWwtY1dVR1Q4cVM3VFNCQUgxeEpXcG05RkM4S1RXeHZjcWszRFp0Z182ZGFJeHJrUjRYMDJoTTc5bUlVSVlfMm8tOWlFQ3p6ZDREZUtEZTdn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chris Longhini",
        "comment": "This app is the most absolute piece of garbage I've ever encountered.  Works maybe 60% of the time, never when you need it and the only good the is the remote start.  Criminal that you have to pay money for such trash.  This app alone would encourage me to never go with hyundai again.",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRXdPMzhVX3l5TkpjZ25zeXNMN3c4LWFQX2tiMEV0dTBFaUVmR1lSN1VSN0p0cHF4dmJjd1pfVDFtdFlnR2hxa3JrU0xrdVJ5eHVUemJBdDQw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Felix Pyatigorskiy",
        "comment": "Works well with my 2018 Sonata 2.0T Limited. Wish the app would let you control the heated seats and not just the steering wheel. Also would love to see some compatibility with my Gear S3 even though its on Tizen OS it still should be possible for some devs to port it over.",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRlhrU3ZrbG9hSDlHcFU4WG4yLWZaZURvcXVpWndwdFhjbDNHMEdMdmxhNkhOdE9KWHNCYW9MZHozVGx5QkRHM1kwYUNRc3duOXlfUTZ0TmxZ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Vince S",
        "comment": "Application takes forever to load, ND when it finally does, it's a crap shoot as to if it will actually turn on your car. When it doesn't, it won't tell you why or what happened. Not worth a $99+ subscription for this poor of an app/service.",
        "date": "March 14, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRXlPXzJvM3RSXzRXRFUxRXJfWHlCQUFUUHdtaU90dTc1Zl9feGhsZUdkbmw4bWJuR2tLUFBDWkJVbUVqZ3k1eXVGLVltZGFaQy1IemdkejNj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Phil Johns",
        "comment": "Too often, I receive system-generated error messages after trying to remote start or remote lock my Sonata. Usually, these messages indicate that MyHyundai could not complete my request, and to try again later. The MyHyundai system should be much more reliable considering the annual fee. Also, it takes a long time to log in, even though I've enabled the option to stay logged in. Login times should be much shorter, especially considering that the app always runs in the background on my phone.",
        "date": "March 10, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRmgxdmE1dWt5WmhzdzA4TW9wWmxFZmN0V2prM1FURzMwc2lVZHlvREZaa0p5OHhHem9tQ2pfbjF1cXYwbHJDTzZtXzdYUHN2elUxSUZPcjFv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "DENISE Henley",
        "comment": "until i got the Samsung Galaxy S8+, the app was ok but not great. Now, I have to logout of the app and restart it just to get a vehicle status, the time it takes to send an unlock request and actually unlock the car I could have walked back up 3 flights of stairs with my arms full & gotten the remote, and for the price of the service, i could purchase a different plan from a better vendor.  Not impressed Hyundai!!!",
        "date": "June 4, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSGV0YXE2cVQwM0dSY3RvSWhobzNqdGtaUUh6ZFRsOE1iOVluTk5yYnBGZDBvVFNSS19XTDduQk81MUI5Um9TcUwzUFhScXVhN2tJdFVmWjlJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "James Reese",
        "comment": "Really Hyundai... This app is going downhill fast.  Everytime I use it I get a device invalid error and need to log in again. I use this twice a day and it's getting old.  If you can't get it together get a new development team.",
        "date": "April 11, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRVRYTklVZ240YUFWUXBfYkdfbGVrdmw3NDBKYlE1bzEyTXdtaFZ6YVJqVzBMREhFX1RkSk1jVGhnQUJnTmZ4NV9LRDlTTzYtTFdCSWpjMkZR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "James Carter",
        "comment": "Hundai should make this part of the sale price of the car. For this reason, I'm deleting this worthless app. Only have one key fob with remote Capabilities. Shame on you jerks!",
        "date": "April 25, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRkJsY2l3dUVPbW4yOTgxNjdaNkoxLU1oWVNPSnhYVlIxWnNVMmEwOHcteHpSZUppU25HajlUR1ZaZnUtZUZQLXNOdy0yRy1NNjAzSzdQb3J3",
        "reply": null,
        "star": 1,
        "title": "BlueLink Subscription Required!"
    },
    {
        "author": "Charlie Rice",
        "comment": "This app no longer remotely starts or locks my car. I can send poi to my car which is good because the nav and in car poi's are so outdated. My biggest problem is I bought a car with the \"ultimate\" package. It's advertised to have remote state. Well...thats only if you pay for this service. That's not how it was represented. I'm pretty sure that falls in the category of false advertising.",
        "date": "June 11, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSHZicXltYUhIb1NfRXJTOGp3TmRzOTZHZ3p4SEoybExWWTBkQkhnUVJKdFZPV2dOY3B5S3NRZEhQU2JzMF9XUzZXYWlNclhfMzQyOUVYb3dB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Long delays to request status and do any control, but aside from the delays there's also lots of failures. Poor functionality in the app for remote start. I can start my front defroster but not rear? Needs a lot of changes to justify the high annual service fee.",
        "date": "November 21, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRmpITTNseWJ5VE1fMC1sTGpqcTVxbGh5b2tiRlVHQ3lOWkJJTm0zZ3V6QjBEVjhNRnp0MVlhU2k4eTRWM2lKVzYwYktEcHJRQkVpdV8xN0RZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Barb Wald",
        "comment": "Don't waste your money on this!! When it is really cold and I need the remote start to work, get a message that it's unavailable, try later...like when?? If it's 70° outside and not 20° below?? It never has worked when I needed it to! Isn't even worth a one star rating!",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRWR1TElDRVZzb0VWTUtmM3d4U1lHTGxWTFBITC1ycTcyQ0pSZk9hdnFzRGFqdV9ZNHhEMFZSbmswSFlKNk1PTGFVMDNRYk1lZGJSYlBpUW5F",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Heidi Robertson",
        "comment": "I love my car... and the theory of this app is great for other things, but why not just have a remote starter without an app? I have to have my car locked to remote start it, but I never lock my car at home and the keys are in it. And,  why in the world do the emergency flashers come on with remote start?! There are no ways to specify your settings- like to not have your lights flashing at 4:30 in the morning when it's pitch black out and highway traffic is going by. I mostly can't wait until all of my bluelink things expire- I will not PAY to remote start my car.",
        "date": "March 9, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSHBxV2JKTHpvTk4tWGdPSFFaXzVzTXVIR1JXalVHNEVpdFJqTWtEVmJLNF9IWmlYT3B0SHBIbWJFOXRQSEVoVWx0N0ROX3Rmak9UdVIzVkNJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jessica pointer",
        "comment": "The only this this app is good for is starting my car.. And even that takes forever to do.. I pressed to unlock my doors and it sent the request 30mins later.. I can't set any of the alerts on here (sipped, valet or curfew) when you click on it, the keyboard doesn't show up so that you can make your selection. You can only see a half of a cancel or done below... This app is trash..",
        "date": "April 2, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRUNuclNVUU9NR0lWMkd0TFZyeUpvcE1DRXMtUUJxcFlPTGg2dXdyU0lwYzctYl9raXFOR0RwbkM3VDBUOHRERWxBUllhWV80MXBoaE1Pblhj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Leasa Hofmann",
        "comment": "I love the app, it works awesome!! But, its toooo expensive if all you want is the remote start function.  Please offer just a remote start package at a much lower price.. Then, I will give 5 stars.",
        "date": "September 21, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRnBpa2puOWgwUVMzRXNfVmtDZ3FiQWF6c2FxTGN2MDYwQm1JSmdLUFNFYUtIQWN2eFk3eHhRc2RYVFB4WC1wRGp4Vmc4cmVwUW92RzU2RTcw",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Ferney Zantello",
        "comment": "This app DOESN'T work at all on new phones and when it does, it ONLY works on old phones.  Cannot use it from my Samsung Galaxy S8+ phone.  I'm supposed to be able to setup the settings for the Remote Start to control Heating or Air Conditioning, but those features are no where to be found..  So technically, this App is useless.  CANNOT Remote Start, cannot do anything. 😡😡😡",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRk5BTGpWeGxJem9TMkRnNHI2R2R6Z3EwWjRHaFBka0puQ2pQSmNsQndVUFJMWDF2ajAzemdnT21zLTBObEltV2ZuWko3MmJYRDlqWlJkSDAw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Tracie Rish",
        "comment": "Great app- when it actually works!! Paying yearly and can't even use remote start 90% of the time. Then when I contacted support, their response was a list of phones that support the app - yet no answer to the problem, even with giving the error message. Definitely not paying for nothing again!",
        "date": "March 24, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSHhhLVlTZ3I1Zi1PRWhNLWwwc2pqYVA5UW5PaTEyZ1BBaU16ZU83WXJ2SDQ1WWJRd1VVR09zSUVHeTRtS1JWU25SR09GY1RMZkt5RUFGSnhB",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Bill Stolte",
        "comment": "It needs work as it is slow and clunky.  I'd like to see the ability to turn on the heated or cooled seats from a remote start as well.  It cannot accomplish your request at times too.",
        "date": "April 26, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSEE1cjlxVUpGb2xJblluUHlfVFpUY2ZGOXdiZFJweWZaQUI4ZzFUWDdiWmEwb3hqNnpNVEthRTBTTUUtNTdvU2xVLUUzNGU5NEgzN3BodnFZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "TheMetalhead2112",
        "comment": "Awful app never works for anything...called customer service super nice people and did everything they could do but still doesn't work. Definitely will not be continuing to use this after my trial is up. I feel bad for any one who has paid for the blue link service for it not to work. At least make it work for the trial period to get me interested......fail",
        "date": "December 31, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPR1cwZ3llY0FIX2p3N1FVSUpCZ1NqdnR3cEVRUWJhM0t4cWhmbGZURDRvUTI0X2kxa3I0LVBpZjRoS0ZLM3Jrd3VLWGJtbDEtV3NCS212TFpN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Michael Ratledge",
        "comment": "There is a problem with the app if you have a 2018 Santa Fe Sport. From the \"Guides\" page every single link gives a \"Content Not Available\" error message. This is because the files are not where the app thinks they are, therefore you can't even look for the dashboard symbols, much less the 2018 Santa Fe Sport users guide. Even the link to the BlueLink video examples is broken and gives the same \"Content Not Available\" error message.",
        "date": "October 18, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSHZaUlNueWctb0c3eWs5cElpMWpiN0V0N2tJeC1ObklmY0NWOUtHOWtrc3dvSEhCQXdXWlRRTGFZcVJLX0ZSU3NCMVJIUmRMaTM2dkNTcUxv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ross Waller",
        "comment": "Originally, I had complained about sign-in issues. These have since been resolved. My new issue with this app deal with the alert settings. I am not able to access the keyboard while in the app to adjust speed limit alert or valet distance. Just a few more tweaks and this app will be a solid 5 star. As I said in my original review, this device costs way to much for not 100% functional.",
        "date": "July 4, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSHo4V3AwNklnN2NUNmdxT2VZdlIyeGx0TEUtelN0WnVpUmFZZEs0MDVzaktzU3FZZXZtOFVnaTlwenFVb1FhMWsybE03Q0pMVWR0a0RUWmg4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Flying Turtle Gaming",
        "comment": "Sorry thing is this is the only way to remote start the vehicle! If you don't have the app, forget it. And they charge you if you want tip continue to be able to remote start the car after one year. Now you buy the car and have to keep paying for what other companies give in the remote control for free.",
        "date": "March 6, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRk1RX3VBbG5wbFpTRG1zMjQ2ZF84SVhtVVg2MDIxWVlrNkY2TVkyRnltWE96bkJnQ0hoWUtIYS1pNmF1WnNpMTVPTk5QNEh1MkVPdldpZTNR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Trever Edwards",
        "comment": "Hasn't even let me login - unavailable since November 2017. Even when it did work only about 20% of the time. Hyundai has no intent to even try to fix. Mine stopped working completely right after I renewed it for a year. Huge PoS and they're liars.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRzZBQ2VkWW5yMDZPdk9FM3gtTkxjcUYwa3NZOHhneWpzam9DNFJLZzR2UnNKN3BHRTVnNXVCMHRUUUhGVEJEWEpyMmhEa0pJSGhkU01Ucjdj",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "St. Mary Catholic Church",
        "comment": "It's ok, but I'm very annoyed that it puts a 1 mile restriction on the Car Finder part of the app. If you are more than 1 mile away from the car, it won't help you. That is some extra work the software does to NOT tell you where you car is. Don't tell me for privacy reasons, that would be stupid. It's my car, and I want to know where it is no matter how far away I am. What if I want to know where my child has driven my car to?",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRkxObVpfbXJ0dXNWOVYxN2lQR3FIVFZ1RFdLYWROQll0MVZpaFVRbFkxaFVKZ3Rhdk43eURmRk5acGYxTVNTUE56c1QyV3ZQUVdsa2NrNHZJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jennifer Mason",
        "comment": "It's a rip off.  I was so excited when I bought my car and found out I could start my car using my phone.   Then reality set in.  The cost was over $200 a year to have Blue Link sometimes start my car.  I would be in my house looking at my car and try to remote start and then get an error message.    So if you think about it if you keep your car for over 3 years you are paying over $600 for an app that only works half the time.  You can go and purchase a non factory starter and spend less than $600 and have it work all the time instead of when it wants to work.   Hyundai needs to do better.  This app is a rip off.  I will not be renewing my subscription.",
        "date": "June 1, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSFZ2dDRlVWVmMTRLcVB1OVowb2kwQ1lGdUdCQlFaZGlxY0VCeDUyc3lwcFhhOFRCMk9VQlZkZ3ktQmNTX0VHU2Q1cjl5MTlmOXJ4aWxLSmZB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kabrya Colson",
        "comment": "I loved the app when it worked for me. Now I keep getting \"Authentication header required []\". I have no idea what that means. I called to make sure all my things I PAID for was still active, and they proceeded to tell me it was the app having issues.  I have a Galaxy 8+",
        "date": "June 14, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSHJPZEViY29vVkpHSVFobEhIbEpsR0hLSC1YS2FCWVdLRHlZZVJoUjlMd3ZiUElGeElBa2lsZ0hscC1OdzROYWVUV1J6eUJFTHlnbFptNlpF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "C Ritchey",
        "comment": "What is the point? I have tried numerous times to use the app to schedule service, which demands I find dealer. And when I try that it says I am not allowed to use the feature. For that matter, I haven't found anything I can use the app for. Do you have another app that works for 2011 models? I can't find it.",
        "date": "May 17, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRkFERFYzUmJGMjN1dElBUVBVSnFBaVJjblJLbUJfeGpjLVZPcnJiZWhqWno1MHk5RFRPcXR4SU5vSW9RTkk2MjlGaUFacm1NdktLeHRoaFkw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Tim Parks",
        "comment": "Blue Link app was inoperative for 2 weeks and when Blue Link's fix was executed, compensation was denied. Sadly, $200. annually is an overcharge for the remote start given the fact that the remote start is in the $100. 2nd teir package but Blue Link forces the subscriber to pay for the 1st teir package ($100. also) regardless of whether or not it is not desired.",
        "date": "June 15, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRXdMYi1FcmhJSXVGNGd1YkZReE1zcktlQnZuTWwyejNCT29KMDVkdmt0a2UyMy12bm52UTVnQ2hYcUFnbnRfR09yUTBpWWowcjZkNGRTbkcw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "David Hume",
        "comment": "POI search never sends data to the car.  Commands take too long to send to the car to be useful and the manual link to a simple PDF file is still showing unavailable.  Hyundai had scammed their customers with these expensive and mostly infuriating features that never work including the in car navigation, the stupid blue link program and subscription service and this convoluted and pathetic app.  Hyundai engineers!  Your fired.",
        "date": "September 20, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSC11WXAxTzFhXzRqdUxJTElyUXZwdUdpc3o4N0t1WVFBQ0czaGxzUXlJRnR2SkFUQWZSZ2I5T0NoSjl1T2FaWTNtZkJsaHg5QUtIbVhRTHpN",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Bill Warren",
        "comment": "Miserable.  I honestly would not have bought the car if I knew the app sucked this badly. I wanted remote start and they told me this \"cool app\" would offer that. $200 annually and the server doesn't respond over 50% of the time. So much potential and cramp execution on this app. Last Hyundai I buy if I need the app for remote start. So disappointed.",
        "date": "April 26, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSDZuNF8zLV9SQmRLbVVKTTBHY3RUVDNrUnczRHI3YWRKcHBmRXlVUF9Jc3FWcGVpeFBQRjdONEdpSVRaajNiTDJMbnlWRVFSU0dUT1NGY2tV",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "xx xx",
        "comment": "The worst app ever! I supposingly got a free three month trial with the purchase of my 2017 Hyundai but when I use this app everything I click on it says it's not available to check my package. Really Hyundai?? If it's a free trial I can't tell nothing on this app benefits me and the espensive purchase I made on this Hyundai. Had I known that I would've took my business to another dedicated and loyal manufacturer. Almost feel like a rip off.",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRXl3SHMxQks2bUVfeHhXclMzMC1rZER2ZVZzZW0xLTNMZjl2NEhCQmF6YlFCTVZuNXJlMDYtQWV6TkY3N3ZnMmNpc216Smt3ZDM2Ym1GYktj",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Michael Hancock",
        "comment": "I have installed the Bluelink app but cannot use it because I have an unlocked and rooted cell. Cell phones today are tied down and locked to wireless company's and I refuse to accept that therefore I have mine unlocked and rooted. If I didn't I would not be able to run the newest version of Android along with many other features. For Bluelink to lock the app because of this is completely unacceptable!  Being a softer developer for over 20+ years I know this will not cause a single problem. The status of ones cell should not dictate the ability to use your app. This will have a huge impact on my decision to renew my Bluelink service.",
        "date": "April 10, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPSDZnd0V0TElQNXR2MDMxRzAtRlpYa3ZlYXc3RU9mMUZzWlhSM2dINWYwVERqWWRMU0M1STRjOS1COGJ5UG5IMnF1UXVhWnQ3MGpVMHkyN1Rz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "R Smith",
        "comment": "Do NOT waste money on this service! 1) You MUST purchase Connect Care  ($100/yr) to buy the other services: Remote Start and/or Guidance. 2) Connect Care only sends a msg saying system OK. You get more info looking at the dashboard for free.  3) Remote Start (another $100/yr) take 3 to 5 minutes to start the car. What happen to the keyfob that started the car when pressed. 4) Guidance  (another $100/yr) is nice but also takes 5 minutes to update car nav system. Google maps and waze are better and are free. 5) C/S reps are extremely rude and condescending. They will not help with any problems or issues. They only want your money for the way over priced services.",
        "date": "May 15, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPR21ON3ZqQWxERjdjZDVqNlpTbmExakQxbi13Y2tHTXRyaEpuNUN0RlhFaEpibUVKYTB4dEhWUHBJTElZeFlpREZ6RXl0c2hKbGRBT3RZam9R",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Peter Mahan",
        "comment": "This app has a 10% success rate when it comes to sending commands to your vehicle.  Garbage.  Waste of $99 a year for this service",
        "date": "July 18, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRW1DMEoxZkIzQzc3WENmQVdQT2lGSDNaX29reEdDeXBHTWJ5aUxRSnpQbFhHTnd4Z1FKaEpRaFAzcWVwSTJVRExYbUFhSHBkS1ZyMHYxdEYw",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Richard B.",
        "comment": "Nice little car info app with some really handy features when the work. The car locator quite often has server issues (doesn't work 99% of the time. . Still pretty handy.",
        "date": "November 21, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPR0F3UFZDVC1vMkd4cmtqVFZYZFhYQi02U0JXSkRjTXV2RG15Vi1fWHRERmN4bTN0ZWpmdTUzY1BneXgwRnZNM1pJa3U4TU9OVWRWYWpxNzE4",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Brad Poulsen",
        "comment": "Terrible, app doesn't always do what you instruct it to do. Seems no matter what I ask it to do, it sends me an email telling me that it turned on the cars lights.",
        "date": "May 16, 2017",
        "permlink": "/store/apps/details?id=com.stationdm.bluelink&reviewId=Z3A6QU9xcFRPRWRlN0RoLWk2ZU5pWWxtNUQwWGI1TnRMU3VrQUozMVdyWUwtTno1dkZMS0w4S1R1UzV4MTZXaXp0bFRxZXU4YjZscEc0bjBfTGFTS3NOdmFN",
        "reply": null,
        "star": 1,
        "title": null
    }
]