[
    {
        "author": "Tony Gaines",
        "comment": "How I felt about the app can be seen below. As of late though, the notifications appear to be broken. I'll receive duplicate notifications, no notifications, or my phone will vibrate like I'm receiving a message when I send one, with no option to turn that off. Google please fix this or I'll have to get another messaging app.   Great app, needs to have the ability to like/Love a message. Also needs better integration of knowing when someone's typing and to be able to text anyone with the app over WiFi like iMessage. Then it'll be the best around.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRXNxLTFWalpGSXVtNXJRY2xiX1QzWlJlWExLUDkyWWJOUEQwMXk2S2U0TDdkaUl2U2NUWDBtbVI3VVRIMlBzc0pVQUhON0wtRXc3b1NfS1E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Justin Kennamer",
        "comment": "I love this app, however, the camera button needs to be on the RIGHT side of the camera window. How can you hold the phone one handed and take a picture when the button is in the MIDDLE of the screen (especially in landscape)? Also, can you please add the ability to change backgrounds and balloon styles like the stock app? I have to agree about the RETURN key. Please bring it back.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSGFEaFZEbXdkLTVmYkM1bWlWYmx6dE9zQmtGZG80bkZWaTBPaVU2ZG1sWmt5QTJnNWF6YVBqSnEycGZWYnRPWGV6eEppWVBqV0xwTmh3cXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Thomas Filbert",
        "comment": "I like the app, I think it's definitely an improvement over what the default Android messaging app was. That being said, I don't always get all the texts particularly from iPhones and sometimes the text will be half of the next text mixed with part of an older text? It's pretty bizarre. It makes it not particularly reliable when it only works completely some of the time. Fix that issue and it'd be a great messaging app...",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRTdIRVVSY3hhUTZiZ3BYek5XU0p0SDU3Mm8tczYxUVVnT1lpTlJqRWNubmhnNXd0dENEdEtuVzFPWmtsVHdXUlJFNWpjdEt0UE53dmNaMVE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kris Yablonski",
        "comment": "Wish you could change background on the messages. As much time as we spend texting, people like to have the ability customize or give a theme to their messaging app and in order to use some of the features of the Gboard you need to use this app for messages. I don't want to change the colors of every contact. I want the ability to change the colors of all of them as well and the message bubbles and background. I don't think that should be to hard since almost all the other message app allow that.  Adding the ability to personalize this message app would make this the best app. I don't know if I will use it bc of that. I would rather be able to Personalize my message app over using the features of the Gboard that only work with this app. Silly maybe, but when you text all the time but only use a feature once in awhile it makes a difference.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR1FSdDBYTnp5alRhS2NxWFA0ME10MDBHVGo2bTQ4NmNSX3QtNkFfbVhyRmNqY3dtSmFEYUZTV3RVRVFIbnFLbnp4Z3g3SmZ5Ml9UZnJaaHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Austin Chandler",
        "comment": "Good messaging app. It's the one I prefer. I used to use hangouts until they took sms off of it. Great job google....Great job *sarcasm*. Nice UI. The only problem I find with it is group messaging. I have issues sending and receiving mms messages in group chats after several messages have been sent. I usually have to reboot my phone to get them working again.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSHZrWExVS0hNNGZIMmF2YTZXaTVyWUF2LU1ia25HYkFaZEFDazVtVlpxOEVIWmhtWm9UUjBuYUZYYndLWENTUTJTT3loTUFPNWhHRFNwNnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Allan Laevens",
        "comment": "This app does show when typing when other users are using same app. Sorry but if your friend has iSheephone then no you can't see them type. Tell your friend to get their head out of their Apple and get a droid. Works great. Double texting error is often a carrier issue when send read receipt isn't established. Works good for a text app.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR3pqX1NDeDlITGtKcFVGQ2JEd2hvSzhNdDFGRVlFQnRnYmRlQlFKU1lxQzJSTm9jNTlnZVFtUHdteFJhWllacjlER01ZUnVxQ1JjT1FCTnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Motorola Memo is better. This Google version won't let you start creating a SMS draft version without first naming a recipient. Motorola phones used to let you create the text body of a SMS then when you were happy with it, add the recipient, so you could compose and edit SMS's without accidentally sending an unfinished version because you could add the recipient as the last thing to do but this version won't let you do that.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRW9kWEg3cV94LTBPU3JlTDB6X01sWmZkS3B4OGtPVHBkMnhZV3BHTVZWSUlJOC1FV2VyOEZxWDJEWmJNbFBFenJRdFhLWl8wckVqZ3hSa0E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "My top choice for a messaging app but it needs improvement. Give us the option to turn off \"swipe to archive\". I accidentally archive conversations all the time due to this feature. A built in back up feature would be great to make transitioning to a new device smoother without losing all our messages. Lastly, RCS support in the near future would be highly appreciated. SMS is outdated.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSHc1SkU2dDE1YlE0SUt1ZmN3TEIxenYxQzlhOEZlTTZINjFrZ1hqU1FJMVJXbm5rcDZ2b1BwMEhmTXAzSTJJd21vc20tS01VR25YU2M2Snc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Drew Coon",
        "comment": "I would rate this app better if there was an option in the settings to put and lock the voice to text microphone button back onto the main key pad for easy access to it instead of having to push and hold the settings button until the little buggers pop up and then Hit the micro button. Not a great option if your driving or busy and in a hurry. Allow it to be put on the main key board for fast easy access please.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR2MzaEZsTlgyU2ZqYTRQLXdOa1p5RlJyNlZyQnBWZ2RUS1ZwbmlCRFl5d0hyaHFqQkhIZHpVWWFqdk5qU1I1MFBEZ2t6NEdxbExMekxRUVE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "caleb busing",
        "comment": "As someone who just downloaded this update today and whom also has been using this app for eons, I'd like to know what the update today implemented that was different or better than the previous versions. Reading the description doesn't help as it explains features I already knew of. Anyone?",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSFBZZ2lHWmhuY1daLWdyQ0lmSTl0YUw1VXUxbkVzTGZCWURUOHpoOW5sNUVHTTQ3d0xVT0tXdGxGM1FZQ1ZZZ0xFakp0NGJETldVNWRQRFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "It is a good application. It does pretty much what I was looking for and I am using it instead of the messaging application from Samsung.  The only problem I am seeing is that I don't have a clue why some contacts in the messages show a picture and some other just a letter even though I have pictures for the contacts showing letters in the contact application and some of them even have pictures in their Google profile. I just wish I could understand how it works so I can make it consistent.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSG9XcGk0dHN0UDM0QUZhR29hcmlMRkE5N1VJcVVxVldfOVo5NjlUcjBkQ0NoU2dqaW4tU2ltOHJjVHkzOE1UUGtpdXV6YXA1YjJiNVpuMUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "David Honan",
        "comment": "The mms compression is absolutely horrible. Doesn't even allow me to send my carrier limit. Love the colors and layout but when I can't submit a decent looking picture through mms that's a deal breaker. I use Mood messenger and it's light-years better in quality and customization",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR3dpLWJ2aVREdnNSVW90MXJjcG9kY0NLUGNsWUhjcUh4c3NyUkhXblhsTXN6MHhGZlp5ODZkQkd4WEpJN0lSbU5FTzNGdkFwSF90MmxLcWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "BLACKBERRY KEYONE USER HERE- PLEASE FIX THE 106 CHARACTER BUG LIMIT. Cannot see or write anymore text after going down to 106 characters! Otherwise would rate higher- decent app but this bug is huge for me!",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR1hadS1yNEYtTGFKbUpvVEVkYmNOMDVwUm5HckxSZTE3R0F6bk1uRkxsSFIzZUlqNTk2NGpOVGxPYUpJRFQ0VUNfYjBfcGZHSjJKMmVTSUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "BRIJESH MISHRA",
        "comment": "This app is junk try to see the discontinued Asus messaging. When anyone wants to use 100% sure message delivery then no option other than basic messaging app. Data based chatting is of no use.  I want group message facility and to send/share contacts as text message. The Asus messaging app was the best till today I have not seen any others.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR3c1LUFhUTQ3andGUmJHaXVEeENWZE4xOEhiZzliOWdfTUlobGpYYTlQTlFhTkNxb3lyUGkwNWxtVjYtN01DaVRIRDN0S1lUMnFJR1U3SEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Reuben Timberlake",
        "comment": "No clue why but two months after getting this phone I'll get a text  repeatedly sent to me and I don't mean one or two times, I'm talking about upwards of 75 times in an hour. I'll update the app whenever there is one hoping that this issue gets resolved but to no avail. The only reason I keep this app is because of work related messages. Whenever I don't need to keep them any longer I plan on dumping this app for good.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRWxMSThNSWxuSXhRSmNudlF1VS00OWcyWTIxREVlSHQ0M09Wb2xUNllzWGlzVm01UU00VURsblBBV0xvTjFySHR6SVBxUHJzSGgyNE9Wd1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Cristin Yavorsky Bialick",
        "comment": "Messages say they are not sent but the recipient has gotten them, group mms messages are not downloading automatically and not downloading quickly. Since the messages are time stamped when they are finally received on the phone messages are confusing and out of order. The interface is much better than the alternatives though.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRVRPcVItMXNKbDIzTVduazZ3Uk9waTBOSDl5MVRxYUgwMjRzaTN0TXA4WUZTRkZFLTBKNk5oMElZSGxpSGhkaWd2Sk1FZFVLdVlyRE1Lb3c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Nex 5x - upgraded to Oreo - am not getting message notification, AT ALL.  I was told to turn message notifications off & on.  Also told to do same in airplane mode.  REBOOTED.  NOT FIXED.  I NOTICED IN MESSAGE APP,  additional settings, click on notifications to go nowhere.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRS0zN0wtYTlFYk5FUUpscHlNTURkTEd3eG5YSmd1NF9OZHZFZ0RHOF9DOUxidGxBNXhPeHMyQ1BQSU9XVHY1TDYtWkZ2VzNtLUxMSkRlWWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Mikhail G",
        "comment": "Going back to my default messages app. 1) a contact may have more than 1 number and i cant see the number they use under their name. 2) cant select multiple messages to delete. Have to do it one by one. 3) swipe left or right to call or text not part of app feature. 4) who uses archive? Its either i leave it on my inbox or delete it, afterall, the most active thread moves to the top.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSERHTFpRT2RHMURyRUt4UXozYU1CRjA0b1pjbDZQM2x4UkNfZEUwa0xsWDRXdUJiX3BRcFNDVlBuSHFEOWNiOU9yZ3lvT3V2bVBETlBiTFE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Corbin Baxter",
        "comment": "The multi-colored chat system is really nice. It provides a clear distinction between people in a group chat, and it makes individual chats more fun. Stickers are fun, but utterly pointless. It's worked very reliably. If the hinted features are coming, then I'll be even more impressed with this app!",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRXhjc1ZhMFlMSTd0T2ExTHNCNGlESHZzMWVLcGZqVnNjam12NGVOaEhDQnFDMlYwZUV6aE4xbko5LUlYeHhablB5Skgydkt3d3V4dlB5dVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sam Barroso",
        "comment": "I've been using it for almost a year, and my only complaint is that sending MMS pictures for some reason, shrinks the picture and lowers the quality BY A LOT. Sometimes to the point where you can't even tell what you're seeing. Other than that tho, this app is pretty much ready to rival iMessage, you just need to finish it.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRlE4cEpxcVZ6d01BcENnT000VEtJcmdZMlZSWHc0Uk40bmp4ZUNxSEVPOG1hdG40eU4xV082dXlyWE1yMS1FRVUxWUpTOFpqaXN6ZFpNWXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Richard Mills",
        "comment": "I would love to use it, but when I try and compose a new message it freezes for ages. Sent an email to Google and got a \"this is an unmonitored email\" reply. Really Google you are supposed to be pretty good at this type of thing. Can not find any way to contact a human so I suppose I'll have to uninstall",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRkdBdHpkb1JPWHJIUXdwYkRaajF4NTJRSGJSRzhfMUhlS0lWR3JxdDhHUzlwUjhlM3lnVHR5S3ljUW9jQVJBbmR1ejloOW5uVVVPT1gwb3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Chris McLaughlin",
        "comment": "Just add the ability to have message notifications repeat after x minutes that way I don't miss a message I didn't hear the first time, and get reminded to read my message if I couldn't look the first time. Disappointed with slow app progression over the years.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR2xyVE1aMm1LR2xWVDU3WFNoSTJFc2FpbnZ1YmktSTdzRDZqZHNOelNGc3VMSUlUeWYxNnRoQk9GcUhBRkRHSHU3QTFyZlQtNTNWNVo4eHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Calum Cousins",
        "comment": "Ok as a messaging app, though some OEM messaging apps are better. Biggest flaw is the inability to restore messages backed up in Google Drive within the app - you have to factory reset your whole phone to do that through the initial setup process! I mean come on Google, basics!!",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRkxSUmRRd0xYZVM2V0ZiOE56RVJaSmdZMW1YSDllenFnTTRmUWpjQmtyRGx1clBvOW8tX1ZERnJpMXJZSG51MG9WS0l2RFpuTVFFdExPTEE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "FELIX TRUJILLO",
        "comment": "I only wish that this APP could be downloaded and Synced to a PC through a app for Windows 10, because I tend to text a whole lot in my line of work and my hands cramp up every now and then.  If there is an APP that can be downloaded and Synced on PC, I haven't found one. If you can recommend an APP on PC that'll Sync to this, I would appreciate any recommendations.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRzJoQmNzdkdZcXU5bEE0UUZtNWlLbjFsNnR2UmY1WkhoVnBadkkyZkJyeXUzajBQU21jT21YQkVHM1FvVnBFbHQ5akNxUlNvRXVKTWZhZnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Spencer Pomeranz",
        "comment": "Everything is great but I have one problem. The search function is bugged. I'll type in what I'm looking for, and it'll show me how many times that word comes up, but it won't show them to me. When I scroll the options nothing happens. Otherwise 5 stars!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSGw1ZXFXaUhtQ2tvTC02cmlhM2YyZGtnQ2ZMZGZpVnlweVhweHBQTzFZNjhHejFDYzhkd2QzTVlnZjJPTm1MZ3o2SzI4QlhWVDNyN3Y2YlE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Lyndz W",
        "comment": "Notifications no longer work. Don't get a popup over lock screen, no screen turning on. Nothing. Have to manually check now. Needs a better quick reply pop-up option and option to change universal theme color. Please fix. Awful. No popup over lock screen so no idea I have a message",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR294MzE5NTA3dDliTGo3UmlBNWpFNHpTQ0NmeTZwSkNvc180VmZ3NVYyNDBiMGlBTjJBeXJNWG1nYzh2dTRUQWw4dm9QdGJqTEo3WHJPbHc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Caleb Hawn",
        "comment": "I really like Android Messages! It's a generic SMS app by Google. Even though it doesn't do to much other than SMS, it looks really nice and has that Google style to it. I prefer it over the stock SMS app, though nothing beats Google Hangouts when it had SMS. I wish they'd kept it there, but since they refuse to, this is what I recommended.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR1kxaDVQSUhnbzlwWG80bUJ1b1UyczJVd1VmdFBMbXc4dEkzdk85MlpYcEZJT2Y2dzNVQnhpSzMyYXpNU3dVVmJlUG45S0F2OFpsR3JyQ2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "This is quite a good, simple SMS client.  This has replaced my default Android messaging app.  I wish this app could txt message also instead of just SMS, but the last thing we need is another messaging standard.  Nice work.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSE1HbGQ5c3lZTlBXVVlUQU1XcmZzYWRJUFZmS3JwMGNwd1RqS3ZPM3ZwNWpRbG1KX2RvdXVlcW1RRDdSNThKRUJvNEtyS01SZFRMdWJiTXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Kelsey Clarke",
        "comment": "Sometimes it's great but sometimes it sucks. Has been crashing more and more. Emoji button is way too easy to hit accidentally so I keep typing flags of various origins. Making me feel old and sad. Thanks Android... 🇦🇩🇦🇮🇦🇪🇦🇬🇦🇷🇦🇺🇦🇴🇦🇺🇦🇷🇦🇲🇦🇷",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR0pJcWFpUkZWT05KS2JzaTN1Tk1YMVVfV3RlazJHaEZDTzhjbmpIa0lDT2NZbVExNFBIeGRJYVRiQ3VqR003QmVuU1VTZm5ITEJOeTN1cUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Free Eagle",
        "comment": "I used to love this app as well as Google however for the last few weeks the messaging app (and my Pixel) has been acting up. It chooses at random who it will NOT send a text to.   Ex: Today I CAN'T send to Mike, yesterday I COULD send Mike, and tomorrow it's POSSIBLE  that I can send to Mike?  Between a few different minor things that add up to frustrating, I will Not get another pixel",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRURzWmx6QUw2N3lMYkdYUXZUUUhVNmFqVU9EV2NsblZCckh1UTFzUjNEeUdPQW5CN09UcFFWcUtmNnRZbHNFRW5IWkhlZ3Z0eTQwaFVnOEE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Tiger Warrior",
        "comment": "I love the app but it needs to be able to read messages better when you get a text and where read what's not also a redesign would be good with a new look and with a dark theme, and a few others would be cool. Not just a default look I prefer customization. Also please make rcs work like for everyone else! Please please.. I'll keep using your app if you implement the changes.. Currently using it on cricket s7.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSGxHdk40YXlpMktDajFhVi1jSHRLM09jbVR6bjZuVDhrbTN1eDBUVm1hd2dNNnQzaWR3ZGxOR0JSSW94blk2ZmFlSjAzdW1GeWw2ZWJRR3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Carlos Martinez",
        "comment": "One day I was caught in a group chat over 3 months ago and I deleted it it without reading it, now it has said for over 3 months that I have 21 unread text messages. HOW if I deleted the whole conversation without opening it?! Until this is fixed, this bogus app will be 1-Star forever by me.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRXpuZmZydVktbUxMU0RYQ21RZzE5S204bkNsZVc3X2hUT0xFN25nY2U5cURJS19VQWdZcFNVc09ucU5XQjFpQ0FlM2hPeFg0dmhyWWs0OEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "👍Love this app, it's better then the message that comes with the Samsung's👍, but I've been having a problem. Everytime I receive a mesaage, my screened phone doesn't turn on. Please help!! I'm not sure if I have to do something on settings.  Please Google help!!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSEs0VTc5bGxheE0xaV9jZzl4UmllWUxUZVFmUEdld1BKdW0tMmFNb0ZtRmNBV1JpeVlaa1RjOEMwZnpGeFdTLTNFcGN4S05odmRJY3hCN0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Nitish Barman",
        "comment": "Great, straightforward app. It would be even better if there was a way to find all unread messages. For months I've had a \"2 new texts\" notification that I cannot get rid of because I can't find the unread texts (and I don't want to go through every thread to find the unread texts).",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSE1NODAxQ1hnR2xTM2pDeTd3bGR0NjQxaGVlLWVHVUt2ci12V1hBZzA5cVZhaGRVcGVyR2NwXzlWOVQ1ZE9iNGhnSmF5VFJJUXowY0EtS3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Matthew Bamford",
        "comment": "This app is nice and simple and has a good array of stuff, like stickers, and you can send you location and all that. But one problem, I don't know if it's to do with my phone but, I can't send or receive photos or videos.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR0VKN283RV9oTV96VXg5cEVOLXhGVV9JT2U5ek04XzY2ZmlLZUhKX3pqUHhvWnUzcFdKdmhoRWE1cEdybTdWUlBFa1ptaElaTTA0RFdMckE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "M D Hall",
        "comment": "Google is purposely not giving info on updates... NOT COOL! I'd like to know what the update is & make a decision if I want it or not. Are we know just sheep & Google is the Shepard?",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPR0JKay1IZG9QdDBVcWU4S1p4ZVRseWdWSkwzdnphSGhPT3Y5OVdUc2pVM2JzSWd5X2h0clItRG9zWjJBWUswYUt1MjRhc3NidUNXTDFwTnc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Danita Bergrud",
        "comment": "I have tried and tried and tried to figure out how to change a setting and it doesn't seem to work. When I send out an email to more than one person it automatically sends it where they can all see it and I'll reply and people are getting ticked that their phones are dinging 4 hours at their places of business. I can't do this to my friends and I don't know how to change it to individual messages if there is a fix for this I will certainly change my rating.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRTdsWWtRUV9zZFh5cVNkbno4N2JSZ3ZLMzJLQ1B5ZFp1NExCaVotRzZVY1V5cGI2N0ZrbTRQZGdKVFJqa1NKWmQ3VDVaRmV2aUhRQnFWOWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Allen",
        "comment": "Don't love it but like it. Don't like at all having such a small viewing window (4 or so lines) when typing longer texts. Having to scroll up/down to proofread is super frustrating. DO like ability to send comment UNDER a sent image in the same send where oddly, Hangouts doesn't seem to allow as it must be sent in two sends.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRnhxX1hmdWMwZ0hQaTF3UzZob2Itb3ZGemZ1cWJkRklFdXZETWdYZkUyWFdZTlRfNWJWVWJ5WDlRZVdHSGNNTVRWTFZleWRLMTFtNXJ2eGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tracy Chesnutt",
        "comment": "This is a fairly good app without any bells and whistles. I like that it sends messages over WiFi, which I really need. It does crash a lot and it's very slow to load conversations. It's a little clunky to use but overall it's a decent basic messaging app.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPRmdqcDBFd0tuNkNqNjk0ZXI5cElGMnhQUVVVVDVYZHc5MWE1YTJJbHY5bVhsZ1ZrV19pZ0tzMVBIY3p3c2JRRWVtNFlQcm9KTE9GYjRXeGc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "racheal",
        "comment": "Group texting is next to impossible. Something that should be as simple as adding a name becomes a search through every text you've sent. its cumbersome. Hate it but no ads",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.apps.messaging&reviewId=Z3A6QU9xcFRPSHpjV3RwQ296S0M3eXJTeUh2b3h3VWk4TU9jdVhLT1RyZGFucl9RZUdPRDJDYk1idXFudVRUdGx4VWg5LXdrUHNoRzJtaHpaWWpaT0lqZHc",
        "reply": null,
        "star": 1,
        "title": null
    }
]