[
    {
        "author": "Matt Walker",
        "comment": "It's ok but won't recognize extremely simple movements like a trap bar deadlift. Needs some work but has promise.   Update - this thing once had potential but now it genuinely sucks. They've essentially abandoned it for their next tracker. The app hasn't been updated in months and neither has the firmware. Not even worth the $50 you can get it for on Amazon now.",
        "date": "June 20, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRVdyOVJPRFotTDlmY3dZY3ZfMjNCNnRPWm84NFViZF90bC1iQV9UR1JQSjRkbHJLWXBVX1lFZEhoUWhIUlR3NV9qSG9FRk5pSUliTFV6RUE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Matt! We have been updating bugs on the Atlas2 and focusing on the Shape that will be releasing soon. Thank you for your honest review!",
            "date": "August 9, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "michelle objway",
        "comment": "Completely stopped all syncing now wont work at all except the clock. Its less then 5 months old why did it stop working so soon after purchase? Please fix this otherwise it was my fav watch worked so well",
        "date": "September 14, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRzBkOTRDS0kzR0RoVUNsOGNVc2JjdTBRdmV5dnRqcjk3d0NXdC1jdVhsaUZwYng1NHg4dzlHNlhwZVozWFkxRjU2eTA2M3Ntd3MwOEtoNkE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Michelle! Were you able sync? Let us know at support@atlaswearables.com",
            "date": "February 19, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Jose Quesada",
        "comment": "the app work good here. the band is the problem for me. I do crossfit and the app at first look like it recognize some exercise. the problem is that the exercise had to be done in slow motion and execute it perfectly to the wristband recognize it. so at the end maybe I returned it. when I get home I need to spend a lot of time to edit everything.",
        "date": "March 29, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRkNKZ014d0RsZWVqeEdXMFl2a05JUmd3Tk1IRHNnd2JfaVJ5ODY3ZGlaU2FENVd3Z0VPYVVEM29LcUFRQlU2NzdIT284UEZwREtxV1Q0UUE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Jose! How is the Atlas recognizing the exercises now that you have been teaching it?",
            "date": "August 9, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Eric Powell",
        "comment": "Won't sync to Moto Droid Z.  Instructions for Syncing are beyond cryptic. Sounds easy, doesn't work. At all.  Glad I only wasted $30.00 on this thing.",
        "date": "September 20, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRmwxbFlGaURMMmg0Y2lkQWU2dk9BSXVHT2RZSEZfVzd4a1ZsUjQwcDlYaVl1Zm00c1J6VkZMWldVcVFNODRZQkY0aXJGYTVTejgyQXN1eVE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Eric! Were you able to sync? Let us know at support@atlaswearables.com",
            "date": "February 19, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Chad Breaux",
        "comment": "It's perfection. The perfect work out tracker. Freestyle is the way to go. It automatically detects what exercise you're doing and counts the reps. If you're doing an exercise that it does not recognize you can set a custom exercise and teach the device to recognize the movements but it does take about three times of teaching it for it to pick it up perfectly sometimes four times that's not a problem. This device works perfectly I am on my second wristband 2 the reason why I'm on my second one because the first one I bought I carried it around in my backpack everywhere I went and it caused a device to quit working properly. I think it's because since this is a motion detector that if you wear it or carry it around when you are not using it it jams up the sensing mechanisms and detection software so I would like to let everyone know and I think you should let everyone know that this wristband 2 should only be worn during a workout when you're not using it put it in a place where it's not going to be moving around I'll just keep it on your wrist all the time or keep it in a backpack. I only wear it for your workout teach it what it does not know when you are not working out put it in a place where it will not move and the device will stay working perfectly and if you are teaching it a custom exercise and teach it to where it's high-quality at least 3 or 4 times and delete the medium and poor quality teaching. I love this device and I strongly recommended and endorse it",
        "date": "November 13, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR0tMVnVOX20xMUtibXZhbU14clFhQ2hSdlF5SVRVc21RWURRS1FnRHNzOTNscWZXSzhzbUVfRm9ReHJHeVhYNFcwYzlTOXFIVzU2aDJEWHc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Chad! Stoked you dig the Atlas. Thanks for the epic and detailed review!",
            "date": "February 19, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Poli Tehnist",
        "comment": "After 1 month, it refuses to sync. Bluetooth detects the device, but the app doesn t sync. It got completly discharged, maybe that kills the bluetooth. Many improvements to be made in the ap and in the way the watch menu layout is (very very unintuitive) . Great potential, but for a product to be unusable after one month...",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPSHIya2hUUGU1TVdsZkx5OG02dWoyNGVkdTBpcWpaQ1RKRFlIQmxtalNOMkNoTURNc2VKTmlFcFBGY1VMay1JYldUQ3R4UUVjSlBQb2NPQlE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Poli! Apologies for your troubles. Have you uninstalled and reinstalled the app for the newest version? Did you get the Atlas to sync? Email us at support@atlaswearables.com so we may further help!",
            "date": "February 19, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Fernando Montoya",
        "comment": "I was frustrated at the beginning, but with patience I have followed the teaching and it works. Now it tracks and sync the workouts. Take your time at teaching.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRVdGWnhONjdXTThfYUtWa3M0OXNGa3VnTUhiWUw5VHVSUVJ4a0dPQkZzSVB2VHAtRHB0Um93dE1fUzE0YVJWTjdhbnBWYTJoSUZOaXlWc1E",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Fernando! Apologies for your troubles. Please email us at support@atlaswearables.com so we may further help!",
            "date": "February 19, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Dengor Lor",
        "comment": "Alright where to begin.. i hust warrantied my watch after 1mth. Received new watch... now the app doesnt work.  Doesnt connect to watch cant load anything whats so ever app always shuts down. Very disappointed in both watch and app. Altas get yr s... together.",
        "date": "June 22, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRTBhNVRTZUxsWjd2VElsTGdwbTJfWUN4Y3VBZEVicnVNU3c2WVBwRG1xS21CNnA4UHRtbWo5ZUhqWXgwU2pFcjBHZ3JjQ3diNk5BbXR4dVE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Dengor! Apologies for your troubles. Please email support@atlaswearables.com with the SN number and the email you associate with the Atlas.",
            "date": "August 9, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Navas Khan",
        "comment": "What happened to the sync? My band is not syncing at all. It preps, but when it comes to syncing, the app just fails. It's just a yellow semi circle that refuses to make progress.",
        "date": "October 11, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR2Q2RjFLTDJkRkhVM193WmZjVVZ3aW1SQ3hmc2wxa2JvTExRZGpERFNyN0NuXy1sekhjRFdqQU1SakVWMklpUTZSNW5IY3ZKb0xpd0tKcVE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Navas! This bug should be updated. Please let us know at support@atlaswearables.com",
            "date": "February 19, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Hohf Man",
        "comment": "Dude I have amazon fire phone is 4.6.1 moov is working but the atlas won't connect to the device. Bluetooth 4.0 issue has it been fixed.",
        "date": "October 8, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRW56TmI1OVpvbkFPRXUwbk52RkdFYmdnY1BQcXNRbjhNMVh3dnhRNDFWR3h0NTNhZzQzQTVRVW1KMlQ5anFYOXA3RG9RRVRjM0FkbTNyYXc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hi, sorry for the inconvenience Hof. Please email us at info@atlaswearables.com and we'll help you get it connected!",
            "date": "October 8, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Aaron Perera",
        "comment": "The app is great but im having some issues syncing. Also i never have any info in the activity tracker screen? Also what is the difference between this app and the paid app?",
        "date": "February 14, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRnpSRmtxcWJTR3JEY3BJWXBqaE5WcjFsYVp0ek5IdWt0ZnZ6dXBYYmlnNjFRend2MG14amlpOFVVUTRUYl9UR0NIeWxoWXVzeDMtc0h4dUE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Aaron! How is the syncing going? The difference is that the paid app is for the Android watch wearers.",
            "date": "August 9, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "sili wolf",
        "comment": "The app looks comprehensive, but won't connect to my brand new shape device. The other app (with the chat bot) seems to sync just fine",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRTYteUItVGliVXZFcVB3VDlCM1hHN0RjRFhKWGpKYW13Z004eFdicmZZdGpPUHBPU1hlYWZ5VVoyTlZpcllhR0doMlZERHF0NGk5am96dGc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Sili! There are two different apps for each of the two different devices. The Atlas and the Shape. Seems like you got the right app downloaded with the right device. If you are still having troubles, email us at: support@atlaswearables.com",
            "date": "February 19, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Ola Hindmo",
        "comment": "UPDATE 2: Now the tracker also DIED COMPLETELY. Can not reset with the 10sec press trick nor start it. Totally dead. Less than 6months old and handled with extreme care, even had a soft bag to store it. Obviously update broke it. DO NOT BUY.  Update. Hangs at synching in app even if it connects it NEVER SYNCS FIX IT quick or I will change grade on amazon too.   OLD REVIEW This can become the best gadget EV =) +ups+ 1. Fantastic overview to quickly see muscles that need more focus 2.Fantastic details on history even showing velocity 3.Awesome teach mode -downs- 1.Android back button does not work in app and we android users HATE to be forced to use in app (apple style) back button ;) 2.Syncing is very slow (20~30s) 3.When selecting exercises from the long list and choosing to watch firm video, the list jumps back to top of list when going back, it should jump back to current selection to prevent scroll mania 4. Scrolling is very choppy. Sometimes nothing happens, sometimes it scrolls a full page 5.When creating routines you should be able to say how many sets, instead of creating I.e. 4 entries/sets one by one with same data.this to minimize scrolling and save time (or copy a row). 6.Phone heats up like crazy when using app, something is using loads of cpu. 7.my band don't seem to recognize bar exercises like chins 8.App is now SUUUPER  when moving between historic workouts and menus 9. Videos take forever to load even on 4g and wifi.@proposal@Add possibility to touch muscle group in overview (I.e. One you have not trained a lot) and based on that selection, give example list of exercises and allow to create workout from that list.perfect for both beginners and old school that needs new exercises This band and app has great potential, fix above and its 5 stars easy =) I'm really hyped about its future and glad I tried it and if it continues to develop I'm sure it will be a success.a scratch resistant glass is a must though, mine is already slightly scuffed after one gym session. Will try to find screenprotector for the non curved part at least.@LOL@reading the description here in ANDROID play store it says wireless sync with iPhone5 and up...hahaha what about us android users. Epic fail =)",
        "date": "November 16, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPSGtxQ2JQYkZHTE9qV1dHWEJCc3R0cGVKelJ5TkRWbTNvd3FFdkR5YUZ2SU13MlB1Z2dCNkkzdWp5ZU9IcndfTTVvNGQxWjB0QnItZ1NBMXc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Ola! IT will fix \"Android epic fails\". Stoked you dig the muscle focus and velocity.  We have found in some instances it is helpful to provide examples with varying rep counts, i.e., rather than 3 learning sessions with 10 reps each try 3 learning sessions with 6, 8, and 10 reps. Teaching Workout: https://www.youtube.com/watch?v=TSwMzyXURXQ",
            "date": "August 9, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Soumya Ranjan Mund",
        "comment": "Does what it supposed to do. Add more exercises to database please.Also, please provide option to rearrange exercises in custom workout.",
        "date": "October 6, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPSC16U2FpRlpZYWlWcXBFcnRnVnRjWkdDdGdMeWZneHFJREE3dVNrbFhUZmtyNHVLZ0ZVRFVFVWJmbklRN2FSaUNXamZkVWJpa1gxZEtYZ1E",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Soumya! Thanks for the epic review. As for more exercises, you may teach your Atlas: https://www.youtube.com/watch?v=TSwMzyXURXQ/ Great suggestion! We will see what we can do about rearranging the exercises in a custom workout.",
            "date": "October 6, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "jim viggers",
        "comment": "Why does this app say fast reps build muscle....slow reps build muscle. Why is this backwards?",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRkFnWjRTNWpGNVF0emh3MTl1YUNQbDUzNFN2ZWRPSGpySUhqd3E0Wmp5S0JpS1M3bkR2Mk9ES3VMcHQ5RHJtT3NyQWoweVFWc3IwWW5yRXc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Jim! \"Faster\" may be confusing, maybe \"more explosive\" \"faster reps\" because high velocity = fast reps = bulking People typically say slow because they want to maximize “time under tension”. A better analogy is to consider bolt versus a marathon runner. Low weight makes it easier to do high velocity and trading off volume to achieve velocity.",
            "date": "February 19, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Shaun Beacham",
        "comment": "Syncing hangs on \"verifying,\" so it never syncs with Atlas2.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRzJwNlhoWFU2aTUwNm8wb3ZxVEY0SXZkOTBCQnlJNnptTVNMbHhUSlBWeG03aFY5b3hyQUFYSmc3WmdwWjdBNy1Tek9ZU09FNWUzbFlKY1E",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Shaun! Apologies for your troubles. Try uninstalling and reinstalling the app. If you still have troubles, contact us at support@atlaswearables.com",
            "date": "February 24, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Denise Custard",
        "comment": "After a week I still don't know how to use it. This band is beginning to make me feel stupid. I have been trying to program my own routines, it caught about 50% of the time I worked out. The site makes it sound like all you have to do is download app sync app to wristband, workout and have it track what you are doing. This is not the case with my experience. I put my own workout in app and synced to band, but does not seem to recognize I am actually lifting my weights?! Still love it, but want it to work!",
        "date": "January 3, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRWIxUXdFVGw0dGpYeThJY2R6MGJVMTZBbkdvaF9DeUZrb3l2YXNFUmFkVk90emtTeUhJZURzenlHYnZoR25Zc2I0NUpMbHdTSGoxSlVCclE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hi Denise, sorry to hear about your issues, we have some tutorials available at www.atlaswearables.com/getstarted or you can hit us up any time at support@atlaswearables.com for someone to walk you through getting set up!",
            "date": "January 4, 2017"
        },
        "star": 3,
        "title": "Wanted this for so long"
    },
    {
        "author": "Erin Barrows",
        "comment": "I'm having to Uninstall and then reinstall the app every month or so since I purchased it in July.  When it syncs incorrectly I always get a calorie Count of 76. Otherwise I love the watch amts the app! Best tracker I've used!",
        "date": "January 4, 2017",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR1U0VjhqaDk2NDhqVDJPTllIUjRvN1hlb2d2dC1YZU1zeXU4NThnT1VxaG9FaUt3a0dNOTB5THV0YS14Y1hCeUJoaEFxOXFkaF9LYUJNaHc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Erin! Thanks for the review. Calorie count bug should be updated. How is the Atlas holding up for ya?",
            "date": "August 9, 2017"
        },
        "star": 3,
        "title": "When it syncs properly it's great!"
    },
    {
        "author": "Alexander Garanin",
        "comment": "It kinda works, but why... no, WHY it ignores the \"Back\" button?! That's a ridiculously obvious functionality for ANY Android app. And it's definitely not a bug - it's a failure, three different devices on different OS versions confirm that.",
        "date": "December 12, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR2lIQ2lyQkpkanFtOEY5NVhPN3JQT1VVSVVaMENPXzljZy1taFhlOWhjcjJwM0U5cmNxRFdkYzdCZXlZZzZ2ZVJkTFdyUmlIQjlYMFNGeHc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Alexander! Awesome recommendation for the back button on Android. On the list!",
            "date": "August 9, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Francisco Brenes",
        "comment": "This is the app to transform your physique! Lots of info, workouts, exercises, and you can add your own!",
        "date": "December 12, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRVVZV3JfOUhBbU1nd0czQ3QzWm52aHA2RXhwQXpmOTVfbWhkRjZ1SGRrNndySHd1OHJHWUo3a21MT3JJZ3hrQmpjT2pJMFdBOWlKUUhaYUE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Francisco! Thanks for the support. Woo hoo!",
            "date": "October 13, 2016"
        },
        "star": 5,
        "title": "Perfect!"
    },
    {
        "author": "Allen Lewis",
        "comment": "This is a great app! However, options are needed to reorder or edit custom custom exercises after they have been created.  I'd also like an option to duplicate exercises to cut down on time needed to upload.  My gym has machines, cardio and machine weights in different rooms.  I design my workout for one room at a time.",
        "date": "November 28, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR2o4TEVmbTZxVUxGVW1qZXhmR3lGYzhsRmR0SC1GbTBINFZYcG51MFpOTjNEdVlYWUNJMVpTQ2EtWW5mQnNYcGpMcFRXMWZpRDBaZG1ya2c",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hi Allen - you're right those features are on our list. In the mean time you should check out our dashboard for a faster and easier workout building experience: dashboard.atlaswearables.com",
            "date": "January 4, 2017"
        },
        "star": 4,
        "title": "Editing options needed"
    },
    {
        "author": "Reyner L",
        "comment": "Sweet!! The 3rd newest update brings back everything to normal. So far, it's working now. if other workout would not sync properly, I'll send you guys an email atlas support is always awesome! :)",
        "date": "October 12, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRWdsZkRQSTZJdzZkQ21uZVFDaVhyT25uMWVRUDhCOWVhU3lfWkVjQUw3OE5rVlNDdmtmeEJwdUJLcEVubzBUNnMwY0U2dUgtTEhFVzVnUEE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Reyner! Awesome. Stoked the Atlas is back for ya. Have an epic day!",
            "date": "October 13, 2016"
        },
        "star": 5,
        "title": "I really don't know what happened"
    },
    {
        "author": "Kyle Sitter",
        "comment": "For me the most recent update fixed my issue of the app not opening. I'm excited to get started and seeing how it all works together. I even got a message from care insuring it's fix. Nice touch.",
        "date": "October 8, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRzFlYTRZNDhiTk9VSThGYW9YZTJqSk53V2RkeE5DQmp2MjBTUG1Zb1hMcGhHX2pZQi1TdE9ZZEt2OVlRS1RnNGtJNFdJX2hRZmxVYkFvY3c",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Kyle! Great. Thanks for the mad props and the support!",
            "date": "October 13, 2016"
        },
        "star": 4,
        "title": "Great looking watch, cool brand logo."
    },
    {
        "author": "abhishek malik",
        "comment": "Never connects to my huawei smartwatch",
        "date": "October 7, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRTIxZTk3aGlFdGlDMEhfUE5vSWhRSGE3QUFSY3ZaSm9JWl9iTlRGYVFXS3BXd2g1R3JhZ2hacDg5WmxCcUFFbVhScTNVazBJdFFTcDRtQkE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Abhishek! We emailed you with suggestions on how to fix. Please keep us updated and let us know if those suggestions resolved your troubles.",
            "date": "October 10, 2016"
        },
        "star": 1,
        "title": "Bad"
    },
    {
        "author": "Gautham Ramegowda",
        "comment": "Here's my bit. Pros:1.a watch that can actually track exercises,  hard to believe but it works. 2. Like the look and feel. Cons(Watch) 1. It's not gorilla glass.  Scratches easily. 2. The button on the left isn't conveniently placed as it pinches sometimes since it is placed too low.  Should have a been a shade bigger. 3. Poor battery life. Lasts a day on power save mode but only 2 to 3 hours during workout. When I set it to charge, it shows 85% straight away. 4.Guided works outs are very accurate...",
        "date": "September 25, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR21SRXNQdVVpc2ZPMGxnM0NSRWxHUThlZTBSTzB1Vmdtam1WRC03R0ZTRldiZzM1d1FGSUdvVXZJbUZMdHFidkt2UWtVZ2Rrd2tJVWZJWVE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Gautham! Thank you for the breakdown review. We do recommend using some type of screen protector on the Atlas. The Atlas battery lasts 3 –5 one hour workouts. Heads up: We have a new dashboard. Click this link and log-in (on your computer) with your Atlas credentials: http://dashboard.atlaswearables.com/#/main/home",
            "date": "September 27, 2016"
        },
        "star": 3,
        "title": "Good watch but needs work.  Part 1.. Have more but word limit."
    },
    {
        "author": "Mihir Shah",
        "comment": "Love love the fact it has an app for my new Android Wear Polar M600 watch. I have only tried jumping jacks burpees etc and so far it has accurately recognized my activities on my watch and automatically counted my reps..whoa I'm already blown away. Very nicely designed app and so easy to use. It paired instantly with my watch! Looking forward to future updates and testing it while swimming. Would love to see google fit integration and ability to pair my scosche rhythm+ HR armband.",
        "date": "September 14, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRVh2Uy0tNG9JMmlmZktwVWxoeHRta1dXZnBzS0JKcnZtX2swdTFFUHRpQW03ZWxzQmV0MW5LZ0hfWEhybU9kUXFueEtCektzM3BaM0pwQ1E",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Mihir! Thanks for the mad props. We are working on app integrations. Will be available soon!",
            "date": "September 27, 2016"
        },
        "star": 5,
        "title": "Amazing app with guided workout"
    },
    {
        "author": "Francisco Guzmán",
        "comment": "I was considering to buy the watch, so I donwloaded the app to see how it worked... I wasn't expecting it to sync with my android wear and accurately recognice the excercise I was performing. Amazing app!",
        "date": "September 16, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPSFFpbmVtdno0b1JSbm5PQkpqWVcwNGFfYVc5VGlFUEZVZHBwMHp4UTRTSW11VHY1Rnl2TWtVaTIwb2tGd3pXeTlHRXdkY2pla3VQSWozR2c",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Francisco! Thanks for checking out the Atlas app. Stoked you dig it. Yes, we are working on integrations with other watches and apps. Heads up: We have a dashboard that is now in beta. Click this link and log-in (on your computer) with your Atlas credentials: http://dashboard.atlaswearables.com/#/main/home",
            "date": "September 27, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Teddy ir",
        "comment": "Teddy",
        "date": "September 12, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRjlkNmNPWEF1RlEyRk9QYzVQSkdPLV85el9hY1FZd2NVWVRpWjUxdVA4bWdTTDJ5YktEUTIzZE9ycDJ2NjY3WHpvZmw2Q043WXhzWUhkWGc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey, Teddy! Thanks for the awesome 5 stars. Note, we have a new dashboard that is now in beta. Click this link and log-in (on your computer) with your Atlas credentials: http://dashboard.atlaswearables.com/#/main/home",
            "date": "September 13, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Peter Tse",
        "comment": "A great tool for the experience gym go-er.  Will never beat a personal trainer.  Would like to have more selection on guide workouts.  Tracking will mess up from time to time.  Let's see what the second generation can do.  I want easy access for past workout so I use the info during a new session.",
        "date": "August 2, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR2tHb1lmcnd3SWRiNjhGMW55bEsxY0p5QmdIRS1xUXV3cmFmR1dTXzhJbzM4RmpOaGlHOF8wMTV6TnhmN2ZJeHJTc0hMOXJ2M1d5THl0Qnc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Peter! We are gearing up to beta test our new Web Based Workout Creator/Editor and are looking for more beta testers in a couple of weeks! Please sign up here if you are interested: http://goo.gl/forms/anLaiMwJHWmj0yAk2\nAtlas App Feedback Group: https://www.facebook.com/groups/427918080750558/",
            "date": "August 4, 2016"
        },
        "star": 4,
        "title": "4.5 🌟"
    },
    {
        "author": "Christos Iordanou",
        "comment": "Getting better - please add distance measurement in km. Thanks",
        "date": "August 5, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPSEFidTRKSmtMaGZfVkhHTjJyc1BpVjVuRUEwem1hU2tod2pJZVVwcUo5T3dGUkZBUUxRUHpvTlZQTzFNbHo0UFUxcVFhTlBFS0JmTmlDNWc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Christos! Thanks for the suggestion. Will look into incorporating km. We are gearing up to beta test our new Web Based Workout Creator/Editor and are looking for more beta testers. Please sign up here if you are interested: http://goo.gl/forms/anLaiMwJHWmj0yAk2\nAtlas App Feedback Group: https://www.facebook.com/groups/427918080750558/",
            "date": "August 10, 2016"
        },
        "star": 4,
        "title": "Nice"
    },
    {
        "author": "Dickon Worsley",
        "comment": "Keeps improving in awsome ways",
        "date": "July 13, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRVk2cGpiWU04OGo3N0pMRDdxRVdzRUxDTDUzbldVUjdianZIVFdfSjlRRUJHa3hscmEtQUVsWW5LZTNzVG5PemVOeHBoalgtemdENXlxaFE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Dickon! Awesome. Thanks for the mad props. We have a newer update. Make sure you delete the old Atlas app and reinstall the new one!\nVERSION STATUS:\niOS/Android App Version: 2.2.5 \nFirmware: 1.2.366",
            "date": "July 14, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Matthew James",
        "comment": "When I first purchased my Atlas I could tell there were a few kinks to be worked out, but I knew this type of tech was still in its birthing stage in the market and with no other successful devices of its kind on the market, Atlas is braving new territory. The app and the device have continued to make big leaps towards perfecting this technology with consistant updates. Very happy with the Atlas Team's direction and the progress made so far. Looking forward to great things from the team!",
        "date": "June 29, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR2lqX3hjX0k2YW1reWctQkJocHlFTnV1NHRiQUFCSWxHc09PbFpVS0ItYUtDclRfU1NYVUZKVXNVZ190VW9sWnRMZnZ2bElhaTJkSTlpRlE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Matthew! Thanks for the mad props. We have more in store. New app and firmware coming out this week. We are gearing up to beta test our new Web Based Workout Creator/Editor and are looking for more beta testers!\nPlease sign up here if you are interested: http://goo.gl/forms/7UMZEWXAMnRsri7o1",
            "date": "June 30, 2016"
        },
        "star": 4,
        "title": "Continually improving, happy so far!"
    },
    {
        "author": "Graham Cross",
        "comment": "Extremely disappointing. Device rarely syncs with the app and when it does sync (managed 2 syncs I think since purchased) I can only sync 15 workouts. Very rarely picks up the the movements on the workout even though I am trying to do them perfectly. Device has great promise but doesn't deliver. Look elsewhere for your fitness product.  UPDATE Latest app updates now crash the application.",
        "date": "July 4, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRklRbUN1WU5JSHpKNzZpcFdjeUpBYkNHNWlTUTN6YmU1clo0dnpENGRQbnVXSlhnSm0wYlJnUkViZGxhQ2lNc3QzR013ZENLZElZZzBUcXc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Graham! Please email info@atlaswearables.com so we may diagnose your issues. What is the make and model of your phone?  We have a newer update. Make sure you delete the old Atlas app and reinstall the new one!\nVERSION STATUS:\niOS/Android App Version: 2.2.4 \nWristband Version: 1.2.366",
            "date": "July 5, 2016"
        },
        "star": 1,
        "title": "Waste of money"
    },
    {
        "author": "Kelly Moore",
        "comment": "It's definitely a tracker that is still refining it's functions and is very promising.  I enjoy using it,  and look forward to the continued improvements.  One thing I would like to do is be able to edit the exercise names later for my Workout.  Example being barbell bench press is recognized, would be great that I can change to incline bench press as it does track the movement and associates with bench press. Possibly in the meantime so can record my Workouts better atm until further developments",
        "date": "July 3, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRTVMT0xKaUtiZWZwTG9JaXdETWFMc1ItSG4wZ0pONWZfTjg5SGo1QlVsMC0yNGhwQTllMExrTDNfSEUtRkRPM21uSUhJcHdMb3huYXF6Y2c",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Kelly! We are gearing up to beta test our new Web Based Workout Creator/Editor and are looking for more beta testers in a couple of weeks! Please sign up here if you are interested: http://goo.gl/forms/anLaiMwJHWmj0yAk2",
            "date": "July 3, 2016"
        },
        "star": 4,
        "title": "Looking forward to each update"
    },
    {
        "author": "Chris Render",
        "comment": "Getting better with each update. Looking forward to the swimming update so that this can be the only tracker I use.   From a hardware perspective is great and easy to use although not that comfortable if you have heavily tapered arms. I'm currently experimenting with a home made neoprene wrist strap.",
        "date": "July 2, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRjBzSFM3bFQydktzalhkWFplRUhMU0xEN2ZlMlFlRnR1QWVXdmJ0cjVmbVZTVTRjR3dXZkxUSll1dEFucmhUNE1PaS1hZ0hjMXZETDUzY2c",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Chis! Swimming is available on the Atlas. \nMake sure you delete the old Atlas app and reinstall the new one!\nVERSION STATUS:\niOS/Android App Version: 2.2.4 \nWristband Version: 1.2.366",
            "date": "July 3, 2016"
        },
        "star": 4,
        "title": "Constantly improving"
    },
    {
        "author": "Mark Halili",
        "comment": "Love the new features to create custom exercises and the ability to edit workouts anytime. I still think using the app is slow and a bit tedious. I would suggest & love to see a website you can go to where you can navigate, create, & edit workouts more efficiently. A website would also allow for better graphs to track progress. For example monthly graphs to view progress rather than currently using the app to individually toggle back each day just to track. Thanks for the improvements.",
        "date": "June 16, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR1N0VFcyWjh1LWNyMFNSMFplRHpWTzFZbk5fRmc4aGpVTzFGVVJscUlwTGlKaXlCbDNPWE5YY1kxUEV6dXNISHJaVFlRbXBMcVBER0RRdmc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Mark! Stoked you dig the updates. We have more in store. We are gearing up to beta test our new Web Based Workout Creator/Editor and are looking for more beta testers! Please sign up here if you are interested: http://goo.gl/forms/7UMZEWXAMnRsri7o1",
            "date": "July 8, 2016"
        },
        "star": 4,
        "title": "Love the Updates"
    },
    {
        "author": "Jason Edinger",
        "comment": "I feel like I wasted money buying into the hype of this device. With all the delays on it, it should have shipped with all basic weightlifting movements, but no, it's hardly anything and TRX.  No website to make workouts to sync to the app and device. How about some integration/partnerships with people like Jefit?",
        "date": "June 22, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR1hoNGJfR3pVd3N1LUhLbkV5V21fNnhVSUgzaFk1cnZkWWNTY0pEcFBxSjJVTWhuX1lOd0lubUZvVXpKQlFyc2x3Y3JKUlQ1SFNfXzMwaUE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Jason! Teach your Atlas exercises. In some instances it is helpful to provide examples with varying rep counts, i.e., rather than 3 learning sessions with 10 reps each try 3 learning sessions with 6, 8, and 10 reps. We are creating a user friendly UI to create sets on the app and a dashboard. App integrations soon. Please keep us updated!",
            "date": "June 23, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Casey Harwood",
        "comment": "The latest update added a lot of great functionality. The ability to teach new exercises to the Atlas is robust and well -implemented. Overall, extremely impressive tech, and far more engaging than any other fitness gizmos on the market. What I'd like to see next is an improved editor for custom workouts - a web interface or enhanced mobile interface - that allows exercises to be re-ordered without deleting them and adding them again. Also, integration with myfitnesspal or mapmyfitness would be great.",
        "date": "June 12, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPR3dnWEFZRW9UMGlVcGVJM2dRZ2dWWVNtSFNPUnJnc2VtLWFISktVdDJDVjNPRldvRGlzQm1hb0g3WGVSSFNWaGUxTnQtdV9qN0kwSkdXZGc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Casey! Thanks for the mad props and the epic support. We are creating a user friendly UI to create sets on the app, a user dashboard, and app integrations. We are getting there!",
            "date": "June 12, 2016"
        },
        "star": 4,
        "title": "Already impressive and still improving!"
    },
    {
        "author": "Frans Samuel",
        "comment": "Last updates was amazing!! Now i can teach my atlas to my own workout with my own moves..beat any fitness gadgets out there..love the new UI more friendly i think..i wish the battery last more longer, but peter promise me to do that.hope it will fixed soon..overall great job team atlas..very loved it!!",
        "date": "June 10, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPSFF4N1RDeWNhYlpFdU5kSE1ZU2k4TmQyOEtCU3VIZXlndTdmUnBzZlJHNUFVNXVDVnVCS3RLVHVHNzJDaVRiTmNsYWYxZ1Vjbi1DVkxHNmc",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Frans! Thanks for the mad props. Working on the battery life. What exercises have you taught your Atlas?",
            "date": "June 15, 2016"
        },
        "star": 5,
        "title": "Advance fitness to the next level"
    },
    {
        "author": "Seth Houghton",
        "comment": "After the updates, this product is better and more functional. Originally gave 1 star and thought it was basically an expansive heart rate monitor. Seemed to have so much promise, and it is finally getting there! If you want this, read the reviews so you know what you are getting. Will review again once more updates are done.",
        "date": "June 19, 2016",
        "permlink": "/store/apps/details?id=com.atlaswearables.ionic&reviewId=Z3A6QU9xcFRPRnU2bGFucWtJeEhGRVd6V1BnSE1qMHdkcl9zQXhKWjU1ZnIyUWpkMmFBMVNDMjFFUVNwbmtrZVF4Wk1Xam0yUWdrN3V6bUt2Q3dBWGg4eEE",
        "reply": {
            "author": "Atlas Wearables, Inc.",
            "content": "Hey Seth! Updates are complete.\nMake sure you delete the old Atlas app and reinstall the new one!\nVERSION STATUS:\niOS/Android App Version: 2.2.2 \nWristband Version: 1.2.366\nNow you are able to teach your Atlas and swim. Let us know whatcha think!",
            "date": "June 20, 2016"
        },
        "star": 3,
        "title": "Update-getting better"
    }
]