[
    {
        "author": "Sarah MacRunnel",
        "comment": "It works very well for all my scheduling needs, unlike other apps I've tried. The only complaint I have is that the weekly schedule widget doesn't update until late in the day so it'll say yesterday's date. Removed a star because now the widget doesn't work at all, it just says loading. Will give more stars when fixed",
        "date": "April 12, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRUoyU1VpaDBaUHh4dDZVdmhRSkFGTGliek5WX0laOUdlaVdkTW92dTZHN0dRMjVPbzNhWV9TWmJvUXlqMnFUUkt3STZ6UDZ4NzZBVXltSnc",
        "reply": null,
        "star": 3,
        "title": "Great app"
    },
    {
        "author": "Benoit Foucher",
        "comment": "One week used, like the simplicity. 2 small possible improvements: when I tried to edit a time, the app crashed today. And instead of having 3 choices when placing something new, maybe a default could be for normal activities, and a special button for tasks. This way could increase speed for putting new entry. Besides this, it s the 4th app I ve tested this week and I m going to stick to it because it s as simple, clean and practical as I d like it to be. Thanks!",
        "date": "November 18, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPR3NybU5RVGg4dldTMkZ0Qmw0Sm5zWDhQeVpMTmlSaTJsVktuOG4yX3loUXQwYXRDTzFuYVl6ay1lVmtOajROWkJjdmwySGNPWjY1SUsybmc",
        "reply": null,
        "star": 4,
        "title": "Pretty good"
    },
    {
        "author": "Christopher Schabacker",
        "comment": "Clean, simple, and one of the few calendar apps I have found able to integrate Google tasks. All plusses in my book. One minor issue is the inability to change the font size especially in the Month and Week Agenda views. Would be much easier on this old man's eyes. Also would like to see option to integrate use Google calendar colors. Add these and you will have 5 star app.",
        "date": "October 14, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRWZkZTVkTWI5bmo5RDREX19STzRvTnVyb2t0V0h5QlZqSkhiNHBEZ2VvelZVeXp0RkMwZ0hSUVFscmtYdnZxX0N1MjBHYWVCSExVZmhfQlE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "James Bellorini",
        "comment": "I've used a lot of calendar apps but never found one that ticked all boxes for me. This comes very close though. Clean, intuitive, gorgeous to view and use. Very happy with it. UPDATE So I've been using this calendar now for a while and at first it was exceptional. However over the past 2 weeks I get warning messages (I have a Samsung S6 Edge) that Wave is slowing my device down whilst accessing network. This warning is occurring 2 or 3 times a day. Maybe a bug update is needed?",
        "date": "September 28, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSC0zem5nZXItaGg1WW8xOVdEcHhiYTkwVjJiOWpmbFB5MVozNnh3Q3k0UFFJNGtzT3RxaXBwSG9iS1J6Q1NqWXRvenc3WWNpTlI3U2ZQZnc",
        "reply": {
            "author": "Calendar Apps by E-sites",
            "content": "Hi James, Thank you for your review and rating! Best regards, team WAVE",
            "date": "September 7, 2015"
        },
        "star": 3,
        "title": "One of the best"
    },
    {
        "author": "J.A. Morris",
        "comment": "I think this app is great. I happen to like the simplicity (and the color!). There was two issues that I encountered:  1st: Yahoo calendar is currently not supported (thank you for the fast reply to my e-mail!). I currently use it and would like that service. 2nd: The NFL (American Football) schedule add-on for three teams I picked did not work.  The feature to utilize this app with the wearable devices is great, which is a strong selling point for me!  I will uninstall for now and hope that at least one of these issues is fixed in the future. I will reinstall then.",
        "date": "September 25, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRWNiMUpGQjJHX0JJd3JoYm0ySTRUaGUwZmNub2gyRS1PMGhFVklRcjNwemxqNzhubC1EQXQ3eGVEMGtONm96a3NZNkNSNkRQZVdEaEZPdHc",
        "reply": {
            "author": "Calendar Apps by E-sites",
            "content": "Hi J.A., Thank you for your review and rating! We will work on your feedback :) Best regards, team WAVE",
            "date": "September 28, 2015"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Spider Byt3s",
        "comment": "This is the solution for all those trying to get Google tasks on your Android. @Devs Would love a way to choose to launch the app straight to the Tasks sections that way I can tick things off and close. Also I am sure you are aware the widgets need a lot of work. The scales are way off as of right now. Would love a widget that resembles the Tasks screen. Keep up the great work. This is the one app I am really interested in its development.",
        "date": "August 28, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSFJvWU5BN3E0MGI3a3BPYWZvd3NkTU1LdlU2aklacmR5OEZDaDRTYjlyXzJZTlVqMzU1U2xzM0hfOFQtWF9HckdaVE1jYTFPaTRqUVlCZXc",
        "reply": {
            "author": "Calendar Apps by E-sites",
            "content": "Hi Spider, Thank you for your review and rating! And thank you for your suggestion. We will add them to our to-do list :) We are working on our widgets! Best regards, team WAVE",
            "date": "September 1, 2015"
        },
        "star": 3,
        "title": "Will be absolutely amazing with tweaks!"
    },
    {
        "author": "Joey Lucier",
        "comment": "I love this app, because it's one of the only calendars that has BOTH events and tasks from Gmail. This is a huge feature for me and I love it. It worked seamlessly when I first got it, but then the widget stopped showing any events. It would say \"Loading...\" and never update, even if I deleted and re-added the app, or deleted and reinstalled Wave. I even did a factory reset on my phone recently (for other reasons) and THAT finally fixed it... and now my tasks don't show in the widget anymore. (Galaxy S5)",
        "date": "November 14, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSGN0aDBlVzBtNGdTZnN3UEVON1VXZTJQYjhGZkd2dUJEZ2Y4NWx1ZzRBV0FIQ2t0ZFE3YlpNVWQwN3RGR1RZRW00S3VObk9GQkFMa180d0E",
        "reply": null,
        "star": 3,
        "title": "Widgets don't work"
    },
    {
        "author": "Twiggy Chan",
        "comment": "Love the weather, coloured dots for events in the month view and the todos. But you can't delete/edit events that was automatically added from emails? Also would be great if you can add more colours (at least the special ones that google calendar already have)",
        "date": "March 2, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPR0dFX2NFVEkyYi1acFVTM3VLbE4zcW5GaXRVZnpEanp6NFZIVmtqU2ZUMUt4ekZmNFRaZXJvTDg4Q0pqQ0p3Y3NmNHVvM08ybGN1VnJvbmc",
        "reply": null,
        "star": 4,
        "title": "Like it, but needs change/fixing in some areas"
    },
    {
        "author": "Loralee Dickson",
        "comment": "I've been searching for my \"perfect\" calendar app and this one definitely has potential to be it! I love that tasks are integrated in the calendar (that is a must for me), but, the widgets stopped working after I synced my Google Task account. I've emailed the support group a couple of weeks ago, but haven't received a response.",
        "date": "June 10, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSENFUjJiNlBYRUtNYWJXZkFmMm1MNGd6VEw2WW5jQ0N2LUpFUGJVNXlSOVdTeVpvSjNYa0l1Y1RCVFVRSE9saE9QOWpnRlhrMzJRWTBlcmc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Brandon Henderson",
        "comment": "I really like it and it's easy to use.  My only complaint is I want to use tasks for homework and when ever I click a task either from a widget or the main calender it just opens the edit option  I would like to be able to select it and check it off  right then and there.  The other thing is tasks don't appear in the calender widget like they do in the list widget.   5 stars if this gets fixed",
        "date": "August 19, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRl96VmtkaDNyX3JCS3BKN3k5WDRhYUt6eUYtaEZqTEVYQmx4OWl6TEhmYVIteThkTXdSYmlEWHdlVTE4MTBBNDBfekczaDN1V0hRUGhZMGc",
        "reply": {
            "author": "Calendar Apps by E-sites",
            "content": "Hi Brandon, Thank you for your review and rating! We want to expand the task function soon and improve it. We appreciate your feedback :) Best regards, team WAVE",
            "date": "August 20, 2015"
        },
        "star": 4,
        "title": "Widget need some improving"
    },
    {
        "author": "Heather Allen",
        "comment": "I absolutely love this calendar above all others. I especially like the different widget options. However, last week they all stopped working. They just say \"loading\" instead of showing my upcoming events and tasks. The primary reason I chose this app over others was so I could use the widget to quickly see what events were coming up. Please fix!",
        "date": "February 1, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRUZlSXNkVG91RHNYLTVndXdDVzlkWXY0MGZNX2RsQTJLaFBKak0wWnBoVGhlYTUzcEdpb2NtSXJ3UC1hVXZiMXBTOUl3THJHWUZ4WktBN2c",
        "reply": null,
        "star": 4,
        "title": "Widget Stopped Working"
    },
    {
        "author": "Brijit Dighe",
        "comment": "This is a very good alternative to many well-known apps. I liked UI v much. V useful app indeed. Problems : Birthday notifications doesn't work.... although I have Birthdays on almost all days. Features needed : Notifications for 'To-Do' list or for Tasks. Uninstalled",
        "date": "October 13, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSG4wWndkeTFUUU53aFl5Z3RrMll6ODR2emVZYVhSam1vVHMtX2kxLVlUT09QNXZDeEpPRFU0Q0FlaUhuMnR2RURubEFlWWtmUWtzOXBDekE",
        "reply": null,
        "star": 4,
        "title": "Very Well made App"
    },
    {
        "author": "David Crone",
        "comment": "This calendar app is so much better than the stock Android and the Google calendar apps. Way more customization, better color choices, better layout choices, etc.  The one issue I have with it, keeping it from a 5 star rating, is the mapping interface. There are several times when it takes me to GPS coordinates 0,0 instead of sending the address as I've entered it directly to the mapping app. Other than that, fantastic experience.",
        "date": "November 25, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPR2MyenJuMlZoR0pwdGtUQkwyR0ZKa0FwN1kwSWswZ0wxSHlFRjBhTExmbTNRVFdxdV9ZVTVCdktTM3NHWGVybUpWYnc4LXdsQXJnYUt0bnc",
        "reply": null,
        "star": 4,
        "title": "Great customization options"
    },
    {
        "author": "Dmitry Katsubo",
        "comment": "Good app however: * No \"jump to today\" button. * Does not render HTML in event description correctly (created by latest Google Calendar version). * One can't copy part of location or notes without entering event editing mode.",
        "date": "December 17, 2017",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRjlfQTZzLTFKaVpSQkdWMHNLVm9KSTdWQ292MDRuenNIamIyLUtibkRhRVVIQjFFZGNFZHI3LUR0NGpWQ2o4MG9tUGZvTHMzNTVwQllDdnc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "GeoffWhere",
        "comment": "Installed last week, found it easily connects between Google and Outlook for Android Calendars. Not much opportunity to really shake it up yet but the App looks and behaves well.",
        "date": "August 29, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRnBNRkoyRDVCU2hMSnNpdjViRnE4WGd5SkhOcENaaUxNTDNmSEx6YXY0eGxVQlI2X2U2VEh4Y2JkZjMzalJhc2FEZlg4dmMybWZpYlFlUGc",
        "reply": null,
        "star": 4,
        "title": "Early days but very good so far"
    },
    {
        "author": "Harry S. Anchan",
        "comment": "After messing around for half a day trying this and that app, including SPlanner and G-Cal,  I arrived upon Calendar Nirvana! I will never look elsewhere again! Thanks, guys!",
        "date": "May 11, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRlF6ZWxRN0RPalRhSVZ0UFFEdkg5aFoyd21HQTVIa19ITk92bUh4ZGg0VzZfQzhOYk9yWGhTMjFsTW1GMnE3d0p2c0xfQTNOWHdQbG5jb1E",
        "reply": null,
        "star": 5,
        "title": "Definitively THE best calendar app ever!"
    },
    {
        "author": "Rene Carballo",
        "comment": "The app works great and has the functionality I need, but Ui-wise, it feels kind of strange due to a half implemented material design (has MD icons, but not colors, some menus are still holo, etc.). Some menus and stuff, like where you choose which display you want (month, week, agenda, etc.) are also kind of clunky and could use some reorganization. Besides that, I like all the features it offers, but would love Samsung hover view implementation.",
        "date": "September 5, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRUEzWHJtWlU5ZkNfLW5zdmxONjA0VVpiSUNSc1VRajVVMFlQbEM0RWxvMkNydUJOZ0h5ZHZvRlZLOGsweFd1eHRtN3Frb3NYZlRqaDd0ZkE",
        "reply": {
            "author": "Calendar Apps by E-sites",
            "content": "Hi Rene, Thank you for your feedback! We will add it to our to-do list and see what we can do about this :) Best regards, team WAVE",
            "date": "September 7, 2015"
        },
        "star": 3,
        "title": "Nice app, but could use more material design elements and ui improvements"
    },
    {
        "author": "troy olson",
        "comment": "widget: need task scroll,  show event task text on month view,  fix weather to show  Fahrenheit.  old review : A calendar+ much better but not as pretty.  show appointment on month view versus dot,  better task capability and add notes function then would be perfect all in one buisness and personal organization app",
        "date": "October 6, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSFJTUEkzVE01OGJrbXRlR1M3SEcxYzJZdS1vcVlKZkVaZjZmV05OV1Vlc2E1ZnlDZk5kVUJyTmVPMFY4LVREZWdvdVUxTGVlTkNveFpmLXc",
        "reply": {
            "author": "Calendar Apps by E-sites",
            "content": "Hi Troy, Thank you for your review and rating! Best regards, team WAVE",
            "date": "March 13, 2015"
        },
        "star": 3,
        "title": "old review still stands... removed 1 star for widget"
    },
    {
        "author": "Paul Hahn",
        "comment": "On the widget, the date changes late- it shows as the previous date and sometime during the day it changes to the correct date.  UPDATE: It is now nearly a month since my review and sending a feedback email. No response. Insufficient and slow support.",
        "date": "September 15, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPR1RlODNQWE4zUGZIeW9tRDNGZFMwS19RYWx4WGQ5Z0hyNEJMQm9XRzNHeWRjQW1OcUUxUGFmYkhBenFXRUQtWVkwMFA3QVkyUGJKb1N6cWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "richard provost",
        "comment": "I really like the set up and what it can do.. the only thing i am having problems solving is that when i add to my tasks and calendar on my android cell phone using the Wave app the tasks do not sync to my google calendar.  It will do it from google calander to my wave but not the other way around.  if i can get it to sync from my wave phone app to my google calendar it would be fantastic.. until then it is not complete for me.",
        "date": "March 5, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRU8walEtTmpGcmR0LW0wSkZ0QUZjaHU1NjEzakIzekJkRjU0elV0S2o2TjZmdlFEOElLVTVCWXNyR2I0NWRMZjFVZlBxUjJXalNRSVNwa2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Alan V",
        "comment": "Quite nice app but it has 2 dealbreakers, trouble me daily: 1) no tentative or out of office status for events. (somehow it even marked some of my events show as free). 2) when event is directly opened from widget, then backarrow button exits app, while I need it to open all events calendar view.",
        "date": "November 1, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRjRBQlFmeHNvSXpwLVNxMzg0ZGt1WFUxWDdwMzZpdXlOaEJTSVNwS1d1ZUZKN1F0d01oSG9UQ25OazlmQmlfVGlKVmJqcExEY0NFVHdtTFE",
        "reply": null,
        "star": 2,
        "title": "Not usable for me"
    },
    {
        "author": "Christopher Harwood",
        "comment": "Was particularly interested in the promise of travel times, but this is just an additional calendar detail to enter. Given that my calendar app had my calendar, and thus my expected and possibly also current location, I expected the app to figure the travel time thing out on its own.",
        "date": "August 18, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRjMzdUx0c2dHdF9mUkItVU5nTk1kNjJONDJDcU5OdUNIbjlqODcwZXNKZ19GbHh4RC1XbHRJcFdfcjRaNEE1d1dMd0lUWkJ3UWl3cXU2ZUE",
        "reply": {
            "author": "Calendar Apps by E-sites",
            "content": "Hi Christopher, I am sorry you were dissapointed in our app. We do want to expand this feature in the near future. Hopefully we can welcome you back then :) Best regards, team WAVE",
            "date": "August 19, 2015"
        },
        "star": 3,
        "title": "Not what I had in mind"
    },
    {
        "author": "Emilio Garcia",
        "comment": "Probably the best looking calendar app out there, but there are just a few too many minor problems. The widget would not change dates, and the tasks widget doesn't allow you to cross off items without going into the program. Having to go through the menus to get to tasks was too much of a hassle. Otherwise it's a great calendar, especially for free.",
        "date": "October 18, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRXA1N3VJbEJib2NLTWJuQUJneGdwMWZUWEZqa2wxeEFKZmg5anc2a3d5SEtqMVNOSlN0ekx1bG5lZ2IxWHdhTzJhWG1tVlduLUlIbXdkU3c",
        "reply": null,
        "star": 4,
        "title": "So close to being perfect"
    },
    {
        "author": "Paris La Bouch",
        "comment": "It would be perfect with some tweaks. My one complaint is that when changing the colour of events, they change back to the default after a minute or so. What's the point of having the option to change the colour if it just reverts back to default?",
        "date": "May 17, 2017",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRmhUM0FsSkZHdGhBQ1BjcC1pc21nMC1tWUxEWHJZczQ5Ri1kZ3pYQkhKbG1XaHc3TG5SbTk0eE9oZGxwVnRfWVh5Zy1na3B5b3VXR25BQmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jill Conchelos",
        "comment": "This app is exactly what I have been looking for, and the agenda style widget too but after two days, the widget just changed to say \"loading...\" And now it won't work... Any advice?",
        "date": "November 15, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSFZ3XzZ0Z0Z6eTRuZEdRS3FRQ3c5ai1mQlZWOFkzZlpsekVMWFREV0V0b19qYW4wTzNRc2s4bWVna2s4SjViMmdOSmdpdGxXU3pzbTZqUVE",
        "reply": null,
        "star": 3,
        "title": "Love this, but have an issue"
    },
    {
        "author": "Oscar Ponce de Leon S",
        "comment": "It doesn't recognize some tasks from gmail. It was doing ok. But after I started to put say more than 10 tasks it fails to update the information..",
        "date": "October 13, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPR0gyN2tjTE4xMEVzaTd3dVdjZlJnaWQtUTVjYWc2dXUxNzB2eG1aMmU0bG1KSHJVcEhOd1IxZnNhT0pXdmRhTWZjbG9VYW13LTF1dFo0aVE",
        "reply": null,
        "star": 3,
        "title": "It's is good but has some failures."
    },
    {
        "author": "David Slone",
        "comment": "It does absolutely what I need from a calendar app. including handling of travel time and multiple alerts by appointment.    The only down tick is not due to WAVE, and is a result of the creation and use of the Material Theme/Design -- lack of screen space efficiency & too much white space.   Would love to see two additions: a. a dark theme, and b. a compressed theme - to eliminate all the white white space,changing from triple spacing to 1 or 1.5 spacing.",
        "date": "November 23, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRkg0Vm8zcUlwU2tUTWRmLXVIMWVBdEN1OE1mcElDWWhaU0M5YkkyQmMydUV3WENvVEZSYTRmdTllRjNTRm5BRXhmZDUzN3ZJa2xoQnlwaUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Michele Grisoni",
        "comment": "Two notes: 1) event edit mode: with long phrases it's very difficult to edit them as the phrase is displayed in only one row 2) Even if there are no invitees,  the attending row (options) is always displayed (not necessary)",
        "date": "November 13, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSHRjd2JJSzZWcGhpZUg1Znp6dENHcXBRZmU4Z0F6WTc0TGxBbE1FR0ZsczNIUHpQdHRLZkNNbGc3Rko3NEdGYno3MmI5VjY5ZHdrbDV0S2c",
        "reply": null,
        "star": 4,
        "title": "Nice App but still young"
    },
    {
        "author": "Trent Hewton",
        "comment": "Functionality is good, severely let down by a terrible (and not changeable) pastel colour pallet. I would have kept it if I could change it to something better.  There should at least be an option to use the standard calendar colours from the google calendar and not horrible pastel versions of them.",
        "date": "September 6, 2017",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRk5LbjZrSlJRaUtlUXQ1VzlmTC1VTzRXZTY2dmZSMERpejBqZ1dzYTRiUUNWNkliTmhSRVl4Y3VxaU56NHMzQXRkeS0yVDNtSFh5U0ZJS1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Rachel O'Brien",
        "comment": "Widget has gone wrong again and simply says loading. It also sometimes loses appointments which is very annoying. A good app when it works, but too inconsistent at present...",
        "date": "January 23, 2017",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRUN0NEZpejlYd2NrRDUwNV9YT2stOFozZ25zaEVvclBfdDRVM0E4VXg4OWctV1UwNWxrbUwwUGRaaFhTR3I1NGcyaWV4RzlWV01kUWZfZnc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Kitty Slavefairy",
        "comment": "This seems like a great app, but you HAVE to sync another calendar with it. I cant find a way to make it function as a calendar on its own. Just not what I personally needed.",
        "date": "July 22, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSFpSSjB1SS1zZ2pWQ2QyN3k3ampwOUUxbUNfcXBwWnBmZmk4YVZwdlh2MTIzdl9mNjZQQUxTOUw1OWZ4dG85cUY5aUZ3M3pHc01jRnZaLVE",
        "reply": null,
        "star": 3,
        "title": "Not what I need, but might be great for you."
    },
    {
        "author": "Diego Garcia",
        "comment": "I really wanted an app that shows tasks in the calendar, and until Google does it with their own app, this works great. My complaint so far is that when looking at the tasks, there is no way sort them in any way (due date, created, etc.)",
        "date": "December 4, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRWQtVWthMlJ0SU1McHBVb1RkWS1KVjA0T19HaEJrZl9mWExhUWdxamx2YnlLTWJ2cDNFd1dMWVJsODlBSlAyNFVxSkdXNkV4cnhEN1pZNWc",
        "reply": null,
        "star": 4,
        "title": "My new go-to until Google gets it right"
    },
    {
        "author": "Jakub Navrátil",
        "comment": "It's a good app, but there are some minor problems. For example two and more events on my lockscreen keep collapsing into one, making it hard to read. That's not a problem of my lockscreen since it worked with sunrise and Google calendar well.",
        "date": "May 31, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRzRVa0ZsQjVqMG5XdmxxMGdKWlRCZFhsanVNYjdtckdqYTJoWF8tZ1MwcFZ5UWZUemtxc0k4ZXhTYzBwV2xEdU9ZRktMakRqWGVZdWw3Snc",
        "reply": null,
        "star": 3,
        "title": "Good, with few issues"
    },
    {
        "author": "Paul Murton",
        "comment": "Got fed up with Google calendar erasing new events I add. I researched a lot of calendars and Wave looks good. Only used it for a few days but it seems to have almost everything I need",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPR2pMS3NMcVgxUmp4VUxvWjU5d2VvRy14MHhmeFExbUJFZ1VOYzhNNHVQOE5ITWJZalp6eVV6THFieFNvLTE1Y0d1ZGNfaVBDSUF6cktBV2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "michael goff",
        "comment": "I will do, if a solution is found.. I have a Huawei and on a tsf shell launcher.. Keeps crashing when in edit mode",
        "date": "November 25, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRjhsQjNScDJfOEZfMHV2QVFrSEJEMHZDdFRBeUxIak0tNVJVeEg3RUNOdGVYb3NHSFl1aU9ad1pFUXp5c0FJOHJqemJRUmtwN1gwOFR0OXc",
        "reply": null,
        "star": 2,
        "title": "Would still like to improve the stars"
    },
    {
        "author": "Wellington Amaral",
        "comment": "Wave calendar conflicts with other phone calendars - cannot select calendars independently from other calendar apps. It would be nice to select specific calendars for notifications.",
        "date": "August 31, 2015",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPR2pVamw1YlcteklGTVVXc09keFlYWTlVOXZsdER5ZHlNQlBsajNXRmhudEZ5b1NFTEZxQ2ZJdFQ4ZzlFeVVRN3oyeVotU20wZjJxR3owWkE",
        "reply": {
            "author": "Calendar Apps by E-sites",
            "content": "Hi Wellington, This shouldn't be a problem. Could you send us an email? We will help you out! (support@wavecalendarapp.com) Best regards, team WAVE",
            "date": "September 1, 2015"
        },
        "star": 3,
        "title": "Conflicts with other calendars"
    },
    {
        "author": "Isaac Dodrill",
        "comment": "The app works great, except for background syncing with a Google Calendar. I add events from multiple different devices, but I've had events that aren't visible for days on this app, but are on my calendar. As far as I can tell it just doesn't update often enough, but it more or less makes the app unusable for me. Did reach out to support but never got a response.",
        "date": "September 25, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPR2NGVEVWcEh6V1N4dkdBUU1UUFA0WjNBWDFINHptY0szSTdQd1ZSVVNfWVdkZ3NsUFl5Mzh6QThRd0FidGRRNUNBWFppYkJyZ2k5VHgzUkE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jacques Thesing",
        "comment": "I would like to give 5 stars but....... I have sent two mails to your contact address and one to your Twitter account. WHY DON't YOU ANSWER YOUR CUSTOMER BASE!!!!!! EXTREMELY IRRITATING",
        "date": "August 26, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRTR3QUpybUQ5R0RCN1pncmhCOEFNMWxlV3ZvSllWczd1RF9hLVdFWVFuOVY5UkVVVmYzNUEwX0lMUFBDMGFHOXdhQUNrb0d4YkFfa0xlMGc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Fred LEE",
        "comment": "Wave has a great interface for androids. Unfortunately their support is non-existent--and I mean non-existent. Currently their app is incompatible with the iPad and their calendar is inaccessible via the Web, so useless on a desktop Mac.",
        "date": "June 5, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPSGtHYmdzREJ3bVl6TzR0Qko0d1FXZ1pERVM4X2o5aWlUM1FwN243ZW92b0thYlBzRDNRQXZ5djllWVpXbWR2MF9rOHZwdHdlZ0ZMYmFFM0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Barry Nauta",
        "comment": "I wanted to give this a four star, since the widget could be improved. It would be great it the widget has the same look-and-feel as the actual app, with multiple colored circles to indicate the number of items, currently it only shows a grey circle.  So.... four stars was my initial idea until I discovered the smart watch option which is really great!   Five stars for the great potential!",
        "date": "July 2, 2016",
        "permlink": "/store/apps/details?id=com.esites.ecal&reviewId=Z3A6QU9xcFRPRjA2Vm8tWmZXcTdMM0NmbU9NZkVVQzV5MWd2ZUxMT2ZFeVVFbWhFcnBEaGVPdzF0SG81TU9HNDdMWVhadkMtdkV0cDQ3Y0gzZWl0VUk5cWc",
        "reply": null,
        "star": 5,
        "title": null
    }
]