[
    {
        "author": "Darien Chaffart",
        "comment": "Great app, simple to use and very intuitive! Helps me keep all my tasks in line & make sure I have done everything I need to do for work. Only issue is occasionally the app does not sync properly with the website & chrome plugin, which can cause some tasks (usually those inputted directly into the app) to be overlooked without intentionally looking at the app. Other than that, it would get the full 5⭐",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRjYwb1dVTnJIQWE5ajN4SW11WXlyX0piNHlzMGpMWWg3bHZOSXdyVi1QV2pSaGdVVWE3M2lGb2ZnUUJZV1IxaUNsNjZtVmJOXzdIRUJ6alE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "MegaIronica",
        "comment": "I am new to this kid of app. So far I love it! Especially the abreviations you can just type in to decise the time and the category. They are so intuitive you can almost just guess them! Only thing missing is a full adapted app to the samsung gear watch. It shows the tasks through notifications but only wjen they are due and you dont have a lot of options on it.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSHFvZk9lVnFmV3VGNW55WTNESEF1NDhpR25BODF5RUQwcm1hb0liSUxBczBOWjdobFpkbzRncF82YmZsTEsydUc1UGVXaGVZSHk2UXVkdnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rainbow Harrison",
        "comment": "Was great until updating my phone to Oreo. The widget no longer works which makes the app near useless for me. I paid for premium too so really good this gets fixed. It's not really acceptable for a paid service though.  Edit: The widget still doesn't work on Oreo on Go Launcher. Does anyone care about this? I'm paying for something I can't use anymore.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRVhiMEw2a0FiSXEzamhKQmJXQTltaUpkQXM1UU85ZUhSdW4yWFk1MUUtTjY5RjZxUXRaaXhma0NwSGhKVnZBaG9wM1VKTVdqQ1VOY2dmWnc",
        "reply": {
            "author": "Doist",
            "content": "Sorry to hear that, we're going to address this issue soon.",
            "date": "December 1, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Jeannette Fastiggi",
        "comment": "This tool is fantastic ! I cannot believe that I didn't discover it earlier, had tried so many others, always quickly abandoned. Todoist is extremely simple to use, very user friendly, but nevertheless it has a wide range of possibilities and really helps you get things done. I love how easy it is to create repetitive tasks. It is multi-platforms, synchronisation between devices is automatic and instantaneous. The support section is very helpful and there's a lot of instruction videos on YouTube. I suscribed for the paid version, it's worth the price for me, but you can get very well along with the free version.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSHo0a01GVGpVT1lWcVRyYV9lVVNORmF2Z3Zha2FPZHZLaVpxWF9zd1I3eS1wZFdOdzVXREliVFpFenZKd2hzRkdhaXBQNk1wd19PdmtseGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Radek Lát",
        "comment": "I'm using todoist for many years and the premium is well worth the money. I can see constant improvements over time and while the team seems unresponsive in some cases, I think they do a very good job at keeping the product simple and help to get productivity high. The best things for me are the possibility to nest tasks (decomposition helps me beat procrastination), flexible reminders and karma.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRnJDYlVfYTI3enp6bDRzZEJXalVFemFKWHJ5R3pvX0tfdVZOZmNXS0dRU01IWVpKSmZqbndyN1ZYdG8zbVlrYkxKeVgxdGRjVGI3cWNUZnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "James Bateman",
        "comment": "Would love a simple way to set a simple reminder. e.g. Remind me to put the bins out at 8pm, and have various beeps etc try to get my attention at this specific time. Perhaps this disagrees with the App's philosophy, but I would certainly love this feature.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSFZqcktqSC1IajlYdkxmbm5lblI3LXdqWnhvYXBYWnJ1R1pxenBwbkRpbk5hSFJ4am84MFZ5azd1alA3TllCUVBvVVp5MmxNTXdhZGNRdWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Keyur Koradia",
        "comment": "Well, I am very frustrated with one and only one thing... slow customer support. I have this issue with reminders where I can't add reminders anymore. Even though I have only few reminders, it keeps giving me an error that I can't have more than 700 reminders. I definitely don't have 700 reminders, it's not even close. My total number of tasks are little more than 100 only. It's been couple weeks since I have contacted them with this issue and they don't have a solution for me yet. I get an email from them every 3-5 days asking for some information and then I here back from them after few days. It's too bad as I like everything else about this app. If they can't fix it for me in time, I will try another app for my needs.  Update: Still no fix after weeks of wait. I am moving on to different todo app \"ticktick\" now.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRVhyWnZDRU5vRmxFSndmWGQ4VTdkeVZrb3NaVmdCOEczNFZkWnpKUzFHbGZsNVJBQnQtTk9fYlhndHRYSC1pREJ1U2dvdXhyQVhZS3VXT0E",
        "reply": {
            "author": "Doist",
            "content": "Sorry to hear that, we're having a huge backlog of tickets in support, but are hiring new people to handle this traffic. Usually you wouldn't have to wait more than an hour to get a reply. We're looking into the issues you've reported.",
            "date": "January 26, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Hilme Athar",
        "comment": "Love this app. Its helped me a lot in noting down things I need to do or remember and doing so not have to juggle as many tasks in my head. Its great a really great productivity tool. However there are features that could be added that I think users would find really useful like a way to put subtasks under one larger to do task. And a better folder system to organize things needed to be remembered for today as vs in a week, month, or year.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSFA5QkhoclhqUWhhOG5CN2RpaDBNb2lnTmlMMVFSMng1TjdsdE5NUkU3VS1ZSlpHTWNSR05UYjFqV1c1d2RvTTNkQ3NXTXlLSXBucldRb0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kevin Tycz",
        "comment": "paid version seems great, but I'm not willing to pay that much to find out.   I would like some of the functions (text reminders, calendar integration) without paying so much.   Otherwise good interface.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRW1nVUh6alpMTTd1cjFMakw3S2JveTM0eXRSOEtiaXFPRmdLWVVsWDJZNnVEZEFaQThVbE9iNWpIYl9QYmE5c1NBMlQzeDliTHJsb0ZNaGc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sailesh Partheeban",
        "comment": "Very simple to use due to it understanding natural language and shortcuts are easy to get acquainted with. Android widget allows me to quickly screen out irrelevant projects during work hours. Still itching to try out the location specific reminders but it's great knowing I have the feature. Love that I can add and work on tasks from phone or on my Mac. Something that could take this to the next level as a productivity tool is the ability to add a \"Done list\" feature that tallies the completion of repeating tasks so that you can chart and work on habits or see how your cumulative training in one aspect is going across a calendar or by minutes/hours spent.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPR0pqLWxnSl9JRWc2WjFSeGpodmdaWGJGblhvbDZURnktLVJjNUt6ZjJpd044MncwN1VybHQ2RWFCXzk3NU9Eekk4UDVfMDZiWXZzek90SXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Prometheus720",
        "comment": "Very good for larger goals or things done on an intermittent basis. For things you want to do daily, use a habit tracker. There is a huge difference and you will ruin your experience with this app if you ask it to do things it isn't meant for.  If it could integrate with my calendar, that would be the holy grail.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPR2JWLVJRZGoxRk5YWHMtRXdMWUU5dHJqdkh3WFFkWTZaSkhUNGR2WjM2X0E2WjZCZkN1MUtNNnNxaHhvTWp0MkN0UzVNUm5JWFh6WmIzdGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "This is a great app for organising your life and is a daily reminder of things to be done. It challenges you to check things off the list so they aren't continually rolling over into the next day",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRmxTanNSTXkzUlM1a09XalotZVRLWlp3WDgyYzFQU1FjYlFveWV3bG95SEFhVktxRkttYTFkREVYYU5uMG5nWllFM3BrRkU4QUpMOVRpcVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marek Kadlčík",
        "comment": "The best todo app I've used by far. It has a few shortcomings but nothing serious. I would love if you added dark theme for night use - similar to what Twitter and Medium do.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRk9mdGpNZjhud0Rkb2JhUjNFTWtDN29JcVhTZFJNeHFjZUl2U0RoczhFVHJ1bUd2MUhSU1BKQmZPZlRtYmJnYUx4eC1RM1pEQ3l2YnU4U2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Daniel II",
        "comment": "I've been needing some organization in my life and they provide it! It's so great that I can literally be anywhere in the world and use this software. My work is not too keen on letting unauthorized software come on to the computer so it's great to have a webapp when I don't feel like using this small phone screen.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRWN3V2ZKZnYzTl9kZ0wxTkFZMzQ5R0t2anlVUGFIaGkyUUh3empTNjVLdDdwdEFOcEszY2RMeGFYYkdwNUFSNEcwUTlMTGR6b0c3cl9ULUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Steve Moore",
        "comment": "I used to switch between different to-do apps but I've now been using Todoist for several years without thinking about changing. The app is updated regularly with small but worthwhile improvements and it just suits me very well. I would like to see better management of project deadlines added and a few other small changes but Todoist will be my to-do app for the foreseeable time.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSDdhSUlDVm02OEZxbXVfUU5jMFptNTVIWEFtLU5XWjdlLUpQSTRnSkZmX1pFSER4VjJkV1p6RE1vSWMzV01oNXktekdmS1J4NzN1ZEF2T1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Zaky Hussein",
        "comment": "This has to be one of the most intuitive and flexible task applications I have ever used. The number of features implemented by this application is insane. It had features I didn't even know I wanted.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSHZLSlBoRUhTM2xWZWhQWHQ4eDFjUGFNYjRfNGQ2dk4yT0ZRSHRQM2Q5ZUk2bS0zcktzQ3M0U3I4NDRyNEZEMWpxbTM2cWRueWhfbms1SEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Karl Morrison",
        "comment": "Pathetically bad natural language understanding. People stating it has good at this obviously do not know what that means. I talk naturally, it is supposed to understand. This service takes commands, not natural language and has nothing to do with natural languages at all.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSE0zUWtyM0xPZ1gtU0NQZXVkSUIyenQ4VGJGTXR1NXp6OFNIRE5ab3ZBX1MtM0VZUFhvdWpMNkZUVm5nYmNUTDlZaXVsMlVPdmtMMjctLVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Garrett Birchfield",
        "comment": "Wonderful. I'm a fan of consolidating many different tasks and uses into one package, and this app does a wonderful job at this. You can run your life off this app, and that's saying something.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSFU5a2l4b2dBWGhJTE5LRF84d3l0aWJIVHZadXQ2UG5TZWJEN0xSNUx5VU53VDJocHZ2eUFPcHRHMTdpd0J4NHZoNDBPeV93bXdFMkotY2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Stacy Anderson",
        "comment": "Great app! Really allows me to lay out tasks and projects in a way that works for me, and I love that I can have it up on my computer while at work, then walk away and use it on my phone. I just wish there were more color-coding options for projects!",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRkNsTi1GZHItdmRBRXJkV2tfWE1LNVpaQ2VXaVJSaG9FbkEydnBjalR1T3dCVkdYRm5xT0VEWV9sdU9iUzNENGFHbEw3U1gxcmdDZGo3cFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Timothy Frink",
        "comment": "Like nearly every other Task List app these days, its idea of \"Themes\" is changing the color of a bar across the top of the screen; the theme doesn't alter the black on white text style of the application.  Nothing beats white on black for easy on the eyes and since I'm literally in my task list ALL DAY LONG, the absence of that display feature is a deal breaker. I currently use a very simplistic app with a \"night mode\" that coverts the display from black on white to white on black. That free app also integrates with Google Tasks for seamless portability across all of my devices. How is it that this vendor decides that integration is a PREMIUM feature? I certainly not PAYING just to discover that I don't like how it integrates with Google!  Uninstalling the app after I submit this review.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSFZJUlBOeGE5TlV4bUhfVUF4MUxIZVgyZzJkVGhWSTdNVXo0VVVUSVZSSmFwd0U2ZzdRMzNEQlhydkRwN2tIa1BTWEZxOUxsS3pKdXVXUXc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Miguel Jaime",
        "comment": "Just a few days & start with basic application, great user-friendly tools & options. Likely over the next couple of weeks I'll probably sign for the Premium option. Need to go over help / tutorial menu to fully maximize all features. Keep up the great work.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSFNvUjdfX05naGNnMnpmVEpNT1JXbEJsWjlfSmdLdWJpU21ETk02QVZPY0tldnJZcGN3X0tkUDhLRV9aYXJiQ1ZkWVFQWTUzOW10d1ExT3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Colton Kilmer",
        "comment": "This is a great app. It allows me to organize myself in a way in line with the GTD method, which I like. I give it 4 stars just because of reminders being behind the pay wall. I get they have to make money, but I can't afford the monthly rate they want for me to be reminded of my tasks. I really do like the app and am trying to completely run my life out of it now!",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRkZnM3pTcmJQM1pONmVHQkFRUjZraGxnMjY4SmlRWlI3aEpzNzdya24taHdyUkhMQ0Y0a0JnOGVSSEJxYmM2YklpSGg1QW8tc2tFS2d5bXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Joerg Steegmueller",
        "comment": "Probably one of the best To Do list apps left. Other good ones have been bought and closed down. Hopefully Todoist will survive.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRVRBRG8tdWQ5dE50ZWE2SXhZdmNxWmRCeDJIR05yeHBFMFJDMjRTMkJndDc4NGNZektXTEVqM2dHVnFsS0pQOHROWjM5LXowcnlGeWN2MEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Consentida Garcia",
        "comment": "I downloaded the app; put in my first task for 11:00 am. I was feeding the baby and asked my husband what time it was and he said \"11:06\" so I checked my phone and there were no reninders for the task from 11:00 am. It is now 11:58 am and still no reminders have come up so I am deleting the app and will look for one that works.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPR1U5dURMSC0xMGdGY01JQzdBOEZvZHAzbzhJMjFMN3NabTJqTUc2eHE5QkpvdDRYQ2tOZEcwNkZNaU5YTDhHX1YtOTJuZ3psZFVzcXJURmc",
        "reply": {
            "author": "Doist",
            "content": "Sorry to hear that. Please contact support@todoist.com with more details about this issue such as - are these reminders actually saved correctly, but don't arrive or are they not even being saved after you add them? Did reinstalling the app help?",
            "date": "February 16, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Виталий Федоров",
        "comment": "Very good and very useful app, but some times laggy. For example in android write \"tod\" and its not work like today",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPR25IS2tLbUZCMU5ZanlucTFzVGo2MVRoaGlIcWhmVnZQUmhKSVBwQWEzU01ETnVUYWFkR1dfMm5vRDM0RFd1dlF3MnVvNHQ2NkhjbG94bFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Michał Hawryszko",
        "comment": "Overall the app is very helpful and well designed. I would find it very comfortable to have dark theme which includes dark window background with a bright accent color 😉",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPR1ptUGxKVkRsMVJHSzNHX1hzZkhjVHJSMUpxY1BDTXo0ci1xcVZ5WHdYYlM3QUVQdnpsb2dPdnAwZlNya0RBM01KZ1kwVkpIVDc0N2ZqV2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "caleb sparks",
        "comment": "Helps get your life in order, everything is not behind a paywall which is useful for students but the option is there if you want more in-depth options",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRS1aUTVENXVaclhVUGN3ZFBYcEJpTlVpeHYwSzBnTGFjV0dYU1BMdGN6cVZPc1N5eTNNTnZOTkM1RkZvXzFvWjMyeWFZNUdZeWVSeUZYa2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Maycon Santos",
        "comment": "This is a really good app. It has just few problems concerning paid opitions, but despite that I can use it freely.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRlJXMjV6ZEtORXhkVzNDajl0b2JNLUNoclhwSFg3WW5MMWxIV2JQVUVYZGtZVXA1VUd2Q19uMU94b0tIWUloSXZ1Mm1laFlCNmpPeUNIMnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "durgesh yadav",
        "comment": "After trying many to do list apps, I settled on todoist. Because it actually fulfills all your needs. Most likeable feature is easy access from any platform and smart scheduling of tasks. Simply, loving it.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRVBjOHdYRnlrcFRzZUw1UF91TnJZaDNZTHhVa09lS0NCQTdveEdnNXdLMWJwZ3NxOTJOU01PTmIwSXRaa1VobjkyY2FRM25mZ1VQamdBQ0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Manish Tak",
        "comment": "It's a good App. Only missing thing is reminders in free version. Premium price is very high as I don't think other than reminders I need any other premium feature. Overall very useful app",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRlhIUTZsMmF4M0hCX1VETjM2dm9YM0VjVjhSaW5WZnM0Y2ZnRWl6R2tuS3MzVXktV0ZfdmEzNFdxbFk4S29idWU1cWwtYUdoLU1RQW0yb0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Doug S",
        "comment": "This app keeps me moving towards my goals by breaking them down into tasks which I can schedule and commit to, Thanks todoist!",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSE1FS1NCX09sUkZ2eGk4WmhTSlY3UFhtdWtYSzhVblY2MWdaQm5OUnB2Z1lhVk5CRWRDOXVyS3J0c2JCVXNILW8wZnVzM0I4d29BREJfaXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I don't need complex app..but compared to a previous one, at least this can do different project lists which is fab.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSGFTSnBNYUk0ano3QkZHQUFWOW5JaDd2ZG1vandhdVc0eVgza0JhczJlY0VGcnA4T3dTc0t5bnJWbHpVRUo0RkdvV1FrX3NYekZsejdJd3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Emad Rahman",
        "comment": "I've been using the premium version of this app for some time now and the only thing I wish it had was a progress bar and an amoled black theme",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRW8wRGNOWUl4QkZndVc1Yk91bklfd0lDSDlUeHRWS3Y0enVoVXc2Z0JOUlA0Smw1N1JleG01X0NNcDl3b01lVXc2bUJsWkM1TElyS0t4cGc",
        "reply": {
            "author": "Doist",
            "content": "Emad, thanks a lot for your feedback, we'll look into adding such features in the future :)",
            "date": "February 16, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Good app, would be great if it offered reminders in free version. But no complaints since it's more than one can ask for",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRnVGVURONXVULVB0STdBT2RBMHZZdTVNRnZQa2FWenhDWjR2U2w3X0J2NGl3bE5fNHNKOFdUREFpa1l5aWRkVTdGY3ZsMWM4Q25GUTFFbFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "K. M.",
        "comment": "Very good app. In this day and age when things are so fast, it helps me stay on track. Also love the email reminders every morning.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSGlUWnFKY2hDU0t4czk1T0FBLWJhTTNQX2NOSUpuaG1ubndrcjVuMHFqWGVublpzS3VVck9yV0o3V0hFYXQ2S3p2SjU5V1ZyZU1lRXpRcVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "tarun kumar Maheshwari",
        "comment": "overall this is good. But in premium version reminder management for team members is pathetic.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRUJiZnlpclk4ZTJ1LW5zQV9ZX1k1LWJ3a1NQWm5qeW93SEIwLVZPVXM1RFkyeXg5VS1uVnJuVjJ2OW9MRDFpbVpQMGdkN2lKNVR5NDFEbkE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I've tried plenty of to-do lists apps and this one is by far the best. Been using it for over 2 years and it has all I need and more. Even the free version. It's so complete that after so long I'm still finding new features that make it even easier to organise tasks, it's that well done and complete. Really, highly recommend it!",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRTlkU2tSUHVTd1EtT3RJNnpwQld5OE5HX1pLdFRQeFM3UlllVlp4V1Jlc1lVUEV4LU9VVHZ3QmE3LUZmU3JybUp1WFgtR0hnY3BUREZNTkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Siyi Fu",
        "comment": "I was looking for an app that handles reoccurring events, allows me to collaborate with my wife, has good android widgets, is simple to use and most importantly did not require me to spend money to have those features. I tried any do, trello, and some others and this one fits the bill!",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRVl1UEx0X3ZXampNbFV4RU1DWl9yWERPTGNjYTY5R2NXWVUwTzlNbDEzVzNXYlZlb2kzNTBxY0hlcGFrQTJRN0g0Si1VNi1pMTU1cWJaM1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Felipe Lobo",
        "comment": "I love it. After a while testing a lot of apps, you finally convinced me!",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPRy1GU3NYa3lJOEpUYUZhbjdaMkxIX0tzSE5fVlNrSm1zU3JyTWhqZ3JzQXhLZjloQS1KVmlxQ2xUUUt2YW1EVE5NdTVUa3NMcU1VdEt5MUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Priyanka Kumari",
        "comment": "I really loved it. I actually tried 1-2 similar app for setting goals or Todo list, but I find this one very convenient and simple.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.todoist&reviewId=Z3A6QU9xcFRPSHBVVkJHajVnQi15emVRZ1FiOF9GRmM4TGQ4OXNwb2RDUUFNMTVCcG5FNVk4V2NDaUFDTzRQTWdCRzFuTkRkelpWVzlqVVJENzJKbHNuVGc",
        "reply": null,
        "star": 5,
        "title": null
    }
]