[
    {
        "author": "Brandon Giesel",
        "comment": "Long time Play Music subscriber strongly considering leaving. The Android Auto app is so bare bones that it isn't even funny. The contextually aware playlist suggestions , genre, activity, mood stations aren't available within the Android Auto version of the app. It's so bare bones that you wind up listening to the same music over and over again. Play Music offers great curated playlists. Please make them accessible to me in Android Auto and I'll be super happy and content. Thank you for your consideration!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPR0FSSU1XM1FacDNjRDFNWlFqWDY0NVp1UXVIbVJuZzRaSXhhbG1CQnNKUERCelh4Skd4UngzazhON0FWeGJsNmRsZ1RnWWRSUHU0eUk",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Tanya Lagace",
        "comment": "It's pretty good but it loses my downloads all the time. This means a large portion of my monthly data allowance is used to constantly download the same songs when they should not have disappeared in the first place. This has been ongoing so long now that I believe they must have an arrangement with the phone company to make people have to buy more data than they should need to.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRXdCRXhuMEl4WG1NRGFzalRkdFFjcncxOUZzci1jSWJRNldPNXp0OWx2UnR6Y2Vaa1BaWFlMamp1WHlkRWFxemtWQnBuenUzSU1teUU",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Matt Cybulski",
        "comment": "No dark/black theme,  white always glaring me in the face,  especially at night.  No easy way to add music you like to library without navigating through menus.  No crossfading between tracks.   Uses a lot more data than Spotify,  so you'll burn through your plan in days,  what takes Spotify weeks.  And I'm not a fan of the thumbs up on the left.  Make it like Spotify with thumbs up on the right/thumbs down on the left.  Don't change things just to be different. Now even three stars is a stretch.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRjUybWRINVhqTU5oVDR5d3g2U0RDSEYyMXVUdzJmdE9Qc0dqS2ttX052QmlzWnI1U2pPSUZ2QXd4eU1UMldKQk5reXZqMHRYRnFnbWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Graham Johnson",
        "comment": "The whole Google Play Music environment needs more robust and reliable syncing and better handling of metadata. This app needs clear differentiation between uploads, purchases and subscription music in My Library, and filtering for searches. There have been many quirks with casting. Most get fixed eventually but it would be better if they didn’t keep appearing.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRXFNcTdpMUR2VzI4SEpCakNmN1V4ZURleHhWb1F1OWJyZnhuU2IyTlE4dUt2Z3p4OFp6bHF6UmI5YXQyRE5ycnZCYloyMkNzVVRmNkk",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Hayden almighty",
        "comment": "So let me paint a scene for you, i am out for a walk or a bikeride with my bluetooth headset connected. I dont touch anything to do with it but my music stops without warning. No beeps saying my headset got disconnected or its batteries are low, but my music stops, no warnig no explanation. I pull aside to look at what happened and the playlist paused itself midsong. This has happened multiple times.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRnVtVk5IR2NQSjRjd05hdEpuS2JmejA3Wkt0bi1RbXc5N3NNcTFXZDZtcDRKQUlubUVTMHhab0tESkdjMnNiMVh0RUJhZ1FJYUQ2N3M",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Matthew Kercher",
        "comment": "I wish it was easier to share playlists with friends. As it is your only option is to make a playlist public and hope it shows up on your friend's phone when they search it. Also, the podcast implementation isn't very good and glitches my last known location constantly, so it seeks to the wrong spot if I pause and resume it.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPSHhTRk5VR3lTTi1FWnVkRm1UWS1wU3hxWVBqQzdoMGlsQXNSVTNiWnB6MHk3bDM4ZE1uX3BCR3RLczBIN2QtNlc2bEZCMzFHRkE3dkU",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Yash Jain",
        "comment": "1. Please include the option to add lyrics to the song, so that lyrics show up on screen when song plays.   2. make the sleep timer more accessible than being hidden in settings.   Besides that, this app is amazing ! I loved the experience. Please make these changes and I'll update my rating to 5",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPR0lYUVFJaTlyVVZpc1NwLXFXZWtYVXcwVjJqTmY3NXdDOTdrWTZlNnVtWXlma0NzX2Vkb0ppZjRSMHo4cVR5Z1pNUTBZdkpqMVhhX3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Johanna C",
        "comment": "Sorry Google,  I love everything  this company has done since the beginning but this app could be better. The shuffle sucks, i have to be constantly clearing the queue bcs if  not i will basically hear the same songs in almost the same order. Music also often stops unexpectedly. I'm hearing a song and 40 seconds into it, it just stops  and the phone is one the table, no one is touching it.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPSGVJMXV4ODZzbm94WmRxWHhFbzFzT2pxalRQNmNhZE04bTJMWTl6MzdOYmZsWExqUGgxVmgxekp4dW5xU2I4Ty14ckhjWkdZSFVKSU0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Mbathason",
        "comment": "From time to time, the app seems not to recognise the music on my memory card. I have to take out the mem card, remove the music then restore it and then put the memory card back in the phone. After the fourth or fifth time doing this, I left the app and now use VLC for music and video playback. Good luck fixing THAT problem.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRjA5b2U3cXhEbFN0ZmJINnE0dHNYckNPeEx1QnBzeFFLc3hHWFBnWTIyTnU1RVVTZU4xY0U2U1hTY1Z0ald3UGtsQVF6Q0VhOVJiLU0",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Charley Hegstrom",
        "comment": "Great app, love being able to listen to new music all the time! the download bug of downloaded music needing connection to buffer finally fixed. But now the shuffle turns off everytime it connects to my car and each time I press next on my car. Super frustrating! Any fixes? I can't find any..",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRVZZTjUxSC1CUHhOOVE3R1JsYzEzdC1NT0tQdk9XSExDa3cwaGRYZWhJelllOWRRRXZpTm5OUEdjd1p6d1lxNkJLMzRjSlFGUEc3Z3M",
        "reply": {
            "author": "Google LLC",
            "content": "Hi Charley. If you're experiencing problems with Google Play Music, you can find solutions here: https://goo.gl/ER7TG2.",
            "date": "June 29, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Really poor UX design. Very complicated megabytes. No simple way to do simple things like create a play list - have to add one song at a time. Can't find downloaded files on the mobile device - have to separately download mp3 files through the browser if I want to copy the file across devices. Also the library does not see files that were added to the same location as the other files.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRmtZcmdKamsxdEIzdjhKd0JrM2hNbTRnd3RObktFaWV0Q0NOZ0lyOTA2UFQwdUNnTERGd25RSTFEV2sxOWJTM25CdFNSSzFuaFVLVHM",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "I only use this to play music on sd card. But with recent update while music is playing (player on center of screen) and i try to drag down screen from top to adjust volume slider, player auto closes. This didnt happen with previous version. Fix this or just add volume slider in-app?",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRlR0cFhISVJRYlpMaVd4T3lJbHBPamIteXV5TDFQSUN3SG0za25WT0N1MkhLUEpXNkVacDl0RkNQVllTbFE0a3RqTzlvY3JWd2ZMRDA",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Nathan Joly",
        "comment": "Have YouTube Red but continue to get ads after the most recent update to join Google play music ad free even though one of the benefits it tells me and you do red is free Google Play Music and everything is confirmed that I'm paying for it in the app. This needs to be resolved because I'm on the family plan and my girlfriend stop being able to listen to music and I'm getting ads all the time while I'm paying for it.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRU4wVW1qY1FyQlA2bjJJaTl0N0xjMVRSTUhXa01PM3J3d2ZjaFBzdllaVVhxOEQtczh1RkZiZlBuQVVsYkR5OHVZcl9TNU9VUkN0QmM",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Dennis S",
        "comment": "I have Apple music as well on my iphone. Notified of an artist that released a new album. Went to listen to it on my Android through Google play music but it wasnt listed under the artist under album section I had to type in the artist and the album name and it popped up. Wierd. Should all be together. It's not as cohesive as I thought.  Makes me wonder what else I've missed when I used play music exclusively.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPSHQxd2FsRlEzY2RkRTlFcmdBdUI2cTJVYlBPZEZOZ2NyWVVKLWIzc0ptX2RzbGx5LVVYUER5Qzlhd0I5Y19SZkZwc3BPQ1FiU0tHcWM",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Becca Owen",
        "comment": "I absolutely love this App. It is my main music player. But, with the last update, it has taken away half of the albums, and bands I listen too. The album is still there, but when I go to play the album, or click on the artists page, it says unavailable. Along with clicking on the album, no songs show up, and it says Unknown Artist. I pay monthly for this App, and would love it if the music I have saved in my favorites came back. It is very aggravating when half of your favorite music has dissapeared.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPSFpKMjVha09GV0pvYTVCLXo2UlZCZzRpa1ZENWVFdnZxUU5nVnA0MTVyV0ozbjBSNzFqM0lPMzFoemxWbWg1UGJhNk1ZQkVRUjNjTDQ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Damon TIEDGE",
        "comment": "The app is great.  But I didn't think you needed an update.  By adding an update.  On imaginary problems. You disrupted my listings.  Just saying that their was no need for an update.  You know the saying if it ain't broke don't fix it. Thank you for your time",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRXhZV3pHZy1ySHd1LTZyMVFWY1pWaC1mN0tJR1FFWGZGXzZtQ3lSUElVeG5DLVphNGdXM3R3Y1ZuMnQ1Tjk0cTYyN0FWTkYtZlk5eTg",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Ammon Pearce",
        "comment": "When listening to a song it will just stop and go blank and when I try to skip to another song it will say music is temporarily unavailable. Has done it multiple times in the last week. Or will say skipping to next available song. I'll have a strong signal when this happens. Please fix ASAP.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRVF2QTRwOGdEZFU0SHpvRE0tczkzdHc4N2ZkbVNKYXlROUZxRlAzQjNsQ05mSU91V2wtTHp4Um5vRWRyS3FMemktc25kT3VoaVdMVmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Casey Howard",
        "comment": "Was great until it recent just started using up my battery at a completely unacceptable rate. The charging can't keep up with the battery drain. I have my music pre downloaded. The battery drain also occurs when nothing is playing. I pay 10 bucks a month for this. They better fix it soon or I'm cancelling.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRVJMeVM2MFlMQVo4NmpDVU85TE9tdmF0a1NWb2tOWmtWQkVfTUZzdE5nOGRIYmxsQ2hQbmZCSVFsNWh2eldlWXFDLWxIT0lMcHh3WDA",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Nathan Graule",
        "comment": "Simple and clean interface allows you to browse the world's music without thinking about it. I wish the track-based radios would feature more similar content - however this is being a bit too picky already.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRTFPWlB5S3NmMXRHOW8yNDhNTExYZDRrMS1aLU91SnRKSjJFbFh2c3ByU3lvXzBjRnRkWU1hSkxYVXVUMzFsMktBZDdscGlZQ1NQa1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Stephen Carver",
        "comment": "This was a great music player until fast forwarding and rewinding stopped working through Bluetooth. The app also no longer displays correctly on my car's Bluetooth touchscreen. This all started about a year ago. I'm looking for an alternative music player app.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRWoxV2p4NjV3Zi1DWWFLUHYtWFdjTTJiYlNOQXloVG1aZEtHVjFSQ2dYOFlhTk5ORkhLMjlJdklKX3p6M0dZRTA4eFBzajN3SWphZnM",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Burak Korkmaz",
        "comment": "For the past 2 weeks the new additions for hip hop haven't been updated. It's super frustrating that I have to go through new releases which is mixed up with a bunch of other genres. Please fix this asap",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPR001WXlLVWJYOTBkb0JZTjdaVlVZYTJMckxXY2t0bWZrYkZoQUdBX3Y4NGkyOUhZVVpYcm83djhKZXZ2T2VKTmJ3bnlPZGYyNmdJVk0",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jeff Hawkins",
        "comment": "This app does not seem to understand the concept of \"download only.\" It continues to occasionally play song I know for a fact I do not own. So... How do these songs get onto my phone? Sounds like forced data usage to stream a song I don't wish to listen to. Pretty sure that's a suable offense.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPSG9rYWlib01UQmVWc3RNb2V5MEV4WkUzd3VnS0hmQWdBZU54eVk3OVBKT2VuOVpaOVVMWWlZcVhqSTBCTllVOGlSVXg4cjk1MWxvQ2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Dan Petryk",
        "comment": "All great except why is Google forcing frames around the icons in Oreo?? It's driving my OCD nuts. Give me the choice, frames or no frames, and if the adaptive features don't work, that's fine.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPSFdmUVMyNnFGXzE3RU8wWGwyZE9ZU1U5RXB4YnpKalRBaHMwMGZHT3RCckxqenBmdVNxdEtxRmktcjVXUzliZGVlX2FRODAwdnRPQ3M",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lewis J. Crawford",
        "comment": "The one thing I like about Play Music is the cloud feature.  It is a great way to back-up my music and listen to it via any web browser.  The app is okay. There can be a lag when I open it, but eventually works.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPSGJtak9LMHdxckNMRXJPajRkMk9FNGVwWmxfcFZSY0duQUkwMmxjNVBYQ2xLY1hTemNvSVpZaWw3cUdVTU1MTmVRN1VuNDFyV2htbGM",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Faheem Kareem",
        "comment": "when I play any long duration audio clips in my phone it makes pause after a while.. please sir help me to solve this issue",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRlJ1ZHFzVWVodUlFU0FPN2FsUGhsbzVhY1haSjY2NUlpcC1hWXpDMjVOeDdzUTNEbkNKbFBtbDNyNnA0MlAyMDhGcUpSRkJXUzVVaWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "j-Sun C",
        "comment": "I feel like this app is steadily getting more bloated and less useful with every update. It used to be a simple music app, now it's becoming more complicated just to play music stored on my phone. I get that every thing is moving to the cloud, but making it harder to stay off the cloud only makes me want to use the app less.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRjBRRlRMbmtnYTMydENGQU5yZ3JOb1M2b0lSZGkxaEhqUkJoLXZId2p5RllzNVVJdmFLbld0MVFkRTIwdkNVa3N2OUFhSTRweWtwNmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Charles Roberts",
        "comment": "Works like a charm. For everything except for Chromecast. Which, you know, I'm paying a $10 a month subscription for integration with.. Both this and Google home get back their five stars when they work together for a longer duration than one or two songs. Very very well-documented.  It is Google Play music that is the problem, because every other app works fine. Amazon music through Chromecast actually works super reliably.  I don't know if that's the kind of standard you want to be maintaining. This keeps up, I'm going to drop this subscription I'm paying you ten bucks a month for and give it to Amazon. At least they know how to use your device. Geez, you make both products, could you go across the hall and fix this garbage?",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPR0ZFcU5BMFdlR1pvaTV1eVpDMFBXVGlDdEFFR0R3Y3dLQjNxaG8waGZGbW1RdXloSDBNdmExdlY5V0didVZsbUt1VmZfLUZGY0phZ3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Leo G",
        "comment": "The app is good overall. After the update I got today to allow to disable album artwork on the lock screen of the phone, I noticed that it also disables the album artwork on the stereo when using Android Auto. I didn't know if it was a glitch at first or not but I tested it out a few times and it does disable it on the screen in the car just like it does on the phone. Was this done intentionally or is that something that could be fixed? I don't want the album artwork to be removed from the car stereo. I thought it would just affect the phones lock screen.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRWdKN251UDQ3bHczV2JUd3JXT0pZWTUtMGpYNTc1TWJnakRkdmdGVmpHQkRSZl95eUw0ekp3NkJ2eUhwblRWU1lnMjRpbHFHNl9qRms",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Eitai Bennatan",
        "comment": "Overall good app with quite an extensive  music  library to listen to. There's a recurring problem playing/creating radio stations based on a song/artist which is quite annoying especially if you are on a monthly subscription.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPR3dFSjAyeDhxV203SHRjYVRjMGloVWNwdFk4dU9rQ2VxdXI1cC1JU0w2LW5rZnVpSnJtLVFnbjBQaGtWQlJqR2hjQzFmUmN3TU9EMU0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Popa Adrian",
        "comment": "Tried one month, loved it, subscribed. Untill another month later, when the app cashed in from my account and then told me some kind of problem occured and deleted my credit card. I have the proof and all...but Seriously???",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPSDdLeVduejkwQnVzX2tnUGszV091YXc4OWVkT21qeW4xRW93ekNOLUZ3T3dJQmxyQmJ2WmthRjhpSGxIeUs2cXI5OEROaHp3dUw2bVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Naveen Kumar",
        "comment": "1. This app STILL couldn't read album cover photos, which other apps could. I've been waiting for this from at least 10 updates. I can see the album covers on Shuttle+ app and Musixmatch app, but Google play music just shows a blank album art. So, disabling it again after update. 2. Please include a \"play button\" in quick toggles (3D touch).",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRWluS3RxSHFuYVQyaUt1LXpBU3A4OENzc0pqNVJXNmZpbVJrVzI5UXZOYjk5TWJqaE5kdVZudFpSSG1ZcDBfRnQtMVZPbzV0aWpoem8",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Nearly every song you can think of is available, though it's not perfect. Also, the UI is VERY clunky. Hard to navigate. And hasn't seen a true redesign in years. Not very intuitive considering how good Google usually is at that.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=bGc6QU9xcFRPR0pVMEZ3alFrUi03Ym9LLS1nVVZGbDRTQ1gxeTlKVm1MejFZLW01VnRqczBRZVlsTGp1ekpQRjhoVUlmYW4teUQ3bWRYajNlYWc2LWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Mariusz Lon",
        "comment": "Does not show metadata on my car's  Bluetooth.  All other apps work fine, to fix this I can either switch back to the iPhone or subscribe to a different streaming service. I won't hold my breath since there are reviews with this problem going back years.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRzI4MXRJRXRYcjZ1XzJ3S3NVUTZScUJfb1J2VU5xa0p2OFpKQjgxWGI2QWlYU3E0N2FTZFFiaUFDZHFOUjFIejNpY2FVS0ZfU282NWM",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "scott mclendon",
        "comment": "I was really upset today. My favorite band of the day is Hed PE. All but two of their albums were available on my play subscription until yesterday. You guys took down a number of those albums... My favorite of their albums you took down. This has me looking for another music app subscription. You guys should send out notifications so we can at least download the albums if you're going to take them offline. What's up... I will be leaving play music on the 7th when my subscription expires",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRzJ2RnpqbEdSNlRzNU9ESldKeUJqblhBTm55YzJkVXB2U1BHT0F3U2o2VndsX0ktSWY4bWt0VFdteE5CSTMzeG1wT0h4LXlvV2pvY2M",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "I'd like to be able to view just my downloaded music more easily.  Plus why does that annoying extra row of suggested apps appear out of nowhere when I scroll down to view the app permissions?",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRUhIWDR4YTVkQ3dHRkRqT0JxbjdYN1NrMHlaVkR1VmFVYmE3eVRlc2I2djIxVUxXUlFOLUxDcXRTNUNmcmR2R0V2WndubnZWSGtNMEk",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "mr gilson",
        "comment": "It's okk just needs a new layout and theme orange is abit boring to look at now n some lyrics on screen would be great too these other htc music players was loads better than google music i hope u review this and make changes...thank you",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPSDNVVWxIdlI5OTVwNVZScWNpaGdjN1MzSzJsNXNFQVhGOWJJNjRHNHJYOGdxVWRnc3UyRWdwMjVIUVl3dURqWVZPWjczdkt4cGZEdTQ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Charlene Jennings",
        "comment": "I would like to see a change in the way you can add songs to a playlist in this app.  All other apps I've used enable a select all function. On this app the only way to add a song to a playlist is to add the album or song itself, I don't even have the option of going by artist, which means it takes basically forever!",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRmNhZmNwRkdMbmQ5b28tWnBlTUxXVWdsWGp0QW1oSWkwMU5aVnMzN3lPRHdzTF9Xb1ZUeFRqWXhyTy04S1BabjBtUXg1VVRyTWQxUUU",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jurace Monty",
        "comment": "Slow, buggy, and crashes alot. Spotify is way better, but this comes bundled with youtube red. Wouldn't pay for it if it didn't",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPR25xVG12aTB0RW5qbzdkYmw5NmN2Sm5GSUJ3djNIRWdMMVVHRVBkc1FoX0xUakJPSlNWNlR3dUJJdU9lZFAyMzcwMHBZYTJhajlwX0E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Mike McCarthy",
        "comment": "This is such a basic app, essentially produced just to sell a product - a subscription. As such, it lacks features like the ability to easily create and edit playlists, bookmarks, rewind and fast forward within the item you are listening to. It integrates with Android Auto, which is about the  best thing going for it. There are better apps out there, particularly for those who are listening to their own recordings.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPRUlVMUZQOVlqOHh2UGIxTDNTbW1JLS1Ia0ZYWU05LWs0b2hvVG9vX053dWN2MFJMbXNXcm9OUldDSDJCY0V0WE0yaWRnWWlUQ2h2NE0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Josh M",
        "comment": "Great service. Desperately needs a home button or something to take you back to your house ok me feed. Finding your playlists is not as easy as it should be, but everything else is great",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.google.android.music&reviewId=Z3A6QU9xcFRPR1FxUXQ3SmIxVm12NW1nazVqZC02YlpRb2JEY2Z4NU56YzVYWExTWUhVWjdTRVNUWnZXTWlfUElqM09ibE9sT2pEajdZTXhYSTRPMzQ",
        "reply": null,
        "star": 4,
        "title": null
    }
]