[
    {
        "author": "Gaia Noseworthy",
        "comment": "This app is great for those who need a boost to an already existing class. It doesn't outright teach grammar or sentence structure, but you can learn it through practice. Even so, there are no written resources for someone to use and learn without other sources. In short, it's the perfect assistant for classes and reminding you of a language youre forgetting, but it's not so great for learning outright (though its great for learning basics before starting a class).",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPSDBLeXk4ZkVzNld4aUVpak5YVEczV0JrclFJdjFEVHo1WjZId2YzR3QyQnZ0YVFtWFk4U2tqR2JoTDA1NXkzRXByZ01HS2xrMzBLTkpmWmc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Excellent app that is helping me to move forward with Chinese. Dropped one star for points that may be down to the early stage of application development for this language. For example, on going beyond the basic level, Duo gets somewhat confounded by the subtleties of translation. (As may the student also.) User reports should produce a steady improvement. Strong on establishing the basics, maybe less so for higher skills, where supplementary methods may be needed.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRU1pbDZrOFlRY1hSeE5IM3N5UXNZMUNTcGVOMVhHZU5BWjJRdXRReEVzUmJJUjU1T1k1U0lOckhBcDRMZzhQQVZLTFdtel9WSmpEdlJrNGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Chris Turner",
        "comment": "I once learned German years ago and son after I forgot it all, but now with this app I have picked it up again. It's very intuitive and it progressed through from very basic words gradually adding more words and tenses. It really is a great app for anyone wanting to casually learn another language. The app doesn't teach you the principles behind the words, only the words. Recommended!!",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR0l0Z1pveEliSmt5WHdyQ0hwT3ZadXRmUjlZZjNJSGRYckR5aW5ncTdBX2tnZk1EejNuM0NEaHZmWVBaYW52QkhkX25fdF9wbmhPTHZCYmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Arthur Shun",
        "comment": "I have used Duolingo on my Moto X Pure Edition for over a year and have had an amazing time learning languages. Due to a recent update, however, I am now unable to load refresher lessons even though regular lessons load perfectly.   I sent a message to Duolingo customer service 3 days ago and have yet to receive at least a response saying the programming team is working on a fix. I love this app and will continue to support it by return this to a 5 star review when functionality is restored.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRUJFQUtqdzlnSlphS0xndWFuR0tIUVB2c1FsU2xFd2pHTXVreGZRLTFZVEltcFJIeEE2ZnpucEVocE10eW5YS0hfVnlJN0lhcVNPdDZkVnc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Charlotte Gowers",
        "comment": "It's a great app it's working... Keeps freezing up on the third question on my HTC u11. Hope it gets sorted soon as I paid for plus and don't actually get to use it, seems that since I paid this hasn't worked at all. Have tried multiple times to sort this out even uninstalling wich brought back the adds I paid to be rid of. Wich kinda sucks.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRWo1RVBTV1UteVNxaWZLUnpkR3pPUDgzTlpfa0tyZUZWOEFFY2Njc2c2d3JQQ1JaUFBncFZwUlllSkRCT2xyT1Q2c1hFNm9XRXN0N1Fla1E",
        "reply": {
            "author": "Duolingo",
            "content": "Hi there Charlotte! So sorry to hear about this! Is it freezing on a certain challenge each time? If you could describe the challenge you are on when this happens, that would be wonderful!",
            "date": "February 26, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Vincent Ottobre",
        "comment": "Decent overall. Occasional bugs or sketchy translations, nothing major. I'm learning Japanese, and if you're doing the same, I recommend at least some basic knowledge (e.g. Hiragana and Katakana) before you begin; if you don't have the basics down first, it will be extremely difficult for you. The streak system is a great way to make sure you study every day. Not recommended as a sole source of learning a language, but definitely recommended for practice.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPSHhub2ZMZGVId1RjY1AyOGpnbVp3UU5qRElwWjl0VXZtUEdWLUwwdVNNVUt6R0MycUZ6UnY3VGdZVVA0ZmY2VzBlRVp5NlBuLTFtNEgxSEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Keely Bergin",
        "comment": "The app is good for refreshing, but the grammar doesn't always come across. It's hard to create new sentences depending on this app, since they only test on sentences the app already has. There's no opportunity for creating your own sentences to generalize what you've learned. Also, I've been having problems with the app crashing when I try to open a lesson. The ad still shows, but the lesson never pops up.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPSE8yZkxScWx1Yk1GeTFTSWR5bHNOWHM3Y1FXN1diWkxUZU9BcmhMd21ZTGdJN1BZdDItLUdDRzVHbDFrclg2MWZFeXhja1pXQlN2NXlWLXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Olisaemeka Anyadi",
        "comment": "I This app is just so intelligent, it makes learning a language fun. You will love it too!  I suggest the developers add a few things to the app.  1. Showing how to use various verb forms and why.  2. Creating a chat room of some sort where learners of a particular language can attempt using the language in communication. E.g I am learning French, I would like a chat room of some sort where I can practice speaking and writing French. You could even create an ArtificiaI Intelligence chat bot, that will chat or speak with me in French.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRmpNQU1TTC15RUEyRVR2bm8zM0JYZFhockZGNDJKMy1FeTF5RkI2aGFBYUpsYXJJaGk0aURLS3VFVDhQRTQ3S245NVVlbFJ1cjJiY3JtTkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jeffrey Seebachan",
        "comment": "Learning Japanese, and it's a great way to get started by making sure you're practicing everyday. After finishing the introductory lessons, it feels like an app designed to reinforce learning rather than teach though. Grammar and vocabulary are thrown at you without introduction, and tips for vocabulary don't always see both hiragana and kanji so it feels like a very scattered approach.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPSE13bDFoMGFsQVV3RHptVHh2LW4yZ0RkSkxnbnh5T3dxNjVBQi05TjBEeERHQV83U19lcEJvRFhHOENaUGxId2ZkdXMweHo4c0swcjBNUFE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Sharon Rainey-Baker",
        "comment": "This is a great app.  I use it to strengthen a language I had taken in high school and to learn another that was completely new to me. It is fun and helps me feel more confident.  I partially like the feedback comments when I cannot understand an answer.  I tell everyone about this app. Please keep adding languages! Still loving it with a few years of use.  Thank you for adding Chinese!",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRXQ4c0xIY3RFS3lKNjRPZFlpLWQwOTZkeUc4MFRpV1J3RGdpSXlLOE12bkVJV1ZLcTlWVWRjaGt5UmVMRzJDdGhLbVJ5VnNsdlM2VHBUaXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Maryann Seth",
        "comment": "Good app to get started learning languages. I like that the lessons are short. I cut one star because it seems to have a bug where the quiz gets fixated on a question and asks it at least 4-5 times. I also wish that we could pick topics we want to learn about rather than go sequentially. Let people choose if they want to go sequentially.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRkNXeElReVpGRTN5VUJ4OWRjZzlscGV1SDdLcTl5WnItV05WZUlpWHNlcXduRzZneVl0dnUxaFFEVU55LUs3Y1A4NXBGTUhDN2xPaDg4R0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Karen Jacobson",
        "comment": "I almost love it. Easy to use. Definitely helps you learn new words quickly. I'm not sure how you are supposed to learn grammar or conjugation without some sort of cheat sheet to go with it. I had zero idea what verb endings went with you, we, they, etc. Even tho it was easy to guess in the app. I didn't have time to catalogue these things each time they came up to try and make sense of it and finally got so frustrated that I googled it. Now I quickly learned what is actually correct. Having some guides to go along with these great exercises would help a lot!",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRjNSS001LS1Wb0VaZGdWWEZDQkVHR0VWckZxSnd1eHpkQzlQY29ZSDY5N1lGRzNVbUxvTk96VDkyX2c4OXY5SUlsNlR5Zmtyd2N3dS13bXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sansi Daan",
        "comment": "Love this app. And how you can leave comments. But there's no notification if someone had replied to your question on the app. Plus I've just missed one lesson and missed my 60 day streak!?! :( How do I make up for it?",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRWg2Ym02eTFCTDFDd01lcHhYX3pSMGVVVnFRX1JzcEVZMGcxWEg1UVZZUFNwLU1FN1FMQjFhWnRscVdZS3Z4SnR4ZHRweUNRczY5bTFXQ2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Edina Karsai",
        "comment": "It's an amazing app to learn languages with. I have one problem though. When I practise something, it takes such a long time to show me my progress or make a lesson golden. I wish the android interface after practising was a bit like the online one. It could show me what lessons I have practised and if I mastered them or not.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR2Vsb1M3bmFSV2pyNTAyNzRXLTBGaU1PYTNYWTJmaXl4Y3gzRlNrbkxaR0REV3R6UmdpUHVFcGxKZGxKbU9va2YyR2FlN3RZc1AwMU9URnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "omar Mycanb",
        "comment": "It's really helpful  You get to choose up your language and you can compete other user's  That can be really useful for your progress!!  Plus it's free you don't have to pay up in any kind of way   I highly recommend it  (Thank you) for reading all that lol",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRlhlSFNLN3R4eV9Jdm1vWm92NEhWSEdDY2dRQUl5a1o4TmJ1djNnZGl0VW01MUpzS1I0UnZic0UzYldyc1ZPTENkVGhXaXZ1aHFCcnFONHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "1990's Pennywise",
        "comment": "Very effective tool for learning another language, well structured lessons. May seem tedious at first but with good reason. The ability to view other users questions via a dialogue box at the end of each question is a great idea. Has helped me greatly.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRVFHeVV2QXpFUVNXS1FHYTdtZ1B5d3J6WUZWYmc3YzJHbjg3TGQ5WVRiX2ZST0FCMmM2VmdzYUIyTVBBREtTSFpVLWJkYlVjYTZuQmRsS2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Miami and Louisiana",
        "comment": "I love this app! Forever I've been trying to find an app to help me on my French for free and this is it! Thank you Duolingo! Though, I hope I'm not asking too much if you guys could make text for us to read in the language we are learning. That would help!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPSEJ1THZTdmcydlBuSWRDeWV2b2hvaWFMUHdTMWdXUDlXaERrTlc4NklGRVZWdEdBa0VBZ01NUEF4bjlOeGFVSFZHdmtaTERncm9RVTJ4bGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Candis Hidalgo",
        "comment": "Easy and fun to learn! The ads are not annoying at all, but rather quite polite! Only show up right after you complete a lesson and very easy to click out of (not tricky like most apps' ads). I do this with my 2 boys (5 & 7) and we're all learning together. Very enjoyable!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRnNhcFlUV0dqS1o4RWw2TFV3eHVubEMwRnAtZk02VGJZaV9TOXBZNElXZXRtdXh5ak16NXlKRWtpWVZ2WFlrUm1kOF9DX2g0cTd6dlNZY0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Alyssa Randolph",
        "comment": "I'm currently using Duolingo to learn German. I'm not sure if the full site does this, but the app doesn't give much in the way of grammar lessons. They throw a bunch of words at you in sentences to figure it out yourself, or use a supplement to help fill in your understanding. Aside from this, I very much like to use it!",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRVpSMEwtSHhGRWVrZjV4VmNSVEUxbzRVcVB4N1F3Q3BUU3E3LXlzUC02cVJGZjlLYkFFWFFtUHBDVHJ3TURaVXo4SmtpcmZKQV9vSE9XaWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Sir BadgerX",
        "comment": "I've used Duoling to start learning Korean, I find it very useful and convenient. However, I would say that the pronunciation of some of the letters/phrases seem a bit off and robotic. Although the message is clearly conveyed I would think a more accurate pronunciation would improve the app and learning experience exponentially.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRVNGd0pLX3NWbXUyZGo3SEk4enk4Z1F4LTVqN2ZPZ0MxRmhrRTVPMVA3NkhIUFNLNjk2UFFFdUlvZjFmM3BINXpZMVc1Y1laa0xKdXlyWmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jack Alvah",
        "comment": "I've been using this app for a long time now and it's all sorts of amazing. Recommended. If you want to learn Spanish, French, German, whatever, you can get started with the basics right off the bat! DuoLingo also has a sort of system that is game-like. You can not only learn but have fun while you do it. 5/5 stars!",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRlN1U0xVVm1DS1NDWEEycXh1QklUOGpwbWFOb0dubGRaeVBxMHFhblQxelRJLUFIcXdzUy1seW1tRlNhbDdZcDAxcmMyUE1CZ0pzZl95d2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marcus Woodworth",
        "comment": "I was really iffy about this app at first. I wasn't sure if pronunciation was going to be properly covered, if the sections were going to be comprehensive or well-paced, etc., but I'm currently learning French and Spanish at the insane rate and I'm retaining the information really well. Great app, good work :D!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRzVWa2FfZGx6MGwxeDFZR1RsSVZvV1k2NGZoUVdxa0pEbWxOZjJOaWp5UXlVektYU1AwQktLT1RyUnZpY193RFYzaWV6M2IzRTFYSDN3b3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ken M",
        "comment": "Been using this app and at the same time also using Rosetta Stone... I'm very impressed with Duolingo and honestly like some of it's features more than Rosetta Stone.  Like having to spell words in Italian and lots of repetition... I use Duolingo every day and it's very helpful... Definitely recommend it",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRnI4Z08zLXluZF83Sk91MnpsS0ExdWctM3o0a3Z3cFVvVVJVNE10blRkbE44cHU4S242X3hWZHJjTUJiX3BhLUtzTlVqN3lWVS02Y18yN2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Natalie Joanes",
        "comment": "Simple to use, handy for learning while commuting. Lots of comprehensive, bitsized notes on the desktop version to help you with grammar rules. Downside is there's no audio facility for Swahili yet so it's not obvious how to pronounce things. And some unfortunate typos, which really shouldn't be the case in a language app! But otherwise very happy with it as a language starter tool.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR05yM25ORDdQWXB0YU1ReFZBY04xOTBkN3hnelluel9QRnhqOW9Qa0FvTHBJYWp0aDcxd0RVMnc4dE1LWW5IYWVXemxyVHMzS1I1dW52V0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Luis Santos",
        "comment": "I want to love it, but I'm learning Japanese and it keeps asking me for Hiragana characters and words that it has not taught yet, and which cannot be guessed by mutual exclusion. Also new words should always be introduced alongside pictures. I have filled numerous reports regarding this but now I'm tired.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR0Ewc1haVjlUWW9WUFlmYlFvRHN4czctMHcyY01ISGgydEp1TVR1U0dUOXdTVnViQ1J3MkdEaGRzOER2UUd1Ym9qalpYVGxqOXBDZUxmd3c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Really great so far, love all the different formats of questions although the word paring portion can be a touch repetitive. Amazing app altogether though and so cool that it's free. I've already told several others about it!",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPSENmXzN5RFgyanQzOFcySkdKQ2tWTEM0RzZxbHdibnFLbVZuTHRiZFV2cHJiY3QtSEZGZzFDUWlzb3l4Ni1qNmVNNEx3NW8yMnJRQzgxR0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Honestly there just isn't a way to learn like u have a teacher unless u do. I enjoy this but lack some grasp with it. I dont think this would make for a good stand alone teaching factor for those who have my learning style but i still like it",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRU01SDQzamR6ZDZYQ281UXh5NHh3X3RDZWk5TjdnMFdhd1pzUHhlcklDT3VMYW4tU2VOaVNrOWxITFJYX0ZkbmZaVFN2V09XUjNrek9yM3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ty Rickers",
        "comment": "Stop putting duo up in between exercises.  I get why you have the ads but I don't need a stupid bird telling me I'm smart.  Also get rid of useless matches like Sofia, duo, and Adamo.  More unnecessary clicks.  I like the ap and will change my rating if these are fixed.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR3lyVUh0dWZBWTFmaVVGRlR5eUZyZC1idER5aUVOTDY1emxob2dZWmRwWmNtYm1pMmZ4UU9zelJvdTA1SndMNmkyT2dBWnBzZW93VXc5SXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Lori Canales",
        "comment": "I'm finding this app really useful. I just don't like when certain words don't get introduced in a section and I move on and suffer for not getting exposed to it earlier.   Also, I don't know if this exists but it'd be great to have a place in the app that shows charts with and explain the verb conjugations.   Comments sections help but a lot of time there are useless comments to sift through that don't answer the questions I have.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR2tmQ0dwVlltRkpBWEQ2bFhHYXpUN1RPWldCWGtKb0x6bFVRVnVwRXk0NU5RY0stOXpwU0FvMVFENExvRUI5eG5fcUpCMmd1V2hHNzZBT3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Hey-It's-Me",
        "comment": "I am two days short of a 2 week streak and I'm blown away. For having not been on here very long at all, it's crazy how much I've learned already. VERY good way to learn a new language.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRjNBam5fNVFyaHYwcFl1Vnl3V0ozSHJrb3VDUVdvMEZLSHBWanhjM0djV21namx5amZvTDg1Y280TTVMaFZBeWtIQWVVQkVaTkJHZTNqc2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Amazing application and so glad it is  for free to start with! I started to have a little bit of fun, choosing Chinese language out of curiosity. Got truly smitten, but hope calligraphy will be explained too. Any more languages to come?",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRzBrcVd4a19WOGIzMS1vWVpjTzJPZE5FVDVBLVQ4MGMwWWItVTVEVE9WNHNScXQ5Y3RpbFZfV2I4b2R1Qi1oYnJCTjNlRldBXzNQNmVwaWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Blessing Antwiwaa",
        "comment": "I would've gave it a 4/5 if it wasnt for the updates. When ever I update i always end up crashing. It will also be nice if you add asian languages like korean mandarin thai like that. If you think you are going tolearn asain lanuages leave this app. I recommend memrise or mondly.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR0R6clBKZWhwUHhqVXpqOExEamJOTU05cmNjc3FsSTF4N00xZkR0dC1UT3dzUlVkUW82TWxDRm5oNEhuQU5ENnA2UF93TnZMbUh6d2Vwa2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Devansh Shah",
        "comment": "I have been a user for 3 years now. The mobile exercises are so bad and have gotten worse over time. It's just a repetition of simple words. The desktop version in a browser is far superior. There is no reason that quality of exercises and explanations cannot be brought to mobile especially after years of development. Terribly dissapointing. Beyond the basics, the app is horrendous.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRW9tQ1J3ZHFyc2xKZ3lpaV9icW1nbFlHbWRVRUpvZXhiQ2c4ZHp4Z2h1TnNIQXhqT0czWHFiYjNhbEg0VC0wMjhhdXVjOXd0aW5wS1lLOFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Rachel Ross",
        "comment": "Lost all my progress when i got a new phone and it keeps starting me at the begining.. I had most if spanish completed.. Very disappointed and dont recommend unless you want to do the same lesson over and over again.. Sent complanr with no response to fixing this issue..",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR0pDT3pRSUJjX24zakVaUXd2SzhiX096V0JhWG5VVzdoQ2V4OHliUHd5RmxXLXdEc200ZnV6dWpVZWJuRGpCN3hPZ3RBUkIzbGh0VjhkQWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Momo Smith-Jones",
        "comment": "Easy to use, very good for improving vocab. Could use slightly more grammar explanation at times, but the system is generally very fun to work with. I'd suggest pairing it with a conversation program or regular movies/shows to get the full listening-speaking learning comprehension experience. You can learn the basics on the app and then listen to it used in more common contexts.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRkFwZzhIVW5PMk9VUjlUem04ZUlVc1FUQUFxbWFCSnB5Q1BRWklRa3NUcUVBeUlDSnFsZUhlM0JRRWxWNWlISHA3dmJxQ2hGdERnUV9UMkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Allan Santiago",
        "comment": "I've been using Duolingo for over a year. I'm not diligent in completing all the lessons, but I don't mind the repetition. My basic proficiency (about 35%) has allowed me to be able to read Portuguese and be able to pronounce things well. I work in customer service and the bit that I know has helped me bridge a deeper level of understanding with Portuguese-speaking clients. After this I plan on learning Japanese.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRVpSeloySmZtYmF4aUQ1REFXTDdIV1J3TlZxZVpGSFhUOVNCc1VxSHlxMHJlUUltc0gzejFyRUxEeF9haXAzN2huVzVTY0tvcHlqeVlmQ3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "reinaflor talampas",
        "comment": "i love the app since i am learning korean through here and other mediums. but i would suggest that they should explain if there's a new word and not just show what it says. but overall, i really like it!",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR0M4NlJVT1k5NmtldHhaMmVGTHZDemJJV1llQW9qMlFQZzBwdHp1c1ZQTVM0cDZwdG90QVVrT1JaTFM1MnRnMXZEQTBBTURMZlprTVlvVEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Felisha Cuenca",
        "comment": "It's a good app, the desktop version is quite better. But it had a challenge do 100xp in 48 hours, and I did more and I never got to see the prize or whatever it's called. Kind of sad, hope this doesn't happen in next weeks challenge.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRzJYV0tCSnVBRTVVZzUzSXZ4dFYwUzJ3Tm9kOFk2MXFvUFpPTUJJU0JlTzl1MTNBcXRNaU9qSExwa09uVjVrQnVaT25lSWFCNXpxOTVYLWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "if you love constant prompts after every lesson about paying for the better version and having to see adverts after every lesso: This app is for you. It will even try to offer you to give them money to \"fix your daily streak\". Good reasons to avoid this app.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPR2RRMjd4N0xDMTlOLWtZMUE2VW1EZy1jZWRGaWZrM2NibTFlc3N2M3lRTy15QjFITDVORnJXdGVPajdvb3JoVWV4OU9BVmcwYnA2dmNSdHc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Nikki Milne",
        "comment": "Totally addicted to this, because the 'lessons' are so short, so I can do them anywhere, any time. It's good fun and there's no pressure to achieve certain targets, the ads are minimal and don't annoy me, and I can't believe it's a free app. Absolutely brilliant.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.duolingo&reviewId=Z3A6QU9xcFRPRklZclJaQ1RyZE5DZGp1bkR5ME9GUnRJRHp1Sm50eWowOXp4WEVfaVNzbmxCSWExN09SSDRsa1BZRnIwN1ROZlJGaEd2NnczV2xac0lLZ0E",
        "reply": null,
        "star": 5,
        "title": null
    }
]