[
    {
        "author": "Michael Guthrie",
        "comment": "I like this app, in fact couldn't live without it.  But now I'm forced to use Outlook for other reasons.  It doesn't work with Outlook so I can't use it now.  I don't believe that it's the fault of MobileDay, Outlook doesn't work with any other app that I know of.  Sometimes I really hate Microsoft, but I've got no choice for now.    So, if you use pretty much any calendar app other than Outlook, and it works with other apps MobileDay is highly recommended.    If you use Outlook as your calendar MobileDay will work as long as you also connect the standard Android calendar to your Exchange server.  I did this for some time, but Microsoft Outlook 365 no longer works with the Android mail or calendar so this is no longer an option, at least for me.",
        "date": "January 27, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSGx4ZVM4QjRtVEtFZmxqN05xRW05REc3Z1FUQS0xM0c0R1F4bW5JMm1wRDdoVnF4dHY0MmZ1UExBVEtGUVdOd1pJT0RkdmJWNV9jMWZCZHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jim Jimmerson",
        "comment": "This app is sketchy. It dials a 3rd party number to connect you to your conference bridge. Maybe it's not a big deal, or maybe calls are recorded or eavesdropped on. My calls are sensitive, and this is concerning. If information was to be disclosed, my employer would hold me responsible for using an unapproved service to route my calls over. Needs an option to dial directly.   Also, quality is much worse than dialing the bridge directly.",
        "date": "March 6, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRjJkazFmOU1iQS1SbGQ1YzBabElNUjZIaTRSSWlHVFItRUJnQU1zRXNuUDhIRk9MSXdBOFNBSTEzTmRJODRPY1NmdERaVFVPRWltVlhqU2c",
        "reply": {
            "author": "Twine Holdings",
            "content": "Please email us at support@mobileday.com and we can help you with this.",
            "date": "August 24, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Nicole Cimino",
        "comment": "This app used to work perfectly for me for years. it was the best for making conference calls via a mobile phone as it found all the conference dial-in and passcode information automatically in your invite and dialed it for you. hugely convenient if you were driving or unable to search for a conference information. However a recent update or some other change has now prevented mobile day from displaying any of my calendar information or any of my conference calls.  It is useless to me now.  PLEASE GO BACK TO HOW IT WAS BEFORE AND I WILL GIVE IT 5 STARS!",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRlZobmJpa25JRFBBLU5oSnZTODlLdzNudGpCRjBibXdSa2ozTkVubGxYa3BEaWVlMnU4aDFNUmRLaEFPOXN4TmJZbTdlR2FOSFBWdFRhWlE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "C. Heyde",
        "comment": "The app used to work perfectly but lately it started dialing into some random number and then requiring me to put in the pin and password that was already set up. Kinda defeats the purpose.",
        "date": "September 20, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRkRHd1hQZnlaemY2TFhDVFdTcTVnYUdWY0ZoaUt5dDVJTGNyMldJUF9iM1p0TWZkTVR5RkprbFZyTnJYTzh2NGZjalpNZVNOVVlZdXJfZ1E",
        "reply": {
            "author": "Twine Holdings",
            "content": "Hello- please email support@mobileday.com and we can work with you to get this working correctly for you.",
            "date": "November 7, 2016"
        },
        "star": 1,
        "title": "Dials into some random number and then..."
    },
    {
        "author": "Gary Weinberg",
        "comment": "The app dials out as advertised however quality of calls is horrendous. I am constantly being disconnected. I can conclude that the app is fine but the service behind it is garbage.",
        "date": "January 28, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSEJaNWUycmVkbmJ1ZXR5bDdacTFFVjVsYjNON0o2eXFzOS1XNTV4S0luOHJ5d1hmc1RacVZpZGhwX1dZMDVKNEhibk4zLV9yekNFa3FZN0E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Doug Davis",
        "comment": "This app was absolutely my go-to app for a year. I happily paid the subscription fee. I loved the fact that it included all of the conference call numbers and codes in one push of a button. Unfortunately, it no longer works on my Android phone. Despite the fact that I can open the app and see appointments, it never notifies me. Without notification, the app is useless to me, so I uninstalled it.",
        "date": "May 22, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPR1NGcXhKOUFTaDN2bkxzVEFSbjZ0MGIya1JuZkp6REh1SmpTTUJ5dWhWYzl1dFBwR1pwb21TejA4QlI3LUg0bWxQdHdvTFJJbjZ3TVEyUVE",
        "reply": {
            "author": "Twine Holdings",
            "content": "Doug, \nPlease email us at support@mobileday.com so we can troubleshoot this with you further.",
            "date": "August 24, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Please add support for dual sim phones!.  It joined me on a meeting on roaming and got a very painfull bill :(",
        "date": "September 4, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRWZFeEZBY3lIay1NRFlNczNpak5vaURqSXExc044VjJ5cXM1b3dSZ2UwQ1VBOFBsV3BINjdaUS1HT2d1UWVVYkdrcHRMbXJHTk5fZXFtV2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Michael Vollmer",
        "comment": "WARNING. SCAM. SCAM. It will call another phone number then route your call through. Do not trust this app.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSEJMY3BVd2pER1VDY1BvQV9lejZBbkoxN1JMTHAtR1N1Zzl3X096SWYxV1FweHgyQ0l5MG5hQzY0MHpDNWV6cDdmRnpfb1pzTW43ZGRrWHc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Anthony Byrne",
        "comment": "Great App.  Handles all my calls flawlessly.  Makes joining conference calls while driving easy without having to look up pin codes.",
        "date": "August 27, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRlFJY0FrNG15Qk5GNWJ5SjFwRkhqeUZMNFhSQUEtS0U0eGNpVTdMeDdxNmhrZW1PNFdvN3lYZVNxMlFnQVJ2eG9obEItaXB0OWdpTHpNWUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dragoş Dumitriu",
        "comment": "It doesn't recognize conference numbers in calendar entries. Ever.",
        "date": "July 15, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRkR4NF9keHZGV2NzUjIyeWdTYmdOOWpwZ0Y5bVFTck5BSVJDSUNCcTNPalAteTgwQnh5SmlOWS1FQk9SRVpBY2hoeHNBM3F3SDBvZDdOQ2c",
        "reply": {
            "author": "Twine Holdings",
            "content": "Dragos, please email us at support@mobileday.com so we can troubleshoot this with you further.",
            "date": "August 24, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Doug Billings",
        "comment": "Not having support for Outlook Client on Android is a huge miss.",
        "date": "January 18, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRldxN21MdkZ4d3c2Mkloa1oxcHNMNEY4RjlmeUZ6Tm1XS3c5OFVNNElNc1B3MWpIR3E0a2U1U0xuTEctMzhzWGRVdEp5RGszQm9ETzVFR1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jonathan Commanday",
        "comment": "It's the easiest single touch conference app out there",
        "date": "February 27, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRllVVlB6VkxzX3dDWU52a2tsNlN2cHNpOGRIRVlyN3k5S3ZpRENyX3kwbG9VX1FWOVpodm1iNGtMLXRYZGp1X2Y1bFdxU3FLQmYxVFdDMEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "S SENTHIL BABU NAAIDU",
        "comment": "Why it Automatically Screen Turns?",
        "date": "September 13, 2017",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSFd4Q2wwTHZETG1MQzktTWNuVWNTNnVHM0lzdUFLbVBuV3FEMktqTEpCMVBPUk8yR3V2LTBjX1QzanRubWlFMW5vclVSTHRHOW5HTkdkOUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sunshine DragonFly",
        "comment": "App keeps crashing and giving an error report continuously.  It has done it about 6 times in a row within 5 min. Sent an error report several times. Went to see if there was an update for a bug fix but of course there is not one. Very unfortunate! App had such good potential!!!",
        "date": "July 22, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRkpOYU9SZTYtbGk0SUdyMC15bjhzWUNaeE9Uc1RNby1NYXR5aV8yTVlRaUk4OXNlZ0U5T2pobXpRcXRXNS04VXVlcmpUS0JuZmNDblQ0QVE",
        "reply": {
            "author": "Twine Holdings",
            "content": "Mekeisha - Please try deleting and reinstalling the app. Please email support@mobileday.com if it continues to occur so we can troubleshoot further.",
            "date": "July 31, 2016"
        },
        "star": 1,
        "title": "Continuous App Error!!!"
    },
    {
        "author": "Devon Cassidy",
        "comment": "On my old phone, this app direct dialed. Got a new phone, and now it goes through a 3rd party channel. I just got disconnected 8 times during a 30 minute call. I will be finding a new app.",
        "date": "July 21, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSGstS1lZWUVTS3dNcnhCcDF5R1pnR1JieHh2QlFENkt0MDF4OXVTZGM0OFJrYnQ4Yk02LXdJOGlYdGxmbGNneUFTYm1KM05pU0NtcUhfYVE",
        "reply": {
            "author": "Twine Holdings",
            "content": "Devon- please email us at support@mobileday.com so we can help you with this.",
            "date": "July 21, 2016"
        },
        "star": 1,
        "title": "Used to be great, not so much now"
    },
    {
        "author": "James Madden",
        "comment": "I have used, loved, and relied on this app for years. Now with it routing calls over thier network completely sucks!!! It breaks up constantly, people can't hear me, and I can't find a way to turn it off...",
        "date": "June 21, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSEVSY21TbndtVDdNNFZFeHdNRWc0VjdEZ0trZ1o0RWpiQk1VandrUU5YNWx4djVKSnI5VjR1S0pDM3c2WnY3N0xRN2dhTHN1V2ZWd2pKZlE",
        "reply": {
            "author": "Twine Holdings",
            "content": "James- please email us at support@mobileday.com so we can troubleshoot this with you.",
            "date": "June 23, 2016"
        },
        "star": 1,
        "title": "Used to love this app..."
    },
    {
        "author": "Wayne Lawer",
        "comment": "I join a lot of calls on the go, and was frustrated by calendar apps that do not include one-touch dialling. MobileDay to the rescue for sure - I would not want to be without it, but... one request: it would be great if I could define one or two \"preferred\" conference numbers (not the pin).  I join lots of  Skype mtgs with many local numbers listed.  About half the time, the app chooses a number that results in long distance charges. So a feature that looks for your favorite number first would be awesome!",
        "date": "June 28, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRWhsMmhBRjNhbkF0cWRkRnZEMk1pMjl6OXNGb1NoX2VzamVabG5JUXdMWW5uZk5fclI4dXYwdVZMLUFHVExtMFo4VlBoOFh3bWpNTTUtbXc",
        "reply": null,
        "star": 4,
        "title": "Love the app but would change one thing..."
    },
    {
        "author": "Greg Crouse",
        "comment": "Update - no need to troubleshoot.  You are using low quality connections which are adverse to me. I gave you over a week. Had another super choppy call today so I'm out.Have been a paying user for over a year. Had my first call routed over YOUR network when I pay you AND my own conference service and the call quality was abysmal! Choppy, drops, absolutely ridiculous.  Since I'm loyal and nice I will give it another week but if after that I suffer through a poor quality call again...see ya!",
        "date": "June 24, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPR0VaSGJJdGVYREV5Zm5jN1d5SFpZVHJCbFB4NllVT201dkdiSTZFY1dGbWlCWll3eHpXVGRiWHloV2ttMFVLUnl2UlllM1FFVU1QZmdjc0E",
        "reply": {
            "author": "Twine Holdings",
            "content": "Greg- Please email us at support@mobileday.com so we can troubleshoot this further with you.",
            "date": "June 22, 2016"
        },
        "star": 1,
        "title": "Unacceptable"
    },
    {
        "author": "Jason Gorell",
        "comment": "Still loving it.  Helpful tip from tech support -&gt; if the app doesn't recognize the dialing numbers anymore try uninstalling/reinstalling.",
        "date": "June 19, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRWRTYWV5RzVDbzZ6THI0dFBYRHpZNDJ4UE1sbUpkUEd1LVh5YVM2Z0VtYjV3NWZ2OGtPNE5ZbllXbndiMmt3d2tfcnhTYnFoeDBTN1dJM0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Aaron Schoenle",
        "comment": "Not happy why reroute my call! Uninstalled",
        "date": "June 20, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRUpSVFpuVjdXcGdFUDJmTTItSkZRbVRIMlJjeXZ1VW5nSFVtRXFTRXBXS0lkMVMwNGtlZzZxcl8ybkhiOHRZOHcxVUZ0UllYd0dnaDlvWGc",
        "reply": {
            "author": "Twine Holdings",
            "content": "We recognize this represents a change.  In order to continue to add new features we are sending traffic over our proprietary network. The functionality is unchanged and MobileDay doesn't monitor or record any user activity, voice, or other call content.",
            "date": "June 22, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "F.D. Singleton",
        "comment": "I have used this app for years and were happy to pay when they started charging. But routing all my calls through a proxy and risk my privacy, that's utter BS. This isn't the Mobile Day I signed up for. I understand the devs wanting to monetize from the app, that's what the yearly subscription was for. But this new racket? I refuse to continue use of this app.",
        "date": "June 6, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPR2RHTnRYa0F4TjF6N2VKZlB0Ny1HZDV1eUxma3B1T0ZvV01Rd0QtSVNGZ2d5anZab0p2TlNlWG1WZFR1ZjVjMldKQ2J6UnZJWU5KYVR2OFE",
        "reply": {
            "author": "Twine Holdings",
            "content": "We recognize this represents a change.  In order to continue to add new features we are sending traffic over our proprietary network. The functionality is unchanged and MobileDay doesn't monitor or record any user activity, voice, or other call content. Please contact us at support@mobileday.com so we can better understand your security concerns.",
            "date": "June 6, 2016"
        },
        "star": 1,
        "title": "Used to be a wonderful app."
    },
    {
        "author": "Michael Tuckman",
        "comment": "Love this app - devs are responsive. BUT I am having the same problem as reported by another user - calls are being routed thru another number now and can't find anything in the settings related to this. I CANNOT route company calls thru an unknown number!  UPDATE: Just got a reply from support - explained that they are routing the calls thru their proprietary network to provide superior call quality - by adding another provider in the mix? In what way? Only explanation is they are monitozing this by tracking analytics or call activity?  Moving onto another app - don't like the way this was handled - too bad too. Thought the app was pretty good until this...",
        "date": "May 31, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSEhtckluYjQwX01UUFRVaHVHcWpQcEhQQWFqUU5XRkpZYmV1V05iYm0yWGMwMHBkMVBYTXJuTFFnS1pxOWdmbTl2a0wyUS1FOHdkUFlZWHc",
        "reply": {
            "author": "Twine Holdings",
            "content": "We are not monetizing call analytics or call data.  We are monetizing traffic sent over partner public telephone networks.  This allows us to continue to expand features and make the app available for more users for free. Neither MobileDay or our proprietary network records or monitors any user activity, voice or other call content.",
            "date": "June 1, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Mike Cancell",
        "comment": "New release no longer works correctly.  Webex pin is no longer picked up from your cal,  meaning it's basically useless.  Also,  now all my webex calls seem to be getting routed thru a number that is different from the toll free num in your appointment.  I use the paid version and now it's broken and useless.",
        "date": "May 31, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRmV0LWlqbVJrYjJTS2pyZXV2NnhjN2dtLXNvXzUtN0prOEdoZlUxdW9RM2lqOG42a3lnT3NFMEpfMk5oM09jUlBXTTVrTDVSV0tRbzNyaGc",
        "reply": {
            "author": "Twine Holdings",
            "content": "Mike- please email us at support@mobileday.com and we can go over the unique issue you are experiencing.",
            "date": "June 1, 2016"
        },
        "star": 1,
        "title": "Big setback"
    },
    {
        "author": "Ayman Husain",
        "comment": "Since you all started routing calls through South Dakota I am unable to use my personal ATT conference bridge with ease. End up needing to launch 3 or 4 times to get the seamless experience. You need to revert this feature and not require all calls to go through mobileday. Otherwise a fan of this but if this isn't fixed I'll likely have to discontinue using. I was a paying customer so if you need to undo this in lieu of paid I rather so that. While you brokering the call may be useful of functionality is lost that's a step backward.  Update: support provided temp fix and now working as expected. Thank you for contacting and enabling the work around.",
        "date": "June 18, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRzU0cnJDWnRYX2o1RXY4cTZIZzZpejU4OU41QWNCbWs0clktQS1COUVJUkwyUEItN0NtXzJkSnRzbi1PbTRrYS1vVnFYUklpUVN1WmlHdnc",
        "reply": {
            "author": "Twine Holdings",
            "content": "Ayman- please email us at support@mobileday.com so we can get this working for you seamlessly again.",
            "date": "June 13, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Curtis Kowalski",
        "comment": "I am not using a third party number to conduct company calls no matter what. Greedy company that was charging subscription for a simple app, now trying to make more by routing calls through a strange phone number. No way to opt out. I can't use it - in this day and age my corporate security team would fire and even sue if one of this company's employees breached security and listened in to a call or tracked data about it. Folks my company phone use is PRIVATE INFORMATION!",
        "date": "June 13, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRTlkS0dlSXJNal9kWXJrVmNYSkRmUnAtMUprOGZZN245NVo4RWdicnREblFjY0x4VnRaakwyM1gzTXpiODlLdjd6MkYzeWtFOWNjLXF1Mmc",
        "reply": {
            "author": "Twine Holdings",
            "content": "We recognize this represents a change.  In order to continue to add new features we are sending traffic over our proprietary network. The functionality is unchanged and MobileDay doesn't monitor or record any user activity, voice, or other call content.",
            "date": "June 13, 2016"
        },
        "star": 1,
        "title": "Unacceptable - will be finding or creating a new dialer"
    },
    {
        "author": "Jim Cawley",
        "comment": "Used to love it.  But now all my calls to toll-free 800 and 888 conference numbers are being re-routed thru South Dakota toll numbers.  There was NO warning or explanation for this.  I am paying for this app to dial the toll-free numbers as they were put into the app - , not charge calls to South Dakota.  Seems very sketchy now - no longer performing as sold to me.  The SD number has been removed - now showing it as the 888.  I had complaints on calls from other call-ins over the quality the first couple days - have not had any issues noted since then,.",
        "date": "June 13, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRmVRWGFBc1B0NHgxa1d6UmRKM2FjUE94RWctSGpzSlp6a3JVVVZCRzNzNjFCUzhxakRnR09VQmd4LU83blVrb3JQMXItNC1VaFFkQXdvUHc",
        "reply": {
            "author": "Twine Holdings",
            "content": "We are not monetizing call analytics or call data.  We are monetizing traffic sent over partner public telephone networks.  This allows us to continue to expand features and make the app available for more users for free. Neither MobileDay or our proprietary network records or monitors any user activity, voice or other call content.",
            "date": "June 1, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Clay Williams",
        "comment": "I hate to say it, but I'm disappointed with the recent change.   Dialing a long distance number to get Mobile Day to join my conference bridge instead of dialing the toll free number direct isn't acceptable.    Mobile Day has been a great app for a long time, but this change essentially makes the app pointless.   I can't justify the long distance calling when I have an 800 number available for my conferencing, especially from my mobile phone.",
        "date": "June 7, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPR2dIM2E4eTI4UFZFQmxiNHA3eGpfVXhaczZfNjF6UzdTYlVmeU1XV1BReUkxd2l5bDItdjJlT3JtclY2RUhwbEFXaGdiYzJ5WllNWUc1aEE",
        "reply": {
            "author": "Twine Holdings",
            "content": "Our users told us that they wanted free, unlimited use of MobileDay’s one-touch dialing functionality.  Most of our users have unlimited calling on their calling plan.  If this is an issue for you, please email us at support@mobileday.com and we can look into your unique situation. We will work with you to ensure one-touch dialing into your calls.",
            "date": "June 7, 2016"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Julie McPherson",
        "comment": "Help!! My app doesn't work anymore with my conference number.  It only worked randomly before, now not at all.",
        "date": "June 6, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRWtsVzJhRlNlQngzVDV4ZHljektmR09NUnBrcnNrLVVRQ0ZFZ1k0YVZnUkp2ODFrR3FDbEJQUE1TVWQzN1FHcTVqWGowQnhNNXZuZDN2Z2c",
        "reply": {
            "author": "Twine Holdings",
            "content": "Julz,  please email us at support@mobileday.com and we will get this working correctly for you.  You can tap \"thumbs down\" when the app asks you \"how did this call go?\" and it will forward the invite to support for troubleshooting.",
            "date": "June 7, 2016"
        },
        "star": 1,
        "title": "Routing of calls through south Dakota not working"
    },
    {
        "author": "Eric Axelrod",
        "comment": "Been using MobileDay since the early days.  I'm never going back to manual dial-in again.",
        "date": "June 18, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRlA1R3BPRHFZM0M2LXU5Wl92U0ZuTnBQRlNvakFybEF1U2ZtNFZHYktpMEpTZ04yQWpscDlqTFF1b3Nsc1M3Q0t3MmM3YmExcW9rSmZNNXc",
        "reply": null,
        "star": 5,
        "title": "One touch calling into any conference service"
    },
    {
        "author": "dae lee",
        "comment": "Don't know why they changed what was working so well.  Now I have to look for an alternative.",
        "date": "June 14, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSDBmaWFubS0wLVpxXzY0bk82eWFvWmRaWHB3UU55VWxsRkF5QmU1TDRVZmFpZjYyUmJkbWFhVEJ4QktIZkViMUwxSzdZRWRRVWN3ZU56Y1E",
        "reply": {
            "author": "Twine Holdings",
            "content": "Dae- please email us at support@mobileday.com and we can get this working seamlessly for you",
            "date": "June 22, 2016"
        },
        "star": 1,
        "title": "Used to be great"
    },
    {
        "author": "Usen Etim",
        "comment": "Love ir",
        "date": "June 17, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRUtMY0drX1hVYVRZZ0JzRnVHaEtVM3dTc1BOazdMcFJoRWM1THd2RjhZbWx2cjgwSnZITlFKVEdablktSWdGZTgyM2ZKNWpqYjBacjVGZ1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Micheal Breathnatch",
        "comment": "Dial my meeting is much better.  This app very often dials the wrong number or conf number, or sometimes forsnt even attemtp to dial.  I end up dialing in manually 30% of the time",
        "date": "March 31, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRmN1cVctdzB4c3BlZEM0UU5iZzhFU3ZTM0ZLTU1aSDk3REFpYm1sSDY0Y3pjMUFOcFYtSHBOeWptSkJ0ZHBCNnFZZXdSMk8tMDMxOU9uWHc",
        "reply": {
            "author": "Twine Holdings",
            "content": "Michael-  please email us at support@mobileday.com, we'd like to troubleshoot this with you further.",
            "date": "March 31, 2016"
        },
        "star": 2,
        "title": "Many failures"
    },
    {
        "author": "Nathan Heck",
        "comment": "I used to love mobile day but now they are routing my calls through their proxy instead of allowing me to dial direct from my phone. That is BS. I just want mobile day to work the way it did. Let me pay my yearly subscription for it to work like it did. I never asked for free unlimited one touch dialing so you can proxy my calls and collect analitics or spy on my calls. Time to find another solution. It was nice with it lasted.",
        "date": "May 27, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPR29RZEZhODV1QjZ3M09tZllZMVRkSFNpbGpWX0RFWGhxU2ZqUFE5QWJ6djJpS1dOXzdYa3ZGR3RHTnRCMXpudHgya2hpSGNsNm5BQ0w5YUE",
        "reply": {
            "author": "Twine Holdings",
            "content": "Nathan - please email support@mobileday.com and we can explain what is occurring here. Rest assured:\nYour calendar and contact details never leave your phone.\nAll parsing is done on your device.  \nMobileDay doesn't monitor any user activity, voice, or other call content.",
            "date": "May 28, 2016"
        },
        "star": 2,
        "title": "Proxy"
    },
    {
        "author": "Roger Martin",
        "comment": "App does as subscribed but can't always do the pin number for the meeting. Overall good if your on the go a lot",
        "date": "April 27, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRXRPWjNWQnR4cGNUZXhsR0J1ZHl2S3JqeWNwVUh0emJzSVo1SGZ0dDdXRzdTMWt6eU9JRkdBQlV1TGlUdkVfb3Q4dHVEWjBtZWtkcFFWcnc",
        "reply": {
            "author": "Twine Holdings",
            "content": "Roger,  please tap the \"thumbs down\" for any invitations the app doesn't join correctly, we will test and correct the dialing sequence the app uses.  A quick and easy fix.  Or you can email invite to support@mobileday.com .  Thanks for using MobileDay!",
            "date": "April 27, 2016"
        },
        "star": 4,
        "title": "Quick to use"
    },
    {
        "author": "Victor Arnold",
        "comment": "Handles all my work calls",
        "date": "April 12, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSFNQS29KTm84anUwNU1fd3RNcm5FOHNERGJFWkpoWWJTX2FKQ1dqWmp6N1lxSFhDOEVrN0lYTXgwLUliUk1YdVJaOG52RklJSFAxemdZUkE",
        "reply": null,
        "star": 5,
        "title": "Great app daily user"
    },
    {
        "author": "David Andrews",
        "comment": "Why was my subscription cancelled in the middle of the subscription? Then it says that it's good until July?  What's going on??",
        "date": "April 15, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSHRMZ1BBR2lNd2tZTGl4X25jNlVMeGlHNjBWOHRPZVBhbThpTmVYeW9SQ1dHWGMtZzRqeDFhdW1LTmVkZlZMdnppVXRsTjV4MzV6RW5oX2c",
        "reply": {
            "author": "Twine Holdings",
            "content": "David- We are making some changes to our pricing structure and a subscription will not be required for unlimited use of MobileDay for joining domestic calls and online meetings. We will also be introducing some great new features soon.  Don't hesitate to email support@mobileday.com with any additional questions.",
            "date": "April 22, 2016"
        },
        "star": 3,
        "title": "Cancelled????"
    },
    {
        "author": "Trey Moore",
        "comment": "You would think that a developer would recognize the people that helped make it a success by at least extending the original subscription price for another year or by offering a significant discount on the new version.  Rated 4 because it isn't flawless. Have to join calls from the main app. The reminders don't  always dial in.",
        "date": "February 5, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRjVGTEJkd1JmUk1oRHI5MktNNzNfeFFNbF8tSFJQVTFJYUU4UllMcGtqcG04OFc1ai1kaW5PYzhXdi12eFJ3WmxKN25udlBSUDBncV9uc3c",
        "reply": {
            "author": "Twine Holdings",
            "content": "We are making some changes to our pricing structure but your past subscription is still valid and will guarantee you unlimited use of the MobileDay app and priority Customer Support.  You will be seeing some awesome new features in MobileDay in the near future!  Don't hesitate to email support@mobileday.com with any questions!",
            "date": "February 5, 2016"
        },
        "star": 4,
        "title": "Great app but my subscription was cancelled"
    },
    {
        "author": "Linda Danziger",
        "comment": "UPDATE! Why was my subscription canceled?? I've been using this for years and to cancel with no notice or ability to renew my subscription??  Looks like I'll be finding a new app for this! With traveling, and making most conference calls from the car this app has been a lifesaver!! .",
        "date": "February 5, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRmExX1hXRk9jblFPbE9QVmJmZmY2NGYxa0Eta1E3bWl2dzl6cHhQMWV1Z1ZfN2RycUZLWmsyaTF1QzkxS0RQckJsZ3JzQl93Tk51SEgwMmc",
        "reply": {
            "author": "Twine Holdings",
            "content": "We are making some changes to our pricing structure but your past subscription is still valid and will guarantee you unlimited use of the MobileDay app and priority Customer Support.  You will be seeing some awesome new features in MobileDay in the near future!  Don't hesitate to email support@mobileday.com with any questions!",
            "date": "February 5, 2016"
        },
        "star": 2,
        "title": "PERFECT APP.... Almost... Needs a widget!!"
    },
    {
        "author": "Douglas Hackworth",
        "comment": "It was great for a couple weeks. Then all of a sudden no matter what I did it kept calling a South Dakota number and putting me on hold. I rebooted the phone but to no joy. So now I have uninstalled it from the phone",
        "date": "April 21, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPSEE5SDV4YWJ1Q25fNjNtS0VzNG00ZUNJWjBUOVRGcG1YU2E2SGdYZlZ2b194ckZobzlpVGhfSkpSQXFzZW9TQjZJSWR1LU9STGZPbkM5REE",
        "reply": {
            "author": "Twine Holdings",
            "content": "Douglas- please email us at support@mobileday.com and we can help you with this.",
            "date": "April 22, 2016"
        },
        "star": 1,
        "title": "Got weird"
    },
    {
        "author": "Krista Swanson",
        "comment": "App used to be great until recently - when it stopped automatically clicking through to a dial from the alert screen. Also, you guys should have given your subscribers a heads up before cancelling all of our accounts.",
        "date": "February 5, 2016",
        "permlink": "/store/apps/details?id=com.mobileday&reviewId=Z3A6QU9xcFRPRWlSYVlFZS1RcHBLc0taQUV0eDdxUU1WVHFSRk5HOXVMclVLaDNxUGQ1ZDg5bVBQT0ZMT3QxREpJcTVsOHVxWUJCYi1hZ3BvdDNwbFU1Y1E",
        "reply": {
            "author": "Twine Holdings",
            "content": "Krista,  please email support@mobileday.com so we can troubleshoot the notifications issue you are describing. We are making some changes to our pricing structure but your past subscription is still valid and will guarantee you unlimited use of the MobileDay app and priority Customer Support.",
            "date": "February 6, 2016"
        },
        "star": 3,
        "title": "Ugh"
    }
]