[
    {
        "author": "Doug Lussier",
        "comment": "App is a great idea, but doesn't seem to actually do much. Despite there being dozens of interesting food places in my town, the closest one it shows is almost 50 miles away. There are dozens of interesting historical places and sites with neat architecture in my city, none of which are listed. Not sure if this is something that's being worked on, but for right now I don't see a point in using this app.",
        "date": "June 17, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRk9xaTB2ZkdKN25wNWtoSEE4bVNuTm83SWRFRTBvMk1XYTljcl9jdGN1bWtUUWZ0clZqakRUQVdTYi1sY1cwdWttVl9Cd1V2enpBNVdHZVE",
        "reply": null,
        "star": 2,
        "title": "Okay"
    },
    {
        "author": "Brenden Evans",
        "comment": "I am going to be moving to Hervey Bay soon, and I checked the area I am moving to,  however there is apparently only one thing to do in the area, and that is whale watching.  Surely there must be more than just that, as the area is a major tourist destination which I agree is famous for whale watching,  however it is also the gateway to Fraser Island and the southernmost point of the Great Barrier Reef Marine Park, which is renowned across the world as a major tourist attraction.",
        "date": "January 30, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPR2dsZ0ZMdldWb09yRWdicWgzU1JobUxPR19UNXJjSnRHZkIyWU4taFlpUEJlM0Z3RXVkNVdYUmJrckhZOGJMcXdVZWpUXzJCNGwwRXBiNVE",
        "reply": null,
        "star": 2,
        "title": "Not enough in my area"
    },
    {
        "author": "Eccentric Luigi",
        "comment": "I really really love this app and I had it on my old phone perfect ten. But after installing on my new phone it is worthless. I understand the need to make money but I don't want notifications saying business are near by. I know i can select another category but I want all the categories except shopping. Make them tic boxes instead of all or nothing choices and this app is an eleven out of ten. Thanks for all your hard work nitanic labs. I love all that you do.",
        "date": "August 9, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRU9TY3pOZl9vUHI3VXVtRllvQWlQRVV1dW1aaExIczF6SmxramFzZmpTUzljdDg2ZmxjTzJHNF8xRXlFLS0wNDQyNUFEQjJZZTFMRi1KQlE",
        "reply": null,
        "star": 1,
        "title": "Loved it with one fatal flaw"
    },
    {
        "author": "Paul Lewis",
        "comment": "This didn't show anything but museums if I used the manually entered location. Once I turned on location finder on my phone, it started working. It seems to be missing a few restaurants and drinking establishments or places for fun in Plano and the Dallas Metroplex. But, I think the app is just passing what it gets from the Internet from Google and other places it uses. This would be useful as a general locator of these places for a new visitor to the area. I will start using it and update my review.",
        "date": "May 21, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRmlNaVZIN1gyT0dubmo5WU5JOEkxZHc2Ul9nV1BKdVEwSkJyVWs1MURiYlVzTllqSjNqVlkteEN2QWVvZnBKOGdNNFIyc0Y0RHBPNkYyZ0E",
        "reply": null,
        "star": 4,
        "title": "Must Have Location Turned On"
    },
    {
        "author": "Peg Ritchie",
        "comment": "I live in a big city and was a little overwhelmed with so much information.  It would help if it could stop the repeats.  Also, I think it's important to add the ability to zoom in on those very small photos and increase the size of the font a little.  I really enjoyed the app.  It's a wonderful learning tool.  Unfortunately, I just don't have the time.",
        "date": "October 25, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRnpaaDA5R3RzbXhQV0F2TUd5RVBfaWV0V25xem5vXzZ6Q2ZYZmJVaEZkLTZxam1nX0duek5QUnZ2Sk1zZWxIM2dta1QtdmxkTS02UVlFTWc",
        "reply": null,
        "star": 4,
        "title": "I love to learn history, but"
    },
    {
        "author": "D'yani Wood",
        "comment": "What a great idea! I am learning any tons of new things about my city. I don't live in my hometown (or state) so this gives me the interesting back story I was missing and makes it feel like home. One thing I am not sure how to prevent is tips I've already read being suggested.",
        "date": "August 4, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSHpId1V4R2NfTFNwYzJaMHluM0FaNlhWMjRqNGhzMm5iNXVuYjNad0xyNjBtR05xbldrcS0wd0JRY1dieXpGcEZfakZjbTgtUWY5d1FQUVE",
        "reply": null,
        "star": 5,
        "title": "So fun!"
    },
    {
        "author": "Daniel Quinn",
        "comment": "It's using a lot of different feeds for info, but doesn't allow you to disable any of them.  For my use case, I'm only ingested in the obscura and this app is full of pointers to typical tourist traps.",
        "date": "February 22, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSHV0bTJlWW9kbFBFczZqMk5QUHRmSHc5RnB5SEIxWUdPQlFtY0twbkZlV3d5NTBHMllER0tMbll6cUZvcG0xTmpQY2FDeUVaVkZSVk9mUkE",
        "reply": null,
        "star": 3,
        "title": "Need to be able to exclude sources"
    },
    {
        "author": "Cindy Lloyd",
        "comment": "I have to agree with Melissa Jensen on this. It's a great idea, but not fully organized yet. There are plenty of locations not mentioned, and there are plenty of junk locations that are there instead. Also, they've partnered with a number of different web sites to bring this information to their app. Great. Why can't I pick one of the partners and only view theirs? For example one partner is Food Network. Why can't I view only Food Network's cards? Also, if I'm on blue tooth, I shouldn't have to tap read aloud. If I have a blue tooth it should automatically read it. According to the help page, it says I have to tap it. No. I'm really a bit disappointing. It has potential, but needs to move forward with better options and locations.",
        "date": "July 8, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSENGcXYzR09oUnViZjFLbksySF9LS2V1cG40ck53OS1DamFlOWRYRzlkNXktakE3VWx4VjNGU0EzYkxkejdma2VuanIwb3p3NlhsSF81eFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Rebecca Whipple",
        "comment": "Was ok until I tried to share cards. Faulty link so no one could open them. I'm a trucker so I was hoping to share some of the cool places and landmarks I pass with my friends and family. Very disappointed that I can't. Still cool and interesting cards, but overall does not do what I wanted it for.",
        "date": "December 9, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSGlxRjdLUTNOUkhqS3lDV1RDN2xCNFFEYlpNNXNsTTl4ZGRVbzN4NDA3VmJlZnVKU20ySEp1YTNBMVd0anN0QWg1azk5a01ZTWx5ZmZpUnc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Andrew Geocaris",
        "comment": "It's a fun app because it just runs and notifies you when you're near something interesting.  Of course, you can pull it up and search manually if you like.  you can filter out things you are not interested in.  My only issue is that a lot of the things it recommends pull up articles from several years ago.    This is important to me as a I live in an area that has seen a lot of growth and development just the last couple years, so current information would make this more useful.",
        "date": "May 26, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRjc5bnpOSU1udFZqNG9fVllRY2dEZm85OHZDMWd3VFpwbkNMaHhnT0puVDhsakxzclVRSXpVM010NWV4VGxqS2hZS2QxY2hUUzZZcXVJMEE",
        "reply": null,
        "star": 4,
        "title": "fun, but not always the most current info"
    },
    {
        "author": "Kevin Pittman",
        "comment": "Request: Pinch Zoom on photos. Would like to look closer. P.S. Settings will resolve most items I see in some of the negative reviews. Take a few minutes to adjust it to your liking. I have it sailing along smoothly and really enjoy it.",
        "date": "July 4, 2017",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRzJqSFRnTF94RDZhTzYzWXh5RGtTLTJ2UndKY09FblJhRW8xekhRMUN3RDJMc2hKLWdkUWdzbUVRN3VUM2szTzhLNlNybkFYT3JaUThnUWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Eric Stephenson",
        "comment": "turned off all notifications. wanted to check areas manually when I felt the desire. even though the settings notification boxes are unchecked, I still get them every so often. I don't like this app running in the background when I'm not in the need of it. Uninstalling cause of the Phantom notifications.",
        "date": "August 24, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRmRXdlpwTjBOUHhOUGVpWUlVZUN4QzI3X19iVzUzMTVDLUlRY3hEeklia1FsX0EzUEo0ZXprTUVwdkQtaURQc1NtdHZTc0IzZzV3dW1IbGc",
        "reply": null,
        "star": 3,
        "title": "is informative though still notifies"
    },
    {
        "author": "misti delpho",
        "comment": "I downloaded this app expecting something different . Unfortunately it is nothing like what I thought it would be. I clicked on the unique button and the only thing to really come up is restaurants and bars. I am in the Dallas Fort Worth metroplex and I'm sure there are some unique things around here, in fact I know there are. I have found them on my own plenty of times. This app has good intentions but I personally feel like it is just taking up space in my phone. I am uninstalling now.",
        "date": "November 7, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSE93N0VoRG4xZEtoc2ZBVFhOYmlrWTBwajdGdHhLclQzZEdFZFNUQTQ4M3pqRXZUZEhpTmwyNXVPSGJXUU5IOUtZSkZWNzhoTmVwZ3V0MFE",
        "reply": null,
        "star": 2,
        "title": "App has good intentions"
    },
    {
        "author": "Parta Sweggarz",
        "comment": "Could be a useful app but my first impressions were not great. Out of the first half dozen locations I tried two were inaccurate, one was a mile out and the next by over 20! It's only going to be of use if we can trust that the information is correct.",
        "date": "November 15, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRlBjT0RkSWFsNkUwSjRRWWtIUUduY0NnSk1mWnVGM2hmQVhxX1BTMUV5UjVkUWxXTWFBQVRDemtTdkZaT0JzanZwa2s0YVBRZDZ2NW82bXc",
        "reply": null,
        "star": 2,
        "title": "Inaccurate"
    },
    {
        "author": "Gilbert Barragan",
        "comment": "Lost a star immediately for the inability to zoom in on pictures. Possible more star reductions as I explore the app? Edit: After deleting the app for a year, I decided to give it another chance. Notifications are off, yet I got a pop-up ad about a local hotel. Down to 2 stars now. Deleting it again if I get another. Edit again: Deleted!",
        "date": "January 12, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPR2dJUzU2c0pBbWd1NkVQZUVBNWFzbnFIUDdjXzhJV0g5c2hUZ3d1VEh5bzJBNFlCSDJGVmxteFdkOEFCR0JReUNBR2tmZmtFWXplUm9NWHc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Shawn .G",
        "comment": "I remember the launch of this app and tie-ins from travel/history/culinary magazines and sites; selectable sources. I haven't travelled in a while but thought I'd load it and see what was new: a lot less and what is there seems redundant. This feels more like Ad instead of the great tool for exploring the world that I remember. (Seriously, no \"Food, Drinks, and Fun\" within 100+ miles?)",
        "date": "August 10, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRTNENGtnbFBtQzY4Y1FYcmNJZEw2V2xPYTBNcW5meXZjdVhXLTBzbDl6T2tqRnhkd1JDRW94WGRwcEwwY2E3ZWhqT0I2VXFBcXVuenl6SVE",
        "reply": null,
        "star": 2,
        "title": "What happened to Niantic?"
    },
    {
        "author": "James Stillwagon",
        "comment": "Many of the articles in my area have the wrong location. I can report a problem and say that the location is wrong, but it doesn't have an option for me to report the correct location.",
        "date": "June 12, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRkxKTGVoWkNWNEVmcU0xRkFOUkUtUzBCdko4YzVhajZhUWQzaTRkaVZMQ19wSWFza2w2UlZvZUNDTWRWT1A3UlFTMnJLaEhkTlpoamlBV0E",
        "reply": null,
        "star": 4,
        "title": "Nice app, but users could help improve it"
    },
    {
        "author": "David Shaheen",
        "comment": "There are numerous historical sites and fun places to visit in my town, yet this app only has two across the entire county. It missing a crap ton of things that would be \"field trip\" worthy and there is no way to add them to this app for people to find. So it's pretty worthless.",
        "date": "July 9, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRVV0QnlKR19FdXZpZ3VkNUFZOFpmbkJyRnNyZ1ZnbVV6WENvYzVGaFhXa1p2MjhYaUZpQVRTOUpyNjA5Mnd4TGw2ZE51bEdMT2RZamR1V2c",
        "reply": null,
        "star": 1,
        "title": "Loads of things wrong."
    },
    {
        "author": "Jonathan El-Bizri",
        "comment": "This was a really nice app, back when you used to be able to disable categories and specific sites from showing up. Now you can only prevent active notifications from happening, and have to browse through the things you aren't interested in, like yoga shop and hipster bar reviews whenever using that app.",
        "date": "January 12, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRmpxaTBSejhZazhBaVZWTklqMXNTTlN6SE04U0VDdmwzM1FvWlVPWHVIaFhTdXdPTjlHUkVyTkZxX2F1VWJ6ZWY3VjNiODRiN2dDRkNfOHc",
        "reply": null,
        "star": 2,
        "title": "Removal of features made me uninstall"
    },
    {
        "author": "Melissa Jensen",
        "comment": "I love the premise of this idea, but it gets a little lost in the application. Found some great info on fun, unique sites, but it's hard to find those amidst the mass of information. Some really obvious sites were surprisingly absent, while you're flooded with pointless, unimpressive sites.",
        "date": "May 17, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSHBpSWxkMjlPQTFUZUdwejlhQ2lHYlN3NDNwR184R0hEVzBBRm8yWFY0dXE2cjJzaFlONjltcGgwV1QwVUpSbE1YYmc2VUVibEVfa3UtRWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Tom Marriott",
        "comment": "Great app. Me and my partner recently took a trip down Edinburgh down the  North East coastline in the UK and it picked up many great stories.   It is lacking something (or at least things I couldn't get to work;  1) I could not get the app to \"speak\" the article it found, This would of been much better than me having to read the article myself. I'm not a great reader and passenger. I'm sure the app is capable of talking so why couldn't I do it?  2) The app needs to follow the GPS so I don't have to keep moving the map as I go.",
        "date": "September 1, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRVpaUVZVbkgwQjFEcVJPbVNzZjRBRFkwU0tJX2ZWMW1UTEtNUF83TlVaUzV1bXZNSFpXRGRoekU5MWU1WU5HYnJvbkowdFVDak10T0RMWWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "I like the idea, but FT doesn't have enough sources to show anything in places I'm interested. I'm going for holidays and in the very famous city I can see only one shop with clothing and one quick info about a church, where I know there’s much more. Why not allow locals to add places for visitors? Generally it's useless in Europe.",
        "date": "July 28, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPR3hoNFZiSlVzZ2xpMGNKSmpJd1JOaVBpM2plckhhaGprZUptNmNCWmdTVmlJdUhsYnY5Y1lqWDhEeHFTa2dJdV92OXltbFFYOHlfWFpJSmc",
        "reply": null,
        "star": 1,
        "title": "Disappointing"
    },
    {
        "author": "susan shayne",
        "comment": "I'm in Malaysia but the app kept notifying places in Singapore. As if there are no hidden interesting places in my country. Uninstall immediately!",
        "date": "August 16, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRmYyWDdKbG9IR1dIU0xTQnJiTjNFOS1BWk5kekpiWlNDT19UTEJMX002VUs2UklrbnRrU2FWNURSN1BRUmFXYkFVRS1YTHFEeUM3RXBieHc",
        "reply": null,
        "star": 2,
        "title": "Uninstall"
    },
    {
        "author": "A Google User",
        "comment": "New user - interesting - but lots of content that points not to a location to see, but a book from Arcadia Publishing with historical photos - which makes this just advertising, not useful while touring. And a user interface complaint: tapping an item in the bottom scroll bar opens the item, but does not make that the active entry in the scroll bar. Some other item is highlighted in the bar and on the map, when you close the entry you selected.",
        "date": "June 25, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=bGc6QU9xcFRPRlJrU2UtOW1JVllUX2pfUHhXMC1ZWlYzOFFCdXluZFhCZ1NMVVdDSlQ5Z2t6SEM5OGRuaVNQTGtrTjJiNnFZcHBCdlV3RHJITU9VMWF3VHc",
        "reply": null,
        "star": 3,
        "title": "Advertising for a book, UI complaint"
    },
    {
        "author": "Sheila Scarborough",
        "comment": "Not sure why this app never took off in the travel space, but it's great for seeing what's around you, esp. historic & cultural stuff. Since it pulls from historical marker databases, you'll learn all sorts of things.",
        "date": "April 28, 2017",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSEZVNmZkeUJwclRydEpfdkU5LTN5QktOYWRBa1ItejNyc0VZVWNoUjNHU2JRei13QjFCSlE1OTBTbXdUVWVwTDc5bWhTOUVxaTV0NHQtV3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I'm confused. Maybe too critical, but what exactly did I just download? It's a clunky, useless clone of Google maps. You can literally barely move the map and the pull out menu doesn't work whatsoever. You guys nailed the concept, but the execution was a bit sloppy. At least on my end.",
        "date": "June 15, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPR3JLTWl2Vmtjb2Ewb1pGR2VkYWxCdzRqTzFVdktZMWJoeTBrakZOWFJmUHc4b0JfOVd1Q0FFOXRXd21oTlNvZmdJMjUzcDZYbzliTzdBVnc",
        "reply": null,
        "star": 2,
        "title": "This is an app?"
    },
    {
        "author": "Samer Hamad",
        "comment": "This all used to work great. It no longer sees any google account so I can't use the app's functionality.",
        "date": "January 21, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRUNoWEJoV3E2eHBwTVM1ZFRrRTMxRGlWVC1pYjcyMzcyc2tYYWx6UnF3SmdfRF9lLTZNUWhzUDJPdldpVkFHREI5aExoWFdxNnUzYVExOEE",
        "reply": null,
        "star": 2,
        "title": "Not functioning anymore on Marshmallow"
    },
    {
        "author": "Jessica Mollica",
        "comment": "We used this app to explore DC. Found some really interesting sites, from haunted mansions to underground tunnels. We learned so much more with this and it really made our trip way more fun! Perfect for those who want to learn but hate the traditional tour guides.",
        "date": "May 24, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRm9OcDg0V0k4SFB6VkpHQTR4cVVhOXVYZVlVUTFWTTl5NnlEUlE0dnRYVV9Ga1VXWkdxM1RUMVJsd0pucXZIVmdiZVViRzFQMFRCWDNxM3c",
        "reply": null,
        "star": 5,
        "title": "Great app for explorers!"
    },
    {
        "author": "Jeremiah Marks",
        "comment": "I knew that the area around me was rich in history, this makes it very easy to find and explore that history. I installed this and Ingress at the same time and have really started to enjoy walks.",
        "date": "December 4, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSC0wOUJhN1BCREJDbXdaMnFHSWduRE1MMW10cTdtZGRTaEk3cGdWY0EtYmU2M3A4WEVzeEVBR2NyZE5MMkViSUpLcTBZN1JFWlBBbEoya3c",
        "reply": null,
        "star": 5,
        "title": "Best thing since sliced bread."
    },
    {
        "author": "Devon Cecchinelli",
        "comment": "Apparently there's a national park a block South of csu. Inaccurate locations for points of interest and zooming means recashing everything on screen",
        "date": "April 7, 2017",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRkZwQ1pEOTF0OUZQQkVaY2FrUnBGNkZyYXh6SzRxR3RRNzYwVzdLU2xaRWYtRnR1bWZia0FHTmg3REo5VGxGQVY1cmRSX25RMGNFOWJLX3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Federico Guillemi Diaz",
        "comment": "Not working. There is no zoom, not able to select anything, I'm only able to do zoom in by double tapping but no zoom out. Worst app ever.",
        "date": "August 13, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSGVORDF6NFFnWGlFQmd3WlBpT3U4Y2pjb3dOa0RPR1hrUFJKTHg2TktnbDNBMmxOSlVHUkFvMjkxNXh0UE9Rcm45cndPQWI3dHo4R1M2MkE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Skip Regan",
        "comment": "So sad the text to speech button was removed.  It's basically useless for sight seeing on the go.",
        "date": "June 14, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRTM5UGswaUNPcW5mMTA3RDVsbTd2MGVCR054ZFBOMXBRQkZmYnEyQkRUdFhmREIzOWxka0szaExwWTMtNmFWQ1lwS1NBdWFDZ09ydDNxQ2c",
        "reply": null,
        "star": 1,
        "title": "Old version was better"
    },
    {
        "author": "Jaz F",
        "comment": "Doesn't even show you known attractions in the area. Random weird stuff pops up. You're better off just using Google maps. Uninstalling",
        "date": "January 6, 2017",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRkFkaTlMODNlQ3BhSHpidHFoZTNFMlFyMWZEekFqblZZSzVsUkpZODVoWjh4dWlxenJaNXJ6MjJVSDhKMWZ6MFdzTFl0X1RDS3NMdXFRZVE",
        "reply": null,
        "star": 1,
        "title": "Not good at all"
    },
    {
        "author": "Magnus Carlsson",
        "comment": "It's a great idea but this kind of app is no better than its contents, in this case not good at all...",
        "date": "June 15, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRUEzSjRPbnNIeEpGV0Q2SzdKeGVPUnFUeE5hRDJpcFZ1NjVrM09odWJ1cWFkaEJVZjZSTDZXT0w1cUdkS1dnWmZGTjFCbHVJcS1sMjFTM1E",
        "reply": null,
        "star": 1,
        "title": "Pretty useless in Sweden"
    },
    {
        "author": "Joe Manguno",
        "comment": "So far so good -- obviously a new app, so I expect changes will come, but the interface is good, and the concept is excellent (and beginning on the path to reaching its value).  A couple of things it needs is the ability to add content, or at least integration with the bank of Google Maps data that already exists. Secondly, it would be nice to be able to create \"tours\" for other people. Perhaps those thoughts come with their own liabilities, though.",
        "date": "July 15, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRWY2MU52T0txTHdxYUJyRGE4NHplcVNDdU9QZGExdS0tT0JDQ2c0OGptOWNZWXRYazYzbjhPOEJVWTQwcWU0TTUxNGlBS3NzVjZWZ3Jpcnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Nunyur Biznez",
        "comment": "First, there is a glitch on the map so that it does not allow me to move the view any direction but up. Second, there is no zoom function on the map. Third, it provided nothing for the entire metro area I live in. An area of over one million and no history, cool stuff....nothing. If this app is only functional for certain areas it needs to say so in the description. Deleted within 10 minutes of installing.",
        "date": "June 8, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSGx1aUlRb3FXMGZUX2l3TVMzQVN3WEhCZ055Q0htbnlDNW5pMEJ6WlgwMDNWQzZvX216R242M2x4VE4xelRJbHpubEdIUExIa3pCQzRucGc",
        "reply": null,
        "star": 1,
        "title": "Useless"
    },
    {
        "author": "Tex Ritter",
        "comment": "I love this app, i am always curious about the history of things around me. I have learned things about the area that i grew up in that i never knew existed! Thank you!",
        "date": "October 6, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPR0NRajVvU2c1MGdiWl96c3pacDM4bWloTFd1cXdKVFdRSHVOVXZSQkxlZjA1RmpITGFUOVFuTEttWXFkRXozdDhiSjBEb2hlYW52b0EwbHc",
        "reply": null,
        "star": 5,
        "title": "Awesome"
    },
    {
        "author": "",
        "comment": "The app is a really cool idea but not many places seem to be on it. I would like to see more secret cool shops and maybe small landmarks, instead of many old photos of buildings that are not even around anymore. it's a cool idea but needs to be rethought.",
        "date": "September 26, 2016",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPSFhld0xpTUJaUzBaNHdzbGExb0lWVEI2RlBqUTZWamtxS18tYkJWSjNGelVFWFYtQllnZHpCMVlQcEFDb2lSR3JnZm5oT29aSGZPS0s4dlE",
        "reply": null,
        "star": 3,
        "title": "Neat idea but needs to be upgraded"
    },
    {
        "author": "Paula Henry",
        "comment": "I liked getting the notifications the first couple times, right after I first installed it, but find it impossible to turn it off. Fine if you are on vacation and looking to find something of interest, but annoying when it comes up all along your route to work.  And I've attempted to uninstall it 5 times now and it won't uninstall.  I wanted to take it off with the thought of reinstalling later this month when I am actually going to be on vacation.  Now, if I can get it off the phone, I don't think I will ever put it back on!",
        "date": "July 9, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRktuS1VETFRnYjN6aktBX1BNZGJLcHpMZ2hGZ2Nsbm1OMTU2dG5WaEJCakt2cTdQSUFYbm1qYXNPc2FPOGtEZWN0TzVGY0l0OUFVWjBVX1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Steve Bigley",
        "comment": "I work in San Franciscos Castro district at a well known and established bar, but when looking up the Castro only one bar shows up? Obviously we and every other bar in the neighborhood failed to pay to be a part of this app...this is more like an add filled tourist guide like the ones you get when you checked into a hotel room!",
        "date": "June 16, 2015",
        "permlink": "/store/apps/details?id=com.nianticproject.scout&reviewId=Z3A6QU9xcFRPRkNLUmRiZEFZZ2J1TUZGTER1VnJFQ1EzdUw2Nlg4R2htZC1mQk5nVUkxZllSOUpOZHhJbjhNeDVjVWRYV2ZXUlk2elMtTWI1SXpmdS1STGc",
        "reply": null,
        "star": 2,
        "title": "Uninteresting and paid for locations"
    }
]