[
    {
        "author": "",
        "comment": "Excellent calendar app! Have used CalenGoo since 2013 to manage my total life. My database goes back to 2004 from Palm/Outlook. Local calendar and ics file backup works perfectly. My first and only problem surfaced in 2018 on transition to new android 7.0 phone. Developer diligently worked and quickly solved problem. Much more flexibility in this app than I can ever use. 5+ stars",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRmRBT1lFRlEyX3dfanh2TEhQMTFZMFk0ejY5d19RaXdEV0tfUlA3TjRDQmVOcG1USmtwNXpxY1dvV1EyLTNLQTgwZ0pzMHVQYzZlcE9EZUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Richard Russell",
        "comment": "Best Calendar app by far, very customizable, used it for years and never had a single issue, just gets better with every update. The first thing I install on every new device. Excellent",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSHkyS1FoVE5uRWpaV0VsbjB0LXhhSFJJU2lPeFd6X3dtdkg5NlczbEZlUENlUDJQSFd2Rk40djN2U2NBTUVzenYycVJIY3ZLbkJpalFCVVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "John Apple II",
        "comment": "I've tried several other apps for calendaring to keep my personal and work diaries separate. This is the only one I've got so far that has stayed updated, which handles multiple time zones well as I fly between regions, and that let's me cleanly manage my own tasks. Dev, love the work, thank you!",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRWdVR2xzRnVHNjgzMGdja0xabFh2ZlFpMjU5enJBcW8tTzBKNnI4LUFvZzgxdV9nR2tDTUVFZEdydGowWWdXcnFJWDQ2ZlR5VlZSTEZPSlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Pauline Robertson",
        "comment": "Super customisable.  Absolutely no issues so far.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRnNtaWpEaG54RXByRVVUODl6My1sUDltSTY2NVVJTkZGTlB4Rk1pVmNNd0NwYUJKZUFocWNqaXN6ekpxN2s0bVVxb21GQTN2UENYaUZ0WVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Doug Kanter",
        "comment": "If all programmers built apps as beautiful as this one, the world would be a better place. You may initially find it confusing to customize, but that's because there are so many amazing options. Be patient.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPR0JFN1E0b2l6QmU0dDlmdHNueGxMOXJGMU95TE53UkF5TDJkdjd0LTZZTnVfanRnV1VsanltMDFoTWx3T0RIRWk2Nm5XUnp1Y0R0S2oyc3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lana Phan",
        "comment": "I cannot live without this app. It is super intimidating to configure but once done is heavenly to use. Has everything I could ever ask for",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSHQxTXZJUURkVWxhb2hBdGRIQ3BLMEpybG4yRVlDeEYxZTgxUDVBNVRfVnVfdk50M3BWRXF0VEt6WHNEeUpKMHlyVTBOVWdxYXNCN3EwaGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Dark Knight",
        "comment": "This is truly the best calendar app ever, been using it for years now can't live without it.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSGJreXBBZHlMNlY1MnF3cG15VzBjRXp1T3o3QjlxSnlZTFpBTFBIcGlZX0M4NlByVlRJMHpubDhKSndzMjh0VjJwZXk2Z0pUNy10aEswaUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Peter Liley",
        "comment": "Very helpful 😀",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSF9ONEhrcXgwR2wzclVCaEZEcFpSc2FlZ2dLYlYwd0JNTExCVzFFSEJIS1c3NUxyZzBid2pKM2x1VGRNSXNIdm9hcWhqaG5iRUJTWTdxblE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Steve Lazarian",
        "comment": "Latest update with \"keywords\" works perfectly. No more manual color coding. Fantastic!",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSEdXSURMOGc5cGIxY2p3NnlGVFE0MmlTT2lYYTc4NkNUT3JYTGY4ek1GZHJFcC1NUzBxYnYwR2xXYmFkb0U0cUxDM2Q0cnNnNExOZVpiWlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ayu Ruhaima",
        "comment": "Use it every day.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPR25ZdVRHR0hvWk5zWHFWX2NSZDRvUWl0eW5CWEtfQno2dkJpbjZ0eDNTV01Qc1c4N3U1U1QtampIQmFEQ09WOGdRYnZpc1l5TWJMSG1RZlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I found it difficult to set up and theres a bit I'm not sure how to change, I know it can link with other apps, but some of those I don't know how to use or find to confusing. The fact that you can ulter most of it is great, and I wonder what happens when I change phones",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPR3hQT2NZeEdsNkRKTTRoVnlvY2RLVFp2YkpaY2JLb0RSUkJFVktRLTFsdEtCRGFvTE9teG9oY3FPbjU2UWFuUDRLbmQ5cXNPQW5DWnphZVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Just when you think this app can't be improved - BANG - author improves it further. My experiences seem to mirror everyone elses. It's simply the best calender app out there - PERIOD. If you use and depend on Google Calendar like me - this product is stable, and extends scheduling/viewing options like no other product. Super Responsive Developer - who seems to earn everyone's respect - one customer at a time. BRAVO!!!",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=bGc6QU9xcFRPR1pjSHdRaVFORzN5QUNqUEhGVVFrcno2dWJ2ZDlvUUgwX3A0dDlwRWVxMWhKOS05SG1lRlc1cEhjTDAxaHh0NGkycnJtZXlsclZfQ0FLLWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Calengoo keeps getting better. The Google search for address has become more streamlined and this better. It's still not a case of offering a Google search pop up as you type in the address field like Google calendar but you now just tap the search button and get a Google map window pop up to search in. In some ways this is better as you can drop pin for the address if you're unsure of the spelling. The android wear face is simple and functional too displaying events around the clock face. And first class developer support too. My current default app as a result of all this and much much more goodness. It isn't the best looking calendar but the functionality makes up for it.",
        "date": "October 3, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=bGc6QU9xcFRPRzJoUllQWHRyNmxDcmVWWUREWVpGU01id2RuNTF5NkU5YVJIRnV6VHdpRDY5ZktHVnMxOXpCblRBbmk4OVRNRXpnaVZxZGF2ZjBnU3AzY0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Darla Kaddatz-Knaus",
        "comment": "This app is perfect. Very, very customizable to the point of almost being overwhelming, but I love to customize my apps. I can tweak everything to look exactly how I want. Developers got back to me very quickly. Syncs flawlessly across all devices. I would definitely recommend to someone who wants a customizable, not-boring looking calendar app for all devices. I also love that I can make an event act as a task so it \"floats\" until I check it off. I have not been able to find this is any other app, and I have tested dang near every calendar app there is to offer. This is definitely a keeper.",
        "date": "August 15, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRmtXRU43Zm1ZTXlNT0tHS3BuNmZpbkhka0w4YU9wcFhmdzJYc2VCcW1FVEI2Q0VfMGhTRGV2eWh1NnliVDM0V3JSZXVTZ1BDUFRWWFk2bGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Grant Cooper",
        "comment": "Was working great. Sync no probs so all my details saved were seen by the office . Now nothing at all synces. Iv uninstalled and reinstalled still nothing. I havent changed settings. My work callender is main one. Over 5 pounds wasted. Very dissipointed as i loved using this app.",
        "date": "November 2, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRmxnQ3VPQkQzZ1BOQlgtQUs1Nk1kbmxnb2xIZmxibGpiZExyRHZxX09aUC1aSXgyMHp6TmsyTG9tc2dQb21Lc0s5NlJiMWRMOTJ3anBsb3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "S Walker",
        "comment": "Update Nov. 8, 2017: Installed on Note 8. Still love the app. Still wishing for individual obfuscation.  Update 8/26/2016 - all this time later and I still love it. Installed on Note 7 no problem. Had to use Helium to transfer settings. Samsung Smart Switch didn't port that over. Still my GoTo calendar app.",
        "date": "November 9, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSF9VektSOW1kQXJXcVByYkpVSEtzMXhlMHRaOWs4ZkZDRl9RU29IUXphdHI3Y29DeUJFMG5XYlFYQ3FldEtvTUFtb0RWT0NYOEc4aDJQeWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "S Ringrose",
        "comment": "I really like this app. But it has some serious issues. Multiple events don't show up. This is a big problem. My PT job is missing & a doctor's appt. I have futzed with several things, to no avail. Also, I can't find the tasks. Where are they?",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRUFSbmpKa0hjcnRaWlZWc3pSVWVrU1FDMzlBdm9oQ1h4NWlUQXVfWW9CSzV4UUc4NThmVXB0SGV1a0QwTkV2RmF1QkhBeFlQWXNaZU1xN3c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "I purchased this program about 7 years ago and use/rely on it every day. It is the best program on the Playstore a far as I am concerned. EVERY update had been reliable and has caused ZERO issues with my phone. I cannot say that about any other app I use or have tried, and that alone is highly commendable! I use the highly customizable scrolling agenda on one of my home screens, a monthly calendar on another, and a yearly calendar on yet another screen and simply could not imagine anything better. When I need to input a new appointment I can copy the original appointment as a new one, simply change the date-time-and notation, and save it before the secretary can hand it to me on a card! I could go on and on. These guys have done an incredible job with an impeccable attention to detail. Yesterday my doctor asked me when I had a certain test done and I had no idea. It was years ago. So, as I have done many times before, I did a simple search, and within a minute gave her the date of my last test two years ago, along with every other time it had been performed, and by whom, going clear back to 2011! She was shocked. Thank-you so much for the incredible job you have done with this app through the years!",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=bGc6QU9xcFRPRkhzczRQbUdhWXVDN1p0VWJJWUViMVVudmptX1RmNzZ6RE52OU9qVk9YZkhJQnprenppSk1ubkpHQWRSODJRcjNhSkMtQXBnOE5Ja2U3blE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "GoranB 1",
        "comment": "Super. Task list is somehow not properly displayed with bigger fonts.  Some color and font options are missing.  The month and agenda view are very good, day and year are difficult to see and operate.  But needs thing... CalenGoo is stable",
        "date": "July 9, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSG94aGl4TGRjdHA4UVN0VnlMa0FyRVhBdl9qeTM3TlQybk1ocE5UQU9ESk11dDU3Z0diTVcxQkxQTHUwSHp6RkxZMFdHZ2tlN0NHWkNTdHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Stacie Rees",
        "comment": "I absolutely love and rely on this app however recently the month view widget has frozen and sticks on the wrong months. Today is supposed to be highlighted yet is stuck on last a day last week. I've tried taking the widget off and rebooting my phone. The week view widget works perfectly. Please help",
        "date": "October 27, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSGRtOUVoa3VQQ05oN0lPU2FlckkyeWtRZkVMTXd5azJrQjF3aE9IdmdrN0tIWjZpbk4zOUdJSDZYay1YM251N1NCaDVMTEZSWU1maWRsOEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "If users could drag calendar events, on the calendar views, on quarter-hour increments rather than only half-hour increments, Calengoo would be perfect! For this reason, I keep switching back and forth with Google Calendar.",
        "date": "August 30, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRlpXa2NGeGJocGk2T3NMckp4UnB4M0x6bnd4SkhDSUJqaThoWVZldUdBWjJwNVJTNzFqa0txY2V3cTRON0ZhLWY0dnpKUGxQUzd5cEdjS0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "The option to turn phone silent during events will not allow the phone to remain silent if I am not in an event. So if I set the phone to vibrate when it is not during calendar event, the phone will automatically switch back to the normal ring sound.",
        "date": "July 30, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=bGc6QU9xcFRPRXhQa2c5UFdJMEdEMDBNQ3dNOU84czY5Q3ZZQjV5d2djRGxVeGdwSklQaHJxaTAzVV92LVBBN1gwOTNFeTlMSzA3U0NBVXhsZFExeGNZQ0E",
        "reply": {
            "author": "Dominique Andre Gunia",
            "content": "Have you tried to use the \"Use previous profile\" option? Please contact me at android@calengoo.com so that we can examine and fix the problem. Thank you very much!",
            "date": "August 3, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mitch Sayers",
        "comment": "I like the views, draggable event changes and duplication.  Meeting invitees is also important.  Stable, quick syncing phone to tablet. 1st class support!!",
        "date": "August 17, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPR2dBRGdMTUJhQUx5ODRGdmdRMHR0dGZjTDl1TmZwUDMzV21ldkVIcXBkMHdrQzRBRkx1QWpIY1JxWkhhTkNrM3J4dnZHcHMxT09kS2xkQUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Darryl Gillespie",
        "comment": "Dab! This app is so good! They thought of everything! I have a business and juggle 4 calendars all day long and this app is wonderful! I don't understand how it could be rated less than 5 stars. Anything or any option you may not like about this app you can change it. I keep finding new stuff everyday. They thought of everything. Just found button for adding current time and date stamp to the notes portion of an appointment: so handy! Again this app is the best. With stock Google calendar you can't even duplicate an event. With this app you can duplicate,  send as a text, email or delete an event so easy. Don't get me stated about the search feature. Awesome! It's the only calendar app that let's you search for partial words. If you only know the first name of the person in the appointment and the number portion of the address you put those two in the search field and it will be found. I have almost 6,000 appointments in my calendar and any search takes less that a second to show compete results. Again amazing app. I know I'll continue to find more things about this app that will make it even better but for now it's wonderful!",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRjJCNlJ3NXItbzVwOWk2Rks2aklMaU56UTFlU0VYRHAyMzhqQXlWVWZBaGRabVFHMVMwNHRGclVJRU0xYlNWdkNfOVBZZkZZTVpwdllMTnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "hailardri",
        "comment": "Have been using for several years on 3 different android phones. I have not found a calendar app as complete,  flexible, or as easy to use.  Easily syncs with Google Calendar so my wife and I can share busy schedules. Excellent!",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRUh6UHNSZGZIVUliS2RzQTZWRFV2UlNlVy1vR2c3ejVxY2t6WmJPWHBwWjdqa0pwekVoSEYzd21KNGxyNHJRemhiZm53WjZ3NW90Z1o5aFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "This app is excellent and the developer knows what they are doing.  This app has many features, but it also accomplishes the basics very well.  I'd give it 10 stars!",
        "date": "July 24, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRVRsN3Rpa3RqS3RmblBSOGJwRFpObEdmTXRIdDRuTUMxeWRvQjRUUXdNNG8xelY0VjRpZWRyckJMcWR6X0s5ZVJHS1hmWlp6dDJXTWltZWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Vinicius Thedim",
        "comment": "Stop searching and use this one. FLAWLESSLY. Beats all other agendas and I tested a lot of them since the old Palm.  Great support and a plenty of configurations for your special needs. It's worthy to learn and test the plenty of available time to preferences, although it works well with default preferences",
        "date": "September 13, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSFBtdVZ0dmMwdkNydG9UZHFBU2ZYR1RKVnVqQTN3RW81WjUxSnhkQ1Zma2paY05WSVpNLUNfbnVqTkFVVWhxTjhST1M3cFVMV0NzOVBkeFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Christine Tobin",
        "comment": "Omg a calendar that is super customizable. I think have finally ended my search. But the jury is still out because I am still  working my way through the app settings. But so far... Love it 😊 Nice job.",
        "date": "October 3, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRW9VRzJ0NHViY0MzV1Fnb3hVZDZlUFpVLUY2M1ZMY3lIZ2NicXl3V3g5eUpaeWRWNkI2c1hMaVRnNDd0cVlac3Zsem52TFVTM1lubl9HdVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I agree with every positive review.  Been using this app for many years. It makes the Google calendar work way better on a smart phone. Best calendar app ever.  Thanks!!!",
        "date": "July 2, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSEFqXzJuajVuUzBSVklfMmZPVy03TWprSEtKWGczTGJOc21mOGJOVDN4cEVDNUtYS204XzE1ckZTUk9zalRJMm1iOFJ2eXVnWVZvdEtmTmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "The Author of this app has clearly spent some time thinking how to design it, rather than just trying to do well what everybody else does. The result is outstanding.",
        "date": "December 7, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPR1VwUDZreGxwZDBwaEg2aXZwdlVwYk9OUmw5UFlkWXVxdnNjdkpuYmpycFJFN2w1ekhmaS0tMTMyTDlUTFhELTFpZW5ZYTNQTDAtTm9DQXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Romanticsman",
        "comment": "I have used this app since 2016 and love it! It has all the features  that a person can hope for in a personal calendar App. The  colour and font customization is second to none. It was stable and worked perfectly on my Samsung Galaxy S3 (Android 4.4.2),and on my LG G4 (Android 5.1.0), and ran perfectly on the same LG G4,  now with Android 6.0!",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPR2VnWFo5Z0t1SXJqMHV2T3J2N3RnOEN6VkF0cEFWMjl0SDhuWmc0eFFJQXctWVBscV9EeXg5c3hoLW82N2Q1aWhkalAxNmhjOGw2alBrenc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chris Peterson",
        "comment": "This is by far the most advanced, with the most features and functionality than all the others and I have been using electronic diaries for over 20 years. I have used CalenGoo for 8 years and I could not live without it. BEST ON ALL: DRAG&DROP! - TO DO LISTS-SHOPPING LISTS-CALENDAR-PLANNING-SMOOTH-PERFECT RUNNING-NO BUGS! If you had to only have one app on your phone THIS IS THE ONE!",
        "date": "September 2, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRlAwOUxzcTFxRTJINVd4TUdtY2htVl9UZFFQeWpYNVJTZ0drRm5aWVlqNURYYjJ6TGkwLWZScVlqUWdRcmREVDZJNmdVbk1XbEthR3loX0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Gary Lobdell",
        "comment": "10 stars !!!!  I've used this app for over 10 years.  It's the best calendar I've ever come across.   And the developer, Dominique, very quickly answers any question which I have in an understandable way. I also like that I can view and/or print multiple or individual calendars which only show the info which I want to show. Well done my Friend!!",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRUNVZFNSZXd1VVZiZzFfazNUWVhmdnc5dUdHSnFsS2xjUUpRSkZnM1c4QV9MdmZxeTlVT25UUzV3bkNmajF2M0lvcUlQenI4Vjh1dDZUWnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Gerard Spittler",
        "comment": "Best on its class, free too.  Clear, clean and intelligent layout is what I like best. Attractive design and very flexible if you want to be more of a power user, especially the way it articulates with Evernote ! Love the new print function. The best keeps getting better.",
        "date": "October 21, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRS1IaWcwOWt3Qlp0djJlbWdWcWxqMEtiVF9OWW5CMDlaVTF2Qm54MnplM1NkR3prR09WVFZhSEhSRlJnUWk1bmNpRTdDZ0haTkE4SFRKSXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jessica Mecklem",
        "comment": "Works great! The one main thing that I'd like to be able to do is change the size of the icons on their own",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSEpWZ25jSW5NR2VHZnBoV1E5V0FkVGc4ajNJN0laSDZpb3V2Y0hUbzBmWXRzQ19FQmM4LXZ3SFVkUUdGM3B6YlY2R0RLaU9YeFJNa0NnbUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Adam Szabo",
        "comment": "Everything is good except it doesn't sync with Gmail address book. When I make an appointment why does it only open my phone contacts? It needs to recognize my Gmail email addresses because that's how I can invite people to a meeting!",
        "date": "November 12, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRWx1bXBzQ2gtYS1odWpFb3A2ZmNUeVZTWE0xaFhfOU4xSEFEd3l5OU9DdktvRGVuNHpoei11djRva1cyMVpsYUROUEdxaFY2NV9LRDZHcEE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "The best app of its kind. The fact that it's so infinitely customizable is gold. The colour coding system really helps my ADHD!",
        "date": "July 7, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSHlqSmpGUjBaMm12dmlQc2FpcF9NbVRUbEtIOUFJcUFzVUEwQm0yOVVFVzlfZWdVTUs5a3g5U2hxOFc0dzBiNmQ2Z3hiTHR6N1lzU2ItV0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Monique Belanger",
        "comment": "I absolutely love this app! Was trying to find an app that would allow me to use different calendars at once and this is by far the best and easy on the eyes as well! Love it! Totally customizable and I don't have to change anything on my Google calendar! Awesome!",
        "date": "July 29, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPSElDUk9YV1RJR3dOdXJWdm5IQkZReTRWUDNKSndBSC10eWZ4TVJ6REtLYzZka2R6NWdpVGZLWVYyNUJVQnB4Nk10a1NWTE1xSEtHbEtIY0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Eddie Clifford",
        "comment": "I've used Calengoo for years. I love it for it's vast customization and usefulness.  Recently I had an issue when I got a new phone. I emailed for support and got very quick and helpful response.",
        "date": "September 20, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=Z3A6QU9xcFRPRlQwT1hOUnZ2Y2JkeWd6aDBSdERxVnJsckxPblJSaHk3UzVoMzhxU0JQUENlNjI4YnYxU0k0dVJnMWduaWZTaEVpX3JNX1pYTWxuY3JSSEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Wow! Came from jorte. The sync with Google tasks and calendar actually works the way its supposed to. Even on 2 devices. Evo and galaxy tab. Thanks!  Update... 12/17 6 years later and still loving it. Thanks 👍",
        "date": "December 21, 2017",
        "permlink": "/store/apps/details?id=com.calengoo.android&reviewId=bGc6QU9xcFRPSHBLUGt2c0hHeF9kX0xlYV9hM0txLUp2cGxKN1htVzNRcW5xWmwweUk1Umhydl96QnRtSmxQQ2xNdHMxSGhFLXlsTW9QSHA1MzRrMnlWTkE",
        "reply": null,
        "star": 5,
        "title": null
    }
]