[
    {
        "author": "Diane Lyn Parham-Lindfors",
        "comment": "I can't tell anyone more clearly.  Family far away?  LOVE YOUR FAMILY TIME? LOVE THIS APP! It's the next best thing to being there. My two grown daughters, 1 & 3 year old grandkids. They live 2500 miles from me, yet I know my grandkids will recognize and connect with me when I do get to go there. All because of the hour or more every Sunday we get to Skype. Thank You❣ Really 🤗",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRlh2bmVmWnI2bHV4SWZ4MGN2S0lmZ0JBTzQxeGhndHFDNnBHM2MwaEtoT2F4X3JMVjVud3h2R3g2M01ic0g0TjczTkYxTURYX0d1cGltVnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Josh Erny",
        "comment": "It's a nice ad-free app which would normally make me go right to giving a 5 star rating. But when I sometimes hit the video button, the video feed won't turn off. Other times I'll try to flip to my front camera and it won't respond there either. If the connection isn't lightning fast, the connection can drop completely. The phone heats up BIG time during video chat (which I know may not be something they can fix). To say the least, they've got a lot to improve on.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRjZ4R3p3M3FFSTZpRnZRdk9pdWJrQ3dJZmNKMlZBaXdiX0ZCbFJ6SWIxR3RoMlBLQjR6RmJVTGxwNk0tSDlBYUMzSnZLb3RXeEJEM3ExTlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Marianto Lie",
        "comment": "It is a great app, better than any other apps I know for video calling. One of the greatest feature of this app is it shows the text of another person while we are having a video call. This makes people can do another task simultaneously. But another problem I have, my phone gets really slow when I have a video call while texting. However, it is still a great app!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRi1ha3NiSGVaTFVFdHhESVl5LXR2bW55SjY2UWtPRTQ4MDNhNHhyY0VxbGJBV0dUYjVEZnNJdFNWaUEyZFpUTy1vZ1VqZ29hU0thNzF4dEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Sebastien Haspect",
        "comment": "Great app for video and audio calls. A little hard to figure out at first, too many motions for some basic features, hang up for instance is tap screen first then press hang up button but it does use all the real estate your phone offers for video. Call quality has improved to where it should be: equal or better than actual calling if you have high speed (5mbps both directions) so it's great for when you're roaming the world.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRl9OTjFjMUd6cmNHOWN4eURtdE9qNEhPYXZGcFZCVU4tUl95eEp6VmZHX1NITk9NbU9fRi1BYzBWd056TmRVbXpadWZleVlCdzVrOVlOMUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "zoe baker",
        "comment": "Well it used to be good, but with this new update i am not getting any notifications! Its ridiculous that i have to constantly open my skype app to see if i have any new messages. I mean its good for calling and messaging, but id really like to know when people have tried to contact me. Please fix this.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRXZCWDVrbmo1UEljUEtQay01bEdxLUJ1T29MZjdjSU1GZlRJMk5kOV9vNTNsWG9hVFJnWEc2NmFQNElueVdKd3VMbjVPT2wyeEVOcjEtQVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Steven Braithwaite",
        "comment": "I can't hear the other side! They hear me and we can see each other. Video call drops out if any notification comes through on my phone. Useless as notifications are common. Ruined my planned call to my daughter on her birthday...thanks Skype for ruining hers and my special day!",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRXlfM3kwUGRSdmg0V2NRMHhzVExKN1duQ1J2QlhBV3plRm5DRm01bG1fc09sQVFKaXRBRjl6a0RKenpUOExMLXFyQTZyTThRMlp5eWY1QkE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Bacchus Sake",
        "comment": "New UI is the worst... Why did you do this? I only want my Skype contacts to show and communicate to. Even I stop sharing my phone contacts, still shows random contacts at the top. I may know this people, sure. Do I want Skype to let me know about it? No thanks. So hard to just get to the screen to make a call...",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSHBZNkhQZlBIMVVqSXJSeUNjaVdtaGVYMDhXN29SV3pWNUMyQkxzaGxfcWFOUEJKS2lsN1J2Sm1fc0U1MzZMRUhyS3VyNVZVU05sZ3Q5X3c",
        "reply": {
            "author": "Skype",
            "content": "Hello Bacchus Sake and thank you for taking the time to give us your review! I am sorry that our new UI it's not working for you. Please, let us know what you think we should improve. You can send a feedback to our developers by clicking on your profile picture - settings - send feedback. Athanasios T.",
            "date": "February 26, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Christine Poire",
        "comment": "Can't see skype contact phone numbers or edit them if they change.   App would be more useful if I could open app and go select a contact from my phone contact list.  I will not sync my contacts for privacy reasons and because I cannot tell if I'm call their cell phone or their home phone.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSERMcmFGY1RLckRDMUd4YXNVV0prQldLQi0wSmNkbU5zSDJPWlpycHNFRU4xQzVMMGI5MmFrZkZkMTRxWV85LUQ2SEJkQ0FBT3Qtdy1MaHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "The new version is awfully slow, full of useless new features and has a horrendous interface. Luckily, voice calls still work properly, which is almost a miracle. You should not have tried to fix something that was not broken, Skype team. Edit: updated once again to see if anything has been improved only to see the app performance decline even more. Well, at least I do not have to pay for it.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRl9aMnVPZnRsbXJUaHBiSldDZHR0NHJOZ3AzN1JYRHV6YURKMl9GZUpKTGlKZFRvRU1FVVZjcV9MRFQzdU1CUVpwai1TQy0yb1dTZEJqY3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "With so many people asking to remove or at least have a way to disable \"people you may know\" feature I guess developers are not going to do it. Just updated app and still no way to disable it. I dont want to see my ex wifes friends and family  nowhere on my phone. Shame on you ms",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSEtTeUNvZkN5emo4c1FkNFRVVENqRjhfMjZSQXBZUlppRGloclE3NkxUT25Xa0Fyd0kzM0E1Z1ZpUEF6U1h5eGJKWVg0emV0QmtJd0l6YWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "I live in a different country to my family, so skype keeps us close.   I read bedtime stories to my grandchildren, I sing with them, and we play games and have fun together on skype... I'm a real internet nanny!   Not as good as in the flesh, but I couldn't live without it.  Thank's Skype! 😁",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRTEydk4zWmlsczJVVGhDSlJPVWVqOUxlX0FFN2ZJWDBUcVEzLWZqaWxpTDVaV3h2YjJ5OC1ITjBOd29meXd4ck1VNW5rN1NHSXAtMndWWkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Skype has gone from being crappy to the best video messaging app. Whatever updates you have done, they are mind blowing.   Earlier used to prefer fb messenger, but Skype rocks now. Kudos to the Development team..  Question- Any chance of getting a screen share feature on mobile app? Please let us know.  notes- The cell gets overheated when  for long durations on a video call. This didn't happen with FB messenger.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSEJOZG9zQ3ZHNHEwcVFhazFtR3YzZTNKYi00d1Y2a1F6TGY2Q005MUhOemJMM1Zyb2FrUS1iRFpMa3BFNlRibXY1WW8zVWdDaEFwSTR5aHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "weeb land",
        "comment": "This is a video and voice chat app but i can't even call because it's stuck on connecting and I've checked everything including my internet and tried to fix it but i still can't get pass connecting. The new update is the worst. Please just change it back.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPR194RkxHTWdEVk4zRlV3d3Q2RUFuUFI2SmZmNzRSY3c1UENFNE1vVFR1SVVpZTFyZWYzM3VyQktYVUUxUzJpeU1pUmE5SHhGM1hDcmJldVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Peter Reaidi",
        "comment": "Wow what a horrible update. Truly horrible. The whole \"decision making team\" at Microsoft responsible for this atrocity should be fired. You have no respect for your customers. I've been a paying member for over 10 years and frankly this is offensive. The whole design and development team working on this is incompetent. Laggy app on a modern phone, constant crashes, and did you even do usability testing?!! You no longer have my business.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRi11ZTRjb25QZGw0cmNhLWxXQ2dxTGVRS1EyNy02V1ZfdVA2dlZUSjRLaGxjdHhzV1RlZkhoRElnYmJIYlRyaTVFUVBRMDBJdkxadm0tMUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ankit Purohit",
        "comment": "Even 6 months after my 1 star review I only want to give it a ZERO! What did you just do! You had a perfectly good app and UI. The new update is pathetic and I cant even figure out what's where! Did not expect such a bad user experience from a world class company. This is not a chatting app, People use it to run a business damn it!",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSFN0MEg2Vl9TZEh2bUprN1o0LU02LUxPX3hwcDZzNkp1TEhOdkpCRldvVGlYVVlKakpPaGVRNW51T1doMnFwaFU0X1NvNXFCYkJLdS1OSVE",
        "reply": {
            "author": "Skype",
            "content": "Hello Ankit Purohit and thank you for the review. We are sorry for the performance issues. It was truly not our intention to make things feel more difficult for our users. We will be happy to see any suggestions coming directly from our users so our developers can have them in mind while updating the newest version of Skype. Cheers, Paulina B. #ui",
            "date": "February 27, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "R D",
        "comment": "I've been using Skype for years but the mobile app had always been unstable and unreliable. Since most people now use mobile apps it makes me wonder when Skype will start paying attention to users' needs.  Update 2018: how difficult is it too design an app? Still slow and buggy.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRVA5NGlfSmc4VER0ekExdUlMMkVFSWlsT044UU5wSS1FVUNyZUVKLVJnblBZZjlpbWw1UHVzNzBqOFYxb21JbnhjRE1IQ2poSlNUSWN4MkE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kyle Tozer",
        "comment": "Skype has got good times and bad times between updates but the bad time can be really bad. I use Skype to call and video call my other half in our ldr. We have had times when Skype will keep randomly cutting our calls, others when either one of us can't hear the other and right now, we can't hear each other quite a lot and it has been turning off speaker mode every time I get any other message",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSF9qMlpDbG1yOUtCWm5XNy1GNlZaMHdsdkRkVks4YjhQVUh6MnJWMTBnZlRheFZyVlNZUTIwb0hyb0dmWS13YkVsdklfODR4UEROTU5ZSlE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Darren Wheatcroft",
        "comment": "Hey MS what the hell is wrong with you? How did this pass UX testing? Unbelievable. Can't even edit contact details in the app. Randomly merged contacts. I think ms are doing this deliberately to get people to use something else.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSEF2eU5iMG1jRjl5TjB5NmJiVlRZbGtwQ0E0QnBtb1VGU2x4QUF0Z0dtcHJxU196SXliSU5QbzRlV3hHXy1YZnFlRXpkb2lLaS1sbTVuN2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Martin",
        "comment": "This App is really bad. They have managed to make things so complex - shame on you skype. They probably have very clever developers - but get some ordinary people to try and do some simple things",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSGFCMWd1T0pjQnN0SmNabTBwUXc0c2pJUDdhQ2UtYVdxcFJ5OWpYd09venhjc2N5bEkwRkZiVWtwN1ZCaUx3ajkyYmZpVHVZbjFqNl9SY2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Wahab Ali",
        "comment": "I usually do not write reviews but I decided to do so for Skype since I've been using it for the past 6 years for professional communication. The new Skype is terrible. I don't mean the UI, I can get behind the UI and I understand changing the interface is always painful, but I don't know why the design change would result in the app becoming so slow! I've started using Facebook messenger for casual conversations and slack for professional ones as a result of how slow the new Skype is!",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRV82Zy1EbE9LLW9BNzI4YWUxVW90SWlYTmM2Q0xKQTgyR3ZpeU1QMjNQOXYwVngwVWpRTTJwS1NjNldJZ1VxaHVsX1FwcEEtSk9QbkhJdXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Nidal Qanadilo",
        "comment": "Core functionality (communication) works well, however the UX is very poor. The icons (mute, etc.) disappear during the call and its not intuitive at all to have to touch the screen to make them appear first before choosing the icon I need  (and that is not that responsive any way) - very annoying",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRmpOelVqaklIVUxNMjhHTWlSN1Z4Q3B6LTVLd0tOSGRxc19MaExLNHlRSzhNajJKSUsxLXlKUlpKdEFlRHctQ01JSmJyVXdsQzJacVQxdmc",
        "reply": {
            "author": "Skype",
            "content": "Hello Nidal Qanadilo and thank you for your review. We are sorry for the performance issues. Please, uninstall the application from your device and make sure that your operating system is up to date. Restart your device and then make sure to download the newest Skype version. Have a nice day. Cheers! Paulina B. #crash less",
            "date": "February 27, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "John Tele",
        "comment": "Bad quality like too little available bandwidth. Disconnecting and doing Viber instead had excellent quality. Same internet line. Few alternatives have group calls. Annoying that calling credit gets deleted every 180 days with a warning a few days before.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRlgtOXpDbVBqTExHT2ljX0lZWlREZEtnY3REeWEzMU1Lb2hCV3poOGNWV2hPZGVtaDE3MnJ1aW1LSlNCTnVhQmQ0R18xVUJtNnpQdGNla3c",
        "reply": {
            "author": "Skype",
            "content": "Hello John Tele! Thank you for the time you provided in order to share with us about your experience with our new Skype application. Feel free to contact one of our Skype Agents in case you have any difficulties: https://aka.ms/SkypeGetHelp. Thank you again for your feedback as it is greatly appreciated. I wish you have a great day. Athanasios T.",
            "date": "February 26, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "This is a good app but there are a few problems seems as you can't always hear the other side of the call. I also can't understand why I keep on being logged out every week and it also keeps on saying that my password and email are wrong and it is really annoying",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSFFJSEhGWnRNa1lhT3ZpcFRscjBoQ0xJUWYxREdIZHFZZ1dxWHJJRWxCYkhVblNFV0huaDFtWHNxWklibXRhRWRGVnhETHZ0Rkw1eTQ3YWc",
        "reply": {
            "author": "Skype",
            "content": "Hello there! Thanks for leaving a feedback, we really appreciate it! I suggest you contact one of our support representatives on chat in order to receive help with your issue: https://aka.ms/SkypeGetHelp. Please try to delete the cache, uninstall and reinstall the app, as this could help. Thanks for the information. Athanasios T. #call",
            "date": "February 26, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Zack Whitbread",
        "comment": "It freezes when I go on the chats and it only shows the last 10 messages back and forth so I can't check earlier  messages at all. Skype for Business works brilliantly so why does the public version not? Just use the same coding and just change the name.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRWVjaXB2bk9YY3pnRUxRN3Q2NjR2OFV1cXZlbEViSGhGN0RSSlVoVzhDelh3cHdLTjhWcUlOalM1SzA1RFo3WTRTMmZCTlkzR0hrcmRta1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Eva H",
        "comment": "After the major rework of the app (after complete change of UI) sharing pictures through the app, crashes the app 99% of the time. Only way I can reliably share pictures is taking one with my native camera app and sharing it through the native album app.  -Angry Sony user.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRURZVnRYUVVTc2l5eDExNkU1dnFWZFlFZVp3bDhabWM4Z3htcVV5cXRhVVBtUkRGSGEwWFctUTZJVk9naG1TWmROZmdrV2R4cFI3T01aOVE",
        "reply": {
            "author": "Skype",
            "content": "Hello Eva H thank you for the review. We are sorry for the inconvenience. Our engineers are aware of this issue and are actively working on resolving it and improving the Skype experience. Thank you again for your feedback. We wish you have a great day. Kind regards, Paulina B. #han #lag #ui",
            "date": "February 27, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "It doesn't work either with Android Auto, or through Bluetooth in my car anymore. 2 weeks ago it was ok. Due to the fact, that Skype is preinstalled in Galaxy S8, I can't reinstall it or use an older version. I can only disable or enable it. I hope, that you'll fix it.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSEdQNzhNd0ZLX2lGaEltak1FQ2wyQ2M0VnYxOWZDZWozQTJwX3F0ZHR6MGpDbE91OFFaLXgwYk45aDBJOUNPeS1WYzJPU2lxc2k5dVFqekE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Adebayo Oyeleye",
        "comment": "Looks good and fresh. Love everything about it.  Ok so I hate that I have to always copy numbers from my contacts when I wanna make a call. Not cool! I should be able to access contact list directly from Skype.  Still 5 stars though.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSFBTZnM2Wml4QmlEeENPeDZnYjJHZlBURHVicTZnQlRmaWt1Sm5zV2pYdzFHT0NlUVlFMzVkUmtTVndqdGxrYjlOUlZSN2VaY1JWbUYxd1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "I am paying for Skype Out but the new app does NOT display anywhere Missed Calls. I have a missed call and unable to find it. Fck Microsoft and the idiot programmers behind this crap. Illogical trash.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=bGc6QU9xcFRPRlRFaXpzV1pfUU5UNDhlSkZqWFdKTll3OFVXOERKWENpWGpKUkx1cHM4OS1MVTlMUS1sYmxxT2RHdU1Rc1k3dTFpdXFSU2RCY1VsZ2QxakE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "horribly Draining the battery. My Nexus 6p gets so hot it's gonna melt my battery, and it's updated to the latest version. Used to be great, but now Whatsapp beats Skype in every aspect!",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSC1jVlpkSFU5UE5iZ2xJc1pPekp2VlhDVkNxaUcxejkzSThnS21XNUM4UnRqbXJ4YVVNc1pldnlMd3R1ZTcxQkd3Uy1RYVlQc29xNDhjN2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "This app is like a virus, it pops up in your face and interrupts whatever you're doing whenever there's a call even though I turned display over apps off or I'm in do not disturb. I will be uninstalling the second Duo comes out with multiple device compatibility",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSGEwQWpudENRNlVITWtSNmtJN24tODMxTTlHR0pUR3hZdFVOeTU2dFBvclRsZnJwX1BVMElOUmliRXQwckRFbU5pSGtCajh2TnFsTVZlX1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Rah-Gee Spence",
        "comment": "I have 3 things that you guys should do in the next update.  1. See whose viewed your highlight  2. Away and busy status like pc version 3. Change status with text. 4. N last but not least a show what your listening to feature n the ability to block someone from seeing that your online. We def need those Im sure everyone agrees",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRWE1cFNvRHcxN2diSlFIMHpabVhWZnJ4SnF5ck5qbklGa1hyTldOMUt3b05Cc3MxYjFtNm1hN2dMakE1Z2lhc2F2VDhQcnE3ejYtRFdpcFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jenny Liew",
        "comment": "Not sure it's only me. I noticed since I moved to huawei mate 10, I don't receive any notifications unless I open the app manual. I thought this app will run on the background but it doesn't seems it is. I have make sure the Android OS doesn't kill this app but still it doesn't receive notification that reliable as before. I hope Skype will fix this issue quickly. Thanks.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRS1ub01sS1FQYk9UZzJsdi1ndFNYMDBtVG1LZ2Q0Vi1VWDZjZnA2YndpdlhQWmNUR0NOb0lCSktDMXVKc0dPc0ZnSXdYNkc2X3FVazVlaFE",
        "reply": {
            "author": "Skype",
            "content": "Thank you Jenny Liew for your feedback. We are sorry for the performance issues. We'll report that to the engineering team immediately. Please contact Skype Support and we'll help get you back into the app: https://aka.ms/SkypeGetHelp. Thank you again for your time providing a review. Athanasios T. #han #lag",
            "date": "February 26, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "bhavesh vyas",
        "comment": "Worst new Skype. Confusing UI, mostly unstable, typed message goes away once you leave or switch between apps.... I want simple Skype back",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRmY4ekpyU2dCQUZsTjA5NTllaGMteEhqWktLcE1jNzZvR3NzcDVzQ0ZzUkdBRHg3aUxLVzhhUzkwQXpWWm4xRzh2YjJFWlpka1lFMXgzcEE",
        "reply": {
            "author": "Skype",
            "content": "Hello bhavesh vyas and thank you for your feedback! I am sorry that our new UI it's not working for you. We take our customer's opinion very seriously, so, please, let us know what you think we should improve. You can send a feedback to our developers by clicking on your profile picture - settings - send feedback. Cheers! Paulina B. #ui",
            "date": "February 27, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Daya Thakur",
        "comment": "Nice messaging app but hangs a lot when constantly used. Longer opening time, consumes lot of battery, stickers loading time is again a big issue. GIF search all together not so good",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPR21yengxWDhtTGNhc0EyOGwxT0VDMVJVQUpMN3dOMkFqQklkYnp2VHlQQVI1V3B3Yl9PVktwaE9NdFFFUUx1TWRQblAzbUxMY0xuem5YNkE",
        "reply": {
            "author": "Skype",
            "content": "Thank you Daya Thakur for your feedback. We are sorry for the performance issues. We'll report that to the engineering team immediately. Please clear cache on your device and try reinstalling the application and check for system updates. Thank you again for your time providing a review. Athanasios T. #bat",
            "date": "February 26, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Alex PR",
        "comment": "Thanks to the people behind this project and users feedback, most of the bugs and annoyances have been sorted out. Now I almost have no issues with using it. Good job!",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSEVkaElEZ29haVUzQklMZjFaZE1hSWluSjNNeElDUndhcnRDYzlzX0N5a0dKbkFRM3BINVN2NnVkTzBmSzN4T21TRTZaTW5hcExXRDdfbHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Milan Manojlović",
        "comment": "If I had 0 stars I would give! Not fu**ing working proprely on my 4Gb ram phone. Like soo slow. Developers suck with this app!!",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPR3VQYy1Zb0s0U1dqZHg0UHdzUTlhdjhQcldoNlRMazBqZDNDRTNkenBmMF9IVTNnMXJlNTJUQjdHYnR3VGNZYVBDWmJ4SWY5OWEyTzc1VEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "J. H.",
        "comment": "Once was a great program,  then it was bought by a big company,  and a as history shows us again and again,  a great program was destroyed. How to kill menus, options and peoples online status. Latter is just impossible to see nowadays,  and it was it's best feature!",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPRmZRSUhESExKemVKTXFZR3hubEQtVGM2R3dkZ0t1OFhTc1lXSXBrb1VSWTI2NjJMTUlpRjhPVmhMdmxmWlU1Q2t5RVdWMHU4cGhQQXgwdWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Adarsh Kumar",
        "comment": "I am using galaxy s8. New call window is worst. All button on screen is so small and placed side by side, making hard to put on speaker, mute, disconnect. Window is good for video call but worst experience with call.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPR2NHcUM2dGRGT1A1QXotcUFKSzJqenF1aEtrY1lxeG1scVpUOG1nTjFueFhfbjJyNDJ6Rzdmeks3Q21vNzd1VEs0UW04Qk1DbXJzRWlwY2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Laura Byrne",
        "comment": "Basically a good app, with a few bits that don't quite work right. Fundamentally, I have made good video calls with this app, but It has a bit of a tendency to show things over the video feed that get in the way of seeing the video and sometimes it decides to hide part or all of the video feed. It's good enough for what I use it for, but I docked it  a star for those quirks",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=Z3A6QU9xcFRPSFRRcU1uZUI4Wng2WFk3RXlGMDZxanF6MFJDWWc3QWhDUXJmTzJRVlRuTGJ3S1BTcjluRnkwRzFGQTI5QnZIb2kyTDNqdDNnQmlkRVl5OVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Wi-Fi to cellular fails and vice versa. Almost 90% of the times. App crashes. A total mesh when I connect BT or I have a call parallel to Skype call. The application for the size of the company that develops it is total rubbish.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.skype.raider&reviewId=bGc6QU9xcFRPSGhqNENuY1ZTN2lvX0Foa1hGMEw5VVJyallaOVZQZTY4MWtxUko4eHRqa1dhT082QTR4bXI4UFlVb18waVdnZm1BUUNFTHdGVHQtMWdST1E",
        "reply": null,
        "star": 1,
        "title": null
    }
]