[
    {
        "author": "Alfredo Diaz",
        "comment": "Update: Nice new home screen! Just began to use this app after I hadn't used it in a long while. I like the updates that have been made. Would love to see this app somehow connect with the MYCHART app by EPIC. All hospitals are trying to give patients access to as much information as possible from their medical charts through the EPIC system. This would be an awesome update.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPR1lRU3FXZ2VXVEw3Z3FnemhOY3BZMk5vS21HU05DUWdmZTVtdWRSU3IyTWNBMzBqVFRxS0hpUzFJTmZmdXdod2k0TTdZSWw4R2duU3hHTUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Pedro Loperena",
        "comment": "Since it's new, I'm giving it 4 stars because it offers alot of features that is worth using and very convenient. Once they include more pharmacies and hospitals everywhere, I will upgrade to 5 stars. Update, have been using it for about 3 weeks now and when I visited 2 Doctors so far and it's been very helpful documenting the meds, times meds were taken and doses. It's very convenient and easily accessible. I like the diary feature, it's where I note sudden changes in my vitals. The color codes should be customizable for ones own needs. This app is very close to earning 5 stars.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRlBhQnU2bndSQ1ZtLWtoM3RxY2stVjgydkVhUG5IdXNfclZzdEJLckc3dXNoSHhwMHYxdW1CT21HUHZDdjNaZ1J5TzhHZTlZVHN5eURGSGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Samantha Sabovitch",
        "comment": "Awesome app. The only thing I wish they had was a reminder from the last time I took a med. (For example, pain meds every 6 hours.) Otherwise, very easy to use and awesome for keeping track of everything. I love the little med graphics that are different for pill color, size, or even needles or inhaler, etc. Very customizable.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSDdHMnRCdXZKQzhnZ1BKTnVYRkYtbWhQZldRZkVkQU1MWkVRT1BDZjdZVTZ6UnM4dTVacUVZcTJhNVdBSGUzVEp5RzRJSEtJa0Z2aGVQLVE",
        "reply": {
            "author": "Medisafe®",
            "content": "Dear @Samantha Sabovitch, thanks for the rating and feedback. We will pass along to our dev and product teams. To your health! - The Medisafe Team",
            "date": "February 15, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Verity Ives",
        "comment": "So helpful as with my medication if I forget to take my meds I feel it by the end of the day and for days after. Was a bit frustrated when you press take and you need to make a selection, because I tend to forget to record it straight away but the \"shake to take\" makes it a non-issue. Would love if you could set up pets as other members and for medication courses which are not daily, like dog worming or for some people injections. Have recommended this app to others who need help remembering meds.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPR3J1dk5hWmY1NTFQNWFua1YtQWZmNWt1d0k5Y0dDMV9UM2RucHB6eXl2dVYxVDFtWVI2NDhYZV9adDRuY3M0cHl1bS14UXJQNjEydk1YUmc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Melissa Montag",
        "comment": "I have epilepsy. After 2 very scary extended blackout incidents in Jan & Feb, my son found the Medisafe app. So easy for me to enter meds, but the best part is having 3 people who will let me know when I miss anything. I showed my neurologist, she was so excited and she says she will recommend it to her patients. Thanks!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSG9UMkRROEQxSHRndVhZMEYzcEJJZE40RlJLeWstTXE3ODl5bzd6TF9HckVnX2dVUGRhc1lONktiRGhKeWxPcktFaEktbEhsWC13OV9ydWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Etsub Yilma",
        "comment": "I was looking for an app that I could use to track my meds and came across Medisafe. It's an absolute joy to use and I love the fact that it has the options to track and snooze medication reminders along with many great features it offers. I highly recommend this app! 5 stars and kudos to the developers.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRWVMcWt6WHEzcUMwU0FwcXRVU0ZBOEMtRjFxb2tueFZTc0F6OENwamo5UG54TVhkeU9IZDRWd1ZRdnVQLURtTVFiRTY5OFk4dWNKSzAzR3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Zoe Hannah",
        "comment": "Very easy to use, very flexible,  and extremely helpful. Since I downloaded the app about a year ago I haven't had to worry about rememberimg to take any of my meds and more importantly IF I'd taken them(it was a daily dilemma)! Highly recommended",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRjJLY3E3ckZYeklfYzJXcDVYYnlRQnVMdkEzZHV5T0dtRmtxRWZsYzVveFpnY1hXT0lwV2JmSVBqN0pISDM0TWFta0ltbG9PY1lkVndzY0E",
        "reply": {
            "author": "Medisafe®",
            "content": "@Zoe Hannah thanks for the great review and 5 star rating, we appreciate the feedback! - The Medisafe Team",
            "date": "February 27, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "C. Mohamed",
        "comment": "Can't thank enough the developers for this app and the fact that it's totally free. If you guys ever find the need to charge for this app, please open a donation link instead so that alot of people can enjoy this app. Even those who cannot afford. Thanks alot. God bless you guys!",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPR2lWQmZMQzR6Ym8tRVhQYTBEamgtNEFZU0xHYlpLR3NuZk5WWEt4ckhORzFRYWxMdXVwQklrTU16eUpJZDNtaHcyWGMwcllWMHBYcGZMcVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tanya B",
        "comment": "Despite all the problems, I had kept this app around to help me keep track of my meds and supplements when I set up portioned pill packs in advance.  But this app is getting ever more pushy and not honoring my settings about popups and notifications. Inside the app I said \"No popup\". It pops up anyway. So I went to Android settings and blocked first popups, then notifications altogether. Guess what? It still pops up! From the pop-up I went directly to settings and saw that \"No popup\" was still selected. At this point I've had enough. If an app won't allow me to control my phone environment, it will not be on my phone.  Goodbye, and good riddance.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPR2JyaHRQNzI1Um5STUU5X3I0X3drYUhWVU52MDFqdjRuLUlzN1kzcGNJMklnaVNvZWRPMm9aSV9aZEYtcGRra1FvOGZsNUlMV09FWDV0dnc",
        "reply": {
            "author": "Medisafe®",
            "content": "Hi Tanya. Thank you for your message and feedback. Please send us an email to support@medisafe.com and we'll be happy to assist you with finding the cause of the persistent popups. All the best, Medisafe Team",
            "date": "February 27, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Claire Berry-Gardner",
        "comment": "UPDATE: STILL only 4 stars. They've updated a lot of my initial complaints. However I have asked for/suggested repeatedly either a 10 HR interval or preferably a fever medication cycle setting you track alternating medications that shouldn't overlap but must be taken on not only schedule that alternates not only medication but alternates the length of time between medications.   ORIGINAL: The only reason for not getting 5 stars is the fact that where you can set the dose it's only single numbers. For liquid you should be able to put the ML or the tsp or tbsp instead of 1.00 etc. They need more avatars or the ability to upload your own or sync with Facebook or G+.  I hope they add the ability to list pills you have taken and allergies to medications. Also they need to add Wal-Mart to their online med refill.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSElDaU4zWDUtSVdEWF82TmduaFA4dk05TmVkeFVYOUdPamlrcWhoek5pdzk2cENuUEszdG9yYlRBaDdSWTJaNGpXNkh5TTlaclJ0Wk9lWlE",
        "reply": {
            "author": "Medisafe®",
            "content": "Hi Claire Berry-Gardner, thanks for the review and feedback. We will pass along to our dev and product teams for review. In the meantime, please reach out to support@medisafe.com for assistance. Thanks! - The Medisafe Team",
            "date": "February 15, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Charlie Christensen",
        "comment": "Extremely accurate and fun to set up and use. The devolopers did not miss a trick, one of the best apps I've ever used and I use a lot of apps. I'm also old and find it easy to use, thx Chas",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRmJENDVzLWlUdWZiV3g4dTNKM3k5Sk4tOFlueXJHSld5bXp0cUxuQkI1d2FORnJZT0JHTURiRUxnNGlCalo5OUgxZnpxcVdxUTFZSGVRbHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Razwn G",
        "comment": "A great app that deserves the 5 stars. I haven't used it to its full extent since I only had to take an antibiotic, but for me this app worked like a charm and really helped me stay on track. I would totally recommend it and next time I'll need to take meds for sure I'll come back to it.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRU80dVZVM2tiTEhCbGxNMFlQRmtFSmNPMk1OV3NEekhxa2RsbmZFSXlNTExUNUxuU2lhbGlHVFFZMTdQSDNjVHY2dS05T3QzNG9tQmVrenc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Andy Tanner-Smith",
        "comment": "This app has everything I need (and much I don't). Google Fit integration was the decider for me. Excellent. Previous app crash problem fixed with a reboot.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPR015Qlo4aGtKcEtpUTJYb1ZRbjU5VUxnOTdUeVpOSHhZTmU4R1FHbFUxMDFLTGJLYk9iMEUwbzByVVl0XzdrQkZmaXIyNzJlT3pYZy10bFE",
        "reply": {
            "author": "Medisafe®",
            "content": "Hello Andy. Please email us at support@medisafe.com and we'll be happy to assist you. Thanks, Medisafe Team.",
            "date": "January 23, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Kayleigh Kinsey",
        "comment": "I have to take daily injections to keep myself alive basically. A busy mum of 2 I would definitely forget and this app has literally saved my life. Brilliant. I also add on my son's daily meds  (7 a day) and its never failed me",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPR0VHNlZDM3VRU3VpSGVtNkQ3OXh2dEpTSWRXTWl1SENSVlBNeVZDU1JLSXd1QmxYaFZlNmE0M2M2UmJwTGc4bWxValJUMVN3SjhjNmZvQ0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tiffany Cruz",
        "comment": "It's good because it's persistent... I always forget/ignore the first reminder and then I'll hear a bottle of pills shaking twenty minutes later and I'm like \"oh yeah, better take my medicine.\"",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSHVqU1dwNTZ0XzlndnJrc2RuNndoYVpvdXRIZEE5dWdobGJBcmlyRWNMVk5zd1g3Mkt5dE5vRWI4SE9ISjZLSTc0aEY1REYxUmNZalBEZlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Madison",
        "comment": "Every once in awhile it doesn't remind me to take my medicine which defeats the whole purpose. It's a good thing I have a separate alarm set to also remind me because relying on this app doesn't always work out. I don't understand why it doesn't notify me sometimes so that's why I only gave it three stars.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSFZZUWxvRTBFT0FvZFBFM3JZR1dxbC1Yc08tbV9BQ1djWmJsRkVRRzdJUVVHQzZqYmN6TWNWQklrZ1dfWS0yV0swbmtuaGNsczQ1Z0NIQlE",
        "reply": {
            "author": "Medisafe®",
            "content": "Please go to your device settings and tap 'Device Maintenance'. Tap on 'Battery'. Scroll down and tap 'Unmonitored apps'. Please add Medisafe to this list. Then in Medisafe tap ‘More’, tap ‘Settings’, ‘General Settings’, ‘Refresh reminder times’. Please contact us at support@medisafe.com for further assistance. Thanks, Medisafe Team.",
            "date": "February 27, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sarah Bentley",
        "comment": "I loved this app and used it religiously for...years honestly. But now all it wants to do is import new medications...every minute...And then crashes when I try to let it. Again. And again. And again. I had to uninstall it to get it to stop.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRkhXSTg5bWYzR3FWNTFnejBMazVGbXBGY0xKWkJ5MWFxSkMwXy1hUm9teGwwWVZKMkFwOEdoVGo2RnE0WERwU2pBRmlONGhVb3paTlNIT2c",
        "reply": {
            "author": "Medisafe®",
            "content": "Hello Sarah, this is a known new bug that we are working on fixing. In the meantime, please go to \"import meds from pharmacy\", tap on your logo and tap the pen icon on the top right. Then tap on the trash can and disconnect from your pharmacy. Please contact us at support@medisafe.com for further assistance. Thanks, Medisafe Team.",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Paige Peterson",
        "comment": "Love the shaking pill notification sound. This helped me transition to a new medication time. Periodically my reminders stopped, but it hasn't happened for a long time so maybe I finally figured out what is putting this all to sleep.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSEhwY0FLdC1idGN6M1ZKTm1oVnU1aExkZ3VnV3R6UGFTc1BVRm9QMzBMdFVzSGE3aDZLRklDcW9HMktMVzF1aWduYjNpWDY2ODVqaklDZXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "ThatGirl Jane",
        "comment": "I like this app. It will definitley keep you safe and remind you to take your medicine on time! It is punctual like an alarm clock and sometimes annoying if I'm doing other things, but it works!",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRmNYZEsyRE55VjJ1ODFkWmpsUlEyZzJfeDFqTDU2MkdFZDJZbEYyLUs0TnJCcDkzRVNWMW5UNFVsN1lnbjdvbDF5LXhFZzZPYVVWYkEydHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "My Dr changed a med that now I have to take qid. Well without this I would be totally uncompliant. I am thankful for this app. Reminds me to take my meds. 5 starts for keeping me accountable and alive.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRlB6QVNTcEkxRTM3akRteGZFRWdWbHRSV3lWRmpES2NoYmJNTnktWGVsdE11SFJYc2dCc2VITDRxTnFIMHhkUmZUN3dTN2ZoUkJ6cFZLRGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Einat Freidzon",
        "comment": "Overall helpful but a few glitches: an update was performed and I lost all the medication history I was using the app to track. Sometimes get notifications in the wrong times.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSGdxN0tIeVVaNVZTeFlNVDFMLXpyTGxGRzlwV1hMM2FSeHViTVk1V08zZmNRVnpTTFY5SFU0ZWtVWmRRRUZTRlJURHJmTVJSWjZ4ZW1CRHc",
        "reply": {
            "author": "Medisafe®",
            "content": "Hello Einat. ln Medisafe, please tap ‘More’, tap ‘Settings’, ‘General Settings’, ‘Refresh reminder times’. Please contact us at support@medisafe.com for further assistance. Thanks, Medisafe Team.",
            "date": "February 27, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Justitia CellPhone",
        "comment": "Have a complicated post-surgery meds routine & I live alone. Anesthesia & pain pills made my mind foggy making it difficult to keep track on my own. Looked for app w/not high hopes to find one that worked. Do a lot of tracking of a lot of things, including financial, etc. When I first looked at this app, seemed cumbersome. Since I couldn't find one that wasn't, and this was Ed. Choice, decided to try it. Took only an hour to master and am amazed at how effective it is, and adaptable even throughout the day. This is one of the best tracking apps I've ever experienced on any subject. Strongly recommend it!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSGZzZi1tZUttUGptdVFrdm1SVktrVjItYjloZU5sNmtPWXlMdl9JX3hBbThSaGtOczRXZm90V0RaRTlvZW5STXZVQW1sMUp6bVQ2STNTYUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mario Proenca",
        "comment": "Excelente app. It has helped a lot managing meds. Didn't find a feature that would allow multiple users eg family med for each person. Great app!",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPR3pKeVJodDBudDdVX0VJbFJHcjNwam1ySWx0d0p4N2R5QTFRdUdxTlhYaHRJdWVNWktldkVWT3oyYkxwamRMN3BwdDJBaVJOa1hjSUlxMWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kevin Steve",
        "comment": "Even for a free user, this app has an amazing amount of features. Able to track your meds through the day, track changes in a diary and potentially set goals and having reminders that are clear as well as for refills is a great reminder to have.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRVBBcldQS0ZnQ2F6eXc2akc2NHZzOFYyZXo5LUppbzNUMUN3enVTVk5mbmwyZW5KMmROOVgzZUJiMWFEdFhsSVc5YmdtVXBnZUhMWmhmakE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Julie Vale",
        "comment": "I have using this for over 6 years.  I had a brain tumor removed and had to take SO MANY different Rx's.  This was amazing with how well I was able to keep track of my meds.  Before the app I had a special bag that I carried all of them in.  Obviously my brain was functioning at maximum capacity.  This app helped me organize, track and remember all my meds.  I also LOVE that the universe reminds me.  I also LOVE how I can track supplements and other types of meds.  I have my 11 year old twins on my account.  And had my 19 year cat.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPR2JsaXpxaGZtc3dQNHJBaTROVGxxQ1BRejA5cFlYbzJZVW9IRmVkSXVITkxZSm11azN6RDlGQVFZenYtM1FQU3RmOWtONUhTaVQybU1uenc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mark Anderson",
        "comment": "This app sucks.  It has advertisements for sub-par pharmacies, and doesn't have the ability to allow you to select a blaring alarm for medication time.  Not able to customize?  Sounds like a garbage Apple app that was ported to Android.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSEtIdjdvUFBVSVNnbE1EZ0d6Q0VnWjlhWFRMYXBKeU1Jd1MtRmdETjRCVGJibkNhbm8yMkU5dmdESHlXdnVHdjNqY244SEpvQ0tCOXRkQ1E",
        "reply": {
            "author": "Medisafe®",
            "content": "Hello Mark. Please tap on your side menu on the top left and tap 'Settings', 'General Settings', 'Sounds', ‘Ringtone’. You can choose 'Customize my ringtone' or you can scroll down below the Medtones and select a custom and/or louder ringtone. Please contact us at support@medisafe.com for further assistance. Thanks, Medisafe Team.",
            "date": "February 21, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Ross Jackson",
        "comment": "The developers must be so proud. The number of lives saved and the quality of life that is improved by we users is immense. Thank you. An excellent app. Once the intricacies of documentation are learned, it really is an invaluable reminder. The sound of a pill box rattle to remind is inspired.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSGEtRDlBWlhIQTBlZkJPM0REVWc2aW15NXRwbk0tbVhTRDlWa1NobF84Qy10U0g5azBXNmxBYUNTTE5TTXQ5bUNSRTlLanRKYnVJR0Fhc0E",
        "reply": {
            "author": "Medisafe®",
            "content": "Hi @Ross Jackson, thanks for the great review and 5 star rating. Our #1 goal is to improve patient well-being and save lives. We appreciate the positive feedback! Best, the Medisafe Team",
            "date": "February 21, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Brendan Rosenberg",
        "comment": "Up until the most recent update it was 5 stars but now I haven't been reminded at all about taking my daily medicine since the update. I've done the tips to try and fix this but that has not fixed the issue",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSFdOUkFBYlBEaDd3Y3NQSzFOQ2Y0ZjBBTU92WXMwUkMtQU9WUmFfSlFYNG5keVR4VDlsdG1WS0tWRFlLOGc2al9tdEZzRHF3TDMtNXRPb2c",
        "reply": {
            "author": "Medisafe®",
            "content": "Please go to on your phone to \"Battery\" –&gt; Settings (three vertical dots) –&gt; \"Battery Optimization\", open the “All apps” section from the drop down menu, go to Medisafe, and tap on “Don’t optimize”. Please contact us at support@medisafe.com for further assistance. Thanks, Medisafe Team.",
            "date": "February 21, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Shari Worden",
        "comment": "UPDATE: I gave this app 4.5 stars at first, and then 5 stars. I must now change it to 3 stars. Despite Medisafe's many very useful features (plus some cute ones, like customizable alert tones) and its reliability, it is only a so-so app because it is missing one *crucial* feature which I have been asking for since the app was launched.   After all this time, it is STILL impossible to quickly log ALL meds as being taken at one specific time, if they were not taken *on time*. Example: I take Medication A, Medication B,  Medication C and Medication D at 8:00 AM. I take them all together at one time. I *always* take them all together at one time. If you take them at the right time on the dot, you can quickly select \"Take all\" and you're done.   However, I am never exactly \"on time\". It's usually a few minutes to an hour before or after the scheduled time. But my doctor requires me to log the exact time I take these meds so he can better monitor whether I need adjustments to the dosages.   That means that when I take all four  medications at 8:19 AM, I have to use the drop down menu and clock wheel to enter 8:19 AM for each and every one of those four medications, even though I always take them all together!! It's hard enough to take my meds on time in the busy mornings with two small children; how do I also find time to sit there and enter each medication's time manually? Well... I don't. I had a major medical issue because I had so many \"missed\" medications that we didn't know whether I was taking enough or not and I ended up over medicated.   So now I have to use pen and paper to log my meds because it's ten times faster to write \"Meds A, B, C and D taken at 8:03 AM\" than it is to sit there and open every single medication's menu, long press \"choose exact time\" and then scroll to or type in each number for the time and then press OK.  One simple feature request ignored for two years renders this app little more than a database for what meds/dosages I'm taking. Which I now just write in the same notebook I use to log when I take them. And I just use an alarm on my phone to remind me. It's literally easier than using Medisafe, which is just too bad.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRThJeTJpVGdJY29MY1ExazlSaG1LcmRBdzIzeFh5TXlCcUoyQlA3ZlcwRWRiNzFGaXNaOXZWOVhJYTdkZTI2U2VBNm8wSkNVaWwxc296VFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Good app.. I'm definitely taking my meds on time more often and it takes the \"did I take my meds\" worry away.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRktKQjVCdFQ0bXRRS3RUWk5LcEZNMzBmcjQzMk9wN2c0OGZMQkVWU3d0VWZHUGtSRGZKdEJwRGlSc182XzFkenNUaEFFblRQUGx6OXo4Wnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Nikki Chang",
        "comment": "The only app so far that has helped me take my meds on time. Simple interface, clear med instructions and a lot of intuitive settings. You can show the shape of the pill you need to take and schedule it multiple times per day",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRWZ1U1hsUXlUU0N1MVJ2aUxPV1U0UkpPZXJaZ1JOd2R1MDlpLWREbm9qZm1iN2pjMFM4d0dfS2RlSlJ0UEw4ZWlzUHY2MktQQXdaV1pHSFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Bridgett Landers",
        "comment": "I like the app. It is very easy to use. I wish it had Natrol Vitamin D3 sublingal tablets in the medication list. And it would keep up with thyroid labs such as TSH, T3, T4, FT3, reverse T3, and TPO as well as cbc and cmp blood labs. I also wish it would connect to Fitbit.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSEdFMnVGVkpiakpJcGxkYjBiNlBnWGI0bjBjcjNwekd3bEZlSHEwMU9oR3htUk9KN3lIa1hnWUZtWFJVaFFNaFhKdFV1ejlRYTBPV2Zna3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Robert Bresett",
        "comment": "App is good for tracking and reminding you to take meds, the only issue I have is not being able to sign up so I don't lose my stuff again because of some unknown error",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRkZxNFFyaXBXd01iYmhJNURWTmNCYzdyWmJ5U1VXY0JRSEhDVUJSZ2k1X01Ma3FoYU9jUUl2dEZ2akh3aXNDZThKM204eHhiOVRyV091WXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "C. M.",
        "comment": "I would have rated it 4 or five. However, it does not allow you to schedule a reminder for meds you take less than once a day such as a Prednisone taper, or a weekly injection. Those are the meds I really need reminders for. The app is no good to me without out that ability.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRlJ1aXdZZGZTZWk1M2RvU0ZxelRtaGljR2hZcEpkRXRPTDJyZDR2WU1HWEtxNVhFZDV0eVZGOHN1eHRYdUlSbUdVZEIyVEl0Y194bndfTEE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Derek Beer",
        "comment": "I am horrible about remembering to take my medication every day. Thanks to this app, I have been taking my meds every day and have never been more stable!",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRlNBQVQtbEZyemRKdXdiVEJNbzZ4dW44NFNjbnpZWVdCb1k3V2JadjVjWkxSYkN0bnNxSUM2eFU5RU9tdVZTM1NjckFxN25mWk5CUWd1cHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Michael Bauer",
        "comment": "It's  too much for me since I take the same meds every 8 hrs. So I didn't even bother to enter all of them. But I can see there was a lot of effort to make this useful for everyone.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPR0J0Zk5xa2xubHZ0Mnp6TlIwUHdxNjlqal9SaU9obHRWeVZON2ZlZ1E5RlRkdkR0WmhFNlBiTTVwb2dleDBKZTEybXU3RTNwMEp5QXUycHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Kept me on track better than anything else I had tried.  I've already recommended it to several other people.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRlp4WDRxQzBVbHc2a3B0NkYtLXBtOTl1eC1vUnJoWmw5YzFmR1ZuREV6Ym5mZlZucURXaWVvcmpfZFMtT0cxRHVuWHlwOGZ0WDFOQnF3anc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rohit Guin",
        "comment": "Please notice there is one pr0blem!!! The notification is not always popping due to whichh I missed my meds few times. Please fix it.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRzlWR1JUckI2M2R4cnhIZVptNUZOcmlyc01RY3I3c2hZdDM2V1llWHI5eWRGd2dJaFZONF9QbmkySmJMcE4ySF80RlpYc2o0X0pjLUl3QlE",
        "reply": {
            "author": "Medisafe®",
            "content": "Please turn on Autostart for Medisafe in your Autostart Permissions settings. Please choose no restrictions for Medisafe in your Battery & Performance settings. Please allow Medisafe to wake up your device in your Power Settings Policy. Please contact us at support@medisafe.com for further assistance. Thanks, Medisafe Team.",
            "date": "February 27, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Martin Atencio",
        "comment": "Great app.  I like how you can snooze your alerts until it detects when you get home.  It would be nice if it could remind you to do any required exercises or stretches.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPSFoxdnpZMFRPMjI3VFdaMWhPcDZuMUQyT19VZ1ZZeDZZVGg0TUgxRk53bUJBLW53NWVDbjZLRFlyRjRXbUQwR2R0OVhRaFdTcjBVWFZ4Q3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marc McLaren",
        "comment": "It used to work great.  Now my early morning med set for 6:00 does not give a notification until late afternoon.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.medisafe.android.client&reviewId=Z3A6QU9xcFRPRWN3eHMzZDZkS3htV1dFTUQ3cW53RDFvVkpmTWF6bEc2WmxfYXpLY2FKZHhkdjE0SHQ0M19TeXVETHJWb3lYalpXSldxRzZnT1JXTUVZaUE",
        "reply": {
            "author": "Medisafe®",
            "content": "Hello Marc. To fix wrong reminder times, please tap ‘More’, tap ‘Settings’, ‘General Settings’, then tap ‘Refresh reminder times’ (under Time Zone Settings). This should adjust your schedule correctly. Please contact us at support@medisafe.com for further assistance. Thanks, Medisafe Team.",
            "date": "February 21, 2018"
        },
        "star": 2,
        "title": null
    }
]