[
    {
        "author": "Peter Hasson",
        "comment": "Since providing initial feedback and response by provider i have updated to five stars. Accuracy is now spot on and layout and other information is great. Thanks. I like the look and functionality but unfortunately the accuracy is not great. Often shows to expect rain on rainless days. Temperature and and cloud cover reasonably accurate. If forecast was consistently accurate I would give 5 stars. I'm using the paid version. Thank you.",
        "date": "December 8, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSDFfa1FoTEptM01pWnJTR1djeVE2bTB2QzBNSllyMUpLZV9IUU9BOXp4WkJvSjc2NG0zNXJwLTgtb3JSRXVDUHFLZG1FMGZ1T0VFYnQzUWVF",
        "reply": {
            "author": "Apalon Apps",
            "content": "We would like to provide more precise data for our users so in case you are facing weather inaccuracies please let us know weather details for the selected location. For this please swipe up the main screen of the app until you see Report Weather box. Select the current state of sky & clouds and precipitation in your location, then tap Send.",
            "date": "November 30, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Evan Arnold",
        "comment": "The widgets don't work for me. They'll be fine for a few days and then they'll go blank and never show anything until I replace them on my home screen. The clock only updates when the weather does, so you can't use it as a clock either. It looks pretty when it does work, though",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSHREX2NlV3VQMG1tMUdMS0dRRGY3eFFtWWlRZlhQUUs5YzJnU19CVzdXU1F1aDRhX01VbXRmQm1OVTZ4dnNnbm9hY2xLRzRTU0pqM0pNR1c0",
        "reply": {
            "author": "Apalon Apps",
            "content": "If you have any type of antivirus or battery saving software installed on your device - please make sure that it does not interfere with the work of the app. If the issue continues - please let us know at support@apalon.com. Thank you in advance!",
            "date": "February 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Nikki Knode",
        "comment": "PERFECTION!! I HAD UNINSTALLED THIS APP A WHILE BACK DUE TO THE MY PHONE PROBLEMS, THAT HAS SINCE BEEN FIXED AND I HAVE NOW GOT MY WEATHER LIVE BACK ON BOARD!! ITS A VERY INFORMATIVE AND EASY TO USE, GREAT WORK DEV TEAM 👍 ❤️ ❤️ ❤️",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSHZHOFlUZjVYMzFybVhvaW1rTlpVb2RRazNfVVlrM0RpOVFIOWdEWU5KOWV1VF9qVlllRzYwVDZnazBPSUN5dkZaVUdqaDlnbzRSWU5HWV9v",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Spencer Vass",
        "comment": "Great app, love the details. However. The radar could use some tweaks. Id like it if you could slow it down, and instead of two hour increments, make it half hour so it's more detailed and useful. At the moment the radar doesn't show my information I can use. Also, the background pictures of the weather need to be formatted for the Galaxy S8 screens.",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRjFBOVpkWFpqbzhUUE9xVWY3YXhLelpEbmRmWUNEMXlMUGI3UzlnOEVWdTRJN2R5aWE2eVpXRG1walFjdDBhdFV0cnVjOVZ5azVwSUpQUHU0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "What did you Do to this APP?  I can no longer send Corrections when it's Wrong?   Do you Mean even when I don't WANT to use the \"Live Wallpaper,  I have no Choice?  And have Less Functionality than with your Less expensive version of only. 99¢,  to just Remove Ads?  Why did I pay for More,  but get less?  About to ININSTALL and Return to the Junky Stock app run by so-called AccuWeather",
        "date": "December 7, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSGxpV2VNdUNoSEtfX0ZaSEQ2bERmWFQ2NjlmM2s2NmNwbFBmb1UwNFRHLVBKVFdrR1BWUUVEOXVnXy0wVDkwemhMaTd2Z0RhcUdndnpPM2k4",
        "reply": {
            "author": "Apalon Apps",
            "content": "We appreciate if you could contact our support service (support@apalon.com) with a more detailed description of the issue so that we could try to resolve it for you. Thank you in advance for your cooperation!",
            "date": "December 8, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jan-Philipp Lauer",
        "comment": "Great, accurate weather app This app gives you accurate, official warnings from the national weather services. I've tried it with the Belgian and German weather services. You also get a warning for example half an hour before rain begins. So far I did not experience any errors in such warnings. Keep up your good work!",
        "date": "December 8, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPR2gzQmx4cU9ENnVrV0x3aGE2UFNvZDQyLXN1MURjNzZHTUl0d0liVGxYTndYSkc5NHVIQ3VBS18wTHRMUTJ1SWdvZXkxdEZ6X1hUOGNSQ2dN",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Carol F",
        "comment": "This app WAS perfect in all ways, until the 5.8 updates. Now I don't like it. They put too much info in it so I  have to scroll and scroll through \"fluff\" to find what I want. Information, layout, looks, use was perfect until latest update.  I have it on my Kindle too, which didn't automatically update so I'm still happy with that. Just quite sad about 5.8 version.",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRkVod3AwNjRTOE9tbXlzS0RhTGU5VzZQaUdDZzNVcWFMUktvOTdYMm40bTZocXVRa01RNUFPT1F1T3hpTGlxNWwyV3o2aWpGczZ5b0YtRU9V",
        "reply": {
            "author": "Apalon Apps",
            "content": "We are sorry for the inconveniece. We appreciate your comment and will consider it while working on future versions of the app. If you have any further suggestions or ideas - please let us know. Thank you in advance!",
            "date": "November 20, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Vivek Ghildiyal",
        "comment": "Widget shows random locations even though I have selected my location and  location tracking is off. Edit1: Ok now I got it. Track location options has to be turned off during the widget setup as well. That checkbox is not clearly visible, could you do something about it please.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRU1KVEFUX0JQS0R0clNodFE5SHd3ZFFFS3lOa1dTbkFFYmlWSW9SaXAxVXlmNTVnUlQ2b2xXc3NOWGZXQTR5RkZubzljeFg5OGZFc3BEZF9V",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dan Spaeth",
        "comment": "Great weather app! Newest update made it even better. Only one suggestion - make a setting where the user can choose the data source (the weather channel, weather underground, NOAA, etc). Update to my review...... It has become a little glitchy. Sometimes when I open the app only the background pic opens but no weather info appears.",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRXlFYUp6T0RQcUUxSUFUNWFzcG5NRWJNMHZaUnNtM3VqYTA2NnFYR0lEMnFuWWE5cWdUem5uUVl3NWFiNndtdTlaVlFxVG5XTXlLNGlNMlBR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Michael Young",
        "comment": "Excellent app and worth the money for accuracy and no ads. Just had to update my view again about this App. It's so spot on and I use this rather than general TV or other weather channels. Highly recommended again and again as it's 100% accurate and so perfect and spot on. Plus if you download thus app and upgrade your see exactly what I see a spot on App.",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRnlmUV9QOGgzcEtKLXZLSTNiblFlRTJUYTNhX003T2NHQmdXRlVlcUd3ZGlBZ1ZtWFdKUC1Ob2FJRk9EMEItTEJxZ2p5ZUNaZERTZjdKVGk0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jacob Flynn",
        "comment": "I like the app so far. The UI is detailed. The radar maps are easy to use and animate. Thankful they animate. I hate how a ton of newer weather apps lock the radar and radar animation behind a paywall. This app does not. The only thing that is lacking for me is the detailed forecast. Alot of info is on screen. That's great but a text overview would be great too. That is the only thing keeping my rating low. If it is there, I can't find it. Animated backgrounds for different weather effects would be amazing.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRlRvMXJTR2lTY0VrQWk5UXJFblZfS3lZTF9xMFluY0NoTlJZTDN1emNrWkloLTJYa2VIYi03cjBmQjViSUprNUpnR1l0V3p5NDRGTG1JSzFF",
        "reply": {
            "author": "Apalon Apps",
            "content": "Thank you for your feedback. We appreciate your comment and will consider it while working on future versions of the app. If you have any further suggestions or ideas - please let us know at support@apalon.com. Thank you in advance!",
            "date": "January 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Nicholas Meyer",
        "comment": "I think the fact that this wonderful app still supports Android 4.1, is awesome. It's very lightweight, but also very informative. When just asking Google what the weather is like in your area won't cut it, this app will never let you down.",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSGxneDlaSTg5emFyLTZmVXFPZnpOMTFNdU50aTY2N0hpY2tKc1JLOHJrNVZYZlpFOUhPbGpfSVk2Z3B0M29fOVB4VFRET2E3ckpjM1lvTmlj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Cliff Fitt",
        "comment": "A good app, lately the accuracy is out. Been saying snow, blizzard for the past three days but the weather has been overcast. Today cloudy bright ..sun shinning but app says snow. Have sent in corrections but no change. Sure you will get it right.",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPR3FMWUZidnpYb2tER1drM2sxbVI1SlFYWFlZenBJZWd2djYwM2ZLdzlIRGduUGVSRUNTdnBRYnpPVmFmWldUS3BSQ1JsUXZGVHBSN25CNzFB",
        "reply": {
            "author": "Apalon Apps",
            "content": "Could you please specify the exact location where you observe this? What is the actual weather that you see and when did it happen? Thank you in advance for your answer.",
            "date": "January 22, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Roo Franzel",
        "comment": "This is usually a wonderful app but it has been wrong for days now. So often it tells me there's a network error in to check my internet connection but it is definitely not any of those issues. There are no updates to fix this. I don't understand why the widget isn't working now. Normally I love all of the extra bells and whistles that come with this app but they need to work on the network connectivity issue so that my weather is accurate.",
        "date": "December 19, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRVlBdml4RFpQdVQ3WEpsWG0yTTVfTkFWc05nbHZad0U5RVpwX0Zhb2dVakphMEFCRTd4Q0h0VlFvb1ZVclRjYlF2WkFEbC1IQzZpeXczTHdn",
        "reply": {
            "author": "Apalon Apps",
            "content": "Please try to delete the widget from your home screen and then set it again. Regarding the Network error, please go to the device’s settings - Apps - Weather Live - Memory - Clean cache/data and try to reinstall the app you. Thank you1",
            "date": "December 20, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Sam Mee",
        "comment": "All beauty with little substance.   The radar is a projection of the next 24hrs.. Just give me realtime radar. In fact the map that you give isn't even always there. There's also a whole lot irrelevant info that I need to scroll through.  Make it customisable so we can chooae what we want.  For almost $AU10, I was expecting so much better. Accuracy is also pretty poor.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPR3pXTEoxWHpzcjZlTnN4clFtVFlqQkc0ejl1c0lHU1RzLWlQQTVkbm9iQWVKOTNpeUJpRTlPak1ldHNaWmh2T1d4ZVcwWEtQdjBTSjNQeFNr",
        "reply": {
            "author": "Apalon Apps",
            "content": "Thanks for your feedback. We would like to make the app better and more useful for you. In case you have any ideas on how the app сould be improved - please let us know. Thank you in advance for your cooperation!",
            "date": "February 26, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "AKIS A.",
        "comment": "Please make a standalone Android Wear app like on Apple Watch. The notification based approach isn't serious. I dismiss by accident the notification and later if I want to check the weather I can not. The app on older and new  Android OS 4.3 , 5.1.1 and 7.0 devices is fast. Great on Android TV. On my Mac  and iOS devices too even on iPhone 4. Great app support.  So only the android wear app-extension is the problem. Thanks for the great work  and the agnostic platform approach",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRlZZQ3BSTDNYT08yeUVpaDNNT1ozSERTRERlSVRfNVhMbUNRTXBfTkVwMWZkMUgySHV2aWxEZU51YXRtejhyaWN6aGhBQllqTDJnVVNKVjNV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Wren",
        "comment": "This keeps triggering alerts for excessive data usage. There is no legitimate reason grabbing the current weather should need that much data and so I must conclude that this app is packed with spyware. Uninstalled and replaced with privacy respecting open source software.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPR2hBTXJCUXMyUURyOHNGY3M3OHloSTNkRjFtUjlYbTRCVjRzLWpRLWs0UGI5dlQxN3AwSnFmdnIzazBNYjgzMVo0bktQdWE1UHdqT0pVRmxR",
        "reply": {
            "author": "Apalon Apps",
            "content": "We appreciate if you could contact our support service (support@apalon.com) with a more detailed description of the issue so that we could try to resolve it for you. Thank you in advance for your cooperation!",
            "date": "March 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "John Stogsdill",
        "comment": "I'm frequently frustrated by this app.  When it's working, it's beautiful and the weather info is reasonably accurate.  However, all too often, it just loses the weather info: the screen remains blank except for the background. I'll wait to see if it loads, but nothing.  I'll pull down to refresh it and the info appears for one second .. . And then back to the blank background.  Force stop the app, restart, and the same thing happens.  Too much hassle for my primary weather source.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRmdZblBtdml4cVNScktDOEtWUHdiSEFxZzQxd18ybE9lTVA0TGRWRGdIZHlxSWN2bHN3LWh6Y2lGM25ORzhldTNXR2RweE9UVmhCc2pKNVdv",
        "reply": {
            "author": "Apalon Apps",
            "content": "If you have any type of antivirus or battery saving software installed on your device - please make sure that it does not interfere with the work of the app. If the issue continues - please let us know at support@apalon.com. Thank you in advance!",
            "date": "February 19, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "deborah praill",
        "comment": "Bought this app 4 days ago, so not the free version. It does not keep my actual location and as for detecting the correct temperature, it's way off. What a waste of €6. I am considering asking for a refund. It's the worst app I have ever bought. Oh and before anyone asks, no I don't live in the outback or any weird place.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRnFaSjIteW5VNXRsMzRSY1FiRWNzRC1YOS1RTHJTX3dhZVN6WXBqYnNuSHplR2FwVk9xc0hWYXloZi1ZR2lNM2w1Skk2eHdFVUlxaVlRdGtN",
        "reply": {
            "author": "Apalon Apps",
            "content": "We appreciate if you could contact our support service (support@apalon.com) with a more detailed description of the issue so that we could try to resolve it for you. Thank you in advance for your cooperation!",
            "date": "February 28, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Valentin Brasov",
        "comment": "Always shows incorrect weather forecast and actual temperature compared with other weather apps for Edinburgh (UK). I stopped using it one morning when it was showing a current temperature of 1degree celsius after refreshing its data, when actually outside were 10 degrees!",
        "date": "December 3, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSFNTcUtGNDFscXh2dVJwdGVBSFllVk1sbjRYQlFRc1UzXzV0eFo0OU5xcXBfLWNwdFAxdlJpdnBndG1HMDh6NzREbXJnUEdTT3V0cmotM2g0",
        "reply": {
            "author": "Apalon Apps",
            "content": "Thank you for your feedback. We appreciate your comment and will date a close look at the data for your location. If you have further questions or ideas - please let us know. Thank you in advance!",
            "date": "December 4, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Chaz Christensen",
        "comment": "Pretty nice app but the radar isn't very good. I want it on radar, not rain and when I select radar and go back to the home screen. Then go back to the radar, it defaults to rain, it should remember what you were on and stay there when you go back to it. It's a pain to have to select what you want every time you open the radar.",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRkp1c0Fkd3B5S0RWTjV1SGZWTHhUS1ZISXl3TVdpRkx0YjZ2eXk0WVd5bkdJampiejhNdlFlM2ZIUWJqeFotSnVKTFJ5Qll1dTUxNWRaVjE4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tasia Smith",
        "comment": "I've had this app for a while and it works pretty good. It's obviously got a very slick visual design. I really don't like the recent redesign - I used to be able to see the upcoming days' forecast at a glance, now I have to scroll to see that row no matter what layout I choose. For some reason the app also regularly deletes my saved cities preferences, so I often have to re-add them (and this is an issue that has been happening for at least a year; I emailed with the developer about it and they didn't seem to understand what I was talking about and weren't able to recreate the issue - but it continues to happen. Maybe every time there is an update?).",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRThrUGpwQnFUSUlobU51dktiVjI5dURnMXo2NE1ScDFwU1lzX295N0ZZMm13SkJadzhYaUJMZ2hveVlXano2Rm8tcHRsZk00b3ZHRkxEU2pN",
        "reply": {
            "author": "Apalon Apps",
            "content": "We appreciate if you could contact our support service (support@apalon.com) with a more detailed description of the issue so that we could try to resolve it for you. Thank you in advance for your cooperation!",
            "date": "January 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Mary Horwath",
        "comment": "I use this as my background app, and like it a lot. I would  like more customization such as adding the current moon in the night sky and the sun 🌞 in  the day sky, according to the location hours with an option of adding a landscape of the users choice definitely would make it five stars. Weather is accurate and does auto update.  Please add more background choices, it is only lacking that.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRzFNSUxOWWNUMVREa2Q3OUNNQW5ZSTk0ZzV0MTd6WjlXZEtBR2UybXN4dEw5bWV0YURDNVZwMVZsNWh4Si1Qd1g4OFRMVkxsbEFrOTd6dkhv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Anthony Huttley",
        "comment": "Temperature is rarely accurate. The local board in Matsumoto, Nagano, says 4 degrees C, but the app says -6 degrees C. Pretty massive difference. Also, the conditions are often wrong. Lovely interface, I love the widget, but it's just not accurate.",
        "date": "November 24, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSF9GN3hHQ0hSM3IxcFdRSWtIRGh0bWplOXhmVGxtd0JEaXB1RTJieldPbml3Q1ZnUTNZbjJQU09hOXZrX0gwelktLWR0NC03ZjRvTjYydjRv",
        "reply": {
            "author": "Apalon Apps",
            "content": "If the forecast data is incorrect - please try to update the data manually by pulling down the main screen of the app. If this does not help - please let us know the name of the location with an incorrect forecast. You can write us here or contact us via e-mail address support@apalon.com.",
            "date": "November 27, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Lou Natick",
        "comment": "Another useless weather app always wrong,,,by alot. It's a dark winter day here where I'm at and app says it's bright and sunny,,at 4:30pm. It's always the case, temp is usually off by 10+ degrees from other apps and local radio/tv stations. Guess it's affiliated with Inaccurate Weather, no wonder,,, Uninstalling (again)!",
        "date": "December 15, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRllQSlFrNUZpUllaYktxZ1B4UExOMXdLZEJpZFpCNjJsVUFLYTdRQTAtR3QzOUZaYjJiVjh0ZUdUVEpaVDBacXp0UWRhUExWWDBpeThyYzNF",
        "reply": {
            "author": "Apalon Apps",
            "content": "Could you please specify the exact location where you observe this? What is the actual weather that you see and when did it happen? Thank you in advance for your answer.",
            "date": "December 18, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "David J",
        "comment": "love this weather app....  My only problem is the live wallpaper crashes at least once a day.... I have no battery or security apps running that would interfere with the weather app and have also set weather live not to be optimised in my battery setting to try and fix.... When the live wallpaper does crash it always shows a static background of the cloudy daytime weather no matter what time of day or actual weather. EDIT... Changing the update rate to every 3 hours seems to of solved the problem. Thanks.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSDhLeGtuVW8tX3JfdWN1YWtQd1BsMkJDaUlMWlNDTWhrZGtyNWtwNEVKX0NrQ0tkZEx0Y3IzOGZkMGVQeWRESGhiQmdsZ1k5Z3hXSnFsMmVF",
        "reply": {
            "author": "Apalon Apps",
            "content": "We appreciate if you could contact our support service (support@apalon.com) with a more detailed description of the issue so that we could try to resolve it for you. Thank you in advance for your cooperation!",
            "date": "February 22, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Phill Chapman",
        "comment": "I love this app and use it surprisingly everyday ...  i use the radar maps alot incase there's a few good hours I can get in some fishing with me mate...doesnt help much with catching them though.... love it and bought the app... cheers 😉🙃🙂☺",
        "date": "January 12, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRXQwWEZ5ajA0dUJ4TzYxMGVMaEFVSk1UNmN2ZGhWQnUzVlBORFhadURPemU1cF94NjEtS0hIOHdCcHRBNWpZZXpoRktqVWcxQTlkQkc5VDRr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Eric Bell",
        "comment": "When I had this on Apple it was excellent.  This Android version keeps giving me nothing but the animation and no and nfirnation at all.  My internet connection is fine!  Not worth the money at the moment.",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPR0g3cTkzd0U4SUh3VW5sY2V3UzhQZVczQ1hlbGU4dG9FUVBqa1c3MWlpWnJtYTlyTFg2dHBUb0lkNXZ6OTVoQkhTOURubVY5OFlqTW1XcDRV",
        "reply": {
            "author": "Apalon Apps",
            "content": "We are sorry for the inconvenience. Please restart your device and try once again.",
            "date": "January 3, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Only thing I would like to see changed is the spacing -- too much space between the top clock and the temperature = dead wasted space were vital info could be. Otherwise this is a well done app. Though I would like to see a widget that reflects similarly to the text only display. The widgets as to cluttered -- one thing is to cluttered the other not enough 😀",
        "date": "December 4, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSHFLUnlBdG9pX29lbWtxMnlLb2N2enBYMkd3dld3ZWl0S0hwZ1NIY05lTzhnWHkyMXNXUGRLMTY3cmtoRndnWFE4alZDZXdWRzc4TERyUW53",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tom Kennedy",
        "comment": "Wind speed (mph) way out showing 5 when should be 26 mph, in NE England 03-01-2017 ============================  I did as you suggested, swipe down, but still not correct, other weather apps are right on the wind speed, unfortunately not weather live.? ===========++++++  Wind speed still way. way out, local saying 20 mph, app showing 4 mph??? 20-01-2018",
        "date": "January 16, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRWdsSjBYSUR6cE1GOEx0UXF1em50ZHlCN2lMSWJZTjM2dWdmUzY5d2hrYWJUSDJvSTYwWVd2YTh1UUdTQnVIaklHcVpiN0lIWW9JYXVSU1Qw",
        "reply": {
            "author": "Apalon Apps",
            "content": "Thank you for the information. please try to update the data manually by swiping down the main screen of the app. Thanks.",
            "date": "January 4, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sabiruzzaman Chowdhury",
        "comment": "Used so many different weather apps - paid and free. Finally, I think I found something that I'm gonna use for a long time for sure. Only the 'cons' is its price. Expensive for an app. Anyways, it what it is. Hope I'll get what I pay for.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRUxLSmRRWTZLa1Q3V1M0ZUVxcHRiT1BtdnJUbmxCcVdHNG1ya1l2cVRkOEhwLTNkclFQSFRQTWVqbUV5QkxEd0VBWXZqY2F5aXFRUF9HZEc4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Anna Sage",
        "comment": "I use my tablet for weather reports. This app does both a vertical and horizontal views. It has appropriate and beautiful background pictures. It is very clean and professional-looking. It has all the data I like in a weather report. The only additional thing I would like to see is an allergy report. But it still deserves 5 stars. I am very happy with it. Good Job !",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSEFQajFCeWFZR0l3WXJrQU1tWlpjX3BnY1c4TXJlU2FRZjBId3MyVlpxSFBEeHI0NVNwcnhHZ3BvSHR3cUQyRFFmTjR4YTN0MXN0cU96QUtB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Adam Strick",
        "comment": "A few days ago, my widget stopped working.  I cleared the app data and still just a blank box on my home screen.  I uninstalled and reinstalled the app, nothing.  I get a network error or something over data and wifi.  I loved this app until it randomly broke.  Accurate and convenient... I've tried many apps and this was my go to for weather.  No longer.  I'll change my review when it gets fixed.  Oh yeah, and I paid for it so...  Edit:  today it started working.  Idk why it just did.",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPR1hlMEdYU1hMQmh6cWhKWXdYeEl5c1ZXWEo5NHJodGVHenRFQ0hpMWl4bGJXWlkxTmxNTEpBa3M5THY1NERlSVB0N3F4SHJNSWg2SjUyRlRz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Joshua M",
        "comment": "**Update ** customer service reached out to help me resolve my issue. Thanks!  Been using the pay version of the app now for over a year and I have enjoyed it. Recently the widget (all versions) stopped working on my pixel 2.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRTJtM1NWTFZaQkFOemhRSmJjQ0hhczRXRDYtSDM1X281a2VHbXd0UEF2TnRqb2FNUDNnTzFsdWNuU3Y0OHRoOFdEeEpya3doYVVuZEx2QTF3",
        "reply": {
            "author": "Apalon Apps",
            "content": "Thank you for your feedback. Please don’t hesitate to contact us anytime in case there are questions regarding our app! Thank you!",
            "date": "December 29, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Yves Guittard",
        "comment": "Why have they changed the layout?  Before, all the information needed was available on one screen. Now, one has to scroll down. What a stupid decision. They should at least offer the option to keep the old layout.",
        "date": "November 25, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPR2lOVTQ2V2x5a3Y1b1ZobWF4TmdEY1RjQkJNbmE1YTcyWmFJVVliaVhIVE51QzJhV3hiemR3SFc5UU5ZbzVES0V0SVlDLXd2cmlkZWhlaVpR",
        "reply": {
            "author": "Apalon Apps",
            "content": "Thank you for your feedback. We appreciate your comment and will consider it while working on future versions of the app. If you have any further suggestions or ideas - please let us know at support@apalon.com. Thank you in advance!",
            "date": "November 27, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Michael Bloor",
        "comment": "Definitely my 'go to' app for all weather conditions local or elsewhere. I'm working outdoors a lot in remote places and this is the first app I use when I wake up or making travel plans. Extremely accurate and detailed.",
        "date": "November 24, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRzJrTjY2WF9qTGd4Q2VGUFFqQ1d2VElmeHNWdzd4bGtGcURpOG4wb1E5MkYwN3dKTkc2cEpiRUFNS2d4UExBWG9wMmV1eWprREZDdGZMelVF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Armando Alonzo",
        "comment": "Good app before but when I purchased the product it would not even start. It just froze on me. It was even hard to uninstall. Pls fix this, I already purchased it. Thanks! EDIT... Works fine now after a reboot. Thanks!",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRWIxSkF1VGdKa1k0d2t6clpxOWVVeEVFVEZSZ0hsOHg1TTN4UlJnZXdiS3hJZUVCZFNFVVoydVZkV3BDZ0NMbmdNMmxTeHc4b1JqVmZRRFRZ",
        "reply": {
            "author": "Apalon Apps",
            "content": "If you have any type of antivirus or battery saving software installed on your device - please make sure that it does not interfere with the work of the app. If the issue continues - please let us know at support@apalon.com. Thank you in advance!",
            "date": "February 2, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Edwin Jacome",
        "comment": "Good widget. Please let us change the information we see on the widget on home screen. The widget shows the time right in the middle, and it's big, but I do not want to see this. I would like to use that space to show other information that could choose. I already have the time on the corner of my phone, so I do not need to see the time again. I love the way I can choose the transparency option for the widget. Please improve the animations for the app itself. On Google play, animations look awesome, but in reality they are a bit boring.  Good all!!",
        "date": "December 16, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSEQ3R1BQLXhaSWx2R2pFMUR5NkNUWVdBS0RUc3ctS2MxQU5FNlZZZzM3TkxFM1U2R2w2WHlRRG9sZk5kMFZXZEduSURuaHhGZFNmajdwemhN",
        "reply": {
            "author": "Apalon Apps",
            "content": "Can you please specify the exact location where you observe this? What is the actual weather that you see and when did it happen? Thank you in advance for your answer.",
            "date": "November 21, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Angela Fannin",
        "comment": "This app is awsome. I live in a small, intersection town, all other apps group us in with the nearest town, not this one,  it's accurate in location and forcast.  I finally found the perfect weather app for me.  Thank you.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPSGJTRmhnYWZjWmQ2RDVyaFJnYXlvSUQ0U3FWaUFJZnRXV2lEUmtBWjQyRkg0QTJDazVJMDdvdXF5bU5MVGtfZWV4bzFFOFJRZGxQRmdQN2FN",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "kyle rawson",
        "comment": "This app is completely inaccurate! It says the temp is 18° but the wind chill is 34°..  pressure is 34.7... really only 29.4.  I have 3 other weather apps that are within 2-3° of each other. The only thing I like is the layout of the app but useless with wrong information.    I was using the follow my location,  as I travel frequently for work. i was using the app in Texas and Colorado and through the connecting states as well. (Kansas, Oklahoma, and New Mexico.) As far as the date 12/28/17-01/5/2018.",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.apalon.weatherlive&reviewId=Z3A6QU9xcFRPRmlVUFZGZThNTXhkOVpQT3huMDVoUGJrcl8zNHRmRnh2NXgzelBGSkZRZ2lfYXctbUpmdHpqYWVqb0MzLTNKWnZoS0RNNW5xMmotdHdpVEs0",
        "reply": {
            "author": "Apalon Apps",
            "content": "Thanks for the reply. We will check this information on our side to find a possible solution to the problem. Thank you for letting us know.",
            "date": "January 10, 2018"
        },
        "star": 2,
        "title": null
    }
]