[
    {
        "author": "Eliza Burton",
        "comment": "Great. Optimize for battery very well. The only music service that doesn't kill my battery during extensive use of it left in back background during long periods of time. . I can listen for minutes without it dropping a percent or overheating my device on my less than 2000mah battery. Sound quality excellent. No lag when streaming songs. On cable internet when I choose a song I mean click it either instant 99% within 2 seconds it streaming. No bufferiing issues.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRWtPaDYzVWVFYlVaV0FTTHphZmx5eDdNajJOdjlGYy1SYjBxUzZDNFRJZmVZSm5uMV9xQ1kzeGt1M0dVeWFNekx1eW1YZmhVdUVZT3poNGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Juan Carlos De Leon Torres",
        "comment": "Awesome app, but we need an equalizer built in just like iOS. I left apple music for y'all and y'all do me wrong like this. Get that eq in there and I'll getcha more stars. I still don't see the equalizer in here, what's going on??? Any app on Android is years behind iOS. What's the deal??? I really like this app but I much prefer it on my iPhone than on my Android. Just because of the missing equalizer. That's it. That simple. Fix it!!!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSDNMRGFOd0hpNXRqaGtZNGFIdk9hVU5oeFFqZDd3RW5VbVh4MEp4SDdrOVVGdUpVY3J0bnE4bm5SeHlKcmE3R1hRZVBNMTVzeGlLa3p3Y2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Abhinav Sood",
        "comment": "While I love the app and use it exclusively to listen to music as a premium subscriber, what I'd like to see more is the developers being more transparent with updates. The changelog (what's new in this update) should contain what got changed instead of the message that oh, we're always working on something so just keep the updates turned On.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRWFhbG5HMU4yU0cycGIzYlBnaHFibWtmN3ZDT1NSZjdWUWp0akQ4MG9lMGFIMVNGNFctVlRNOGdLTkdHTXVTNnkyUjZ6ZEpGcUZnOVZSREE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Miranda Hueffmann",
        "comment": "The recent update has completely killed my app. In the years I've been using this app I haven't had as many issues with it freezing or not loading since the update. I constantly have to force close the app or restart my phone because the app will randomly stop multiple times in the middle of songs while connected to Bluetooth devices (my car, jaybird x3, and sony speaker). It's becoming a headache to deal with.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSF9IRS1hY0VfSlZaMmpDUFVRSVF4bmljLWVXNHRHS1A5aGQ0dGNiS3NZLWE1bElsc01hMW1hSlBPTGxOUmw5cURjSDFQY19tRmUwcDRFV0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Mahibbur Bhuiyan",
        "comment": "This app and the Spotify brand is the best music subscription company to use in order to listen to your music. I've replaced nearly all my devices with Spotify. I'm kicking myself not using this earlier. Even the free version allows you to listen to your favorite songs in playlists. But the paid subscription is worth every single penny",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR1lhNEVMNmN5UnRyc0o3UE5Ed2NqbHRjMHJYUTVhNk9JTlgwOF9hZ2tSQms4em9nUHdXRTREWlRNS3p0VTE2MVJTMlp4emNZcVVRTFBQbmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I see a lot of pathetic whining on here about relatively minor issues. I've just begun my free trial of Spotify Premium on my S8 Plus. I must say, being a fan of 1960s music, that I was pretty skeptical that I would find much material worth listening to. I was delighted to be proven wrong. 👍 There's a fantastic and brilliant collection of 1960s music 🎵! ☺️ Creating playlists from tracks that I've selected for download is a breeze; and I can't fault the quality of the sound. Bravo Spotify 🎵! 😆",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRzAtMDFtTjBaODBraDBJeFh5VjFFV3JCOFFCaHYtWnZBQTRobzhhWWcwMW9ZX0FBNEZ1MklWZTRCWDVmVVlhTDdrcGgwVEEwbkxzbTF1SlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Brian Ogola",
        "comment": "Partnering with Genius was the best idea with the dumbest execution of any app ever. It's cool to know the background and no offense to Genius but at least allow someone to turn it off. I don't want to see the same BG info every time!!!!. Just make it such that default is lyrics. If I want to know more then I will actively look for that info. Best worst idea",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR0xqTnpoUFB1SWVXLUlxQW5XSFl2d3VHSV9TUWY5SWMycXNWQld1ejlsMG8wc0tyc293U0ZEMXlYRm80NnlfTjNsUEo0bVJQNV9MWjlVNEE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "MacGomez247",
        "comment": "This app was amazing until the update. I have a playlist that i go to for everything and it does not even play any songs starting with letters E-Z with shuffle turned on or off. I have to manually click on it if i want to listen to it and then it goes back to playing the #-D songs. Really annoying and needs to be fixed. Only happened after the most recent update.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSGYwV1lIQW9PVnZrN3dkWW0wYWNUaWdIMnYyb2owZjExbldtR0lrVTRCcjlmZ0hNMW5xQjdvelJRWHlfTS03TWJEMVJ2d3ZqV3UteTczZHc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "I love this app so much. It is such an awesome app for listening to music online and off. Some of the features although aren't that good because it will only let you do certain things without having to buy or download a premium version. Over all this is a really good app.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR2JLV1BqdkJpRktKWTVKQmpBUGxXa2MtUTlnSEc5VTlXdWo3TGotTFZ4dWFfR05DeG4yb1U2VjR3RzNxRDAyeE0xcHNLSGp1TVR3ZnBJX0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "John Heaton",
        "comment": "I hate that I can't skip after 10 with free and I am reluctant to use it when I have to listen to a song I don't like.  I can deal with just ads on the computer but this goes way too far.  I would pay for unlimited skips, no forced reccomendation songs that are not good at all being played, and queqe features for $5 and keep ads, but you guys seem to want me to not use the app at all.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRVRhYzNEZEJCMlA5V1VsV18xUnYyZFRSUEtJZzJsUXNOQ0pvYnFhU0M1ckVpVXN0cFFVd2Y0cjJPZU82akJwVWkyQjZpSmI3Sk80dkdiX1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "M P",
        "comment": "Spotify keep starting in the background and draining battery. Force stop won't help. I also lost the ability to save to sd card and Spotify come preinstalled on my sony so i can't reinstall it, thanks for that! Ashole bloat. Why does the app have so few settings for like turn off the popup for Spotify connect? App is so dumbed down",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRjFZZ3NkTGpFRjJFM0wtRkd5NHQxTUd6UGNaQlRnbWhFZlF0WEJ1N0pnVXlUaVk3akxCWGVoUnV4ckY0VkFTQXhPWXBOQnRjc3FkX1h4VWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Meet My Dark Side",
        "comment": "Dear spotify developers could you please add an option to block some songs that has been copied from another original songs. It's kind of annoying to listen an copied song. Other way i love your app. I'll be back to give you 5 stars when you fix this issue. 👍",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRWRUb1Z1R2lLdWxremE2M3phSS00aFQ0Tm9MX1ZPWG1vU3JhSGg0Ri00dGVWdWRBQXdwdXpwNE9UR1VTTXp1WXB3VjJxX0l1TWJiVURXeFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Emmanuel Mebasser",
        "comment": "I have a lot of playlists and also download my songs, but the downloads keep disappearing from my sd card. Many others have this problem, but none have found a solution.  Please add an explicit filter so we can enjoy your music without songs with f-bombs.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRnJfcW8yOENEcHNZYkM1Y2padjNyUncycTBDbE94bmRiTzg5SjhQb0hGQkNzaVIzenlkOUI2T1VaY3ZmeGxYaS14UTVpcWVVeG9kakVlQVE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Cesia Rangel",
        "comment": "Hate how you can't go back to another song and before it's never done that. And then you can't choose your own song and that's never happened either. So please Spotify, be real and don't put stuff like this in the app. I love the music but at least give us the opportunity to choose our music!",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSHIxNWd2VlRrV2JEeUxyVmxWUFZ4aHRuTkd1bjM1aXEwbjNuYWYzQ0JSOFdJeDV1WEpneG5oSDA2SngyLWhVWnd3OG4xVFo2aVNtMGF5MWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Leon Krack",
        "comment": "EDIT: Seems to be fixed for now.   Can't connect to chromecast audio anymore. Just doesn't recognize the connection that can be seen in Google Home app. This is annoying as I can't remotely control my speaker system anymore.   [[[Old review: I can only recommend buying premium, as a student it's only 5€ a month. Great service, app and diverse music]]]",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRXlfTzA2X1BzdWdTVmROcklzb3VZY2htNnBhTnl4S3F6R3E4eUxYejhRaTlWb1pjd21XYmRSZG84R1dTWjA0bVVmMDFrTjZKTEdydkxSSEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Tyler Moulton",
        "comment": "The PC version is amazing, nothing wrong with that, but you cheeky little annoyances really just strangle people for premium, if you're going to advert a product of \"worldwide selection of *free* music\" maybe you should start giving us what we want. Or just let us do our thing to fix your problem that you created.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR2hROFY1WmZHNmZfQlpxRktkdW03VzR1M3g2T0RsSjZ1c214UGF5RnlkbnNUVzlKcmdGR0g5T3Jua3E0VEhzMHU2NHE5NTdkQm1mci14Mnc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "This used to be a great app, but the latest updae changed it from a music streaming app to a black screen that occasionaly shows a \"Spotify is not responding\" dialog.  Re-installing didn't help. UPDATE:  I didn't think it was possible for this app to get any worse, but it has.  Now it shows a black screen for 10 seconds before exiting all by itself!!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR3ctTEh2MkZmSVJsUU5RbWNzZkdaU0JlQ0FIXzk3bnh3bE8xVFVVOEpReDlIUmVYeEZCd3ZDMXYzUWg4cHI1WVNjd0NDV2REbmY5YVFJcWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ahmad Zakri Zakaria",
        "comment": "You can't really get all the songs you want, minus Taylor Swift. Hence the 4 star rating. But nevertheless, awesome app.  I stand corrected, but still no watch the throne from Jay z/Kanye 😂",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRmtxM2dtZ0xUN3pURDNieDRkUm1aTFFMQlpRS3RzeVZnWXdvVV83TXl5UXdPRm1acnhWUE1VNTFVX1owZUZqeFFJbU1OWEMwTjFwZWQzSHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Weston Hood",
        "comment": "I love this app, but after a recent update I can't open the app. I restarted my phone and everything. I really done want to have to uninstall, and reinstall, because not only will redownloading all of my songs use a lot of data, but it also isn't good for your phone storage to delete, download, repeat. Please look into this issue.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR1JIUnliWURGcldma3d1QzItS0MyaXhvZ3k4THZtYnZOYnQ0NkxmNng2U1NYRUcwRVpsSFp3bTJIYW4zc0JjbnpGempVb3JsM3FXZzZSZVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Kelly Butt",
        "comment": "We did the trial, and had to have it. It was pretty much same day too. We have the family plan (which is so worth it) it's easy to use, and I like the variety. It also had lots of podcast options too, so it's a one stop shop (most of the time)",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR1NFYUN5c0VUMmd2TWRFOG85cXVHVG01bFd4QmlCZGRuUmc2RXZnTlhQb1pkaTZmcUZJdzNXTHRITTRkTFpDbEZWekx5aFYxZzloWjY1RVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kendrick Atkinson",
        "comment": "Gives me my music on the go. Plus with the family plan my kids can use it too. I think the whole same address thing is bs.... Many divorced parents nowadays. Maybe should look into that.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR2d2NHUzNTNlMXJuRzlHcHNUd3dYbHN4NElkMzJyQzRtS0hEX0FteHFkbGRPWHRLZ2V2eHhFVEQ3cEl6SUFCTFVZTXI3dnRfV3o0M295ZkE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "anthony gggillispiemgggml",
        "comment": "Was enjoying Spotify until I started getting hacked constantly while trying to enjoy my music.  Spotiamb or something to that typo is using my 9.99 plus tax app more than I use it.  I need half refund from someone.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRnlTeGlGQ25DSTVWRmM1UEtXY0VERDd5TTFBMHo0NWN5QVFJOURWT25DRmgwd01nb2VXZGpvUTVZM1pXUER0c3A1MWhkTGNqS0l1NmJqRVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Eronic Herrera",
        "comment": "Moving to apple music. Spotify's no premium restrictions make the app unbearable. Stop the reccomended songs in a short playlist, stop the ad that doesn't actually give you 30 minutes. Terrible. I hate this.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR2pKazd5ZUt2UkhRVVgzTWllMGh6aEJvQlh5MWlCWHNrdWdrN25sSzV5NkJqSlJTdmhGak5DOHZMOVctWktpaE1YdXdXdFVYeWtxR3ZCZlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Rokas Krivaitis",
        "comment": "Awesome app and service, especially with the student discount. But there are things that I would change. I can't seem to find the entire song list in the artist page. Also a HUGE flaw is the recommendations, especially after you search for a song. I can't find a SINGLE person who would want to listen to all of the search results, I would much prefer listening to songs similar to the first one.  EDIT: Just edited my rating to two stars because they removed one of my most used features: the running services which adapt the music to your BPM. What makes me even more mad is the fact that they did it very silently and don't even give a valid reason on why they're removing it (probably because of the partnership with Nike). So I tried the Nike+ service (which they're boasting a lot) and connection to Spotify doesn't even work. This review will probably remain the same because I'll have moved on to a different music streaming service.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSFlFa1NIV2hycjZVREp4TE1zLURLdHVFMlpDT2dFTmxOR1lqRUY1dTlmVS1tUXVkM20tOHFYV3J5M1VBeVdvU1FMNUpnckE1T205Wm5KOFE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Darshak Shah",
        "comment": "Several updates later they still have issues on the LG G6. Also the integrated offline mode option as part of the drawer at the top doesn't communicate well with the app. One will say I'm offline and the other says I'm online. Disaster... It recently doesn't handle online or offline playing, with the UI freezing frequently.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR0twM0h4YVp4SEw0dTJmdzVtQ1Y2R3ZFcElkSUNpalBURGU4enJoTGE5SlJMZVVCY0FoVkN2Sm1FTElxdmwzbU1scUo5b1JjWE92Y2ZPS2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Mr Quickscopes12",
        "comment": "Lately since the newest update all my music keeps pausing and I've been a premium member for quite a while now and it's irritating because all my music is downloaded. Fix and I will change to 5 stars",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSHpibDJBQjVsaVB2ODJobFYtNVZlRGE2SzNqVmJVNF9ybjdBUzY0eTNIeWw4aUNRdDRRVWs5dzVHRHNkdUdNQnBQUzUtTjJfYW9TcS1WOVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Emmerentia van Niekerk",
        "comment": "I really like Spotify but they recently removed my favourite feature: the running playlists that match your tempo. Does anyone know why they removed them or if they'll be available again soon?",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSGFocTQxNFdXWkN2aWFpdUtUWGkxNDlULXZKQzNOSWJoR0VnLVN4RmUyUkRWUGpVQ2NoV1d4TTBPMDNDVFBlSVN6WUR2ZTlGQmhaczdGcVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jesse Robinson",
        "comment": "It's a decent application, but suffers from constant crashes while using it linked to Bluetooth on car headunits- it'll play an advertisement, but then completely freeze and require a force quit and restart of the entire application, of which you have to choose a different playlist from the one originally playing otherwise it will refuse to play. I shouldn't complain about something for free, but when it's barely functional and keeps demanding you try the paid version what incentive do I have if they can't get the free one to work right?",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR216VFBFdXVUckhmN21nY3c1c0hiMVZfQ3B4NERkbTR4dVdIMmVNM1JKdDdJRkc0RHVNQXFTbWpmN3lsSmZiUDFQS2dxZmwxaThXQXhiVUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Yazid BMR",
        "comment": "Okay Spotify is by far my favourite but please... Get the approval for Twice song it'll be a hit trust me and also some k-pop groups album are missing like Navillera era from Gfriend and Heart Attack from AOA",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRWZYNnRrX2ZsM3M0LTFDVHMya3BRdDdHRUpSRzZXbnZOT2oydTBmdDM2N21pQVhUN2hpbXRzVUJ0c0pQOW9sbGZiWjRjbGdFbU5JZ0pPU2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "The new interface is ugly and feels overblown when it is actually incredibly simple. Perhaps if you guys make the design match with Google's Material Design than the interface wouldn't feel as big as it does. A bad user experience leads to lower usage of a service.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR1RRVTBxRnR2a0gxMU13N1BwbzhuWmtXUFVFVzBXazBzSS16bUVjRXdZYUJqbTAwWUdfSDFiT1NFdWVsMmF6cElRdHpzbUFtMXRxUkN6WEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ivan Wibowo",
        "comment": "This is the best streaming apps for music, especially the interface. Fantastic. But one thing that let me down is the song selection. As a fan of Japanese & Korean music, i think this app lack of collection for that two kind of music. Apple music is far better for song library.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSEQtMDVMb2hIdl9XQ2ZjQnpRa0dLM3oxYTVCUVk3UXl0dTBibHhCSFhaTU5HdXZxTXVvVnhwdk1aSXpiODdWcnF3ZzkyMTJNZHNUbFdpOGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "William Rodgers",
        "comment": "This app is great but lately it's been horrible. Not to mention you can barely do anything without having the premium stuff in your face and the new layout is horrible!",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR0RvTTNTSmYxNzMzNW1PQXBwR2xRa0xmY29FZThHZUNuUTBWMHJoQm5lRHRGQnRmcHF4NGFkSGhEUWkxelI5WG5sZ1B2TUFRQXMtWTlScGc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "SonDraFab",
        "comment": "This app, even though it does have ads when you don't pay for it, is awesome for listening to your favorite music. I have personally had a great experience with their customer service, they make their emails back to you very personalized and help you in any way that they can. I really recommend this app!",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRk5VNHlZZzRPUEUzRk1kNTFiMjlRVmdHZVl4UmVMUlV2S09UcWY3OFJDOGpNNzllOFFKQmlFc3hsYjhDRkMyVFZOMXlMWVlfN1d3UktSVHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Craig Hargin",
        "comment": "App freezes up drains my battery..spotify is not the only game in town other apps hange one third the commercials every two songs a another add.  Rediculous..the new update has less ads thank you 30 min. Free",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSEx3R2ZQekNwQmE0OUNUYUpqTlJlTjZ2R3pFTkNjV3B6aFhSdXUta0tydHZ0N1hBT0Z3aFgzUTVoOTUzQ1J2VjEwSUNQOHRnZUFaV3pNZ1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Don Signorino",
        "comment": "We STILL cannot edit playlists from within the app? Really? How is it possible that  we are in 2018 and we are still unable to edit playlists in the Android app?  You have got to be kidding me.   You can do this in iOS for years now. Come on, Spotify,fix it already!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPSGtPVUI1RWpORk1CN0UzQ2dWNEtBdU1PTUZKYkpvVnR3TTcweWxPQ1RQRXZheDNVR2Q3X05xSXFOa1ptbFJyVmIyeDZhWDhjb1FxSnZOYnc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Hamish Thwaites",
        "comment": "Local music does not work, and even if you try and use their method which requires a PC with WiFi it won't work.  It's missing a small number of songs which would be fine, but if you can't manually add songs then I won't be continuing premium.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR3VuV3dOaU9GckswTGoxdm44T3B0UkRvQXNvRHpZWlk2WHhoNlhxN2xCSVM4ODlTUHZ5RDB6bEVoZzltcFVjeHJuYnRrZF9GWDAwWXNuY2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jason Dep",
        "comment": "Randomly stops playing songs...now doesnt work at all....also Christian genre has been removed...please explain...please add it back again...you're a music streaming platform....not an ideological platform where you shun one genre in favour of another....",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRVdXWDFubEtuTVdXejNuYkpMQXp5bkRxR1hNeTV1TV9fSEpOTnN6U1p1Y2wwMktQUl81cW5Fa1Rjb1pWQ2tUZmtrQm4tUXFwdDA3WS1HS0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Leah Deans",
        "comment": "It's a great app, great to use offline as well. The only thing that keeps happening is that the music is fluctuating from quiet to loud. Apart from that, I recommend to download it",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPR01BLWFYZlJ2VnBLMUVUeG1uaG94QzBWa1VPNWNSMGhUaXpNc2VRbnE5ZElGd1l4eEhKQ2FEa1NKNGhYLS1IdE03bzBzMUtXcC1mM3RQZUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "matrix_7x7 WakeAfar",
        "comment": "as a premium user... i think its a privilege to get know whats updates change... something like transparent updates log to users... and the shuffle thing is always loop on same pattern... please make it random",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRmN1ZUM4eGxpSkZHRmVXRDJSc256RU5GcWZmZFN0ME9La0hVZy1fTzFPWURNN1Y5NEhreHpwVjJHdzN6c0pEeFZuWEZXSWlDemI1RDlKSXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lindana Jones",
        "comment": "It's beyond ridiculous that you can't actually listen to the song you want without paying $10 a month or $5 if you're a college student. That's $120 or $60 a year down the drain. It's ridiculous little things like that that make it so obvious this app is all about the money. We aren't asking for an ad free app or for to be able to download offline, but to be able to listen to the music that we actually want without paying. This app is awful. Do yourself a favor people and find another app.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.spotify.music&reviewId=Z3A6QU9xcFRPRWNUMGtvSjl6S0xicU90dUU5cm9vaVBsTWNwQnU0UkZuZ0Jzb0NVd21JTEVZN1FvcURsODlkT0lrOHN1Q0NoYkFQV1I4TGFnY1Q4Y1RKWlE",
        "reply": null,
        "star": 1,
        "title": null
    }
]