[
    {
        "author": "Robert aka TioB",
        "comment": "I've found my Tab 8 camera a feature rich addition to an already very well designed tablet computer. I would give it 5 stars if it were better at resolving hand shake, I've found I need to be very steady to get a sharp picture. Knowing that, I set it to a 2 second delay. Inclusion of a 'straightening' feature to the already fairly complete editing tools is nicely done.  Overall, I've become an Asus fan.",
        "date": "August 15, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRk4wbkVhNzNmTmVYSWFGLVZ3RXRXYnFCY1hpcXlPQ0FIcnkzYUd1NjZyVWxYZnJUbVZZY0xTMnoxTnJWUzlUMHpDQXpQSVFndS1BdDNKNUE",
        "reply": null,
        "star": 3,
        "title": "Convenient and feature rich"
    },
    {
        "author": "Sangeeth Santhosh",
        "comment": "I'm a photographer and I use ZenFone as my pocket camera. Being such a powerful device, I use it to take night shots with timer on. But it's too hard to get timer when most needed and also it's such a nasty experience to miss a shot because of it. I often forget that camera is in timer mode after a night shot, and hence miss the shot in day time. PLEASE MAKE THE TIMER A SEPARATE EASY TO ACCESS BUTTON. Else lots of people who are serious about ZenFone photography are going to face this issue.",
        "date": "August 9, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRUdRZ25ZNVphcGZHM05pLWpQaU5UZlJ2Yms2bkV0NENlc3ViNFBzYXZfNGJUOGlRbm5uV29YOEkxQXdlelhCT1lOaE9vZERXVzZPNUdaaXc",
        "reply": null,
        "star": 4,
        "title": "Self timer has to be separate, and easy to access."
    },
    {
        "author": "suyog gatkal",
        "comment": "The beast features. just supper features. asus need to increase the clarity of camera. camera clarity is also not much bad. in this softwere many attractive features are present. but i thik good camere app. Must have facility to capture images from distance. thik can be done by sensing hand movement, vistal or \"capture\" sound to take better image by fixing camera and just capturing images by our activities... this may also attract the peoples to take asus phone. because this is small but sweet feature....",
        "date": "October 14, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRXlkbVRzSC1mU1c5MUVJTnhtTjhRSEdQdzQxZThNNkg0TGEwRnNYTUNLYWREcVB2Zy1DWHJGU2pDRThEal9YcTFpRlMyem5zVFRhSmd6LXc",
        "reply": null,
        "star": 5,
        "title": "Best effects but relatively less clarity.."
    },
    {
        "author": "Prathamesh Mayekar",
        "comment": "1. About superresolution mode-When i try to post it on instagram the image turns completely black and also gets posted black. 2. While clicking a photograph the actual colours are different then what your eyes see even manual mode didnt help.3 when focused on the sky the ground turns dark and vice versa. Please help me know why this happens and what i should do to capture a better picture.",
        "date": "December 10, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPSDhxY2h2VnJZU0pwVFVYWTNoUTRUajlUc0pHUzVkeThNV0Y0dU1Va1JKRzNkVFNwTjJVMktVaFl2Um9Yc2l0enFqUW1BRHM4V2JPQTZxYUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Muhammad Hanif",
        "comment": "Nice apps, especially the manual mode, feels like my phone became a DSLR! But I hope the iso and the exposure on manual mode could be set independently without locking one another. And please improve the front camera quality. Or probably just my camera? But nice work!",
        "date": "August 16, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRmJVOGxGUkwxLTAzWFVERWJDd19kWXZJck5HTTl4TXRjd0VjS1RWT1lsTnEwV1B6RlUwclRWTk9SN3J4dllfeWZocm5xRWhESnpLYUV2THc",
        "reply": null,
        "star": 5,
        "title": "Nice Camera Apps!"
    },
    {
        "author": "Saufee Affandi Sarippudin",
        "comment": "My camera stop working, it become blank, and said to restart my phone. But many times tried also not working. Then I do factory reset, wipe everything and now its working fine. I love ASUS camera, very quick to take photo and sharp. Keep up. But take note on the blank part, it said some app use it at the same time and ask me close it first.",
        "date": "January 4, 2017",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRWo0U2RuVUFRYmdzamc0Vzd6b2ZsVEh4SXl4cGNzaWdCcjlwZWIxTmc5RU1SR2lTbmJzaEN4cHhTb2tSR3pTRFJGaXluMjE2VTNnaTFDVkE",
        "reply": null,
        "star": 5,
        "title": "Ok"
    },
    {
        "author": "Alien Tech",
        "comment": "Night vision mode is great and works like night vision googles but uses lower res pics. If it works also in the display and not just post processing we can use this phone instead of night vision glasses. Uses 4 pixels of light to get 1 pixel in picture. Make it 8 pixels and even the screen light acts like sunlight at mid day.",
        "date": "April 11, 2017",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRlNaSVN5ZW1kM05BTE91UVAzbG1lX2ZCV0JNVHJiMzF5Z1Nwc2lOeVB5NUx3WUo3R0tpN2ViOUJDRzlfVWlUNGxpN2dOZ3liWVJuNzl6U0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "mAnISh kUmAr",
        "comment": "In my phone(Zenfone Max). it suddenly stopped focusing on near objects. When I touch on screen to focus, nothing happens. I tried few other apps and focusing is working fine in them but I dont know why but its not working in this app. Please provide another update of this app or give me another solution.",
        "date": "May 25, 2017",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRTFYeW5kZjBSbnl4Ty1tMmdVX2tHZkozcWZCQUN6WW9mbTI1WklWcl9YM19jaDlWcTM3SkRSWWI2Wk16Z3p5N3Bwc1VCRGFiT2h6Tk9ESlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Thoibinu Singh",
        "comment": "Love the cam! However, previously from the gallery option in camera if I had to check pics it used to ask for security code as I activated the same. However, after this new update it is nt askn for the same. In that way anyone could access my personal pics from camera option. Plz, chk n get this back with the app. Thanks!",
        "date": "July 30, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRTc0N21NcE50NXdNT0ZmVXo3Y0xLU1RiZVZFMjNIazMzbGRzTWFKbFctNFZoSGk3VGNwaWJQZm83MFV0MmZmU1JhdGRUSXQxVnIyYXEtTEE",
        "reply": null,
        "star": 4,
        "title": "Changes made in the app!"
    },
    {
        "author": "Rex Pamplona",
        "comment": "My primary camera is already working after the update, but my front camera is still not working.. it saids that my camera is used by another app and i need to reboot my device, but ive already did that for several times but still it didnt worked. Please help us asus user to resolve this issue. Thank you very much",
        "date": "November 17, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRVZ6Y2xfVXQwb2Vac3ZtOEIwX1UxdkxqdnZ3MXVPNXNuekxIUUZkcVhqRUd6eG51bW1ZdnJmZHFpYXU1R3M5Nkg0bEZmS0FhQ2Mxd0hTSkE",
        "reply": null,
        "star": 1,
        "title": "Help please!"
    },
    {
        "author": "Archibald Cleofe",
        "comment": "Best Camera for a smartphone i've ever had.  but...camera is not working well after marshmallow update. The auto focus when holding the screen blurs after it locks.  Please fix and i would gladly give the 5 star rating.  Using Asus Selfie - guys please. i got this phone for it's amazing camera. please fix this immediately.   Update: fixed",
        "date": "December 14, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPR285TFMyM3NNWHM2NmtKRjZSbW9IeEttRTdoWEtQOWVXMjhaZ2l6RmdjblpIZ3FqTkd5YTZ5WGI4dkpON0NmVTBXMVZubjJUbzFJTmRqc1E",
        "reply": null,
        "star": 5,
        "title": "Fixed"
    },
    {
        "author": "Vadim S",
        "comment": "Manual settings are amazing, HDR tooltip also pops up when needed so I can switch modes quickly. What I want to see though is that the Geo-tagging setting persists at ON state even when GPS is off at the time",
        "date": "October 21, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRnhjT3FFT2IwREVqanhFRE52Nlc1Tjd1aERSMXNNZW9HZkR0SnRsby1RQ0p0TV9PQy1ZZVJQb3JsR2JRRFplRzFUREd5S1pQbXkxS2JZZ3c",
        "reply": null,
        "star": 5,
        "title": "Awesome camera app"
    },
    {
        "author": "Sidhartha Halder",
        "comment": "The camera division of asus is doing good. For that from me 4 star. The different modes will actually helps point and shoot camera lover to click good pictures. But none of the innovations is 100% efficient. The front cam was not up to the mark. It hav a lot or noise(the fading effect) which low down the picture quality. Anyway ASUS keep it up.",
        "date": "October 16, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRVZ2dGk3VkVWQmh2eVFmaWoxVFlDS2drVkZRbUp3NXV4UXZNblJFQ2Z4US0zS1h5d3VqcDZHWk9JTHFtVmhvQlNQUUJuTE9zYk9GdVIxdFE",
        "reply": null,
        "star": 4,
        "title": "Very good"
    },
    {
        "author": "Sanjay Vaidya",
        "comment": "Nice Pcture quality  using Asus PixelMaster.. However after this update, crystal clarity totally spoiled.. now ASUS camera is just ordinary as a cheap Chinese phone's camera...plz do not update Its failuare of asus while upgrading zenfone with intel processor phone to Marshmallow. My current ration is not more than 1",
        "date": "April 15, 2017",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPR1dGY1lRVGNTbHN5RWNkQUhPOWttMEs2ZGotSTVqWkNwdmZkTnFKckRoSVhRTWFHdFI3V1p5WXJEMWgzYjRWdDlmWlZyQlN4OVhvUWdLTkE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Abhishek Sharma",
        "comment": "The camera app is very nice, I have not installed any third party camera app. As this is perfect for me. But some selfie lovers love to take selfies with gestures, like Whistle, Smile, Wink, Palm gesture to shoot. Also some more camera effects can make make this camera app a perfect one.",
        "date": "July 10, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRnpFcXNFeXhhLXVLV0pDVlRVcjZ5M0VXNzR3OE9jYy1CQUVYZ2JmX2t3QThQRGN0dUNTR1V4dGZCRzZzSGlWeFYxUjNVVENHWnNPU2Q4Wnc",
        "reply": null,
        "star": 5,
        "title": "Please add some gestures and more effects"
    },
    {
        "author": "Bert Tanuwijaya",
        "comment": "When i put the Padfone S into the dock (tab), the front camera of the dock (tab) shows only green screen. I tried deleting the app data and the cache, no luck. Anything i can do to make it work? Other than that it's providing all i want and need in a camera app, solid functionality. Good job developers!",
        "date": "August 22, 2017",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPSGZzbUN4MUk2ZU9FNEdvRHlrZnJoWjFNNWdxTHREa2JiM2N4MThkZDI3QmNPaXdQalYwQ0stQjAtZWl3V09TNFlJWHdFYkpnYWpjY1VMeUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chen Ran",
        "comment": "Just bought Zenfone 3, I have to say the camera and it's app is awesome! BUT, I think the HDR photo I like the old version for ASUS pasfone infinity(I had this phone for 2 years, and it was the best HDR camera app for me) But this New version of HDR Pro I like it less, because the colour is less vivid, it only makes the photo brighter, but not colourful. You can see my profile photo, that was taken by my asus padfone infinity and it's old version app, it's colourful but very natural. But this new HDR pro does not make the same effect, it just adjust the darker place brighter. I really hope this app for zenfone3 could do the same as padfone infinity. Thank you very much Asus.  Written from my third asus smartphone, a true fan of yours._______________________________________________ Actually, after trying for a while taking different photos with normal mode and HDR PRO mode, I don't see any difference!? I don't think the HDR pro mode is working properly!!! Why? Please fix this!",
        "date": "April 28, 2017",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRTNBaTE2TXhURnAtaDhZYWwzWHVBdnd1TFBIbGJhQk1PUUJhZ1RpZnpyeFdvQTE4LTFXOW9MWEpEUnp0VzBYTkp2VnM5ZEJqcXdoam1hYnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Claudel Mombeuil",
        "comment": "The camera of my ZenFone 2 does not work after the update. I rebooted over and over; I got the same result. I am certain that an update should improve app's quality, right? I hope Asus team will quickly fix the bugs!",
        "date": "January 9, 2017",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPSHJoU3JDX29Ta2Y0MkZvNmhUYUlKRWU4dWVsSDZTQU1abm5KNWFfSkdMUTBMZ0Uwd0NaUFQydEdla2hib0JZWUtCM2RmN3kxdWUwMEpPX3c",
        "reply": null,
        "star": 1,
        "title": "Camera does work after updating"
    },
    {
        "author": "Elias Ts",
        "comment": "Good camera application. It hangs sometimes after marshmallow. You must fix it.   11/July/2016: the flash sometimes doesn't synchronizes with photo. So the picture quality is bad. Please fix it! One of The most beautiful UI camera app.. update:22/12/2016 still camera doesn't synchronizes with the flash for nighttime photography..😞",
        "date": "December 23, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRWxPX2h1QklZbzE2SlJrTjc2eVJaVFlrRVYwRkZSckwxc0hQTlB2Q3JuVkI5NWtBckU2ZVB6U1ZqME5QSllvdmRCR0VaV0R3TkVpVnluSEE",
        "reply": null,
        "star": 4,
        "title": "Best camera app ever!"
    },
    {
        "author": "Sangeet S Nair",
        "comment": "Front 5MP Is worst Dan my old Moto x 2MP ....... Front cam has really less options. Back cam 13MP but just avg nothing else. Many options but least camera quality so can't use sem well.",
        "date": "October 19, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRUNXc0tTaGxjdmVOQkxUTDBMNWVBNXM0U041dVU3eDVES1JKenF2YzNkaDhfZzFBZThPdWM0UGtubGdyXzFpcS1lWmxnd0hoVnhhbm5XZnc",
        "reply": null,
        "star": 1,
        "title": "Lacks many things"
    },
    {
        "author": "dimas nurfitrayanto",
        "comment": "Please, improve PixelMaster camera to SIMULTANEOUS, when zoom to set manual tools bar. Because  \" When zooming was hide down manual focus bar ?\"this was make recording on MANUAL MODE to be a trouble among focusing and zooming not fit, making a bad video by MANUAL MODE.",
        "date": "October 29, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRUE3d3FneFBFc19wYkN4T2x4Q000SjJzZXVVaUpaRE9UV29BQ3VaRXlCQzZ2QmtGOEdDdC1tLVY5WUlVVm96VUoyenBjUmZNTlBpR2xoYXc",
        "reply": null,
        "star": 5,
        "title": "MANUAL focus can't be done at all once with zooming ......"
    },
    {
        "author": "Md. Golam Mostafa",
        "comment": "Happy to use this. Sometimes when I want to capture any picture in light than get dark picture. Otherwise everything is okay. I hope your team develop time stamp, now we get only date stamp, you build it both \"Date and Time\" Stamp.",
        "date": "October 11, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRlFHUHVlR0JHUDRJTDk0S0VMZFJBZUd0OEFZNk96bDVnUG80MTVuUlRRdlhYaVdGYVJqaE9hUXJITWFaSnNhSnRBNGUxbGFhQUstNHBXdGc",
        "reply": null,
        "star": 5,
        "title": "Great app"
    },
    {
        "author": "Adli Dzil Ikram",
        "comment": "On Asus Zenfone 2 Laser ZE500KL the camera hard find focus (especially on low lighting condition and sometimes on daylight (outdoor)too) it make blur while we taking picture. I hope ASUS fix it soon",
        "date": "August 26, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRThiaGh6RWtrU1N5WExVYlpMWjliVUxVcVFnaHdpYnZxNVJlMmhBdjdsbWZObXVqOU9hVVYwY3dvUkpfQ3lkSFkxS0JkZjM0bEFXZzJDTUE",
        "reply": null,
        "star": 2,
        "title": "Out of Focus"
    },
    {
        "author": "Haresh Vadhiya",
        "comment": "Worst camera application. Really disappointed. Hey... you Asus people..  stop cheating by putting such mobiles in market if you are not able to manage it. I bought asus zenfon max just one month back. Cam was working with android 5 but after system upgrading to 6, camera has stopped working. Don't know what to do. Please fix this issue else I will throw this bullshit mobile in to dustbin. Will never going to recommend for Asus to anybody. God bless you.....!!",
        "date": "August 30, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRXZLampZQktQNjkxbGRGd2NncGhwZ3dUYWNmRnV4Z2pwc3c2TEZPRnN4MWRzcGsyM1JXcDlETDh2RXVXdGF4R0p6YlNlR3JDWlJRcFhPcFE",
        "reply": null,
        "star": 1,
        "title": "Camera not working after upgrading to android 6"
    },
    {
        "author": "gfyhff gjvivkbkivuu",
        "comment": "I purchased another ASUS Max 615 2 weeks ago but camera showing some line on screen when taking pictures or video indoor and when captured this line are there on image. And in selecting mode there is QR scan that is also not working. Please clear my issue.",
        "date": "July 18, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPR1kwTTRkcHN1UkJMZEdTUUlXVzZ0N1dUSmpfUGYxN2g2ZUpyOFVqd3ZYMFhQZzAxOHJfWVk4bzRfejhKMFJFbmVDS1JxSmx3OEdDZktNMVE",
        "reply": null,
        "star": 2,
        "title": "Poor Quality"
    },
    {
        "author": "HASAN BARBHUIYA",
        "comment": "Hello, i am having trouble with clicking pics of greenery in HDR and AUTO modes, post processing the clicked photo becomes unavailable for preview.But the 'super resolution' mode works. I have tried other camera apps and they work fine. Please look into it.",
        "date": "July 17, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRWNFV3FmajFqWjVyTHlZV0c0cjVPX211b3V3b29OSU13ZnIwTE5ZcTR0SnRlejZaSThJYXdDVTBVTGRnSVVpa3dncVYxb0YweHYtMDY3bUE",
        "reply": null,
        "star": 2,
        "title": "Problem with clicking greenery"
    },
    {
        "author": "ahmad raza",
        "comment": "Whenever I took pic of brighter object in auto mode a notification comes to change it in HDR mode so I do the same. But once I changed auto mode to HDR mode and tried to take pic the pic gets crashed and can't be seen in gallery. Pls fix this issue as urgent as possible as the same problem is been faced by my colleges also.",
        "date": "July 29, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRWY4bVhZbjNoQkRsTFRCR25VWXFEM0dsb3AtVzYzNkZxZEV4QTRSLVBzRzN3WHl1bnNPdE5NZlRRN0R4cHl3VERqZ0JBWlBIaDRKbzVqUFE",
        "reply": null,
        "star": 2,
        "title": "HDR mode is not working"
    },
    {
        "author": "Kirumi Ito",
        "comment": "The camera just stopped working and jump out when i click the gallery tumbnail, it seems like this problem come since i updated my camera last time. Pls repair it for smoother function tq",
        "date": "July 6, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRkEzZHVtcjVJTm96V1J6Ukc5RjV6QXRSNkhBM1J0UjA4YTZaRl95bjdnQWUzbXB6Q1RhU0pPVWdyVF9VcnJaYzNyamt5RnRHVFYyYWJBYUE",
        "reply": null,
        "star": 3,
        "title": "Always showed stop working when i clicked the gallery tumbnail"
    },
    {
        "author": "Ramanathan Somasundaram",
        "comment": "I still feel some clarity issues while switching between portrait to landscape, same with videos again. Also changing the storage location to SDCard has issues when pictures taken through front cam, where the photos are not visible in Gallery, but available in folder view.",
        "date": "June 29, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPSC1EOVlRVlJoODhHNnJEUUFMWnpHRGQzM0ZzZnZRNUJtaVNvbGF5RkhUbHFXT2FraUlsOFAzc2VIVV9fT2lKQlNwRjVPejUzQ2gyVUdRV2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Monica Naik",
        "comment": "Camera just stops working whenever i click on the gallery thumb nail once after i click the pic... And the back camera quality is too poor.. Its specified as 13mp.. but its clearity is not even as 3mp... worst cam quality.. plz try to update the camera quality..",
        "date": "August 3, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRVdtRENsR3ZUMnAtN24temtaaWEzUlF3QVBLRmNSVFJKaENNMEpXRE9KOFJ0LWxUN1BBWWR0R3F2SE9zNklLU3ltMmwxcXd4ZHJGOXRyc3c",
        "reply": null,
        "star": 1,
        "title": "Worst back cam quality"
    },
    {
        "author": "Channa R",
        "comment": "Few months back before updates photos were good but nowadays its coming blur and no clarity on pics.how to I get back my camera app back like earlier? Can I uninstall and reinstall this app again? Does it damage my OS or so as its built-in app?",
        "date": "August 23, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPR2ZkYm1FYkg2TWRidnRwbE5zbU9tWWh5OGNyTFMtdlNUU1F1QU1PUjd5R210ZllaNG9zTG1YZm9OTm00dDRDb1lwUDc3TlJERDNheGdsY3c",
        "reply": {
            "author": "ZenUI, ASUS Computer Inc.",
            "content": "Hi Channa,\nSorry to confuse you, but to take better photo, min. brightness is needed to allow better adjustment on EV / WhiteBalance / Touch AF ... features. Please be understandable and wish you a Merry Christmas :)",
            "date": "December 24, 2014"
        },
        "star": 3,
        "title": "Photos are better earlier but not now"
    },
    {
        "author": "Imly Jamir",
        "comment": "My front camera stopped working I don't know what happened...I tried to fixed it by uninstalling, updating,clearing everything as suggested still failed result. Please help me.... Asus has the best camera I don't wanna lost this....I am using Zenfone 5.",
        "date": "July 17, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRnlZLVBDa05GU2ZHbjZxeE5qVW5GRFFOM2k5OFM0SkIydVBHaFlQMG4taXhNTG8zVkVxRG1CT1UzdGVNMjE2VEhidm5IcGEtLVktNEktUnc",
        "reply": null,
        "star": 1,
        "title": "Something is wrong."
    },
    {
        "author": "Darrell Angeles",
        "comment": "The quality of photos using the rear camera is degraded after the update. Tried reseting it clear cache, reset settings but i still get grainy photos. My 5 year old note gives better photos",
        "date": "October 12, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPSDlISlZnRWJSLWthYllvXzFEbW9GVG5aVndEbWZmSTBxV2Q5NEpxUE1PY00teXVxSU9lR2xTYldQak5oV3F6TGtTOWV1UmZkelRjbGJOc0E",
        "reply": null,
        "star": 1,
        "title": "Grainy and noisy pics after update"
    },
    {
        "author": "Biju Issac",
        "comment": "I'm using ASUS ZenFone Laser 2. It takes decent pictures in natural light but in low light or artificial light pictures are grainy dark and not very clear. Would like to see the low light pictures also a little bit clear, if you can do it with an update.",
        "date": "July 18, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRkZNZUNnNHVLblh2eEd2MkJWUUo3ZWlLSVMwdFhZVlRRUUpfcHlQc3RjRGpPWWJPeXkwM0d2UVpyT0JmUUZkeEFHYl9NYU9wZjk4MXZMWGc",
        "reply": null,
        "star": 3,
        "title": "Grainy Low Light Images"
    },
    {
        "author": "Kristine Consuelo",
        "comment": "I hate the update on the flash coz everytime I use it the picture always turn out yellowish, the people's faces has white yellowish like exposed film on their cheeks. Other features seem good. Camera is slow.",
        "date": "July 26, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPR0lqRVhkaDl4TEI3T0U1anpqUjRuUFNfQWRmTmVGaC1iZjlJMmhrT1VQQmZYak1uRHlQS0NNWmtBaGtnUXJrd25OODd5ZWVrRFpVb2VZUkE",
        "reply": null,
        "star": 2,
        "title": "Imho"
    },
    {
        "author": "Kevin Hartono",
        "comment": "Despite all of the features that pixelmaster camera has brought, which I love, the viewfinder seems laggy whenever I got to manual mode, especially if the gradienter is turned on. The image in the viewfinder is lag behind around 1 second than what it is in the real life so it's really annoying. And the lag is getting worse after I capture some pictures. I'm using ZE551ML 2GB variant which I think is certainly capable of running this app to its fullest feature so I suspect that this is a bug from the app.",
        "date": "July 14, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPSGlGOUVnYU1wQ0dIc3diX1FGdWl3LWh4ZVZhdkM0RWFTbGhReC1rTFFyQ25uQzE2NVhtbm50aVZWbFhmMUkwV21OR2JPaGxtZWNkUmdVNUE",
        "reply": null,
        "star": 2,
        "title": "Manual Mode Problem"
    },
    {
        "author": "Emon Hossain",
        "comment": "Yesterday i upgraded my phone to marshmello version but after that this camera app isn't opening at all. It says unfortunately camera has stopped working. I updated it too but didn't help.my phone is asus zenfone 2 laser. So can u help plz...",
        "date": "July 1, 2017",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRWZGcmtSRi1SMjlUQ2xCNEpBS3k1VDdJdXBfRENsQkxQWDdvMHNvNFluTUYyMlU0X3ZXVWczYVRyTkRsX2NUWVFDNEhEd1lsaXpZOHpyamc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Md Scid",
        "comment": "After updating, my camera becoming more slow and keep crashing. Please fix this. Im using zenfone 2 laser and android marshmallow. And some of the pics i take later on not in the storage.",
        "date": "August 3, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPR2x4b1hubzNvUGV0MXgyQlN5T0FGWW5faEo0YTB0WWdoV2RSSDRYUUt6eUdZTUtDNHVkdlhYUDJCeUd1VFJPd3M1c0hBWExiTW1lQTVCYXc",
        "reply": null,
        "star": 1,
        "title": "Update"
    },
    {
        "author": "Christine Tobin",
        "comment": "Its just ok. The detail is seriously lacking. You have to hold the camera completely still in order to get a decent picture and even you can see all the pixels in the picture. I did not notice much of an improvement in the camera at all with the recent update.",
        "date": "August 2, 2017",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRXE2RW9kY0lEQzUyblhEYUtfRUlkdHJ6MG8zdHkxSHB5Q2Y0LWVMdjFTVGtpWkEzOTYybzJ6WW1iR1VXQWU0NXhSbkdUZVBhTW5UZGpUZXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Arpan Bose",
        "comment": "In my zenfone2 ze551ml phone.camera was good enough, but after upgraded to marshmallow from lollipop. It became very grainy and noisy like 2megapixel camera in low light mode. I don't know how much time asus will get to solve this.",
        "date": "October 6, 2016",
        "permlink": "/store/apps/details?id=com.asus.camera&reviewId=Z3A6QU9xcFRPRTN5NE0zNjRZSmRmUmplbFlzLUwzT3pYcUdWbFlkNW9xNnEzQl93dll1Vl82QnJIYzZkMzRKUWlFMDhXeE9rbGxqOEhBV3BqR2NBMjEtYUE",
        "reply": null,
        "star": 2,
        "title": "Very bad after upgrade"
    }
]