[
    {
        "author": "Timothy Bates",
        "comment": "Evernote are a top-tier cross platform design company, and this app reflects that.  Open a note on your phone. Lock the phone screen - the note appears on your watch. This is exactly what you want... no mucking around on the watch.  A use case: create a shopping list on the phone. Lock the screen. When you're in the market - there it is on your watch: flick left, scroll through the items an in your basket they go.  Or you want a series of speaking notes on your wrist: Write them as a note. Lock the screen and bam... scroll through as the meeting proceeds to make sure you raise each issue you wanted to.",
        "date": "March 9, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRXd3Q2RsWk8zdnNFWDl0SlFNYllzRGhJc1J3dWI2VEdGamFON3dVMnNyLUR1NXZiN0Y1a0dCeUNPZmFvbHo2RFNSYkZkVGMybUNoMVZXZUE",
        "reply": null,
        "star": 5,
        "title": "well designed app!"
    },
    {
        "author": "Bill Bruckner",
        "comment": "This isn't working for me.  When I press \"To Dos\", it shows, \"Fetching to do notes\", but never does.  I get an alert saying \"Can't fetch to do notes.  Are you connected to the Internet?\" (I am).  When I press \"Find\" and say the name of the note I want it to find, the app just closes without any notice.  I finally figured out that I have to swipe up after the app closes to see the note.  This is version 0.9.  Hopefully version 1.0 will work better.",
        "date": "October 6, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR1FTdF9rTmllZXRjYUhGU3g1NGNyWkRUcG5VWTIxMjVobXZ0cVhjSGpRLW5xZzRWVGRvTS05eDZuVVhZRllCcTVLX0VvU0NKbndBVGN3bmc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Joe Roselli",
        "comment": "Gets all my notes and lets me quickly add them, but for example, I have pictures and such spread throughout my notes. When I open them up on my watch I can't see the pictures between the text. I just see them somewhat in the background. Please make it so that the pictures are actually embedded in the text the way I view them on my computer. Thanks",
        "date": "October 8, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR0RhRTFKSVJ5RW9FUHB6Nlc4YWRYVDlBdzVpSUNtRTdGZVVvSFpQa1FOeUlWVm5ETFpkY3JZR2FaY2JjQ2xHZUQxblRDNmdCX1BCY2VVMHc",
        "reply": null,
        "star": 4,
        "title": "Good, but could be better [Feature Request]"
    },
    {
        "author": "Xander Warrender",
        "comment": "I keep a lot of notes in Evernote but, for my watch, I only ever use it for my shopping list.  This worked fine on my Pebble (though slow) but, on my Moto360, I can only pull up a checklist of 30 items max.  Am I supposed to re-order my list every time just to make sure that the items I need are in the first 30?  And what if, gods forbid, I have more than 30 things to buy? And why isn't my most-recently edited list at the top?",
        "date": "December 31, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRmhWZDBiUmRQNGV4LWNHRzJibFR2MnNmVTdJT0dGN01NdDdieExBNlVFUXdKR21vWGlwTDlMckFYd2R4SEk0bHF1MWM1d2JDNFhRLUN4dUE",
        "reply": null,
        "star": 2,
        "title": "Too limited to be useful"
    },
    {
        "author": "Sphesihle Mlotshwa",
        "comment": "What's going on with this version,where is it? I just installed it and it's nowhere to be found on my phone.I really loved Evernote and have always found it easy to get everything back once I have logged in whenever I have updated my operating system.And now I can't even access it.",
        "date": "June 29, 2016",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPSHVhSmt1RDY4d0RDRElySjFHWTJWSFd6VWdhQmJrazAzUUc5cVNLTTFrdkNJVGpqdWxIT3BELUtjWFBRcmRMaDRITmstMVlMRWJ2R1k2cFE",
        "reply": null,
        "star": 1,
        "title": "Am I also missing something?"
    },
    {
        "author": "Denley Bihari",
        "comment": "You need to think through the UX/use-cases more thoroughly. Maybe by providing options so that the user actually knows what is going on. It's not clear to me why a notification sometimes (but not always) shows up on my watch for notes I recently looked at. It seems deliberate, but rarely something I actually want. The app on the watch has some useful functions but can be hard to actually use to find the note I want. It always just shows the three top search results, and shows them as notifications. If I find the note I want I have to dismiss the other two notifications. If I don't find the note I want I can't refine the search, or see more than the top 3 results. I think it would be more helpful to show all search results as a list inside the app, then show a notification for a note only once a particular note is selected. Then I can see all the results, and I don't end up with notifications I don't want. One last thing: the screen wake lock never times out of the main app, which is unnecessary for this kind of application.",
        "date": "October 15, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPSExQWjdTbjFDQjE2ZDYwT3RnMWNWeXlBRXZuT19XbXV1X1pMc3FLY1Z5UC13Z29objlHQk00ME43d0xWSHItT1NDSmNjdGZqZVI0VGJWWFE",
        "reply": null,
        "star": 3,
        "title": "Useful, but could be better."
    },
    {
        "author": "Angela Chang",
        "comment": "I much prefer the previous widget that only shows unfinished or coming soon task reminder. It's so annoying when it's showing the whole notebook. Also there is no longer check box for completed task. I used to be able to just check the box to mark tasks completed.",
        "date": "September 27, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR05BQ09sNTA4NVluWDRmcElNVm5NNkFWNk5PQmZaOWRfS2g5TktfNjhKRXJZT2dGOEI5V1kwdTAydU5CMXRBSWEzQ1BBOFFNdnJEdlRfeVE",
        "reply": null,
        "star": 2,
        "title": "Reminder Widget not as good"
    },
    {
        "author": "Steve Brightman",
        "comment": "Occasionally I can call up a note... very occasionally.  The 'recent notes' function simply returns to watchface. I have reset watch, etc, with no success. Super useless.  G Watch R.",
        "date": "December 25, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRk1xWUJYZzlPU0FpVkFYR3p4U0E0VUloaWhaN1R0dWJUZE01dlZyb2E5eVVUUDZHajh5MGJzSzF4ZkNLRk5lT25kOHV4a09QZW1ZMHZiOHc",
        "reply": null,
        "star": 1,
        "title": "Non-functional"
    },
    {
        "author": "ra ra",
        "comment": "Free version is very restrictive making it unusable. SImpleNote is a much better option. The darn Wear app would not even uninstall.  SO I went to re-install this and then I saw the option to uninstall. There was no app in the phone to select",
        "date": "April 19, 2017",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR1FRZ1NMQUpQdW54Q3lGNWJIOXh5Ri1SWTFrWmFzVmZjdGJIc2JUcWc0bjNKYnJsQklITFN0cEpxSUZHSzNCTVZWYnM1VVlDU1o4SXZibkE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Big Bob",
        "comment": "This app gets great reviews. but I ca not get it to work.  Downloaded from play store and according to store it it installed.  I can see the app on my phone When I try to open it it says evernote is not loaded.  I have uninstalled and reinstalled several time still no love.",
        "date": "June 19, 2016",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPSC16VUpMNDM3WVlZQm1UOVdmVDBETU9zZndsekxzSzdqSW42QVZVd282b3dDU3hzVVN6NzRpcWkzaHFKdkZGdmJhcnFoSkk1OGhYNktBVGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Emmanuel Luis Borjal",
        "comment": "But the problem i am encountering now is that whenever I am typing words it automatically joins into one word even if i have already put a space to separte the two words. It irritates me. Please fix this. Sincerely your loyal user.",
        "date": "November 8, 2016",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRmNua3F5bEV5WW95cU1xcWJTclQzNjJsZGkxUEU3X1VHZVBQYnpiYnVscFNxSzEwMy1vcFNEcmY5LXJvTTRDWnRtaThINmx6Zk9GNG5hRVE",
        "reply": null,
        "star": 3,
        "title": "I gave it a fair rate I because have been using it for 4 years now"
    },
    {
        "author": "Sean Houlihane",
        "comment": "Can't set as the default note function, don't want yet another app (OK,  so this is early testing) and the function is kind of clunky. If Google insist everything should be by cards, give us a choice of idiot mode, and useful mode.",
        "date": "July 9, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRWlPRENld21tX09ZRk1abEMzY2pmU2k2ajk0T0hkQ05HME1Cdk50T2RPcFhGcUVhUE5LSlp5QXdXYU5XRnNPeFJvSEM5aXh5ZExKdjdBZkE",
        "reply": null,
        "star": 2,
        "title": "Needs some work..."
    },
    {
        "author": "Nasibeh K",
        "comment": "Hi. I had evernote installed on my phone before and i really love it. But after cleaning my internal storage I lost it. Now i installed it again but i could not find it in my apps and there is no \"open\" buttom here! Play stor just let me \"Uninstall\" it!!! What should i do?!! :-( I really addicted to Evernote,, please help me use it again!! :-) thanks",
        "date": "November 25, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRUE3MXl1bC1ZeUNyNE0zcGoyT1dkTnNhbWtBWk9PQTUxREJFcVNVZWxxTVVTTklZR2JGMW5wazQ2azhLSnFKUHpCU0g3Mzd6THllTThOcXc",
        "reply": null,
        "star": 4,
        "title": "How to open??!!"
    },
    {
        "author": "Dorothy Golden",
        "comment": "Installed app. Usually there is an 'open' option, instead I am only given the option to uninsall.  Also there is no icon to be found. I see it in my settings but cannot open it from there. I also did a brief look at the website hoping there was a forum that would enlighten me. I was a little dubious to install after seeing others had the same issue but was hopeful. I'm going to uninstall and check back at another time.",
        "date": "December 6, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR01vUkRKUjIxNnJpWW1lTGpTWm1ZTVlyQm1LRWhqMjhSY1MyWEZxTjdMel80VEk3eUY1SEU4aEx4S0E2TlVFNnU1Yy16cDZ6TndvYV8tdlE",
        "reply": null,
        "star": 1,
        "title": "Confused"
    },
    {
        "author": "Linda Jackson",
        "comment": "Isn't there supposed to be an icon show up on my phone? This is very frustrating. I've heard alot of good things about this app, but so far I'm not impressed.",
        "date": "August 31, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRXd2VVJKS1dTTThZby1seE0yd0tYZjM5RXdMWFljbWEzNkpVaFB1MEFrdm5KbktxNHM1MnFfU0ZERUg0bURrUURRdS1vcXRvN21hUGVCSFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jeffrey Tschiltsch",
        "comment": "I use this for checklists (i.e. grocery and hardware store) and its quite useful (especially if you live in Evernote like I do on my PCs). However Evernote lately is randomly showing calendar events as Evernote notifications and I can't figure out why. It's annoying mainly because I can't figure out why its doing it. Other than that its what you'd expect, notes and reminders on your watch.",
        "date": "December 22, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRnZDc0IyYWxWcVNRTmVlSHdNNTkzMnlOVTFqTC1mb3RNUWtSdG90Y05kSDhMUTA0MnFYU2Z4dE5tWE1JTE5mMDZ2Uno2aXNZb2J0eG1ZTXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Betsy Markman",
        "comment": "The app icon shows up on my watch launcher, but tapping it does absolutely nothing. Accessing it through the main menu brings up a search option, but when I attempt to search, it just brings me back to the watchface. Useless.",
        "date": "January 21, 2016",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPSFlJRE5Uci1udlJnOThXRUhRTWFOZFF2aHROU0htVmZSZnNQN3hQZjRqR2ZfS2xRRXNxU1BtODd4Q2dENEZFdHBNVm1KRTVjenJ2RDdJdWc",
        "reply": null,
        "star": 1,
        "title": "Doesn't do anything"
    },
    {
        "author": "Michael W",
        "comment": "Although I like this on my phone and tablet, this doesn't work very well for watches. Google Keep works much better on the watch. At least it can be uninstalled but I have to say some times its reinstalled itself on my watch and I don't know how.",
        "date": "February 24, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR1h4eGF3ZjFCNjZMamtBeE4tcU43MF9rWW5sbjNBQ0w3dTllUXhzTjZOWE9tdmE5cVJYWVBGVWhFb3Znb3hpdUhwYnpUT19kamN4SXUxQ2c",
        "reply": null,
        "star": 2,
        "title": "I like Evernote just not on my watch."
    },
    {
        "author": "Dan Blakely",
        "comment": "Not a big fan. They should make the original Evernote compatible with Android wear. This stand alone app is super clunky. Not worth using. I'm uninstalling. - Not Dan recommended",
        "date": "March 20, 2016",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPSGZWOXEtdmpkdXZTekM3TXlXUzhnWTZaTGs0Qk91a0R5a2pBYVFxcGludzBIbXJRLVRhTnRpbGtIQnVjeDdfamVVSzdTTXlRcVJnYXc2TUE",
        "reply": null,
        "star": 2,
        "title": "Meh"
    },
    {
        "author": "Cathy Ratzlaff",
        "comment": "I have installed the app but I cannot find it. I am so frustrated as I use it constantly.  I had it on my galaxys4 and I now have a galaxys6. I have uninstalled it and reinstalled.  What do I have to do to get it to work?",
        "date": "January 8, 2016",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRTR0TkRFSkJXSEFMNm5uTDAyN1RmOUNZRGRqLXlIcHhyNlNsN3M2UlVqX3V0N3ozY29ZWXNPM21yU2NDX01UNDkyQlhCdXFXeGsxMDZpZ0E",
        "reply": null,
        "star": 5,
        "title": "Evernote for android"
    },
    {
        "author": "Michael J Ryan",
        "comment": "As a professional developer, both the wear and phone apps are among the worst I've seen in my 40+ years of experience.  The UI is lousy, the options are terrible and - for the quality of the product - the monthly charges for the Plus and Premium accounts are WAY out of line.  For the app's limited/mo. capabilities even $0.20/mo. would be too much!",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRVI4aTN2X3RkMDBHV2JsVGF2VE9aT2VOZjhvVUo4cUlJRU94YUJmcVlmeHBGWkI1YWFNTWs1cTJ6dExHQTNXcVR1N2dHN1IyeVpkSlBQRUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jesper Larsen",
        "comment": "DO NOT INSTALL! All my todos last update date were immediately updated. Not all todo items in list are displayed. And worst of all, changes on desktop are overwritten with the version from the watch.",
        "date": "June 24, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR24zLXhRRjRZQVZKVDZHMm92bHl6eE5ITjFpODhsSkVOM1RSZ2dFemFiSFppTjJnekFmRjg5WnNIOVFlNUZOYnd3S01WYXVFTWFaV1dRYmc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Frank Runner",
        "comment": "I don't know what all the fuss is about. I tried Evernote, on my Android phone, and I immediately decided I didn't like it. For one thing, the notes aren't titled by subject, and the text is very small, so it is difficult to know what note I am looking at.  I have no use for picture notes, and I don't need to access my notes from everywhere. I am using Google's Keep app, which does exactly what I expect, and nothing more.",
        "date": "October 20, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRzl3QmxpRmw4eGo1eWNwbGdzQm1rbXJJMkphSnZHZlJra1Y0QWNIYUluX0lqbWVGUmlTOUN6NVZ0R216NHgzSDlfbC1WZTlneDRNQm9iTWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Darren Bates",
        "comment": "I use Evernote over Google Keep - Evernote is actually being promoted by Google right now for it's \"Android Apps on Chrome\" development, so I've decided to integrate myself into it, but the experience on Android Wear is really bad, and really slow.  When I want to see a note on my watch, it's way too slow so instead I open it on my phone. An eternity later, the note appears. What gives?",
        "date": "October 27, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPSFBDbUU3SkZPQlN4aU1ZYjBTclpEV3B5RUtJTXc0aFI4WTFlRDZwUmZGNi0wT1BKTm95V2NxcmF6LUk3U2Rxd1I1NzFGOFJCcU9fZFdhSUE",
        "reply": null,
        "star": 1,
        "title": "Really needs work"
    },
    {
        "author": "Alex Pandelidis",
        "comment": "Evernote on Android Wear is a great idea... this is not great implementation (and looking like it's abandoned, since there hasn't been an update since launch pretty much).   Location option never seemed to work.  I search and can never find the note I'm looking for.   Seems to just toss up random notes when you open it.  They should look at Keep's implementation on Wear and get closer to that... actual reminders, amazing list functionality (with ambient display support).",
        "date": "December 17, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPSGpEOEo3WDZweE44YW9VMUJOam9kYWYwRnNUMm10dWdwNTZPODV5NzY1WEFBeDRHb2pwZ2N5RnMxQkI4QnVGYkZlSlk0VXh2elRLbFpFWUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Brad Parker",
        "comment": "Nice for to-do's. I was really hoping for voice notes or voice to text. Would be great for when you're driving and have that great thought. I really hope you add this soon. Competitors who are light years behind Evernote have this ability...",
        "date": "July 3, 2016",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRWJPeEtBN0E4d2hRQXByRG9qTXRsalpQZGdCQmU4OFoxcE9SUXlNcF9jeEhPeEZvS1J2TkRBUUFkYW1NOXNRSHNrR3BFX2F0V0tKUC1uNUE",
        "reply": null,
        "star": 2,
        "title": "Not very useful"
    },
    {
        "author": "Cathy Metz",
        "comment": "The app will only open when I go to the widget screen.   The icon does not stay on my home screen.   Also,  trying to figure out how this thing works is another mystery.",
        "date": "May 29, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR2d1ZmtzcTVIOUFwZ2lDYUVDbDVhc21KTWpTTXdfSTc1Nl9oUlFyczljZ0RFYWJiT3pDRVhBRG5lR0NjX01LREFLSnBsUG9FS1JvY1VraEE",
        "reply": null,
        "star": 2,
        "title": "Would give more stars,  but."
    },
    {
        "author": "Benjamin Hodgetts",
        "comment": "The app itself is fine, but if you remove the app from your phone, it doesn't remove it from your Android Wear watch (despite restarting, syncing apps, etc).  Your watch will just complain every few minutes that \"Evernote is note installed\" - yes, that's because it's been uninstalled. Incredibly annoying.",
        "date": "April 17, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRUNKYWVrR185WGdZR0kwUjM2MFFoQU1KUGdEbDBMbHRtclN3dmNCejl4cllzRDkzaGdJX2JoWWRrTVRjSTVka0tHamdVT1QtaVc1LWxTVHc",
        "reply": null,
        "star": 2,
        "title": "Can't Remove from Watch"
    },
    {
        "author": "Carol Cooley",
        "comment": "BEWARE! Great free app but I can't find it on my new phone. Only option is to uninstall. I have needed info in this app that I now can't access. Not Happy! Anyone ever figured this out?",
        "date": "November 14, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR2VFRUc1S2VzZDVQak01azRVSXNLVDZoRzlEbnVXNFV4bElkOW80ZGxuVUtEQkRBb2pUQ2lfMjNfdXcwX0lueDR2Rk44a3RGRVhtUDlfOFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lewis Hides",
        "comment": "App would be great if it wasn't for one huge bug I'm being affected by. When I use the watch to select \"recent notes\" and browse through them, the next time I open the app on my phone or PC, items from last year show up as being modified at the date/time when I chose to view \"recent notes\" on the watch. This pushes them to the top of my lists and that's no good. If this is fixed, the app would be awesome. Even though this breaks the app for me, I'm still giving 3 stars because evernote is awesome.",
        "date": "November 6, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRU93dUFLMDdyeWtDLURtVDljZWkwR2ltcnFsRDJSbjNCX2MyalhDcXhLa1RPQnpFZWxFRmt4aUhxRGxrdWR1X2JVR0xERThURmc0NzJ4OWc",
        "reply": null,
        "star": 3,
        "title": "Bugged for me! What would otherwise be an awesome wear app..."
    },
    {
        "author": "remi gious",
        "comment": "I have logged in evernote in my phone but it's asking for login in android wear everytime.. It's soo annoying. What am I supposed to do.",
        "date": "January 17, 2016",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR0xsTDFOV2t2UmxwMEhBcmJPTzBRU3c4ejlaQWtUZkJXb1ExWWhVQ2dfVEVvRDBhTHZkVlhJQzF3V0s3eUVMMGxfMy1DZ1hKeGxxT2Zsb3c",
        "reply": null,
        "star": 1,
        "title": "\"Not logged in\"  issue"
    },
    {
        "author": "Matthew stultz",
        "comment": "App did not show up after being downloaded and installed. Evernote is a good program but this particular app isn't up to par. So I think I'll use the editor's choice . I hope that one works for my phone.",
        "date": "December 8, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRXptc1NUZFJXdlplaHVJYUZGV2ZfdmVGTTVnMFRES2tRVmxRRzFoSmpwQXk2VVdUSmtIMkUweUlBaWdxSVY5VFFDMkxIaGxGRkxJZjh6dGc",
        "reply": null,
        "star": 1,
        "title": "Disappointed"
    },
    {
        "author": "John George",
        "comment": "Doesn't do anything. Can't search for notes. Can't bring up recent notes with actual Evernote active right on the phone.. Pretty worthless for me. Haven't even been able to bring up one note.   Everything else works fine on Android Wear. Using Google Keep until I can get Evernote working shame, love Evernote on Android Phone and Web..",
        "date": "April 16, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR3hSNTl5Qk1pc0JRV0cwcHVsOFdLR1Y3Y3JOQlFkdVpsSnl5anZEUl9CcXNoN1o4Vl82dE9HUTg4OWJaZmZMdnNfTVBaQ1VlNjJnaUI3c3c",
        "reply": null,
        "star": 1,
        "title": "Doesn't work LG G Watch with S5"
    },
    {
        "author": "Geek Speak",
        "comment": "Keeps saying is your phone connected to Internet. I tried to sync apps to phone, reinstall add in, rebooting phone. Nothing worked. Please advise what to do and I will change my rating.",
        "date": "March 6, 2016",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRUFLZ19SWDhTZXNtakZMTzMxbFFseEtSU2dJQk1ndDFwRFVSRVQwV3Q5bDhQVnZNZmViNnpJb3lXbUdDbGR4eThxWUlhV1RCalVoLU4xc2c",
        "reply": null,
        "star": 1,
        "title": "No to do list"
    },
    {
        "author": "Amit Belani",
        "comment": "(1) It can't find any to-do notes as expected by the corresponding implemented feature. (2) Recent Notes correspond to those that are recent on my phone, and not to those that are recent from any device, e.g. laptop. (3) When I take a note, it gets saved with Google Keep, and not with Evernote. Is it so much to ask for a working technique to even reliably save a note wherever I want it? (4) When it finds a note, it shows me only a very tiny portion of it. Why not a larger portion or even the full note?",
        "date": "September 6, 2014",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR0FZRlhfajlZZlhTX0FqdE85Y2xDTm1Qd1JSa1RLSklKV2I3MXVJZC0telZoVGdxako0ZTYxNjlKRENKTnhkMlQ2b2JrSlVQSkxERG5yMWc",
        "reply": null,
        "star": 1,
        "title": "Really bad.  Uninstalled."
    },
    {
        "author": "Joonas Kiviniemi",
        "comment": "+reminder notes appear also in watch +open note on phone, lock the screen and the note appears on your watch -I would really like to be able to show notes with certain tag on the watch. -all the checklist notes are shown on the watch (I have a lot of them with reminders set as late as one year, so this makes the feature annoying)",
        "date": "July 5, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR0FtZ0hicFowSVVMQ3VmaVhUUG9WSXpLc0FUeEFiY1ZkVUJKSWxuRE92ZUp4OXA0bEVQMUZWNGh4clhtZlV6ODMtY1FjQmVEbkNUVjV2emc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Mateus Cunha",
        "comment": "Users should be able to navigate to any notes they have instead of only being able to open only recent notes. Is it too hard to make a real interface instead of many separate cards? Really lazy design. Not so useful. Please fix some of this!",
        "date": "August 14, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR1ZpY3MxWDhkLU5DT3RkdFlrSjBhZzhFRmY3Q3E2aFRubHd1OEJMOXVWQXl3NWRJOTZBb0FpWmo5am14ckF0WHBPbXRkd3VwajRMTVE4TGc",
        "reply": null,
        "star": 1,
        "title": "Not as functional as it should be"
    },
    {
        "author": "sillious soddus",
        "comment": "Doesn't let me see any notes made on phone. It's not always practical to speak notes into a phone but it is easy to check them off there. Back to Google keep!",
        "date": "October 11, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPRlNPazVnVExPd0ZIa2s3czN5bFJIajh0Q1ZoMTVZb1M1NmxPa1ZSODV3U1B6ZnA3ZXZGUFdEVlRlY215UmZLX3kyVWJEakpieElsVEpMd3c",
        "reply": null,
        "star": 1,
        "title": "Useless on lg g watch"
    },
    {
        "author": "Fernando Spinelli",
        "comment": "Great idea.  No clue how to use it. Did it work with Samsung gear? Is it real app or just a joke? First time i install an app am can not even open it",
        "date": "August 28, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPR0hsLUxJX0JMQXZPVkx0TmZhRU1uaTZrQmE5OFhaQ244TXpVQ1BpMlN6dEdUUmFSMHRXTzZLQVVBanRnWnl0QWxhMjJhNzlsTUtqaWVFdkE",
        "reply": null,
        "star": 1,
        "title": "How to use it?"
    },
    {
        "author": "Alexander O'Brien",
        "comment": "Nice foundation (although didn't work when first installed) but please update to enable low energy mode! For my use (recipes) it's really frustrating how it times out so quickly meaning I have to reopen the note.",
        "date": "June 30, 2015",
        "permlink": "/store/apps/details?id=com.evernote.wear&reviewId=Z3A6QU9xcFRPSGlLX212S2RkQVhjMFR5Ti1RM08zdUJESXlSUXlnZUliZ2d2S0xoUGVySXA0ZlE3Ri1IUndLSGRVTjlsWVBHSGVJUGM0OHpISDdKUWpmRHc",
        "reply": null,
        "star": 2,
        "title": "Low energy mode urgently required!"
    }
]