[
    {
        "author": "Kathy Hedrick",
        "comment": "I think this is a very nice app. Sadly 90% of what's offered , you have to purchase. I tried multiple \"free\" meditations only to come back for day 2 and discover they were now locked and I was redirected to a page that said I now had to pay for it, even though the day before it was free. The fee for the subscription content offered is too high. After listening to the multiple meditations I was actually able to listen to (for a day) they all began to sound the same. Excellent idea for an app but needs more variety.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRzN5YUdsdWlfMzF2TE5zLWlrQTdBbXBURVBON2U4NnZZT0xNTE9XYjVRTVBqRjdzZ3BZM1A1VXl4TGlaMUMzdTZoTE9WSXNmYkhpZWRYTFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "This app was amazing when I got it. Free app with tons of options, about 50% needed a subscription but there was more than enough to get into it. Now you can barely use any features without an extremely expensive subscription. They have about 3/25 of the programs available for free so it just isn't worth using anymore. Otherwise a nice interface, easy to follow system and nice guided sessions",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPR01tazdEZEg0ajFPYzdwMUd0SXpDVldQNTBTS0lYWDlNd0ZmRFpaMTFQOTcwamtwOWhoeHZfYWdaNkZwMkpOMTBQeHJ5ekh0Y3NPU1Vya2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "John Diamond",
        "comment": "UPDATE... I've been using this app for over a year and it's just gets better. And it has made a difference in my life normally I use it first thing to start my day but sometimes if I need time out it's what I use. My stress levels are very low now... Thank you for the app   One of the best I have tried cannot decided on the yearly subscription would prefer a one-off payment. I did it yearly subscription unlocks so much more. Life is a lot better for mediation and this app is brilliant at getting me to that every day.",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRjJDNGRPZHQ5dklTanE2SkJTbkhUN0FpeE5heFJ0UGNuTFdzRjNVOWJGWnVaSnJ6Q2JCOExzUDBaQzRBRHlZMGF6R3dDNlRHXzRQaHBVX0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I am new to both this app and mindfulness. There is so much content I genuinely don't know where to start.  The daily meditations are really useful and calming, giving practical advice and guideance for a calmer more mindful existance for todays busy lives. The  sleep stories are brilliant for someone like me that has trouble sleeping and frequently Im fast asleep before its finished.   I never knew this app when a lot of the content was free.  However I believe this app helps to relax me and has a positive impact on my life and wellbeing. The cost I feel is value for money for everything that you get and believe my wellbeing is worth it.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRjBQbU5qUkdZT2xudHhpN1ZjWnNlV3FOUjZldW95REMzMXJCeHExQVUxNC1nRzd3WFcybkJtMUNrNTQwQ0ktZGhMaFZadlZfc2swZzVBTXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kaelee Eddlemon",
        "comment": "I think this has the potential  To help a lot of people. However I'm not over the moon about their  Pricing. I use this every night with my kiddos to fall asleep to some of our favorite stories have been  \"locked now\" and taken off the free version.  I can did pay for it once but can't get it to work now.  I'm starting to look around for other free apps like this. It helps the kids fall asleep , which helps me get sleep. Their stories are really good but unless you can afford it,  then it is too much.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRWc0OXpSS1h4M3NBLTMtQ01fOWoybXFidmRXMm9Ud0dJTEctLWJEeG5ITkVZQ0g3ak9UdElTYW52M08xNV9Ed2d6WEtfdk1Ld3RWUHBrT1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Hunter Thompson",
        "comment": "I was really excited when downloading the app and started a course right away. It was really helpful and helped me calm down for the day and I was looking forward to taking the next session. But the next day I opened the app and found out that I had to pay for the rest of the course, along with many other courses. If you have the money to pay for the contents of the app this should be perfect for you! But if not you might want to look for another meditation app that has more free courses.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRUVCRUJGZnRIS0tpbjk3UXJUWDlUd0h6VTY4c0xBN25LaFRaV0t4NDAzZjQxNy1oVWZCUG93Qk1WX1dSVGhBek85T2RWbmo1MXZmclZrc1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Christina Howell",
        "comment": "I've been using this app pretty much daily for nearly a year. I feel this app has helped me become a calmer person. I love that I can choose different meditations for a surprising number of different moods. The voice is always the same person and is very soothing and the messages imparted are clear and insightful. It's a little more expensive to subscribe than I was expecting, but ultimately worth it.",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRk1KOF9HQl90OU44YTVIMFcyOGlLdERsYUJKZHZoLXVJeDJUeDlrdV9yWkFmTlNrZnVINnQ4b1pLaGJENnJsMzF4eS1IYU1CS0t0Vk1TMVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "João Tiago Mamede Ribeiro",
        "comment": "Love this APP. Its simplicity and programa available are very good to initiate and have guidance practice. I wasn't sure about using an APP to start meditating, as i was already practicing for some Year, but it provides some very good programs. Besides this also includes calm music for different purposes. Also includes sessions talking about meditation and other topics related ehich are also fine. If i may suggest something.it would be to have available Meditation 8 week program of the book from Mark Williams and Danny Penman. I'm considering to pay for a year of unlocked features as i would like to use more often in my daily practice. Well done.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRnhCUkEzVEhPLUFqQ2VfaU1zMl9GN3N6NDhUNlFrNHlyTVpTdmpwWVpJeDNsY0NmajJUM3owUTlJTUJFcDdxUzhmUTBEdnV6WHJKZkhQdVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nicholas Costa",
        "comment": "Fix the open ended meditation! It did not work at all! Love the app, however the open ended meditation with the bells needs to be fixed. The open ended meditation is more broken than I thought. There's no rhyme or reason as to why it randomly stops working in the middle of a session. I have tried everything. Leaving the screen on, turning off do not disturb and using headphones but it still works inconsistently. Please fix this!",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSHBXZjVwRkp2ZU85S0hEVXFOVXBKaWk3VW9yVlMzdGRGbDd4UnNGSmJLQzl5ME9IZW16Mm0zY1J1Z3dwRU9EaFZaRDZULUotdkpLWFBxRVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "A large variety of lesson topics available! Lessons for focus, sleep, gratitude, happiness, calm, relationships, and soooo much more! Or you can listen to stories for sleep, follow a guided meditation, listen to a master class, listen to your choice (of many!) of ambient noise, listen to music to help focus or relax. This app is so comprehensive, it would be surprising if you didn't find something in here to enhance your well-being.",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSEJvNExNSVM0TVNUa2tycldReU55d0Mwbmpua3JCb2NBdzE5UmNvYnRuLUhQMlItbHRIWEJKUkxZRmxDU2taZVFqTFVodDE5MG5xX2xBenc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Audrey Eisele",
        "comment": "I love all the 1-star reviews due to this not being free...I wonder if all your employers would rate your work as 1-star because they have to pay you 😂 this is a great application and is worth what it costs. People don't continue to develop content for zero dollars, people.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSDNJYUN6ZkFMbVFOUkk5V0ZYQjBRUGUtczcydjF1WFpkUDRESl83SkNncnptREdZaEFqWjFMMWF4ZHA5aEF4RWhhWm5vcDhmZTRrY0h4TEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ben Kampler",
        "comment": "Used to be great and they had a few basic guided meditations for free, now everything's behind a pay all including the stuff that used to be free. Luckily the tracks were just audio files that I managed to extract and can play on an audio app. Will probably delete the app soon if content remains behind a pay wall.",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRl9LcGpVYnFwUzRrV0VmNTZYT1pXd0RZSGxNZTFpWnRzWHg0SzZsRV95NUM2VmtUU0VaUVpZQXZ1V0V4ajJQWDdFRDFzZTYtRTRzY2ZWa3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "I used to LOVE this app. I've been using it for years and had grown quite addicted to it. However, this last update has changed all my favorite meditations routines to PAID ONLY. They used to be free (for years) but overnight suddenly we have to pay.  Guess what? Your scheme had the opposite effect on me, I'm going to find another app rather than pay you for what used to be free.",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRzJkVjJYVVp5VENaYmh1SnBYX0NWelJyRDdMR2VDbk05Q3BpMHNfS3R1WWlHUWNSeTVGMkp2S0V0azl3cUVwZTdpOUp0UVI3bVh1empmRkE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Meghan Bullinger",
        "comment": "I normally don't rate things and I normally don't find a very useful app. The Calm app is AMAZING! My therapist recommend it. I started out with the \"7 Days of Calm\" and Bedtime Stories...and then I \"unlocked\" endless Calm options for only $4.99/month...that is so inexpensive for the emotional and mental health benefits you get from it. I enjoy taking time to myself each day and this enables me to do just that, all the while increasing my overall health",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPR1FvMXJPNHotWUJwVnM5Yld0Q0ctSzFiczNuMVRRQnhYalFuX201NkFOU3lva05rT2dNT2tvS0Ryb182aW5YOU9LTHluNVJqblU4bTFxUWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nom C",
        "comment": "Used to be fantastic, you can create a profile and track how many days you meditate. The Loving Kindness, forgiveness and Calm light meditations were excellent and free and then one day they were all locked and you had to pay. There was no warning or notification which is really poor communication. Sadly I can't afford the pricey £10/month subscription so I'll have to find another app, such a shame.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRkdKVHdZeUhZY2FHLUZPOVFRTVg5cHVWRzNqeWdHdEZHbVNCQy1EOGo4YW1NamRucjdPZk0wY3lvTWRvQnlFVzczMEhROGY3UFZoeTYydVE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "D. Travis North",
        "comment": "Meditation had become a part of my daily routine.  Calm helps me every day.  Some of the sessions bother me because the older sessions have a somewhat harsh voice.  But all of the newer modules with the newer voice is much more soothing.  Edit: seems like they are phasing out the older sessions.  I love the new open ended sessions as well.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSEZmcFlERmw1ZG1HbTllaDFTcHZyOVBsYk9INnkzb2FJcDVjenpaRjBISGlQcFA0Z3pNWUppOGNWVHNKVzhmOXhES1RlV1JCS0xYNUZudGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I will say that listening to the stories DID help me fall asleep faster. For that i am thankful. However, I can not afford to pay to listen to the  stories. I listen to one certain story that WAS free every night and now you have locked it. NOT COOL! Please give more free stories!!",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRkg0MUtwTHVUcnMxeDQtbVg2R005a2pRaGpsd1A5NzZUUm02aXNDVXFIVTBHZUt3ZGMycEJjM0JxRldBTHc5LXRjUXlMSTFjcTRRWEs5a0E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Dawn Kirby",
        "comment": "It's something I do every morning before work because it only takes 10 to 15 minutes and it leaves me feeling relaxed and refreshed. I also use it before bed to help me unwind before falling asleep.  I've noticed since I started mindfulness 2 months ago that I'm sleeping better than I have in years.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRzBFUlVCMG5XajB1Zm42YnpXcUYyMktRU0N2YWRlRGpxbzB5RWc5SDhWcFQ1VGpXbDdwS1czdFdfcGFEYWViZERmX0hjZWJhZzg5SXpib2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Luke Townsend",
        "comment": "Excellent way to track and work out the mind muscles. Fun and interactive meditations for a number of goals. The ambience and scenery create a quiet space and the function that allows for notifications to turn off is perfect.  It is not as intuitive in design as I would like, especially when switching from mobile to desktop usage.  However, the educator discount is perfect for me to track and share my own journey with my students as I present calm and mindfulness to populations in great need of the help of this super power.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRWV5U1hweFY5SnpWOTFNLWwzYUpBNXJTNDZhbVExdHNPeTBvckpJbC1OMlZWa3B6dFRlbk9FMGVuUmo0Z0xBU0MzeWNtOEZGNjVsUTN4QUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Amanda Maciel",
        "comment": "I used to love this app. All my favorite meditations were free but now they're all suddenly paid. Seems like they're trying to convert most to paid and put limitations of whatever free stuff that is left over. I can't afford another subscription service. I'm going to look for a new app.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRjZuS0tkeGQwMU1saFdCZkVsX0hvdVlIWGo1UFpkN3lCU0FxM1M5dVl6WTZ3eGlORXNuTG1la1oyWFp3UmFib21xNE9KUEhoWUdKcEJOcVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Juliet Will-Robinson",
        "comment": "I've struggled with meditation my whole life. It's something that I was always told would do me good but it was never possible. Now thanks to this, not only am I meditating but I'm noticing a general Improvement in My overall well-being. I love everything about this app and what their team has done",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPR0NpOG5xY0I2Mi1McFVvMDRFQV9YZXd5RWVDWlNqUDhCc1l4OS1BNUltREZvRmtxY2s3MmtsYkR1b1VsN3FRQWNfdEtITjJvMW5La3BtX1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sasha Gregory",
        "comment": "I used to love this app, and I've recommended it for so many people - it's definitely been 5 stars. However, they've now changes it so there are no longer any free guided sessions. Disappointing that I now have to uninstall and look for a new meditation app :(",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRlRfZEpYc0pQUFpIeXZTZV84STBhWmZINm80UUJZWURGRDVHR0JRUnNnQXY5X29zazhYSUxIRWhOUW9wa2VJQ0VVMklkMzBiaHdPRmxwM0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Leah Ferrante",
        "comment": "This app is great for those who are trying to become better sleepers and learn about meditation. Definitely worth the yearly fee. I've been searching for adult bedtime stories for awhile now.   One key feature is missing, however. That is a playlist with sleep timer option. Time and again, I keep falling asleep during the sleep story but I wake up as soon as it's over. This also causes me anxiety because I think \"well I only have 15 minutes of the sleep story and then I need to be asleep.\" If there were a playlist option, I could be more relaxed about sleep, knowing that the end of the sleep story would not wake me up.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSE8tMTFldlV5NktMMFRWeW5YckQteXlhcnBKTm4xT1RkeUl2X1A1MjE4Q3hSenJ6T3hjUHhrZWpzSjJtV21Jc3Bhak90UEV2Tk5kc3A4c3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Its amazing in pre demo for the one meditation it gives you free. Although if you have the cash and can justify a monthly payment its probably way better. Still good as background sounds to complement a byo meditation though. Stories were the only part that i thought were a little creepy",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRWgxcUNUU1RDb3FYZ0RWdVdGLTdIbUFUS0VoSTFtOGpwX3daU2RlQ2kyNU44TFRiempibGMwSFNJNzQ0QVE5LURmeHJWdV80U0FYZ3N4S1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Safira Pairaya",
        "comment": "Great app! It keeps my meditation on schedule and so easy to use. I love the open-ended meditation, and ones with the guidance as much. I'm thinking about getting premium, but there are issues and people complaining about it so I stick to the free acc. But please work on the premium.",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSHNTd3dmT240bEhLSE92MzFIZEJNMXIyaGtfQ09YUGNUejlReUg1bUJONkVzVk1JMHprb09kNUNXbG1yTVZVeGJoQjZOTlAyUGE4XzVSX1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ursula Weissfeld",
        "comment": "I love it! When you open the app this can nature music plays and even though not all the sessions are free, the ones that are free are great! You can also change what her you listen more to the voice or nature sounds during guides meditation. You can also download meditations.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRmdMR0NhRmJwSjhlRm1yMUI4YkdnUFZUaVl6Uk9ZNkIwUHFjRk9BWEZ1MFQ0LVFtSDVOeUdQVmo4Zk5lVnM2Znp6S1RHVkxJSUJrZkpvd0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tiaramarie Briggs",
        "comment": "One of the best apps I've ever had. It's a gem that just keeps getting better the more I use it.   I saw an advertisement for this app on Instagram a while ago. I was amazed when I downloaded it, simply by all the ambient sounds that I could listen too. Until today that was all I used it for. Then, for my New Years resolution (less time on social media), I finally uninstalled Facebook from my phone and have replaced my mindless morning scrolling with the Meditations that are offered. Session one is done, and I can't wait to see what else this app brings.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSDcyNlNFb1dZQmxNRmRiNEhyWkdDSHdwb3B2ZVBtM1BObzNudmt6NTVnZXhCTHFwY3ZOcThlTlpqSm1SRjBYOWdUVS1TMXRXY0pxYkFZZUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Claudia Toribio",
        "comment": "WHY ON EARTH DID YOU ELIMINATE THE TIMED MEDITATION?!   I only use the free version, but I really enjoy it. For timed mediation, it's the best. I'm in love. And I'm so overwhelmed with the welcome message when you open the app \"take a deep breath\". I am taken away immediately when I read that. Really love the app. But I still find it expensive.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPR0FvLURmdTdzS2NXekI5VVdzMjBIcEFKNVRLVGx5clRlcXkzNjNVTFNzaTZWUW1LM21Ldk5EWjFHZmZoRm9nclk0TFlTc18tSUNrZ01td3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Daniel Gavin",
        "comment": "rerecord the field of grain. theres a motorbike noise in it.  Sleep stories are great.  If you really have got a bad case of hubris and are charging like wounded bulls like the recent reviews say i may have to reconsider my renewal. Pity.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRUpEYi10dnpQYTUtcTFZMGNZbDVSbDdWODQ4bGdEZS1NOExzYVhYd2tDQXFzX3VTRWg1MzM4UWRtY09INGkwdXpiT0ZUWHh5a0thNXk1MlE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "I'd love to give 5 stars, but it keeps messing up my progress. At the end of the day when I'd like to continue with the next lesson, I see that I'm stuck on the previous one I completed the day before. Happens all the time. It ruins the otherwise perfect experience I'm having with the app.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSGo1YThQZ19MeV9XVGtsckw0LWdjR1p3U2NDOGg5RFNzLWtXcEJyOFVCSjkyUVVacEQ5c0RGaEk3bTluSy02TndyMUpVZjVESS1sNTZkQlE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kayla Fowler",
        "comment": "I HATED IT. YOU HAVE TO PAY REAL MONEY! FOR JUST A STUPID LITTLE APP! I MEAN WHAT IF YOU REALLY NEEDED MEDITATION BUT HAD TO PAY. THIS IS WHY YOU SHOULD NOT DOWNLOAD THIS APP",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRnduVzRsOWtwODMzZkpNcHRGU2IwaTFqeG9HU2tJSjFZZF9sWWQyVmd6TE91ZjQ2T0dqNW9JYzkxcjFIU1l2Ujk4S19WZUY5VS1JZmNqNnc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Nikki McLaughlin",
        "comment": "I am not good with meditation by myself.  All I need to do is open the app to feel complete serenity.  It opens up to a beautiful view of water with running water and bird noises in the background. There are different meditations to different things and each one is short so you don't have to spend forever getting 'in the zone.' I definitely am more aware of myself now and look forward to doing more.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRndzSVl0VklTbWpCVGFkQVM0Zm5FcFdmSDI5a1ZWWnJEVjgzRmUtWVE0S3FScm1vaEdmSU5QMU9xbzVERVdGZFRuajVOQlQxbWhndGo2bVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jamie nee Elizabeth Jamieson",
        "comment": "I am a diagnosed insomniac and have multiple immune disorders that cause chronic pain. From the first time I used this app my sleep has improved dramatically. I actually got three hours sleep that night after only two hours in the prior three nights",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSG85Mkhpd1ZIQlpSQ0hFMXJsNjFkRjBBdFlqNFBIOWVIVVRoMHpTNnQ3a0lsb1R1N19QWVU3QlNhNFQxSVRZUVRDclhESW1hTkU1ZVk5aVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nicholas Martin",
        "comment": "The monthly price is a bit steep but you can't argue with the results. This app can be life changing.  This app has saved my mental health in so many situations. Definitely try their 8 month free trial going on now.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRmp1aURsdWhxandjUUFnWTlpYTJJQTF3VDBkbXdtTU9xTkJId1Vacld6ZzZvUi0yWDBVd3FFQkpzRjNQQUJYVFhDcmR5eExSSlFtZkthbVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "simon walker",
        "comment": "I have enjoyed using it since I signed up for the trial. However I think it would be very helpful if there was some form of timer that switched the app off when you use it to go to sleep. It seems bizarre that something targetted at getting you to sleep is left to run for up to an hour.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSHNJa0RjRHBfUVlLNG4zSlA2X25XVGpQY1JmZ0haRHRpR2k1R0tEaGtXTUVZUldsRnF2dnVMcklKMVhrLTBDRTFZUFRuTUhMT1llcG95cEE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jordi Català i Amat",
        "comment": "How can you don't have feedback functionality? We pay a lot for this app! Also, in open ended meditation, would be great to have 15min intervals. Seems like you don't understand how often would someone mid experienced do their meditations...",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPSEV6ZkFQOUpoMWxROGlZQTZIaFpBMWpORk1rd1ZKMUtaWEFuWjRYSURGeGVQa3J0NUZzUTAxdnE2dllqeHVqYUotbTQwcXFnM1ZiaFpNSXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Laura Garvin",
        "comment": "This app gave a nice selection in the free version. It was enough for me to decide to pay $60 for a year. 7 Days of Calming Anxiety is a great series.  I look forward to the calming sessions. There is so much meditation content in the full app, that I will never get bored or run out of material. The music selection could be improved.",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPR0pPQmtCRnktVHlJdlEzSXlGdG8xSkJLY1R2S2F5TWtteVUtZ2djdm9VRENVUUlOQmZuNm96MVZKLXhCVFRFZFUxYUdEU3o4Uk9OOVRwMnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kate Lawless",
        "comment": "Great app. All the programs are really good. The only thing I'd want is for the 'returning to now' meditations to not have any guidance beyond an intro. There's way too much talking in that one, but the bell is helpful.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRWNUUjlHdGd6RE5oMXRtX09RMDA2eHlHeDJtOU03czlnOVBReGtIX19SRzFSc2pZb0Y5SE9NVExNYTBkWEN1RzhtTHFFZDZFWFlSeWxyT0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Linda Koekemoer",
        "comment": "I have used sleeping tablets for years.. when I heard about this I thought yeah right ... well I haven't taken a sleeping tablet since that first night, sleep like a baby. Highly recommend to anyone looking for a good night's sleep and waking up feeling refreshed and happy!  Awesome",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRlJpT2tUTmNmT05KOFFFRi04eVhfWXFvRV8yRVhOUjNfbkpIWWdkMmVHR191VklSUTZULXhndkZtZV9KU2FicmJZVnVRWTF2NEdQS2tfWFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Joy Kim",
        "comment": "I loved this app because of their \"scenes\" feature. But after a short amount of period, it just stops working. Even though the sounds are downloaded on my phone, the background music doesn't play. Very disappointing. I hope this problem gets fixed soon.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.calm.android&reviewId=Z3A6QU9xcFRPRjJsYnQzMlhvcHcyT1FDSHdfSzVFWDhmWWNaQ1dDZ2RUeVVHc05KdkR4ejR4ZHU2d0l0SXJlTGRPekNLQXFLeUg4NEFCQVFOWF94WWthcHc",
        "reply": null,
        "star": 3,
        "title": null
    }
]