[
    {
        "author": "Phillip Forrest",
        "comment": "It's easily in many ways the prettiest, simplest, most usable, and best recipe collection app on Android, and I would argue on iOS, too, actually! (Despite it not being on iOS, sadly. But nothing on iOS compares to it.) UPDATE(02/2016):Still fantastic but hasn't been updated in a very long time. No longer syncs properly. Lost a bunch of recipes. No developer response. Wouldn't install anymore, sadly.",
        "date": "February 3, 2016",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSHVYNnRoLU1uVDNjR1k4WVVuOXA0WkFJaE9pQ0Q1ZDJqTVFJZjZzeWRfQmhqQW41dWdnS1UyLWhsSWREUkFQUl85VmlPM3JoQlVpMGU5cFE",
        "reply": null,
        "star": 2,
        "title": "Best recipe app on Android or any platform once."
    },
    {
        "author": "Kevin Amundson",
        "comment": "The beautiful Material Design aesthetic is a wondrous delight! The functionality of adding recipes via the Android Chrome browser is simple, intuitive, and flawless. There could be an easier way to delete recipes without having to open the recipe and then remove it, but that is only a minor inconvenience. The only drawback is that you must use an Android Chrome browser to add recipes as there is no extension in the Chrome webstore for use on a computer. A chrome extension would greatly increase the appeal of this app and a broader audience would be able to share/save their recipes to the app. A Chrome app would also be a large boost as the recipes could then be accessed online from any chrome browser!",
        "date": "December 5, 2014",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRjA4VXZjcVI5LWo3dDJtQmFHMDFiYVpxUlBsQTJRbHRhT0pXa2dpUWNyZkdONC01cllPSURqYjE5eVppRnQ3UkJxN05BSm5vS0JycnA1MXc",
        "reply": null,
        "star": 4,
        "title": "Aesthetically Brilliant! Needs a Chrome extension and app!"
    },
    {
        "author": "Kiryn Silverwing",
        "comment": "Beautiful, smooth interface, and I love being able to import recipes directly from Chrome. Too bad it doesn't work 90% of the time. It worked great for the first few recipes I imported, but hasn't ever worked since then. Marking down further for not being able to put recipes in multiple folders, and for not being able to access them from my PC (if I have to type recipes in manually I'd rather have a real keyboard)",
        "date": "January 18, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSDRSMVF6TElvRjJ4aW5nN0FBcmF1VmJ3TW9UVzByOUpTVHoxajMzLW5Kamdia1hqdWVMcElJYzBzS2NUUmtwQkVJQ3RhWFI5MHFmUzF6ZVE",
        "reply": null,
        "star": 2,
        "title": "Doesn't work that well"
    },
    {
        "author": "Ryan Knieff",
        "comment": "Interface is decent but needs more features / functionality to compete with my current favorite recipe app (Pepperplate). Importing from recipe sites is extremely limited and recipes should be allowed to be in more than one folder/category for starters. Unless there's some other *unique* feature that gets added down the road, I don't really see myself using this for very long.",
        "date": "November 22, 2014",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRjNBa0M4YUVSRWlrcThhckFkZmdtWmJ1TVhlU0wxdlhjUEdXWDduTWFvdE5KV3VQcW9STk51aHRWbkhXTzR2VTBqcTk0bTRzTDhNMjVRUXc",
        "reply": null,
        "star": 3,
        "title": "Needs More to Compete"
    },
    {
        "author": "Holly Potier",
        "comment": "I've tried several recipe apps, and this is by far my favorite.   There are a couple of issues, as it doesn't import all recipes that I try to add by browser, and if it does import, at times it doesn't import all of the information. Recipes are easy to add , so the issues aren't a hindrance for me, but it would be nice if it were fixed. It would also be fantastic if there was a Chrome app, so i can add from my computer.",
        "date": "February 8, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSGdaSm5zZ01tSUFzeFBHb2ZkS2ZpTENTaUEzUEdQRWJPWGI4VmFfNGVTWXNyWnVScUZmY2t6Q24yR25XanhKTUxmTE5Xc2FCcVl3VkxhWHc",
        "reply": null,
        "star": 4,
        "title": "Really great"
    },
    {
        "author": "Kim Townsend",
        "comment": "I really loved the ease of this app and is beautiful and user friendly. I hate that it won't clip recipes from all sites. There are many recipes that I can save to Evernote and pocket but not here. Fix and I will give 5 stars. I emailed the developer well over a week ago regarding the inability to save all of my recipes and no one has bothered to  respond. I wanted one pace for all of my recipes but this isn't it. Uninstalling.",
        "date": "December 31, 2014",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPR3IySzR0N0R6SE5FUWU1MWl2N1dweFFJLTZPMHQzNDEzdzZUOWpqcDZjYUQ2Ykd0bHowY2J4Xy1XeUpkUXg3czNYX0Z1clJpQ21JQlhSbGc",
        "reply": null,
        "star": 1,
        "title": "Developer never responded"
    },
    {
        "author": "Chayanin Wipusanawan",
        "comment": "The interface of the app is good-looking, influenced by the Material Design. The clipping feature is not 100% reliable, but is good enough for me.  However, the app doesn't offer much other than keeping your recipes in a uniform and categorised manner. I would love to have more features like tagging or sorting by ingredients, and a desktop tool to edit and organise the cookbook more easily (like web-based,, for example.)",
        "date": "May 31, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSF8xNHBEd1VlUVFjNnhsR3liMzhZWUxFUThycy1mbzZrSDlTRFBxY2JWTTBsT1BtRVZmQy0xOVVLa0NUVE56TDZSZlYyMjRJS3lNenZNWnc",
        "reply": null,
        "star": 4,
        "title": "Beautiful, but could use more features."
    },
    {
        "author": "Steven Rothermel",
        "comment": "this is just a Great app.  the material design is nearly perfectly done here (sliding tabs on the default page would help people know that they could slide left/right) and while the app isn't exactly smooth (scrolling jitters, and side out drawer jitters) its super useful. I'm just nit picking though.  overall, i really enjoy the app.  the quick importing works for nearly all the recipe sites I use which is nice....the syncing is spot on, the overall UI is fantastic.  I would love to see multiple categories for one recipe though.  (EG: so I could have Zuccini pizza in both \"healthy\" and \"pizza\" categories).  throw it in the unlocked features, and you have a buyer.  even with the slight negatives in the app, I'm still giving 5 starts because its so well done and supported.",
        "date": "November 20, 2014",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRmM1eTgza2QyZlNGandEQzlEUHMyS3ZEdkxxYklFWTN4LTBEci0tX0Rwc2tydUx3SmFIdzk5TTFOQXZMejd1cUJ3Q0hMcUFPRl93R0drTVE",
        "reply": null,
        "star": 5,
        "title": "beautiful, functional, nearly perfect!"
    },
    {
        "author": "Adrian Jenkin",
        "comment": "The functionality and features seem excellent but I've yet to find a web site which the app will talk to. I'm not pleased with having to look at the sample images here in the Play Store to find sites which may work. A list of (known) compatible sites would be wonderful - just put it in the app somewhere with links. Who knows they may pay you for sending them pageviews. Not satisfied enough to pay yet but I want to be.",
        "date": "January 30, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSFhXZDNLbGNZZU9DYlZFbVNPRWVkdm5UY0tLNjYxd2ZnTzJseWhrOWxPaEJuMHRseFJwS081Tk5QZFB4dEVwbEMyVHJ3MmRlTFFmajJxcXc",
        "reply": null,
        "star": 3,
        "title": "Potentially Really Great"
    },
    {
        "author": "Lukas Gabi",
        "comment": "I've just downloaded this and this app looks like what I've been looking for a very long time! Beautiful, and so far importing recipes has worked like a charm. I hope my first impressions are right and I can buy the devs a coffee or two ;).  edit: is it possible to delete recipes...?!",
        "date": "December 3, 2014",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRVlVYldOMEo1amI4Yl9Tb2V5YTMxdUw3V3FMNDRoaDJUSFNlc2N6VDVGeTF1ZXVfLXNWenQ1cktHa2lma0hES3ROUHUtd0lPN0FhellMbWc",
        "reply": null,
        "star": 5,
        "title": "looks excellent"
    },
    {
        "author": "Michael Anderson",
        "comment": "This is a beautiful app that takes full advantage of Material design, but it has several issues. The most important to me, since I forked over money for the Pro version, is that there is zero response or help from the developer. Usually that's enough for me to ditch even a free app, but I find that unacceptable with a paid app. Android Wear \"support\" does not function, which is rather upsetting because that's the primary reason I purchased the Pro version. Additionally, Web clipping has yet to work for me. The free version might still be worth your time, at least to check it out, but I would strongly advise against purchasing the Pro version.",
        "date": "December 13, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSDZGVkZ0dDVvcVI1dWx4YzJ4WmlxaE1KVlBHczBFdE5SdHVWRkNDSTlKVkN3NHBVVC14bERGLVJsZkF1UF9vbXJtQ1R4X3J3OEpTMWl2NWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Cris Spark",
        "comment": "Great app! Shame it doesn't work will all Web pages but I like it so much that sometimes copy the content and paste in the app. Would love to be able to use chrome to add/edit recipes. Clean and beautiful interface.",
        "date": "November 27, 2016",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRzhaaElMSXRsZDFQTzdLUFllQjZHczhMeEpudm51bU1vRkZaOV9BNllyTEFBVnlGOHM0MFd2QzFaVkhPRE1JdzV3MFZqLTl6aHAtXzlma0E",
        "reply": null,
        "star": 5,
        "title": "Asparagus review"
    },
    {
        "author": "Susan Markanen",
        "comment": "This app is beautifully designed and I would love to keep using it. Would definitely pay for it too. But there are some minor issues with it, the developer doesn't respond, and it hasn't been updated for 3 years. I just can't risk losing my stuff 🙁",
        "date": "July 8, 2017",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPR1lnTWxCcmtqcmk0MEF3cEcxSng1dS1jVW9jMnZJZzFqRDVTa0lOS1FCYmx2X2dsb0VXb2dmaFVoTzUxRm5JVVpSZU5zYklfRFZQOE5ndXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Philip Belcher",
        "comment": "I love using the app and even bought the upgrade to allow it to be used on my smartwatch but so far it is a pain getting existing recipes into the app. I've got a hundred or so recipes saved to Evernote so a way to import recipes from there would be very handy. I tend to find recipes on a desktop computer too, so having a Chrome extension to clip a recipe into the app would be great.",
        "date": "December 11, 2014",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRkNsQ2FLZm9vUG43ZklpQnhUcTBtU0RSclpBZUJtYTh2Rms1LWVVWGJzd1pKUUlsUXpwQzV4ZmJzcEVfZ2w4dzRpV056UFNYU1hGWm5adVE",
        "reply": null,
        "star": 4,
        "title": "Beautiful - Needs Chrome extension however"
    },
    {
        "author": "Sawyer Jinkens",
        "comment": "Started out really loving this app, added several features that other recipe organizers didn't have. But the total abandonement by the Dev, as well as annoying whisper messages about premium (why would I upgrade if the basic version is barely usable).   7/10 times, it totally mangles importing a recipe. And that could be not having the steps formatted correctly, to absolutely NOTHING being imported. Frustrating beyond belief. Move on, this app is toast.",
        "date": "December 25, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRU9vNjlKTnBQbkJiNm9EdVp0aXlRZ2hNcDdqMGlESnEwSmdtUGEwdjY5bk9HcGlkczJFZEtieExsT21leHZES3JHMW1EZDJQeDNKYTc1dWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kati R.",
        "comment": "I would love to use an app like this, it could be so helpful to have a place to gather all you need for cooking in one place. However! I was only able to clip 1 (ONE) recipe so far from all the huge (and known) recipe websites I visit. Wonder if that would change if I bought the app. But until I know it for sure I' m not willing to pay. Developer, what say you?!",
        "date": "January 27, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPR3NvWHJWMEVKS0x1UTN6aHdPcnFpSmdaTjVtOGhLdHhBdDVja1JUOFVkX1Jqblo2dmkwSnc5WUI2Mk9ERDNUWUZvNVhIZDZ1cndtRUYtX3c",
        "reply": null,
        "star": 2,
        "title": "1 out of 10 recipes could be clipped"
    },
    {
        "author": "Tina Rad",
        "comment": "It's such an elegant solution to my growing mess of recipes strewn across various cooking apps and bookmarks. It looks beautiful and it makes it so easy to organize. When the importing from URL feature works, it's glorious. Kudos to the developer for making the most useful app I've found in ages.",
        "date": "November 30, 2014",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPR3FWOG9BUENrRlBDQ1dHN1NMYXVjamJNQ3ZjdVY0UFFLXy1yQWF5MnpLOWUtWEFlcVNIM0x2WWV1a0RzQXRSczI0VFNLR2R2MnhWNG41WHc",
        "reply": null,
        "star": 5,
        "title": "I absolutely love this app!"
    },
    {
        "author": "Robert Gant",
        "comment": "Update 12,June,2015: still no response from Dev. to this date. I tried the free version for 2 days in January. Really enjoyed getting recipes and purchased the premium paid version for $1.99. I went to make a dish and noticed the app switched back to free version. I uninstal then reinstall the app with no success.  I emailed the creator of the app on Sat Jun 6. Hopefully there is a way to turn premium back on.  I feel robbed because I paid for an app I couldn't use.  Had to make the dish without it.",
        "date": "June 12, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRjFDZDdmbmo5MlIyeGZJOXhCZXV6aHJCODFJVFZBVDN2TjB2dUFfUmZxUy1mVU9MeE9rVzBwQmFsMVBCNm5NZzMxaUNLQkRHdWVhZ3loZ2c",
        "reply": null,
        "star": 1,
        "title": "What's the point of premium?update 12 June 2015"
    },
    {
        "author": "Michael Conte",
        "comment": "Edit, update: I still love this app, it's beautiful, simple to use, and half the time imports from food sites. Seems to have it's favorites though. However I've never been able to get the voice portion, or the smart watch portion to work. Doesn't do anything at all. I still like the app for the simplicity of it, and the design, but these two other features, and still not having a desktop/or web app to be able to input recipes easier makes me drop the score on this app.   Developer please don't abandon this app. You have worked magic with this. I am actually going to pull all my hundreds of recipes from evernote into here, you've got a fan and supporter Dev, keep it up!",
        "date": "February 27, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRjhjNlBOQ3BraElkMXJUY1MxSmJhek4wRDRsNU1OdEY0UFM0bXJFX1Z2S3BTUGNuSy1wZEwtMmYwQnpBR2NlVXhZMENpV2w5ZlRHU2pJTWc",
        "reply": null,
        "star": 3,
        "title": "Edit, still good app, but slowly losing faith in development"
    },
    {
        "author": "Antonio Pedrina",
        "comment": "The app is good.  I bought the IAP for the premium version and I'm still seeing ads.  And the recipe slider won't even work.  Very disappointed.  Tried to contact the developer twice and got  no reply. EDIT: Although the developer is still no help -  the issue can be resolved by attempting to buy the IAP again.",
        "date": "November 22, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSFdMZURDYVRGakFKeDMxQkJHZmh2S080UXdWYld6RHNtRG05T1I5YkFHYmV1TERSNmk5dy1Kd3FHQXFpRXVHQ0w5UXRudDJWMW94dGZnRmc",
        "reply": null,
        "star": 4,
        "title": "Good app let down by developer"
    },
    {
        "author": "Lee Goile",
        "comment": "A must have for anyone who cooks. Linking to a website frontend to access and add recipes would be grand to save typing. Only issue I have is that some sites still won't clip even though they contain the same tags as other sites that do.",
        "date": "April 3, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPR1VGcUFFZTR5QmFSc0hJNV8wSjY4eTVGMkxCUmJoMk9teWVtY2Iydk1yb1Y5VzduN3pUMzlBUXozdC1UN0ZOX3hWaFhrQlRZTjQ1UjFpdnc",
        "reply": null,
        "star": 5,
        "title": "Love it."
    },
    {
        "author": "Steve Lickwar",
        "comment": "I'm just a guy who likes to cook but can never find the recipe I used before, whether it was on the web, in a mag or cookbook.  This app solves the problem,...  if you like it, just list it. Excellent and expandable folder system that also uses symbols. I use the voice recognition system to enter the recipes.  This feature gives my wife endless amusement as she listens to me try to articulate clearly. It can sync with your phone and tablets.",
        "date": "December 16, 2016",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRnFZUlViMjZ5UVdVb21RdV9yOGZwYVI2aHlDNUlNdVEyZUJ5bWVzMFM3UFZnNEpnc0xPTkFSd0hTUm5FRlplNFUwVk5Zd29DaW9TYTE5S0E",
        "reply": null,
        "star": 4,
        "title": "Like it, list it"
    },
    {
        "author": "Ikhwan Arif",
        "comment": "Though somewhat bare, the sync using Google account makes up for it. Sure, it could use a grocery list, perhaps a nutritional chart and maybe a search engine, but really, Chrome, Google Keep, makes up for it. Considering it's from a small developer, this is useful and impressive stuff. Well done Jakob, paid your bills for this app. Keep it up.",
        "date": "February 25, 2017",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRU5ucnNjR0E3UG5XVFQ5TVNOR3MwMmNBT1ZlNm9pbG1XNnN0clByTllWN2hTeWZVQnZUX3VXYklydGNUQzIxZjJpNk4ydk5LSUh4R1JXdFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Matt P",
        "comment": "Unable to clip on plenty of websites with basic formatting.  I see no reason to pay money to unlock features when the developer puts in no effort to update the software.",
        "date": "May 18, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRkxNRW81bDFfX2k5UjAwYzZtZmJkMUVhQjMwTzRUd0ljdWhvc2gzQ0RBU1Yxc05RWEwwRmdMMEltcmt3M2x0YUloQ1V4bkdvdEdyT193enc",
        "reply": null,
        "star": 3,
        "title": "Needs updates"
    },
    {
        "author": "Zach Bertram",
        "comment": "This app looks beautiful, and has the best-designed Android Wear experience I've seen in a recipe app, though it desperately needs to support dimmed mode like Keep so you can keep looking at the recipe after the watch times out instead of having to find the card each time.",
        "date": "August 21, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRXR4TWItbEctY3BHc1Q5WXNsYzR5Q1Y0b2hFMFlkQk5NWFVST0ZvS3owenlQU3VZSWZXcDJ0M2tkazJYLS1kQ2QzSE9iZllDT1RTTHlLbFE",
        "reply": null,
        "star": 4,
        "title": "Great interface and decent Wear support"
    },
    {
        "author": "James Welch",
        "comment": "Full Version does not covert the recipes to a larger recipe size correctly. It also convert measurements to decimal points. Ex: 1/3 cup  is changed to 0.33 cups. Leave my fractions alone. Import feature does not work half or less of the time. Has not been updated in over a year. Developer must have abandoned this app, it's a shame it is a decent app.",
        "date": "November 16, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPR0hxZ0h2V2JncThIaTRUbnVWVzFDdUNOcXhrY1g0b1ZkMl84cC1ZVG95T1NCbHVPcm5GMnhkM3hmYzhYZl9hYklTRXRDaUZYTlNtSUVKakE",
        "reply": null,
        "star": 3,
        "title": "Recipe size slider not working correctly"
    },
    {
        "author": "T. Masinter",
        "comment": "Love all the features! I have never been interested in a recipe app before hearing about this one. The only thing I would add would be the ability to add a recipe to multiple folders or sub-folders.",
        "date": "January 3, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRVZuWTcyQmVTMTF0SDl3QkUyMTEweWdQTGU1dUxsVUtLUWtadHZFNmlxaW9qM1M4djFZZlprRE9Vd1p4ZE44dFlzUGN2ZmxPNGg0ZUNjaHc",
        "reply": null,
        "star": 5,
        "title": "Best Recipe App!"
    },
    {
        "author": "Msl LogYt",
        "comment": "While the app seems cool at first, I realized that it has been abandoned for a long time now. No updates, no solution to bug problems, no nothing. Developer doesn't reply to mails either. In the end, the recipes don't get properly synced, so no matter what you put in the app, you'll lose it. Some alternative apps for storing recipes are the classics, like evernote, onenote, etc",
        "date": "February 5, 2017",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSG5aWk05YjdYYm9YU1MwWV8zWVpGb0t0Rk5MV3F6WlZLT1VOVEo2VDdLeXJHN2VkQTZjYVk0YnlGUkdCMktXcGQ5UXdHT2NxY1E5cWJWR0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "George Buller",
        "comment": "I really like the design so it's unfortunate I can't use this app. The main problem is that it often struggles to port recipes where other applications are able to.",
        "date": "April 3, 2016",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRzg4UHR4QkRqck1yeTg4MGZ1ZHd3ZVpKTmJ1Y1pPdHQ3RXhCSWp2RU4xVndnTHQxblRMQVhPdFhnTEpfZ2x2Q1RJSmdqRmhXc21CYjFSTGc",
        "reply": null,
        "star": 2,
        "title": "Not up to scratch"
    },
    {
        "author": "erica joi",
        "comment": "I'm not super into cooking, so I'm not interested in paying for a subscription to hold my recipes, like 90% of the cookbook apps out there require. The other 10% are ugly as all hell, so I was super excited when I found Asparagus. Too bad it doesn't work! The clipping function is unreliably wonky and images won't load. Nobody wants a cookbook without pictures! I guess I'll have to keep looking for something better for sporadic cooks like myself 😳",
        "date": "December 12, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRXlNN0Fad3dTMGdMRGF6Mjd3OXRBeWdKRy0xMlFuaEljQnhhNGQwY18xR3JqUjJfTEdqU3I4ekQtRnc4YU5sT3ZIUWpJRE10Tl9IeVRXRUE",
        "reply": null,
        "star": 3,
        "title": "My quest continues"
    },
    {
        "author": "Jeff F.",
        "comment": "So close. If I could clip from a PC on the web, or edit recipes there, it would be perfect. It's too hard to do on a phone or tablet. I can't efficiently import my favorite recipes.",
        "date": "June 18, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRl81Mmd5bUdORGhCaXRnZ2gxdWxwdlp6RnFTR0NTYkRMT0NaOTkyeEc1LWV6ckJQbm1GQVA1dDJ6YXg5MVZMTEl5aERyUDJyQnBGOFhfeGc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Deke W",
        "comment": "Had to reset my tablet and reinstalled this app and sync recovered zero recipes. Hours of work lost",
        "date": "July 11, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSHRvcUpHd2NKMjE4ai1SbXJTQmlpTHc0WGgyaVRvTUNjYm9oV19LRlU0Y2cxVURFNDFQVmszREdtZFJqRnlSajROaHdfRHV6NVVET0tLdFE",
        "reply": {
            "author": "Jakub Kinst",
            "content": "Hi! You can use the recipe clipping feature to import recipes from major recipe websites to add the recipes. You don't have to type them manually most of the time.",
            "date": "November 9, 2014"
        },
        "star": 1,
        "title": "Doesn't sync properly so lost hundreds of recipes"
    },
    {
        "author": "Flying Peanuts",
        "comment": "\"Sharing the link from the browser\" does not get the job done at all. Adding downloaded images to recipes should also be supported.",
        "date": "February 27, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSC16b2dFSEFNZE1MVkd0a1M0WGdmLXJFVVlCdWxjWGRzUUFvLXMzay1ObGx3X2Jya005Z1FzMHdaY0pMeXVTb1lXS2YxWkVfQ091OHRMTWc",
        "reply": null,
        "star": 1,
        "title": "Web-clipping doesn't work"
    },
    {
        "author": "Amerie Johnson",
        "comment": "I love this app but I hate being confined to my small android phone screen which is why I rated this 3 stars and not 5. It would be nice if this could sync with an online website, then I could use it on my tablet and PC.",
        "date": "January 12, 2018",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRnVJUG45bHkzRVlMMzB1S1FwVzJiT0ZpWmNlSEI3LW1IaGhXNU9PLWVjLUJiYm1RTmVwY293eUV6a0NVZElxNy1US0lfSFZrTXpnejBSWHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Nicholas Matulich",
        "comment": "Clipping recipes almost never works anymore. The app needs to be updated to clip popular websites.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSGI4c01JNndEZ3pZVkRhUEVxS1dzdmxaMjJVNGZQTERDS002M2RYS2hBMmZLdkZTZ09oOV9TWWxyeURfSld5NnZBSnpjVW8tbnlnYVA0dEE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Nick Serrano",
        "comment": "So far so good. I love this app for all my different recipes, the only thing I wish it had was a spot for nutrition (specifically Calories, Protein, Carbs, and Fat) and I also wouldn't mind a shopping list so when I run out of something while making one of my meals, I can just press a button next to the ingredient and it is added to a shopping list.",
        "date": "August 26, 2016",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPSHp4aEExNWZ6N29vbEVGa2s0WGl3Nk40VjdHRExGMm5QRy00UEpFN2xjdlowc0NEQ1FsSHcweDhDRDM5NDA0bXdqcUN1dnhrbXB4UlBnUXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Brian Matei",
        "comment": "Recipe apps on Android are pretty terrible, so being \"the best\" isn't really saying much. This app is less of a way to browse a website's contents and more of a way to save your own recipes from wherever you'd like (which is what I'm looking for). It does this well, but the UI still needs work. Some of the fonts are thin and hard to read, the constantly changing recipe order is annoying, and the instructions section is too dense and uniform to be able to easily read it. The web clipper also isn't very good.",
        "date": "January 16, 2016",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPR2JDZ016a3J3OXpwa2lkcWl4dDAtSzlQczNTZlEzb1lTaDBuS2k2RTB2dFFOcWxPdTA4TXJ3Q1gtM1NxZkttX1M4RzkyekNZT1RWWllJVFE",
        "reply": null,
        "star": 3,
        "title": "Best Recipe App on Android, but Still Needs Work"
    },
    {
        "author": "Sylvain Le Bourhis",
        "comment": "The app seems yo have trouble clipping recipes from websites. There needs to have a Chrome extension for Asparagus!! :)",
        "date": "January 9, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRmFQNTVpMXFWNFJFaVJYSWVPdHJDRE1JVmdNdGdDT2l6QXk5Qk9rN2ctWXV0dHdlMHNWZjBPU1ZxbWhRQ0xDdWZCMzliMHRyLThvYU1TNEE",
        "reply": null,
        "star": 4,
        "title": "Super nice UI!"
    },
    {
        "author": "Tiffany Little",
        "comment": "I love this app! I love everything about the design, it's perfect. But I'm pretty concerned about the fact that the dev is apparently MIA. I'm not sure if the sync backup works or not (don't want to test it in case it doesn't), I've heard even once you buy premium that you can still end up seeing ads, it needs some tweaking in regards to sometimes converting fractions to decimals, etc. I would gladly give the dev my money and buy premium, but I don't want to waste my money if they aren't keeping up the app.",
        "date": "June 23, 2016",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRzhTQ0FzVVpCWlNFUnFNMkdlSExqTkpaQ2JEM1NxNWc1NWFhOC1rSy1aWXR3dk54TTJBQ2toMElGYVFWMUtwUFVkbjRrTndJZkx0NEx2RVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Derek Batenhorst",
        "comment": "Good looking app to store my favorite recipes.  There are a couple things that I wished worked better. 1. The \"share from URL\" works on and off. 2. There's no export process for downloading your recipes. 3. A website portal would make it easier to enter new recipes.",
        "date": "June 2, 2015",
        "permlink": "/store/apps/details?id=cz.kinst.jakub.asparagus&reviewId=Z3A6QU9xcFRPRkRvalk1WXRrQ2hjeWpOdmRZcDRaTG9BSW9lczNwby1IVVNCUndTNWN6bWMxMFhqaWRRemtTcEl2ZW1HNnBKM2J4cTZ0TjUxVkpRa0hYZFE",
        "reply": null,
        "star": 4,
        "title": "Handy Cookbook"
    }
]