[
    {
        "author": "Derek Davies",
        "comment": "Brilliant. No longer do I need to carry a bulky wallet with me when I've got all my cards at the push of a button on my mobile. Works flawlessly providing the store has the right scanner to read the barcode. Otherwise it's a case of the till operator having to input the number manually. No big shakes though.",
        "date": "November 27, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRzhRNHhUWmpMaHpFZDNsRlVEZGxFaV95SkxXWUJ5R1dDNGZUcjJVT3dubzRqc3RGbW5pNUxFR3hyMzdJb0J3eVFhVUVCTW4xM1FZQzluZVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Glen B",
        "comment": "This is an easy app to use. It sure beats carrying around a pocket full of lolaty cards. It works well with the finger print scanner so a quick touch to unlock the phone followed by one touch to open the app and another to select the card. The only way to improve it is if it could tell you how many points you have earned on each card.",
        "date": "November 27, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRVFzM0tybzE5aU1LTS01SjRPTldDS0NiS0V2RzQxSHBwbndJR2U4dDgyMHNuM282TGJYbUpPeWlEMXBsS0FiU1plYl9hWWJESVBuTFB3bUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Perfect app! Wallets always get so full of cards and this was an amazing solution! When you choose a card, the screen automatically maxes brightness so it scans well! Has a page for store flyers! And I haven't had any problems so far! To be fair it's my first card holder app but nothing to complain about! 👌",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPSDhZakhxNnhqZGt5S1lDZ0dTOGJXeXJ0c1Z2aUdLWnQtOG5WUk11WVRaS3VMaFlWX0hPd2JTcHFweVdlT1U4TTlIR1dfWnA5UnRrVEpRSmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tim Lu",
        "comment": "The Woolworths rewards card used to not work on my Sony Xperia Z3. But everything works on my Google Pixel 2 now. I'm very happy with this app, probably one of the most useful apps. Finally able to reduce my wallet to less than 3 cards and no cash!",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPSHVNbTA5ZkVCdW5lN2F5cTl6d1JBc0dibzN6dl9hRUdDdFRKMEFzd1A4RDA3WUNVdlNGT3lWYms2aHhoYXI0bGZ2ZUdTZ3RVRWJNMEhFd2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Robert Meredith",
        "comment": "Great app for people who don't like carrying around a wallet just for membership cards (me). I have had literally zero issues in the last 12 months of use across multiple devices and versions of android. Keep up the great work!",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPR182S3M2ck5DalFKX3BxS2gxWXZsOU9BNmFPMERyZ0xMdU5VV0ZXNllsNTZfQU91SklSYnNyMm52RGtWSEhrTHdkSFdMLVBEdC1faUVtSmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "James Chapchuk",
        "comment": "Great app! Only issue is that the geolocation feature needs the ability for the user to be able to reduce the distances before it says \"there's a store near you that uses this card\". You can be quite far from a store and it still kicks in. Invariably I turn the feature off for this reason.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPSHdId0lfY3MwblpUWm4xRzRsQmZhU2JJTlZ4YVNmTE03NnZRb0lfRFpPdC1MZ3J5YnhlQlhXbE93ZHBCbm56Z0d0TkJBVDA4WFp1d250b1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Arnica Aggarwal",
        "comment": "Love it! Wish I could also see points for all these cards, but overall, I love this app as it lightens my wallet very much!  Changed the rating from 5stars to 3 stars. I used to see the offers and folders from the stores that I have cards for. However, it's been a while that I don't see the offers from my stores anymore. :( please fix the issue!",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPSHczd3Q0Vm9MdlRqTHdrOUMwU1hSeTJEbmR1UTYzZVFOWHFGR2dYcVJMRkgyeEhvWmc0RXIxMVhRekVDY09XRlhhaFRPSldEU2I4enZjYlE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Andy Birchall",
        "comment": "Really Good, I sometimes don't take my wallet out of the house now because of Android Pay and this app  means I don't loose any loyalty points. Note some stores ie M and S and Sainsbury's can't scan phone screens but this issue is the stores' equipment and not this great apps fault",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRzM1d3UtcDB0SWRDS1BPLVB3SjZlb0lzdDNPLWhKajBSdDJhbFN0XzdEb2hONHZUaTlyTEJRQmlXVENaVXBBdGNRcTRGaV8xZ3NaRWd1OUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "zeiriza12",
        "comment": "I love the app,  but I don't know if it's my phone, but the app is moving incredibly slow.  It taking forever to load and when you do get it to open,  it's loading the card you choose slowly.  And if you close it and open it again, it will stay on a white screen until you go into your phone settings and either clear cache or clear data.",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRmZSV1RhcGlvOFlfMFFBY2hVMFdmbURULWN4cUtmMWRIa3MtUVhONEtXTUVOQldMN2pkWWpnMmY2aXlZZVlpd2J1ck9UYVQ4M2xfSFI1UHc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jose Otavio Carlomagno Filho",
        "comment": "It's a great idea, but I'm having some issues with it. Tried scanning the bar code at Sainsbury's and Waitrose and it simply didn't work, but it worked fine at Tesco. Could be something wrong with the bar code reader or my phone, I'll try again at other tills and other shops...",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPSEphOWdVTHZJX00xTVBsTlBtUHNUMW1VRmRDek0zcVdrbGp1MDhsanNXenFHenhZT2lEUjF3eExteXV3SEQxbjh6ZW9rekxoMjhsSTRxZmc",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Scanning issues mostly occur due to outdated scanners used by some stores. They have difficulties reading the display of your smartphone. In the meantime you can ask the cashier to type in you number manually in these stores. Hopefully they will replace their scanners soon then and use image-based ones, which will support scanning your cards.",
            "date": "February 8, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "John Song",
        "comment": "The performance of this app is extremely slow and sluggish.  It didn't open up fast and made me embarrassed before cashiers or automatic check-out counters. Improve the performance and size of the app to make it useful than just photos. I am returning to photo collection of my cards.",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPR1p1M2ZaUnM1SFZ5ZDBob1k0RjZBMFhwQWZBem1INUQwamQ4dzNleUpvSFFlU0ZVblA2RFpJeHRUdFVvcHdCWE1IYmhVOGZBVkMwLVVFQlE",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Thanks a lot for your comment. We are already aware that our loading times have increased significantly over the last updates. In order to prevent long waiting times at the checkout point you could try to leave Stocard running in the background which should help to decrease the loading times. We are already working in improving the speed level!",
            "date": "January 30, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Venessa Way",
        "comment": "Brilliant App, not all tills will scan yet but the newer ones do and those that don't can manually enter the number. I no longer have a purse full of loyalty cards. So easy to use too, just scan the card and it's done. Brilliant",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRnVxLVJqYjVtWDlXVklNUUc4QURHRUN2Mm8zd2FzOE1ZNmo1RUs0VG9fa0VJOUZYUDkyOE1oNEYyUzlwdnVISTNxUHY4UjFQcXhUV2VJY0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Juli Sherwood",
        "comment": "Great way to free up space on my key chain! Have had trouble scanning at self check-outs, but have been able to manually enter card numbers so it's still a winner in my book.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPR3NCS1YySXFaX1ZUUWpWRmVKOXVZYVNmZ3hydWVCdEg4cnMxVkZQaDhrUTc1aTVyenFlel8zN2c3a2xXUTE0UDUtQVktQlhOaW5sbGlKZUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Barb Dalrymple",
        "comment": "I got a new phone and all apps were transferred ... but this one didn't  ... and there's no option to sign in to restore old info.  Now I'm up a creek, because I didn't keep all cards after info was loaded.  Great idea.  Poor execution.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRUdjSndVZnpZLVdrMjdFY3l3cFBONmpFOUVaTGU2ZWhUcWFrRDhWZ1F1M2Mtdi1wbnB6cWFrang2SVN4alhiS3NRUkNJS0EyRkJnVklDMlE",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Hi Barbara, there is indeed a backup option to save all your cards from your old phone and transfer them. You just enter the settings of your old device and chose the  backup and using one of the given backup options. On your new phone you can then acces to it trough the same button using the same login as on your old phone.\nsupport@stocardapp.com",
            "date": "January 22, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "andrew macdonald",
        "comment": "Great idea but stored cards don't scan on supermarket scanners. The till people say they have this problem often as something to do with the phone screens and their protective covers.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRnQ2bDJTc1R6WVFZMVpKQmxoWU85SHlDN0p0VmxCMU9UX0RVOWszdFlXaXZ0UmZKMmlrUlhrUEg2TTRGTkpKYVF4VDJ5cWQ1Z001OGd2cFE",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Hi Andrew! Unfortunately, some stores still use older scanning technologies (e.g. laser or flat bed scanners) that oftentimes have problems reading phone displays. Hopefully most stores will switch to image-based scanners in the course of their next cash system update. Until then, we apologize for the inconvenience.",
            "date": "February 15, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Jade Urbano",
        "comment": "This app has made travelling without a wallet much easier. Even if you've forgotten one of your cards, you can nust simply pull it up on your phone screen. I recommend this app 100%",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRnBERDAxNkNWd1hDZl9uTGh5cHRmRE9heG9PSklJM0dEZWw2VkpTYzVqU0ZyX3pzenByRlZsM3BhZzNoUG5BdkxBN1BDbDZQUG14dm1KTnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "What's with the maximum screen brightness when a card is selected ? The poor assistant complaining about her eyes while typing the card number in manually when it wouldn't scan at Sainsbury's. There's no need for it, the wallet app on my old Lumia didn't do this and scanned fine, most places and didn't blind the assistant.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRjdfbXUxdGFhT0IwS0xvZFVxazR6ODJrMFJNNjZPT2dDUHVsT1U4ck9GVmZPZXQtYmg1SEtPdTRjYTRRMWxGZHpOVXkyLXNGNE1wOUNkN1E",
        "reply": {
            "author": "Stocard GmbH",
            "content": "We indeed auto-adjust your screen brightness to the maximum level when a card is opened in order to make the scanning process in store as easy as possible. If you close your card properly before exiting Stocard, your screen brightness will return to its previous level. We will think about if we there is a way to make this setting optional for you.",
            "date": "February 7, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Morgan Dreze",
        "comment": "Not bad - easy to use It would be nice to have an option to choose language. My phone is set in English and I live in Belgium, so I get all the offers linked to my cards in Dutch... The problem is I don't speak Dutch...",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRVVZUExyazg2YUc3M285SGZXbUp5NHg1NlFxV0NwejZpZ3pXaHBWTUpKNnUzQklPTFloeHRtWTByZ2pkZmhkV05uWGxrRDJZdmU0ZHd4Vnc",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Hi Morgan, thank you for your feedback! Since it is not possible yet to choose the region within a country, our current settings for Belgium is to display your offers in French if your phone is set to French and to show your offers in Dutch otherwise. We'll work on a better solution for the future. In the meantime, please excuse the inconvenience.",
            "date": "January 22, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Virginia d'Alanno",
        "comment": "I like the concept and works well at POS but...  One of cards has points that are shown with a decimal point, stocard takes out the decimal and shows 200.12 as 20012. I got very excited there for a second.  Also it continues to tell me the credentials are invalid on another card, when I have triple checked that everything is correct.",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRm1nMVZzMk9wZG1TUnhRRTM5M0tKVUo2dWJpWkZ6RFhOV1NHZGJMS0hweFpMYmdaakFLeUFudjR5QjdUd0t1LXROb3lWYXJJcVVwYkxrVFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "JaneLb",
        "comment": "Had high hopes for stocard. Wanted to use my NECTAR card with this app to buy petrol but wasn't accepted. Very annoyed as I missed out on the extra points.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPR0U5NFYydXdRZk0tYV9kN1pDN1cxdFZteUVjd0dhcHhVUFA5eHd2cTZJaERnRi1kZlptZlRRUk5GSXVhYWdCb1JuQm4zQ0Zsb191d1BOdFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Nicayla Beamsley",
        "comment": "So much easier! Hated carrying extra cards incase. This app on my phone saves space & time looking for cards, plus you don't need data to use it at a shop.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPR2lQN1VOTnU4d0s2aThvLUxlUVJ4Q1J0YnR3c0ZiVnlhS0NpMHVXdUtrOGVKWk9Oel9LU3lsaW1GOWJTYURHRzVCdV9UTWtadDdJaHlNQ0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chris Hornby",
        "comment": "It looks good and is easy to use. Scanning the cards in worked 1st time every time. BUT shops can't read it. Marks and Spencer failed in 3 different stores had to get the assistant to type the number but I missed some points on other visits.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRm93cUlJaWVxNDY1V01qMWZlYVQwS3FXTEtlUmVwMG9KRFRNV0xEbjBoeS1HZmpnZk45TDhTZkZjYlZjQTgtcTczTDFfSXctOE9acVhUQVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jarred Noulton",
        "comment": "This app is incredibly convenient and helps you de-clutter your wallet/purse. Very easy to use. The notifications and catalogues can be helpful or annoying, depending on your perspective. I couldn't go back to using loyalty cards after using this! Great app.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRlJxNXZpSzZocE5zLWVTNUE3QWRMaU9wQjdEN3N2NGFSN1E5YkdtYlZ0MVB5Z0dSTEg4LTVmVjRJSGpOZGtXZWo4N3B5cEt6ZjlvUURWU1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Farzana Islam",
        "comment": "I downloaded the app day before yesterday. Went to Sainsbury's last evening. Nectar card didn't work and guess what, I discarded the actual nectar card. To my absolute dismay, I found this app very deceptive and disappointing. Going to uninstall soon.  Warning: Never be lured by the star rating of an app.",
        "date": "December 13, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPR1ZIWndCV3lOSVdPeHBkNEczZ0tESUJ0bEJLODBWY1V0MnFiWHoxTFdmb1V0V3BRRUhMcExQZ0ZBalJlZURIc2ZoOXlkTnh5RC1wUGJuaWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Gabriel Santos",
        "comment": "2 suggestions: improve automatic adjustment of card photo like Camcard does, ie, suggest user fix skew and cut borders automatically and make editing available in your web site. Much easier in PC than mobile phone. Time to input all data cumbersome without above suggestions.",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPR1AxNENlV05UYWFJYk0yTm51MUR1QjBuekoyYnlBM2dieWtzckFZR3NvWXc5aXZzc09teV9pQl9Dd0EtWU4tZDNveXlPcHBrQnN3LU1PVWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Karey Stewart",
        "comment": "I wish when you changed phones you could sign in and your cards were there so you didn't have to keep them. I had a phone stolen and have to search the house for.my old cards to add them again.  Other than that I love the app and use it on a daily basis",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPR240NVdHbEg4MTRHMTVIN1VFeS1FM1FKNFdiaWJ0YjJTUXdaT2Z4V0x1ZFRMdXE5SVl5Rmx6bHdwQnVRa1A5Qjl4dmU4emFxQ25yTmYxc3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Alejandro Servin",
        "comment": "Notifications happen only some times at the store. Most of the time I am not even close to a store, or when I am at home, at midnight I get notifications. It's annoying. I only keep it for the convenience of storing cards.",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPSGZTWHp5V2tDMWx1QlhIc1NaeS1aNDdWeGpCMzVOcWs5Rl9jNXMyOTJ5a0NibWZhdVJwZHh0X01xWGVnRm5OaVBDWlM5SmI3RTQ5cHZPOWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "This app is awesome because it has tons of loyalty programs in its database! I'd give it five stars, but that offer counter in the app is *extremely* annoying, and there's no way to turn it off. :-/",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRXRBMzRtZmx3UXh6dGgxazFDNmpQMEtiSGNJSk5XTUZQR0NGSVhaVktzenA0NHdaVUJILU9JRzdxa1lmaWpYM0pIdUVwUGMtVE5uMVVrLXc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Thanks for tous great idea ! 4 and not 5 because sometime, scanners can't read the card due to their calibration. Can you add a zooming possibility to adjust it ? T.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPSHpsVXVRcldUM0EwdFJWSVVQc1BMdlFGeFdrU3I4a3lmdUhnNk9yal9HYkg2aUZSbm94X1hqNUxvQTdJTmdKV0lHVXBOVVhfaDJ4MFZVaEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Such a brilliant idea. So far only tesco clubcard works. No good for Nectar, Co-op or Waitrose.  With one out of four working it's not much point in having the app.",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPSExTMWdXbUhCUXYyeWZqSFNzWUJJVkVIRHJ0ZHVfS1JQY1pXaWVya1Y4Zk9OY1pjeFRXZ0dBNFJFeTJTS3B5MGlPQm9DbXZUOGJPRlBXSWc",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Thank you for the comment. We are very sorry that you were not able to use Stocard in all these shops. Unfortunately it is pretty likely that they are using scanners which cannot read the barcode from your phone. Hopefully they will replace their scanners within their next cash system update.",
            "date": "January 30, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Hussein Maamo",
        "comment": "Very disappointed. The developer upgraded the app and I can't access my account.  I stored more than 10 cards and the app doesn't recognise my email and there for can't reset my password. 😓",
        "date": "December 30, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPR1g0anI4R2NYcTlmUjJ5Y1hIM21HaU9admZ5QVBoVVplNXEwaTk5WFJNNEpMeFlHQ19nWDRMY2J6ZnEwcHhqaGdnSmJObWxhYzhHTUdNaVE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Ann & Adrian Hall",
        "comment": "Sainsbury's now accepting for Nectar points so happy to update my rating to 5 stars. Not yet found any store of any brand where the tills scan the code direct off the phone. Always have to enter the code manually but that's the stores' problem not StoCard.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRmlLc2JFNm1nOGpmMEw1dzZUWVpxSHFRTWxuVF9NdFdNbk5HOGY3bkF5YnJ0ZVJlWXlDd0I3Y0hKaFlueDJMM2h6bUFvT3lieGpfXzRHQWc",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Thank you for understanding! Hopefully they will also replace their scanners really soon, so you will be able to even scan the cards!",
            "date": "January 31, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Roman Lech",
        "comment": "Great app.  The notifications (if enabled) get annoying while you drive, but that's what it's for...  To remind you.    It would make sense for the notification to pop up after it knows you were there for say 1 to 2 minutes, instead of while you drive by.",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRWdGcm9NM2xWbGMtcHNWVUNtYi14TkItVXcxazZqYlBPSWw0NlhHUmtFbmNBVkZKV25Bb090SHJyMm1hZmRRS2JZeExIb3lqT0tfZENVdXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marty Byrne",
        "comment": "Sainsbury's (nectar) are unable to scan this app. The staff were very helpful but it wouldn't work. I don't know if its their scanners but my wife finally found her Nectar card & that scanned no problem.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRTJlcGQ2U1NLOXNDV1JlSFAxX0hubmlaT29QVEZlelFmSnEzeV9oemx4US10RkdwSTJTbDBYcVR3blBaQktOQUZXOUJld3pnSWxJVjlfNlE",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Hi Marty, I'm sorry about that!\nIt seems like many Sainsbury's are still using outdated scanners whose technology has difficulties reading smartphone displays. The staff often offers to type in the customer number manually instead and most stores will replace their old scanners in the course of their next cash system update.",
            "date": "January 23, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Dave Mozzer",
        "comment": "I use this as a backup, not to replace my cards. It is inconvenient to carry all my cards all the time, so some, like library cards, can be forgotten with no resulting problems. Considering this is free, why would you not give five stars?",
        "date": "December 19, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRktDUm5ycEU0WjlvdENUYmxTekdHbk5udkx0RENScDlrVFF0NzNhUk5CeDFUTHphTkVULTJ1SnZfVlFTYUdPemh2TTlESFhJZDRlbVZ1aHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chelsea Wagner",
        "comment": "Really love the convenience of this app, but it's very frustrating when you change phones and lose all of the cards on your Stocard. This app would definitely improve with the addition of a personalized account, so no matter what, you never have to worry about losing your cards.",
        "date": "December 21, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRm9ZcmU1dHJBMWJSb2U2aXlFOFZNWnhPQUFDTXFQSUxuTU95Q29rcFFaRVQ3Z0VmVW00bU92RHViZ2xzQ3FSOERfZ0JxNVh5SFgwdFc0S0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "syldub",
        "comment": "Too bad there is not the option to force the app language. My system language is English-US, but I prefer French language in applications.",
        "date": "January 18, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRkhrclZvcmZFYXE4cW5vcVh6cmx6YTBiZ2Y2RFEzV0NqNThkNHlfYmpFVG1GY1VlYVNwT2FXbjFXSGNaZFVWOUU1R250OG50UHlVODU1emc",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Many thanks for the feedback. We constantly like to improve our app so we will keep this idea in mind. If it's applicable we will include it in one of our future updates.",
            "date": "January 19, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Scott Gilchrist",
        "comment": "Good little app, saves carrying loads of cards, would be better for me if It could have 'folders' so I can separate out work trade cards, of which I have loads, from personal every day cards. To those mentioning Sainsbury's inability to scan, I find in my local store that they can scan off of the phone using the hand scanners they have at the till. Ask them to do that, as it takes them ages to type the number in!",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPSDlRWTdmbF9TVk42UDVmMGxhVzFFWEpVMEZmMWhNdkxiQ1JTOW9oaGgySURyemRPYWFNNTZlcmIzeG1TQkJlZzV3dVdva09ad3hEV3NnYnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Helen Roberts",
        "comment": "The idea is great! Unfortunately, in my city, only Tesco can scan the code. Everywhere else can't, so I end up reading out the card number. Which is possibly less annoying than carrying around loads of cards, but certainly not what I was hoping for. I appreciate that this issue is with the retailers and not the app, but as it is such a large proportion of the shops I use, I was disappointed. Maybe an update to fix this in the future?",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRTdfeFVyelA4VDROb3JRc3JOTnk1dzEzRjg3Tld1N0FGNmZ2TTZ2aTlBdVVXTnYxOTd4YU0tRlVvWHQ5aDZsSnFZdGlDRWk1VWN6Q2U0VXc",
        "reply": {
            "author": "Stocard GmbH",
            "content": "Hi Helen, thanks for your feedback. Unfortunately, these scanning issues occur due to older laser scanners still used in some stores. We are optimistic though that most shops will update their cash systems to image-based scanners soon.",
            "date": "February 22, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Anton Sweeney",
        "comment": "Got this as a replacement for Beep'n'go but it's fairly useless. Pops up an wanted notification if I'm within 500m of a store with a loyalty card.  App's cards can't be scanned by any till I've tried them on. Frustrating.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=de.stocard.stocard&reviewId=Z3A6QU9xcFRPRnR3clFZVzZfa0dLc2x0eTVkSWhLcWtPODFZSnpocEVLTkE4NmZ5TWVXdkxuTTlqT0VSNWxhcXQ5dTl2QnN5a19BeDFtM0tMQXczWmwxcUE",
        "reply": null,
        "star": 2,
        "title": null
    }
]