[
    {
        "author": "Benjamin Jansen",
        "comment": "Good place to log a long road trip and share with others",
        "date": "September 25, 2017",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRnA2LTJMczlsS21WbW1VZ2FZX1hqdkpTS3pMWVB2U1hUSVdhRFlVdFlYWXIzeFVXY1RXQUJIZFM1ak5vV1BnQ3BhT2tNaENOSEpLOVY3bld3",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Benjamin, thank you for the review! If you ever run into problems or have questions, please don't hesitate to contact us at support@14elevendev.com and check us out online at www.mytravelerapp.com! Thanks again - Kyle",
            "date": "September 25, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Fuchs",
        "comment": "Just too expensive. $70 to track my trip is not ok, when there is a free option available (location history on Google Maps). Pass.",
        "date": "July 30, 2017",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRTlEbHBqVy11amV2MzlfVDJudXQtRld6bVdVZi1SMVRCS1lGZWFJMHlKOEZRMDRXc1EwMHg0SXpub1NlWnhTR3kxOFB2OHVxWFdBS1FVbzlR",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Mike, I wanted to follow-up and let you know we reduced all of our prices, starting at $1 and maxing out at $45 for an entire year. Hopefully this is more appealing. Please contact us at support@14elevendev.com for additional questions or comments. Thank you! Kyle",
            "date": "September 4, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Sam Brownlow",
        "comment": "Decent app but could be slightly improved. For example, it had difficulty tracking my route and pictures when I went for a boat ride, even though the gps could locate my position within other apps. Still better than the other alternatives I looked at.",
        "date": "May 18, 2017",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRTM0YTJUSUFHaktvaGc1T1Rfc1pwTmhPV3d1alVzRlBVR19RS3hxSDBUd2MzbUdIVnBRZ1RIVWhKd3pDNHEwYUs5LW8wd2lXOVFVaXFTNjFZ",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Sam, thank you for the review and your comments regarding the GPS tracking. We'll review and evaluate the accuracy and see if we can improve things. Contact us at thetravelerapp@gmail.com and we can work through it. Thanks!",
            "date": "May 18, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "John Cameron",
        "comment": "Way too expensive",
        "date": "April 16, 2017",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPR2J3ZlZzY2dKX0k0T1pSQldTZzBFRndXVzBhQVhkZGtTTl95UTV6SWVBclpmM1ZMTXZBUmFLLU9wdU5wZ1k5Wi1fdEZLd3ZQWDBtSG5pV0gw",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "John, I wanted to follow-up and let you know we reduced all of our prices, starting at $1 and maxing out at $45 for an entire year. Hopefully this is more appealing. Please contact us at support@14elevendev.com for additional questions or comments. Thank you! Kyle",
            "date": "September 4, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Hal Sandick",
        "comment": "I used this on a 4 week bike trip.  It was a great way to chronicle my trip.  And, I loved that i was able to share my \"adventures\" with my friends and family.  Developers are amazingly responsive to any issues and new ideas.  I have a few more trips plan this year and i will be using again.",
        "date": "April 3, 2017",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPSHh0eVIyMGRIN3J0QnpzazZaQjh4WFUwYmU1QmcyTTViRUd3NU1XaU9US3VXcVc3cnhDckRfYy1vQUhlQTR0TTZmSEptb0lNNXY3MmR2RHRB",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Hal, thank you for your comments and for being such a great traveler! It's been great following your journey and can't wait to see where you go next!",
            "date": "April 3, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Grant Higgins",
        "comment": "Free version. Looked good for a trial, but lost some tracks in travels through Asia due to them not saving on  then using Android back arrow/button. No way to undo or restore unles already exported to gpx/kml file. Disappointed.",
        "date": "January 14, 2017",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPR1ZOQmE2LS1naHlPamhEUWtIZTQ0a3k2NTYyc0NlTEE5VEdwWkdVYlN2THZPak9LTE5fWTRWY3Vuc2thS3VjR1NrQWY3YnVKZFBydG1uckZR",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Grant, I'm sorry to hear about your tracks. If you can contact me at thetravelerapp@gmail.com, I can check and make sure the data is gone. There's a chance it's simply unassociated with the trip.",
            "date": "November 30, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Luka Pribanić",
        "comment": "I used to give you 4 stars pending 5th, but sorry to say that with the \"buy each trip\" I'm lowering the score to 2, and also had to erase my previous review. I'm planning a new trip, but doubt that I'll be installing The Traveler for it. I know that ~1$ per day is low cost compared to the cost of the trip, ... EDIT: after lengthy email discussion gave back 4 stars. Maybe I can't be customer but can support the app&devs this way. Had to erase parts of comments as Google limits comm.size severely on phones",
        "date": "November 11, 2016",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRnJITklHdXR1dV80Uzk5cER2ajNJUWNoZzJBbUp6bV9UTGVHdGdrOUJrSGU2c1ZiMXI1VWZ1M1ctUXBZNnV0NEdrY1BoT3pFa0h6cWJUSlQw",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Luka, we are sorry to lose you as a user and for the way you now feel about the app. Implementing the \"Pass\" option per trip was the fairest, most economical option we had in order to support the hosting costs for the storage and website. I would encourage you to contact us at thetravelerapp@gmail.com to discuss how we can improve things.",
            "date": "November 10, 2016"
        },
        "star": 4,
        "title": "Edit: see bottom"
    },
    {
        "author": "Eirini Liotou",
        "comment": "I used this app to record my 3 week trip to the USA and it worked amazingly! Then I exported it in Google Earth as well, where I could literally reproduce my whole trip! Also the support from the development team was super responsive when I needed some help about the app. Congrats!",
        "date": "September 23, 2016",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPSG95eUh6TVlubmI1WUdCRFVyUXhoWXNNb0ljTHJweC1TMUxMUGhWNHhHbmJqUm1HajBjQnpidjZHSjVIQzhkVjIzSEpWMDZZSHNFdnJKTjRR",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Thank you!",
            "date": "September 27, 2016"
        },
        "star": 5,
        "title": "Amazing!"
    },
    {
        "author": "Gary Alexander Illas",
        "comment": "This app does ALL I could ever hoped for and then some.  I love it. Easy to use yet powerful and loaded with features. I use it ALL the time when I travel. Incredible support if you have questions. Well well done. Thsnk you all",
        "date": "September 16, 2016",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRVdnWklsLWFpTlE3ZGtXQ3QxRkhaSmhhLTVqTjEtc3BNX3VNakEydUd1Q0ZiQl95OVd3cHVKQlI2ZXFmQlFvbzRFZF9rNS1LUTJXenFtSFgw",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Gary - thanks for the review and for being such a great user! We're glad you are having a great time with the app and if you ever need any additional help, just let us know. Happy travels :)",
            "date": "June 17, 2015"
        },
        "star": 4,
        "title": "Outstanding! Works Great!"
    },
    {
        "author": "Nevan Bermingham",
        "comment": "This app was really excellent until the introduction of the \"pass\" payments. Brilliant for holidays and recording your paths with photos. Love the synchronisation with Google drive and Google Fit, and paths can be exported to Google Earth. It's a great Tracks replacement, but you'll need to purchase on a per trip basis to get any use real out of it, so not  as useful as it was.",
        "date": "January 25, 2017",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPSC1kQ0hNS2I4bXpzS2VWU2NoTnZFRjdzSmdTRzc1Y2I5NFpJWU5HRGtKQ1JIeW5kcHNHUmlmbW9CMXZWWTFxX09Dc0w1dlhOV1hXWjJyMXpn",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Nevan, I would love the opportunity to chat with you about the changes, if you'd give us a chance. You've been a long-time user and we value your thoughts on the app. Please contact me at thetravelerapp@gmail.com. The addition of the Pass was our way of providing the features users have requested, but it come at a cost for us as developers.",
            "date": "January 25, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Clive Brumby",
        "comment": "Find the idea good but not implemented well. A lot of functionality does not work. The website impossible to post a message for support. Seems to be a restriction in the number of trips that can be shared but nothing anywhere that states that. Impossible to attach a photo. Tracking did seem erratic with extra bits of track added for no reason. Appears to be not ready for general release.",
        "date": "July 24, 2016",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRl95RGRaTnFLdHcxcE5rbFJpSFg1M3pBUFY1UFE4b2ltOE1iOTRmT1hQYXhwMkVVeDhYTnNPOUp3cEdSTjAxc250M3dpUURDUUJ3cEhuRi1j",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Clive, I'm sorry to hear you are having problems with the app, but if you can email us at thetravelerapp@gmail.com, I'd like the opportunity to address your concerns. We're completely revamping the sharing process and the website (launch this month), which will make sharing photos much easier. Please contact us and we'll get this sorted out!",
            "date": "August 1, 2016"
        },
        "star": 2,
        "title": "Not Complete"
    },
    {
        "author": "alexnosmith",
        "comment": "I never write reviews, but I had to for this one. The developer is top notch for addressing issues, answering questions, and helping with migration issues. Not to mention that this app is quite good. Use it for your travels and you won't be disappointed.",
        "date": "March 1, 2016",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPR0dmYVZUUnRKNU13YlJwQ0hZc3pFM0xZcWVKa3REUGpNM1VTSWlyX0l3Ty1XTFlnbXdMdjJvMzEyRTl1Z1FLLV9tT2RYVmN6X2VyNkUtdElZ",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Alex, thank you for your review, it is greatly appreciated. Glad to have helped - that's what we're here for. Any time you need assistance, just email us at thetravelerap@gmail.com!.",
            "date": "March 12, 2016"
        },
        "star": 5,
        "title": "Best experience using an app"
    },
    {
        "author": "jerry yong",
        "comment": "great app! but too bad, the sketch is not support samsung note 5. if it have alternative function which not always record the path we went, just geotag the photo with note to the location then it is perfect! Great job to the whole team!",
        "date": "March 5, 2016",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRU5jSW1HcEpnRDhBNmxDMW83bUFsWUtBVnhYVllNbk1EMXlBalExU3hKVWp4cDdhbHhwVDVIZW1BVWJGb3FvTE5pS1o1d2xWdmNOV3VNVFNN",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Jerry, thank you for the review! And the sketching should work on the Note 5 - I will check into that ASAP and get that resolved. Feel free to email me at thetravelerap@gmail.com and we'll get things figured out. I'd love to chat with you about your suggestion too... Thanks again!",
            "date": "March 12, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "S K",
        "comment": "Good idea. Didn't work.",
        "date": "May 5, 2016",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRlpKajJ3Nk9wS2FJMkk5dDhiby1jbTR2V2hxZEw5WDdQcmVoZjRvWlZ2aGdOc090VGhnM3ZQbU5BWUs1ZlpWQUlTSmQ1dFRpTmJaeVhYaWFn",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Shawnna, I'm sorry the app didn't work for - could you contact me at thetravelerapp@gmail.com and I can help figure out what's going on? Want to fix this and make your experience with the app a bit better.",
            "date": "July 7, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "ILIANA INGRAM",
        "comment": "I used Tr on my last trip. It beautifully record the trip, the pictures and the notes.  Now I want to share the trip on Google maps and I have a trouble to upload the media along with the path. I do not see the snapshots on my phone it totally looks different. It said will sync on Google where and how? Haleluia on the end I gather the heng of it. I will say no less that is INCREDIBLY.  YOU NO NEED ANYTHING ELSE TO KEEP AND SHARE YOUR TRAVEL MEMORY. If you have any questions just ask me. I will make you to love it.",
        "date": "June 29, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPR3VWMFpaWjN5SGJEZVFJRFMwRWpiRTZmeTlPcFpZSi1iaHpFRlNfMWZIaHE5M1Nwd09zQ1NPeDI0bEJiR0Z6d1NNOEZRMW41NVp1d0xsTExj",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Iliana, hello again! If you are still having problems can you email me at thetravelerap@gmail.com and I will figure out what's going on with the sharing!",
            "date": "May 14, 2016"
        },
        "star": 3,
        "title": "Great idea that I can not make work."
    },
    {
        "author": "John Ellis III",
        "comment": "I would encourage the development of this app to start using the existing apps and API's from Google. The Google photos app does a great job of geo locating images and tracking them. Google My Tracks is an excellent mapping app. I think combining them is excellent idea just don't over work whats already been done!",
        "date": "October 14, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRUlLUmJ5TUV5T2I0NklnUU9VY05jc2lQblBkNU9feGQzeHZxZG9GeTY3MlgzejlEWGJQZTZMQ010eG1nMTZqZVo5MWlQWTRWUUwxWGxINHVJ",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "John, thanks for the comments. We do our best to utilize any and all publicly available APIs, unfortunately the actual apps are typically off limits. The Traveler is actually based on the open  source code version of My Tracks. Thanks again and contact us at bsuandroid@gmail.com if you have any questions.",
            "date": "October 15, 2015"
        },
        "star": 4,
        "title": "Great!"
    },
    {
        "author": "Mike Welker",
        "comment": "Installed it on my HTC M9. Added trip and hit record. All day it would say it was searching for GPS, yet somehow it could show my current location on the map. I'd hoped to save my trip and my battery. Back to Tracks.",
        "date": "September 20, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRjM2NzJ3Nl9fUjNhSV9LdndfQmcydG9aS0xQaWp3bVVMRjZSTVBBTUh3SGlOM3FDTHJyd2tTQzFtMlVESlpHX0NMSGFXZVgyS25FVXhMeDNF",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Mike - I'm sorry to hear you are having problems with the app. If you can email me at bsuandroid@gmail.com, I'd like to figure out what's going on with the app on your phone. Hope to hear from you. Thanks.",
            "date": "September 21, 2015"
        },
        "star": 1,
        "title": "Failed to record anything"
    },
    {
        "author": "Marke Weekes",
        "comment": "Used on a recent trip to Barcelona. Would rate 5 stars if I could figure how to sync from phone to tablet. Sync completed, but devices do not seem to update each other.",
        "date": "June 22, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRU1uOGJneGViYU5Zb2NMT2YyRmNyY0NkYlFNaWZFSnV4NzcyZXdha2RVTHBEZ1VBRWFhOGJ3S3RreUZHNndyTHh6QUxzNklTal9oWXFSaEhz",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Marke, Thank you for the review and for using The Traveler on your recent trip! In terms of syncing from device to device, unfortunately we don't have that capability yet. It's something we're working on, just not there yet. If you have further questions, please email me at bsuandroid@gmail.com. Thanks again!",
            "date": "July 2, 2015"
        },
        "star": 4,
        "title": "Great App."
    },
    {
        "author": "Rajesh Gupta",
        "comment": "If you could show the speed and distance on the map like in my tracks app  it would be great.",
        "date": "July 5, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRl8zclhCengxSE5lN0dFQWVFZW1nNE5QaktvU3lrdzJnclU2RTNGTEUydmctczRwcVByS3hKZUdLd3lIUVV5eXd0ZmtFOElQZHFoQ2psV2Fr",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Rajesh, thanks for the review and the suggestion! I'll add that to our request list and see if it's something we can add in a future version. If you ever run into problems or have questions, don't hesitate to email us at bsuandroid@gmail.com. Thanks again!",
            "date": "July 9, 2015"
        },
        "star": 4,
        "title": "RAJESH GUPTA"
    },
    {
        "author": "Mark Caravello",
        "comment": "Very easy to understand and use, and was great for my last trip!!!",
        "date": "September 24, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPSFktUmVmTWNuNjllVVIxRzdibTV2eUhRSVo5T09memJ6X2pjaW1DTUg3VFZjdWpzeVRMeXBORTVrTkpKTTZqTzdQc20xOWtFVTEtd19hdW80",
        "reply": null,
        "star": 5,
        "title": "Great app!"
    },
    {
        "author": "Albert Wong",
        "comment": "What is the technique to view the date and time stamps with photo, notes, and etc.  Thanks",
        "date": "June 8, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPR2JOd0UyVDNkLUprSV9BcG45UEFFajhRRHlta2U2UlZWcXUtbFhpeS1ia2NwZGNTYWpuVm9Rd2ZwNEhkQXZqdGo1UjJZTVpnY2l4U0NmMzRv",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Albert, thanks for the review! In order to view the date for a photo, just tap on the photo (or any media item) - there is a \"date added\" identifier below the title. The time is not currently displayed, but if this would be helpful for you, I can add it to the request list. If you ever need help with anything, just email us at bsuandroid@gmail.com.",
            "date": "June 9, 2015"
        },
        "star": 4,
        "title": "Very well done"
    },
    {
        "author": "David G",
        "comment": "The latest release of Traveler surely warrants a 5* rating. Accurately place (on a map) the photos you took while recording a path; but also (and this is the great part), accurately place geo-tagged photos on your map even if the photos were taken while not recording a path. The app does all that it's advertised to do; simple interface; and unlike most free apps, the developers provide fantastic service.",
        "date": "April 21, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRkNmR3p0TTcxV2F4SF8zbVdVNGY3cGZjT1BrMVdYRnNRdVN1RDEwMmN1UVV3TmRmYjRmUmRSaThCZGJfV3NrTFd0TnB3UHFIYm5CUlNwUGpN",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "David, thanks for the great review and for challenging me to revisit the exif data for the camera's photos! I'm glad things are working better now and if you ever run into any problems, please let me know. Next up - trying to pull exif data from photos taken with external cameras.",
            "date": "April 22, 2015"
        },
        "star": 5,
        "title": "David"
    },
    {
        "author": "Matteo Antoci",
        "comment": "It will be 5 stars when the sync/export (please add dropbox) will include also paths and images.",
        "date": "April 6, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRUU5YTQ4cVRabUhueHRmTHpwUFlCMDhPYkNlX0RMWVNEdXY2Y0gzRWptNGZOdDNWbVNwQndsX1dDbkIxUWZOSEVkcW1PcUpVTGZkUG9UbFVB",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Matteo, Thanks for the review and I would enjoy talking to you about this suggestion. The sync should export the paths and media to Drive (not Dropbox at the moment), so if you are having problems, please let me know. You can email me at bsuandroid@gmail.com. Have a great day!",
            "date": "April 7, 2015"
        },
        "star": 4,
        "title": "Pretty complete"
    },
    {
        "author": "Pedro Lopes",
        "comment": "EDIT: I got a fast and complete response to my email like none I ever got; author explained me the technical reasons and I tend to agree. 5 stars are not for the app itself but for the exceptional support - many paid apps could learn with him/them.",
        "date": "March 24, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRl8zRG1NRGRuMllTMmRmemNjdEo1dTNYUDFLRFc5bVhvaXpWa3hrdVZuUkQwUHRqaWdya1YtVjdUYXJQRDViLU16bmNUbmNxUXpuMlQ4VzZZ",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Pedro, I'm sorry you are concerned with the access to your google account. If you can contact me at bsuandroid@gmail.com, I'll try and explain what each permission is used for an how the app access your account. I can assure you though, the app only accesses what it needs, and with your permission.",
            "date": "March 23, 2015"
        },
        "star": 5,
        "title": "Wants too much access to your Google account."
    },
    {
        "author": "Amy - JoOriginals",
        "comment": "Had a problem any moron could have figured out,  but not me.  Got an almost immediate response,  Thx,  great app, great service.",
        "date": "March 19, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRkxpMllTV0oxR0JyazRfQUZERm5KYnpZTHNyNUQ1cXhYQkxBOGxndlF6Z1FUODVkcHVYVEh5Qkk0M3hLYlhkNFF3SG9QWHRlcWdDV1Z1S0hj",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Amy, thanks for the review! And no worries - I'm glad it was an easy fix :)",
            "date": "March 23, 2015"
        },
        "star": 5,
        "title": "Great customer service"
    },
    {
        "author": "SouthPole Cat",
        "comment": "This app is supported by a very dedicated team and has great potential to be a prime travel keeper. There are few things this app needs to become superb: 1) full sync with the cloud of choice (dropbox, onedrive, googledrive etc) that would include images and traces. 2) full automated cloud backup 3) ability to store the on external SD card (at least with lollipop). 4) Google earth export with images and travel timing.",
        "date": "February 19, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPSHVObzNtWUhVbHZmc3dRbVJuQ3lhTWFQZGNrQl9qdkZILTNGVmpUWlpSaUMxUklQMWVUTEFFWUtGcDZOR0xPLXpKc2NqOUZydE9QWmdsMy1j",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Hello - I received your email and I'll be in touch... Hopefully we can figure things out - if you were unable to make a backup from your phone prior to the upgrade, I might be able to write a custom import to load the files from Drive (it's not actually meant to work this way though). We'll see what we can do!",
            "date": "February 16, 2015"
        },
        "star": 4,
        "title": "This app has good potential, but needs some work"
    },
    {
        "author": "Richard Lyles",
        "comment": "Cannot display the save button on first title page. Very odd glitch.",
        "date": "February 15, 2015",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRko0M0FEX2J4OENGeUU3WWtocDdCcFZfc0FYZ3lkZmV2bTRGdHBFUklDeWxTVjRlWkpSSzJuRW9Gb3BFeEh2bzF6NFlsanN5bVZZRW5SWjYw",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Richard, I was able to recreate the issue you described and believe the latest update should resolve that problem. The update is version 4.0.20150407. If you are still interested in using the app, let me know if that solves the problem. You can contact me at bsuandroid@gmail.com.",
            "date": "April 9, 2015"
        },
        "star": 1,
        "title": "Glitched"
    },
    {
        "author": "Phil Martin",
        "comment": "Maybe it's me but i lost all my traveling and not clear how to use the app",
        "date": "November 20, 2014",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPR0lsYVdZSEVUUDZkQ21hTXQySTBpcmtaQ0R4ZHpkWGpHU0tGRW5iOTh5YWpTMkVDSUNhUk1HbjExaEdPYzFReS1Qcl9yUFc1LWVQeVJNMnZJ",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Phil, sorry to hear you are having problems - can you email me at bsuandroid@gmail.com and I can try to help you out?",
            "date": "November 21, 2014"
        },
        "star": 3,
        "title": "lost my travels"
    },
    {
        "author": "Samantha Hendricks",
        "comment": "This is an awesome app, it should be rated #1 for travel apps of its kind! It's beautiful, simple, and does everything I need for capturing and sharing. One tiny thing though, I wish there was a way to manually add previous paths in a trip... I forgot to start the tracker onceor twice, and now I can't go back and add them :(  other than that, it's perfect",
        "date": "June 10, 2014",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRXBBdXVXS0ZuN2JiV0VHWWZBN3JyUmtXcjJUMnpucU5MRHRPNGZYVi1neU50YTdrU2xUUmhYbDdvWXlFc0VyTkphc0NwbXJubHNURnIwN200",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Samantha - thanks for the review! I like your idea about the manual paths - email me at bsuandroid@gmail.com and let's talk further. You can import KML files into the app, but I think you might be talking about something different?",
            "date": "June 17, 2014"
        },
        "star": 4,
        "title": "Manual path add?"
    },
    {
        "author": "Marianne Siglos",
        "comment": "I like the look, clean and simple. The app is quite easy to use. However, I'd like the option of changing the date of when photos were added. Or when the photo is added from the gallery, take the meta data (I think that is what you call it) from it so the photos can be added in the order they were taken. Also, maybe have the possibility to add more than one photo at the same time.",
        "date": "July 7, 2014",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRll3aVFjTTFOcEx6YkhYTFgzN2I1bDNXTEtBd1g2VzA1MF9tcVFLUjlmVl9DZXJ2TEcyU3BvamQ2TVg5Y3VqeUYyUkF2LUhyR0NrRHQ3dGln",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Marianne, thanks for the comments and suggestions. I like the idea of editing the metadata for the media items...I'll add that to the list and see what I can do. If you have any other thoughts or questions, feel free to email me at bsuandroid@gmail.com.",
            "date": "July 9, 2014"
        },
        "star": 3,
        "title": "Possible Addition"
    },
    {
        "author": "Taurai Nenguke",
        "comment": "If you want to record continuous path over many days, use pause, then start then pause and do not restart phone (lose battery juice). You can export data as well. First do backup and restore from The Trip app. Then connect to PC and access the backup folder that eis on your phobe from the PC. Thinking of playing soccer with phone on me and record my movement. Already jogged my neighborhood with app on. From an investment perspective, it fits will with GoPro.",
        "date": "July 21, 2014",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRUR0YS1JdFRGUzJtRTJIMjNXOXFLQ0l0cnQ0bFlKMzMzTW9UU0xLUkI5eS1oaGs1aGFFNmptQ244enpVOHpWNUFkM3BLMG9vV1RHUk5UbUkw",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Taurai, thank you for the comments! I wanted to let you know the merge feature will be fixed in an upcoming release. The new version is finished, just working on the final testing to make sure its bug-free! If you have any additional questions, just let us know - bsuandroid@gmail.com.",
            "date": "July 25, 2014"
        },
        "star": 4,
        "title": "Only thing missing is functional merge feature"
    },
    {
        "author": "Florian Hendrickx",
        "comment": "Hope you open up the ability to invite others on a trip, otherwise it remains cool but not epic.  Hope you also add some kind of online viewing ability so others can follow your travels or read about them afterwards. Could replace traditional trip blogging",
        "date": "July 9, 2014",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRXNRWW5aeW1sOXlBT2kwYUNsaVRIdXlZTHlsS0Q0YjVTS0dFZWhJTmRWbzZ0R2ppMmRqa29lTW9PSXNKc3ViOXF5ZHk5SXBIY3lSODFpQUtN",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Florian, it's been a while, but wanted to let you know we're finally getting to your wish list! Check out www.mytravelerapp.com for more info! And if you ever run into problems just email us at thetravelerap@gmail.com. enjoy your travels!",
            "date": "May 14, 2016"
        },
        "star": 4,
        "title": "Cool app! lots of potential"
    },
    {
        "author": "Chinmay Badhe",
        "comment": "A nice app for recording a trip... Please advise for importing multiple pics because I have more than 1000 pics per trip.. The presentation of a trip can be improved. .",
        "date": "March 18, 2014",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPR3JuUVZ5YXlPYks5czkwWTVxVWhHZ1Byb09tMHdSNDJMbEtLSHBMcm92QnpfUEpsTEFCSzFxbTJZM0xPZzNWODlhRjBFMW4xcUIwcXNsTHRn",
        "reply": null,
        "star": 4,
        "title": "A good app with a lot of potential"
    },
    {
        "author": "Terry T",
        "comment": "I used this app for a couple of test trips. It does record your trips your videos and your photos, however on the other end it is not very polished for viewing or reliving your trip. It does allow you to export only the path to Google Maps but not the entire trip.  the photos and videos and other notes do not export.  I wish there was a more polished website based accounts so that trips could be viewed with pictures and media in an entertaining complete format . As it is now it is simply just a recorder.",
        "date": "December 14, 2013",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRkh5R1NTY1Rqdjd2WVZGR0daSEtjZGdFekhneHNoQ0xVd0NCZFVtV2JIUUJ6RERHNFpaTnZ5N2J3ajNYcXlHanZ1ZmlqOUZreXpmblBxYXhR",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Terry, thank you for downloading Traveler. We are working on a web portal for the trip info, but nothing to share at the moment. Biggest hurdle is determining whether this is something that can be offered as part of the free app, or an in-app purchase. In the meantime, if you have any problems or questions, please email us at bsuandroid@gmail.com.",
            "date": "December 31, 2013"
        },
        "star": 2,
        "title": "Its okay"
    },
    {
        "author": "Chelsea Jackson",
        "comment": "It tracks everywhere and works seamlessly with the geotagging on my photos to generate more maps.  Love it!   How can I move the app to my SD card though? It is filling up my limited memory with all the photos I'm taking on my s4",
        "date": "November 30, 2013",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPSGdPYXJIaGhvSkJuNmd6YWN6VWFGYjFET2dFS3p3Q3FCbjA0cURDMlh4ODRJS1lhYTRVNnptLXp6Z3NoSnhrTW1vY1BKTHZQaUdRdVZTWl9z",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Chelsea, thanks for the review! At this time, the app does not support moving to the SD card, but I'll add that to the request list and see if is something we can add in a later release. Happy travels!",
            "date": "December 31, 2013"
        },
        "star": 5,
        "title": "Fantastic"
    },
    {
        "author": "Christopher Dabbs",
        "comment": "Recently used this to log my endeavors in England, and its been great. The GPS tracking works great and I'm able to follow every place I've been. The only issue is that I can't merge any paths at all. And unless I'm missing something, adding photos to a path is a bit tedious because it has to be done individually per photo. It would be nice to have the option to add multiple photos at once. Hopefully these can be fixed soon. Thanks for the effort and the awesome app!!",
        "date": "November 12, 2013",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPSF9LaTNTTEpnUUllZkY3Nk1QZVRTTGh0MndzeHh6NkxZRGNVVTlKQzdfbWdtZGVNeFBhdU1FYjBWT0l0ek41Z0QzNHlfZmhXbDBpOXV2VXlF",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Christopher, thank you for the comments and the review! And it sounds like you had a great trip :) If you want to email me at bsuandroid@gmail.com, I'll help you with the merge paths issue.  And thanks for the suggestion on adding multiple photos at once - I'll work on some ideas and see what I can do.",
            "date": "November 13, 2013"
        },
        "star": 4,
        "title": "Great app!"
    },
    {
        "author": "",
        "comment": "One of the most used apps in my tablet. Although I cannot make the merge path option work. It would also be better if a photo used for a cover (i.e. path image) would not duplicated (i.e. just create a path to the original image). Also I might just be ignorant about this, but is there a wayof seeing the travels online? These are just minor quibbles. I really reallylike this app",
        "date": "September 5, 2013",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRXlmcmYxcERJdWVzZkRZMS1nTkh4aTBjamV3cU8wNTVrT1FBbUtaa3owazUxakstVWp1bXdiQi1SSjdWSzdOR2hSTzNYdGRmM1NVVmNJbVJj",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Noel, thank you for the comments and review! For the duplicates in the photo list, I have a fix for the next release. And I'll see if I can replicate any issues with the merge path. As far as online viewing, you can to a degree - you can upload paths to Google Maps (check the help guide). Email me at bsuandroid@gmail.com and I can explain more.",
            "date": "September 13, 2013"
        },
        "star": 5,
        "title": "Very good."
    },
    {
        "author": "Navil Heggere",
        "comment": "I love this app. It's nice, uncluttered,  and making road trip journals is a breeze. Only wish I could move the app to my external SD card and run it from there rather than just backing up to the external SD card.",
        "date": "October 13, 2013",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPR2Y2RnlZM3QzWjg3UnlZQnhSRlg1NnlSX0UyN2xNNVBUbjIyNGtzaG1ldTVuNzFiNGJybEl4cnBHamU0Y09zM08yTFFvMXQ0QUN4QVE5ckNZ",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Navil, thank you for the comments!  I'll add your suggestion to the \"wish list\" and see if it is something I can incorporate into future versions of Traveler.  If you run into any issues or have questions, just email me at bsuandroid@gmail.com.  Thanks again!",
            "date": "October 14, 2013"
        },
        "star": 4,
        "title": "Awesome but for one thing. .."
    },
    {
        "author": "Joost",
        "comment": "Was looking for an android equivalent to trackmytour. So far, the only feature I miss is to create a trip manually afterward: I was on this fantastic roadtrip through Canada and have lots of notes and foto's, but didnt have this app yet... Would be nice if I could stil re-create it.",
        "date": "September 18, 2013",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPRUNpVlFIc29DWElwcnRZeHRXeXJQdTMtZWJlWGIyUC04REVoeDlOUG1Xd2YzUTNpbE5HMGM3UHNCUkxZUmVmUzVEdkMwUXAtMm9GakdWU3pZ",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Joost, thanks for the comments and for checking out the app! If you email me at bsuandroid@gmail.com, I can help you out setting up a trip after the fact. Basically you can create a KML file using Google Maps, import it into Traveler and you are all set. But email me and I can give you more info!",
            "date": "September 20, 2013"
        },
        "star": 4,
        "title": "Pretty good"
    },
    {
        "author": "Maryanne Nemer",
        "comment": "I downloaded this app a month ago mainly out of excitement for my upcoming trip however it wont even let me upload a photo from the gallery.  I even uninstalled and reinstalled. I tried ten different photos to upload none of which worked.  :-(  I really want to use this app!",
        "date": "August 24, 2013",
        "permlink": "/store/apps/details?id=edu.bsu.android.apps.traveler&reviewId=Z3A6QU9xcFRPR2JWcUZqTnhwWXdVWGh5NjRZOXRxNXZTT1k5U18zOHZyZGwtVklwbWdBME9nYmkydHJHMV9Ob0s5dGFDNUpsdDFTczNmdjlZUWRuV2t0eUVF",
        "reply": {
            "author": "14Eleven Development LLC",
            "content": "Maryanne, sorry to hear about the photo problems you are encountering with the app. If you can email me at bsuandroid@gmail.com, I'll help you figure out what's going on.",
            "date": "August 26, 2013"
        },
        "star": 2,
        "title": "Disappointed"
    }
]