[
    {
        "author": "Joanna Gabrysiak",
        "comment": "I appreciate your different approach with creating the whole diet plan with recipes, but I think you should enable users to make some changes to it (considering all sorts of allergies and vegetarian/pescetarian/vegan diets)",
        "date": "December 25, 2016",
        "permlink": "/store/apps/details?id=eu.stettiner.dietwatch&reviewId=Z3A6QU9xcFRPRy1DX19uMlFmcE42Si1Qd0VsTWdUSVg1b2tZbmJzbURMRTFuS19ma0gxa0tPUy1JTThUdTMzR0U2NGpuOHVwRTI4SGl4M1d4aDB2bTFPN2N3",
        "reply": {
            "author": "STETTINER",
            "content": "Thank you for your valuable Feedback Asia :) Will consider your idea, when updating the app.",
            "date": "December 27, 2016"
        },
        "star": 3,
        "title": "Almost like it"
    },
    {
        "author": "Dani",
        "comment": "Why can't I type what I ate. All it let's you do is check off some diet list.please fix it",
        "date": "September 26, 2016",
        "permlink": "/store/apps/details?id=eu.stettiner.dietwatch&reviewId=Z3A6QU9xcFRPRnBSVFhleXB2ODFwLTRiX18zYk80TERuMmJlc0NXem92RTNONkEwaDBWeW9sTUlTY3dmTG01T2VQRUJhaHhsa1p4VzlJX0xMYU41Y3pwLXNn",
        "reply": {
            "author": "STETTINER",
            "content": "Hey Dani. Thank you for your valuable feedback. That was our idea - to calculate a perfectly suit diet for you. You just have to follow it to succeed. Adding additional meals (not listed in our diet plan) is possible via manual calories adding. PS We took completely opposite approach than MyFitnesspal - for example.",
            "date": "September 27, 2016"
        },
        "star": 2,
        "title": "What?"
    },
    {
        "author": "Samantha Parker",
        "comment": "I can't type in what I REALLY ate. I love the suggestions but I'm not about to go out and buy all the food the watch suggest as soon as I download it. :/ The ability to customize would be great. Stream line beautiful interface though. No imperial system, only metric. If we wana get really crazy macros would be a great addition as well.",
        "date": "March 4, 2016",
        "permlink": "/store/apps/details?id=eu.stettiner.dietwatch&reviewId=Z3A6QU9xcFRPRUNBNjk4SHQ0aVZLTVNUekJxNnhXc3ZVN0UwVENRRkR2M1hvbXJTUkV0dm5pbHFWRjBfbGdQM3hMdWliN0h3ZDcxclNhckY3YXBTN29zUmlN",
        "reply": {
            "author": "STETTINER",
            "content": "Hey Samantha. Thank you for your feedback. We have decided on different approach - than existing apps, when you enter what you eat. It requires a lot of effort (buy, prepare the food), but on the other hand it can generate better results (well balanced diet). We are developing the app, so the real dietitians (&patients) can use it. Stay tuned :)!",
            "date": "March 7, 2016"
        },
        "star": 3,
        "title": "So close to being awesome :/"
    },
    {
        "author": "Ian Bowers",
        "comment": "As others have commented, imperial units would be great. But it sounds like you're already on top of that. There's no way for me to easily see what my daily calorie threshold is after its been calculated.  Aside from adding up all the meal totals or extrapolating from something else.  For me, I would like to set a threshold and jusy track calories conaumed manually. Ideally I'd like to sync with MyFitnessPal and use this app as a dashboard.  I'd even do a one time payment for just that functionality.",
        "date": "October 16, 2015",
        "permlink": "/store/apps/details?id=eu.stettiner.dietwatch&reviewId=Z3A6QU9xcFRPRW5XTG9tWlo1Tnl2OTJBRXBMT013cWFPdjlZWWxuc1ExTlFQd1hkR0FweG5mWVNrdV8zSTczTk4tRVZnR2huVVFPVDAzV19Halk2Qnh5cXhj",
        "reply": {
            "author": "STETTINER",
            "content": "Thank you Ian for detailed review. Yes, imperial units are on our to-do list, so we are aware of that. During beta we will be uploading some updates, one of them including a dashboard, so you can track your calories needs and expenditure, your weight goal, and more, so it's a matter of time. A feature for adding calories manually will come too.",
            "date": "October 16, 2015"
        },
        "star": 4,
        "title": "Pretty good start!"
    },
    {
        "author": "Simon Kinder",
        "comment": "Pointless free version with no features. Lunch at 11am??? Really. Constant spam on moto 360 to use watch face, flattened my battery in hours. Don't waste the download.",
        "date": "October 16, 2015",
        "permlink": "/store/apps/details?id=eu.stettiner.dietwatch&reviewId=Z3A6QU9xcFRPRkd5VVJreFhsXzJPbXpHd0RnZ3dtSC1ZZ2JfdFQ5X2JhOTRIR3cyWTVXZnVzUm1ZbjM4emZkb1d1VGxidWNhUzh5OUZ1LWVNV1k1eHlZNG9Z",
        "reply": {
            "author": "STETTINER",
            "content": "Hi Simon. Free version gives you watchface with steps counter, calories burned, hydration control and meal time reminders that are calculated due to your sleeping time, so you were eating in appropriate times. I don't understand the spam issue, could you tell me more on G+ community or via email: dietwatchapp@gmail.com? Thank you for your feedback!",
            "date": "November 7, 2015"
        },
        "star": 1,
        "title": "Featureless"
    },
    {
        "author": "Mohammed Shafi Musthafa Ali",
        "comment": "It showing Dinner time when I was in afternoon 😐 please fix this issue. Add manual time settings",
        "date": "October 15, 2015",
        "permlink": "/store/apps/details?id=eu.stettiner.dietwatch&reviewId=Z3A6QU9xcFRPRnA2blZ4dDdKODJHRWRCMG5RSGFSYTlVd2pWWVp0M3BnMWZ3bHliQU82N3k2THR2M1lpdHRodDlKcHNEdzMzeXBqVVpQTHFJX2tBMDByVFVZ",
        "reply": {
            "author": "STETTINER",
            "content": "Hi, Diet Watch's key ideology is to adjust your habits to be the healthiest possible, so we calculate meal times due to your personal settings of sleep time which you can set up in \"user settings\" section. Check them out if you didn't before. Also we'll consider manual times, as you proposed. Thank you for one of the first reviews :) Enjoy!",
            "date": "October 15, 2015"
        },
        "star": 3,
        "title": "Need some more improvements"
    },
    {
        "author": "Jeremy Jett",
        "comment": "Need to have the ability to do ft for height and pounds instead of kg.",
        "date": "October 15, 2015",
        "permlink": "/store/apps/details?id=eu.stettiner.dietwatch&reviewId=Z3A6QU9xcFRPR1BFMUlCWE1ZZ1dDUlBYZmdGMGhsbGNmQ2tJVDF3U2ZNSEVMdEFUN3lVb1dDaEdkOElqRjRjVzljd2J1RVdtYlNPdnFrMUFKV0RUdVNsV25z",
        "reply": {
            "author": "STETTINER",
            "content": "Hi Jeremy, please remember, that Diet Watch is in open beta stage, we will be adding more and more features including units in future updates. Thank you, we appreciate your feedback!",
            "date": "October 15, 2015"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Whitney DuBois",
        "comment": "I like the app so far, however, it would be beneficial to be able to manually set meal times as different people have different needs outside of the times the app recommends. If manual meal times were an option the app would definitely be 5 stars as it's intuitive and attractive. The automatic meal times though really lowers the usefulness of the app for me.",
        "date": "October 30, 2015",
        "permlink": "/store/apps/details?id=eu.stettiner.dietwatch&reviewId=Z3A6QU9xcFRPRXVCamJFd3laam1BS2YxNnNaUVplQWRPUC1VNjIyaXdEdGxOYjNIV3h4bjRFSVJ4NTdraENOWjBEdmhrei00ODRhLUxHMnNPVHkwRF9uMWhJ",
        "reply": {
            "author": "STETTINER",
            "content": "Hello Whitney :) We are already working on this, so expect this feature in future updates. Thank you for your feedback.",
            "date": "October 31, 2015"
        },
        "star": 3,
        "title": "Good, but missing functions that are important to me."
    }
]