[
    {
        "author": "David pundt",
        "comment": "Would be much better if you didn't have to stop your yoga routine to hit  a button to record that pose. Or timed exercises where you have to stop hit the button just to record that 30 or 60 sec movement.... Didnt fix the issue till have to stop to push a button will stay with my other BETTER workout app",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRkhRNVNoblVCNUpjLW5rVU9kbTNOME9LbnF0SHVUOTlmcWVJazhRT3VzNmh3VktScW9zTVVKTE9EbU5BUXg1RjBtblI4cWxySnBCMk1qUkdV",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hello David, we appreciate your support and usage of the JEFIT app. Usually for cardio exercises, we do recommend interval timer for efficient tracking of logs however if you have log issues or any sort, please do email us at support@jefit.com and we would be happy to look into this for you. Thank you!",
            "date": "February 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "chris orme",
        "comment": "I've used it for years,  it's phenomenal.  No b.s. push notifications. Try it for a month if you can't find routines or build your own isn't working hit the uninstall.  Music apps play in the background and don't affect timer chimes.  Examples of movement, tap to adjust weight and reps on the fly.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPR2ROdnd5amMydm1fdlJYa2xmclBSbDhVS2FSTVZFVVBmeWZnWDhkSGpfelZQTGRueE9tcGNkcFNMRWFoRjhTU0lVXzB1amw2d1NCdERhYlg4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "D Te",
        "comment": "Why does a fitness app need to access my contacts? In response to the developers reply:  When I deny the app permission to my contacts, installation will not continue. Why can't I opt out when asked for access to my contacts?",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPR1c1Y1dPNFBwMXp4cVlzclZ1Rk9LS3J2N2UzV2d2OUE0M2dUeERyT1JiNTM2Q0tWRVhIMmFWZGhQVWZkWHVQZXcwdlpYdF9DaXIyREQ4MVdZ",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hello, we have a feature that you could invite your friends via email, contacts, or social media thus the reason why the app requires the access to your contacts. You could easily opt out of it though. Thank you!",
            "date": "February 9, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Quentin Dechauffour",
        "comment": "Hey guys, great great app! One bug is a bit annoying: when you share a session without reception, the share is lost and you can't re-share after. Can you please make it so that you can re-share the session or so that the app keeps the session in memory to share later? Thanks!",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRXZXMXEyWWpEaXpnLU9vOWRncl9lb21LdWtvdFU0ZWkyeDUxMTl6QkNmSmxrZF9XNWJkbFhEdkU5aHFnSE5JNXNsRHB5N2ZfOU9kUUJIeFM0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jay Nos",
        "comment": "One of the greatest apps to ever be made. Absolutly step by step you can't find a better app. Great on saving time and money! App shows you diagrams on how to perform each exercise. Alot of time and effort went I to this app and it's all for free which is the best part! Amazing!",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRWxfS3dZTmU3cmdIQnVUc2ExQno2OWhRZURUM2FHclFLd0VFMFhvaVQwTmFTTGlMWm1VZHpVajFJdHVTOW5reERfaXVRMlJjVGk3UFNVR20w",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kevin Jager",
        "comment": "Considering the fact most of the items on this app are free it's pretty damn good. The interface is a little bit clunky and it lacks the ability to search for specific workout exercises such as crunches. you have to scroll through with hundreds of exercises to find what you want and sometimes they're not easily labelled. Small issues though I've been using this program for years now and it's excellent",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPSHlqRWdwRFV3N3BZanZnTzdGLVZMekZhanVUSWdkVUJfNHZMOTd0QjhXVmRBNUNXQWlFNFhnZEdVNnVGXzJiVC1UcHVuakw4bG1OWW4xbDdv",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hello Kevin, thank you for your kind words. Even with very limited manpower, we make sure that our app stands out and have the best features our members can enjoy. Should you have other issues and concerns, feel free to contact us back anytime. Cheers!",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Isaac Scarisbrick",
        "comment": "Brilliant, came here from another app as converted from aerobic exercises to bulking weights and really enjoy the experience so far. Only criticism is maybe containing alternate exercises in workouts? This is due to long queues often forming for machines in many gyms thus breaking the workout up into rests that are too long. Other than that, outstanding.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRlN2Z2o5MDN1djR0ZEw0UkV6YThwS2ZxMjZzZy1sWTExaTNxa3JXUzZzTy1DSVkzVjhJU2tIVkt2Z3JrUjBxVTJ1OExUSzhTcVZneU5Ib1NZ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Matt J",
        "comment": "Great way to get started at the gym! Could be made better using vocal cues to tell you what's next. I get tired of taking my phone out after every set. But I'm really feeling the burn!",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRzFUNllwT2p6SjJJS1VKNm9HZ1VUUE5DclVvMV9DYWRUNlZSMWhVdzM0MURoWTY2YUJvMXZOcmxDUWRxWHJPS1NDN01UR0ZpcFNLZXNTS1Nv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jesse Newberry",
        "comment": "The Jefit support team is very responsive. When I was having trouble understanding a portion of the app they stayed right on top of email support with near immediate replies. Not only did they describe step-by-step what I needed to do but they included screenshots.  Customer service is highly important and this team understands the value of promptly assisting troubled clients. Two thumbs up for support.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRmxLY2pKckkxVmNjbzcxdThfWm9RS0JJTjFzd2hHRE5ZSF9oUFNCQ2lwWm8wd3FIVEhnQ0s1UXQwdjZSTFU0aU5oWkZsZWpRS0l6MXNZaXJZ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jaeger Amzallag",
        "comment": "Seriously perfect other than the countdown alarm. PLEASE LET US CHANGE THE VOLUME OR TONE. When you have headphones in it murders my ears and i cant always feel vibrate.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPSHpNeVppMTdLc2lxTUlLTkJNUDhQRmlzQzFrRzJ3YTJzYWpqaU5kWm52Vi1kSWNNSFN6UVUxa0ZiaDdMbS1TM05Ud2F0TkdCZXFUY05OTnFr",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "tosan toosan",
        "comment": "Annoying that you can't move exercises up an down. Like in different order. If so 5 stars",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRWUwMzRyTW04NXhPUjM5WndUbGZPZjN0STkyZzRrdkxCZHVHUmliM3psSmZIQ0hIV2JLSG40UW1kSGo4VWk0dTZTclFZOGQydE8taktyYkdR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Chintografy",
        "comment": "Excellent app .. but a small bug.. even though I changed my unit system to metric.. in the timeline it is still showing US units in my goals and updates.. so my 80kg weight is showing as 80lbs.. also in googlefit .. its syncing my goals as my current stats.. its persistent ..",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRW5pUHgwM19iMEpFOWtrZ1VOTlV0eDdZUTI0U24xaWRWV21xOVJvdUlUMUFIck5MNlI5NGt1QmxpWFN5eWNxWlRsMzVZaGVtVDVqZkt2ekUw",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Michael urioste",
        "comment": "great easy to use app that has a break timer, great programs, and great data for afterwords. also let's you keep track with pics, and gets rid of pesky workout logs you carry around the gym",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPSFdBQXB5Rk84c1lGLWJxcGlSSkxjbmV6OXdKeE5MaVpUZDZoNGpxTWZPTy1UVld3YVMzZFZKY3NvbmNYS2xFOEhackx6RUpzRjlGVEdzQndB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Shafique Ahmed",
        "comment": "Glad to see jefit have listened to our feedback for Androidwear support and even though it's the first release I hope they keep the updates coming and sort the issue of having to keep the phone screen on. Other than that great work",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRk1WM3FsazRMZ0hXVVF4MjJtMzdnWTR2cVlWbklqNmhZZlRjVE5ISmNHN1pQSjFQeGV1eEJydDZ3SFNqVTE0Q3JyYTd4U0dsWTNxVWZ0Qm00",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hi Shafique, we appreciate your support and usage of the JEFIT app. And thank you for your patience as our developers continue their work for a finer functionality of the Android wear support. We'll be best on the lookout for the coming updates. Thank you again and more power!",
            "date": "September 29, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Shannon Street",
        "comment": "Would be nice to have some detailed pilates and/or yoga workouts in the app in a separate exercise section. I see that there are some mixed in with different body parts, but being able to sort for just those exercises is needed.  Also, I think it would be so beneficial to include some body-only cardio exercises.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPR3EwV1Y2ZDRBc0Y2blRQdnZtQWJwdmx5SW1pTnBCWlNfQnZWc0RTOGEzVzdWcWRJcjRlNU0xQ3gzbWdqMFBDYksxbHlZbzN0bmExTmUtcFNV",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hello Shannon, we appreciate your support and usage of the JEFIT app. Indeed, we can't agree more. The app is foolproof and very easy to use. Thanks for sending in your suggestions, we will look at it closely. Cheers!",
            "date": "January 14, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Patrick McCaffrey",
        "comment": "I thought it was great for the first six months, paid for the elite status. But cancelled this morning. I'm not going to pay for an app that has erroneous reporting, and a technical support staff who seems too disinterested in helping fix a service that I'm paying for. Coupled with the fact that I am penalized for not using real time logging and don't get my points. I would use real time logging, but after spending time on a routine and then noticing that it has disappeared when I go to log my workout live, I then have to use another app that I can count on with a staff that cares about their customers. It's a shame too, JEFIT would have been a 5star review, but the technical problems and treatment from staff just make this a waste of time.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRXF2d3BhSFhxWnJDN3RFWU1Cc3Y1UTlENXBHT0pxeldEZUltbkF5SFZzYmhaeUlRU0U1Y0ZlZEpFc1gzbFdpSTRQWXdpS0JpYl9GejlXcjhv",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hello Patrick, we understand where you're coming from & we apologize for any issues you're experiencing with the app. With very limited manpower, we make sure to look into the issues reported to us and work on a quick resolution but since there isn't enough staff, resolution to issues may take ample time. Thanks for trying out the app. More power!",
            "date": "February 18, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "A C",
        "comment": "One of the best designed fitness apps out there. not spammy with ads and it does an exceptional job at telling you how much time you waste so you get out of the gym on time. Favorite by far of all the ones I've tried",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPR2YtOU9YUUhXbVRuejhYbkV6M1I3R2FlVFFsMnljWGNJX2QwQjJSWW1KaWUwZ00ySkxNTkxHYnZrNUJDb2RjZ0JxVlFTVzNITUY4VWxPdDRB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "ysrachid",
        "comment": "This app is amazing. Downloaded maybe 15 other apps like this and none can compare to this app. Alot of time and effort went into making this app and thank you for offering it to us for free!",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPSE5oTDZYSDhMczR2ZHc1am9NR0k3eFlqQjAzUFlhc19QcUNqdkZtcmdoeDhiakZiM1pkMG5uSmFVMm1KU1M0LXF3T29ZSlcyWmV0TkxPSnBB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chris Bastow",
        "comment": "Great app much easier than a log book, timer between reps beeps thru headphones which have is very helpful.  Take the few min to set up your work out. Very easy to set up n use. Just what I was looking for!",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRXhyNEF0MEtIeEx3M2VqdzR4SW04R0tYUlRJLWNmekJ0OWd0RkdidzdEUHdCbDcwSnVkd2FnQ1VXbDhrQTctb29TejRTQS1tZkpvRXFpVERV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Dara Thomas",
        "comment": "This app is great!  It really helps to motivate you and to push yourself to do better than your last workout. You can change it up whenever you want and there's tons of exercises to pick from or you can create your own.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRlJsWlBLaWZrWENGT0VVZlJOSzRSdTFLNDNXUmhwQTRyVGw2RWlNWV8xbHV2NmhzbkVBUUFjV3NzMjFoZTJhZ3V5aUhFaHFEVzNTeFNLRDZR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "The Zig",
        "comment": "I never work out without it. It tracks your progress and records the lbs and reps that you lifted previously. Also a great library of exercises to add to your workout.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRVBDT3FTMFQySjJGZmhtRXljcnF4S2REUnZZYUQ5MGpxTzRNV0hQX2kwNGxXVzB0Q3ZCMmh0ZnJVdURDSVoxYURiakJqTE9wTFBMMkZXNENj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Joe Sobczak",
        "comment": "I've used this app for years. I have watched it evolve to what it is today, and I am impressed with its progress. However, lately, I've been using the app Personal Training Coach because it automatically implements adding the weight to my workouts, or decreasing depending on my progress. If Jefit had something like this, I would easily come back to this app, because it has a much better looking interface, and more user friendly.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRzdYZTQxbklSYWpnLWcxdXZUS0tMTGtqb19LVjlOYmdYd0djMWozTFBUWnlGWkMzLXFOYmhzUVhQREY0YkcwWDhlWUJDRlI1SDV0OGJaVERj",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dustin Lanier",
        "comment": "Ive been out of gym for about 1 1/2 years. Was struggling to find motivation with work schedule and life. This app has lined what im doing on what day. Logging my reps inbetween reps on this app kerps me disciplined not to waste time in gym. Easy to use. This app carrys the liad for you. Just pick em up and put em down. And a good diet never hurts too. Lol",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRXkwdnBLb0phZHhTcjRDX1JiWE5WZ0o1dG5iQU1aZGRMSEtKZGFISU9NRm53WDY3dXdKQ0pEaHFhNVNjbk0yWmczUVBFbk5ua2tSRHJjQVVJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nino Bustillos",
        "comment": "Sep-2016  I've been using this app for quite a while now and have reduced the need to manually track workouts. I used other application such as endomondo for running and biking and would love to see integrations between these two apps so that i can log my run/bike on endomondo with gps data to this application.  -- Feb-2018 Still no integration between other app and even Google fit. Hard to aggregate data of your workout unfortunately.",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRWJMdFNKREhmcjVLZENtTEZLMFBhNmRxRk9vaElKbWQyR3JvU21RNkJVRDBoMnF6RUc5ZVlyOUs3T2FWM2lma0V3VlZhbklzelktbElzcFln",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hi Nino, we appreciate your support and usage of the JEFIT app. In regard to your suggestion, we're currently developing few features and improvements so integration to third party apps may be delayed at the moment. As we continue to work in progress, we would truly appreciate your patience. Cheers!",
            "date": "September 19, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Andy Cowie",
        "comment": "Great app which I have been using for a couple of years now. The only thing missing which would be great is being able to share workouts from the app. I can only seem to do this from the web browser. Please add that 🙏",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPSGR6T3NMNzRWNWV4cEhTTGRYMzczQk9JWVJYTTFpTHNCWlM1QWI0NmJxbFBVZ2UxY2V1VHJPbXc0ZkM0SHVpNm9tVUpNQ0pVenVIWGM0NG44",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dalton Betts",
        "comment": "I love the app. I just wished that you could select between kg and lbs while inputting your sets instead of having it in the settings. The gym I workout at has plates in kg and dumbbells and machines in lbs. I also wished that you could have modify and workout with different rep ranges (ie 1 set for 20 reps, 1 set for 15 reps.....etc).",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPR0txQW5jZEI2ancwdFFsVDFfOURrNkFGNlhRTm02b1R6b3hYdldWSl9nWUNPMTFKQ1RkQ2JiMWM5NG9mZ1piYU45WGtZWnE4Rml3ZXpDbkQ4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kevin Hansonoda",
        "comment": "So far so good. I have been using this app for a week and I like it. It's be nice to set defaults of rep/weight adjustment while inside of the workout, instead of before it starts. Perhaps a \"save default\" check box while you're selecting your reps and weight for that exercise.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRV9maFV0aHgzeXllVUZRdDhBMW51TGNRTllWUm1ac1R4cDg1Ny1QV2h5UTlkT3FFM2pvVGRYemQtQWM4VXpZNG8xdTFPcmxSa0h2bEhIWndR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Daryl Beman",
        "comment": "Have enjoyed this app for a few years. Best weight lifting app to keep track of your records and has probably the most exhaustive list of exercises that you can find in an app. I'd love to see this app integrated with the latest fitness trackers in some form sometime in the future.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPR0xjakVuZkZWSDZQbHJmZzhpaHlFVmR6Tk15WGZKd0tBZTc4N2lYeWlrbEVwVFoyenlreF9oSXJwbjFTaWFxV1o1c0YzV2Q1djhOcFBORWpn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lennit Els",
        "comment": "Works well to track my training. But would be great if I could use it via my Gear 3 and could sync with Samsung Health data.   EDIT:If you are developing this function, I would like to be apart of the beta test program.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRmsxOWo0X1BleFpCYjA0Z1FuM2ZUNHE0VEluZkxQVmFkNFdCOU5WQTFmcE80NXAzbC1DcXJabDJ1VHdzc1g0WkxnS3daVTFmXzBsNGwzTFdJ",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hello, Thanks for your feedback. Our developers are now working on adding this version. As we continue to work in progress we would highly appreciate your patience on this matter.",
            "date": "September 26, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Liam Esterly",
        "comment": "It's free and has everything I need, the user interface can be a little confusing at times but only when you aren't familiar with the app yet.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRWVza05NdFZRR0ZKUkF6cFNDcU1aYmpCaTNzYlltQkJEd3VPXzU3UVJ2QVozdElmMUVVQTRoc1NFMjFMMEZjRENEVHJzNmkzZmZPU1pGR0VV",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "james lewis",
        "comment": "Great way to keep the motivation level at an all-time high for working out. Love seeing how much weight I lift every day. Earning points towards Elite membership by lifting every day and posting is just a bonus!!",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPSGZKa0RwdnhZSm90aGtITVMtV0JjVXlENXRrMV9PMlZZU0NCbUVHc29oeHlVLXhEWUtHREtkRF82cVFUenJqa1hpOUl2N3NjUUdXSURwV1Uw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Daniel DNL Computers",
        "comment": "It is annoying that i can't switch the reset timer sound, i had recommended your app to guys in gym and we all sound the same.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPR2hXWE16d2hGTTZoV1FiT3dOb2hRVnRjMXBHVUNFa1hXcDlLczdSeEZhZUNPb3B4T3d5XzNmUFpwZTVaeHU1ZTM5aDR0ZGxEVWFWRVhieVdv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "hriday pandey",
        "comment": "I want to change my name . Spelling mistake . How to do",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPR2syV0N4N1o3ODNJM01UMFh0ajJ6N1NJVDYzWWMzMnpCRjZNTDhmM2lhcTU5Y0NUZmk2MTB4ZHJDWW1OelBTNzNkbkRjbUZMUU9IdnEzM3Yw",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hello Hriday, please feel free to send us an email support@jefit.com for your username request change. Thank you!",
            "date": "February 18, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Gabe Sizemore",
        "comment": "This program has definitely helped me vet back on track after surgery.  I am going to use my elite credits to try the Elite version to see if its worth it.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRnpLLTVrb0hTYnZLMzhwMFEtOGZPU0VqSFZldi1NdmNYRXV1NEpXRUNrc2ZUVjVIdXV0cDdhN083MjY3TDVkNXk1cERvdDluNXlERVVQRy1n",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jay Owns",
        "comment": "I've downloaded so many fitness apps and deleted after 1 day of use until now that i discovered this app. If i had four thumbs i would raise them up. Love it",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPR1pGdnFSNG9kWXFUekJxMEpDQktJZ3ZfeTc0bmNmdWNHYVhaVHhXTnZUcVhOS0U2WkwzMzJaMzAxNGJiYk80VDFyY3BsTGsxNEF6Y2llM25J",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "I started using this app in 2010. Life happened, but I'm back in the gym for good now! Seeing the increased strength recorded in this app keeps me motivated daily! Thank you for the tools!",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=bGc6QU9xcFRPRWt4MjU4bFAzMzg3Q2c0SDFfNWlWVktaNFExd2FIbVVzRnI3aDlCbVY5Y3Q5RHZPbnNwOXoxT19ua3dnaUwyV1o0c3gtWkFvXzlJM3JKNFhB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ben Peretz",
        "comment": "Good app, too bad there is no useful search filters like search by name and filter by equipment. If I only have dumbells, I want to only see dumbell and body workouts for example..  Edit: I'm talking about searching workouts not exercises..",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRWtlaDdfYWQ4elJrTmlJYW41MWVTUlJjYUhVakN5R1VVQUFFYnc0ak1aUXVmWFNGYU9OM0ZfTTRiYkp0a0ZNZ3JJVTNmS0ZER3dYYXBmeUtn",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hello Ben, if you'll go to the app exercise library and select All from the muscle groups, you will be able to type in the keyword of the exercise you're looking for then search for it. If you still have not seen this on the app, shoot us an email so we can help and send you some screenshots on where to find it support@jefit.com. Thanks!",
            "date": "February 18, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Siddhesh More",
        "comment": "The only app that gets it right. The android wear counterpart is useless though.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRklVVW91bG4wOFFGOHBLUk0xUDhoV25KS1JGZDBPTlAzVXd1d1ZxNXg2WjJYMWhrVVBuS1Q1dWxBZHBYODdGTXRfSW44T1U3ek1KNk5HN25n",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I would recommend you add an additional function to use the Samsung Gear Watch so that you can train using the watch whilst at gym and sync afterwards with phone",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRmtBcmpYejg1MHJ5dVZFbFZKUTNyNmtBcmRXWDZLMVozM2Q5cmtiMVVTVkROaWJIQUxUVHh1QnlsZ3A3RFdZeF84NWNFb3Mtajhma0doa1lj",
        "reply": {
            "author": "Jefit Inc.",
            "content": "Hello, thank you for taking the time to submit your feedback. We are not closing our doors to add more integration such as Samsung Gear watch however we can't guarantee a definite timeline. Thank you and more power!",
            "date": "March 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Cathy J",
        "comment": "Love the app! Helps guide me thru the gym easily. I feel like I am making strong progress in my workouts.",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=je.fit&reviewId=Z3A6QU9xcFRPRy1ra1ZxTTR4cXVZTVZmVW43UzRmOWdPYW16YmN0TWZNSGNwLVowX2psQ29nZmNxdGVsTnFxOXhDT1p5cVBKQkM5X0tCbF9mejV1My1tUzlV",
        "reply": null,
        "star": 5,
        "title": null
    }
]