[
    {
        "author": "Anger Clock",
        "comment": "It used to be an amazing app! I don't have service for my phone, so I use kik to contact people. Ever since the update though, it keeps crashing every time I try to use the camera. It even started to do this with other apps as well after I updated it. I wanted to see if it was just my camera that was buggy, so I deleted kik to test it out. My camera was back to normal on other apps after that. I redownloaded it and it started to act up again. Please try to fix this, it's important to be able to contact others incase something happens, I can't do that if it keeps crashing. Thank you!",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRXh5UkJqVGpwRHdiQkRidzhWeGtIQ1lfNDlHMHBWOGhqbDVZNWg5Q20zVGZwcU9ITHJ6cmV2a01PRFd4azVFT21TcldXOERZY04zU250am9F",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Lock up Your daughters",
        "comment": "I preferred the old Kik tbh. I know I'm not the only one. Kik used to be my favourite app back in the day. I especially loved the mini features where I could swipe through and meet random people. I downloaded it and had it for about 20 minutes and it's just boring and dead. Please bring back the old Kik, it was so fun back then",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRW1fUllXczZjUTZqdEI4a054QWFOYWpFa3NSa0FSd0NxenIxdS1ONE9McjVsektpeDUzVDdPU2pQYTBuX2U0OWg4ZEZtQlBBc29OQzlDNTRv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Azr Mun",
        "comment": "I rated it 4 star Because i REALLY like it and useful for me but the reason I didn't give 5 star Because if I log out then all the conversation get delete and  fake like those NASTY people will text you and send inpropripate stuff. It's doesn't happen always but sometimes. It's important to create a good username so they won't find you. They really should fix the conversation issue. Thanks!",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRnJoUzVhWXQ1QWFPendPWTZxUWc3UWFMNFRZbDFNVjdMek9naktGSjRWbXVna1pQa3NhS1BGNkJVdDBCbmNIQU5TZUVKeWNtSGJ1aFZ2Z09F",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "LAST GAMER",
        "comment": "The send and receive is slow as hell right now not only that the replay take a while to be received. it wasnt like this last week. it's not my internet i know i checked tvisvusing my data also same slow as hell. also Ur permissions shouldnt  be allowed to change my settings without my go ahead at all if people dont turn off the phone and location in ur app permissions settings it clearly states it can use ur gps to track you and also  read my contacts. those i turn off . but the other permissions you cant",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSG5sVFBYRmd4NTFNdjI0a2c1aFpkY1ZCRjBaSFhKWDNQNVF5bnpvMFJ4aDhuaHpvR3lQRl9jUWdZOW4wdmFEcEdjU2RVNGVvY2dPTkVuYjJv",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jss Elite",
        "comment": "ALL AROUND GREAT APP! I JUST DONT UNDERSTAND THE PURPOSE OF OUR HISTORY BEING CLEARED WHEN WE LOG OUT TO LOG BACK IN. THAT JUST DOESN'T MAKE SENSE. WE USR THE APP TO COMMUNICATE. I USE IT FOR WORK AND SINCE I HAVE IMPORTANT DOCUMENTS I DON'T WANT PEOPLE SEEING, I HAVE TO LOG OUT. BUT WHEN I LOG BACK IN, EVERYTHING IS GONE. PART OF HAVING A CONVERSATION IS TO REMEMBER WHAT YOU OR THE OTHER PARTY SAID/DID. BUT HOW CANE WR DO THAT IF EVERYTHING IS/WAS WIPED CLEAN?",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPR0ZEVXd1UXZuQkhoZFRJbWVGYTlEa1YybDBhckx5cnpaZU5WWm9oTGNvMHloajktX3BSMHNkbTlLX3luMjN6TTYyQ2dsMHREMkVOVVZELTY0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Koakuma Yuu",
        "comment": "I enjoy using kik but im having trouble with kik notifications... I tried to uninstall a few times but same problem comes up... I have to open app for my msg notifications to show up which is a pain.. Please fix this n i hope  we can back up our chat history soon thanks",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRkoyY3V4dHRwa2hTeUVJOVRsaDhycjRZRXpzVGY4V0ozb1BHLVNrdExTcUtYblBlRElSbThlNUJCT3VYRkEwNUxYdkZRVW8wY19jRVVjblNN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Inky Terence",
        "comment": "I honestly don't like where you guys are taking the app. The interest feature is really stupid and it makes kik seem like a dating site, which it's not. It was perfectly fine without that, please stop making kik like a dating site. Besides instead of seeing someone's interests after looking at their profile for two seconds, maybe start an actual conversation, you know? The actual purpose of the app!!!",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSEdfMm16ZlZLeEFiaHR3NHhyUGJ2VmN5VFhHblVUSDBmdm9NOHJ4ME1BYXo3M09yTVNWWVJXMmxBb2lHUUFlYTZESW5Lbk12YnRsMkhuWWhj",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "mallarie charles",
        "comment": "If I didn't have to deal with sex bots sending me and my under age children messages constantly I'd rate this better. But I see a vagina and breasts about once a week at least from this all. Not for kids. For sex freaks to say the least.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRjZHM3YwUjNhTUhCTlFuZXFROXNQdkdrWnl6N1Y0UXRDSXE4VVEwRGpkOFpzSW40cjlMcFBFM2IwajE5NUVZRk53UVF5bFBMWDlSeUd5WkQ4",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Theresa & Jason",
        "comment": "Kik overall is a good app. But I'd be happier with more options to mute chats other than 1hr, til 8 am the next morning or forever. It would be better to have multiple mute settings like 15 minutes, half an hour, 45 minutes, 1hr, 2hrs, 4 hours, 6 hrs, mute til alarm at whichever time you set your alarm to instead of mute til 8 am the next morning then mute til I turn back on options. Hopefully developers read this and try to do mute notifications like that.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRjZyUmVTTUlMVTFNdDJkTEdrMkV0M3VHRkJSSmhSOXYxTjZ0UTNJY01UdXI5Y1VkT3NPRm96LWdXWC1ib3pOSkU4YnhhX3c3Sjg1ZHJhZHhV",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jonathan Ventura",
        "comment": "Love the cleaner version and the variety of chat bubble colors. The stickers are great. This will end up a pretty sizable app, though. I do wish I can put the app in my SD card. And it's unfortunate that whenever you log in from a new phone, your conversations are erased.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPR2dTdk9xa0NyX21Kb1hjQjh6ZkhkV2gxVktFU05nTmdSSlI1Wm1aVmE3TE42cFR3VHFRZ3hEMUYyRWFOU0ZQTi1XSnNlVkxrTGNldGxBZ05Z",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "It's terrible now when you tired it makes you do capha it claims to prevent spam..but it has hundreds  fake female account s.. it's was once a good app. Now it not user friendly",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPR3lsdlc0OGFPcGZreWVLWTBLN21iS2RfdUVVTFdzb1M2MEp3d3VZaXdpVW9jU01uVnZBbGUxOV94c3c5bVNiZ2tqN3FiNjZiRS01U3BQRjh3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Benjamin Alvarez",
        "comment": "I was permanently banned for nothing, I've been a long time user and I have never been suspended or banned...i wrote to them to appeal my ban but they never responded. Kik needs t do a better job in making sure they don't ban people for absolutely nothing",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRUdnUk11eXhmM1k3LVBvQzJGOGlKVThfUjc5WFNmYk1DVVFJcktuWDhDc3lQX2g5MTIyLVpScmFHZUk2VWM0YUxpZlhlREZ3Y1k2UkhnbmJB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Nick Gamer",
        "comment": "Something in the app was not working properly so I logged out to fix it and I lost all my messages... I was talking with 30+ people and the messages were very important, now they are just lost forever.. I wasn't warned that they would be deleted by logging out too, I'm really mad. Aside from that, the app has a lot of other small bugs too. Fix yo problems.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSEFUYVZmZmlqc05OclFaSmgtSUhJWHl4SlBPVXpvWjNpT2VabXVBdTdBUjYwZnU3T3J0MjFvek1uMnRlejVfRmtwQS12Nl9wRzhQUFBYTkFJ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Andrew Morrill",
        "comment": "They banned me perminantly, no reason, no warning... no way to contact my friends, and no email responses.  They never tell you what you did wrong, even if you ask them.  I only ever violated their rules once, and that was a long time ago, I read every single rule at that point so it would never happen again, yet I still somehow get banned.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRVBWcExMNjRBc1NYZXIyaGZoQ0JiUWcta0xpWkFJWFA0M2RpSFVtZnV6WTFFTGZRb2dWTHlYOU43ckFnZFRYRVVyTFFkeko3c3hIUFlKUmNR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Really unhappy with mobility: if I have conversations on my phone and then login on ipad, everything on phone is erased.  The reverse is also true .   I don't mind being logged out when I switch, but leave my conversations alone!",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPR2hUY2ktS25rUDhKVmE3S1VnR0NzRFhIeGFJZzJQTW9LcGM1QmkzQmZqMVQyYU02aUgwTTFxTWNyTWd3ZkRWOXM3M2F6UzUzXzVrc0RqbGV3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Cannot add profile pic or new group pic. Click add profile photo &gt; select the pic &gt;  returns to photo folder. Repeat. Must close app but still cannot change pic.  Reboot phone, reinstall kik, now cannot get past captcha. Solve first captcha then it returns to login screen but it is greyed out and you cannot do anything other than restart app. Login &gt; repeat bug....  Samsung Galaxy S8 + newest Kik ver",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSFB0MHhhbmYyVGlRQ1VzTFhid3FUVGhrLXN3QUFWT0VPU01NSmY4Y0xZMTNiZktPZldXbWJrSW5odjdrM1FNS2t4WExmRzJKeGVfa3FlMU9B",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Amanda Hensley",
        "comment": "The worst people are on this thing. Everyone assumes you're a bot if you don't say anything for a few minutes. Don't leave your phone to go to the bathroom, they'll talk smack about you. The WORST people ever.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRk5vVnBzQlE1eFRCVG0ySVdPSFYyVlpoSEtpa2V2M3Z2Uk9kX3FmMXc0ZE1SakJDd0NyTmlZazlZRG5nQjd5VVVxdTMtV2lQUkRackJGZkg4",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kenyan Speed",
        "comment": "For some reason, kik has been freezing. And it's the most annoying thing because then i have to wait for my phone to realize it \"stopped working\" in order to get back in the app. I never had this problem. I love the app tho. I mean if there's something i can do to fix it, I'm all ears.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRXlucGFLX0dTcnlRZU9URHN5RVdJV1N4NTZUYm95dnk0Y0FzZGVLQkszWHpfRmlPYklIb081M3NURVlQLTlqakg0TUlBdVBSRFpnd2VvUVE0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Sneaky Raccoon",
        "comment": "I've read some reviews and some of us are having the same problems, we try to send a message and it never or takes too long to go threw. I know its not my internet connection. I just send messages really. I never call anyone on here, rarely use the gifs, and don't use the stickers. I really hope this problem gets fixed soon. I miss talking to my friends",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRjA4SUNMNEpMNVRfOGVMbjRmRThLUEF5TVdpMGZNWkFXUlA1RzNSMThNa3VMbnpKb0N2NkR6TWNQRE4xaFB4eGx1Y0I0bWdMc3JtR3NmOUtN",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Tifany Snead",
        "comment": "I like this app, but it keeps crashing. So I have to erase the app and start over. I try to send a message and it says \"s\" and never changes. It's annoying. Why won't it send my messages?",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSE55UXBiMEd0bHRubE1WdlpIVVpmR1gwTFlzcWo5Sm9za3hLLUJhbEV4VEN4QXJ4UDZuZF9qb2tNRndpbWdrNi04Y3UxMmhqODA4N3Y4LUhR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ren [derp]",
        "comment": "The app is good, but after downloading it, the app gradually uses more and more storage that shouldnt exist. It wastes much of my space in my phone so every few months i have to delete it and reinstall it just so it will get rid of it! This app doesnt need to use almost a gigabite of space! Fix this so it doesnt keep happening because i know it is just useless data or records of texts we cant see anymore",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRU92dEVGRV96ME5jWHVwMFRyMms0MHJLZjc3b3ZlSTZiaVlRMTVuT3gtaVFDWDE1N3lfZmtGYVBfRWtRdHVhaUVDOUxENUg5QzZkajdvb0lJ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "SweatyCommando",
        "comment": "Gave it a 4 only because I can't give 3.5. It really is a good app for messaging friends and all but I just wish it had a dark mode. I hate the white background it has. Dark mode is needed for this app but overall it is good",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSHJ2cjV5MWhBcDhuM1NDVGJTTTVncEt4QUJ2a1NPODRENmZ4OEhxaFJsN1Y4OGhTUFQwUW11NzNEX3NjaHdtZTV1SkgzaTFTR1FaaldxU3U4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Rin Hill",
        "comment": "Okay I love this app, I've been using it for a year, but lately Something weird is going on. First I get added to strange groups all the time named \"Just you\" Which personally I think is funny, but the second thing is that when I'm texting someone my messages don't always go threw and it's not my internet connection. One more thing is that when I log out then log back in to try and fix the problem it will send me the other person's conversation. The whole conversation. If you could just fix that, it'd be great! Oh and maybe bring back the counter on how long we've been on Kik? I liked it! Okay! Thank you!",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRWltaXNERmlLQXdhd2ozTW1zSWJ6Y1FpTEtjdFBMbWZNM3FlWVBNQ1V2NGJ5OGVWaDhfV0YwdXNRcUkwQlFUcUhabXJnYnZhNXQ4emhJSUJV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Dream",
        "comment": "So I have had the same kik account for about 7 years.  Then all of a sudden this week I kept getting ban with no exploitation.  And today I am suspended.  This is crazy.  Somebody needs to fix this..  And reply to my emails!!!",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRjNDTDMzYjlXN05YRlBzck92cGJjQ2VqNkpqSGNqMXhXbjZjTDVBQzRzMEJKdm1FYUFpRmdpNG9pSGpBQXVfZU9Ja252amkySUx2cTZuX3JZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Well, I logged out of my account for a moment, on accident. And it deleted all of my dms. I am absolutely pissed. If it didn't do that I'd give the app 5 stars.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSDdvN3hrYzB6cWtpTHVQSEt4d0hNNGQtem9fSzkxOWRoSUdNSm9keUNYaURZSy0xQjVGMVo3Tm95SWhXQXFteGlPZmFjNzd4a0ZpRlFMai1v",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Two Faced",
        "comment": "I made a review a whole ago asking for you guys to make it easier to delete conversations, you agreed to do that, and made it 60x harder and an entirely longer process. Before, you could reset kik and they'd be gone.....now you have to delete people one by one and it takes literally way too long. I've spent an hour out of my day removing chats from my kik list and it's just unnecessary",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPR1NKNXdwZGhqQXJ3aklYUE5aMVVZYTNLYk5UeXFDY0hyeEI1RXBQczhoM01xbVpxeXZzN2ZTY1dOcWRtU2RzeHhBeHJnZE9QTXlvZi1vbkRr",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "chris reid",
        "comment": "The app logged me out when it updated. After the update I tried to log back in and says I'm banned. No reason no explanation. I've heard there is an issue that the last updated banned a lot of accounts. Tried to appeal the ban and nobody will answer. Tried multiple times to contact customer service and zero response. Terrible service. I recommend using another app so you don't lose contacts after it randomly bans you.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSEJrSjlNY3F4VUhOanRIbjdnWmNKY09CVXdJcnBtNjk5SzFQTzhkNmVsQUVneTFNMWhMSE92S0QyUXY0S0UyM2ZneUJfNHR0OU00VVU4dWhZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Claudia Fallas",
        "comment": "I honestly love it. 4 stars because it's a great way to make friends with people who share the same interests as you. Not 5 stars because after UN installing and installing all ur convos get deleted, and there is a limit to how much of the convo you can see.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRjJldnpIeVpUVHBfdmFtd2FxNnlmMEJKYmRaclM3OGhNSmZvSDFKZi1qUDloNDNJNW9jS2lqaFpuMklpYU45TWsxMUNVS2R0VUo1UHc0b3Nj",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Teddy B",
        "comment": "Loved Kik for many years now but I'm having an issue uploading a profile picture and it's been this way for months. I own a Motog5 and whenever I choose a pic to upload, instead of applying it to my profile it restarts the upload process (goes back to photo album screen, says \"signed in as...\") And sometimes freezes the app. I've tried uninstalling and reinstalling, turning my phone on and off, switching accounts, no success. I really hope this is recognized and fixed because I know my phone type is generally uncommon, so I could be waiting more months. Thanks for everything, Kik! :)",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSGpvZnFhajJTLUIwb3BWVkVRZUt6NWlRckZNUDhxWEF4RGZCMU5xNFFWem1xLThJNVhjN3JqbUtyckhlby1fR3F3Y0xJT2pyLTR6bURBdFpV",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Katie Regier",
        "comment": "I am having an issue with someone messaging me from multiple accounts. I block him when I know its the same guy but I am never 100% sure now. I'm now afraid to open new messages because i don't want it to be this guy. How can I get him to stop for good? Please help.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSDg2WDJ3YUlrZXZMcU9Yb3IwZFNlakIydkdSd3p1bjFOcWpEeW5abFB0YXBVNU9sVmI5bDBfbXBvNUcwY3NQUk5BNFR3LWtRUGk0d280Z0xn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Frank L.",
        "comment": "App worked okay but beware. I have been attempting to delete my Kik account for two days now and have not been able to.   The company's helpdesk is a joke as I've only received automated emails saying they cannot help me delete my account at this time.   I've followed the account deletion instructions exactly and am still waiting for the confirmation email from Kik to finalize the account deletion.   The app is alright but beware if you wish to delete your account, you might not be able to. At least that's been my experience.",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRjhLZ0xaQnUxUVNVMkhueVl6RElPemJhVlZyVWd2VENMVGFFLXA2bFpRQk9vS3YtMUNJV291dGZlSHpwM1hFTjNUWnUyN3NzRmo2aUFmeXBF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sapphire Bleu",
        "comment": "Looking for fun with masculine guys. My name is Chris aka Sapphire. My screen name is sexytgirl32 :) I am a male who is also a very sexy thick black fem queen crossdresser. I Like talking to masculine bi, straight, or total top men who arent afraid to try \"new things\" or who are curious to meet someone like me so hit me up! :-) NO UNDERAGE PEOPLE! Or bottoms like me. Eww! And please only message me if you know the definition of xdresser. Also love to have phone fun",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPR092ajZnb3I5bEdsM3ExaEtaODdOZi1INllxT19td3NIQkpPYWxGOGlIdDRSMnBlRHVrMG1UeTYtSHNFcURWLUZCeHVTVVFfQ2xuZ0ZhTjZB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Drew",
        "comment": "Honestly this app needs a major overhaul but instead of doing so they add strange features that doesn't add much to the app itself. Dropped it a star as my messages are not sending and receiving lately.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRlRMOEtFZHBqcU5XNjVTYkYtM0RTdTljenZkX0xrNUp6Mm9FbW8ySHE2WllabWJUMWhKSkZONUtoSHp4R2NneW96RXVzV1YtaVJFTkwwTWNF",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Way too often, my messages just don't go through. They have 3 dots eternally ,and I have to wait about an hour to be able to send a message that goes through again. It's not my internet connection because everything else loads quickly and works flawlessly. Messages on other apps go through instantly. I'm going to have to say goodbye to Kik",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSEQ4ck84bDlrOEs4Sm9Gc2hfRnFfSFhhd0lKQkpFaWozbnMzN20xZUxjd21taGVMNXdobzhtQnJZaUFOem1WNkU2VmhEUGRUNFBnVFRCUlhR",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Mark Just",
        "comment": "Worst so ever. Anyone can report you for anything and they ban you. Go to telegram it Whatsapp if you want to be treated fairly",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPR0s5R2RiMzEwNF9hZ3otVDdfU19tREh5XzZGVHpycElSd2dFa3VrR3JUNGYtRlhxSy1xRndtclZZN001dHJKMDBvc1laOVdhNENBRmE0ekg0",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kawii Awesomeness",
        "comment": "I'm super pissed right now can I please get in contact with someone? It would be quite helpful 😡 I want something to actually be done about this so I want a formal conversation please thank you",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRUJEaGpsenh2UXZrbllkTEY3cFBrSTFYWHRGcWFVeHFFeG5xcFBzZmJ5a0IyRnZGX1NONTZ5bUF1QzF3bUpWVzBwTUkzbG1VRWlKV0dKeEFz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nilson Sales",
        "comment": "Why this app occupies so much space? Only the app needs about 150MB and after using it for a little while, the \"data\", that you can never get rid off, occupies A LOT more.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPSGNnRVFiY0l3VVBSN01Lakk5dUprYVRkdHRZM0hwcUljcGhaTGRzejR3V1VELW1zTk11bTZLSl9hNTFpWmlrX3ZiTTZWUHFRZl9UcnpOM1JB",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Mimi Talisa",
        "comment": "I love kik, I've been using it for years and made new friends. My only problems would be the fact that you can't see older messages wether it be on group chats or pms.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRlZhdDE5Z1JfQlNWb1Y1M3J5YV8yQ3VFWjJFRXFrcmxSajFEWU9JcmJUQmJvZ19KdDhMYVBfUTRZUVZHbFpKY0czMTkyR3dvUWJGazhNdFhv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Onx B",
        "comment": "Use Skype, it's better. Kik Support is useless, my first account (4 years old) was stolen and support never replied to my emails, and now my account has been banned for some reason and still 3 emails to support and not a so for reply. Don't bother using this to make friends, kik will crash or something and your friends will.be gone.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRVQydk5pYmNRLTF3YU9KNXRodmJpRWlhNzZWdkRPRjZFeV9YLUwtek9QLTZrdUhreGdlcTcwR3d5bTlEbjdVWTZMQkxSNldWRllRcVFtZXhn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jada Dragon",
        "comment": "Its a great app, I use it to talk to people more than I do text! The only thing is that it can take up a lot of space the more chats your in. But id def reccomend it",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=kik.android&reviewId=Z3A6QU9xcFRPRzJCREtrMUVqVVFIZEpNcld3c1k3YUJ4eUdMMnNIQlQycF9HaWhmYXZIVlVabjdLVUpSNWs5WktaUDVNMmY5X3FXS3IwOWpfVGJxM3dhSGhr",
        "reply": null,
        "star": 4,
        "title": null
    }
]