[
    {
        "author": "Juan Carlos Ivars",
        "comment": "I am having issues since the last update. I can no longer log in and prior to that I wasn't even able to confirm any transfers. It worked very well until then. Is there a fix for this yet?  Edit - turns out it was another apps bluescreen and turning it off fixes it!",
        "date": "December 8, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSEtNOUxJRjVKZ2FMZ0cxUUhHNlZLNFVCZFlkQlowYWhGdVM4dUd0OU5EVmw3bHBJamJrclFNMFBSSUhjbDZJWWpkbzVFQkltd3hSZ2R2RWc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hi Juan, don't hesitate to contact our Help'Desk at the following number: 02 464 60 04 to find a solution quickly. Have a nice day!",
            "date": "December 8, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Good app. I love the integrated bancontact option which allows you to transfer money to other people, even outside info bank, although it sometimes takes long time to open it in the app. But as noted by others below, if you have screen dimmer active, such as Twilight, you will not be able to log in. You have to disable it manually and then restart the app. I wonder why, if it's for security reasons, or if it's a bug. In any case, it's annoying.",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSGZYcGhRdnY2TU1PZVd1QzZfWEpGRXdGWHpjblE0d0pBN2tCb2FqNzgyWlNGNU5XQVlBWklDYzhVbDZwRlJUdXpkUlZZZ2s1cjlXcUJfQ2c",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thank you for your feedback. The screen dimmer disables a certain color that our app uses as well. Our technical department is aware of this situation and is trying to find a solution. Have a nice day!",
            "date": "January 16, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Dwight D'Hooge",
        "comment": "Nice app, but since last update some issues. Some buttons seems to be frozen, like button to confirm transfer or beneficiary. Few days later it worked again, now it's again broken. What can be the cause ?",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSDVzVmFCdktlamJ2aURheXdOX3U0RzVJbTVMS0VSNXQ5ZDdXUFBYYm5VRldVMWJYa3ozV2RvS2llMm40VzhOMHh4b01WM2dmem5xUUNwZ0E",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thank you for your feedback, Dwight. We will pass it on to our technical department. In the mean time, feel free to contact our Helpdesk (02 464 60 04), if the issue persists. You can contact them on working days from 08h00 to 22h00 and on Saturdays from 09h00 to 17h00. Have a nice day!",
            "date": "February 7, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Bordian Oana",
        "comment": "It's the second time when this app doesn't work on my phone. In a month. It will work again only if I restore my phone to factory settings. This is not nice.  And I can't find an explanation for that.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRTdwdHFqbkNvNzdSbXlrVFBxUXpyRmRzS29pRmdRNC1WTWVNOFVlc3JyREtvLWIxNVNOY0t2WnBSUkR0alpkRkpwalZlUUNueXRvNjA3Wnc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hello Bordian, is it possible to check if there are any blue light filtering apps active in the background? This might interfere with our Smart'Banking app. Should this not be the case, you can always contact our helpdesk at 02 464 60 04 (Mo-Fr: 08:00-22:00 and Sa: 09:00-17:00) to further investigate this issue. Kind regards!",
            "date": "February 1, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Kerem Eryilmaz",
        "comment": "Pretty handy app. Been using it for years, and it got notably better throughout the last year or so. Kudos to the developers.  One tip: if you are using a screen dimmer app, you might run into problems tapping buttons, notably the login. The issue goes away if you pause any such app while you use smart banking.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPR1k1UjUxX1JMQ1Azd3BlQTFBSk1Na1FrbXVKdFl4MWVLdWk4b0FtempWQnJ5NXhkb0dmUVh5Wm8tVkNtRnNYaXhSd19tdW52c2p2NlItOEE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thank for your feedback Kerem ! We will transfer your suggestion to our Helpdesk. Have a really nice day !",
            "date": "January 12, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Viktoria Yordanova",
        "comment": "I love the app and use it daily. The fingerprint log-in disappeared, however, since my phone's OS was updated to Oreo. I read in the description of the latest app update that the problem was fixed, but that doesn't seem to be the case.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPR213ZDdYQ3NyTHV3Z0VYV0dHdVlkYUtPU25KV29HdGYxY0pLLUtqZEh2X0VzNFUyVU5sYk5OUTdSSmhTOEtvZlltMk14QnBhcHZxX19HR3c",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thank you for the 5 stars, Viktoria :) We highly appreciate your feedback! We will report this issue and hope it will be solved as soon as possible. If you're encountering other difficulties, please do not hesitate to contact us :) Have a nice day!",
            "date": "February 8, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Dirk Baekelant",
        "comment": "Reported an error with the app in combination with Android 8, got a reply from the developers and it's fixed now! Way to go! Wish every reply to an app got that much attention...",
        "date": "December 7, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRTluZWJfN2ZlNldhVjVJRXRxc1BUUWVrV1VpTjAtamtsa3ZyYkl5ck5YT1N2dk11ZEVuTXpuZWVQWEZVSkU4REJrb3BLZS1IODBYTkRZTUE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hello Dirk! We are aware of the technical issues with regards to Android 8, these will be resolved early October at the latest :-) Kind regards.",
            "date": "September 20, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Pieter -",
        "comment": "8 maand na mijn eerste review kan ik nog steeds geen budget-beheer doen met jullie app, zelfs de laatste update heeft deze functie niet. Ik wil mijn saldo kunnen monitoren om zo makkelijk mijn uitgaven per maand te bekijken. Waarom lijkt dit jullie niet te lukken wanneer de fortis-app dit al 3 jaar kan?",
        "date": "November 7, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRzRkWVJKU1J5TmNOT3lYSXZYVzMwQWc0OEFyeTFmTm5tTTdEWXdReUdMTU5qVDAtbGdyOGUzSGNRWDQ5YmhIclpWeE1sU2s3cmVVMVdlb3c",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Bedankt voor je feedback, Pieter. De functie ‘budgetbeheer’ is wel actief in de app voor tablet. We geven hoedanook je opmerkingen door. Fijne dag nog!",
            "date": "March 21, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Basic and pretty much lame. You can't copy paste, you can't repeat previous transaction, you can't save beneficiary. Low quality for what they charge their customers per year.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRmFMM25nWkkxZjJlUDhIS1Rjcm5KeXc1NnpSX3d2aHFTU0ZsTnBNeHVPWnQ4YUhnakFFYnN4aFhhN1hwdTYtcVB5X21lUHhqRXpyaC1KSHc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Good evening. We are very sorry to read your message. We inform you that our application will soon offer lots of new functionalities, including creating a new beneficiary. We will let you know when those new possibilities will be available. Have a nice evening.",
            "date": "January 30, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Stopped working with latest update for Oreo. Can't even create a profile. Running stock Oreo with November patches and not rooted. Shame really. It used to work fine.",
        "date": "November 10, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRWs4V1ZSQlFyWkxHbzN6MEJsUFVjeER6cHNPUEU2RFd6NzJVWlkxUy11c1poWXJac29EQzJrbG9WQWEtSkdNMmZGbDdhOFgtSGZ5V3NMUFE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "We are aware of the issues when trying to create a new profile and we are doing everything in our power to resolve these issues as soon as possible. Thank you for your patience and have a nice day!",
            "date": "November 10, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Claire Deconinck",
        "comment": "Last weeks, very often down. And since a few days, login button is blocked. I'm unable to login?! Pity, I used to be satisfied, but not over the last month.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRzJlR0V4b0xzZjNFUVdZOTVGWnpjcnZUem45R0RBbzc1akJmMHMxWUoyckpUQWRlaWJhaFN1alIxaTZrNzhkckJtcTZCVE5waGlmcXQ2Ymc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Dear Claire, we are sorry to read you. We suggest you to contact our Helpdesk on +32 2 464 60 02 (available Mo. to Fri. 8Am-10PM and Sa. 9am to 5PM) so our colleagues may find a solution with you. Kind regards.",
            "date": "March 1, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Kittieke Life",
        "comment": "App seems to be blocked. Unable to sign in. Uninstalled and reinstalled. Now not even possible to register. Hopefully it will be fixed soon.  Thank you for the quick response.",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRThRYkRFdHZ2WmxIajlOcTdaMFJWNXI5SDM4TDNzRmlycGxSYk5mbmhjWVdBc1JpemtmQ0hwb1FFS19JQ3dYOGd0VjhsSkUwVE1RTVVxR1E",
        "reply": {
            "author": "ING Belgium NV",
            "content": "We are sorry to read that the app does not respond anymore, Kittieke Life. What helps, is to turn off the bluefilter on your phone and to close all other applications. We are doing everything to solve these issues as soon as possible. Thank you for your feedback and have a nice day!",
            "date": "December 1, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Remus Rares",
        "comment": "I always need to use screenshot as I often do payments and must send the proof of payment to the beneficiaries  so I can receive my products faster. Please make an option to allow screenshot on our own risk, for 5 stars!",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPR2Q1Q3NEZVNtZkZqdmFFODVaX1ROZW5RVWZBc1ZRUmhGenFkb2FEZWtmbzRYLVBVajZ2ZGpaN1o3b0VSaG9qYXRmc3k0VG5BaGM5MC1NdHc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thanks for your feedback, Remus. We will pass on the feedback so we can receive 5 stars :). Feel free to contact our Helpdesk (02 464 60 04) if you would like to have some assistance. They are available from Monday to Friday from 08h00 to 22h00 and on Saturdays from 09h00 to 17h00. Enjoy your day.",
            "date": "February 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Ljubisav Curcic",
        "comment": "After update to android oreo 8.0 I've lost fingerprint login option, although in latest release of this app it says that this issue has been resolved.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPR0prNnNpWjhxWUJGTnJfcnU5eUtPbTZiMmJDYU5GZGlOVW5SQU8wOFYyX2FqdHBaTlpFT2RTZmxWOEZjM1pQSGpRSjd4alg2QkdCY1ZQWFE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hi Ljubisav, the fingerprint option is available for most of our Android Oreo users. That is why we suggest you to contact our Helpdesk on +32 2 464 60 04 (Mo-Fr: 08:00-22:00 and Sa: 09:00-17:00). Our colleagues will gladly help you. Have a nice day!",
            "date": "February 1, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alpha Diallo",
        "comment": "On Android 7 (Nougat) the fingerprint was working fine, now that I updated to Android 8 (Oreo) the fingerprint is not available for this app while for other banking apps I did not experience any issue.",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSFdsY1U0dnVXenVRVXNtWjNKZlc2Y3lkVmFHUmE3RVdQUURDQlJhMFVLZDQ1bDhDVDlOYk1DV3A3Vk9zMncyd080VmFUUEg3eWt0S003MGc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hello Alpha Diallo. We currently encounter an issue with the fingerprint on Android 8. The issue has been solved but it remains however for some devices. Our technical department is busy fixing it. We confirm that it will be solved soon. Have a nice day.",
            "date": "January 9, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Yasir Ashfaque",
        "comment": "Hello, I have 8.4 but after updating to Oreo fingerprint issue is still there.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSGRSbzZleGJUTGtrdlNTOHJBTVpjYXJtdnE2NElZT250dC1LcjNfN3gtRzhlUFZwN0JPR1BmUFM0YjdXMkZrdFdYUlZ5Z2ZyMTBSdWozMkE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thanks Yasir! We forward your feedback to our development team ;-)",
            "date": "August 2, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Very good features, especially the balance slider and the ability to send money to trusted parties. However, \"Log on\" and the other two buttons don't work when one is using a dark or colour filter on their screen (as many of us do to save battery or not to distract our vision in low lighting) the slide button for the balance always works, so there should be a way to fix the other buttons aswell.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRjJyMnRKVnpDNjhqUmFaRF9kXzRldDNiQ1gzSUh0dVJxeXFPUndBQjZNRG5NOWVzb1F6THlXQzFKajVxOUlfY054WW05b0NhSkh2eU1nQ2c",
        "reply": {
            "author": "ING Belgium NV",
            "content": "We are sorry to read your message. If you are using a Blue Filter application, it might block your access to ING Smart'Banking. We invite you therefore to uninstall the Blue Filter or to modify your phone settings. If still encounter the issue, you can contact our Helpdesk via 02 464 60 04. Have a nice day.",
            "date": "January 5, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Kurt Roosbeek",
        "comment": "Not responding to input. I uninstalled, reinstalled. And all buttons don't work. Not even the register or write a revieuw button...",
        "date": "November 30, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRS1wb1RYZ25QZVFPa1lKLTFucVc0SXRqZWJnSThBXzJyY1UtSmZZM3FXSEFzd3BTRXFKU1BNc0xTYnhRNFNtcE5DcThKWVFfYVJ5c1I5Mnc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Good morning Kurt, if you have activated the blue light filter on your phone, it will block our application. We invite you to uninstall the filter or to adapt your device settings. If you need help, you can reach us at the following number : 02 464 60 04. Have a nice day.",
            "date": "December 1, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "François",
        "comment": "Missing fingerprint login with OP3. I don't understand why It's working with Belfius and not with ING app.",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRXMxX2JUVUU4QjBaMzlNTndNZU1tSHVKTXVuZlRMb2ZXNG93T3A5R241bGFnc1l4RlQwcXdPRHBROHlWVVZzNlJKdW4wRUhBbTlyUHg2Y2c",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Bonjour Edouard, et merci pour vos 4 étoiles. Concernant le lecteur d’empreinte, il est disponible pour Iphones et Androids également. Cette fonction est cela dit compatible avec les smartphones avec capteur Google Imprint. Nous vous souhaitons une excellente après-midi.",
            "date": "February 10, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Tomba -",
        "comment": "Great App! Fingerprint login is currently still broken (OnePlus 3T) despite latest update.",
        "date": "November 30, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRTVyWHhrcFNsc2hWSTFhUnZZbktNOC11dDBVWWhMekR6RmNNWGZzakRudmtJU2djS1JjYy1PRjNjN1NEM2NZdFl2alAwdHBSbEgzZU1jcnc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thank you for the feedback Tomba! Zoomit will be added soon :-)",
            "date": "February 8, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Wilson Yap",
        "comment": "Cannot use finger print to login anymore, no such option after update my OnePlus 5 to Oreo. Other banking apps working as before. I guess it's ING app problem, please fix it.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRTdPa2hHZWFPVnVsWUk5ZTV5Umc2YUhFU3VNU0w4MzlvVHpVTlR3WHNkRkg5TFcxbkRHcW5DUEZkaGVBd1F6NG5uUmVNX19HUk5HZnhheWc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hello Wilson, is it possible to try reinstalling our mobile app? Should this not resolve this issue, we advice you to contact our technical helpdesk at the following number: 02 464 60 04 (Mo-Fr: 08:00-22:00 and Sa: 09:00-17:00). Kind regards!",
            "date": "February 2, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Abdou Trice",
        "comment": "Application très pratique, chapeau aux développeurs. Néanmoins depuis la mise à jour Android 8 (oreo sur op5) il m'est impossible de me connecter via le lecteur d'empreintes. Aussi, ça serait bien de pouvoir payer avec NFC.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRzZSXzRIN1JWQVBoZ2lpM3F6aWowb25PMnF5em5kVGVWQVc1NjIyRHFiYzRpQkoyMzEtT3FQeFZfckRIMERKVFNGajJ5RVAyb3hjZG5yY1E",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Bonjour Abdou et merci pour votre feedback positif :-) En effet cette option ne fonctionne pas encore de manière optimale sur certains appareils. Nos équipes techniques sont au courant de la situation et  cherchent actuellement une solution. En ce qui concerne NFC, ce système sera disponible cette année dans l'app ING Smart'Banking. Bonne journée.",
            "date": "January 23, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "John Mendez",
        "comment": "Worked very well before. Was using it on a daily basis. Suddenly not able to login. The app does not even respond when I click the login button. Please fix ASAP.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPR0ZVMmU0d0pCMjNKOC1QRTM5b0JxNzU2eGptRW12ZTV6RFhNQTNVTWtCUDVlZHh0eWp1SllTLTI1YXA2TVYxTW5hclV3b1JoMWQ2Nm5CR3c",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hi John, we're sad to read something went wrong. Don't hesitate to contact our Helpdesk on the number 02 464 60 04 to solve this issue. They're available from 8 until 22 o'clock from Monday to Friday and from 9 until 17 o'clock on Saturdays. Have a nice day!",
            "date": "January 11, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "I was forced to update the app as it would not let me use it without an update. Now after updating it I cannot even log in. Pathetic.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRXIwMFRuVHB3TlZfOGJCelh0dXd3cEJaTDA2OHBoM0hNeEs3d3BEV1duZmpLR1RBRjVoTUFyOFJCcHFkSFZCTXZxU1FTbEdENEwxbS1JWXc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Good evening, we are very sorry to read that you experience difficulties with the app at the moment. Could you contact us at 02 464 60 04 to check what is going on? Have a nice evening!",
            "date": "December 5, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "calin lupulescu",
        "comment": "I am not able to add more than one account to the app and it's weird because all the other features are pretty much straightforward. How can I add other accounts ?",
        "date": "December 3, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSGZGUUxTRG5tRXZBUm5RZThGQXdVX2FESUJJR0YxcUV6c21EQTQtWDNTODB0d0R0NXRfQ0ZXeE4yWk1CdkpHZzROaVJSbzVZdkd0X2dCLXc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hi Calin, you can contact us at the following number: 02/464.60.02 and we'll explain you step by step what to do in order to have all your accounts visible. Have a nice day!",
            "date": "December 5, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Bert Verbiest",
        "comment": "Same issue as other users, since last update login or register button seems  to freeze, restart or uninstall doesn't help",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRVJoWlhILUJRZmpyUHQ5MjNEVlRpMkZ3bW9ZUUdYN0VWRHdMU0hCMmVCSFJaRlR5Mm4zUGN4N3VWRjdLSWllbTZVZlBLb2NrR1ZwMUxseUE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "We are really sorry to read you are experiencing difficulties wilt the ING Smart'Banking app, Bert. This issue is probably due to the Blue filter technology which you have installed, could you try deactivating it? Nonetheless, we will report this to the dedicated service and will try to resolve this ASAP! Have a nice day ;)",
            "date": "February 24, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "pierre c.maurice",
        "comment": "Funny: 1 hour after my extreem negative reaction, this app works 'again' Normal (maybe because i deleted Twilight Blue Light App) (but previous 3 years never a problem with Twilight App)",
        "date": "November 22, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRlhabGNJRnhjMURRR3JzeHJZNVA0UU4xTjA5R3pVWjZ5OXJBQlFXalZmSGhpQjRKcVFvejBZWnlBeURPdUVpUEFmeTRib3VFRmlWcVdHQ0E",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hello Pierre, for some clients it helps to deactivate the blue filter on your cell phone. If this does not help, we invite you to contact our helpdesk at 02/464 60 04. Have a nice day!",
            "date": "November 22, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "madb4you",
        "comment": "Since update I can't search data older than 3 months. It crashes, black screen.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSG5nZVQ0NGFGYklpa1dscHVzVG1VWGJNNlhzc19oVzM5bVoyamNSSHNiNFpqTnpneElxdTMtWFBQODZ1VUkyZGlvLTltQlRlLWZZaW1UZ3c",
        "reply": {
            "author": "ING Belgium NV",
            "content": "We're very sorry to read the search functions keeps on crashing madb4you! We would advise you to contact our Helpdesk (technical support) at +32 (0)2 464 60 04. Happy holidays!",
            "date": "December 30, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Chris V",
        "comment": "Not able to log in. And therefore not able to do banking. I need another bank maybe?",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSEJWbDRVQnIzZnE5emx4dlEwdFBLS3ctNTFIUTF2eXZmSlphTUpYQ0tpQTJrUVNJY3YyMy1hRjZpdjd1MG9KN2FxZU16andPTU5WMnZjTEE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hi Chris. There's no general incident on-going. If you can't log in, we invite you to contact our Helpdesk by phone at 02/464.60.04. Have a nice day!",
            "date": "January 23, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Mircea Bordeianu",
        "comment": "Log in button unresponsive even after 3 time reinstalling. Difficult save of repeated beneficiaries.",
        "date": "February 5, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSHNhdTRjQXdvaFJEdkkzLURvQjhqTWlPNkpRNHlpYWYzbkFNZEhFYkYzY0dZVFZCbHV1WG9ETzBrN0d0T2pvSTRHZl9vMlR2T3NCWE5manc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "We are sorry to read your message, Mircea. We advise you to contact our Helpdesk via 02 464 60 04. They will be able to help you further. You can contact them on working days from 08h00 to 22h00 and on Saturdays from 09h00 to 17h00. Enjoy your day.",
            "date": "February 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Hannah Gunsch",
        "comment": "Worked great until this week, when I can no longer log in, nor register a new account, even after reinstalling the app.  When it's fixed +4 stars...",
        "date": "November 22, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRWxCd3lmYXBHREZBaWRhU0diMUlRYmdtYVIwU1FqOWt0MWRqRlhyRloxQkJ5azZGRWNzaWVpbzVxLVN4Vk5yQUZaMTZvREtrM1E1eXp2OXc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hi Hannah, if it still doesn't work, please do not hesitate to contact our Help'Desk at the following number: 02/464.60.04. Have a nice day!",
            "date": "November 23, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Thomas Francis",
        "comment": "Was working fine, now key buttons are frozen on my screen and cannot log-in. Compared to painful browser banking the app was great before it broke.",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRV9jMUx6Y1BERDltNkFqS2ZFbU12MUx4bmc1RUt5ZFBNS3BPWS1FaU1nY3ZXNUpsYUtrbWgwaXdWQU9HbjRfcjh5aG9lY1N3TXRfaXY1Qmc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hi Thomas. If you encounter issues for logging in with your Smart'Banking application, we can help you with that. Do not hesitate to contact our Helpdesk at this phone number : +32 2 464 60 04. Have a nice evening",
            "date": "January 24, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Freek Willekens",
        "comment": "Since the Oreo update on my Oneplus 5t I can't use the fingerprint anymore.. could that be repaired? Other than that I'm very satisfied with the app.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRlVLbWh2VHhyaFFpWURKRG5aMUlPQ3p1Q2hQYnB3SC1zSEJhMHFmakJjNGtTdkJ4ckxrN3lzZEpfeG1aa2hmZ3hubnZVR1lDZFF0YUprOFE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hi Freek. Thank you for your positive feedback. We are aware of the issue linked to the fingerprint option via Oreo. Our technical department is currently trying to solve this. Hopefully it will be solved soon ;) Have a nice day.",
            "date": "February 7, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Quentin S",
        "comment": "Overall great app! But the fingerprint issue needs to be fixed with Android 8.0 Oreo.... (Xperia XZ)",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSE5FVXRrSUItNGZlNGduTVpyaU1sVGVVM0xDQUttejJiVzVieXlacS02ajV5MGtwbG14MnFaYUc0SkswOHJsNE9TSmJDQjdVcUlLRjl3NUE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thank you for the 5 stars, Quentin S :) We highly appreciate your feedback! We will report this issue and hope it will be solved as soon as possible. If you're encountering other difficulties, please do not hesitate to contact us :) Have a nice day!",
            "date": "February 14, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Kenny Vleminckx",
        "comment": "Vingerafdruk werkt niet op mijn Oreo toestel  ANTWOORD OP ING / Dankjewel voor de update, van zodra dit werkt, zal ik ook de app review aanpassen.",
        "date": "November 23, 2017",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSGRMMFBvUUJkWDZQUXBXRGdSZW1ZYXhtTHM1WFhWMkZOck8xQmlZZW9vY1UxS2JXelhIdHJzUVRySEFaUmkzQVVoaVB5ZjdfQlFGTHc3bHc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Dag Kenny, bedankt voor je feedback omtrent de vingerafdruk scanner. Bij sommige toestellen heeft de update naar Android Oreo een storing veroorzaakt ter hoogte van de vingerafdruk. We hopen dit tegen het einde van deze maand opgelost te hebben! Geniet nog van je dag ;)",
            "date": "November 23, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Robert Pretorius",
        "comment": "Fingerprint issue with Oreo is still there, using OnePlus 5T.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSDhGY1JhNnc3c1JyNHVGV09tR3RXS0lpcDFHa255elJNb0dUR2ZGbTRNYXBCUmMwMURTODU3S2l1ZjJ6V0xXNzdBdG5ZT1RfWV80V2xVWWc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Pieter L-S",
        "comment": "Buttons frozen. Please don't refer to customer service it's obviously a bug if you read the other reviews. Can't log in. So please inform the app. Devs about this.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSHp5a3pjNm40RGVlenJTeHFCTHVwRXR2d2o3M1RXMVA2c1I2b0kyYjdfcDVYZHlBa1BsYWkwSERYZVc5TGRydHFhdGw1WG5lSkNaazVRTUE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thank you for your feedback Pieter! We will report this issue and hope it will be solved as soon as possible. Have a nice day.",
            "date": "February 23, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Cosmin DÎGĂ",
        "comment": "I don't see my business visa cc in the cc section.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRzd1dzVYR3MzdzZPOEF3cmRtMGdxOXlweWNwWVhrVUp4bUh0WmVaVU5nR210aE1hQ0ZBdkVUUWdpTDZsUDNaM0trTGF5UVpRTjlNNHFzN3c",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Indeed, it's not possible for the moment. We will inform our colleagues about your remark. Have a nice evening.",
            "date": "January 11, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "Fingerprint ID not working for android 8.0 Oreo with oneplus 5t with app version 8.4. For all the others, good job!",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPSEJYeXlsaWpsMHpxa0x6Q1BSSFhQQ2plNWJkWHkzdENpSnJYZ2VhRmYtVlhPdDYtTFpmWk5rVUM4VmpCNkduOFNVZHVsOHJJUHhGaFNVcXc",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Thanks for the four stars! If it still does not work, do not hesitate to contact our Helpdesk on the 02 464 60 04. They are available on working days from 08h00 until 22h00 and on Saturdays from 09h00 to 17h00. Enjoy your day.",
            "date": "February 7, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Djamal Bouchema",
        "comment": "Fingerprint login Oreo not solved yet. Oreo 8.0.0 on OnePlus 5 OxygenOS 5.0.1 It worked on OnePlus 5 before upgrade to Oreo. And it still works after the upgrade for Belfius and for hello'bank",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=MyING.be&reviewId=Z3A6QU9xcFRPRVdUZnlTemlpR3N1cHNyQlI0SHQ5WnR4bUd1Rk9LZG5XaUdUN2JkMlJZWVpZYTIxeFRia3lYMkttM3lBV3FyeE5KaXBQT1ZZQWJkam9qNFE",
        "reply": {
            "author": "ING Belgium NV",
            "content": "Hello Djamal ! The Fingerprint identification is already active on Iphones, and for some Androids also. More and more manufacturers are implementing Google imprint technology, so the list of accepted Androids will grow in the future.",
            "date": "January 9, 2018"
        },
        "star": 5,
        "title": null
    }
]