[
    {
        "author": "Arun Gupta",
        "comment": "One of the most worst customer service i have ever seen. I am contacting them from last 3 days but they didn't solve my problem and i also message them on Help & Support but i didn't get any reply. I am facing a problem in KYC verification. Whenever i try to verify my KYC it always shows error. I am using Paytm from last many years i never expect that type of service from Paytm. I am very disappointed with Paytm.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRWpuSVJtZjNpQVlqVi1CNGhPMnBkd09URUwzNzlxeDlfdHN6U2pIcW5jYXp4aXV0N09xVUZrbUJ4aVJZTldaVndiYndDM3FVWFMwRE9HTFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Getting worst day by day... Y do we have to link our documents to send our own money.  N crashes ever now n then first improve ur service... no customer care service ur call will be hold fr 15 min n even if you get dem dey will transfer to dis n dat department. Firstly improve ur service after dat ask fr all ur cheap processes.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR09NNFhJVlF5Y0RaSktyai0xYnpGV0k1MnJ6RXB4dEg3YWVlVkdHRUxkaVFCVzFsWDdUQ0J1aUk5bjg5YWh0ZU4xZGdrQmxVUXFmNWYyZnc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Munmun Jana",
        "comment": "@ Paytm you people are worst poor customer service. Its been 2 weeks, I am unable to  add money in wallet after  several attempts. Every time it shows failed. Already shared email to you but no response from you guys. I can see many complaints about the same. Are you guys sleeping. Why are you not resolving the issues properly? Number you have mentioned not connecting. No cash back after completing the KYC process. You are pathetic...",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSC1wa2RRblpWalh5UGMyeWkxS2VxLXFlWnhfOFlxcXpCQUk0S25BVFV1M3R6V1RGd3pKb1hrekR6V3lOWlRybVdaZ05QWk50M1BiZVdYWGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "saheb roy",
        "comment": "What the hell man you were my first choice in mobile wallet but now after providing all the details i cannot add money into my wallet... I don't want to go to any store and give my documents for physical verification as it will  be a risk of personal data leakage. Do something or else many people will abandon this wallet.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRlNhUjVRb1ZNUGZlVlBKRDhvRnJxdjVFaXZRcnVwN1ZaUHhnakItR0FFajVoZFZveVJRcWZ1blBBSXlGbFFkVlhzWWhtSUlhYTcxdDc2Z0E",
        "reply": {
            "author": "Paytm - One97 Communications Ltd.",
            "content": "Apologies! We will surely check and get this issue resolved. Please share your concern with your order details, registered email id with us at https://paytm.com/care. We'll be more than happy to assist you :)\nThanks,",
            "date": "November 29, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "The Online Store",
        "comment": "Account blocked for past 20 days. Contacted customer care and sent all the documnets they asked but no one reply after semding the kyc docs. And account is still bocked. I have sent mails but no reply of that too. My business is going under loss due to this problem. Looking for alternate wallets.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSDFHdHRtVzRRejRjRmlTUE9yQVJQV08yNkNDZmFNeVZfeDhjWWI5ZU9VLW5sMEVOX01yQ19ZdUR3OFVJakl4WTd2bGM0Ymx4MVBJZThNeEE",
        "reply": {
            "author": "Paytm - One97 Communications Ltd.",
            "content": "Hi! Thanks for feedback. As per the offer 'Terms & Conditions', the processed cashback is decided basis a lucky draw, picked by the system. For any further queries, you may call us at ‘0120-38883888’. Thanks!",
            "date": "April 28, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Dil se Dips",
        "comment": "UNABLE TO ADD MONEY For the past few days I'm not able to add any money to my Paytm wallet through my debit card. Whenever I try to add money the app doesn't let me write my complete card number & then it says invalid card number. What should I do?? I've registered my complaint also but there's no response.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR1FodjNLUzhoTm5tTjhBRlpqSHVIWHoybFR5djFTdmNhTERjMWQtUlhiVF8zbm5jNWlNSkNtZTRkQUxBY0poanV1OVNseWRZZkx1dUxFVXc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Devashish Bhagat",
        "comment": "It's the worst app I ever seen. WIthout my permission 105rs has been debited to a company known as nano wicore lab pvt Ltd. I will recommend not to install this app to my friends. And this had happened in just 1 day two times... So cheating app..",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRlVlTTlQTG1LX3RyWTNKbTFUNlh6QlA3ZFprVlp5RjVsYmNseW1oQlQ1MmFsUzNMRTAxdVZGVVAtT0t6akY3ZTBBNVV3LU0yVE5nNGktQnc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Saswata Mishra",
        "comment": "Have been trying to reach customer care for over an hour on call. No one is able to offer a solution. Emailing support doesn't help either. Transferring money to account is almost impossible now and paying someone else is very tedious as well. App freezes quite often and doesn't move forward from confirm screen.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR2dtNC1wWjRDS19mZGUyX1hHRFJIVWxhYUJkWGVkaDF1RTNOeVd1emJ5Zi1ZQUVKbUpLekU2RkFxRDdLajYyNnY4TkM5b2xoX0dYQ2RSY2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Satnam Singh Kalyan",
        "comment": "Already 48 hours complete for updating KYC. But still not verified by PayTM and still showing \"it will take upto 24 hours to confirm \". VERY BAD SERVICE GIVEN BY PAYTM.  Fas gya PayTM account bna kr....    Advising to everyone pls use other app instead of PayTM.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSHVuTVFpejJPSVpNX25POEVTbXdpV1FjdVFvcFluaTFjY3FrbE9CUkl2RmlxMjFzam8tS3VwVFdCZzdNYTVsMUxHTXRfQWpMOUpzNDJMQ0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "payal mandal",
        "comment": "This AAP is so bakwas that I added some money to pay for an homedelivery order. And think.. this AAP is worst app. I don't know why I started using it. And if I have not completed my KYC. Who gives you the authority to block my hard earned money. Your services are pathetic. You yourself are pathetic. You will not grow untill unless you become a customer centric company. Grow up ***##@@@@##***.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSGFVbnN1M2xXd2FLUkx3Ulo3NHBiZUdvZEFjMzF2bVJDNmUzdFl3R1Bua3FvdVJ3OWk3ZDJTU1pFVDcyUkVYWDM5alJ4cDg5dVdZdDR6bFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "RAndroid Gamer",
        "comment": "Its not working since 2 weeks I thought this maybe something error so I logged out from my paytm then when I tried to log in again with correct details its say 'Network Connection error' every time even when I'm using the faster internet like my 4G data and wifi. But at the same time when I tried to log in to my account with my fathers phone and other family members phone its logging in successfully. I think something error is there with paytm and my phone. My phone is Vivo Y15S Lollipop 5.1  Please do reply",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSDY2YTREOEJ2clgyT2pKNUZESXlFQkxwSWRjTFAzM3Q0Wm5VNkszTTRndWFJdjF5NGpJZE1yZVdOS01BYng3VXJzb3AwQ3ctMFFGeU9kZlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "prasad karthick",
        "comment": "Very worst in providing KYC and customer support. I did KYC with biometric verification b4 4 months but it doesn't reflected in system, raised a ticket for the same no proper response. I requested for representative verification once again before 3 months no one responded me. Now unable to verify with Aadhar so raised a ticket no response till now. I alhave waited for KYC to happen for the past 4 months no one bothers. I don't see these type of issues in other wallets... So I am going to close my Paytm due to the above issues.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSDlWeXhlY2hsd1JoQ3phQWp0UkdjR3o2YTB6Z29fYUF4dWxmQnh6Tk5xZnNZb2pHczhwc1Q1YnF3VHAxa0VkNm9NLVlJVV8zRldpOURVOGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Vineet Aggarwal",
        "comment": "Cheaters and scamsters. I completed my kyc using driving license, but everyone is asking for adhaar and pan. No other wallet is asking for it. Trying contacting support, which is again a joke as no one picks up phone. Trying to find out how to close my account.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSHJYT3Z6ejJtbEFoTllrR3N0ay1PVFdIZ005Um9UQ0g1bFN5eGRUR3hJRV91RzI2N1RLc3RDbWhXbmdmMjcwQUM5UHNJdFkzSXVSNTkxQXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Snehal Gaikwad",
        "comment": "Changing my rating from 5 to 1 due to poor or no customer support whatsoever. Neither they have a number to reach customer care nor they answer to your emails or query/tickets raised through their app. I have a rs 500 gift voucher from Eatigo that I have added multiple times over the last 8 days and i receive notification that voucher was added successfully and the amount will be transferred in 24 hrs. No amount has ever been ever transferred against this voucher yet and my 3 emails and 54099498 query is answered yet. I don't think Eatigo is at fault here, so i dont have a despute with them on this matter but paytm is not interested to pay any heed.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSFhXdmtMVkdKYXJmZG9hakVfTmpRODdBbDZfMDBGN1ZBcFMwaWJ2dVY0ZF9VVGN2QWtKVEM1Ylg4SmVZSlJVRmoxSTNCbXEzNThDUHZSSlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "King Leo",
        "comment": "The worst app I have ever seen, it has worst of the worst customer service. There is no service to contact with customer care operator so that can explain better about our problem, either it doest not provide online chat system such some others provide. I have paid through paytm and my order  didn't get place. How can I get my amount or how could I reach.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRlZtb1I0cldZQWJOWGFaNGE2M01ndzlLMS1fLTRpWlVyUmUyTHJ3dmdEWXI1OE1ib0xZQ0drTEhCTTNGbDFCOHUyRS13MWtDaFdlMXpZOGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "neela kantan",
        "comment": "I'm unable to transfer to anyone. It's blocked nd asking to complete KYC over a month no representative has visited my place nor did not get call from paytm and also not able to speak with customer service helpdesk. Call is not connected to help desk. I'm helpless without solution.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRnQ4UXFvRnJFdnFkUFdtT19fUVd4YnZyaWdtUFFvMWU0N2tHOUFKS0FZWTdwYUdMWDJ3NDFSQWRsTzhiSHhPcExqazIybVpSRGRkR1IwVFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Shubham tiwary",
        "comment": "This app crashes everyday I mean I use TEZ app and I've linked my Paytm account to it. But in every transaction or always that YOUR BANK IS NOT ACCEPTING ANY PAYMENT and always has a low server. Please fix this otherwise I've to find some different account",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRjRLdWFXOTJNQXEzd09CaFBfdVdNYlVYVG1LS3VaMmhVaXRfeUxNc0h0eF81TjNaQjI5a3BkcTk2bDdSdzczLWJXLVBaMXk5S0EwZTNDaGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sasikumar M",
        "comment": "Fast... and easy... I love to use.. easily available even in roadside shops.. that's proves that its status.. Payments bank its one of the best initiative. but now I am facing problem regarding BHIM UPI... I am not able to change UPI pin.. It ll be useful if you revert this problem..",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR1hBZFdsVXNsMm9wSGtFeC1kbDhsQjlfcXhjMU80V0dJdWJqV1lmcVQ0cHY1YUgzdzg4UXJGeF9CRjgzdnNNOHZCSVlVRkpTUTlDSmNaWFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "RITESH RATIWANT",
        "comment": "WORST CUSTOMER SERVICE ever experienced. I have an issue with closing of PAYTM payments Bank account. Its have been more than 1 month and 15 days but still it is not closed. If they really work on my issue,it doest take more than 5 days.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR3gweVlPY241ekEya1ZZT0Y0TnFPVVc1ODRmMmFXUVJKcW82XzdMYXlhS1VMcnRkaW9idC1CVXNoR2NicC00ZTVCS3ZQQWhDaVJuUjhIaHc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "sai krishna",
        "comment": "It's been 3 days I sent my wallet balance back to bank and they took my wallet balance and didn't send to bank. Worst customer care service  Worst calling interface They will ask you type wallet id transaction number and mean while you typing they will say time is up",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRnFSWWI0RzJnRlpJbTJwMTFWYURVNnFXUngzTXhlVUVVa0tvNGtDQjZuUXdFQTliZG5sOVpxR2NyVHZ6VXU1Ui1STVZZVS1wN29hU0N6X1E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Pyali Chakraborty",
        "comment": "To be honest they embezzle customer's money and earn interest. The customer care is fraud never reply.CHEATERSSSSS. I paid money using paytm account it has been deducted and received by paytm but they didn't reached the account to which I intended to pay for. Now the customer care is silent for last few days not a single reply. Order ID 17977",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR3htTi1MT2NEWUsybUM5YjZDT2VWYXZ3ejdsRmdYRzFxT3BwUDU3T0NFcE1ZaDRFcXRSRmEycExadGg2bzRxU2NpTWxsWjVybi1oUVNhM3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Parantak Sharma",
        "comment": "As now that we can't use wallet without completing KYC... So many people will not want to use Paytm... So Please provide option to delete (not deactivate) account permanently and completely. As there is permanent delete option in Facebook, Google, PayPal etc.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSGV2dHlocV9zNVdFSU42UE1oWDNvVUtJVTRRNG5KZXBNek81YVJ3bTdSbFNsa3RPeGdRNTV6LUtVZW1IS18yN0phNGIyZ2tzdE1TUlJISkE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Labdhi DOSHI",
        "comment": "My account has been \" temporarily\" blocked for months now and even after several attempts to contact customer care, my problem didn't solve. I also sent them my identification documents when they asked so to verify the account but with fail they took no steps. I didn't expect such a careless customer handling by paytm which is such widely used. Highly dissappointed. And also i had money in my wallet which is the main deal.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRkF5NWVxajBnQkU1cllHUGNBZW1NYnBmT1FBWEFsNTZKYUFWQ0NoRzRQTHdWRlhWODBsVElvMzMwOVJ2MURGd2ZJdm1iMTJnaUl4emRiZXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jagdish Chandra",
        "comment": "One word. Pathetic!! I ordered pen drive worth 1000 and one the  day of delivery, the delivery guy canceled the order. Then the refund process got initiated and I got 123 rupees. Tried reaching customer care thru various means but no use as I never got connected.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR0I5aWNZcDNEMHJOWXgxU3M0bExIdzZPdDllZUhkeVhCZFRjTEVJUEFDTXBOMjBseXhFRWd5RV8zRThzWkdiSHlIWTZfVkF4ckRlYlBtbEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Why am I not able to add money in my wallet? getting an error (please try with lower amount or different payment mode. Transaction limit will revise as you continue using pay TM) Customer care executives are not able to resolve this issue",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR3NWUklTNGZLS2s0WmwwVTZRUE95S1QxVzI4WlJVRlhhVFcwS3R2V042cWtGdUxYTk1Cbk9vbVpTTVpOZWY1WTNXamtXQlpFMi1YUlRKSHc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Aman Sinha",
        "comment": "Make Paytm Payment app exclusive for payment option and payment bank remove the options for selling products of Paytm mall. You all are ruining our user experience. For example se phone pe app how well organised app they have made , your app is very poor in user experience.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRnBhcEJGcXZSUUNwcEk0YmpRa0NoeUZkaVZyN0FvYjM0dHdyTUx1MUplYzlwbHFfTEdTbmRUYTEtYzJyalpSeWJ3NEJsTWhnQzVwbTZKSlE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Rahul Singh",
        "comment": "Deducted 500 rs amount on failed Dish tv recharge..but Not refunded back  to my bank . Query ref no: 54312563 Now they are saying to wait for 14 days , and if not received then contact to bank.  If they are not able to refund or recharge then why paytm is looting people hard earned money.  There is no any customer support. Totally fake app",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRlRMWnBJU0YzY2dLRTFmNElxRlg1ZFl2RWF4S1FXTk5kQTQ5T0hURHhUTVd2cUlrTlpqSG1wV080czhBWmstVlJEYk1MNjFQRkhTRWdNR1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "lavanya chowdary",
        "comment": "This is the worst shopping app I have ever seen.. iam trying to contact the customer care regarding my order issue from last three days.. but not yet.. packing is worst.. customer service is worst.. quality of the product is worst.. the status was not updated to delivered even after three days of the delivery.. least they are not attending the complaint..",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR3ZSeWtuT0ttM3gtMWgyNXl6dWc0bUNUSWdtR1VNLVlsSlFJYWk5TWtZQk5HTVdEM3Y0QnpuUzN0OVNCcHhXby1Vak9WVXhIdVdUVmhwVFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kalyan Tarun",
        "comment": "Dumb ass app ever! Can't update KYC it's always crashing & says\"some thing wrong\" or asking me to login again & again every time i open KYC. Bhim upi is also not working. It can't confirm the  my bank account & every time i try my balance is deducted for sms but process is failing every time.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRndtb3IySXN6QWc0RW80MWRwMDdVX09FcWRkN2R5NUVuTW1lb3BjbnhrbW9qdURVVjA5NDFqNkFRRGFPT1lOSHJyaTVHU29LZ1U4RWk0cEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "J pathak",
        "comment": "I did my kyc last week and it's still verifying the details with a message that it will be done under 24 hours. How many 24 hours do you need to verify the details ? Annoying.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRWNoeXZ0Z3JnX3ZLdXY1cjBWZGZUOEstaF9xTXJGQmV1TnNMY29ZSE9wQWgybGxjZXRYWF9MQzVocnBTODQyTWJkQzQ5R0NWbkhjMHhmTFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Pratik Lakhotia",
        "comment": "Your payment system sucks when it comes to booking for tatkal tickets. You send OTPs late. Repeated attempt to login but of no use. Couldn't book ticket only becuse of you people sending alow OPTs. Moreover taking so much time log in also. And when booking tickets through your app it IRCTC account verifying but nothing happens. Please provide connecting account to IRCTC app permanently. Saves time to log in and pay.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRlUwbXZWOW1OVHpmdDVHSjhXaWxLUjRWMXZfaTVaOVZKM29tampMbUhNOUZwZ0RZNkpsR3phY2ZKRWlhNndmb1FjN3lnengxTmVsN2c5b3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "narendra raju",
        "comment": "It's fool the people.. If kyc process completed.. actually it will give cash back.. But it didn't give cash back even though  Transactions are completed using upi...so please don't use paytm bank",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSEd1dFd4emJoT2ZjWGp1VEt5ZXVjQVVrRXdiWXlRQm16bjRJTGtBZU4yX1ZsS3lPWk1pRnVkUmNXemVTTm9PYU5ZOG4zSjQ1ZmIyYzA5dGc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Arjun Nair",
        "comment": "Not a user frienfly app.  Wanted to talk to a customer care executive and trying to fo that since a very long time but theres no option like that. I wasted a lot of time. Paytm doesn't even reply to the emails.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSEwzeC12MHhjQ3N5WHZmOHFvTU1PZGowNFVPREdjNVc4OFBKbDdHQV9CWF9mVVNsWXh4TXdfMl9jT0MwZ25qNGNYeWF3MDlfY0lkZS1xYVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Mandeep Singh",
        "comment": "Bakwas Disgusting... I'm not able to complete my KYC.. Customer care milta hi nhi Ek bar mila bhi tha lekin bina baat kiya phone kaat diya",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRUgtYW5Nc0ZZcHdxRlZIbG95c1VIS3ZOcS1xSVk4eTAwcXk0RDFyNlE4UFpnRi1weDZjQXlSMVpqaUZlZ25pMk5DQWt2Skh1MTdKUkdBVVE",
        "reply": {
            "author": "Paytm - One97 Communications Ltd.",
            "content": "Hi! Thanks for rating us and sharing your review! Bringing smile for our users is the only goal of ours :) In case you have a query, do not hesitate to let us know at https://paytm.com/care.   \n\nThanks!\n  SS",
            "date": "January 31, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Asish Mandal",
        "comment": "Do you want me to use abusive language in play store?? KYC pending since 9 days even after submitting UPI details. Many tickets created, all going unanswered or copy paste answers. Tring out customers patience?? Do that at your own risk. Let the Whatsapp UPI launch, then you will find out how much time it takes to complete minimum KYC for wallets.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRmdGYnkwZ1VFbkJvb1ptTG44d0Fxa09mMHhzQVdYWUlMcTBhX0hyOVJPZEtxUlNZbzFsLVlCSnczVG1oTzR6cjM0dHpwLW1IdVpFTDQzOFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sujit Gawand",
        "comment": "Worst customer care ever. Please change customer care service number to Tollfree number, due to above no lots of balance is wasted for paytm customer care representative take call and resolve problem. Last time customer representative takes more than 10 minutes to respond call nd 6-7 minutes for conversation. So my ₹12-13 balance is wasted. Please start free customer care service like Flipkart and Amazon.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR2VHY0Jqd0pjdzdodTlGazJ1LS1oMTVyY0ptZHJhYXZxWXpQeWVsbG5wVXY0MFZCN1VfXzJhNm1sMnVWdDVENjNoVVBOX2JnUTVCWWNDT3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sourabh Patil",
        "comment": "Only good for recharges and bill payments. Shopping is the worst on this app. Can't apply promo codes on most products. Deliveres are too late. Large selection of ultra-cheap low quality products available. Bad.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPRkZEbTROeVlhVkNwU1dMNGNoa2JWWXNNQjI4UWtMbzhhT1JRUHJ5WGpKV2JXTXJVdHJfZzRfZldVNVNUbFJxeWVFQktOeGZtRnRrWFUtcWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Shibam Gupta",
        "comment": "i am unable to transfer my money to my bank account, when my wallet balance is 5k, why are you redirecting me to add 5k again to transfer to the same account... disgusting. your customer service is poor, call gets disconnected automatically.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR2FHZTN0bzVRcUZmTGZyUXBkdmhtYVp5ck4xVlM3R3cxNGVJbWtlMzN0eGtLVEYtRWRFaVZIYm9JUkM0Vk84UUxweXFGUEFaZzY5ZUxJc3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "krishna najmi",
        "comment": "Why I am not able to talk to customer care why it's taking so much time from last 2 days I am trying. Why i didn't got cashback after completing KYC process. Didn't expected from Paytm customer service will be so awful.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPSDlha0dXUzY5VVJYOGVTM2UyUWl1aTR6aGcyRTBEZjlwUUttaVZ0YmpaN1hYdE5HV3pqeWd0SW1DUVdSRkxNRXFfRFJUdVlmMHFyWTd2Qmc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "NAYAN GIRME",
        "comment": "Not received disputed amount back in my wallet. Very poor service by paytm customer care. No cuatomer suppoet at all. Despite of regular follow-up on mail, twitter  no response from them. #Boycott_paytm #cheater #fraudsters",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=net.one97.paytm&reviewId=Z3A6QU9xcFRPR2RiMy1ySzZzeGJFMEFtcFEzVktlWGxoRzhMYnZUNEszUXJwTUNpZmVQSzg0TDFqN29vbUZuOFVfbWtUSDJXR3pvR0ZjMmpHcFlJbkZKSEE",
        "reply": null,
        "star": 1,
        "title": null
    }
]