[
    {
        "author": "Scott Bird",
        "comment": "All the temperature readings are three digits saying it's 525 degrees... What are they all 3 digit values??",
        "date": "August 4, 2017",
        "permlink": "/store/apps/details?id=net.ddroid.aw.watchface.mm01&reviewId=Z3A6QU9xcFRPSFFISF9aX3U1a3lYTy1MM2RBTHlIQi10TDNoVGpGTWg3SkNvNnJ5aEJEYUNqY2JMV191MHgwN1RDdDh1Z1BpQW5wZnE3QnYxZmpWbVFqQ2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jameson Suiter",
        "comment": "I am an over the road truck driver and I like to keep the bottom time on CDT, which works fine. However, I tend to cross time zone boundaries on a daily basis yet the only way to get the local time to adjust is by changing the face to something else, then changing it back. Clearly this is a problem with this face as the other faces don't have this problem nor does my phone itself.   Also, as noted in other reviews, the weather seems to be arbitrary as to whether or not it shows any information. Please fix..",
        "date": "May 20, 2016",
        "permlink": "/store/apps/details?id=net.ddroid.aw.watchface.mm01&reviewId=Z3A6QU9xcFRPR0RjUUxsV1ZtZ1BTY0x3WWYzUmRQUjFsazRWd2ZxRjQ0cENqVzFzOXNrLXVRTnptcUNvMjVhcEsxbXFFWUFHdzVWRDRxSENHMzcxa1o3cWc",
        "reply": null,
        "star": 3,
        "title": "Local time doesn't adjust/weather seems arbitrary"
    },
    {
        "author": "Skrill Dilly",
        "comment": "Weather is blank and has been blank since purchase. All settings are correct so the only explanation is on the backend. Watch/phone battery status readings is super small and hard to read. Font definitely needs to be increased. I have 5 of your watch faces and you do great work. Just please be fast and fix the weather update issue. It defeats the whole thing... Watch Face is draining battery while on charger. Watched my battery empty literally. Please fix this and I will purchase again.",
        "date": "August 8, 2015",
        "permlink": "/store/apps/details?id=net.ddroid.aw.watchface.mm01&reviewId=Z3A6QU9xcFRPSGlmNnVudzVWWFhTWkhmNlNXblhuX0R4VnRQc1dZMC12YVpRc0YxS3dxQWVhaHFZa1FLRFpMNmMtSXhNVUpmN3hCMGY3XzNJUktxZE1OR0E",
        "reply": null,
        "star": 1,
        "title": "Battery status is small, Weather won't show"
    }
]