[
    {
        "author": "",
        "comment": "Overall this app is ok, but it stopped login via fingerprint. Every time I enable this function and next time I try to login with fingerprint it tells that my settings vere changed and fingerprint access switched off. But I did not change my fingerprints settings. That's kinda annoying",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPR0hybU1GOVZsVXp5bzZqeGlYQ1laRmF3S0F2cWtJMkpCNjZMbXZFTk9ZX1dTNlI5RXd2b2ZvV1ZBYlJTSDhYYzBBYlRjaHFlNHdpUmg3VHc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hiya! Thanks for getting in touch. Our understanding is that issue is fixed in Android 8.1 - is there any chance you can update your operating system?  Thanks so much, ^TB",
            "date": "February 26, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Lance John",
        "comment": "The ultimate reason for my rating is due to the fact you can't screenshot anything from the app. It's your account and you should be able to do as you please. I have seen people on IPhone having the ability to do so but not samsung. I also know for a fact you can screenshot on other banks apps. Please rectify this security feature in your next update it has really been irritating for so long now. Once you have I will change my review. Cheers.",
        "date": "December 22, 2017",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRm9oRjdhMHRXVzNUYUlmTXlRUE5FM1p5enJjemJTUVN0aXljeHdOVGc2Z0c1eEE1cFRpdHhqOTRzS19ERnRzb1ZrajE0dEJwVmttbGdMRmc",
        "reply": {
            "author": "ANZ NZ",
            "content": "HI Lance, Your frustration is understood but I can assure you it is for security reasons. Android and iOS have different security levels, which we need to cater for differently. Disallowing screenshots in Android ensures that no malicious apps can read/view your goMoney app.  Hopefully you noticed the share function within the app?  Cheers ^TB",
            "date": "January 7, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "fitri zakaria",
        "comment": "Hi, this is a very good app. I have been using it for about 4 years already. Updated constantly and for every update the usage of this app got much easier and more efficient. I really appreciate it. The only problem for me is that, i cannot switch or install the app to a new phone since i moved to another country.",
        "date": "December 25, 2017",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSE00NXhTNEdrczRkR2xNQWV1S2gyUVZYbFdsWV9qa3ktUVBNLTBxQzAwMEQyWG1qTVVzSzhSZG9sa2tlSEh2Z0NYX1k2VFY4N0lyTUZqTUE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Fitri, Thanks for the 5 stars and great review.  Try these steps re the country issue: \n1. Create a brand new Google Play account\n2. Set the location to New Zealand \n3. You will now be able to download ANZ goMoney New Zealand \n4. Switch back to your original Google Play account (if you wish)\nCheers ^TB",
            "date": "January 7, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Naomi Ambrose",
        "comment": "Hey ANZ, great app. Please can you add an extension to the app that tracks all your finances and categorizes them so you can see what you spend money on? And can work out stuff like how much leftover money  you have each month so you can work out how much to save etc.",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPR1RQZkVveENGc05EZFJaY2U3dlFsZWpLeGdTQnpsQWdsbjFGS29DbXIyU3FpdVdxazR4RklGM3FKR0ttZzgzU1ZiQUQ1Z2FfOU9TdkZFNmc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Naomi, Thanks for the great review and suggestion. It is definitely on the radar. Watch this space. Cheers ^TB",
            "date": "January 7, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jorge Rincon-Romero",
        "comment": "I love it but... Last update came with errors in the search bar. When I try to retrive payment records, it would only show the last 2-3 payments and when I hit the \"load more\" button nothing really happens. I then decided to search manually , and when scrolling down, it jumps from Dec 2017 to Dec 2016 ?? Please help to fix this. Thanks .",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPR2FYc0dsRFRSSTBfQ1NaYlNkNmRkSG4zNXNlaG85alVtbF9yRUtqS0lBakhSY19lRkxRaEdWS2I2ZU02akVyY0RFdjZYaHc3OVJnallrZWc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Jorge, Thanks for getting in touch, that is certainly unusual. Would you please email us your customer details at mobilephonebanking@anz.com so we can investigate?  Thanks ^TB",
            "date": "January 30, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Wang John",
        "comment": "never seen such a stupid app. Everytime a new fingerprint is added, have to uninstall this app and reinstall it again to make it work. Otherwise no matter what you do, fingerprint does not work.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSEVWc0J1M0U2R2RHRTNkcHE2VnNnZHhucjl5WWRWaUVNN05md2VyY2Q2dV9xS3ZHV3YxWkRDY05LOTFRcVBFeV9JV1A1NTNGQnkzbE91ckE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi John! Let's see if we can help you out with your fingerprint issue!  Please email us your customer details at mobilephonebanking@anz.com so we can troubleshoot with you. Best regards, ^TB",
            "date": "February 6, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Pete Haddad",
        "comment": "Having abit of trouble adding an anz  card to pay wave any help would be appreciated otherwise app is awesome highly recommend... Keep up the great work...",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSFdOcHEwVmwycDdVLUJ1WkIwSHVwZ1B6TEhDOXF1RzVKOGU4SGVnelNhd2pERHJrNS1yQWNWZkhKNzBwdUJGWUNteXlZdXdXSURDMmo2N0E",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora for that Pete!  Just checking you are on the latest version of Android OS?  Send us an email at mobilephonebanking@anz.com with your customer details and we can have a troubleshooting discussion and hopefully resolve it. Cheers ^TB",
            "date": "February 7, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Marcus Ball",
        "comment": "Great app. Definitely one of the slicker ones offered by a bank in NZ. Do you guys have any timeline on when you'll be expanding wallet support for the u11s of us out here? Would love to use that feature but only old htcs are supported :(",
        "date": "January 15, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRUh0VndQa19tMmNwNGNlTGh5YmNPTjhObDZEWXRtaUNKWXVLZEpQSE0zLXFBZVJrejJvX0hXRGFlcWNmbTMwTTFQcDJmbE1yaGJqLVpId0E",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Marcus, thanks for the great review! We can add your device to the goMoney Wallet list if you can please email us the model as it appears in goMoney under 'settings' just below 'Terms and Conditions' including any capitalization & punctuation to mobilephonebanking@anz.com.  Kia Ora ^TB",
            "date": "January 16, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Eddie Marrett",
        "comment": "Of all the personal banking apps I've used this is the best. It's well designed and very feature rich. If you have an account with ANZ NZ I would recommend using this app. Further feature requests: very few, though being able to see the current interest rate of accounts I hold would be very handy.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPR2FLNi1YemhfRmw1U0FtOWh4WUJ5Y0NKcVVoQkhITWlySkxIMVJKekZxZXFveHFlbmZwSy1BcTczdWxPUzA5ZkJBcldiSnFESlZhZGlHeWc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Eddie, Kia ora for that! We really appreciate it and yes displaying interest rates on accounts is coming! Stay tuned for this in the near future. Cheers ^TB",
            "date": "January 7, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Ben Kennedy",
        "comment": "The app works well and is updated constantly. Mobile payments with my phone are very easy. It would be great if they could add an account option to Wallet payments instead of whole cards though.",
        "date": "December 16, 2017",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRTNhWmpEVUJsbjdiaUIyQ2ZMY3o0TFhKS0hKcjlLRDNlM05UcU95UklRMmR3STI0dTBWMVRFQ2VESTdEWkp0RnhDcEdEM3VBb2doQ1VZREE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Thanks Ben for the great review and comment, I will pass it on.  Just a reminder that goMoney Wallet will debit your \"credit\" for \"credit cards\" and your nominated \"fast cash\" account for Visa Debit. Best ^TB",
            "date": "December 17, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alan Potter",
        "comment": "How come transfers between accounts that are scheduled take 24hours to show up..realtime right away...",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRktjOGxjWmZmdWVGcnV3bTNEWnp4QW9kSEpfaVdaNjB4bGJxVlU2MzBvMmdabnVNcUgxLUNmWjROV1FqNWJzUnB4XzgtZFNWRWEwLU5BMEE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Alan, can you elaborate by emailing us at mobilephonebanking@anz.com so we can explain/discuss any concerns you have? That would be most helpful.  Is this funds transfers between your own accounts including a Credit Card? or Bill Payments to other parties? Is this during the week or during the weekend? Cheers ^TB",
            "date": "January 23, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Very reliable and easy to use, prefer this to logging in to online website. Just wondering if they will consider building a Bonus Bonds app to track activity?",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPR1VGVTU2V2pjV0FaUVlzT0lRcTBtS2wwR3lBbkJ0cFVwa1VDdzZ5a1V0aElOalE1WVMxamZ1Umd3WUp6T29BcmZrb0J3el9fRV9YMXBRdXc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi there! Thanks for your review and providing the suggestion re bonus bonds.  It will most definitely be recorded. Just to clarify, are you saying you would prefer a separate app just for bonus bonds?  Feel free to elaborate by emailing us at mobilephonebanking@anz.com. Cheers ^TB",
            "date": "January 28, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Osama Adnan",
        "comment": "The App is excellent. I just have a few questions: 1. Why screenshot is not allowed on Android while it is allowed on IOS? 2. Why sometimes the app alternates transaction dates to one or more days prior to the actual transaction date? 3. Why the balance is not shown in the first interface instead of checking each transaction?  Other than that it is an excellent app and very stable and reliable.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRUNhSFloUEtaeUVCT3J1VzR3ZmNzdV9PaTlPakNyYnVjMC1iM21kcHhkVmxvbWZJemd6TU9kU0MtUjBBcXJNY0R6VExzU2pHYU1DamttNmc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Osama, Thanks for the great review and questions. 1.Disallowing screenshots in Android ensures that no malicious apps can read/view your goMoney app.  Hopefully you noticed the share function within the app? 2. These are weekend transactions that get processed the next business day. 3. By design, but I will pass on your feedback! Thanks ^T",
            "date": "January 22, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mark Brooker",
        "comment": "Loving the latest update with more detail on Home loans......now if you could only make my total home loan balance disappear.......😂",
        "date": "December 13, 2017",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRjdPVnFvVXY3WGRtdnNCV2pBbklabUl0R0JGRXhpNWVjSVJyWVpRR21WQ3NlejZ5M0w5SjhUVVBnY25mOVVLNzYwVFY3VHJ1R3RXRkhOdkE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Mark!  Thanks for the great review and comment!  Happy Holidays! ^TB",
            "date": "December 14, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Andre Binford",
        "comment": "Wish I could rate this app less than 1 star. Infact I am going to change from ANZ to another bank because of how useless this app is. 1. Can't take screenshots shots, yes I know it's security reasons, end of the day it's my phone, my money and you shouldn't dictate what I can or can't do with it. Oh FYI simple free screen recorder app bypasses your no screen shot policy 😂😂. So if you worried about apps stealing information, a good scammers app will secretly screen record and you no screen shot policy can't do anything about it.  2. Finger print login doesn't work.  3. Widget is just as useless, 99% of the time its saying no internet connection.  4. And to simply login to check account balance takes almost a minute. It probably will be easier to walk to an ATM. And I am talking on fiber connection using Note8  Bank makes millions of dollars in profit but can't get simple things right in a app and fails to think about screen recorder scammers, time for new security team.",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRmZLVHNwbXBLdlQzeFZKczBqRm9VVGFhNE5xQjdzUEpLYkhFYTZUamUwekRvNkdOV0Y4TlBPcGxxRFBCYUFRTlR3Q0hLcGV3UXc2YzVSYWc",
        "reply": {
            "author": "ANZ NZ",
            "content": "HI Andre, Appreciate you taking the time to get in touch and review the app. Please email us at mobilephonebanking@anz.com for a thorough reply or to troubleshoot, if you are still interested. I can confirm there is a bug with Fingerprint on Note 8 devices that will be fixed by next release however the long login time is very unusual. Cheers ^T",
            "date": "January 22, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Jason Buor",
        "comment": "Good app. Heavy on power consumption even after I close it fully. Load more button has never worked. Otherwise it's a good app",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRXhPLTdQRHQ3eVd3WGw5emJVUjRoZkFBWDZoWFlPVG4xU0JUTDZVVzZCc2ZFSTNyY2k4TVlqdi1yenoyYWJwX2d4YmJScEJZdWo5T0dSU2c",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora for the review Jason! We are looking into fixing these issues in our upcoming releases so thank you for taking the time to provide feedback. Cheers ^TB",
            "date": "January 23, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Ascal Lacsa",
        "comment": "Overseas payment support only for some country and exchange rate and charge is to much. Need to work on it otherwise good app.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRVduSkdDU0RoVVFfQnA4bXhsRVpfd2lwTHA0RGV1WXZfNHVRY0o3YWw2cUlXWFZITktkSl9TMFI2ZG50WWwzeFFTSmhQbERaRVA1OVQ1dlE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Ascal, Thanks for taking the time to provide us feedback. Would you email us at mobilephonebanking@anz.com to explain further what countries you wish to send your overseas payments to? We are happy to review the list of countries. Currently we support close to 200.  Regarding fees we are in the process of reviewing these. Stay tuned! ^TB",
            "date": "February 22, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Monish mohan",
        "comment": "Its good app but not able to get android wear option in the settings to connect my s3 gear to make payments. Is it not ready in nz?",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRzNMM2tUTzhzRVM1SkVhMTVtMW1heWxZZW9JZy02VS1RaE5sU0RLM05hUU1LQ0hQU1ZJZHFsVjRwNnYxeUJKZFdVUGJJR1FXVTU3R3pzbWc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Monish, That's correct, at the moment but hopefully in the not to distant future that will change. Your feedback has been noted! Thanks for taking time to rate and review the app. Cheers ^TB",
            "date": "February 13, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Sio Simona",
        "comment": "Broken ass app, reshuffles purchases and any money deposited. Its fuxking annoying",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRTFxZjRfekdScjFubkFhaXZOcHFtdXpDWkRrbmFMYkoxOVkteDVfQV9DSVp2Y0JBaE9ieGtEODVJdERYd1FwX1JvbW00UEdTdXliejZNcnc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Sio, Thanks for getting in touch. Sounds to us that you are referring to transaction/payment processing times.  Happy to investigate further for you if you email us at mobilephonebanking@anz.com with your customer details. Alternatively see this FAQ: https://help.anz.co.nz/app/answers/detail/a_id/132/related/1 Cheers ^TB",
            "date": "February 27, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Nice and slick .. would like to see automated categorization of  transactions. Can you also advise when wallet would be made avlbl for Nokia 8 phones model TA-1004",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRkNHTjBnTEZhWWVnRGtnc1ptenB6bENVaksyMUx2MXlwYXl5NWtPWnF3TE1Rb2RjemhXNHVXcmZlUW1mMlE1em5XbE50WVhMUXBBZUFUalE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora!  We have added your device but if it doesn't appear within a couple hours let us know at mobilephonebanking@anz.com with exactly how the device model appears within goMoney under 'settings' please including any capitalization/punctuation; feel free to also elaborate on your suggestion about automated categorization. Cheers ^TB",
            "date": "January 28, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "abhinav vaidya",
        "comment": "The option to log in by using the finger print scanner has stopped working.",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPR3RzUXJqTUFoUXhBakFuZUhNWlNMRGg1bWRRbVV3ZmhSOUtZbG1MQnJNZ29GSmR2TGxqcDRlaW1WeXMzNUVDdVhSNXpibWdhMWN5V2oyeHc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Abhinav,  Let's see if we can help you troubleshoot that, contact us at mobilephonebanking@anz.com with your device and customer information please. Cheers, ^T",
            "date": "January 22, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Ina",
        "comment": "A really good app. Glad to have downloaded it. Is there a way that I can pay using my phone for the credit/eftpos machines",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSEl6OWlXTzNhUDRmTFNBT1RmTG9QVW9LZVNwOTh2bDZ6ejVZQ2NCOEdacmFJUmhxbUlvbmdTd0xEY0x6bnRpRWpCRDRSZGVMQ1FSY05VUFE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Ina, Thanks for the great review and yes there is a way - email us at mobilephonebanking@anz.com your 'device model' as it appears under 'settings' within goMoney (scroll to bottom of screen) and we can add your device to the list for goMoney Wallet!  Cheers ^TB",
            "date": "February 12, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "gurpreet bhangu",
        "comment": "App is working great, but i can't use the fingerprint login to log on in the app.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSHJ6Q2FmR0RzMDRKQXY3eGlpSzhjbTJhNWs5andONnB1M3VUdXZYN1pRRC1VOFJmU0ZjbUFXQnNXWTZqeVhPYzhLVHJIQVB5czRpS2VFcGc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Gurpreet,  Thanks for the review and getting in touch. Yes the fingerprint issue you are experiencing is known and has been fixed for the next release of goMoney (v.6.5).  We appreciate your patience. Cheers ^TB",
            "date": "February 22, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "On my Sony Z3 I was able to load my card into the app using the NFC feature but on my Nokia 8 this isn't possible?",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRjl5TlFFcU93QzlfeTltdjVxeUFUSVZWS1EzV1c5VzlaZEY0dGJrR1ZBa2pjYm1XTjc3aDgxNi0xZnpERnE3N1RaZEJZWW1nczFRVWg3OHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Khurram Jamall",
        "comment": "Can't block visa paywave from application,  can't set withdrawal and transaction limits, many Nz banks are offering better apps.",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRWYyNFQ1bFkteXQ1Mkw5UDljOUhoNEhlZXUxeVNpR0FCUUZQWXhqR3hxNjdWSVF4ZF8xY0RKalZsT3IySDlFdWt0bmlxVV9TcjJFWGxGbGc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Khurram,  thanks for the feedback and detail about the features you would like to see as we review all requests.  The more people that request these features the more likelihood it will be developed in the future.  Cheers ^TB",
            "date": "January 9, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Dingus Doogus",
        "comment": "There use to be a feature where you could access with your fingerprint, plz bring that back!  EDIT: Found in settings :]",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSC04dGxnay1ESVFNU1NBdVJXZGdqZXdBU0dpWDZkdVYwVDdsSXNHcXpmamRyV0gzeWhPdGZzYnI3TzZVRmNOZmtwT3NBbjNESE1oZEI1RkE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Dingus, cheers for the updated review! Glad you found it and appreciate you taking the time to let us know, hope you have a great day. Thanks ^TB",
            "date": "February 25, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Xenophon Ruet",
        "comment": "May i ask when i enable gomoney wallet why it says cannot connect to Internet？ I got the Internet connection when enableing it ta",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRzg2Vks4WkJGWmRPS0ZlOEx0WGhlZC1Dd2Zza1Bha2JxUjFtMGdMS3BReGptN2loanlmNGdzTXdWTEJQT3QteW5YMEplOU82SFNydjlZY3c",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Xenophon! Thanks for the great review and we would be happy to investigate this with you if you could email us your customer details at mobilephonebanking@anz.com.  Look forward to hearing from you, Cheers ^TB",
            "date": "January 25, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Joshua Abbott",
        "comment": "Not add the go wall on the samsung j3 6 mobile phone",
        "date": "December 21, 2017",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRUhULTFteVdJcnVQdzQzRkdmY2NabXBtTXFZSzV1VDFSdTFtc3RpS05yOE5kWHBudzlNM1Z5NTVWY2RNb3ptLWlxY1NEZ0pTU2JWc1FMU2c",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Joshua,\nThanks for getting in touch! We can look to add this device for you if you could please advise us the device model as it appears in goMoney under 'settings' including any punctuation and capitalization. Please email us at mobilephonebanking@anz.com. Cheers ^TB",
            "date": "December 21, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "peter dix",
        "comment": "The app hasn't dropped a shortcut onto my home screen :-(  but otherwise very usable.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSFlsQ0daMFZsYTFRd0o3TEUycHBDR2hqNjM3eVlqUGxhVGFLRWRYd1FuNmxmbUpyLTE5NmtDdlM0RzZfNEVOTU5TWVZEODQyOENqUGxqWGc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Peter, Thanks for the review and getting in touch.  I wonder if the shortcut was created but not on the screen you expected? To create it yourself you can long press on our app from the app list and drag it to the screen you wish.  You may already be aware of that and have done this. Thanks again ^TB",
            "date": "January 24, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Vela Matagitau",
        "comment": "Love the way we can send $$ overseas.. Used it to send to Oz less information to input less cost too.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRTJQbm1DeUw4d3RFZVBmdVpSWlpKZEZ3VFdZbWRFM2VRQ3Z3c01MVDZub0cwOGR1N0NKem9MY2NNdXh3djloMklZVUlaRXViTVZtU3lRNnc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Brilliant Vela! Thanks for taking the time to review and provide comment! Cheers ^TB",
            "date": "February 20, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Trainer Jax",
        "comment": "I can't figure out the password of my account and I don't have the option to reset it",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRzVUbmtOWkZGSmVqQ3VoMzBuUzl1QTRKWm9OTTJjM2g3ckVJT3g1RjQ5MTI3UDQyTXctM1NJNzIzLUF5WjdfU3hyWkhscDZpZXpCV2NhdEE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Trainer Jax, seems you are caught in a loop!   Let's get that sorted - click on menu and forgot my pin and follow the steps OR try a complete uninstall and reinstall/clearing the data within the app. If that doesn't work, email us at mobilephonebanking@anz.com with your customer details and we will help you out with this. Cheers ^TB",
            "date": "February 12, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "No problems app is so user friendly, thumbs up for new feature make overseas payments",
        "date": "February 3, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRkhVbnQzUTBacGN3Rk0zcERBazd3dlR2SjVWaERIQURFMFZMeTBRUE1lZDhSd3piNF9jTnQ4cHZlNHRBZWt2VFoyMkN1VHhjck1ER3BkY2c",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora for that!  Thanks for the fantastic review!  Glad you are liking the send money overseas feature!  Cheers ^TB",
            "date": "February 3, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "shelly aravind Arockia britto Johnson Sahaya",
        "comment": "In my mobile I didn't use my finger print login.",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSGdfQTc0QzY3d0g1bW5oblJtamtYX3ZMcjFsU3FvRWZZSTA5dFd3RzRyS3l5ZDVvQ25JZ2M5RUZVS1Rtb0ZsSldKanFOX1diSy14VnZaM2c",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Shelly,  Thanks for the review and getting in touch. Yes the fingerprint issue you are experiencing is known and has been fixed for the next release of goMoney (v.6.5).  We appreciate your patience. Cheers ^TB",
            "date": "February 22, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Henry Jamieson",
        "comment": "Really hope they allow payments from my Gear S3",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSFJBcEtVbFdpTEdZd29vT3pJU0JMd0lud2lyeVhRVDR3RmlzU3FHbmZQTGFZMTE1WUVuendMc0NFZUh5UkJySEVNRDRhOWdjdVlnYUdvWkE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Henry, Thanks for the review and suggestion for Samsung Pay.  We are focused on giving the best available digital solutions. For mobile payments we currently offer both our own goMoney Wallet for Android users and Apple Pay for iOS users. We don’t have anything to announce for Samsung Pay just yet.  Will pass your feedback on! Cheers ^TB",
            "date": "February 25, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "pruthvi charan",
        "comment": "fingerprint login isn't working... tried to activate it again and again still no use. kindly fix it",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRTJtdERudDBZNHZHbVpLQ2JmOHJsQ2h5aEFieVB4RnNIdVVyWDRmZlRTMEFvb1hBNjUwY3R5VHlHRnJSbnlCUDRIbWs5RE90c016RWhQVmc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Pruthvi, thanks for getting in touch and I can confirm this issue with Note 8 running Anroid 7 will be fixed in the next release of goMoney. Appreciate your patience! Cheers ^TB",
            "date": "January 16, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Tony Tai",
        "comment": "Fingerprint function no longer working, still no update after providing all the details.",
        "date": "December 15, 2017",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRWM4Mml0QTJVOTJJTkY0Q211Z0lPbF9BWXVKZEs2MWdFS0ZnV0NFZld0TmljTWxaS0c2Z2M5bzRoNnVRSC13OFVJbVA0TVZiQ3pvZkFkU2c",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Tony,  Sorry this is no longer working for you. Please email us at mobilephonebanking@anz.com with your customer number and we can investigate this further for you. Cheers ^KH",
            "date": "December 5, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Christy Ngeow",
        "comment": "It took at least 15 second to open the app.. 🤔",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRmFZdXJ3RVl6MGNqM1lsblBCWE1xZTRLRGdZSDV3eFppQ0hReFRvWmJiQlNvZFlpWXRRV1A5b09CTDAwQ0FQVWNZeWdzeTNtX2x0VjhwMFE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Hi Christy, Thanks for getting in touch. Would be good to troubleshoot this with you. Can you email us at mobilephonebanking@anz.com?  Has this been happening only recently?  Thanks, ^TB",
            "date": "January 14, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Aku Rakatau",
        "comment": "Yea it's to bad",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPR1NCTG5XYVN2d1RNSE5pVy1CbTZUaXQ3UkhlMVc0Sy1HUHdBRlVuYTRQbnpVUkROQlFWTnpiOVdUY0kxemY1c2hQWVZrRGFyYWlsX2NjVEE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Aku, Thanks for the review. If you want to elaborate on what you like/dislike or would like to see in app in future releases please feel free to email us at mobilephonebanking@anz.com. Cheers ^TB",
            "date": "February 20, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Baburam Khanal",
        "comment": "great app easy to use  everything is awesome",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPRjV2aUFqRWFCakNTLXBPZkc5MVJnM3JZTXNoeFpDb0ZrbzR5b0NWVl9sd29IZ2hqRlRXTHF6aElhbWw1dVJBaXJzUEplMnFneWpXSzlVaEE",
        "reply": {
            "author": "ANZ NZ",
            "content": "Cheers Baburam for the great review!  ^TB",
            "date": "February 20, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Tarso Girio",
        "comment": "Really useful",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=nz.co.anz.android.mobilebanking&reviewId=Z3A6QU9xcFRPSEZDdVhmY3NoSGc4TEZlckMyRkh0STF2M2hTbllrbEhTQ08zaW1pcXhLM1JxLTRpUXZLYzJUQlpydnZBU2l6Q3FkY0JqOWNBMWp1RWNUUmc",
        "reply": {
            "author": "ANZ NZ",
            "content": "Kia Ora Tarso, Thanks for taking the time to review the app and comment! Cheers ^TB",
            "date": "January 7, 2018"
        },
        "star": 5,
        "title": null
    }
]