[
    {
        "author": "Andy Hong",
        "comment": "Finally! An RPN calculator app that works with the square screen of my Gear Live! For months, I was suffering through Keesoft RPN Calculator's round-only layout and too-tiny buttons, just so I could have an HP-style calculator on my wrist for quickie calculations. Now I've got RetroCalc, and I'm loving the square layout and the big buttons, which I can \"push\" with greater accuracy. Sure there are compromises putting an \"HP\" on your wrist, but I think the developer has found the right balance of features and usability. If I want to do \"heavy lifting,\" I'll open Free42 on my phone, but for quickie calculations, RetroCalc on my wrist is fantastic.  My only suggestion to the developer is to modify the colors/contrasts so that the buttons are easier to read. For example, the button labels in Keesoft RPN Calculator, despite being tiny, are actually easier to read than the bigger labels in RetroCalc.",
        "date": "August 8, 2015",
        "permlink": "/store/apps/details?id=org.feniello.retrocalc&reviewId=Z3A6QU9xcFRPRlFrR0o1bUNpZUpNbUVQbnNEbnhlOHRYY1Y5Smd5cmJ6MFIzcG9RR092WnBSU0U5MXpQem02Q1VzTU1jMkNHMWc5SE41SFcyWjRtTlFraVdR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "John L. Stanley",
        "comment": "Looks and operates OK.  Really miss the tactile feedback of a real HP keyboard and on some of the better emulator apps.  Fix that (by adding an option for tactile feedback) and you'll have a really nice watch app.",
        "date": "June 8, 2016",
        "permlink": "/store/apps/details?id=org.feniello.retrocalc&reviewId=Z3A6QU9xcFRPR1FIU3M1dExFVS14TWxoUjlRaDRqelJiZ0tmcXBoT0tMc1RHMFRfdXcwamVNaGNpTHJCeDB5LUFPa1NoR3Nwa2t1cmtBamFuYnZSLW1MUHBR",
        "reply": null,
        "star": 3,
        "title": "Pretty good"
    },
    {
        "author": "David Lindamood",
        "comment": "I wish i could change degrees and radians else very good.",
        "date": "June 22, 2017",
        "permlink": "/store/apps/details?id=org.feniello.retrocalc&reviewId=Z3A6QU9xcFRPRzJvVlc3V09Sc051a1hMdTE5YzVkbUhRd3NrTm5GZWZTNVNKXzE1NWpYNkcycmpna3p5emUwWllwUkhYMXZjdlM4SDNDOUl2d2JoaEtrTmxZ",
        "reply": null,
        "star": 4,
        "title": null
    }
]