[
    {
        "author": "Hauke Reimers",
        "comment": "This app is great and the widgets are perfect for a minimalist Homescreen, BUT there needs to be an option to control the update Intervalls. This app is draining my battery because is uses GPS location constantly without any option to control it. At the moment the app has been using GPS for 2 hours and 40 minutes and I have only taken it off the charger 3 hours ago... it's using more battery than my screen! Please fix this and add an option to pay for a pro version.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSG93UG1qMUhhYWRfVWo2S0paenlXWG9DU0J2UkdPVXYzLW11RXhvcXNDZy1rZm9vZFUwWndDT1JyQkpQRFowcTZxcEctY3FmVkUtOU00MnJB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Corbin Karras",
        "comment": "This app is amazing. First of all even though this app takes a comedic turn on the weather, it is still more accurate then the weather channels themselves, go figure. Second, the app itself is just hilarious, giving an amazing amount of humor on a day where the weather might have you down. This app easily dwarfs other apps that tell the weather not only with it's comedic theme, but also with it's accurate weather forecasts. Another small, but funny detail I would like to talk about is what the app said when it asked me to rate it. The app gave me three options, the third not being important, the other two options are very funny. The option I could choose for giving the app a rating was \"fantastic, I love this app\" or something like that, the first option only becomes funny when you read the second. The second option which you could choose if you didn't want to rate the app was \"frankly, that's a piece of ****\" which was so funny and made my day with how they customized the choices of whether you wanted to rate something or not. Five Stars!",
        "date": "December 18, 2017",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRl8xWTlfVUVINjlKcU9DRnQwRWNWSFRObG52NzJUWWhIZGJfa2ZWVVNIVU5hWndwNVVqY1AwTFpNSHZodEZKOXZVMnowZzk0Wlh5ejZYS0Ew",
        "reply": {
            "author": "ZsuiwaL",
            "content": "Thanks a lot :)",
            "date": "December 19, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Aaron Macy",
        "comment": "I like it. Makes me smile sometimes, and occasionally makes me chuckle. I think it may be from a developer not fluent in English, because some of its grammar and/or wording is off. Plus, in the timeline graph of predicted temperatures, the labels are celcius when truly the graph is a representation  of fahrenheit. (The graph shows 50°C and declining. 50°C is about 120°F...the true temperature now is about 50°F) A little more variety in descriptions could be good too...  Submissions of descriptions could expand the app and make it more user interactive.",
        "date": "November 17, 2017",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRmlmVmhCeHVuNGotWVcxaGptakRaaHRraEstWlZwRGZMaFljYkxVdERWcmFoYjBmaDk1YmFqZml2NUZKbHVsenpiREFJbXUzeG1XcG0zUXZF",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Anthony Liutkus",
        "comment": "It's good, but not great. I think it would be great if it gave NOAA and / or other sever weather alerts. As well as if it did a better job with the UI for forecast for the coming days. The AI language needs a little more variance as well, after a few days of the same weather it repeats itself and the whole app losses at least some of it's charm and appeal at that point.",
        "date": "January 16, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRjlwYUNzUGFGem9ENzZFSS1zUmMxX0FUUjMxNHZCcl9qVnlFdF9QN3F4Ty1SMjRHd2x2NkpNdkUtNkRQRnVUSUtmTFc0ZkowVVF3em8za3hV",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Mystery Rights Activist",
        "comment": "Not funny. The status reports are written lazily and there's barely a joke there. As if the curse words alone are supposed to be the funny part. When there are jokes, they're kind of lame and unwarranted. I saw a notification saying \"It's so cold I keyed a car with my nipples.\" which would be funny if there was more context. This is an app for people with juvenile humor. It's fine if someone else thinks it's funny, but it's not my cup of tea.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSHV1djdBVldfa3FtTERTeHBrd3FjUlRrbjZUYzFvQTNGZmFFMnNKUXF4anR6REEwRUEyS3h6NmtKZmhxUGpaeGd6SFRYelprdU5Xc1I4LU9F",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Rather hilarious. My main complaint is this app was very was written in an area where it actually snows. For the rest of the minority states where it doesn't snow, the 50°s are cold darnit!",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSHNTRTI2YjdrRkIyS1NaalZCc0JGeHJFeGlvR0RENUF4Rk94ZFJMX25jbC1xQlBNbktqbll6LUpkbUVLNTBCaS1Td1EwQklfR19kTVRfcFVr",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Matt Dunkin",
        "comment": "It's funny. There should be a way to edit phrases that are included with the app. Speech wise, it doesn’t do well with contractions (easy fix would be to individualize them, example: can't = can not) it would be just as funny or funnier because it would be understandable) as is can't  sounds like can-tee",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRUx0Z2tKcTlJXzhZX0phOE81RjdGdEJfUVVEaXpRbEtlRmloYndmdk1xN1IyNFV6RC0xdnlUU1R0V0dRWkVpS1NhZldPMzVwSWVEMkJiZ0tV",
        "reply": {
            "author": "ZsuiwaL",
            "content": "Hi there, editing built-in phrases has been possible since September, 2017. Open the left slide menu, click the \"custom phrases\" option and set the filtering (three bars icon on the top toolbar) to built-in phrases. Contact me by email if you have any other questions or problems.",
            "date": "February 14, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Cody White",
        "comment": "I love the app. If whoever made it could update the phrases every once in a while I'd love it even more. Hell, if the phrases changed frequently i might even pay for the app if there was a \"full version\" sorta deal. All in all it's pretty great.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRjNZVDB1RDVVa3hyWlB4cVFBVUFzY1FCU0h5WHRyUnNENXlVdmJxVmVXZURGWnRyQXRjMnhSbDRHc2hGeHZGVTMyS0NzbVdQR19TNUJjXzJV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Leigh Boyett",
        "comment": "Unimpressed with this. Used \"f**k\" A LOT. Not saying I have an issue with profanity; there ARE other words in the list. Branch out and use more of them, and maybe I'll redownload it. Better yet, you can hire a writer like me to write your snippets.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRTRrd21YbVR4REVXV0xSTmcxMjhiQkZJQ3ZkejhqcjVtVW56UkwwZlotQlZCbXJoaXcxQW5PWU83LV9FbkhUUkVwSHYzWEJveUxtTGhXdXJZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Shontel Marie",
        "comment": "For an app that uses cuss words it is worth the time to use if u aren't offended by that type of foul languange. I don't usually like foul language but this app is funny. Cheered me and a friend right up when we were iffy about the weather. Makes the day a bit better in an odd way after seeing this apps forcast. 😉",
        "date": "January 22, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR0lON3NlZF9EbFQydlNzSENBbW80dlM2MUE3RFFfOFJzSGFiQzRuSGhCd0o1Q2VHb1NOMjlqREdOVTRmOFlsbDR0WmpDaVAxWmgyVFZhU2ln",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Gregory Gambone",
        "comment": "Poor use of foul language. I was hoping for something better, something with a truly unique wit. Instead, this is just a bunch of juvenile statements that severely over-use a few words. Nice concept here, but someone with a much more expansive and refined sense of crude humor needs to write this stuff. Just adding the \"F\" or \"S\" words to everything doesn't make it funny.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR2pRejdnNDdjUElGQWJSNnlIZHl3clJMLXZGY18xWXc0VHpSaUs4dk12ZmE1dzhvMGJ6RDZ4WmJMYXk4T19paEUzbnBpclRJVVpIR1ZvbWVZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Justin Lindsey",
        "comment": "Shouldn't have expected much for an app that cusses. A lot of the grammar is terrible. Some of the phrases are funny but mostly this app just takes up memory. Uninstalled.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRU1aTWNtaW9vdWFvT0tJcHB2ZWxmU0dpalhQNUdMUTBEWUpiWXZOWkpkRFE5YVFnc3QxcUlvWEtzWUVuUzhZYnhiWHIweGpOWFpsYXVOYkdj",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Lindsey Sampson",
        "comment": "Downloaded this app to check it out. I love the funny phrases it has. But, big problem. It's currently pouring outside and the app says it's clear. Can't keep a weather app that doesn't tell me the correct weather... Deleted it.",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR0JZdXR1Rk5FSVBDaGMxSl9xeGxLcS0wTkg3M3dRMC1SWkZHMlk1NTMxckhqMTlMR19ENlhSd2Z3TDU0NGF2bUJBNnpkT05Db2JEU21udmJ3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jason Cox",
        "comment": "Funny, pretty accurate and a fair amount of features. That said, it could still use some other features. Like an animated radar for instance. I'll probably keep it, until the novelty wears off at least, but have to download another app for a better radar. Also I think English may not be the developers strong suit, as a couple of the phrases are horribly worded.  However, would still recommend, if not for a little while at least",
        "date": "January 15, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR3Z4aldVVG0xWnY1UmNfVC1lUjJpS1VaeHN3ZzEwZTVXeFpsWS0xOXc2cmc2eTViZmVnb1kyNkdwUU1JZUZpVThiaEJkRnBMN2ZTM0ZVWlln",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Lu L",
        "comment": "I LOVE THIS APP!!!  IT'S ABSOLUTELY HILARIOUS!!! Thank you for making me laugh daily! It's not easy to find great humor for me while I'm dealing with ALS...💯🙋👏💜🌅🌴🌈",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSHJwOGJjdXFQSmNtU1EwbkE4c1hXZHpDU1Q2X3NRYWlqZ19RWjdibEhPMzUxY0R0VWVEdHBHcHlBN0JVNWdLNFNaRVJoRloxSTdjNmNVY2RR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Codruţ Mihăileanu",
        "comment": "It drains the battery by constantly searching for gps when indoors, thus keeping the gps always active. That is quite annoying. That's why only 3 stars.",
        "date": "October 22, 2017",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR1IyRmtJcVdMenVyWTJzRVhIMHo5d1h4RjlaQUVLOFU1WWo3U1JjZ1pOSk5hNV9hU1UtSm9HRE5JVVZiYy1PcmhqNkhYOFZab2ljNmMwOE9J",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Robert Madden",
        "comment": "Asking me every time I open the app to allow my location. Really needs some better, more condensed widgets. 2x2 and 4x1 are the most common and yours are pretty bad. Don't give up!",
        "date": "November 1, 2017",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR0FlMWlVMU5XVWpKZXEtZnR3dk96SFVVRE1IWDRoS1cyUzhWVWhrRnpEc1ZJMTNIa1ZkN2dYdWVYMHQ2Nm9QcmxjQW9TS2p2cFdwdjVvOG1F",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Robert Lacy",
        "comment": "I only have a couple complaints, I wish there were more settings, specifically setting the update interval, and showing the high and the low for the following days on the widget. If those are possible, please let me know. Great and funny app still!",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR0xNOGdBX2ZhWTFnVVpZbXFhbVlpMWtiTU81NnpvWDBiYVZvbXRDb3J3bV82cW1nUkZkd08tYk5aYTV1dm9zbmpGT0Rtc3VnNC05T2JLYkUw",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Kitty Little jr",
        "comment": "Ugh, I'm so bummed because I really wanted to check this app out! Every time I download a new app, I have it scanned and sadly, this one doesn't pass the test ☹.  They use the analytics addon called OneAudience which collects very personalized information on their users and create a profile on you based on what they find.  According to OneAudience themselves -  \"through our network of partners, we deterministically identify unique mobile device IDs to pinpoint real, verified mobile users. Then, we connect billions of offline and online touch points to fully understand the user behind the screen?\"  Now I understand that some apps require the need to collect some data on their users so they can perfect the app even more however OneAudience appears to collect too much personal information that is not aggregated.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRkRtbEhya1d4Sl9Jd0h4b2hrQW82bW0tZlpXdWNIdkhaeTdjUWdmR0FuVVJsMnBRMnZzNVlVV2VWOW9qOE9ETVd4VDNiZHBPTnd3T3RvVThz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Hobo Timmy",
        "comment": "There is a slight awkward sentence structure at times. That's my only complaint, which is just petty. So...5 stars for you.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRzM1RjdOaEx0bUd4R3pQTHhBTVo5UUNuYVdVSTNWM2lOTi1oSGRYWXdhRnl3RTl2dmxZSzZ6NVF3QU9YUXN5ZXFuREFwN2M2TV9LdWZPa1Mw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kyle Weber",
        "comment": "Love it but I would love it more if you could set your idea of cold or hot like I'm from California so if it's 55 it's fu*king freezing!! So maybe a custom type of what you feel is cold/hot to meet my needs of how I'll freeze my balls off this winter",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRnNHT2p0VnR6ZnNfMTJoQ1M4eVlDR1paNzVXcVJVZkZ3UzVqVklBLWxaQ01NbHlIdXVNOV9xdmJQbXdhUVFiYS00ZmZpdnNhMlBFUDhrQWdB",
        "reply": {
            "author": "ZsuiwaL",
            "content": "Hi there, this behavior can be adjusted in settings. Moving the temperature preference slider 7-10 units to the right should do the trick. Contact me by email if you have any other questions or problems.",
            "date": "February 22, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Lindsay du Toit",
        "comment": "I love this app. Today I will witnesse the sun burning my F****** eyeballs til they shrivel!  Nice clean interface, fast, responsive and accurate as of time of writing",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRVRzQmdBckRqRTlnYkFhcWJ4eEZ4b3FkUkZyMjZaZVp3Qm9GVzhXeFozclcyUGNlZ2FxUTNYdVVfSWxjYnUwZEtBQ1FfWWFKcF9rWGtrcHZR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kitsune Lee",
        "comment": "The perfect weather app for Florida the \"if you don't like the current weather just wait 5 minutes\" state. Now i actually enjoy reading what meth head mother nature has decided will be defined as weather. I really enjoy the fact that every so often it will change the wording but still gives you the same weather reading. This way you don't feel quiet as pathetic checking the weather repeatedly. HIGHLY RECOMMEND TO ANYONE WHO STILL POSSESSES A GOOD SENSE OF HUMOUR. NOT FOR THOSE WHO REQUIRE A \"SAFE\" ANYTHING OR EASILY TRIGGERED(USED TO JUST HAVE TO DEAL WITH EASILY OFFENDED).",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSFI2VjJ6c2Q0QmVkcXp1R0tKRl92NmZ2S1hqNThlYkNmMVZ4bVNKb0ZnS21NV0dWcUdJWHlDVjBZb0Q5VERIMFZUeHNBZzN3dllmOUN0NHZv",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Max Bernstein",
        "comment": "My absolute favorite weather app! Adds a pinch of humor to otherwise boring or depressing weather, not to mention accurate forecasts.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRjdEQ1VJMzE4SWZKYU5WZXV2ZmM3djRxWDVaRUxNeTJfcGdENmFFSlNFZ0E1UDZrRTFBSjZCZ2Fnd3NmTE5kUEpnTElaWmhSdTIxLUVSOTc4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "phillippe bailey",
        "comment": "Please give us the option to remove the adverts, they ruined it for me. (unless I missed it)",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSExhM1ROT2V5bmZCYkxxX1RQN3ZPX3FZVGNrOWdmaTFtQjV0cF9iOUhHemZSeUstN0Z0eTd5WUd1dmozWEliX2ZxdkpOX1NwcGJQbXp4R0ZR",
        "reply": {
            "author": "ZsuiwaL",
            "content": "Removing ads will be possible later this year (April or May)",
            "date": "February 17, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Karleen Roberto",
        "comment": "Live in FL and my app says no clouds and no rain? It's severely cloudy and grey and raining right now..I wish I could send a picture.. even the radar has the green and orange rain on it. But 3 stars cause it is pretty hilarious and I do like it enough I'm keeping it. With FL weather you pretty much have to look at/on 3 different weather channels or apps to get an average on what the day is going to be like anyways.",
        "date": "October 15, 2017",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR2lmWFJuZFh0cTZhUndOcmtfV3RCWUhBR080bjlXVTItRFhoZ1B3MW5FSDI3ZGV4QUllT2QxUkpmUlFJZV9PQzB1M1JncnV4TE5ic1F0RjlZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Rachelle Tolbert",
        "comment": "Grammar is sometimes a little off, as a writer/editor this bugs me but overall still an amusing app with accurate forecasts.  It would also be nice to get a more compact widget option (like 4x1 or 5x2, etc.).",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRWRlWWJyWUhfOGJiYXZsQVVHSlJLTHpUZ05FZWN4bkR3NUlZc1hXVG9GNTREQ0swYkxoZUdZeHFUVHAtVnM4cXJZdEF2dmRfWU1MT3F3dDBn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Chris HITCHABOUT Kollar",
        "comment": "I would pay for a dirtier Pro version without the ads. Busting a gut here. But free is still good which is my favorite four letter \"F\" word,  free.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR09iZXRKaTBvLTlEa1l0QnA3WGVFQlIxTUZ5Rnh6akFaRmhzdGhtSENVcWd0RzhEU2E5eVVsWHBqQkZOb0VoZVkzcmYwQ0FfYlQ0Z0s3VFNn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ashraf Helmy",
        "comment": "Neither accurate nor funny. It displayed 72F on a day where it was in the 20s and snowing! This is no small error margin!",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRW9nVHhZZEJUM21iSmZ3TU5TV2l6Smp6c0dqT2VxUTZWcE4wOWNNVFpXUnhfcTlCODlFRnBhQnNIaUtkMEo3WmtocktMZGI4eU4zWWFZOTlZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Paul Collister Jr.",
        "comment": "Really forced comedy.. Trys way too hard to be funny. Some things are just over the top.",
        "date": "November 26, 2017",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSGxVWnhzcDN3Y2Q0aFVoU09mQlBIazVGRWVWZU9paWNSMkhCU0RyMzdjWUNrVGxaVGJHUnBnMXJHd2dPNGxsMG1jbFh5OThqb0ZlelhWeUV3",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Hayley Gibson",
        "comment": "Love it! A few more phrases would be great just for a little more variety. I find the app great just for a chuckle. It's far more amusing than any other weather app I've come across! Would be great if we could pay a small fee to remove the adds.",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRlR0b0hrU1FXRUFoQTlsVlVGb1JUMUJBS0lkeF96NGFIY2JfQUw3UTNFLXZIX2Z4Y2sxODJPeHE1b05Gamo4em9oa0ZENV84STFXdjQxQ1N3",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Patrick Marasciulo",
        "comment": "I like the app but a few features are not working quite well. A performance update and a radar fix would highly appreciated 👍🏻",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSFo3N1RFVUt5Z1d1S0VtNzJwb0c3cW1nUDVtVmJBSy1qMExEeGp0d3NTV1JFVzNLU2JqbTV4bUpfdkM1MnhjREJSZ1Foa2VJOE92ODJTNFFV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Christie Brooks",
        "comment": "Love this app! Cracks me up every time I use it, who doesn't need a good laugh?",
        "date": "January 15, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR3BKUy1nREVrVThySF91ZkhwWWgzd3psUnFneUJxanF3SGlpUkYzbVExaFlyenhYWXlOX0JYVkRkOGxUVC1Ick1PUnN0YlF0YWVINnF1eWo0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Alister Vordric",
        "comment": "I live this app especially when I'm having a bad day this app makes me laugh! I have used this app since it came out and I believe it to be quite accurate with the wether out side I recommend this app to anyone with a sense of humor it dose have profanity so keep it away from children... 5 🌟 for me",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRmIwTWNQRWs5STFJSHNQc2psZzIxQnBhTUdsaUlSc1pkNkR1ak44X01nelNITHFhN2hUMFJDS0hUWFdHeUFPVkVNYnMxUjg4S05pZHJDaU1R",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kimberly Thomas",
        "comment": "I seriously love this app! It's my favorite thing to check for the weather! Me and my family find it funny whenever I read it off. It's funny and amazing to use!",
        "date": "February 10, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRTlEUllQSlMwNERMbVNEMVRSclVMZkNNdVF1aFpQakxZeGVMMkFwalFIT3Z1TndfVUF6MldoM2V6WklLV2lmejhZS2o2SnNJQlFxSEJTcTJR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sketrick Allen",
        "comment": "Living in Ireland this app sucks. All you get is weather is medium temp nothing more to say, or I hate when the temp is neutral don't know what to say. 10c is not neutral it's cold and you need a freaking coat if you go outside.",
        "date": "October 24, 2017",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPR256bUhGc2dHUnpSWjQ0TlEzZlZNRHBTUWZkcFJyODd1SDVrSmtxS3ZiLXFfNHFSMkE2MnYzRTZUZ21hUGNpWW1PNTFyYWRubFFONjBtX1VV",
        "reply": {
            "author": "ZsuiwaL",
            "content": "Have you tried changing your temperature preference in Settings?",
            "date": "October 24, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Christina Larochelle",
        "comment": "Misspelled words. Incorrect grammar. Something needs to be accurate to be funny, otherwise it's just dumb. Needs editing & maybe it'd be acceptable. Oh & %*$# isn't swearing.",
        "date": "January 17, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSGZYQVRuVzJtd1owRnNEX1BYb3F3bGEzU1JRUC16ckgwOWd2U2FpTGtwTnhEZGh2X0Z3VFFHSVp6OWh4WHNHYnN2LVc2WmJWaHE5aEZYbENz",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Prashanth T",
        "comment": "I expected it to be funny, with all the reviews and the censored image previews. Its basically a mediocre weather app which adds the F word in each of it's predictions, and wanting us to accept it to be the funny part of the app. Its silly, not funny.",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRkJqb0V0WG4wZnFNYlpFS1JXTUl0MUdoOXJZbmRDeURoMGJzcEd4eFNoUVo3UUFuYjFkN0otRjhHUlJMS0VzQVdzeFdTVzN1SVpFc3dfWHVz",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Paul Ciucci",
        "comment": "I cuss i hate the cold this app rocks now i dont feel so bad when cussing the weather guy out lol he/shes feeling are the same as myne lol",
        "date": "January 6, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPSEFFVjhiOWI0aUJob09FMWM1dGJXZXNYZDZzUFRjYW5oVVhhTlRlMG9KVmozNHB5bkxmMTNZTzdJVzg2OTBXZmJXSHpnX2VtdGZ2TFUzcFN3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Gunn",
        "comment": "Cool app. The widget sucks though, it's kind of ugly and has to take up most of my screen to be able to read all the funny quotes.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=pl.lawiusz.funnyweather.release&reviewId=Z3A6QU9xcFRPRUNhcUZtako3cHdOQUp2OXhNQy1lTnQ1REl5RWQ5dlhCY1k2cU5malJlLUhGTHc5VHlvdDc4SGJwUElXUHJpeFdwNFJ4UEtQd3ZXd1NTSnM4",
        "reply": null,
        "star": 3,
        "title": null
    }
]