[
    {
        "author": "Kamil Gierczak",
        "comment": "Aplikacja jest świetna. Wszystko działa jak należy. Dobrze, że użytkownicy mają możliwość dostosowania sobie kilku rzeczy jak np czy chcemy mieć podpowiedzi jak się wymawia słówka. Niekiedy to rozprasza i doceniam, że mogę to wyłączyć. Tak samo jak w łatwy sposób zmienić sobie pokazywane słówka z Niemieckich na Polskie i na odwrót. Jest tylko jeden mały szkopuł, który mi nie daje spać :P Jeżeli chodzi o testy to jest genialny pomysł, natomiast dobrze byłoby rozbić testy bardziej niż tylko na A1.1, A1.2. Czyli np dać możliwość wejścia w A1.1 i tam dopiero wybrania sobie kategorii z której chcemy sobie robić test. Dodatkowo możnaby wtedy zwiększyć ilość słówek do testowania ;) Piszę to dlatego, że najefektywniej jest mi uczyć się właśnie za pomocą takich testów (metodą wpisywania), a niestety jak w teście mam tylko losowo 10 słówek z 500 to mija się ta nauka z celem. Aplikacja jest na tyle świetna, że nie przeszkadzają aż tak jakieś literówki, czy to, że się powtarzają słówka. Tylko właśnie jeszcze jak by były te testy trochę bardziej rozwinięte jak wspomniałem to byłoby mistrzostwo.",
        "date": "September 25, 2017",
        "permlink": "/store/apps/details?id=pl.tweeba.mobile.learning.german&reviewId=Z3A6QU9xcFRPRW9xYkJ0bVhGQVExLWlBSVR0ZFQ1WXVPRF9OeFJKdkdFOTFOWkI0amxHTDRyVVJicEtWWjh0b3dqM3hXYkY4SHZjRFhCUE1hSXN5M2d2VUhF",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "A Mack",
        "comment": "Głos nie jest czytany przez lektora a odtwarzany poprzez syntezę głosu TTS! Nawet po załadowaniu dwóch syntez, jedna Google a druga Samsung, większość słówek, zwrotów i zdań brzmi okropnie! Nawet na moim Sony tablecie z Sony syntezą!  Niektóre przypominają efekty dźwiękowe z jakiegoś sci-fi filmu! Ciężko jest się uczyć poprawnej wymowy w taki sposób. Szkoda, że kupilem pełną wersję.",
        "date": "February 14, 2016",
        "permlink": "/store/apps/details?id=pl.tweeba.mobile.learning.german&reviewId=Z3A6QU9xcFRPRmk5RDRrcjhTeWJEZVE1S2N3Y3FIdnBNaGdnOFRFeTZwOW9oMTJXVG5pcjYySjJVYV92ZnMwV3plM01ZcWJMaV9PazR5aTdWZlFrTlAtTmZz",
        "reply": {
            "author": "Tweeba",
            "content": "Aplikacja jest bezpłatna. Głos lektora jest systemowy.",
            "date": "August 28, 2016"
        },
        "star": 2,
        "title": "Fatalna jakość dźwięku"
    },
    {
        "author": "PETER O'Grady",
        "comment": "Useless if no English translation is available.  Am uninstalling",
        "date": "September 11, 2015",
        "permlink": "/store/apps/details?id=pl.tweeba.mobile.learning.german&reviewId=Z3A6QU9xcFRPR0tXRlpsWFFVSVBHSGoyR1RuMWw1YWhDS0RTY1NTd3ZRQmItcUpBdjJ1bHNNNEZ3Z2c3VlJ0VlJMN0twYjhmcHdzSnpMZTdFTjhsRVIwT2dN",
        "reply": {
            "author": "Tweeba",
            "content": "It's not an app for foreigners, but for Polish people. Best!",
            "date": "October 10, 2015"
        },
        "star": 1,
        "title": "Language"
    },
    {
        "author": "",
        "comment": "Błędy w tłumaczeniach, uczą złych słów i zwrotów.",
        "date": "November 24, 2015",
        "permlink": "/store/apps/details?id=pl.tweeba.mobile.learning.german&reviewId=Z3A6QU9xcFRPR1dJeWh2Y09ybEswcGxFZnhRMmxBWEFDV0hfMDZwSXJHQnY1YjRTRWtQZDFsRW8yZTh5eUhxeFk3N3lKTlNVSG9uallZLVBkMFNLWnUtbVRv",
        "reply": {
            "author": "Tweeba",
            "content": "Witaj, aplikacja weryfikowana jest przez profesjonalistów i filologów. Wszelkie błędy można zgłaszać na info@tweeba.pl Pozdrawiamy!",
            "date": "December 14, 2015"
        },
        "star": 1,
        "title": "Beznadzieja"
    }
]