[
    {
        "author": "Mister Junky",
        "comment": "Also this launcher has very few customizable options for the end user. It does run very smoothly but those microscopic font/text label sizes and tiny icons makes this launcher almost unusable unless used with magnifying glasses.",
        "date": "April 29, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRVN3Q2YySmVfdnIxblV4N2w2U0N2bG1QVUtNaWJXdlRGYktydnl4SFl4X3VZRGppYTNqWTV4UXJiYlViWkFOMFJQLWVqcVU3ZDNNVjdwOVNZ",
        "reply": {
            "author": "RBApps",
            "content": "Hi Mister Junky, thanks for the review, Sad to hear you feel differently than most reviewers, but I read your review as a request for customizable fonts, icons and sizes? that could be a thing to be added. I intentionally wanted to keep it simple though, and not bloat it with unnecessary features like I personally feel is the case for some others.",
            "date": "May 7, 2016"
        },
        "star": 2,
        "title": "Lot's of screen space wasted by app icons and label fonts being so tiny compared to the two other major wear launchers available here in the play store."
    },
    {
        "author": "Dan Raines",
        "comment": "Will change if you tell me how to stop app from blocking permissions from other apps like motobody and maps.",
        "date": "November 21, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPR3ZlbnVFZ184UmJaa3FhdUUzYkFfX3BNX1ZpaEg2bVVfbnJGVUIxeHd4d2gyVU9LZHFPNmZkeGhBamdNUkFnNXAtbUVrOWN3eWZyNk1PdnNZ",
        "reply": {
            "author": "RBApps",
            "content": "Hi Dan, \nI dont know what you meen by blocking permissions from other apps?\nThe launcher wont block anything, but simply show the installed apps on the watch.",
            "date": "February 15, 2017"
        },
        "star": 1,
        "title": "Help or give refund please"
    },
    {
        "author": "Gordon Van Someren",
        "comment": "I have tried every other launcher for my moto 360 2nd gen, and this is the only one that actually works well every time. It works so seamless I would swear it's part of Android wear. This launcher works every time on the first swipe from the left side just as quickly and easily as the native wear launcher swipes in from the right. This launcher does exactly what it is supposed to do, and it does it flawlessly. There is no need to take out the phone to adjust settings as everything is done right on the watch",
        "date": "July 10, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRkstc0taM2duNWU1STV6THUxeUg5M2dSRGZIQkJGaU10X0FaOExNQ2Y1TlZ3OVEtaGNjbjY2emtYd2stcTlDNmptdUNaSDRjOC15LWtrVGdF",
        "reply": null,
        "star": 5,
        "title": "Simply awesome seamless integration! Definitely worth the price."
    },
    {
        "author": "Danny Kirk",
        "comment": "So far this is the best launcher app for me. so far. I say so far because Ive only had it on my huawei watch for a short time. I can open my watch face and  hold the left side of my watch , feel a vibration and swipe right and there are all my apps. I can select the number of rows (I selected 2 rows works perfect for the round face) I can move my favorite apps to the top; of the rows and I can hide the apps that I don't use. What more could I want for a launcher? I would next like to see the battery drain and will u;date, but so far I'm loving this. I can't tell you how many launchers I downloaded and deleted before finding this one !  Most of the others have lag or you have to swipe a couple of times to open them. Not this one!",
        "date": "August 21, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPR203RXdjZTBidzJndlV2Y0lTSnRtVlFZQnR2UHJHM1pvamFBTGZkV1FtbzlaSDNEbklhdWVTQlpGSFYtajgxQkZWandNX2hkT2MtLUJzeXFJ",
        "reply": {
            "author": "RBApps",
            "content": "Hi Danny,\n\nThanks a lot for your review!\nI am really happy you are liking it.",
            "date": "February 15, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jeffrey Combs",
        "comment": "Great app but I have to uninstall to access permissions for other apps (screen overlay detected).  Re-organizing my apps each time is not fun....",
        "date": "March 23, 2017",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRklKVzZLRUxUOElJQ0VYcW1NMGRRNERQRXVQcFNnczU3cVloaHVfVlBXeVRUWl9nSmg1Ti12dEc3bWpnaC1DUTl5aGpWOS1mUDhGNVU2MDlV",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Hilton Tiam-Lee",
        "comment": "Tried most of the other launchers out there, they are all slow and laggy when used with Facer watchfaces, this is the only launcher that is fast and snappy. Takes a while to set up but once it's done, your good to go!",
        "date": "July 21, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPR0Exak82Z1ZEZ2ZISDZIRUpScy1DQ1NMY2hRMmZSeVBXd3lGdzZqSmRrc2JjczZyMlNxS2t2OVRXWnd1bG1DVzRRbWZVVlgxSDNsbHBFUk44",
        "reply": null,
        "star": 5,
        "title": "Surprisingly fast!"
    },
    {
        "author": "BRUCE ROSE",
        "comment": "There are so many good things about this app, I really want to use it. But the  app says it may not swipe if other launcher is looking for a swipe from the left...but I don't have other launchers installed. NOTHING swipes from left side on my Moto 360 2nd gen. I'll upgrade if I get help and it works.",
        "date": "January 17, 2017",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRkJsUThYZ3RramVCOWxkY1FXckpRS3RDRVJTNlMxdUw2VzdUb2tsSkJwVndFeW8ta2xySXpubjg0UlBSbklYUHRpWFVtM3lDeVdyM3B6eDg0",
        "reply": {
            "author": "RBApps",
            "content": "Hi Bruce,\n\nTry opening the launcher on your watch, go to settings, and modify the swipe area, just move it at least 1 nodge (but move to where/how you like). Then close the launcher and restart your watch. Please let me know if it solves the problem?",
            "date": "February 15, 2017"
        },
        "star": 2,
        "title": "Won't swipe at all"
    },
    {
        "author": "Mark Jensen",
        "comment": "The ordering right on the watch of apps (vs. phone) and in any order seal the deal... making this my launcher of choice. (Update: Still my favorite -  now on my third Android Wear watch -  LG Urbane 2nd Edition.)",
        "date": "September 21, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRnhJTXBNd1ZtRlNYNGNhc3I3SmlPUzFOSmV2ZUdQY251ZzJPQ3VwRG9fdGRMTGJZbjl3QlpINHhwdUQ1VEVpcFE3Ny1FUmlJZzBTcDMzeUE4",
        "reply": {
            "author": "RBApps",
            "content": "Hi Mark,\nThanks a lot for your review, appreciate it a lot.",
            "date": "February 15, 2017"
        },
        "star": 5,
        "title": "Have to agree... Best of the best."
    },
    {
        "author": "Tony Smith",
        "comment": "This launcher seamlessly opens up real use to your watch - making it easy to use with quick to access. The sexy app scrolling and smooth visuals combined with great config options simply make this app first class. Brilliant Many thanks!",
        "date": "September 18, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPSFBLT3FQVFJRNnJlbzFFck42MVRlNnVVbHgwdzI1SHBYRmJLMzR1TjJ6c3NuVEVieXF4OEtpakh6VEpDZVU1ZEZUQ1pRaFZ3VHQ5MWZINlNZ",
        "reply": {
            "author": "RBApps",
            "content": "Hi Tony,\n\nThank you very much for your review!\nAppreciated very much.",
            "date": "February 15, 2017"
        },
        "star": 5,
        "title": "So good every Wear OS should ship with it! 😀"
    },
    {
        "author": "C JL",
        "comment": "Everytime I go and swipe it never works. Open app then the swipe works. Next time I want to use it, no swipe! Gotta open app.",
        "date": "October 24, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPR3YwdWN4QlJ2Szh6U25qQ25ST2VpMmcwLWVZZnVNMzhrR3ZpUmlSQjg4UWdOQ0JoUFZxQWlpRDlqY1N3ekZNSERaODFiTXg4dFNIWU44Y2tv",
        "reply": {
            "author": "RBApps",
            "content": "Hi C,\nThis bug can be fixed by opening the launcher, modify the size or position of the swipe area at least 1 \"nodge\", then close the launcher, and the swipe area will now work correctly, even after restarts (wait several seconds after rebooting)",
            "date": "February 15, 2017"
        },
        "star": 1,
        "title": "Never stays running on zenwatch 2"
    },
    {
        "author": "Dwayne James",
        "comment": "How long do I have to wait before I see the the launcher show up on my watch?",
        "date": "November 6, 2017",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRXdLRGtBV2JBalByYTFqT1Rqa1BEMXV0c1ZydlVMdXlWRm5URWdldEMzUnZNOFZ2QVYwQVl4RTNnZ3BHd2g1b3l0dUMtODhkMlNoclZ5QjRZ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Laura Brown",
        "comment": "I can't install it on my watch. It keeps telling me it needs Bluetooth connected.  The Bluetooth is connected and working correctly. Help!",
        "date": "January 10, 2018",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRmZkNHpsZV9ETmRNUVQ4czZzSHdiNVJDcVJUYU51c1RFRjJLNENEaTl2TThmZUdNM3pLR3FJbGpDaEtxZUEwd2ctaXNiSTBKYVo0RDdIb0xB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "dan Bdan",
        "comment": "nice config..light launcher...cool",
        "date": "June 1, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPSHVMc1YzSXNLZVUxQmR5T0VTZkNxbVNfOE1CRHd4RFFqMmNId3hwVGgza1pSSjZJTkdlTnI3dnFuZ3NiaTBYcEFvbHZKWlNZOGtzSFdyRVJ3",
        "reply": null,
        "star": 4,
        "title": "interesting..i like"
    },
    {
        "author": "Shannon Kerr",
        "comment": "Decided to keep for now. You should swipe left to go back to the watch face.  You should swipe right to go into the configuration.  It doesn't make sense to swipe right to go to config when you just came from that direction (from main screen).  You should be more like Mini Wear Launcher in this regard.  What they've done is intuitive.  UPDATE: the app doesn't even stay active. Have to keep restarting it. Mini Wear Launcher is always active, even after restarting the device.",
        "date": "October 12, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRkRZRFk3eHFsWWRxYlAyRkg4YjJkTjlYQ1FKemIycjA5MVdoN3gzSlppeFpXcU9iV2ZDN0ZqZkstZS0ycUVPVTlJQjBEZmVfT0lqT09XYWx3",
        "reply": {
            "author": "RBApps",
            "content": "Thanks for the review Shannon, I hear you, and have now altered the swipe direction. Also fixed the issue where the swipe area would not always remain active - Check out the latest release and let me know what you think please.",
            "date": "March 4, 2016"
        },
        "star": 2,
        "title": "Needs lots of work"
    },
    {
        "author": "Chad Zenzen",
        "comment": "Using this app on moto 360 2nd...Installed and had some problems with swipe to open but problem solved by adjusting swipe area in the app settings. Great application nice job!! Finally a good launcher I have tried several with no luck.",
        "date": "January 10, 2016",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRlBlMWp1bVNDbVplczd4VzVQQXdiQktKUjluOTBXb0EwbnBBYW9EZ3dNU203WW9DTWsybkFsOWxxQ05RaGtJMGJhYU1ISlRFNFM3OGh6MTNF",
        "reply": {
            "author": "RBApps",
            "content": "Thank you for the nice review. The problem you had with the swipe area has been solved in the latest release.",
            "date": "March 4, 2016"
        },
        "star": 4,
        "title": "Great Launcher Finally"
    },
    {
        "author": "Maximiliano Gomez",
        "comment": "I hate to give such a great app a low star rating. This is by far the best android wear app UI bar none, literally,  but on my LG URBANE there's just one problem. Every time I enter settings mode I don't know how to exit. Maybe I'm missing something simple or maybe it's a programming error, I don't know.   Minus one star for having to restart watch after settings and minus one for not being able to hide apps.   I think dev did a great job making this app. And I will not Uninstall or get refund. Love app",
        "date": "September 14, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRlAxVU9EUU9PQjdVbE1OTmhMYkZGdE1UOVZxQVV1UzVBM1QtODNMZ2JlSnZRRGI4OWJUMlBodDdnYklQN3VpaWRzakFhbmlheEF6ZHRuWUZZ",
        "reply": {
            "author": "RBApps",
            "content": "Hi Maximiliano,\n\nThank you for the review.\n\nHiding of apps is now supported, to exit the launcher, simply keep swiping in any direction, and it will exit the launcher for you.\n\nHave a great day :)",
            "date": "March 4, 2016"
        },
        "star": 4,
        "title": "Problems"
    },
    {
        "author": "Carl Graser",
        "comment": "Works great on my LG G Watch. Now i can get to my favorite apps faster as they are in my order. Only problem is sometimes it can be a challenge to open and close the launcher would be 5 stars if that was not an issue.",
        "date": "August 21, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPSHRrdTdsTkhDNl9TQU1oVjcxM2otWlVwZnduMkE3cGlmNFhEdHhnWHpBeXRxcndDUDJfSTRhVjJHQWszcmI1WnZZdUdzLUVURzZwVWlfUjFR",
        "reply": {
            "author": "RBApps",
            "content": "Hi Carl,\n\nThanks a lot for your review.\n\nPlease check out the latest version, improvements was made to starting/closing the launcher (along with a few nice new features).\n\nHave a good one.",
            "date": "March 4, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Yolanda Nelson",
        "comment": "Setup is a pain in the tail! This app is not with the cost! The arrows to move apps around are way too small, I clicked 12 times just to move my heart monitor app. Total waste, maybe you should make the initial setup on the phone or have options on the phone.",
        "date": "November 2, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPSHNLTEtBRUlSTkVkTXM2T1g0MFk1U0lpSWR6XzVLRnhnMlBmSnpGUklvcnJUN2hVUTNkdmQ4a1NUbGFjWERydTVfeF9xN1pEN1lmaFRiZzlN",
        "reply": {
            "author": "RBApps",
            "content": "Thank you for the review Yolanda. I hear you, and the buttons are now bigger + you can hide applications from the launcher too - check it out, I hope you like it!",
            "date": "March 4, 2016"
        },
        "star": 1,
        "title": "Terrible Huawei Watch"
    },
    {
        "author": "Peter G.",
        "comment": "Nice app, just wish there was a way to exit the app drawer again after opening it. If I open it by swiping right, and then swipe right again, I can feel the watch vibrating, but it doesn't seem to do anything. Would be a nice addition imo.",
        "date": "October 11, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRktzeF9NZHpxMDlpU21zT0JzSnp1UzVJOGlaVHhXcDRZUjJWM01mSXlDMDFaSUQ2MWphTkhRWjJVdFlRa2NrWEEyV0xtbW01YnJaNFlDdnpV",
        "reply": {
            "author": "RBApps",
            "content": "Thanks for the review Kevin, that problem was caused by the swipe area being active while the launcher was open, this has been resolved in the latest release - check it out, I hope you will like it.",
            "date": "March 4, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "David Taroyan",
        "comment": "I have the LG urbane and this works great...  Two suggestions if you will,  have the ability to hide apps and also,  allow to pin apps via double tap and remove from pin same way to start an app when watch turns off.",
        "date": "May 26, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRzNQdDlDLW5tSWFSSnpnYzRpWUJERHNqVzhkenBCMTViVXRnSmp2d016WXlJeUxydmJyZXRlaER0aVNaaTUzd0xhakhtX3hqSHR5SzNaSWZR",
        "reply": {
            "author": "RBApps",
            "content": "Can you send me an email and elaborate on what exactly you mean by \"Pin apps via double tap\" I am unsure what you mean by that.\nFeature request for hiding apps is noted.\nThanks for the review, and thanks for the suggestions.",
            "date": "May 27, 2015"
        },
        "star": 5,
        "title": "Great launcher"
    },
    {
        "author": "Courtney Marcum",
        "comment": "Love the way this app allows you to see your Droid Wear apps in rows of icons rather than a list, however, I'm unable to launch the app with a swipe from the left side of the screen. I am not running any apps that launch in the same fashion, and I've manually launched the app on my watch (more than once) as directed upon install. I would be ecstatic if I could open with a swipe; this otherwise defeats its own purpose as I have to scroll through the cumbersome app list in order to launch this app each time.",
        "date": "December 26, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPSGgzQ1JrbTVNblVySGpkV3Z1WE1XMC00MkZjMURmU3YyMDJWX0lsVTJkcmxYVndHOVRrdnZqRzd4ZVZybFk5TExkdmRXRlo4UUpPa1lqM0pr",
        "reply": {
            "author": "RBApps",
            "content": "Thank you for reviewing the app! The problem you experienced with the swipe area has now been resolved, update your app and it will work as intended (along with the new features)",
            "date": "March 4, 2016"
        },
        "star": 2,
        "title": "Unable to open with swipe on Moto360"
    },
    {
        "author": "Garry Smith",
        "comment": "I use a Sony's smartwatch 3 and asus fonetab 7 and would not trade them in for anything and try and make them work better for me the launcher works better now a hiccup the first time I installed it but the second time I installed it works better than I thought.",
        "date": "May 23, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRWRZVjdrZHZrU2pNZ2hfeGF2OGt6anVuZ3ljMEh2N3pxNGlLdGdwWGxvQU4tdXVZbTV3clNMdVNnOUdIOUF6bVVaYWw1ZFFxcUs1TVp6eGd3",
        "reply": null,
        "star": 5,
        "title": "Launcher"
    },
    {
        "author": "Philisamalo around the world",
        "comment": "I had written a negative review about this app cuz I could not make it work on my lg g watch r.  After install it wouldn'appear in apps on my watch even after sync fron wear app...  I had to reset the watch, reconnect to phone, reinstall wear app, reinstall the launcher, resync and the app appeared in the watch r applications.  Manual start and bingo.  It works !",
        "date": "May 15, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPSEZXZFFrNXZfYldnbTY1NzYyY01vNEh4Q3RVcHVwYldLZVZiS1V4ajlnMWN1RWsyQ3QtLUNNUWVKdW5sVzUtMFJweV9JMy1ZMUFBZ1JwUGU4",
        "reply": null,
        "star": 3,
        "title": "Finally it works on my lg g watch r !"
    },
    {
        "author": "Jason Hall",
        "comment": "Best app that I have downloaded so far. Makes all apps easier to access on my watch.",
        "date": "June 21, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPR2dtTHd5blN6MFdZTU5MM25iaEVTdzlsZklBOTNiMFNHNjk1SHpDQnJWbmUxVEpXb0V1UU5MRDdwSU5GWW1XY2NxMzIxZ21pOUQ2M193Y2lJ",
        "reply": {
            "author": "RBApps",
            "content": "Thank you very much for the review Jason, Its appreciated.",
            "date": "September 3, 2015"
        },
        "star": 5,
        "title": "Should be stock on wear"
    },
    {
        "author": "Stuart Phoenix",
        "comment": "I've tried them all but this is hands down the best.",
        "date": "May 4, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPSDJZYWlGTFl6STRmdW92YWs3ZG1XcjBGT3NRSktfaE85WWhvbDV3cnJCV2ZXekNlbnJ0MjA3UGJOeEpNdXpqYVhQNTAtVlk4NnZXRmFGdExZ",
        "reply": {
            "author": "RBApps",
            "content": "Thank you very much for your review. It is very much appreciated.",
            "date": "May 4, 2015"
        },
        "star": 5,
        "title": "Finally! Its the best app launcher."
    },
    {
        "author": "Keith Dahlke",
        "comment": "I like it's app",
        "date": "April 18, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRXhjbjd1TFBpT0VPYk5vTTlwUUdQckJMSllwaUdsam1TV3ZJazUtdHBaV3JXcmlWd3lDWWV0cmp2eko4cHFGdkNzUm9HOU01YnZiNkVOQWJZ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jim Thomas",
        "comment": "I personally love this launcher better than the others ive tried.  Looks better and works better plus the ability to choose where to slide finger and how big of a space is a huge plus.  My only complaint tho is should be able to customize app tray from phone as well as on watch. Its rather annoying having to tap up 25 times to put apps where you want em in order.  Thanks for the excellent launcher",
        "date": "January 19, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPR1RERmVrakp2dGJaaGpxMWF2VXlFUXMwWm9vczNXUjBvRXJLeEtSU0h1QVpNcUx3UkNjeHJOX0FrY3VENFlUT1czQkNnSFdWWEFObm5sN1J3",
        "reply": null,
        "star": 4,
        "title": "Much better than the rest"
    },
    {
        "author": "Cory Cone",
        "comment": "Seems more reliable than other launchers. Would like to see the ability to hide certain apps from the launcher, as well as increase the size of icons.",
        "date": "December 25, 2014",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPR0VIWnJGZllDOWowVWx2ekU1Y2VBNnB6NjNPVFRPWFJYUGNsNjZkLTVrb0xwdjBvdFhKdURVN3FWbmhBUzFXQ09nc1d6RFJkcEJoaXZqanJz",
        "reply": {
            "author": "RBApps",
            "content": "Thank you very much for your review, Ill add the two feature-requests to my list!",
            "date": "December 27, 2014"
        },
        "star": 5,
        "title": "Good work dev!"
    },
    {
        "author": "Brock Murley",
        "comment": "Needs to have the ability to put apps in alphabetical order automatically and also to increase app icon size. :)",
        "date": "December 20, 2014",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPSENoN3B5a2JWdGNUZjdpMUR4N01WSWZZMUoxcm1LWWFnQXpxczlYYzNzdXVJdmxOTEV5NzhIeGNTNW9FZTJoRGlMQ01BX1VWSWRHeEJ3ZWk4",
        "reply": null,
        "star": 4,
        "title": "Almost there."
    },
    {
        "author": "Wayne Mason",
        "comment": "Works as expected.... Much easier now to open apps. A simple app, but makes life so much easier.",
        "date": "February 22, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRXFTb3laalVwM2Q3VU85WnVmT1libnYxSnJWXzltdEJlWFFKRzZHdUFSUTJyZmRFenRXcHVfWDFUWnRRbUo3N1dfUkVXYUZkenE2OWxOQlRN",
        "reply": null,
        "star": 5,
        "title": "Works as expected"
    },
    {
        "author": "Paul Salmon",
        "comment": "Try to open the heart rate app and it opens the step count. That's just basic. Not as if there are many apps for android wear. Shoddy. Very shoddy.",
        "date": "December 9, 2014",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRnNYakRNeG5GM0wyNHZGLXFZTnFJZXJoelNVY01WRU81NEk3c3ZzUUg4Ql9nRmdURmNjU3JURmxRSmhJLWZVU0hvZUtka2RmN25TbUFqYXlj",
        "reply": {
            "author": "RBApps",
            "content": "Hi Paul, \nThis issue have now been resolved as of version 1.4 - the problem was caused by incorrectly detecting multiple applications within the same apk. (such as the Fit apps which are bundled into one apk)\nThanks again for reporting it.",
            "date": "March 19, 2015"
        },
        "star": 3,
        "title": "Doesn't open the correct app"
    },
    {
        "author": "Alejandro Molino",
        "comment": "Ive tested 3 other launcher and now I can say that I'm really satisfied with this one.  Of course,  there is a lot more to do (like combining icons in a bubble or stuff like that) but so far so good. Keep up the good work guys. And yes,  when I wrote bubbles I meant folders.",
        "date": "December 6, 2014",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRTZqQy1xeVNKX213WXhSUjZFZXpDZWdDU2NYc050N2hydW02aGpQZHJVM0tkaWtURGJHZzZJOUFGM3dLSWkwV0M4VEN1XzJKTC0wVWZ4YUFn",
        "reply": {
            "author": "RBApps",
            "content": "Thank you for the nice review. With bubbles, do you mean like folders on a phone?",
            "date": "December 4, 2014"
        },
        "star": 5,
        "title": "We are on the right track"
    },
    {
        "author": "Olufunmi Oyebanjo",
        "comment": "Simply brilliant. With this app, am really enjoying my Moto 360 now. Thanks Developer.",
        "date": "November 27, 2014",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRkVhc19uTkotVTlZTTUtZzVrR0RzTFpKcXR0eDVWNHNWUVRiZ1U5UXNoOFZrMjJVRFMyT1VIZnVWU0NSRGRFd09nOFFhNU9NYi1kMk1DVTJ3",
        "reply": null,
        "star": 5,
        "title": "Moto 360 on Samsung GS4"
    },
    {
        "author": "Gigus BE",
        "comment": "Running on my Moto360",
        "date": "November 19, 2014",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRzJ1eWpIMC1rNWFYa3c2VkdHc2wtNGFlRVhMRGhzcTJ0SzVDRjRiZlVCdkVJQjhUOG9Fc2k4T0tsbFdlN0dEdmhra05URUd3S29mcHZTdThZ",
        "reply": null,
        "star": 5,
        "title": "Looks good"
    },
    {
        "author": "Fahad Alwi",
        "comment": "It worked fine for about 5 hours ...then everything started going wrong...my brand new watch (lg watch urbane) started malfunctioning...it wont let me exit the app or access anything else...everytime I tried going into settings to restart..it redirected me back to the crashed app. I want my money back.",
        "date": "May 12, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRno3NzZmMEFEcDV2SGljR2Q2SUhCcVV0cE1BbGxmeFUxMms5NkRSUnN5V2dXMF9lRzVIWWJ0Y2tmWHY3SVdTdlNSdHdicHltREJIUXRJZTNV",
        "reply": {
            "author": "RBApps",
            "content": "I am sorry to hear about the problems with your watch. These problems can not be caused by the launcher though. The launcher is nothing but an app itself, an app which cannot make anything else on your device malfunction. I suggest you do a reset of your watch then try again. If that does not work, return your watch for a new one.",
            "date": "May 27, 2015"
        },
        "star": 1,
        "title": "Good for a couple of hours..."
    },
    {
        "author": "Alexey Frishman",
        "comment": "Cannot remove haptic feedback, cannot close the launcher, cannot hide apps from list. What CAN this app do?",
        "date": "August 24, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPSGFKTk9xbzJZNFEzclRtTDdaVW9kR0p4ZGZGM3VRcHhPRkhfeWljMnNlS3lfX0lEWmFsOUE0ZTRyemRyOVhBXzU4Qk5EVENYemlYYjdLbnJB",
        "reply": {
            "author": "RBApps",
            "content": "Hi Alexey,\n\nThank you for your review.\n\nThe app can do everything described in the app-description.\n\nThe latest version supports hiding of apps as well.",
            "date": "March 4, 2016"
        },
        "star": 2,
        "title": "Disappointed"
    },
    {
        "author": "John Ryan",
        "comment": "Tried this app twice on my Moto. Really wanted it to work. Unfortunately, could not use it as a launcher.",
        "date": "October 24, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRWcxUEtvb3NTaWZKaWZyWkdRV0JFZllDc0NjUkZYQ0xST3daSUM1ajRQMVlSZXBwYmxvLThQQ2lzV1owSWlKZzFYVlRsNUhkeUFGdUtlU2tn",
        "reply": {
            "author": "RBApps",
            "content": "Thanks for the review John, I am sorry to hear about your experience. I assume you refer to a problem with the swipe area, this has now been fixed in the latest release - give it another shot and let us know what you think please.",
            "date": "March 4, 2016"
        },
        "star": 2,
        "title": "Nice UI but not for my Moto 360"
    },
    {
        "author": "Noel Vargas Jr",
        "comment": "Missing the option to hide apps",
        "date": "April 28, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPRlNMaUxWbEhfazdqeE9IOW1nbGpHSm9INjJfQVpiWDNCOHhMdi03Y19LeFlCSWpwZ0JiaURkNXYtVWJWLUREd19IRl9BdUEyVEFnTmNkV0pr",
        "reply": {
            "author": "RBApps",
            "content": "Thank you for the review Noel, the latest release of the launcher supports just that, hiding apps.",
            "date": "March 4, 2016"
        },
        "star": 4,
        "title": "Just"
    },
    {
        "author": "Anil Bhatia",
        "comment": "Need the brightness and quick controls for WiFi",
        "date": "October 3, 2015",
        "permlink": "/store/apps/details?id=ronnieballe.wearlauncherpro&reviewId=Z3A6QU9xcFRPR0FEQXJhc3ZTV3RwdGxNN0VOSTVVcXZ4RTBmdlJ2LUJUb1FWeHRSajk5MU1oYkM5RGVzeUVKeW5YWUJ1bmVpNEpreEtfVDlIeVBSQ3BEbWdV",
        "reply": {
            "author": "RBApps",
            "content": "Hi Anil,\n\nThanks for the review, so you are suggesting that I change it from being \"a launcher\" to being a launcher with shortcuts for various system features such as adjusting the brightness and wifi settings?\n\nI am not sure that is for everyone, I focused on keeping this launcher simple. I will consider adding it as an option though, thanks alot.",
            "date": "October 4, 2015"
        },
        "star": 3,
        "title": null
    }
]