[
    {
        "author": "Peter Willson",
        "comment": "Pretty good app. Works well, customisation appears easy and useful. Has a good selection of faces to chose from with plenty of user made content. Deducted a star as despite paying for premium i still get pop up ads.. no one likes ads especially those of the pop up variety. Ad's are acceptable on free apps but not on paid products",
        "date": "July 15, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRzZ0WW1VVjl5d3ZnTWlHbDB2UmlTUldfeTdrb3N5MDIwdFpSMVV1VjE2YUlZQVhDOUZNS0l4ZHduQ3J4dDd1dTVHYUIyT3p6NGpNUWVQZXc",
        "reply": {
            "author": "androidslide",
            "content": "You can permanently disable notification using Settings - Other - Notifications Off. WatchMaker is the largest watchface platform and community in the world. We have over 2 million users and 40,000 watchfaces - all available for the low price of this license app.",
            "date": "December 24, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jimmy Vogelgesang",
        "comment": "I bought this app twice, first time it didn't come through in my card. Second time it came through twice. Looked to find new faces, all of what I picked didn't work correct... e.g. steps showing 18 vs 3k plus in Samsung health after walking my dog for 2 miles.  Seriously?",
        "date": "October 21, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPSHJQQWxvWFRBeGFmVElhaVgwMGw3c1IxeFl0VnpGWG5sZjRCcmpOdENBZHdRYVZvYWVtanhBa0tYVm1oaHdmUUVvUkFoQmRtZTJqdTdxelE",
        "reply": {
            "author": "androidslide",
            "content": "Please try another steps source for your setup. You can use Samsung Steps or built-in accelerometer. WatchMaker is the largest watchface platform and community in the world. We have over 2 million users and 40,000 watchfaces - all available for $3.99!",
            "date": "December 24, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Felix Ng",
        "comment": "I love it! The best and easiest to use watchface maker app I ever come across. Thousand of beautiful free faces plus hundred of amazing paid faces. I can spend hours everyday in the app looking for beautiful faces, creating my own and learning from others. I am damn addicted. Happy and proud to be a part of the community. The constant upgrade built confidence for me in using the app. Keep it up! I am loving it!",
        "date": "December 21, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR0tCY0k4NVYydE5VSWprY2lISkVjUHNxNlRsU1BoS09sTF9NcElES1NRME5GWTd6Zmw4akZ4RTdSaUd1ZmxrNXRWek1pUV95cXZLMi0wdEE",
        "reply": {
            "author": "androidslide",
            "content": "Thanks so much for your comments. Look our for many more features coming soon!",
            "date": "December 22, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "anon nymous",
        "comment": "The watchface I use have multiple timezones but watchmaker has broken the time zone. I belong to UTC+8 WITHOUT daylight saving but only UTC+8 is WA which has daylight savings so my time is always wrong depending on season. This makes multiple timezone watch faces useless.",
        "date": "October 1, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR0JGNG5yaHVJQkZVdHlFaVdTRTdIQkdETmlJeG1aTjhqVGVoSER4M2lSR3Vnd29Gai1MLTloRTJhZXNCRmdLbVhSYS1aejBkZmgzRHBZT1E",
        "reply": {
            "author": "androidslide",
            "content": "Please select another timezone from the list - you may need to adjust for daylight settings.",
            "date": "November 3, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Glenn Russell",
        "comment": "Do not purchase. Program said it would work with Gear Sport, but won't connect with or recognize the Gear Sport. Uninstalled and reinstalled numerous times. Absolutely useless. Worked well on Moto 360. Just a money grab. If connection problem is repaired, will give a 5 star. Would give a zero rating, but it is not an option. GARBAGE!!!",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRjFSOG11bml0YjJReXZfdGJwTlZUaHY2UHpmWWFfNlNVQUxNVk92emxJM2prb01fU0lSdElsSHVyLVF4VTZKYzF0bmhyLU9aR2loWEE4eFE",
        "reply": {
            "author": "androidslide",
            "content": "It does work on Gear Sport. Did you install the WatchMaker companion app from Galaxy Apps?",
            "date": "February 1, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Scott Almond",
        "comment": "Sort of ok. Kinda does its job. Just in a buggy laggy way. Unfortunately, thats the best I can say. EDIT, Ha, dev response hilarious. Report so we can fix. I guess 2 years of reports being ignored kinda makes me not want to keep doing It. Also notice his avoidance of the \"buggy\" comment.",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRzYxQWxXNmcwbDN3NkVhS3BoTHR0WTh3dU1FWXpqVlJCQkZxQXVrOGtTbjRnbjZDelJaSDJ5cFhTY2dZWk5pZm01T0h0bzBPSF82QmVsT2c",
        "reply": {
            "author": "androidslide",
            "content": "Many thanks - I see in previous mail you mention graphics based on battery level are intermittently not displaying - we fixed this a few versions back. Please can you point me to any other specific bugs so we can investigate?",
            "date": "January 26, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Scott Weiner",
        "comment": "Bought it but don't see close to the number of premium watches they say. There is no gear companion app to download.  You keep copy pasting the same thing over and over again.  There are some nice faces but in the hundreds not 40,000.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR3NBTC1aTGw2cTNlYi1tZW9nSlhLT3pmSnNpcnlLUzRMSHctdDdsUUVsLTlIMjRGb2VoemdHN0JFbXBaYzJ2M0xwWWlmdU9pc3V1Q2hjTmc",
        "reply": {
            "author": "androidslide",
            "content": "You get all 40,000 faces for $3.99 (WatchMaker premium option) - no additional payment needed! Get 15,000+ faces on getwatchmaker.com, 20,000 faces on facerepo.com and 10,000 faces on WatchMaker G+!",
            "date": "January 26, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Jay West",
        "comment": "\"Premium\" defined. What you or anyone else wouldn't pay for. You still have to search through what you get with the license and what will cost you extra and everything that will cost you extra is the stuff you want and the \"premium\" stuff that you get with your license, you don't want. Lame.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR3V1blRaWG81bDMwZHk3WG9xRUNuVGwxVm5Vel84NTZUS1M1czhtZWg1SDk3cEZCVE1lRFVxblVzaFlqdmx6a04zQXprTUZkR3JrSGw1UkE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "David Dunster",
        "comment": "{dnnnn} displays the full text for month. On the android app it displays the month but when uploaded to my Gear S3, it does not display on the watch. {dnnn} does display the short version for month. - ignore, I found the problem. It was the type face I was using that failed to display. Once I changed the type face, the full text for month displayed correctly. ALL IS ON TIME. WatchMaker ticks!!!!",
        "date": "December 3, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPSGpIaVZBOGFqU0RIN0ppT2pwejE4VzdFOUtXbFFCTW5IMnZHdmRtN0kxbkY0eFRHMkpuR0dLYU5GQ2prR2R4X0l5Nl9BdkVZcHh3X1A4SFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Clint Chapel",
        "comment": "Love it. So easy to use. If you have android wear, get this app. UPDATE: Since the Android 2.0 on my ASUS Zenwatch 3, WatchMaker has made my watch very slow and utterly useless. I have to use stack faces right now until they fix this!",
        "date": "September 25, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRUNxSlZJVDBMVnhHUkJVc1otTXVZUGdtcmhFVkNzT3NYWmtqR3I3Y0RDWUNvZnRGVVJHeHFpenV4SEJXcFRLbDVWQWpBVklXUVIzU0ZYX1E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Scott Collins",
        "comment": "Compass and Temp do not function correctly...A sham watch builder app that lures you to keep making purchases. Once you download the app you will see...then wait till you build your own watch and see what works...VERY disappointed...oh and the calander errors out as well .",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRWFNeVpTNTV5bGtLMng2MDN6UHNIRnZLUm5rQUpPMkVPcnp1OVRRS293ZHluUWhZYmQ4eWI1LXBZcENudHFBQnRMR3BybHlkeXdfT2tjMWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Cult Doctor",
        "comment": "my watch updated itself, and it fixed itself! Wasn't the apps problem at all. I have an LG Watch R and I absolutely love this app. Didn't want to get this geek watch because I love my military watch so much, but actually created the face with this app! Like marrying a younger woman! (Oh, he didn't just say that! I hope my wife doesn't see this. That sexist, chauvinistic, misogynistic pig!). Just kidding folks. Got ya laughing, didn't it?  Great app.",
        "date": "June 29, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRlVSZ1ZyWVdXZ1NERjNvS3lmMk5UTTdueFY5ZmlXZUp3cGFTVUZGRnBON1ZDTTlBeEFubzZjWVRTQUpzajhGZDBySGxpTDVOSDRHOXBjd0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Michael NULL",
        "comment": "The app in itself works alright, but the watchfaces lag way too much on my phone, I bought the app last night and was unable to ask for a refund. I would like a refund.",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPSG5tUkx2TE1zUGRsYlZJRUNGN3hibUpSRXdFSDF0ZlhLOTVvd1d1VV9peVdRaWVnRGNKeHNUVVNGeXNPOV9TSnBZZVBtekJaa0FURzN1T0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Sam Hines",
        "comment": "Poor design, all the faces are the same, the template to make yourself is terrible, I can only describe it as combining Microsoft paint with Microsoft word art. The faces it offers within the app are all the same tacky faces. Also doesn't seem to work anymore since updates. I'm sure I can get it to work but for this in not going to bother. When I first got this app I found it good to find other faces online and download them then use this app to install it on the watch but it's difficult to find any decent watch faces these days.",
        "date": "January 4, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRWNxaVBrQlZzdnpSazZweFVaeGR2a3N3ZExWVUlLSms1RG9BSjhSTEMxQTdWVjFXNEt1aVB4RUttUWJmbzlzckRsY0UzLXJuM3MtRGdZalE",
        "reply": {
            "author": "androidslide",
            "content": "Can you let us know which watch you have so we can investigate for you?\nYou get access to 40,000+ watchfaces for the $3.99 purchase of this app (WatchMaker Premium option)! More watches are added every day - also check facerepo, getwatchmaker, watchawear and many other sites! This is the best deal on any smartwatch app period.",
            "date": "January 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Joydeep Datta Gupta",
        "comment": "used to be excellent.  But after buying Gear S frontier, its useless.Watch maker said they had issue with samsung,its solved,companion app available in Galaxy app store. Its all lie.App not available in Galaxy store,so paid watch maker app is now worthless at least for me.",
        "date": "December 18, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRm5GdUsxTGZBdmZBUDM5NUZlT2JCdGk2MHZKalBEbC1hRjdiV3k2cW9ldEVtM1hUc3U3aGI2Z2NqNlVxZGFxZ0xXS2Y3VHh0YUhCaG5hclE",
        "reply": {
            "author": "androidslide",
            "content": "Gear Companion app is available in all countries that accept payment. It costs only $1.99 and gives you access to over 40,000 WatchMaker faces! You may need to update Samsung Billing.",
            "date": "December 20, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Supergrover1969",
        "comment": "Only able to install one watch face from this app, then it stopped working.. unable to connect to my Samsung gear s3.. even tho I confirmed it was in fact connected via the Samsung gear app.... it's trash, I'd get a refund if I could.. buggy, avoid",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR0NnU2RCRmdvQjVUWEFROWlYU2FDM3RyTmUtYy1WNmJzV2RaQTh2dHhiRWNGMlhiODZQVkthcHZpRW40T0dRMDhNSXpSbFZzQk9Rb2ZCMHc",
        "reply": {
            "author": "androidslide",
            "content": "Please update to latest version on Gear S3 - fixes have since been made for Tizen 3.0",
            "date": "December 7, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Derek Hamel",
        "comment": "This app purchase leads to another purchase to use it. And all on and so on etc. I want a refund. MISLEADING. What happens to those who only have Google Play to make their purchases and no credit card?! Nothing. You just donated money to the devs.   SHAME!!",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRzZSZ0Z6RndhXzNyWVJGZ3pNSEUxOXRnSlQxeHlKVjM1cVdlamJtNDRwWFBWRTg4WmwwWVFNaUkxRlRqdWN4SmJ3OTRVY193NGQyUDMyNEE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Brian Matthews",
        "comment": "The watch faces themselves I love, but knew I would since I have been using the wallpaper version for a little while. It's the the glitchy-ness of the communication with my watch that I'm not fond of. I'm able to transfer a couple faces then, for whatever reason I am unsure of, it says it can't connect with my brand-new, just-out-of-the-box S3. I then have to restart watch & phone to reestablish the connection for a transfer of 1 or 2 faces. Yes, that's a fix, but a very annoying & time consuming one. If the glitchy-ness can be corrected, I'll give the app the 5 stars that I think it can be without all the aggravation.",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR1ZpbUJnZWU4WENnRWpPMkJreDZ4RjFYdWVmYU84MkVvUDFUMGFHdm1rTHdnZW9VNXpyVDRyWFp4X0NTbzI5ZWdzeXMwNFoxdU14UmZFSlE",
        "reply": {
            "author": "androidslide",
            "content": "check the following :\n- phone is connected to gear (samsung gear app)\n- change to a different watchface and back to watchmaker\n- force close watchmaker app on phone and start again",
            "date": "December 4, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Dan James",
        "comment": "Good selection of watch faces.  3* because I bought this for the sole purpose of creating faces with my own custom backgrounds, but every image I import to the app, then send to the watch, becomes very compressed, and as a result ends up blurry, regardless of the original resolution or cross-sectional area of the image.  If there's some way to mitigate or change this, I'd love to know, that is the only thing which is holding back a 5* from me!  Thanks",
        "date": "December 25, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR2pZLUFXeXhjVVk4cVE1SVdyZU56T0t0S3A0NFBnV1M4Z0tQZno1RWRSejlGWC1sR2d3YmJ3eEJWMkN1MHpDQUtsYUxRTzZLVHlrNU9pYkE",
        "reply": {
            "author": "androidslide",
            "content": "If you are sending to Gear S3, please check the graphics quality options on watch (double tap, then tap left).\nWatchMaker is the largest watchface platform and community in the world. We have over 2 million users and 40,000 watchfaces!",
            "date": "December 26, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "courtney Flurry",
        "comment": "I purchased the app.and it stop working. I paid 3.99.Then a month later it stops working and then wouldn't fix the problem or give me my money back. Bad app..",
        "date": "December 17, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR2ZKQWVHczA1ZFdTSHlWODY1WTJjM3c0QlA5SGlkc01aMGtBUzNYSjRDbXNSNnBuTllNc1BZbjh1X2FZSHJ0cDdVT0ptU3U4YkFQSkdWbmc",
        "reply": {
            "author": "androidslide",
            "content": "Please let us know what is not working so we can help? Send your order number to admin.androidslide@gmail.com for a refund.",
            "date": "December 18, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "fikry qardawi",
        "comment": "hi Dev, can you please remove the premium licence app icon after activation? It feels off seeing my app drawer have 2 similar looking apps. Thanks and imma give you only 3 stars until it got fixed.",
        "date": "November 24, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRnpEcXZNcFpaOGRfS2hNTXFlMjJTLXRmdVNmTmV2NXFLQi1XaV9zVHZ1NnlzX3VSdnRCVGJuaTVpWnppRl9tOGRXOWdwUFhSQ1kzemRkTWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sheila Gehman",
        "comment": "I can't get the watch face to my s3 after I purchased the premium licence, downloaded android wear and selected watchmaker as my watchface.  Tried contacting developer for help but didn't receive an answer.  $3.99 an app should come with some assistance if you run into trouble.  Most expensive app I bought and so far most frustrating.",
        "date": "December 3, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRUd2T1BuY1lEaWN5M1lWMWYyUXVucFc3a0lXUGxVTUE0ZTZ4QU5rZWo1MjZNRHdhdFIzcjlDTFBKcE5jaGRMNzVlVE9PclB2U1RwdmwtVEE",
        "reply": {
            "author": "androidslide",
            "content": "We have responded. Please check your inbox.",
            "date": "December 4, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Desmond Anglin",
        "comment": "The problem I have is  it only allows watch faces to download on my lg r watch that are editable. So many premium and non editable faces simply will not load, they just leave a blank screen on the watch.",
        "date": "December 22, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPSDU1WUZCSll2aU5YT1B4NUU0RVNpMzB6amNKaHh0dFNRV3M2el85QVIzcWk4NVprbU9sTXhqWUdxem1PYlVTMmpVbG44V2o0Rmd5UFlQMXc",
        "reply": {
            "author": "androidslide",
            "content": "This should be fixed now - please make sure you update the main app to 4.7.2",
            "date": "December 23, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Anthony Gunby",
        "comment": "This was a great app and still is apart from a few things. Since moving from the note 4 to the new note 8 all my images that were used to make my watch faces etc such as bezels and overlays. Theses are not showing up in my gallery,  only in the file so I cant use them when building a watch face and I dont have the option to go into the internal memory on the app any more to retrieve them from the beautiful watch folder.",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRklhbEhkaC1MTERad01lQXpIa1NtOWlSYjczVkotM0ZKV2tyRHVpYjhJQ2NSRmFWQ0NzU2NpWHNuclhEcldSemRmbHFJeFJyMHBPVVVESUE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Alex Hernandez",
        "comment": "Love it! I figured out why it wasn't downloading on my watch just had to force stop the app store! My friend is a youtube reviewer and we're doing a dual review on his gear watch and my lg sport in a couple weeks. Definitely giving you guys a shout out. I'll email you a link to the video once it's up!",
        "date": "November 2, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRWpnNGZsVUE5S1V3dm51TlpVbXhXMFhObGpHME50cW14Qm8tb2pCMk94QkUySXE3OGhHTWxwSVoxcFZud3RxaC1xbWczd1hNY0hrOHBadEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Vercin Getorix",
        "comment": "I bought this app to have access to premium watch faces. For a long while, it was fantastic. With the latest update, almost every watchface shown on the app homepage costs at least $.99. What was once a playground full of watches I could use is now a giant advertisement. This has reduced new watchface discovery to almost nothing. There was always a section devoted to selling bundles up top, but that was it. This is no more and I am no longer using this app.",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRWtzRC1FcWcwanpqblZPM2dETjNrZWZ6MzRCNkVRWWlIUkctbFNmaGl3NTJtTHVOR0VhQTZXV2dpN1lmSUJOazRDTWpjWUxpUlJrdzNzRXc",
        "reply": {
            "author": "androidslide",
            "content": "You get access to 40,000+ watchfaces for the $3.99 purchase of this app (WatchMaker Premium option)! You can download watches from FaceRepo, G+, watchawear and many other sites completely FREE!",
            "date": "December 14, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Scott Nelson",
        "comment": "What a rip off.  It states you get free faces, but do not.  Then they keep sending push ads to buy faces. They also say you can add your background to a face, but it is limited and very few options.  No weather, steps, phone batt, connection.  This is a complete scam and should be removed.",
        "date": "October 11, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR0t4S3NnRW1TdXNuVTB1YU1QRXZxLU5rNGVyZVd1dTNsRVExM0JKclo0RFBGb2RTbXZWUWhGRnQtZkxwZDBRQXNRbUtKMXNTelhKSnkyeXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "I really like the selection of free watch faces, but when I tried to create an account for purchasing items it said I needed a valid email address!?!? My email is and has been valid for years. Please fix",
        "date": "June 19, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR3NlclhLYkpmczRxNmd4VVo1RUxLTHRXVzM2bk5yZmZuSW5uN1lzamM5N2loMTBMRGExX1Fxd0FHSGI5MVlDTlk0MDJ6SFgyTEJyN0MtRWc",
        "reply": {
            "author": "androidslide",
            "content": "now fixed!",
            "date": "June 21, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "robert scruggs",
        "comment": "I bought this app with the hope that I could make watch faces for my Gear S3. Well the download is no longer supported by neither my gear S3 nor my S8+. Waste of money.",
        "date": "November 22, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR3d2Z3VJYWFrVWFpeHY5QzUyTk9YVGpYVVRwRXBucWhiV1VDMXlYM1hvSzU0LTd0MjNyNUwwVmdiV1BwZlRobUpGaTVudURyVU1oSmpRcEE",
        "reply": {
            "author": "androidslide",
            "content": "Its back on the Gear store now.",
            "date": "November 29, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Mar ina",
        "comment": "Do not buy! The step counter dose not work - shows wrong number. In forums is written that is a bug for a long time. No one cares and no on fixes it :( wasted money",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRjQ3RUhka1FIMGZjNE1mMWlZM0d2LWlQaFQxNVpQWG5XYm1oeVgyUkhueERBb2xKWnFhTDloSmZSdUl0MDhWdmFENjd2RjZ3dW4tWDkxOEE",
        "reply": {
            "author": "androidslide",
            "content": "Step count is fixed in 4.7.3",
            "date": "January 23, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Mike Harrison",
        "comment": "There's nothing here, that I've found that that details how to use this product. I followed several YouTube tutorials but they didn't work for me!",
        "date": "August 22, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRy1oaVhjS3llUnZwYzNMWWh3ai12SzJXR0lLNllwUjE0NTgyZ08zN05hLU5EendvMkszUGh1RGFVZVZ4bVRhSm1DS0ZQaDY2SWFxd0tXY2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Rebecca N",
        "comment": "Weather doesn't work and when it does (which is barely), it doesn't update within the 30 mins interval chosen. The heart rate is way inaccurate! What a waste!",
        "date": "October 4, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRWZzNFpNdlZhMFpVMFBXUXdSeVBDV3BmY0x3eGJkRUxKMDBGSUVUTi1jczVmRXN5WlB6amRRMVdaa2hzczRUQU9oX1hnVzZSZ3FTOG1TS2c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Redd Smoak",
        "comment": "Want to know why, when I upgraded my watch from a moto 360 to a gear s2, that I have to buy the companion app. I already paid for the premium, and used this with no issue on my moto. So why do I now have to give you more money for a companion app to use the app I ALREADY PAID YOU MONEY FOR!",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPSHVyYzNlQWczZXY2N3BpRVZXTHZMb0RKTF96dDN0cm54azA1Zzk0TTRPZ1FNUVp6X3prdlZ1a2VxRVdSdUlUVVVhS0tGdXlRV1JNaWd3emc",
        "reply": {
            "author": "androidslide",
            "content": "Up until now WatchMaker made its revenue almost exclusively on Google and Apple platforms, meaning Samsung was not receiving any share of the revenue. This seemed a little unfair as Gear S2/S3 is a significant percentage of the WatchMaker community. I hope you can understand the reason for the change.",
            "date": "January 23, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Jr Rojas",
        "comment": "own gear s2 and can't find the companion app, Androidslide stated is available but searched Galaxy apps and Samsung gear apps but no luck.  can you add a link to it. thank you. JR",
        "date": "June 19, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRUpvZHRpRDA0WGZYRlhJUXBuMWlHX0c3S282cm85Z1RRVHh6RVYtRFZUekk2V0YxdWk4N19IR19BLWFEMDBXWXdWVF9PSnhxTEMweTNvTFE",
        "reply": {
            "author": "androidslide",
            "content": "Its globally available - search for “WatchMaker Companion for Gear S2 & S3” on Samsung Galaxy Apps.",
            "date": "June 22, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Wayan Kardhita",
        "comment": "Overall the app is great and the functionality is beautiful. Love the ability to make/ customize your own faces  One hiccup though on all the with a phone battery indicator there seems to be an issue with displaying the level...",
        "date": "July 8, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPR3NXb3JfZDVwNk9fRkhCWHZ5d2c0VWJoWEZtVXo0RnlzVC1ock93VVlOZVpmdG1qd1pmS1plTkxBRTRxU2RjTHc1clBzWFdqUHVCWDNmcVE",
        "reply": {
            "author": "androidslide",
            "content": "Thrre is a link to the wiki inside the app. Full tutorial!",
            "date": "March 10, 2015"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Richard Hanz Monfort Kalaw",
        "comment": "I bought the premium, is it supposed to disable ads aside from premium items? cause its annoying to see pop-up ads, thanks",
        "date": "August 9, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPSFNwWExCZW5QVFhMT0dRamxYZWU1eGtzYndweF80ZEo3VXB3eEwzeTR3SWNieks3cnpMa1FvVUV3eDczdnVPM0JZRHZ4S0VWLWtkWHhrSmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ashley Kmieciak",
        "comment": "I want a refund, I thought I would see more faces and find something I like, but not so much. I can't find a single one that works as well as Samsung gear app all are slow and refresh when watch face turns on. Waist of $4! Do not buy!",
        "date": "October 10, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRXBDbGRxOEhpU2E3Nl9lQUNSS21MTWJsaHR1ZWdSQzl1ZFc2ZS1HbWtiT216VFNaaDdUd3cwZ1BmRUQzdkl1RG5leDBvVElTR185UlJUZGc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "clifton stillman",
        "comment": "This app sucks it never works. Every time I put a watch face on my watch it disappears and I paid for a license to call it Beyond disappointed",
        "date": "October 22, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPSHBxVGttbzk3U2RnWDdnbU1WeDNQcGxvWkRENWp1RmdTUGExc2ZBd0RpNW8wNnJHLUMtOEJaNGxYa0cxM1hsLTNRZTd0azdtTVhKWWN3aXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Naga Raju Kola",
        "comment": "I have purchased this was long back,  and not used for few months, now I want to use, but its says no user found on my email id, how come it is ?, When I purchased I have issues, after using this app again getting issues, what is this boss.",
        "date": "July 28, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRUFnVXBLV0pwQXNXQ1FxYzM4V09HazRoWnVjZEZOcUp2WnVSRGRISV9KYnlLM2JQXzhLU0hWV1FyaGJwWmZpMXU1emM1bG5kN3RxMXYzSFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Heshan Kathriarachchi",
        "comment": "Transfer settings feature doesn't work for me. The main app keeps asking for the licence after transferring settings and uninstalling.",
        "date": "September 3, 2017",
        "permlink": "/store/apps/details?id=slide.watchFrenzy.premium&reviewId=Z3A6QU9xcFRPRWhOenphOHlvbTluZTBXRjROQXZndW1SNmFqRWw3V1R2VHpjTTQ4YU9UZFhjVlVfNXhsQXdhdFN3UVEzajY3Wm5kNkhmRUpOLWpTMG1WX3c",
        "reply": null,
        "star": 1,
        "title": null
    }
]