[
    {
        "author": "Daniel Hevelow",
        "comment": "Looks like the perfect face that I am looking for, however, it crashes every time I apply it. Please fix and I will reinstall. No updates or contact from developer about fixing the issue.",
        "date": "May 22, 2016",
        "permlink": "/store/apps/details?id=sweetstone.se.wear.soluna&reviewId=Z3A6QU9xcFRPR3l5VWRydlRTNEw2SV9EQm9rOGVxWmc2QU95QWo1SnBLTGF2TUltY0RSRUNvVG9uTlFadkVvX2R2dFBjZngyNFpxd2o0TmxiWTV5dHFoQWc",
        "reply": null,
        "star": 2,
        "title": "Crashes every time"
    },
    {
        "author": "Charles kluepfel",
        "comment": "The below was written before I switched from an HTC One M8 to a Samsung Galaxy S7.  On the Samsung, it crashes just as it has for other users reporting on this face. Now I'm using the Glance face that came with my Zenwatch 2 software, now that it too has 12-hour time. It doesn't have lunar phases, but I've got a Moon Phase Pro face also, and the F05 face and InstaWeather faces also give relevant information.   ********** The recent update makes this my watch face of choice for regular wear, replacing the F04 face as such. Soluna has legible sunrise and sunset times, as opposed to F04's tiny font. And the face is much cleaner. So now that it has 12-hour time as an option I'm keeping it on as my main watch face.  It shares with F04 the moon phase lagging the true phase by several hours worth, probably as a result of treating the local time on the watch as if it were GMT, or perhaps the zone where it was written. But several hours is not much compared to the 29.5 day cycle of the moon.  It could use, however, an option to stay in full view for a longer number of seconds.",
        "date": "February 14, 2017",
        "permlink": "/store/apps/details?id=sweetstone.se.wear.soluna&reviewId=Z3A6QU9xcFRPRXBxUkdRRFVJRGtPVkpyQmI4N2ZBNUhUR2pwazRSZDRKWllJamV3SUMxX2RUUFJTVWJPYWR6TUZac2tTdGFPYnZIcDhJZG1JRWhvdVQ0M3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Chris Day",
        "comment": "Looked like just what I needed but repeatedly crashed every time it was selected on my Huawei watch. Uninstalled",
        "date": "November 23, 2016",
        "permlink": "/store/apps/details?id=sweetstone.se.wear.soluna&reviewId=Z3A6QU9xcFRPRjljVExqeDBNUlRvZXVTQTdpLWV0cmtWc1FOOW1UeEFkQ2FIUzVaYUhnTnROOEU1MWpnTjRadE5QR2Z2bVEzdnFIcFBPWFdiVVBQSS1fZWc",
        "reply": null,
        "star": 1,
        "title": "Repeatedly crashed every time I tried to select it."
    }
]