[
    {
        "author": "Stuart Macdonald",
        "comment": "It used be a nice, simple app that I would have one almost all day and now I am.goijg to uninstall it. I understand the need for ads, no problem. It's gone from an ad, to a couple, to sometimes 3 ads with a ten second gap between each one so it's.well over a minute before I hear my radio station. In and out the car all day means it also stopped each time I turned off the car so I'd deal with the ads ten or more times a day.  I'm now just using the browser option to listen online to my radio station, so much simpler for what I need.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPR1kxRHJpaFJkUnFwcG15aUpNQndUblZIYlItUDZDblFLTzZ0QWdMR2Jua1JhM2hVSEJ3a2F4UWh6cENPaXNvYlFjb21WV1hlUE9TNENBMnc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jon Waddell",
        "comment": "This app has nothing to offer that you can not find any place else. It was a great app before when it had audio books then it was a excellent app. I would recommend the free version and not the paid service with audio books gone now you can use a combination of other apps and get what this app offers and end up saving money.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSDl1RVRDSWxBTU0zMHVYYW9FWXZnTmlyQkFtNVg2TW1tWjJfYW9IVXVzZFhPaWxzWjZiWFBYWHB1Sm5Zd01Fam11NEE4QXNqakprOEtTTnc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Amanda Schroeder",
        "comment": "My big issue is layout. Why on Earth do I need  top news feed on my home page of a PODCAST PLAYER??? And with no way to edit the home page layout, the home page becomes useless but to those looking for new things, so really it should be a find your next listen section then a home section. Maybe the premium one is better in layout ,but for the free version  rhe layout is really kind of a joke for convience and personal experience. I only keep it since tunein seems to have contracts with some of my podcast to get episodes earlier then other players,but I really would like to get rid of it.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRjlpcmRRbUJVR0t4cENKTWFscTlqU2JscW5ieGRLa00zQWhfY3BqMTlkd3U1RWNTQkNtcXhfbzFLOUNINlNOUllTMXBhc3hxUU1lZ0haZmc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Every time they come out with an update all of your recents disappear. There's no way to specify your preferences for what shows up on your screen so even if you don't like sports you're stuck with seeing mostly Sports anyway. But I have found it to be the best thing available right now if you're a News Junkie like I am and you want to hear all the news.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRWtTRUo4SGJfWjlSLWJBS1VzRVpqOVVQekJFSTBlX0dMZWkyVjRIUHI5aUt2R0s4dG5PMkdHZm9fVUlwSXc3TVI2VHlLS1FnbkdtQjBJY2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Ballencrieff House",
        "comment": "I get a lot more buffering with TuneIn than other apps when listening to the same stations. So I can't give it more than 2 stars. Also, why is it now demanding I log in using my Amazon account? I made an account using my Facebook credentials originally and now it won't accept that across all platforms.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRm9QYVhMLWN0NENlcTFDUXUzZnIySEFJbE9VeFhTMU1qSl91VGlUM1dtUXlaOTJIZE0wNXBrRzBxZGpYM1ptLVVaTExvM3VTUmsyUkMwaXc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "高島一郎",
        "comment": "I really don't like the new interface. Who puts dark blue as a background!? I believe everyone likes the black background. Did you know that \"blue color\" or any hue of blue is bad for the eyes!?  I'm disappointed.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSFZuZXJ6UVJKS2plWjlFZUxwT2YyNDh6TnpNNU1OdUZYcnhqTE1Rd0xaSlpoYjhWV0M3X3VOSUFELXBKN0N5ZHA1Y25hQXlTdUNTMGU2MGc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Richard Guinness",
        "comment": "I went onto the free trial for 1 month. Life happened and this slipped my mind. About 2 weeks into the second month I wrote to customer support to ask for a refund, even partial, of the £54 fee for 12 months. The response was blanket \"No\". I think this is pretty harsh. Be careful in case you make the same mistake!",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSEZRdHZpd1cwa1ZSZjAtYnhybkpUUFJ6VmtGakd5OEwxSlNjQUZQYVA3Qnd4RGNSU25JR1ZWVE9GOGdHeVJqeEhkUzhCVEVMRlEtVDJuUmc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Don Jackson",
        "comment": "There are a lot of reasons I like TuneIn. It's easy to use and searching is great but when I listen to the news it will not stay in real time which is a problem. I used it while I am at work which requires me to move about the building. When I do bam it kicks back and I listen the same thing over and over to the point that I finish the program 10-15 minute pass the end of the show. Iheart does not do this . I prefer TuneIn but am forced to listen to iheart. :-(",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRTJsUnk4dlZGcXdpTklvSERvT1J6U0V5TXFselhRM3lXcG9IOVpiVUJMbllJeGF1TjdQM3ktY1cxeXdtUHFUSm4zZDBzLWE1WG5GaWYzcnc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Love it! Live in southern Va and able to listen to my favorite stations in DC. Nice if you travel alot, you can keep up with hometown happenings.  Update  2/2018... I see a lot of people are unhappy with update,  etc. But it's still my favorite radio app because all I use it for is listening to different radio stations across the country.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=bGc6QU9xcFRPRmNjbFlSR0FNem9vaGVQdkhkcGljRHV3ZFRaNUV4OWVJSE9aeDNNZi03M0NNd3dYQ09qTWE4djdmaTlmYzRtZHh2UzZDam9qY3plSWNmelE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Blue Poppy",
        "comment": "I have used this app for a while and previously paid for the \"pro\" version to get offline listening. But now being asked to pay again for the same thing, won't  bother. The app would lose signal anyway, so I'll look elsewhere now",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRzZyWW1KSTZ2aVFfYmNtMXFhQ2NIS2tHSjduM0N1ZUM0U3JPczk0UmJUdTZMclpRcXdDWUFaNTJiRHd3ejdiUWlXQktGYndDQUxVSnBfR1E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Big Deluxe",
        "comment": "I have used this app since they started!! This is the worst version... ever. Constantly crashes. Very aggravating. I am now seeking an alternative. I'm about to \"tune out\"",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRlotZTBkVVlzS0doSm0zS2dYamdDc05TMlBNSEdfQS1Ec0liTU9hY1JVQ2dWdC13d3dfSnJaWWlJRlByN09FaGJfTGZrOFVSSERSZmxsNXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Clayton Jackson",
        "comment": "I like the TuneIn app. My only biggest issue with the app is badly targeted advertisements. For example, getting gun store and shooting range ads when listening to a station geared towards children, or ads for one political party when listening to a channel oriented towards the other political party.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPR1A1bEhNU1NFUU5xdjlQTTBlV2tXTXJmVEk1cUcyZXdzOFRoNmF6ZnpuaXQ2bWZFWG1NT1hSVTFwaG41NW9mNXNOYm9oeTd4ZEVNSnlrZ0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Johnny Thunders",
        "comment": "Is 'always on top' a concept that escapes you in 2018? Don't anyone dare do anything on Android whilst using tunein - it will just vanish... Tedious. You seldom listen to your user base and use silence and stock replies as a weapon. You want 8 pounds for the ad free version of this app - are you mental?",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSGYtRmpDNVlFTlJGbnJ5cUZsWk9LUExEQUE5OHk0ZFN1U0hYcnpxcGNYTkF5UVphZnNsRWx0TEhCczMxVERaV3FwLWRNYzc3d2EzY19GTVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Syed K",
        "comment": "I bought premium in itune but I cannot use in Android I paid for premium give me my money back I need premium and recording version also ads free where is my recording paid version without ads? Do not spend money on this app ads all over the screen they are cheating in IOS now start cheating in Android too many tunein apps too confused do not buy paid version too many even if paid version",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSHppc3NOS3VWWGFjWkliakg1cGhaMlp5aGk4a21IWWhPR0YwSDhodW1zUUxINldlVjJmTUZBMFdaQWRveEhUcjNkTDRWa09hX2pILVRMMFE",
        "reply": {
            "author": "TuneIn Inc",
            "content": "Hi Syed, you absolutely can log into your Android using the same Premium account credentials from your iPhone. Feel free to write to us at support@tunein.com if you need further assistance.",
            "date": "February 8, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Dj Duncan",
        "comment": "Tried it to listen to a basketball game. 5 seconds to go shot goes up to goto ot.... tune in cuts to an ad. Missed the call and the excitement. Why would I pay to listen to radio w added tune in ads?",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSDR4MFJCbFB1MVNXM01uU2NRUlJiMmVMdHVpaS1qRnFSV0h5UTR1VWJBUUxXbVZBbEpERWJ6RkdUUGZuazM0WW1UczdxeHdvVE1iYXlKdXc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Joel Bonilla-Rosales",
        "comment": "The fact that you can wake up to your favorite station, podcast, etc. Also less ads/commercials than other similar apps. Definitely keeping this one for a while.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSGpIMGJIcVBlTWJYTllMNVlvQTZENzA4ai1mTlA2R2I4aXdQTnVPX3dFbDhkMGpOZDkxVW1DbVpUTW10dUM4WE50MHlGWUZaVkItam9neVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "John M. Gerard",
        "comment": "There seems to be an issue with the search function in TuneIn Radio. For example if I search for \" the new screen savers\". I get no search results but if I look up the search term twit I get a list of all the TWIT shows including the new screensavers. I think this might be the reason why TuneIn Radio doesn't work very well with Google Assistant. Also a big thing is that TuneIn Radio Pro version app doesn't work at all with Google Assistant. If I uninstall the ad supported TuneIn Radio on my pixel 2 XL phone then Google Assistant can't find TuneIn Radio it says it's not installed even though I have the pro version installed. Is there a way to use TuneIn Radio free version and upgrade to the pro version within the ad-supported version that might be a work around until you fix the problem. I use Tunein radio all the time with Google assistant. In my kitchen when I'm feeding my dog Ozzy. I really would like this to work. I sent you in a similar bug report to Google about this issue. Maybe you guys can get together and fix this issue.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPR1phM3czLVNLa2xXYUZJbjN5dV9Ld2xxb3dpazM0b3ZpdVlIMW0teTg0SDVsRXp6a0hLRVBxLVNLVGowMl83R1JIRTFhbUNROGFVT0JaQnc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Dwayne DPF",
        "comment": "I do not like when you install an app and it's supposed to be free but you only get a 7 day free but you have to subscribe to they're plan. That is false advertisement and you guys should be will be called on it. Do not install this app if you want it absolutely free other than AdFree but it is just another rope-a-dope type deals",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRWhWTjZGYVNQbHo0WWY4QTdSQUh4QzZ6czViY2cxaGZBTjVTNkZLSFljd0FCT2x1ZW9iMlhKaGxBLXVia0hFb1Z0ZzBlYUs0YXJjOVpuUUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "A Google User",
        "comment": "Was five, even for pay but like others said after audio book was taken away that was not worth it. But them the free app had gotten so buggy it's gonna from my best app, most used app ever to one I dread to try and use. Such a fast fast downfall in just over a month!!! So sad",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=bGc6QU9xcFRPRmdnUEhjU2xGQlRJTGhrbHhCOVdlbTZzSUxCRkVWOTgyT1A3SXU4MEllZWx6U3JheXBaUjF1WmZ5YURxME9UM2hzTVdObEc3RHpZdGoxalE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Dan Uren",
        "comment": "I used to love TuneIn Radio and i listened to it all the time. But not now, the new layout is dreadful and far too many intrusive ads, I now barely listen to it at all and generally go elsewhere.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRUwyUEw4ZmxEeFRpdXdudWpwU2hYdXI0OE8yNWZEdDRFTU1ueGcwaEJxTEJxaDR6bXQxNFZ1YldJRFhWNVRIN05tdG8wYmRCSU9iT24xSVE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Adrian Z",
        "comment": "This is a note to all the users complaining. Pay attention to how subscription services work with these apps that want you to do a 7 day or 30 day trial. There's no excuse of 'life got in the way'.   As soon as you install the app and have the trial, immediately head to your Google Play subscription list and cancel it. You still get the trial, but instead of automatically renewing your subscription, it just stops after 30 days. There's no excuse anymore, this is why these app customer service departments refuse to reimburse; because it's literally that simple to not get charged for your trial right after you install it.  As for the app itself, I've noticed a lot of changes since I've last used it. not too happy about the recording option no longer being available apparently. Doesn't make it worth it for me to spend money or have on my device when the shows I listen to put out a podcast anyway.",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRWVaWWVhSjNNb3FjUlhseXMxUUpPdDIzb3ZIdF9vaVhrWHFfRVliaE9PQ1V2SHRHWWxJNVlSZkpaVWtyS3RaVUt3Wnp6M0U0MTN5YVJHbWc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "James p",
        "comment": "After all these years and all the updates, this app is more unstable than ever. Pausing the widget via a Bluetooth device rarely actually pauses. Instead the widget crashes so when you try to resume, you can't. One star for content. Otherwise avoid this app. It's all about ads now",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRUxjQWNHeTg0N3hHMy1KeEZPQlpVbTZCNWVIckRLbWJ3dUlyY0ZFUkNPd3pJZXhveVhycmx1dWQ5cFdfNGxiTHgyZTRFb0kxVVo3TnJIMWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Adrian Greener",
        "comment": "Great. Ditched my work radio and just use my phone. 👍 Though I know the need for adverts they can get a bit ridiculous.",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSGFUc0hGTmRZTkNtLUhVX2tiaF9feVA3cWFEaW5rYVJXSjd5UW1OQUxyLTQxbXJjWWhfQm15VjhMLVVyVmpNaFdzT1J0XzBlbFJuVDZZeXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Joey Harper",
        "comment": "It seems like it's more ads than music. Maybe some of them are the radio stations ads, but it's still too much. I'm also fed up of hearing the same badly targeted ads every time I open the app too. I'm just going to downloads the stations' apps instead.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPR1EwUUNzQldFemZISmZFRG9mRmZhRlVXaE1mVEJ2VXdmU01SamNaVXFJUjQ1LXpXdGd3S1Z0WU5pbVM4V0hKNzZ4QXZJdjRHQVU3YzhpRUE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "No longer able to sign in.  Simply not working since last update.  Looking elsewhere i notice the HQ streams seem to have gone as well.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPR1h3STJsTXpabDZQWGZhRUFqY3BQbmt3X21JdzAwY2JwRFJXeTd6TGx0NVFOYXdjWXgyY0hiZXpxXzVoNVQwZTdyaTFuTVB3cFY3WHJVNFE",
        "reply": {
            "author": "TuneIn Inc",
            "content": "Thank you for the feedback, Paul. Our release next week has many improvements related to Chromecast, so I hope this will solve some of your issues.",
            "date": "March 11, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Nikola Stanojčić",
        "comment": "Very uncomfortable for listening to podcasts. Cannot mark episodes as complete, autoplays when I tap on an episode - very clunky ans little control.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRml3Tnk4WW5PdVNwQVo3ekFJUkk2eXBmZWs1OHc3eXVZUXluMUtEOG1WUzkyN1B4VUU1VUpmLUtRUnloZVJGc3NmTmxRSVd2Y09yNzNUSWc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jim Hamilton",
        "comment": "This app is full of nothing but Liars, Fake News and racist views from bigots like Al Sharpton.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSEVvVkY5NGpGZERHbENwb19sR0J6LTMwdFZNQjUtU1B1MGxQOFg5WXp6amJqYk44dVAtblUyUUN2VWNZVXEzRFVBYmZCMUJaRUt1VmlGZFE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Onal Fernandes",
        "comment": "The new version is horrible. Buffers a lot. Suddenly plays in fast forward mode. Takes forever to load on high speed network too.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRmpOaUY1el9LWUxmakNScnZSTFlYZTljRDdFMzBCZHhoX2lWWmFYamJYNjYwYmRuRlFsQUFHSkNicXZwcHU1ejBtcHRHNXVWSUNoc2JtU3c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Enrique Fernández",
        "comment": "The app is fine, but it would be better if the screen turned off when the alarm sounds, because it drains the battery and heat the phone. Fix it and I'll give 5 stars for sure.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSHVMNi1PNHJfT1JiTXBCQlQtUWVuekFHMm45eERiNjJyM05mNDhVZE5OXzRYWjZpRWVSX0NjekdZLUlxR2FLZjh0d1o1LXpUTUg5dFhmOFE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Brett Armstrong",
        "comment": "Since update you can no longer pause a radio station and come back to it later as the app crashed and forces you to restart.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRnR3eVdsWVp2ZE1jbjhqYzlULV9oQUJ6OXRVMFp6djZDRFVvcGVENC01SEhjWVNqaU9DQWtjNDRsOTcwaUp4OEZoaUtBcFc4aGtaMFR5R1E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "kirk gremillion",
        "comment": "Removing as I couldn't get through the initial ads.  Not only audio ads, but lower edge visual ads AND on player ads!  Just too much.  Rather podcasts.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPR0I0UEdGT0dfY3hzSnVrZ0JGcXpMelhsUHlyT2ZSdnd2WGpNaFJPOHpOR3F5dHIzbjJuM3B5VUJHbUs5S3ZZeTN6NTBMMmk1dm90eDBwT3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Will Ford",
        "comment": "UPDATE: The widgets are still intensley annoying. TuneIn takes up a huge amount of memory on a phone (Samsung S7 so no slouch) because it wants to run in the background all the time. I am constantly going into Settings/Apps to force to stop. The TuneIn people have the plot, users don't count to them anymore FFS.    A recent update has ruined it. Every time they update this app it is worse. Now I am given a widget with a list of Recently Played, how am I expected to get back to the main player to turn it off? There should be an off button on the widget and Favorites NOT Recently Played. It has been so poor lately I am having to delete the cache and force a Stop to unfreeze the app. Why is this app so difficult to use? It's too complicated KISS!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRnY1S0ZwN0tTVkFUdEpJR1p0MVlUNUZpWkM5OWc2czRfc0E0anhRT3ZldTNod0NVMHFSSDZGV1dfQ0JDYzFtX2VGNFdCVndJdnl0dEdUQWc",
        "reply": {
            "author": "TuneIn Inc",
            "content": "Hi Will - thank you for letting us know about these issues! Could you please join the beta community so that we can attempt to work with you to fix them? https://plus.google.com/u/0/communities/104004014534336880633?cfem=1",
            "date": "March 16, 2015"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Gurban Baghirov",
        "comment": "Best in the market! You can easily find channels in every topic you want. Also great for learning languages through radio classes or podcasts. Helped me a lot to improve my French.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRnQ0X3NwNkcxelluVU1yWHJJMHR2NjdqdHVJTUpFbGlwUnFDT1lsZHg4cmRBOU5BT08xWUlsOXNNX3pFZ1Z0QjF4SzJfM1JiVGhSc0FGSEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "John M",
        "comment": "Love everything about it. Moved away from my hometown years ago but I can still listen to my favorite stations.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRkFfa1VUQnMtVDhtYS1OakY5SkNrMW9OTzEzd3k4Yno4NXNoSGE3NG9uLVdsdmZFYnlkc1EzakxlbVZRX19OOGdjcHFueVNTUGNwRGVpQ0E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Cleve J.",
        "comment": "Has some nice features. Great collection of online \"stations\" and good podcast database. Would give it 4 stars if it could be moved to the SD card. This app with my data uses 620 mb of my phone's internal memory. There is also no option to choose a location to store any of your content including downloaded podcasts.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRkI4cXJMS3hYcHdhSml6MzRUd0hFZTFxRFl2NTNzdE5wMWJxTV9QcVZqREpuaGhValRvbFFpWUhoa0RzWHFFcmk0X3J0Y1YtaUlhQmJvd0E",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jason Faulk",
        "comment": "This app harvests your personal information and shares it with others, according to Norton Mobile Security. Do not trust these people. If you've already been had by one of their recent app updates, what recourse do we have now that you've violated our trust, and distributed our information, like sim card data, etc.? Update: Recent updates to the app have dialed back the info harvesting according to Norton, indicating only location harvesting which drains the battery. I know this because TuneIn keeps the WiFi turned on looking for a location even though I keep wifi turned off.  Also, how can we now believe these folks haven't blocked Norton from seeing their previous harvesting of personally identifiable information like Simcard Data, voicemail number, device type model, etc.?  All this info gets sold to data miners, retailers, political marketers, and others to build profiles on us and manipulate our perceptions with their targeting efforts. Its really a dark new world and I am losing trust in these commercial outfits more and more.",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPSFRNYzJCdUNMNnRIODRobTVVYVFDTUtrSkJwZ01McnA1bE13WE1Xek54dVo5ZHg1TUtnTDRBc2hWcFZjb25ZeXMxUEs3ZVpvTktxLUpwZVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Kendall Carney",
        "comment": "Ridiculously hard to unsubscribe. I've been charged $9.99 every month for an app I haven't had downloaded in over a year. Still can't get the damn thing to stop charging me and c ant even find where my payment info is located. Totall B.S. DO NOT DOWNLOAD",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRkpYel9mczZpMklUOGQ4NG44cHNmbGVSWHV6VmNxZ0taYXF2SURwTXN3bFlMckhOOFpKQ1JYOS13QTRrcndyaGlfMnBob0VrX2ViNUtGamc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Easy to use.  Local stations or stations by category are easy to find.    Ads on a station not bad but too many ads when you switch stations which makes finding a new station difficult.",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPR0VRSF9CdHFEWlI3NXFuRG13eThLNVJWUllFMDg1SkZ2VmwtN3dNb29OZ2FPQ0lHbUg5ZWFtR01QWVlrVDVUeFA4cHNJZm9VQ0UzMExMNHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Danny McLane",
        "comment": "Pay for premium content, they remove the premium content. Nobody's resolved my issue. Also the app does not allow me to play at more than 1X normal speed",
        "date": "March 3, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRWNHRTNJUmhiWHV0SWF1U2czM3M2ZWZwYUJoVkUxUUNmUFBIdmlBS1BSQVJ6UDF4ay1sbmRpc2ZQT2otcjJ2bm9VMHhpTVoyUU0yQUhzVUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "YoMaldiah Olson",
        "comment": "Great app, until I found out it was taking 698MB on my device. I was only using it for 2 radio stations so... uninstalling",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=tunein.player&reviewId=Z3A6QU9xcFRPRzM5ZjdETHN2clJDeHQ0dDN5LVZaQ3RLRm5FbFhVakR6cUNJbVllM0JNc09QMFQwOXZvQzZjSDY3bXBLblE1a1dfeTVDa2cxVlZiQmxndlE",
        "reply": null,
        "star": 3,
        "title": null
    }
]