[
    {
        "author": "Chris Jones",
        "comment": "What the hell have you done to this app! Before the update today it worked perfectly! Now I have lost the ability to change stations using my steering wheel audio controls, the app crashes and hangs my phone requiring a reboot. Please reverse this update!",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR0tINFZma0IyQnhaZVhud1U1UWxyMTZTRGNuMUNTSVRjemxkQ0RhRF9JcFhPNHpZZDZkZl9aYmxRMHl6V00ycFl4OGVOeURFdERzeU9iQmc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Tony Pollard",
        "comment": "Before the latest update it was just about perfect with the ability to change radio stations with the steering wheel controls in the car which with the new mobile phone law of 6 points and a £200 fine was the main reason I use the app. Now it's just like all the rest with the risk of breaking the law if I want to change radio stations, can you please sort this?  Update. Hi thanks for the reply, I have tried all the things you mentioned but still I can't use the car controls with the new update. I connect my phone via Bluetooth to the car radio system and so long as I click the favourites tab on the Radioplayer app I could select each station by using the steering wheel controls. Since the update it has not worked but this morning I searched for the previous version )March 2017) of the app in apk form downloaded it, installed it and now can use the steering wheel controls again to select stations. Kind regards",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRU1WY0FlUXdVcFRBQTJMLWdxVTgxUFk1Z1NKSjJZdnZPeUZsclZQTms4MVB1TUc0NEJCRzM2RHl5Yi10b2J3eFNzZkZfem5QNWpQM3pNSnc",
        "reply": {
            "author": "UK Radioplayer Ltd",
            "content": "Hi Tony, thanks for this. It would be good to know a bit more about how you're using the app. Are you using Bluetooth to switch stations (this should still work), or Android Auto (this should still work), or Car Mode? The latter is now easily accessed via the playbar (black band at bottom of app). Tap to expand it, and tap the icon with 4 squares.",
            "date": "February 26, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Andrew Bradley",
        "comment": "Hate the update!!! Why fix something  that wasn't broken? Too much RED and can't change colour scheme. Favourite list is sideways not top to bottom of screen.",
        "date": "February 23, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR0hCb0FuUHRKZEFkQnFyZXlMYU9DODhhVE5SdG5mc2l3bFdsS09hNnlHdG9IY0xuTFZSODYxbS1WRmh4N3IwZDJEMVQ2RXlwYnVUZDgzNlE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Steve Jacko",
        "comment": "Latest update has ruined everything and to top it off it's now an ad magnet. I can get a notification and after the tone has finished the app will replay and ad again every time.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR2d4VTY1bDIwcnA0Nk1VSW1YM2t1RWRNMzd1NnNMVTNxbzZ6SzNQU09pQXZsQ2g1YzJiZzFmOGVfY2J5UEE2VUhVejNTZXNNeUl2S3N6X3c",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Anne Pentney",
        "comment": "This should be the editors choice. It is easy to use and doesn't cut off.but why change the familiar icon?",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRTQ4NEY0amVTNVhDSHJsc29EUU1RTDBQNkJwTEIxQkVsNGNhUUh0RFZLRGdrTjhBU2FJMGRySDc3Y0R1VE9QdHVKYU8zMVdJUjhVa0hiMFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "DAVID PORTER",
        "comment": "Update has improved reliability of alarm function.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRmZkWGJvd3hTcHpDcF9ocTQtUGpHUlhmUFZHV0h6WFJyUXkwRXF2U1lXZ1dBMVh0RFdOTnBEcGFGck0tS25uV2thUGxHRGZUVlhGbFhRQXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Egyptian Manc",
        "comment": "I listen to the radio all day every day at work. Most evenings. And some weekends. I've tried pretty much every single android radio app out there. And this is by far my favorite. Simple. Clever. Quick. Can add favourites for quick access. No intrusive annoying ads. Ability to set an alarm. So I can finally wake up to The Chris Moyles show again. Brilliant app. Love it. One of the best android apps out there.",
        "date": "August 23, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRUZiMFZQLTVlVFl1RmQ2V3NZWl80alU4TXpDNlJHLTZRLXRKWmtxWjl2TWpUTFVLUE1DeVdtQ3lYMHpjQk1vdmktTjFVSXRUZ2hDc1FXVWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Simon Waite",
        "comment": "Brilliant! Only wish it was comparable with Google Assistant/Home. When you lose data signal the app restarts playback as soon as you are back online. You are not bombarded with ads. When via car Bluetooth you can use steering wheel controls to skip though my chosen favourite stations. When I get out the car and get back in the radio starts again automatically. If I switch to a different input the app will automatically pause playback to save data and auto restarts when you go back to Bluetooth source. Top radio app for sure.",
        "date": "November 12, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPSDBRZ0xYZXRsaEpEeFVxSGlRemxyWno4Mm1NSmxvdm1ZWlJpRmpVaWUzN1B2LTRiRUFCRVV1ajdlblpuRHBSZ3IzZTROajdHc2d4VDlaMFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Stuart Cormie",
        "comment": "Use it all the time in the car to listen to stations like 5 live and TalkSport, whose AM signals can be vague to say the least, especially in remote areas at night. With this app on my Three network handset, I get strong, steady streams all over the UK. The app's also great for picking up local stations from afar on my travels. I like that I can use Forward/Next on my car's steering wheel control to cycle through the stations I have set up as favourties. I find the Chromecast support and the sleep timer genuinely useful too in the home. The only thing missing that I'd like to see is an ability to sync Favourites lists across multiple devices. But as it stands it's a true gem, this app.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRk00Y1BTVmZ0LU9nU3J0MWVLaDBCX1h2RDFyYVVvOTViMnM4LU9GdjlQY1FkS05RbUxHRjNwUW96eFFBMDFlMldJdThRZzlBZWlJd0ZpY1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Christopher Hunt",
        "comment": "So far this app hasn't stopped for no reason, hasn't decided for me what station I should be listening to, hasn't requested I download any affiliate apps. Doing well for now. But, if I choose a catchup program and don't finish listening to it, the app will start from the beginning of the program and doesn't show it in the recent screen. Other than that, thoroughly good so far.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRjRSWTgzLVh0T05kT2ZLY2NERlNtcFc2ZU9qeklSZURKQTRabHRHcGVMS2R5eVVfWW96TUQ3d2hHV2J2OFdaQWFjeGN3RkNrTGFwYjRyVlE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "MrRazza1111",
        "comment": "Found this app thanks to the bbc introduction of sign in for radio!! Appalling in my eyes and I will not be taking part of the personal information trade game.. Luckily this had a much better user friendly interface and is so far flawless for what I need from it!",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR2t3Z0d6aXZ4RUtjVkhVNFIzNVJPblpna2dwQ3cwTk1MTEdxS2dYc0IyaWZCVnFTTjNmTGx0aVN6WVlfOG52NnlhZmlYM1psRWJmUFN1SHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Francisco Cooney",
        "comment": "One of the best radio apps available.  Although, it has a tendency to crash - resulting in me having to uninstall, then reinstall the app.  I often enjoy listening to 'catch-up' programmes, however, it sometimes crashes for no apparent reason and, when I try to restart it - it just goes straight back to the very beginning of the show I had been listening to.  Additionally, if I pause a show for a few minutes, when I attempt to get back to the exact point of the programme that I had stopped at, it keeps saying 'Sorry, that catch-up item is not available at the moment.'  Consequently, I have to wait several hours to access that particular programme again.  Very frustrating.   The concept is great, but needs a bit of tweaking for it to be functional and more user friendly.  Could also do with a timer /clock on the app, making it easier to navigate to a certain point during a 'catch-up' programme. Definitely room for improvement, but still remains a personal favourite of mine.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRUU0V1VjOTZCMDJDZUw2ZjF4OFJVaHBnUUFySTZOMGZ0S3RhNk5UTFZuYS0ycGZSVW8wSVhhX2ROenM3aXFBWXRkYVljY2k0b1N4N3VjSmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "V. Good radio app, especially for listening to digital and local radio stations across the country. Sometimes hangs up into car, but not sure if that is due to my phone or mobile signal. Not heavy on data.",
        "date": "December 17, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPSG12UDFkLW1DRGpHbWs2NkdKZjdvVENHZzFfZHJqWlhRc2F6aGVtZjN5TlJUSWRxbHVCT3FnWVpMTTFoNUxQeGUzVTVjVE1GZWlfMWNZMVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "It was my favourite radio app to use with chromecast, untill you've changed the cast background to show pictures. Please change the cast background to black as it was before, or at least give an option to switch it off. I had to change to different app, because displaying still images for longer time is no good for any tv.",
        "date": "October 21, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRV9FYWRPbHd4V3BYYVd1UGFBcHdnOTc5Wm5kbjQ3SW1kNjZYODZvQ2p3d296UFBzLVFZdEJLUlhhYWpTTHdiVWl0WXpvemQ3dHlhT1RwQlE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "9/2016 and two yrs on I still love this app.     Knocks spots off dab digital radio and no need to use headfones as aeriel either.",
        "date": "August 2, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRmtxcmtjYzl4TjVoZ0ptY05HbVFlRWFxTkdwQTNUUFBUTjFHd2pxOW9ZX1FTTTBiZTF5aGlieXI4Sld1UXlYSDJJOGVaZnVoNlJOcmpsZnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Piers Whiting",
        "comment": "It looks good, but I haven't yet managed to open a single station without the app crashing.  Emailed the developers twice and sent a number of crash reports, but have had no response.",
        "date": "September 16, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRVBRbnZSVk5MYnVlV1BpRnNFV0UtVWx4QzAzUW9nUldzbzd2OFB1U3c3SWYzZVhDQTJ2TjZQa3NTV0J2eTlUZ053eDdTdHZyLXhuT0NpU0E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Christians In My Soup",
        "comment": "Used to be the best radio app around but since uploading it to my Galaxy Tab A it never remembers my favourites, emptying the favourites list every time i come out of the app. Leaving me having to SEARCH for the stations i want EVERY time i open the APP. RUBBISH ! I'm looking for a replacement app",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRU5RNG1GanlxZnlnbzhaVXJVd1lCdzgzejdSaFFTY0F4dTFZRWRrUTBKQnBQX0JGa0FTYnk1ckxiTjdtVUdCSlBfbXBUSzNDZ2QwYTA5dWc",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "G lappy",
        "comment": "Galaxy S7 Edge. Has almost every UK station listed except my own local radio Mansfield 103.2 . Needs option to buffer for longer if listener needs it. Also I am a delivery driver in and out of van every few minutes, so needs option to stay connected instead of having to restart each time I get back in van which is a pain. Otherwise good app much better than Tune In which is rubbish.",
        "date": "October 18, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRXVuUXJyanVMT0RCMGJELXgwSE1JUjRaMkhjWGhqaFF0TTZKTmtfU3VXbnFlUl8wMmFWWWRDSmJielBua2NmbkpVQnFsbEFlTUtqaHg5bHc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ben Williams",
        "comment": "Best radio app around.  Shame kids radio mixed with comedy & drama category as it makes the list a bit long to scroll through but, frankly, that's the only downside that pops out at me.",
        "date": "September 19, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRjFyOG1qN2RXOUY0dlhKeWt3Q0tyRXZ0ODJaZThCNlhPOExFVE1CRTlONVBYWkZBeTluSGw0bnNWWXhDdlhacjMtb08zTTZuTkM2ZWNZRmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rob",
        "comment": "Best radio app out there. Only issue is after I exit the app the widget still shows up when I get notifications from messages etc. To fix this I disabled all notifications. Needs a re-design.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRzBKdkJvQ3hXR0l3VzBmNWxqUGxUc19yQ3h1N0NaMFBUSTdPYU1iaHZIMlAyTXVVQ01IRlF5OXdDQ3BNSGg4VlJ2Zk9TWVVON08wQVdTM0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Ditched the BBC app as it had innappropriate permissions & very buggy. This app is a thing of joy. No stuttering, just works. Top job developers, change management  & testers. (If anyone thinks i am being overly kind, look at some of my  other reviews!!) EDIT, WHY THE NEW PERMISSIONS TO VIEW WIFI CONNECTIONS.....NOT UPDATING. ANY MORE INNAPPROPRIATE CONDITIONS AND THIS APP WILL GO TO THE SAME PLACE AS THE BBC APP.",
        "date": "September 2, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRTlLY2o0WGVOaWVyb1lEMTVqSXZVVzdUUzBib3VPNV80WmZCYmpab0ljYjJ4ZExDSDBBVlVfcVpENE9fVDJZcFJfczBqS1ZNTnFhbnlXREE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "David Sim",
        "comment": "Can be very slow to load, even on WiFi. In Android auto sometimes fails to load list of stations. Once it's going good, it works well, although it would be useful to buffer for longer as an option.",
        "date": "August 1, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPSEhfSm9fYjNiV1BGdllqcHRaazlmU0s1VkRRNXRfZW5haWU4aDA2bXhlYVBrWDlLbGRVWmFmaTZ4SVhMR1dneHZlQXpZcEJpUjJwMnBCYmc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jason M",
        "comment": "Used to be brilliant, but now it switches itself off whenever I try to listen to a station. Tried uninstalling and reinstalling it. Same thing is happening. Such a shame as it really was a great app.",
        "date": "July 24, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR0c3SzJuVXZfWjBHZnFjWGRqNng5NFhRejdUSmNoUVAzNWRIMHphMzNETXJTWFdycllPR1R6LUJMRXMtRFh6eVJsa19CRmFPamNFMHZQbkE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Bill Brown",
        "comment": "Very good sound but switches off when the screen closes. Seems to be OK in Car Mode. Any ideas how to fix this very annoying feature?.",
        "date": "August 8, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR3BtWXl0RnZLQWdOZHhxNmNsMHROZy1tU285NWZqU01SbHU3WDhjaDZEUVZvOS1BTExlSjFITVBFRnhrUDkzQ1pDUDE2U1FYeHpsQjlUQ2c",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Jackie Skidmore",
        "comment": "I totally love this app and would recommend it to anyone/everyone.  It isn't a battery hog and rarely falters, and I have the app running most of the day, every day. I can honestly say I've run it almost every day in 2017, except the week I went on holiday, and I wouldn't be without it.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPSFVTRjA2Uy1QTkFvWWJESTM2blpXbmJEM0dWVUxYV3o2NEZQSmdHMXJPZHhPREFwbnJJNXNKX05fMnFnRjM0RWJLck9PQ0p2V1I1cDByaWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Alan Jack",
        "comment": "I've used this app all over the world. Let's me listen to my local radio station, which is a favourite of mine, anywhere I can get a data or Wi-Fi signal. List of available stations is mind blowing! Keep up the good work!",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR1p4SXRFVnU4SnVJNUg1UzBBT3M5N2dRaGgtNDhtaXJHUTluZG4xSlR6OFR4WnZNZDlJYjNndFZuaHVvODBjUW9mSHVwRnF3UzA5emtQZGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Damian Woods",
        "comment": "Stable and lots of stations but car mode is rubbish. No option to always load in car mode and space for only 4 stations. Why is so much space given to the station name (which doesn't auto fit long names) and play /stop button?",
        "date": "August 4, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPSHNORjlOVDhOaHJlS0k0Ql9pWTV2ay1VeWRNOEpxVU9rT3Y0Z28xVnZmQ0VaQUZibmFWYjNoZXYzdFhpSktCRzZycHktcjh1NDVuREtMVEE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Ryan Brooker",
        "comment": "Great little app, has all the UK based radio stations I listen to. I've actually uninstall the specific radio apps. Alarm wake up works well.",
        "date": "September 6, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR1JxcUwtZHNlNzlUZEpYUFdIT214cTBCLTZYTGxHdWI3T1o1WHJ1RE9sSVg2TkRiX3R6ZXlRNjBTSU5LOVdaenN2M1hGdHR6WnNxTjdUZnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jay Carter",
        "comment": "Good overall but always loses my favourite stations from the list, even when I select one of them and the heart is red to say it's a favourite. Still an empty list. Shame.",
        "date": "September 18, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRTVEelNHeWRDbGZXczVNTjBfYnRBRmVwZGd0empwRkNuakhQQk1PWHdQb1g4aHNYRUZZcENxTUJ4cVJ5Y2QwODRWTjRNRFNZazA0UjRHUmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "William G",
        "comment": "Picks up out of area radio stations along with some local ones. No FM antenna required, just a data connection. Easy to use. Problems fixed quickly, what is there not to love? 5 stars from me.",
        "date": "September 25, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR3AzSXNhSGMyMlVETllNR0xBNnEwZWdxTDJQQWIxR3hSb0FXRXJaOXVSd09pYjdxSnBCMllvRVZEWDF0LW41RWFZYkJLWllmQTVmT2xsUXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Graeme Francis",
        "comment": "Probably the best free radio app out there but recent updates seem to make it stay active all day even when you're not using it. You close it on the lock screen but back it comes. Also appears as one of the top battery draining apps. Even askng android to put it to sleep doesn't stop it! Never used to behave like this",
        "date": "September 2, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPSGt2SDcwb0pNNkowVDVWX0Zhc3liX3dmV0gtSGJSS3J3XzUxMXMwVW1CZWQyQjNiN2tWSjBLMlZEWFRPM1oxWG5QMFotYkZNZG9ia2RHblE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "David Paterson",
        "comment": "Only spoiled by not being able to find THE ARROW. A great adult rock station that used to be available on Sky. However can't have everything!",
        "date": "July 2, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRWs2NlRsMDNHZXBDdHQ3X0VHOFU0MEJ0bnpCU3drQWVEa2hwSHRXNmY2dEgtU1FEUWY4alFHVTVyT21sVU5qSVZhZWlHVmptVGRlRzFFWFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Guy Sanftleben",
        "comment": "Free UK radio until you go abroad. Then none of the BBC channels will work. What a rotten organisation the Beeb is becoming. Funded through taxation but firewalling all their material like a private business with profits to protect. Can't have it both ways. Its time to cut the BBC loose and let it go head to head with Netflix and Amazon Prime. All previous programming of an educational nature should be immediately placed in the public domain for free access, anywhere. Afterall, it belongs to the UK taxpayer.",
        "date": "September 12, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPSGRaUWVySGpncEVteHczRkh2UHR4RTVDd3cwTHBnSDF1NjVuWHVNR2lmUnpLZDVHMmJ1Z2U4dEZ5ck0xekNCcUZTejE2ZVEzbjZpUmhFSmc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "George Lund",
        "comment": "Often when it loads, lists like recent and favourites are blank. You can find a station, but then the app restarts itself before playing anything. This is becoming too annoying.",
        "date": "December 4, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRUxaeWg3UzNNc2M5Rk5fS0NCQ19SSUU1Tk95Szc2TGgwZUdmU3pKN1ZuckI4Z3phYjRnX054c3MtMjJ3ZUVaTFY1S25XYjdaT1dGd2I0Rmc",
        "reply": {
            "author": "UK Radioplayer Ltd",
            "content": "Hi George, can you please let us know if you are still experiencing problems on startup and with your alarm settings by emailing contact@radioplayer.co.uk. Thanks.",
            "date": "December 29, 2015"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Paul O'Shea",
        "comment": "Very good app.  Straightforward and simple to use. I have used other apps like this that become more complicated with later versions. Let's hope the developers avoid this",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRWdfMWJyaklpb2hsUWd1dE9vSGxvX3dhemJiS2hxeWd5ZTFTd2RkN1FwbnQ2Y0lfMVJUTVNxMnhDdFNnaC1CYXV0V1FyTVRGeEROdXhRV2c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Keeps starting on its own for no apparent reason. Not good when in a meeting",
        "date": "September 4, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRkVKX2JMc2U1RUdPS3hRSjBZMEdiQmp5aDJWNFJqQmJsOHNyY0thMlE3bXlDYW80UER5TDE5RU9CSXhQVzZhTUd6SmVERzNMYWpyY2M5UkE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Go Swans",
        "comment": "Pointless, needs internet so why would you use this ahead apps that cover internet stations and stations worldwide. Uninstalled very quickly",
        "date": "July 23, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRW0yem9YY0MwWUQxcmZSU0UzMnpXd21PVXdFMHVCSVBsYWY4emUxUlpRd2hLNTlUWlllT1kxdUNEeG02RHRkSVVrMGNUZUdwSHl2WlJrVUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Grahame Jackson",
        "comment": "Nice solid app, only discovered because Amazon Echo cant find Magic UK on tune in so started using radio player and now have the app on my android devices. All the station I want and user friendly interface, nice app.",
        "date": "July 1, 2017",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPR2Q1WGdmOU5ieUFVVFctVHV5a1R4M1RkempzUThCV1RENzJFSElmSUJSWXp5R1gzLXM1RDBub1ZRMmdZY1ozZm5xcmZYSmZjQnQ3amR4ZEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Daniel Sims",
        "comment": "Finally a radio app with alarm and sleep functions, shame alarm is a little temperamental. Would be perfect otherwise.",
        "date": "January 13, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPSFV5VWNSV1J4ZzZkOUtxSGpGenFJb21VZWVvMjVCY2RTWEFaT0t0UEs2MWVOYWRYS282bDZ0ZTVaM3VmWk1mQWpwSF9CbjhXa2ZYU2RTWEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Simon Howell",
        "comment": "Plays like a dream.i only want to listen to kisstoryas my dab stereo cant pick the signal up..i plug my phone into stereo and blast it out lol. Will try other stations later.so far so good 👍👍  edit...the app now keeps shutting down the radio station,internet is not the problem...",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=uk.co.radioplayer&reviewId=Z3A6QU9xcFRPRi05bGNIWjl6VGZRb1pqYlhYTHhLSGxwRks5c3BoNUFrNjdrOVZKTVdiSmlnTHQ1Z0ZPLW02NWFtcXkxVHE4emlhTVBjMy1QSVR0aXBIaUE",
        "reply": null,
        "star": 3,
        "title": null
    }
]