[
    {
        "author": "Andrew Yu",
        "comment": "Was looking for a good watch face that wasn't too busy but at the same time had decent enough info. This hit the balance perfectly. Only thing I might change would be to lighten up the background a little. Even with the brightest setting on the watch, during the day, the background just looks black and you can't see any of the cool details. But that's a minor gripe. Don't let the low download count dissuade you. I whole heartedly recommend this.",
        "date": "June 30, 2015",
        "permlink": "/store/apps/details?id=vizor.wmwatch.vcomet.square.pr&reviewId=Z3A6QU9xcFRPRjFWbGZNdkwzam1qcnNxb2NKbGdOTlE0MFFMb0FBUjBHMGQwRS1tQkwyd0VIbXN3NzFMUGtrUUM2S3hKbzU4ZVQydnZsTkNOcVM4QlF4cnc",
        "reply": null,
        "star": 5,
        "title": "Works great with LG G watch"
    },
    {
        "author": "David Stokes",
        "comment": "I really like this watch face.  It looks good and has a bunch of settings.  The only problem for me on my G Watch is that it runs choppy when I switch between the screens. Also it's not very battery friendly. I could still go through the day, but it definitely was using that battery.",
        "date": "October 21, 2015",
        "permlink": "/store/apps/details?id=vizor.wmwatch.vcomet.square.pr&reviewId=Z3A6QU9xcFRPRVM3SjljS0dFcjhuel9CcjBOVmFXUWp0VDV5ZmdpdkkzcFM1Y1ZEZjNTcERFMnlwQ1BReUkwV3dZUlJ0dkpSU2ZjQ0ViX2lpdFF3RTMzc2c",
        "reply": null,
        "star": 5,
        "title": "Really Good but..."
    },
    {
        "author": "Franco Collino",
        "comment": "Can you fix the pedometer feature? I have a Samsung Galaxy Fear each and i purchased the premium version be cause the free version said you had to buy the premium version for that feature to work... I purchased this watch face as the round face by mistake and the steps were accurate but i wanted the square face version for my watch.. I got a refund on the round face and purchased the square face version but the steps on this version show 0 instead of what they should be.. The round face version The step counter worked correctly.. Can you fix?",
        "date": "February 19, 2016",
        "permlink": "/store/apps/details?id=vizor.wmwatch.vcomet.square.pr&reviewId=Z3A6QU9xcFRPRU1iRHRDdUVvU09BekZEQjlUNGJkd2ZKVHUzNC16dmpUUnFVcFlmLURjN2xxOXdXT2R1VElmOHpUdFNDTkpCTnJrclVNUm9XN0dwMU5BRmc",
        "reply": {
            "author": "VizorWatch",
            "content": "Hello. It's very strange. Try restarting your device.",
            "date": "February 20, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Andy Bartlett",
        "comment": "Love this watch face specially because I have a Sony smartwatch 3, one thing i really would like to see on all your watch faces is the option for Weather Underground as i have found them to be more accurate in my country :-)",
        "date": "June 27, 2015",
        "permlink": "/store/apps/details?id=vizor.wmwatch.vcomet.square.pr&reviewId=Z3A6QU9xcFRPR0IzVXlULWNqX1RRdTFZQ2dfM3RUbUhJNVhyRzRBd2FHOS1PWU1yeWdkbkxSLUlyRGw1U0xxN1ZUaHJTSlo0Y3NnZ1FFVWk0NUlRdlRHbXc",
        "reply": {
            "author": "VizorWatch",
            "content": "Hello, Andy! Unfortunately, these watch faces can only work with the data provided by the program WatchMaker. WatchMaker only provides data from two weather providers: OpenWeatherMap and Yahoo Weather. To choose between them you can in the settings WatchMaker.\n\nThank you for such a nice review! And pleasant use!",
            "date": "June 27, 2015"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alex Yee",
        "comment": "I love the animations and all the info! But how do I enable the 12 hour function? Also could you possibly make the weather font a little larger?",
        "date": "July 3, 2015",
        "permlink": "/store/apps/details?id=vizor.wmwatch.vcomet.square.pr&reviewId=Z3A6QU9xcFRPRng1dVd1RnppYjZ0d2hMVG10UEhDVXJZSE9EUWNPQWluaGZNb1RTXzNoeFFsa2hjdk9nUWtZTHVSYWFBUW5Xb0RabGoxSUdGSUpKYzdIaEE",
        "reply": null,
        "star": 5,
        "title": "Love it, but..."
    },
    {
        "author": "yun zheng",
        "comment": "Works well with my Sony SW3, is that possible to add clock color support ? I mean the default color is white I prefer yellow or red. Thx",
        "date": "June 28, 2015",
        "permlink": "/store/apps/details?id=vizor.wmwatch.vcomet.square.pr&reviewId=Z3A6QU9xcFRPR0drY3ctT1hSaUE0aWRjT0JHUjVBcG5jdjloVVE3RHVMcTBIQm5FWUtJUnM0NmhlRnU4c3N3V3NrSzN5YTJSNFI2dVk0Q2lvakg5WFgtckE",
        "reply": null,
        "star": 5,
        "title": "Good job"
    }
]