[
    {
        "author": "Steven Brown",
        "comment": "So far so good. Kinda sucks that I'm a premium member yet the wear app wasn't allowing me the full premium experience. Small price to pay. So. I'm interested to see were the further development with this app. Bosses and customers really get bees in their bonnet when mobile are accessed  on the shop floor. I normally allow the playlist to ride until the wheels fall off. Yet this app allows me to control the mobile in an unconventional manner.",
        "date": "October 26, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRm9QMnFmbmZUR2pPeEsxalpvLXZJVFBoSlpITmZMNi00NkJpWk9PQXZnQklHTjZxWWFGd3FaOXVvS2dKY0haeXBQRzVTdjNJc0twYkZPRTZZ",
        "reply": null,
        "star": 4,
        "title": "Wearable spotify control"
    },
    {
        "author": "Robert Benn",
        "comment": "Nice handy app. I work out at the gym and love to just say an Artist name and Michael Buble! It starts playing! It would be nice if you can add queues! *update* starting to lose connection and not reading sodify. Delete and restart, works then will not communicate.",
        "date": "May 20, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSGF4SDk0YjIwaEw5eDdDWmhEWnVsYmRERzJKVlJUTGhiUVVqNkJyYkxUZDFSTkR5aFJLNnBuUlhCaGFVRWpvRXhxQTkwbWlVRmt1Y2k4azhF",
        "reply": null,
        "star": 2,
        "title": "Asus Watch"
    },
    {
        "author": "Arlene Budiardjono",
        "comment": "Paid for premium to be able to choose the songs I wanted rather than shuffle a playlist. When I go into \"Current Playlist\" and select a song it does not play the song I choose (yes I made sure I was not pressing a different song). It plays another song from the same playlist. This is a huge problem, devs. Fix it and this app would be great for the Moto 360 and worth 5 stars. Edit: the song I selected, the song playing, and the song displayed are all different. Yikes.",
        "date": "June 15, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRzVoemZmZ0NtZW1NSzVMRW8wXzRWYTlfaUJOQm02R0hXM281RFgxOTlwa3Q0VHdYNnItR2E5c0FTdE5WZ0VmUHl4SU5CZ2s1YlBpcVVwNkxv",
        "reply": {
            "author": "Wearable Software",
            "content": "We will fix this soon. Please stay tuned.",
            "date": "June 16, 2015"
        },
        "star": 2,
        "title": "Huge Problem"
    },
    {
        "author": "Marcus Goosey",
        "comment": "I swiped left, hit chose playlist, hit the one I wanted and nothing happened... I dont have spotify premium but shouldnt it just start playing through the playlist on shuffle??? Otherwise i see no way for the app to be useful without premium.. EDIT: Brought spotify premium and its workin very well now, could be a bit smoother but does the job nicely",
        "date": "August 15, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRjRZLWdXaTRBX0lMb3lRMEZ1MXRsSDc3Rlp2ckZ0SjROZDUxY09xelFMMlJEenBMS2lRNE9XOWt0emw1VHNkNWtialZoZktOeGRqV0RhS1dr",
        "reply": null,
        "star": 5,
        "title": "Think you need premium"
    },
    {
        "author": "Daimen Worrall",
        "comment": "OK, so i got the app and bought the paid version.  It's a nice little app - more reliable than the default watch music control and has more features.  However, one thing that really frustrates me is choosing a song on the playlist and it resetting my position every time. It should remember where i was scrolled to on the playlist.  If this is fixed i will up my rating.  Thanks.",
        "date": "June 1, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRU1BRUM2ZkRCOEVqQzRfZllxNVRydEphTjJ5QlYwM2FzeTVJamxNQTI2NDBMaFd2UkkxWnJqQWlBV3BYTkZYZFFMeS1DNmowNzlIRW5DSndV",
        "reply": null,
        "star": 3,
        "title": "..."
    },
    {
        "author": "Jack Wolford",
        "comment": "Apparently this app only works on a few smart watch devices. I tried to email for support got no response. Read the full description before purchase and make sure it is compatible with your device. I would like a refund but i wont hold my breath.",
        "date": "December 29, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPR0FPMjZkMVliNW5HU3NwVlMtWUxGZWg2WVdmMGhZS3ZTTU9ibXl6NTNCOFdYN2hVaGRZWU5LdkNYSHltLUFtZ2NxY3N5V1F5U1dPWEVNckhF",
        "reply": null,
        "star": 1,
        "title": "Does not work on my gear fit 2"
    },
    {
        "author": "",
        "comment": "Does not allow you to play offline Spotify on your smartwatch as it claims to do. And unable to get refund surprisingly even though it does not do what it says it is supposed to do with all settings as described. Should be removed from Google Play if unable to get refunded. Feel scammed.",
        "date": "October 23, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRnhZeVhIaUJZRmk2aVNFWV9NOFhfSU93N19EVGEyLTFYeXAzbUszSlU3amFsZG85TlgycEZvUFRIY1JZWG9Pa0I4Uzg0R1c3M0ZYZWRuM2dj",
        "reply": null,
        "star": 1,
        "title": "Dont waste your money"
    },
    {
        "author": "Marie G. Golubski-Allen",
        "comment": "I need a refund doesn't play music on my LG Urbane Android Wear Version only on my phone both the phone and the watch are connected. I have the box checked for Device Broadcast Status on the Spotify app I have a premium account on Spotify. On your app on my phone I have the box checked for beta version premium version and still can't hear any music on my watch. If your app is only to be used as a remote control than you need to let everyone know that ahead of time so they don't waste their time and money.",
        "date": "July 4, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSEJKaTBjaDU0OFJxeEExbzFtT2huX1FRR1Fnd2hwNXJ2d3lUUmpoaVVVOHJhM2tsUzQ4NG52VWhNTUR5UGdqclRPd2JpN25vVFVTdGs5NmtJ",
        "reply": null,
        "star": 1,
        "title": "Is only a remote control for your phone"
    },
    {
        "author": "Ryan McElwee",
        "comment": "Can't hit play after pausiñg song on watch. Should be option to use as default music player. Sometimes I have something playing on Spotify, wear Spotify and google and its confusing as hell. Could be a bit faster. Only gets 2nd star cuz I like the layout.",
        "date": "May 24, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRmI0YmtRRFlNWW9Nak4tU3JLXzRFSGtPQUpyUHFCLTlXaDVLcmFJMWVtbW11WWppS2FLeVoyckt4Sl9ndHJ2UnE0bnRpTXlHZjc1ZXEyLWhB",
        "reply": {
            "author": "Wearable Software",
            "content": "We cannot use the default music player because we stream music from Spotify. Please review again. Thanks.",
            "date": "May 27, 2015"
        },
        "star": 2,
        "title": "Room for improvement"
    },
    {
        "author": "Eashrak Zubair",
        "comment": "I love spotify so of course I got this app for my moto 360. It wasn't working at first so I uninstalled and reinstalled and bought the app. It worked right after I bought it, and then I tried it a couple of days later and it wasn't working. I tried restarting both my phone and my watch but it didn't work. I tried it today and it didn't work. I uninstalled and reinstalled, and guess what? It didn't work. I want a refund, thank you.",
        "date": "April 30, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPR2xqZG5ZaGM3ejFYLVlzOFZtZGQxYkViT0pnX3V5NHhOVGEyVll4RnNkNW50MExCYnRYcEdDZl9VN0pMTGRsU0ZSMFlVNUxXYnE3VlFPcXVF",
        "reply": null,
        "star": 1,
        "title": "Doesn't work"
    },
    {
        "author": "earnestrobinsingh jacob",
        "comment": "I have a spotify premium account.but still cannot choose the song I want .it always goes to shuffle..I  pirchased your full version too.nothing changed. And the finding song by speaking never works .no feautres of repeat,shuffle,increasing or decreasing volume available on mylg g watch r .please refund the money",
        "date": "December 23, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSG1xcjhlb0dSTEdvZGFnRGZjS3FpSHBWVkVFNThzckp4bDFSS3ZmRnEtQ3VFMnJfMVRzZVBLd1hlQURTYVEybWNWOUNMRU1QYUlwcG9mcjJr",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Jacob Ivener",
        "comment": "I had to uninstall and re-install this to get my playlists to show up (I was just getting a black screen the first time I installed it).  It works ok, now.  It would be nice to be able to see the folders I have in Spotify since all my playlists are organized in folders.  Also, if I pause a track, there isn't a play button that appears to continue playing (only the previous track, next track, and pause...which it's already paused).",
        "date": "April 26, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRlBBWmhsOTdGNzQwdXJ3a1lmbDdadFduQjZKMGJjRW11MnMtdVRkRkZXSlNMa3NkOGN4OHU3XzYyY2xrdnBHTmVVXy1ZOXRLWXl3cE1CNUM4",
        "reply": null,
        "star": 3,
        "title": "Not bad, but needs a little work"
    },
    {
        "author": "Lee Gavin",
        "comment": "I think i have misinterpreted the description of what this app does.. I thought it would allow me to download/store my spotify songs on my watch so didn't need phone if was running...Can't see why you would need this when spotify have own function to control music from watch",
        "date": "December 30, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRklrN19WQzlaRFc3WTVMbTctWmowV3U0ZEZlcVJrMXBCLXRacWZOaDJNM3hSWFdGYmZQX0w4VUFIdmpxMEw4LXRWSlQ2ZUpOTVhpc2dqQm9Z",
        "reply": null,
        "star": 2,
        "title": "Not really sure of its purpose- description misleading"
    },
    {
        "author": "Greg Hk",
        "comment": "Basic but functional interface. Does what it says, controls Spotify from your watch, however since the initial install have had intermittent problems, like other users have reported: problems with communicating with the phone, black screen, message saying Spotify has stopped. Once these have been fixed will be 5 stars",
        "date": "May 9, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRVVqb3BZamVTY3JTWlpmNC1DWnZIM0pmRFlYZk9zRFpFaTRMSkdYOHNfMGIyQ1VMREctUUtLRzJYNW5GWlJTN2s2b2JFdFFpMnJES1F3ZEk4",
        "reply": null,
        "star": 3,
        "title": "Works great but..."
    },
    {
        "author": "Kyle Hall",
        "comment": "Just got an LG Urbane today and tried buying the Premium version of this app. Every time I try, however, I get a \"This payment method has been declined\" message. I have tried several payment methods but all throw the same error.  UPDATE (8/4/15) - Tried again today and it went through. Thanks for the fix!",
        "date": "August 4, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSDF5MmdyaFpkZUREQ281eVRrb2pBdWFLNS1nZHNTdjc4SzVWaTVQYmJKakZtS1ZZRjRnNWdzRXlKVGxoNmt4V2x6Rm1BOEIxSXRITEVXMFpJ",
        "reply": {
            "author": "Wearable Software",
            "content": "Hi Kyle. This was a Google Play issue. Please try it again.",
            "date": "July 26, 2015"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Sometimes one can make a song play in Spotify but mostly not. Neither the app on phone or watch is responding to any button press. I couldn't chose a Playlist. Skipping songs, no response. A fine idea packaged in an utterly useless crappy app! Deleted.",
        "date": "November 2, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSHNWbFdGWmJ1QnhKLW5vN3AxTy14UHNyTXJzbER0U3ZISWhwSFpLMkZ1bVRLOFdYU1huV0g3TVhXRTItaHVyTFRGY05xTElFNkpVRjBQVFhB",
        "reply": null,
        "star": 1,
        "title": "Utterly useless crap!"
    },
    {
        "author": "Carlos Asenvader",
        "comment": "Good app much better than the default app but my one problem is i can,t get it to quit when finished. I swipe it away but it keeps starting up again only way i can get it to quit is by restarting my watch (SW3)  So 3 stars because of the quit issue.",
        "date": "November 7, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRUI3RjlLWkFnOFpTcDBydGVab3RkaVV5M1BJaU9yMHVYY19XTjM3eEprRC1OOHA2S05KYnpEVTkyZGJaU3RKLXdaOW1wWkNpb2pqU2xoNUF3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "David Bowditch",
        "comment": "Can say this app is completely useless for me, when launching the app on the watch it can't connect to my phone. Luckily if I launch Spotify on my phone first my watch can control Spotify without the app!",
        "date": "April 8, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRjBZQ3FPeVJhQ29jNktLRl9VVkFSSkxsYXdiNUFNVHdLLXludVVfdzhfRHlVRGJpbTEwcm9YT05KZTljc3kxT0tIaEFTVVZMZWs0SXR4QkF3",
        "reply": null,
        "star": 1,
        "title": "Needs work"
    },
    {
        "author": "lynda pearson",
        "comment": "it could be a great app but i have to have the screen of my phone on for the app to launch and the music to play otherwise it will not play the music requested by voice command or skip tracks using touch unless the screen is on, i dont want my screen to be constantly on whilst im listening to music. dissapointed, if this could be sorted out it would definitely get 5 stars!  :) please fix this!",
        "date": "November 19, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRVRaQk1PTjJmSzBVX0pZX182bWxfQ3BZN3BZMS10bm5TcnltT3dZRlRtSEg0Mkowb19CWndzdy1rMmFHWmh5RXBwSEFNNmd0c1VTLTQzMTNr",
        "reply": null,
        "star": 1,
        "title": "paid for app but doesnt work properly!"
    },
    {
        "author": "Victor Resto",
        "comment": "The overall gist of the app is solid, but certain features need tweaking. For example, starting the app outright from the watch has a tendency to have an inconsistent start. Sometimes it launches. Sometimes it doesn't. The voice function also needs a little tweaking. When I try to launch a radio from the watch, it doesn't work, even though that is one of the listed commands available.  I also think the price may be a little high for the premium service. A buck to a buck 50 would be reasonable. LG G Watch R",
        "date": "June 23, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRy1BeGk4YTlpc2VVUmQ4N2RHMkdLU1BkT0dGME9CYUtBVi1QVUtYRE13WU8yc2dvSFhfUThnOUdGT0hlTzY0YnlKZkhnRjRjSUJKQXRVUHIw",
        "reply": null,
        "star": 3,
        "title": "Not bad... Needs improvements..."
    },
    {
        "author": "stanley damanley",
        "comment": "This is a joke. No support no nothing. I bought a polar m600 to enjoy offline spotify during runs. But NOTHING WORKS. Terrible interface and it just works as a bad spotify remote. No offline playback. And no explanation what premium upgrade for this app gives you. I'm a premium spotify account user and for the First time I've ever considered moving to Google play music... Get your act together!!!!",
        "date": "November 30, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPR2xWOEFmZnNsalhfanNWaTBrOFVJNVVIVnlQcEVINzdBa21oeVFSQ2xwQk4yWlg4NnVOMG11VWF6bjVyNTRtOVd1V05NWk5zOWVlUG9Ba05Z",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Dave Payne",
        "comment": "Paid for the premium upgrade and crashes when I try and play anything.. hopefully will be able to uninstall and get a refund 😞",
        "date": "November 2, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRTA2aU1jVGp3UUQ0NFVUN1NPeFVMbFZETjJkMk5uR3NaNWZwQ091RkhMY3R0LTF3Mk5SSkk3bXpyeVc1Zl94N0QyMkMyZFJxVUhxLUR0YldB",
        "reply": null,
        "star": 1,
        "title": "Doesn't work"
    },
    {
        "author": "Peter Moss",
        "comment": "I love the app so far. It seems to play my music much louder than the official app too, which is a bonus. However, when I hit pause then hit pause again it doesn't start my music. I have to go back to my phone and hit play, which kind of defeats the point of the software. Also, when I get a call the music continues playing. If these issues were fixed then defo 5 stars. I wrote an email to the devs 7 days ago about this but not heard back yet, hence my review.",
        "date": "May 21, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPR3hfRjdHLTFSd3Bjeks5YXh4QlpoTTg1OGc1dnF2SmNfbmIzakg5Q3FRbmt2YlZ1OVRrRVVrbHY1WkNDc1pFUXdBWmdYUzdVM2Q0RWg0alAw",
        "reply": {
            "author": "Wearable Software",
            "content": "Please check your spam folder. We wrote an email. Write us again if you did not get an answer. Please review again. Thank you.",
            "date": "May 27, 2015"
        },
        "star": 3,
        "title": "Can't restart after pause and doesn't pause for a call."
    },
    {
        "author": "Ethan Featherstone",
        "comment": "Offline playback does not work, even with premium. At best this is a poor remote. I tried to get the offline to function to work and it did not. I tried to force stop the app on my phone and watch, then restarted both devices. Nothing.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSFBqMkdjSFpxQ0ZUTURzSWh4aG5jRklfaFpBaXozdzE3ZldZSGxXVVpld3BaeEw5VUZ6c1lqbzB1Wmt3WDhha2g3Njd2SVQ0U1NBZ1MwWVhj",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Chris Price",
        "comment": "\"Current playlist\" instantly crashes the app, and more often than not \"choose playlist\" returns a black screen. When it works it's pretty handy, though the UI could be made more material-like.",
        "date": "May 4, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSEw5aWNGWjJQQjY0QkVOSFdCWmpHMGhnbVAwMWdpT0t4ZkxHd3VwS2IwY1dIeUt4MTU5cUVtTDlpYjBxOU5tb2ZLNHBXMFVFNGFOUmtEY1Vr",
        "reply": null,
        "star": 3,
        "title": "Good... When it works"
    },
    {
        "author": "rudy trisno wadi",
        "comment": "Paid for premium, but i can't control my spotify list, navigation still not working, very useless apps, when developer will fix it? You very hungry with our money, but i think you are not fair with quality is like stupid choice apps yo spend money",
        "date": "January 22, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSFdNV1N4bGlicjd6WTBZTFN6YjJ3aDNyTTVrcG05bXk2NURzSXZQREpXcDc0VEd0MmdVV0RYVjhoZFRZRTZMUWI5T21HNVlXbGJNbkRvLWw0",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Bacchus Beha",
        "comment": "And crashes a lot. Since the crash happens on the watch I get no option to send a report. Also after upgrading to premium the primary problem is the battery drain which is atleast twice that of the standard app, and the drain happens on the phone, it does fine on the watch as far as I can tell.",
        "date": "May 9, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSHNDYm4yVDFHV1g5aUVhVmxMRXdNVHlWb0xYS0VxcWRkQnNzWGF2MlV3eVZfUkhaQmhtUU1QbDlrV0xMSlQwNFhpdjY0dzNpZWdTSzJUM2hv",
        "reply": {
            "author": "Wearable Software",
            "content": "Please send crash reports or write an email to support@wearable-software.com, so we can fix the issues. Please review again. Thanks!",
            "date": "May 9, 2015"
        },
        "star": 2,
        "title": "Very power hungry..."
    },
    {
        "author": "Tshepo Legodi",
        "comment": "Useless I'm switching to google music at least I can load songs to my watch and go for a run without taking my phone along. Spotify wake up before you lose more customers to Google and Apple",
        "date": "March 12, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSGxScFFtV1NZQVVoa3hUWThKVlFGU3MzbW0ydURUTGJ2dlQzRXhqYVhuRklHZEdXc2c5Q2djOUtuOVNES1o2QmhUemVjbEU0Z0dfOXowMmln",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Brad White",
        "comment": "Connectivity issues seem to persist. I just can't see how this app supplements an already great music service.",
        "date": "July 21, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRlNSbEdyZ2tRV0VUeFRwQTc0SGxIM3JMbVVDN0hmU0o2MGM0WnBGREJhMFdaUU5sbzkxMk50d1hJNEhfbWhpRVFIa0t5d0RrZ1VyM0VIYnBn",
        "reply": null,
        "star": 1,
        "title": "Not What I Expected"
    },
    {
        "author": "Ciprian Gorongia",
        "comment": "it crashes every time i start it",
        "date": "December 3, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRlJlTGR1S21vai1LNktXcVdod0cydTRQVmxUQW5ySGtHc2FBR21CLVZEZ0hta01MV0JQeFplQlFZaHlwc2NnRWlVc1g3aHh1OTN1Mm04cEdv",
        "reply": null,
        "star": 1,
        "title": "doesn t work"
    },
    {
        "author": "Isak Lundström",
        "comment": "How do I make a playlist offline accessible. I have premium and I use offline lists on my phone every day. Just won't work on this wear app",
        "date": "January 19, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRW9oLUhnUUMwcGUxSVR2cDlDT2V2QTBUbTltUDlZaGF5empNbDd6WDZFX2RBNmw1V1FINGxxcVhWZkdPTzRlbW1VaFhwamZOSXFoMGZsRi1r",
        "reply": null,
        "star": 2,
        "title": "Won't work"
    },
    {
        "author": "tha s",
        "comment": "Paid for the beta. Everytime I tried searching for a song it goes into error and exit out. I want my refund back.",
        "date": "April 23, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSHctSDNvVDhja1owbWlHVllUTFlBWlFIaUkxTlF2bU1NYzljSHpXTTFkUk91V2VDSmJtOXk1VzZCX0M2UzBUUl8xYloxRVlITDN0MEJYWDIw",
        "reply": null,
        "star": 1,
        "title": "Doesn't work"
    },
    {
        "author": "Peter Walker",
        "comment": "Wouldn't even open. Watch vibrated, then nothing. No indication of what went wrong.",
        "date": "July 20, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSGc4YWFfeVVCQ2l3c3ZieWg5VWNDSUhFVUFIdG5HVFpzNlMybjVjalRmb3hmX09OaE1yYXE4bWNSTHg4dzc1WF9keXZZUTA3bDJTcGN3UEtR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Emerson Moore",
        "comment": "U guys didn't do it right should have made it an add on for the default app make the app native for both the phone and the ware and it would be much better not worth downloading",
        "date": "June 22, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRWdiN0hiTy1GVVhSalJ3clVXdU5CaW50a01Gb092ZUQ4b3VUVEUwWUhNUDRaWFNYTWJ1Q21malh0bkl1anBleDctaE5wajFRMG9rZ2xqbmRF",
        "reply": null,
        "star": 1,
        "title": "Ware app suck"
    },
    {
        "author": "Scott Fitzpatrick",
        "comment": "Got a Sony SmartWatch 3, every time I try and open the app on the phone it just takes me back to the home screen and does nothing",
        "date": "May 21, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPSFRhMTkwM0xwZnNKbDRQdlFXVzJPNkVsRjBPR3c4UUo4QjFNV2NucDlzN2lJOFpRN0xsWmpSR00zS0plTkdnWFhuMWJGYW9JbGRMeFdwakNJ",
        "reply": {
            "author": "Wearable Software",
            "content": "You have to start a playlist on watch. You need the phone app for one time spotify login.",
            "date": "May 21, 2015"
        },
        "star": 1,
        "title": "Does not work for me"
    },
    {
        "author": "Taino PR",
        "comment": "I installed this app and bought  the paid  version but it does not respond.  Im using  it it with a note 4 and the moto  360 2nd gen. Won't  pause or move  to next  song.  How can i get a refund?",
        "date": "October 23, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRlJiX0UtNTNWX2RrX0FROFF0dkpXVzRlOU5hdTFyOC1vbmJ1UGtCMVBzUWVPVWpTckFJa05tZldZZEJLMHZyMDd2TVVUbFVzTWE3b2RmMGJF",
        "reply": null,
        "star": 1,
        "title": "Doesn't  respond"
    },
    {
        "author": "Paul Salmon",
        "comment": "Doesn't work. I'm a premium member. Don't waste your time downloading this tripe.",
        "date": "April 11, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRWx0OUprR1JRVlJlRmVTZW8wMzY3aklRMkFieXF3WkRDdWRVLUdrZ0o3SzJPellwNGtNTXRjVjc4bUlCbHozUkp6WjhlZXotVVducnVIZ1VV",
        "reply": {
            "author": "Wearable Software",
            "content": "Please describe what you mean with 'doesn't work'. Next time, please write an email first. We will help you with running the app correctly on your device if you contact us at 'support@wearable-software.com'. Thank you.",
            "date": "April 11, 2015"
        },
        "star": 1,
        "title": "Pile of cack"
    },
    {
        "author": "Paul Hill",
        "comment": "Worked initially but not since. Keep getting error message when trying to choose playlist can't forward to next track or pause etc. Uninstalled",
        "date": "October 21, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPR2dTNHk1N1hKZFF0NnhoX2d1S2RzUkgzYXZNM0NWR2ltRkRYZDlxQi1Bb3NhRnMyYllyQ1J2X05ycEtUaHV4M2pFNGpSVXJIMWFIZG5sZjBv",
        "reply": null,
        "star": 1,
        "title": "Doesn't work"
    },
    {
        "author": "Andrew R",
        "comment": "App doesn't allow spotify to play in my huawei watch speakers and instead plays through my phone. This defeats the purpose of this app because the spotify app already does this.",
        "date": "February 22, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRkU2TDl1eG84dTdGV191TjVKLVJ2alZiOGFDbzBmZDM1OXlBaXVjZDRzYXB6R0ExOVpxZWFOSS1vSXVFUHpFRFRpeUZpWUI1Q0p2aUxhSnBn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Steffy S. Zuko",
        "comment": "Bullsh*t app. Doesn't work for my smartwatch or my phone. Paid for the premium service as well, does not load up at all. Galaxy Note 5 and Scinex SW20.",
        "date": "January 30, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearspotifyplayer&reviewId=Z3A6QU9xcFRPRm1HRkJKNEFwODhfN2U1bzFGWllNY0RlaTQ3OW81X2phNkplcUM0ZGwxYW52S3BVSE9kV1A4OGxIV2VESHhaRWdIbkFMLTM2S2RjLVpJcWhF",
        "reply": null,
        "star": 1,
        "title": null
    }
]