[
    {
        "author": "Joe McEntire",
        "comment": "Works well on moto 360 sport.  Noticed a few things though.  First there doesn't seem to be any options for which calendars to show, not too big of a deal, especially for a free app with no ads.  However there is a crash bug.  If you tap a highlighted date and then tap a listed event the app will immediately crash and then restart.  My calendars are all synchronized with owncloud via caldav so maybe my case is special but I can't immagine how that might contribute to the crash, beyond that it works fine.",
        "date": "August 24, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRmFWaVN3NEZlRFhFRmRlUkZnUHE5SWRrTDNVNi02R1NKQzdCU0RiN2s4dEh4R0FPcGY4YU9oajktdjdSQlREbkZqRjBmbHVieS0wXzZR",
        "reply": null,
        "star": 3,
        "title": "Decent calendar for watch"
    },
    {
        "author": "Andronache Daniel",
        "comment": "Is nice but i can not set the first day of the week. All phone settings and calendar settings are good but still nothing :(  Edit: You may wanna look into how you auyomatically set up the first day. Got it to work by changing system language from US english to Uk english. Should be time zone related.",
        "date": "December 11, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRkNUenNoLUVTWENvMjJJZFZSaU9lN2RkdnZTTzRISEtQb1dNTWxOQjgwS3hwZW5VZll2emViX2pPMzF6bS10OEFGMDFRTFN5VFRVdExS",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Marc-André V",
        "comment": "Love the functionality it adds to my Moto 360 watch... however there is one annoyance that many also note: it keeps showing all the birthdays with no option to turn the birthday calendar off. Please add this option.   The other cool feature would be to directly add new events from the App.",
        "date": "December 29, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRUhtcTYwWkFpTkxQOUpEenBzRHBaZE1FNlVxdGFUMkQ3c2prejhyLUJmajlScFl3cGloc0hPTVZuaElxMTg3UTc0OWQ1d2JmOEItcWU4",
        "reply": null,
        "star": 4,
        "title": "Great App, with one caveat"
    },
    {
        "author": "Marin Vozian",
        "comment": "Overall a nice app,  but even after the latest update it does not change the first day of week, even if the description says it does. I need Monday as first day (which is on my phone), but it still shows Sunday. Rebooted and resynced my Moto 360 and Droid Maxx several times - no effect",
        "date": "January 17, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRWhYd1V4R3NJaWR1cXBKV2U1X1pWcnZkaGpRQzVxYXJ4X3g5OTQtU1ZhT0p2UEdqXzBkb2V6RnlDa0IyUGJMQWJ0cFo0VEg2djRZMWh0",
        "reply": null,
        "star": 4,
        "title": "Nice, but first day still doesn't change"
    },
    {
        "author": "Terence Chandler",
        "comment": "Well actually, I don't have anything to compare it to other than the calendar that came standard on my watch, but I quickly fell in love with this one. You can easily identify days with alerts/reminders/appointments and tapping the day will bring up a list of the activities. And it syncs with Google calendar nicely. Couldn't ask for a better calendar for my watch.",
        "date": "September 4, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRldOWHo0a2N2ekQxNFAwWE5TSXlrMnllV0Fna28wb1h2YlFDdkNTNnV5Z1VlRXJ4clBFak12S3luaWVsSzAxb2tmQ2lnYUdVaUpqay1w",
        "reply": null,
        "star": 5,
        "title": "Really is the best"
    },
    {
        "author": "Family Bolling",
        "comment": "I installed this app and this is an excellent app,  what I needed for my ZenWatch.  I can see the day, events, and drill down into the event details...     Update: I have the latest version and I appreciate the development team in making the suggested changes for \"Location\" data to be exposed.  Thank you...well done.   There is one other draw back.  Google Birthdays... yes we all are affected by the spam of Birthdays from Google, but unfortunately this app does not have a filter to remove unwanted items like Birthdays / Holidays from being displayed.  Other calendering apps allow you to pick which calendars to show, this one does not... it reads and displays all of your calendars in Google, and with no filtering, will show birthdays along side your normally subscribed items in your schedule. My Request: a feature / update with a way to filter calendars and birthdays / holidays. If this is done, it will be 5/5 stars... still a good app...",
        "date": "January 17, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRi1kbE00SEl4ZHJpUzBOVHA3RW92bldZQVlFTUhUQmIxRWs4aTU0QzVtMnQ2bEpjbndRUkRMWVVxWHZNUGdBT1Q0bW55N1dHT2hCOFpP",
        "reply": {
            "author": "Wearable Software",
            "content": "Please get the new update and review again. Thanks.",
            "date": "January 14, 2015"
        },
        "star": 4,
        "title": "Good App, just what I needed....hope it improves."
    },
    {
        "author": "Racheal Yates",
        "comment": "Easy to install and launch on Moto 360. Works really well. Developer is proactive in making updates. I suggested to add \"no events\" to be displayed when there is no event. Developer actually read my suggestion and made the changes! 5 stars for this app! I wish it had color options though, but it works fine without them!",
        "date": "January 20, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRXZwYzJjX3dRREhIWXdqRFllTmVFNm9aSnRLaGxtNDFTVC1kYkdXYjh3ck9OX3c3UndDbDFEMTItRmxfNVhzMENRaEFXaE83QXFDQkNR",
        "reply": {
            "author": "Wearable Software",
            "content": "Please get the new update. This features are available in new version. Please review again. Thanks",
            "date": "January 14, 2015"
        },
        "star": 5,
        "title": "Functional"
    },
    {
        "author": "Joshua Russell",
        "comment": "I tried multiple calendar/agenda apps but they all display my events one day early. This one gets it right! Thank you developer! The only thing I would suggest is adding in an agenda view. Otherwise, 5 stars for getting it right!!!",
        "date": "July 27, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRnlma2JaRWdYSlhMeGs0TmlKcHJsNHc2cGM0VVdoSDJodFFqUFV3ZnNDV3FzWW1MRUluRi1mYmpCSTZZQVZnMW41SlgxOTR1Q3JVRlFM",
        "reply": null,
        "star": 5,
        "title": "Finally a Calendar App that Works!!!"
    },
    {
        "author": "",
        "comment": "The calendar works and shows me events for the day on my lg g watch, but if I actually touch the event, it says \"unfortunately, calendar has stopped.\"  Won't allow me to add, delete, or edit an event. But I guess at least I can see them.  Eh.",
        "date": "December 22, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRWJkNVZadlJIeGtmbUlDQ2R1bFpKZjBUTDZEbGVnY1pucUdWY2NueUFsclJDTjVsMzBkUkhMaVZLS1JZVGlIV3FyWEhJYkRQaS1uLVdZ",
        "reply": null,
        "star": 3,
        "title": "Error message"
    },
    {
        "author": "Shawn Hayes",
        "comment": "How the heck do i actually schedule an event and then see it on the calendar, on the watch? Better yet, how do i make the event vibrate the watch to remind me to look at it when im running around multitasking all day long and i need to remember something?  These are the most important things i need, i don't simply need to know what day it is. Maybe everyone else knows how to do these things except me. Can anyone help me figure this out?",
        "date": "November 22, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRnRTNTQzbUdTbkg1UU11a1lYNUNScmt1ZktLVm04andVdVdVRTJsVy13S1R1ZEdBb2tBMDBnajc1bEgwS041MFpZdDZWa1VYYnRtTlNz",
        "reply": null,
        "star": 3,
        "title": "Its alright but..."
    },
    {
        "author": "Steven Koch",
        "comment": "Limited function, calendar events entered from my computer onto Outlook are displayed and show details.  Events entered from phone display but when selected to read details get an error, \"calendar has stopped working\".   Having calendar on wrist is very helpful.",
        "date": "January 4, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRzBrcTNyMjNvZGtJZVRHQW42eHpOeElzOEhMNTZHbG1rTHpvT3lvWnYtV3JWejJRY2UxMm1jNlhPYU1MZmRScWJFZHJQa2tRLS1oTTF1",
        "reply": null,
        "star": 4,
        "title": "Limited Function Zenwatch 2"
    },
    {
        "author": "Scott Migliorisi",
        "comment": "Entire calendar does not fit on the face of my LG Urbane. Cuts numbers off at the bottom and takes two rows to spell the month and two rows for the days. Can't find where to make adjustments.",
        "date": "October 6, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR1VWSV81NEpQU2E2WXhOdnhyMGNGV1czSXM5VGFVYjRpakpZdzhral9UWnRvbC1UZmZkMjllWWxSY09KaFloRTVnUHFXWFVkOU5MN0RY",
        "reply": null,
        "star": 3,
        "title": "Seems to work but..."
    },
    {
        "author": "Alec Lockhart",
        "comment": "Cannot open any of my created events.  Every time I try and open one of my scheduled events that I created on my phone the app crashes.  This bug makes this app not useful at all.",
        "date": "December 28, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR1prTjg1OE9vWVc0TnIyQk1DQTJwUmd2Vm11M0tjaVZYRGtmN2M4TF8yUERNa0QxX0RmYURHYjlVUUJOYkpVYWtNVjdXZmV5ejNqeUtW",
        "reply": null,
        "star": 1,
        "title": "Buggy, needs attention"
    },
    {
        "author": "Max G. Mahaffee, Esq.",
        "comment": "...I thought about only a 4 star review, as birthdays are loaded onto my watch, making it seem like I have something going on that day, but then I realized that others had pointed that out.  So, who is to blame?  Me, of course.  HOWEVER, I and other users would be EXTREMELY happier if we could not have that birthday spam on our Android Wear watches.....OK?",
        "date": "May 29, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRlFrZm9jLTBjeElLZnI4RjZrMWxDbnhqYzRIRklsMTdPYzhIQXV1OUhlN2cwVHMzeVAzWF8zQzFlNHQ5RmV6R1VpczJlbkNBRVZyb3A3",
        "reply": null,
        "star": 5,
        "title": "Just installed on my Moto 360..."
    },
    {
        "author": "Christopher New",
        "comment": "Unhappy. It doesn't show times of events, just the title until you click on the event. Just show me the time under the event. Also, spacing needs work..too much white space between events.",
        "date": "January 12, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRjQ3aGRSM21FUy10MTEyZ2I5SEl1OUxMMkJkRUZNWnZaTWZ5bUhOeG1haGg5QlJvNjlrXzdKNXpHRWxhOWtPSVhibkdlRlc1aF9DbXVa",
        "reply": null,
        "star": 2,
        "title": "Limited"
    },
    {
        "author": "Andrew Blessinger",
        "comment": "Calendar app always tells me Its not connected to phone when I open the calendar. In their respective settings, the watch tells me Its connected to the phone, and phone tells me Its connected to watch, but the app can't seem to figure that out. Not sure what's wrong here...",
        "date": "February 2, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPSGZZT3F5ZExBVXdhRTFlRHlwblU4WnJBYU1oOEVRNnpSUVJJOThkUXVlU1Bsbm9rMlk1U29uT1ZlVmVVbDhrWkxTWHp3Y0hoQ3dDa21H",
        "reply": null,
        "star": 1,
        "title": "Cannot connect"
    },
    {
        "author": "Colin Hughes",
        "comment": "Month and days headers take up too much screen real estate. One character for day names would suffice. Doesn't need three, they overflow with large text settings. Scrolling horizontally makes it difficult to close the app. No choice of calendars to display. A settings page or accompanying mobile app to configure it would be ideal. It's a great start but sadly not the best as advertised.",
        "date": "June 9, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRzBxRndCM0hNWVFuQ0NJSFVicGhJTGdxSWVZejhHckF1UHZJcVQzeWQwZ3VUYkVsYWZkT0tfRS1ZT1dPTHRPQXpWQm9Zal9oRGdObGVJ",
        "reply": null,
        "star": 2,
        "title": "Not really the best"
    },
    {
        "author": "Joe Kovacs",
        "comment": "Looking for a good calendar app for my Moto 360 and this just isn't it. First off, swiping left and right to move between months on the default month view makes it difficult to dismiss the app, which is a standard swipe to the right on Android Wear. Swiping up and down to move between months would be more intuitive on this platform.  Also, selecting a day on the month view to see the agenda for that day is difficult because the days are tiny.  Some kind of aid for selection would help here.  And finally, when you get to the Agenda view it is squeezed into a square within the round Moto 360 display and with the square that small all appointments are truncated.  The app could be improved a lot if round devices were also comprehended. So I guess for now my search continues.",
        "date": "July 21, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRl9xNG5udjJETTUxQkVQdWNqMURfdFVNQkM1RExnb1QzcmRvMmhOMFlaQURIVDV3N3VEU2tOSFgzc2NuQlhaMnNfUmNrWnVJZnBOZTRJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Brandon Kalinowski",
        "comment": "Almost perfect but needs to display event times. Having to tap twice to view an event is not as intuitive. I'd like to tap the day and then see the list of events with the time. Also should be able to swipe to view the next day.",
        "date": "June 7, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRjk3YmdMZDZDRm1aSWhHa2JZWjA1NndWOEFIMU9IUGlOaWpMblhhVDAzWGx6d0R1Qnk1cXVJX2JKc0lidk1obHNvRTlVQ244TEJRQk56",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Lisa Starkey",
        "comment": "Has promise but it shows declined events on the watch even though I've set the google calendar app to hide them. Would also be good if you could choose to show/hide calendars on your watch!",
        "date": "February 23, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPSGE4U2dfeFFSSFdyOW1wSWNRTmlicHZwanVSdHNFd0N6TjdWSkhqd2lwcjIzbW5UbmpFb3AwVmRNMDVNaG40Z2J0ZUhNX1NKZ2xJTnMz",
        "reply": null,
        "star": 3,
        "title": "Good but shows declined events"
    },
    {
        "author": "Graham Weir",
        "comment": "Click on a date and get a list of diary entries, but with no information on what times they're at! Click on an entry to find out, and crash! Instantly uninstalled.",
        "date": "May 25, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR1k3Zy0xYXVQbEE2V29BUFg3M3dfQmlLRHBfNnNCbGhvMXZHRXRRSmR4bk1sdXJzeWNOR1R0Yk1mRGs3dUdfOWtsY3F5OFhxR2FWNlZQ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Vince Palmiero",
        "comment": "The month, days, event details are all cut off on round lg g watch r face.  Correct this issue with round watch faces and I will raise the rating",
        "date": "January 22, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRmNWa1lsRmdJSExUVVZ2Yi1UMHVnTzgzUTN3OWlJTmtqbGJHczRUTkk0OVJvQVYyZlVRbVZ4OElDSnhiTjdKN3I5c21NWFp1Y3ViNGgx",
        "reply": {
            "author": "Wearable Software",
            "content": "Hi. You are using an older Android version. This bug occurs in versions before 5.0. Please update your watch and review again. Thank you.",
            "date": "January 27, 2015"
        },
        "star": 3,
        "title": "Month, days, and  event details cut off"
    },
    {
        "author": "",
        "comment": "I spent money on the \"Calendar for Android Wear\" premium app (you couldn't even use it unless you paid) and it was junk, displayed events that were not even on the day that was selected. Nothing like being a day late for a meeting.  This app lets you see a list of the days events and if the text doesn't all fit you just tap on the event to see a complete detail of the event. The title even scrolls so you can read it all! Simply swipe left or right on month view to change months.    Brilliant! Should be a pre-installed app on all Wear devices. Kudos to the developers!!",
        "date": "January 23, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR3IwczFGenY4cjRZY01RQ0pFVjhQQlVwZnE0UmZxZHdQNk5GcjRNLTREX1BmZEtwMmpzdEdOQXN1aDJVNWVjVHdBaVQyQVBlUjQwcXJa",
        "reply": null,
        "star": 5,
        "title": "Awesome!"
    },
    {
        "author": "Stuart Hannah",
        "comment": "Was going to give it 1 star because my events were not syncing, turns out it was just syncing slow",
        "date": "January 21, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRkJ2R1d2SWVpUE5jQVRvVEp1M0dkUzBZQnMtQ2dlRndLTUZhTzlXejZmOTBUb3JlRFdQUVkwWjM3RFBPZkp2RXQ4THoyU2xkWHZmeUZq",
        "reply": null,
        "star": 4,
        "title": "Works well but syncs events slow"
    },
    {
        "author": "Phil Alford",
        "comment": "Aesthetically it could use much work. But functionally it's served its purpose - G Watch R",
        "date": "March 19, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR3ZzQzhXdXNkZWhreGw4elp6STdaelBzbDZHZ1J5RXFRdkYtbDFGakdQbHZYOVR1S1JyWUZKYlV5ekc4M2tiOVpwVDE5THE2U2pCVmxM",
        "reply": null,
        "star": 4,
        "title": "It works, but it's also the most unattractive app on my watch"
    },
    {
        "author": "Jack H",
        "comment": "I love it. Lays out the whole month at a time with the dates having an event highlighted in red. Tap on a date and it will show you your agenda for the day. Considering the limited screen space available on a watch, this is about the maximum amount of information you can get out of a wearable calendar.  There are some suggestions I'd like to make for future development: 1) When I click on the location in the event details, open maps. 2) A weekly view (Sun-Wed top row, Thur-Sat bottom row) with the events listed would be nice.  Other than those two things that I'd like to see implemented some time in the future, I can't see a single things wrong or deficient with this app. (I have my watch face set up so that when I click on the day's date, it opens this app for me.)",
        "date": "August 11, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPSFBRSFpvNWxWMGZGMHJXSnFaSFY5azdmTUNWdFpuNllsVkp6X0VaclBlaFZYOVVpVGNDaVRHVEpPX29ZODZEcHN4bjlnaFRZeEl1MW5n",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Joe Scully",
        "comment": "Every appointment has been replaced with a strangers birthday such as Gaurav Mittal's birthday on May 16th even if you tap May 27th or June 3rd or etc,etc. Uninstalled.",
        "date": "May 11, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRzdaOVFfbzBNZm9lRkF2VW1LWDd0S0NhM0hmdXdFcDRMQUEzLWZfT2MtazZUbTN1WWVrdFB0SDFURTQ2Q1Q1WnhkX21UR243azE1S05l",
        "reply": null,
        "star": 1,
        "title": "Was OK until Hacked!"
    },
    {
        "author": "William Garrison",
        "comment": "A good idea, but not complete enough to be worth using over pulling out my phone. Has only month view, no week view. Can't set the week to start on Monday. Hard to press the tiny day buttons accurately. Can't select which calendars you want to sync. Doesn't even show the time for events without an extra tap.",
        "date": "January 16, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRlV2cEI0QlpjOHd6UzBBbTVrZWVRMEVEVk9XM2NXay1sVEJ4cTI3NENvUWNPdVViYm83bVhsZGJyNFF3UjlTNGxpam5lbVhPNm12VW0x",
        "reply": null,
        "star": 2,
        "title": "Not quite there."
    },
    {
        "author": "",
        "comment": "Can't close calendar on demand Sony 3. Have to wait for time out to get back to watchface. Is adding appointments from SmartWatch in the future?",
        "date": "July 5, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR2U5UVpUOUc3Z25tbExnbTNaZ2RCaExCc19WMHl0VGZPTFhwT294UGRZdEtGRUtST0RkRWk1MHFZQUFOdU9tV2x0UzhOVVNuRkdkblBs",
        "reply": null,
        "star": 3,
        "title": "Good start"
    },
    {
        "author": "Chris Fell",
        "comment": "Does (just about) everything I want. The free price tag makes it amazing! One thing I would like, and would be willing to pay for, is colour in the app... different for bank holiday/own entries! Apart from that, brilliant.",
        "date": "August 15, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR1RXeEg1cFotZnlUc0M4eHp6clVlVlpWQ3dTVWswUW80Sm91UHptVEM3UGxYUzQ2SHJFZHNZRWRxVGotOGV1NHkyODd4eDhZcDl1OHZV",
        "reply": null,
        "star": 4,
        "title": "Good app"
    },
    {
        "author": "Mo Alsharaf",
        "comment": "Honest, brief review; useful app for my LG watch Urbane, better than other free apps. Syncs smoothly with phone calendar and appointments. Improvement needed on aesthetics; September month text splits and wraps with year digits, try to separate text and number (similar to other long text - November and December.) Thank you.",
        "date": "September 10, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPSHd0VnpoWjJvUkItMDlYdnN3YkFGRkl4OFNpelNjaTBOc0FHU25EQ1o2OG4wcExlRlJTcUYtT19PUGE5OExMVEFBTUJCb3E1YkhHbzNO",
        "reply": null,
        "star": 4,
        "title": "Practical"
    },
    {
        "author": "Kim Krooshof",
        "comment": "Works quite well, but shows every calendar on the phone. You can't just select the one you want. A shame.",
        "date": "August 10, 2017",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRlNMN0FIbUt6dS1zSEs0Q0FTUm1yN19xWEE5U1BiVEctOUNUZVpkUlRVVlZXZV84RWladmFfTTZqLUU2S0VTelVBUDNzd3NRWUxiQlhH",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "T C",
        "comment": "Moto360 Gen 1. Crashes constantly. I use Office 365 and my LG G3 works just fine with showing me my calendar but this app crashes every time I open a calendar entry.",
        "date": "December 9, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRnFWd205UzhaTEI3dFNCVEpNXy1Tdk4wZFBKUjg3QkdMdEl3N29oZmoydXdPXzJHU0IwZk1ydlRqRllSZ3Z5dU5CdGx1VW5JS1c2S0w2",
        "reply": null,
        "star": 1,
        "title": "Crashes constantly"
    },
    {
        "author": "Jim T",
        "comment": "Lots of potential but for events spanning several days it only shows the first day. Irritating oversight.",
        "date": "February 23, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRlRNS0FWa2hONW9icndRU3JmbnctUHIxQ3NveS0yTDBacXZRcVk0RGpiQlZPYXlWbDdVRGFkUnRnZWNCcUNidjVmSFN2cFBkZ1ZManRx",
        "reply": null,
        "star": 3,
        "title": "Needs tweaking"
    },
    {
        "author": "Ar BH Loo - LBH Architect",
        "comment": "After uninstall and reinstall back, double entry appears on my watch. Any way to solve this?",
        "date": "May 12, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR3JuTi0zX2JLZzd6NWlDanRLOHV1Tk82YkJxV3BJS1V5U0xwNnAzTVdLb3ZqVUF3YW1MbjlNT21sNFdKQXVxcXRveWRDTDZEVGZNUnFV",
        "reply": null,
        "star": 3,
        "title": "Double entry"
    },
    {
        "author": "Terrance Teoh",
        "comment": "My first day of the week is Sunday. Shown correctly on my Xiaomi Note 3 but not on my LG G watch.     Help!",
        "date": "April 27, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR0NsVkdyRmtOd1dSdmNFX0hpVUZxYV9nQmMtWkxab09rX0Q5RkVLbVlNUi1uVmVCQVpLb21MdUV1VzVDbk9qVGVSYnhxZHd6RGtFVmpy",
        "reply": null,
        "star": 3,
        "title": "First day of week not auto set correctly"
    },
    {
        "author": "Peter Tse",
        "comment": "App works and syncs events but just not for the current month. I can see all events for months either side of the current only :(",
        "date": "April 17, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRUYxcGN4RnZRU3dCenJ1SnctZE5vZnkxNHU1WjRVdVJMeGZqQ0FnNGlUWWZ6dnBlMFVlbUlUY3RlYWNsVjVJYy1UNTlISENiSV9ZOXBG",
        "reply": null,
        "star": 3,
        "title": "LG G watch R issue"
    },
    {
        "author": "Sheila R.",
        "comment": "Just what I want my 360's calendar to do - highlight today's date and events that are on my Moto X2 phone's calendar. No fancy settings to glitch it, just behaves perfectly and when I touch a marked day it even lists the event!",
        "date": "October 2, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRTBzUnZEdVZmcjJlc29YaF9aNjg4NWY3TVpUdHlKbmVjeVlzYUM2UlVIOTZhdENGT2xkc09ZcjJFTGpmZGNZYkFZYUNqQzBHajFjQkh4",
        "reply": null,
        "star": 5,
        "title": "Works Perfectly!"
    },
    {
        "author": "Brandon Disney",
        "comment": "Wouldn't sync to watch after 3 days of being installed and 17 attempts of singing through android wear. I contacted their development team and they did not respond (lg urbane)",
        "date": "August 12, 2015",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPR0d0aXhQSE1KYmY4MnhmaE5VUGhrM1pKQ2tNb2JNVUt1QkxseXlaUnpzdWIxdU1qX1hmZEE1RFhHdGFGbDB6QmN2aWJaWDE2R09DWnVv",
        "reply": null,
        "star": 1,
        "title": "Won't sync"
    },
    {
        "author": "mahesh.vs vemala",
        "comment": "My wear is connected to phone for 10 min and still it has not yet synced the events. It did not work even after 3 days .",
        "date": "May 6, 2016",
        "permlink": "/store/apps/details?id=wearablesoftware.wearcalendar&reviewId=Z3A6QU9xcFRPRjhBbEdOQllHNEhsc1RRMUo0eXlYcTFJeVl4NUY4UXlpS2VMRk9hdHgxWVg3V2wwX0VKUlBMdUJjVWstVmIzSFhWVU95a3hOMWdDSE5X",
        "reply": null,
        "star": 1,
        "title": "Calendar not syncing"
    }
]