[
    {
        "author": "Shawna Schweain",
        "comment": "Great app, i have tried quite a few workout trackers and I keep coming back to this one. I wish there was a way to set up workouts so that you could program in a few full day of workouts and then create your workout based around plugging in the days to your schedule. For example I am on a workout that goes \"ABA\" the first week, and \"BAB\" the second week. It would be nice to be able to create two days of workouts then set it up in a schedule as opposed to manually configuring every workout for the two week period.",
        "date": "November 28, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRjZrQjQxNzYyc1JUZzVVOXpWZXRZWnVQRUJuc2tqWEFEbzdfdlBkWHRPZE4zdHJBY1pNOHJNWU1zalhvVUltSEs3U1FnazdNZzB3Y3RFdHRJ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Prince Al-Baaj",
        "comment": "Truly amazing app! I used to use Redy Gym but have been pulled away by all of the thoughtful little features of Progression Tracker. I love that when I complete a set, it moves on to the next exercise, the rest timer is a floating holo button, so if I leave the app, the timer is still visible, and the ease of building and updating my own program is amazing. And that's all just in the Free version. Statistics and graphs of your progress can be unlocked in the Pro version if you desire. But the core features are all Free which is just fantastic! I am definitely upgrading and the dev truly deserves it. Thanks a ton Zoltan!",
        "date": "August 7, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPSEhza0diVjZyMnFBdGFSRHRvYnRhbnRMRXBuMV8zRU1Rc1FyMlp0NUdrbThucWZYOG5yYlpuRTByTHBKMXV5aVJZOEpnSTlKTFlrT1g3Qmx3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kramer Johnson",
        "comment": "Great app.  My only issue is that creating a new workout plan takes forever and there is no way to keep them if you change devices or have to reinstall the app and there is no way to share workout plans.  If they could make everyone have a log in profile that you could save your workouts to, this would solve the issue.  This could also help to be able to share a workout plan.  I always work out with my girlfriend and if we are going to do a new workout plan, we each have to spend about 20 minutes plugging in each exercise.",
        "date": "November 8, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPSGJEVXB2M1NETFFRT1hQendPb1dZQXV6N2UxdEdhbXEwSGZQMWNuRk9TZDdhbXl5UWY1MGVybTVaREQ0LTRQRGhReFZJSGxDY0Zsa1JrMFpv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Kevin Feusier",
        "comment": "This is exactly what I have been looking for. Has a great list of pre assembled weekly workouts for all types. There is a demo of each exercise in case you don't know what one of them is.  My only problem is there are some common exercises I would like to see in here including boxing types, jump rope etc.  You are able to add an exercise but I would love to see an area for suggestions where you can officially have them added. Going to upgrade cause it's worth the money.",
        "date": "April 22, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRmxPTURxZV9ZbVFWNkpvVkpPMktpZlY5czRHZzlQcVFKVFFhYlV6ZFotRUQtcHVJczhfRlNvejg1OGxEVU0zcmlsdk5yZGtuWFl6VWROV3d3",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Chris McManus",
        "comment": "I've used jefit and multiplier other workout trackers and none of them have every feature I wanted except this one.  The developer promptly got back to me with a question I had and also said that he is still working on the app which is great considering many other apps aren't still being worked on. Highly recommend.",
        "date": "September 24, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRjJYZkJ3SWo2b25NcmItNkFwVkJIdWdLOHhCNFRWczlpdDk2djFyWGZERG9lQ1NhU19kSHV1QXZ5cXBrMjBmNUVJNm5GZUFsY05BREtjSVQw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Luke de Andrade",
        "comment": "This app has everything you need to easily create and record workouts.  You can see your progress through stats.  My fav part is the timer you can setup so you know when it is time to lift again. Thanks for an awesome app! The dev does respond if you have any questions/issues.",
        "date": "May 29, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRjV2V0pZMnZFZHNMUFpQNTdhQ0R0WVpaTHFfMHc2QTh3Ym5RTVM1ZEFqN3F1Y21KcEZybUNTd0pYVlVuMmJsRFkxbUxJUERBMWhQUXFCUWtF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Chris F",
        "comment": "I'd love to use this app, but the workouts I do refuse to complete. I have tried everything and they keep popping up after workout saying to resume. Any chance there's a fix? HTC 10  Update: After 36 hours, the save button appeared. I managed to edit the real time for my workout and other than that, very impressive and customizable workout app. Thank you Zoltan!",
        "date": "April 3, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPSF9rQXB2VUQwaWtIWThnaXVsLVlEUWpQRERIbm12dEw4LVdTMDBrbmdaNUVWTGVOWkdLRjZkRS1BV1dYRHp1aVVwaG1tX29aU0ZoTzB0TzFJ",
        "reply": {
            "author": "Zoltan Demant",
            "content": "Hey Chris, could you shoot me an email with some more details on this? You can reach me over at info@progression-app.com. Thank you!",
            "date": "April 3, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Michael Rogers",
        "comment": "Tried at least a dozen workout apps. This is the one I settled on. Simple, clean, and easy to customize for my own programs. And this one doesn't have all the extra junk like jefit or fitocracy. Wish it still supported dropbox, as Google Drive doesn't seem to be working. I like the additional support for Google Fit though. One silly question: to get accurate tracking of weight lifted, should dumbbell exercises be logged with the combined weight, or weight per dumbbell?",
        "date": "January 8, 2018",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPR3lldWt2cVVhbllxd1hBenZ0QW1CNzk4T1BURHhhdmhPVkU3MTNmVnNSWlNlOTNxZVRURlgwWDZSZFEyX1RieVFjNEw3TktDSWE3cVBwdHdj",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Chris Mitchell",
        "comment": "The ability to quickly set up your own routine, complete with supersets, drop sets, etc. is extremely handy. The interface is also very clean and easy to use, and having the charts of your lifting progress in-app and available to look at any time is awesome.   HOWEVER. I should note that paying for the app to get the \"export\" feature is pointless. The only thing that is exported from the app is your TOTALS for each day. So if you were hoping to look at your progress over time in a specific exercise, say squats, using nicer graphing tools on a desktop computer, the only way to do that is manually looking through your logs and typing it yourself :(. If the app is updated to export all your data for each lift to .csv and not just totals, I would definitely increase the rating to 5 stars.",
        "date": "July 26, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRXpNVDNObkJmOUlNMlN3OXRxandHS1BqMlpiSkdtRlpPNjdad2Z6cm5OTmFGMnFTSmJqNkxuTHlkUnZzN0xKLVBvNzJCWktoMktBOGRyRXlR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Marc Lavictoire",
        "comment": "Works great for tracking my custom sets etc, also works nicely on my android watch. Only negative is that although it does send the workout info into Google Fit, it doesn't register as a workout and subsequently doesn't get picked up by My Fitness Pal app.",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPR0Z0eE5ZRi1HTEJBZmlRVUg5eGU2UGRaSEdKdUZKUG5CeUpJZThfV1FLalJCcko4eU42YjJwSHBoci1fZjNTQ0dESlpLa1p6YjBZekd1Rkdn",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Nik Craik",
        "comment": "I've gone through a lot of notebooks and apps over the years, and this is the one I've been looking for. Clean, intelligent UI that's easy to use and stays out of your way so you can focus on why you came to the gym.  Money well spent.",
        "date": "May 11, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRXJhbUtNRkRnVEViLWxlX2N1djZGVzBZenlMa2RPNDdZMEZkbVlaRm9FM1ZrWlBlRlRJNkZZOVNIeEpuYXRreWtKTGdud1NsQkczbDc4aEIw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Knott",
        "comment": "Great app, works amazingly compared to other fitness I have used. Easy to track your workout, create new ones and see what you had done in the last workout. Loads of great features put this above the rest.. can't recommend it enough, also great customer support 👍",
        "date": "June 27, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPR1hrQnBpbDJHdzlrTVJhbXIyT0owd3BNX19KWkVrVGNmOVEyYVZQdE9vT2JKSHZWVFBmUTdpSmxBeUhOSGtLZWxJamRmOG5oX2NSRXBpY2dV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "John Doe",
        "comment": "Great app. Been using this every day now, and it suits my workout needs. Had a question, mailed the dev and he replied quickly, good thing. You can add your own exercises or select them from a list, the only thing I needed was a dark-mode, which is coming soon. 10/10.",
        "date": "June 1, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRVZWUThxaW14cV9UQkVNVnllbHBrbW1EQ3ZuWmlOdnplVE5FdUtoWDg1NzlCNzlVUnRTeE5KZ1hGTmdWRlZ4Q1pLTjlOVXdYUmV0dlFXenZn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Nick O'Donnell",
        "comment": "Easily the best strength training tracker I have found to date. Simple but effective user interface.  Would love the option to have your weights default to values from the last occurrence of a session, rather than the last occurrence of a movement, but that is just nitpicking. Will definitely be upgrading.",
        "date": "May 29, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRzZzUFB1bUw5MUM5VUVtZ1dCQ1V3amR4ekZ6V0VkRGhsN2xFWkUxTHJqLU1kaUdxMkFlcDlVQ0FqX2ZFNGV2N1B3N3JNWC14aDl2YURfdG5J",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Erlend K. Rool",
        "comment": "Just wanna say that this app is beautiful, and for free you get all this data and customization :D I will test this app for some weeks, then buy the pro if I still like it ^^   To the developer: Keep up the good work! The app is already so good, only thing you need to do is add more content (exercises - especially bodyweight, and stretches etc) and updates (bugs etc). Cheers",
        "date": "April 6, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRmdnLU9USHpjZEI0NTAwemRDLW5ub2luTHJvV0o3LUtYdmk3RlVTUUhnWkZBX0Ixck1qZThaN1BtSDhRSTR5VGNnS2FnakQ0bVZlZlJYSDhn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Clint Mayer",
        "comment": "Would like to be able to add various health and wellness events to my history. Stuff like getting a massage or laying in a float tank. That way I can keep track of maintenance the same as building. Also would be cool if it could connect to MyFitnessPal to sync calories burned under exercise.",
        "date": "November 22, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPR1I0RDZDcHBIRnd2YzhkZnlLQWxuVmRsOHpWS0E0MV9QVHh0VlpzNDZsNC1aaFdGWUJ2ZHVzbjYtd09nU1dFNmhhakJqMXl1aEs3VXNyeUx3",
        "reply": {
            "author": "Zoltan Demant",
            "content": "I hear you Clint! Ill be adding support for this shortly. Have a good day :)",
            "date": "March 16, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Shashank Tiwari",
        "comment": "This is my favorite workout app. The only reason I didn't give it 5 stars is because it no longer works with my Android smart watch. While downloading on the watch I keep getting an error message saying that I need a Bluetooth connection. Read online that this message appears for apps that are not compatible with Android Wear 2.0. Please make it compatible with Wear 2.0. Still works pretty well on the phone though.",
        "date": "September 23, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPSGYyejZUWGlzN2tKRDZxTFBfMEx1VXBYNzgxdGU5SnlCZjVSZlFpWmZCR1BzSWpZX3NFYlVmekw2dUttNGtZRFR1WjI5Y09kUGVXYkU2bi1n",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Ben Kunz",
        "comment": "Great app. Used several others but this one give you me the most flexibility in making my routines. I like to do 3 full body days a week  and label phase 1 day1/day2/day3. I just add notes under exercise week2 add a set or week 4 60% of max and so on.  Then next month phase 2....so you get the point. Just one way to be able to program multiple routines in if that's your preference. If there's an exercise note in library, it's easy to create and then you are good. Wish there was a way to export to excel or my Google account (there might be but I haven't found it yet). Overall great app.  If I could add anything it would be a phase function. Like I stated above program a routine then set it up based on weeks so each week reps/sets change accordingly. Then it automatically bumps you to your phase 2 routine that's programed (each routine needs to be able to have different workouts-mon/wed/fri-or whatever schedule you pick then sets/reps/wt changes for each week). I know that's something easy you guys could add....just in case you were bored one day.           Thanks for your work on this app.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPSHVoMkhRM2VwUGg4M1h5VUxDMlZEZU94ZWF3ejU1ald0UGNHRXlvcXVmWUNNZ3d5Q0x3SktWNXpkVkRQbkJUTHZrdzdwRVRXWjRvWEtvUXdR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Smoky Doggg",
        "comment": "The App looks really good but I don't understand how it works with Android Wear 2.0.   It doesn't show up in my watch?  Will pay if I can get it to work on my watch.  Update: Figured it out, you have to perform soft reset on watch (turn it off then on) and it will show up in play store as an app you can install on watch.",
        "date": "June 8, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRjdOcmJZaXItaDliNUthZmxfUWJhTXJQTWZOS2dnclN0MUpIR09UOEdtZ1VvTG9TVzI5cVZwWXFWa1lMaGVsY2lSWXdGUDlxMjdfYWNYaDFZ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sulaiman Ismail",
        "comment": "Love the app. Upgraded to Pro version. But why do you have a separate Progression Tracker Pro which has integration with Dropbox instead of Google Drive? It's confusing. Why are there 2 versions? Also you might consider forced syncing to Google fit as I realise some if my data in progression did not sync with Fit which is weird. Or would you have any suggestions on how I can have that fixed?",
        "date": "April 11, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRVBfVng4cHFQSFJ4SUp0UzBMMjJrWHZqOWEwX1N6Y1RSWk0zWG5TeVZXTzF0alZiN3VLaF9hUzRnR1hlZ05WT1h1Z0VLbEtieWVDRk02ZVhn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Hello, one question. I just recently switched my phone to an LG G5 and still have the full paid version of the app. However one thing that has been really annoying me is that on my old device, it used to show the rest timer in a little small circle so I can exit the app and tend to other things on my phone while knowing how much time I have left.  However with this phone, the mini rest-timer isn't showing anymore; I tried playing around with the settings and what not and none of them seemed to bring up the rest timer. If you could please help me with this it would be greatly appreciated, thanks.",
        "date": "June 27, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPSF9QT2ZoWGM2cF9MQ2U5V2hOQVpKQ3RQUm1pVXJwTHJsZUwwT3dPS2tGbFhIc05ueml0TDkyMm1GYktYa2hqYVVsaVU5TjVvT1pMdzBWb29n",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Barry O'Connor",
        "comment": "Really happy with this app.  I've tried a few similar apps but was either too complex or too inflexible for my needs.  Progression is easy to use, flexible and great for in depth tracking.",
        "date": "May 3, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRUQ0dU5ocmJISmhMaV9TQVhmWmtkZ1Q5cGV0Vk0zNnZ1cUd6cUZUT19FUmVHRGdWaUR6UjRsVkY1SUw3ZmRtMk80TWV2RWNjR0ZTOWF6QjBJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jason Curtis",
        "comment": "Progression does everything I need in a work out app. Couldn't be happier to have this on my phone tracking my lifting.",
        "date": "June 21, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPSDJwcmhENTlzMENMQjNGWGdKbzBpZVRxWDl6OUNlSUlMcTVGVkdselZ0TEZxNlkxMkRGcTdiSUxLWldJZXR5Z25XUEtQWElmeVc0dzdHdTBB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Павел Кветко",
        "comment": "For some time the problems with disappearing workouts and schedules was solved by syncing with Google Drive. But now I can't force the app to sync, so I can't download backed up workouts from Drive.",
        "date": "June 30, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRkV1MkxLbTZLMUxVZ0ZSaFFxUWNCcVBQdnNyTzdCNFBIN0hFUW9sWnJVUjBaWHlfNDV5bHVLY3ZHNFJMQ0lueXlrQk9NNmNIa1VEenJSdlpJ",
        "reply": {
            "author": "Zoltan Demant",
            "content": "Please shoot me an email about this and Ill do my best to help you out! You can reach me at info@progression-app.com. Thank you!",
            "date": "March 4, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jonathan Kong",
        "comment": "Exercises attributed to wrong muscle groups.  Data export held to ransom with upgrade.  Edit: Dev has agreed to make exporting free without upgrading. Great dev communication.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRkZiRS1jei1aQU1SSllYZUlqOURyN0Rpbk9lcGdRMmZ4UXNYcmJPUHhwbWVyeDBKT2k1MGRyWDg0Z3VBcjU4ZW9uLTZ3WHVCakVpQ0RVekFz",
        "reply": {
            "author": "Zoltan Demant",
            "content": "Hey Jonathan! Thanks for the feedback, feel free to shoot me an email with more details on the exercises and Ill look into it! I agree that you shouldnt need to upgrade in order to export your data, consider that changed with the next major release!",
            "date": "November 28, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Julia McClung",
        "comment": "I love this app! But, no glutes? I can't even add a custom exercise as they aren't listed as a muscle group. Or am I maybe missing something?",
        "date": "December 4, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRWZtdTh0OXdMX3NFR2RJSEdpbXZsRWI2R0ZDc2VqYU92bFhDeFltYUd5SGtrc3Izd2NhX211Q1pwYi03bks3SDRwalo2em9UZXRnQTRVUGc4",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Sterling Hoeree",
        "comment": "This is an amazing app. I'm kinda a geek for data and tracking progress, and I love the feature of tracking my previous workouts so I can force myself to try harder to keep that number going up over time. I also really like how I can fine tune my workouts from the templates to make them exactly  what I want; the only thing that would make it better is the ability to design my own exercise, because (for example) I like to do some sorts of body weight exercises which aren't always in the catalogue.  It's well worth the $7ish to unlock for the cool graphs too -- I find it keeps me motivated.",
        "date": "October 21, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRTJNeUh1a1R6N3RPU3UtQW5EVUtSbDlyMGtPYjFWbmdFR0J2T1BZelY2d3hWQzVKVzdLQk9YMlhUQzhNUVNiSTQ2NGk0akJGaDJyVXN0UTE4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Brandon",
        "comment": "This is an AMAZING app. I'm an Android developer myself and I can say that this app is a joy to use. The material design is great and the app just predicts exactly what you need to do. The ability to use pre-defined workout splits is great, and you can even edit them further! I love all the built in things like a rest time and even a set timer. Honestly I have not found one bad thing about this app and I've used it for months. Way to go, devs.",
        "date": "October 10, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRm9HREtIN2RzQ0h0VWVWT2RNZ3NUVHMyaWpnWGRXWUdkUmgyajVhQ003Q2RRWVg0YUNIXzlxQnRvdXlqNmZuTFhKUGhFcUJkaXptSGN4Y0VF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rob Unwin",
        "comment": "I've tried so many workout apps, and so many have some features that are cool, only to be let down by e.g. not having the ability  to customise workouts, terrible u.i., no rest period timer. This finally has everything you need. Recommended.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPR0JnLVNxTlpJYUJVOUFOcm5YcGhRY1ZpdXBQWU1Qa2wyWUN0UVFPZkdwSnVVbVg4U19pOWR4T3NDNkJjT1BNTDdoRXpxTFliTGV3VW0wVVh3",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Michael Davies",
        "comment": "IMHO the best app for developing and tracking your workouts, exercises and muscle groups. Comes preloaded with workout plans and exercise details. Dev is very responsive and continues to improve the app. UI is perfectly designed for use between sets. Lots of useful options to customise behaviour. Highly recommended!",
        "date": "May 27, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRXVhclRvSGVJZlhoMW9sOF9qb0t6RWFGbmpubnIxb3NNRVFZYkREQXNEYjNUWjlZOWdsUDQwemhHdW0tOVRqenNULWdoRVl6WFVWYk5FMU5r",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Voods Mandapat",
        "comment": "Awesome app! Please add option to add plates and quantity, I have a home gym and also 50lbs is not available in the options.  Also please add an in app RM calculator so i don't have to use other app to calculate RMs. And it will be more awesome if the RM calculator is available beside the input weight so when you calculate RMs and chose to use weight in a certain percentage you can just click it and it will populate the text box of weight input :)",
        "date": "April 30, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRzd2Y0pyTlZlY3lFd1BLRkc2NWZvX3BRUjNsbEUxM1VTNlYxRncyeHp5OEZNbDRnMmk1TV9fOV9vb01adzc5SFRYU3ZHTWZ4LWJBV1E1TWdB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Henry Raywood",
        "comment": "This app has pretty much everything you need - pre-made templates, the ability to create your own training template, statistics galore (charts, 1RM, rep maxes, etc) for all your informational needs.  Very easy to work within, you'll pick up how the app works within a day of using it. Definitely worth getting if you take your training seriously - especially for powerlifters who want to track their daily volume/tonnage as well as statastics.  Would recommend 100x over.",
        "date": "June 19, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRUJuZkU2MHJFRE9POUpLVmF1d0txdzNfZUFKbmY5bFFPekNMUUo5N3pPUEVpQ1ByMkU4NzRIOWRMSkhJbzFlTWJUU1Zrb05EZVZ3Y25GSnRz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "It's really good but the calorie count is totally bogus - it's just by the time you spend working out. Also you need to add cardio here...i always finish off my workout  I with a walk/run and I  I would love to add it to my  workout. My bf and I work out together, he lifts much more than me and ways much less but our calorie count is always the same.....improve calorie counter and add cardio and I'll give it 5 stars",
        "date": "May 30, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRXZXUXk3NG5adWRiT0FVeXo2QjB0VXVjUHlBMUVablpjT1BpS0NOM3MweS1oMUhIZDVfbnhjMExieldPTkxJcER3cHRka1E4WHR2VWlnVlFN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Monica Lewinska",
        "comment": "This is what I've been looking for for years! Takes the pain out of tracking workouts and knowing what weight you need to be doing to progress from pervious sessions. The stats are invaluable too. It works best if you have a set schedule that you follow, so you don't need to create a brand new workout each time.  The only reason for not quite hitting the 5 star, is because when you enter a manual workout afterwards (rather than tracking as you workout) it can cause Google fit data to corrupt - I've submitted a report so hoping it will get fixed. Once done it will hands down make this the perfect app to support strength training.  (Paying for the full version is definitely worth it!)",
        "date": "November 10, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRkJRRWRUcjhHdFZLS3VQUmYzRUlFUjNjUkUtNjZxRUlUNENwaFA1MVpLVXdSNmlsSVhJMmh6NXgwWnNIeFo0RTY0NEM4djROVF9JTUYyS0JN",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Scott G",
        "comment": "This app is great, especially for setting up your own workout routine. The only thing keeping it from five stars is the weights are in kg only - which is fine by me, but since I'm in American gyms, half the weights only have lbs on them and that means I have to do the translation.  Give it the option to switch from kg to lb and it'll be perfect.",
        "date": "July 21, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRXprN01nMlpUazhveEFDOFRJdG5GNzNQS0ZGa3pueUQ5NXp0MEVpMHRTLUlaWnE0NjE5cnExU1duQzRzYnFEWF9VNzhlYzUxZ2hFZ0x3b1gw",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jesica Hunter",
        "comment": "Love the app! Will give 5 stars when there are more exercises added in the \"300\" they have listed are very generalized so half of my workout I'm writing down in the notes section and therefore can't track. Also would love to see stretches added in!",
        "date": "April 24, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPSDFkZWF3elZ6eDl0UW84elh3U21abnpCXzh0VnJrQmtyZ1RCbmo2dHg4WnBiS1h1YTBqSlJ3S1J3V0JZMzA0UzZhXzdGQmRYQVkzMWM4LTVz",
        "reply": {
            "author": "Zoltan Demant",
            "content": "Thanks for the feedback Jesica, Im continiously working on expanding the exercise list - feel free to post the ones youd like to see included and Ill do my best to fit them in with the next update. You can reach me over at info@progression-app.com. Thanks!",
            "date": "April 24, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Felipe Leite",
        "comment": "Great app, bought the pro version and waiting to use it after I finish the current run on my program -When you create a exercise you should.be able to select multiple choices at time/weight (for example timed farmer's walk) or a weighted plank. -You should be able to select multiple equipment too like a speed deadlift with bands.  -Can a copy schedule option be added? If I like some routine and want to tweak some exercises it'll be easier to just copy and change something. -A share option for the workouts and schedule?",
        "date": "August 11, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRWhzbzBmb3NDRVZySXgxSFVBcEUtU216ZmpqUlpoMHNDSUhpeUR0TGlkNHpTcEJtMEJsSWZ6VEdiWHp5TGxPVzB6OVFlTVZXU2dkbGJLbGFn",
        "reply": {
            "author": "Zoltan Demant",
            "content": "Thanks for the feedback, Felipe! The next major release will include both share & copy support for schedules - also working on your other suggestions, but nothing I can reveal just yet :) Stay tuned!",
            "date": "August 12, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "J Dh",
        "comment": "Such a great app that I bought the paid version. The app has lost my data once, which was upsetting but can be understood (when it transitioned from beta to alpha).",
        "date": "April 16, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRXNiN05ibEh1MUJZY1hxWFVfcnB6OWU0azJhR2dndEdGb2I5ZENIcTV4QnFvNjNKbHhXVDVqRHROM3lHck13c3FsTExrX1lBXzRaU2pPVzNN",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lydia Klaus",
        "comment": "Has a slight bug involving the rest timer. The timer fails to actually ring, but changes the volume of whatever is playing on my Bluetooth headphones. Also tends to crash progression/the rest timer.  My only true gripe with this app is that the running on treadmill exercise doesn't store seconds. Despite having a place to specify seconds, it only stores the time to the nearest minute.  Lastly, I wish this app could sync with the Samsung health app!",
        "date": "September 27, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPRWkzdmpUYlNmTFBqY1FFZmxpQUdjQ1Y4cktEVHg1M19JSWFKT3JkWHFjUk5XYVB2WDJvMUUwSGVrdk5Wa3luUHBWTTNxZ1B1TnJrdHg3bnJB",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Filip Ljubichich",
        "comment": "The only one thing keeping it from being 5 stars is the god awful popup notification \"Time for next set!\". It stays on top of everything and makes the phone unusable. Please make it optional!",
        "date": "April 18, 2017",
        "permlink": "/store/apps/details?id=workout.progression.lite&reviewId=Z3A6QU9xcFRPR01yZEhYUmtldUVfdXAyaHV3eXNRc1NLLTRtaF9KNUF2bVowUVFBRFJLQnlvdlBFbkIxaHVKSERfMlVOOGxUQXBpSVlkeE5ndGJlbW84alI4",
        "reply": null,
        "star": 4,
        "title": null
    }
]