[
    {
        "author": "Doug Schreiber",
        "comment": "Have been looking for widget with weather and date/time that doesn't take up so much of the screen. This seems to do the best. Wish widget were 4x1 and more tweekable but, good enough. Fir example, shrink the time a bit. I like that it shows as much info as it does; I'd be willing to loose some of it for a smaller widget. Also like that the widget touch area is sensitive such that tap on clock area brings up clock and two on weather area bring up whether.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPR0N5YnlPQy11bVhWYVA5UkhYUHBXMUcyM1A4LTlaeDJiT3cyMmQweDlJY2pweUtrdTQ0N1FEaU8tVWpYekRmTTNzTjNiMWJlSWktQzVhLTdR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "One of the best weather apps available. Multable options other similar apps don't offer make it the best. Displays are well done and I especially like the transparency option for my home page. Only complaint would be GPS location. Finds the neighborhood but not the correct address. Hard to understand why since other apps have no problem at all. Must be the polar shift 😊",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSDZlSVFPUkszcU83d3U2X1RKV0FTNWd3aUpiSkV2V2dKTGJySm1iNTgtOUlVMERrYjV6aWg4VlVrOE51M0VEVFBWSHRBM2tCaVNlQjJSNkRF",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sarah Chou",
        "comment": "It makes a sound every time it updates. I've gone into settings and shut every sound off. How do I make it stop??  Ability to see both hourly & weekly forecasts is nice, but I wanted that capability for the widgets, not in the app. (You have to select hourly OR weekly forecast in the widget settings menu). Provides a temperature notification icon permanently at the top of screen (very convenient at a quick glance). I love the widget background/transparency options.",
        "date": "October 22, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRjU5RElCYy1MY3Bac1FOM0RuOUhjUTE2cTR1SUtJS3lBUmVXUlNIUXZUdjJ1d0xtaFhNU0Zqa0FrdHpod2RHN1NVcjRWWUdGSmpXZlBLZnV3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Scot S",
        "comment": "It is a very nice app. The only thing I were better is the clock. It does not allow for 24 hour, military time. That's regardless of what your phone setting is. It also has a leading zero which is even sillier if you're not going to have a 24-hour.  That is even if you use a larger Widgets or on the app itself. I wish the five by 1 widget was a little bit better laid out in terms of being able to seize a date and time.",
        "date": "October 30, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSGJ0M3EySndmMEwyNHZ5dEdYbjZaRGZHS1lsaWp2MlBIb283WEMwYnRZeUp1YUJsWHRrN1FGTGRRekI0aDFJa3QwRUwxbmlZa1JJcUU1X1U4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "It was great. Good looking. Then, about a year in, it stopped keeping itself updated. The time is almost always off from my phone's time. I'm hoping there's a fix for this.  Revision: after uninstalling and dealing with accuweather's very unappealing (albeit, accurate).... I decided I'd give this bad-boy another go. Not a problem since. It's great and my screen looks a lot better than my month without it.",
        "date": "November 11, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRjNOdmhqVlNGUEt3dy1vbGhTUWVqWER4OHJhd3QyVy1TVzh4VFo1M0VsX2pnTFQyaXZtcHlEMUpBVVBObTV1X2h1TzV5VllpOHpxY2NNZGs0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Kathy Smith",
        "comment": "Really like your app! The large clock text makes it SO easy to read the time. Just wish you could make the other text information on the widget customizable. Can just make most of it out with difficulty. The rest is so tiny I can't see it. It's a very nice app. Thanks!",
        "date": "November 30, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRmh5UDRvX01jWno5eEoyeTN0OW15eUtPeXdpak5NWE9feEVMN2NENTdZNkdtMkNjUnJqNVFPWVQ1QjV4SXEySDZtbUk1QVB5N0Ria1VGRlM0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Lusoti Consulting Solutions LCS",
        "comment": "The app was able to locate my house, town and country even though I live in a rural area and it's a dirt road. So far it's been accurate with weather report. Just wish that it also showed the rain probability percentage. That would really be great! Other than that, very happy with it.",
        "date": "December 18, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRjlmSHlpaEd6ZnBNZTh2NXZoWjZHVkY4MDBMRXhYekk2Uk8wZ2I5SnNyVENsSU9rM1UyZmhWT3BlZEpTQmVySHlSa1pnOHNmRHVZUU9VS3JJ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "John Messier",
        "comment": "Was a good app, but now it seems to be the reason why my messaging app won't work. The refreshing circle just seems to be constantly spinning. Which I can only imagine was tying up the networking and not allowing my text messages to go through. Once I remove this app, my texting goes thru flawlessly. Is there a fix for that?",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSExaQzBCNFNPNXVBWHVvbWhGb0JoM0FsR2lseDVWTjJxN2c2NXFFODE5Vi1LU1hUUVdCMVBsWVJyYzZtbWtOcTZGeVlhenYtM1gxQmE0d2VB",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Stevan Rus",
        "comment": "Weather app is my favourite. Now it works all very well.  P.S. Who and why have changed the city name of Odessa to Odesa? This is unacceptable! The original and the only one real name was, is, will be ODESSA! Ukrainian Nazis Fu*k off from Odessa, you primitives sickos!",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRlZYaWIzcnVlRTQ0aXNBaDVITVg1WDFMTFM0QlZLRmVSVE1HbGJTREd4VFMxV1JNV29DaG1BT1VfQnp1N0lhbFJWVndvRFJHNWRMRmFTaTdR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jim Silk",
        "comment": "Does exactly what it's suppose to do for a month or so, then it just stops working. Won't update, won't do anything but keep time. Galaxy S4. I just uninstalled it. Time to search for a good product.  Also, I don't know where it gets it's temperature data from but before noon, it's always 8-10 off. After noon, it seems to work fine.",
        "date": "December 18, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSENTVlRDREFYU2RiVlEzOXV5S3pwX1A2ODlhTmk2Q2tRZm5NWWNkVGwyRnNhS3IxSUlRVzFDYTAzRlJ2eTFwZUhrQ2hjajVhNW9wOGVZSFVB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jessica Golden",
        "comment": "It used to be great, and I think it's a beautiful widget. But lately it says the weather is \"sand\". All day, every day, the weather is sand. Not sandy, even (although that would still be false). There is no sand in the air. I checked. There is smoke; do you mean to tell me the weather is \"smokey\" or \"hazy\"?  This is a very strange bug.",
        "date": "December 9, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRnV1NTV2WmNXdFYxNXBBdldncE5jUFNwRmFtbzExWWFfMnpYNUhoTW1BbWFxVzlKel90bDVWay1RdjA2Vk5xTUcxejFmU1J0UEVYVDVsRDQ0",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Brian Geoff",
        "comment": "Nice basic app. Increased battery usage lately equal to my screen battery usage. Wow!  I'm going to remove my second location and see if that helps. If not, I'll have to uninstall.  It helped but it's still draining my battery. Oh well. Thank you while it lasted.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRzRhQl96bGFvYW10NmhXNWExREJidE5RajlmUnFSNnJacVl3V3hoV09Ca0cxT1lPdG82RmgzY2RTRDNrZ25VdTVzTnhRVDdNSDJnYlBNejlV",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Kelly Champion",
        "comment": "I have had this app on a previous phone and loved it. I really loved the widget on my home screen where I could see the infomation I needed without having to actually open it. This time however the widget isnt working. I can go into settings and set it up, choose the look I want and information I want to show but the only thing I get is the app icon. Not as happy with it as I have been in the past.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRVlnWFVrODlPWFFhVzFIMDJ5UHhuR0YwM21aMXRReFZmNXRPLVBreE9RZ2VlNVZreDNxdzdaaWFmLU9NMjVCZzVja21KZzY5c2Zjektpc09V",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sana Masood",
        "comment": "I love that you can have a large clock and change the color of the font. However, rest of the font size for things such as \"real feel\" and \"high/low\" etc are tiny!! There's so much empty space within the widget. I wish I could customize the font size for everything so it's easier to read!",
        "date": "December 23, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPR210cFZRb21OLXNqRVg1UlBTMHpMMXZjUW5iLTY5T0Fpd09WN0FVSmVRT3g2anpPMnN3akRkTHp1Um5VQVdMTXc5a1dEbjFSV21hU0F5Xzlz",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Jackson Savoy",
        "comment": "New review: it will not let me update my location. It keeps giving me wrong info!  Old review: Great app! My old accuweather app was a little finicky so I tried something else. This is great for hourly, tells the real feel temp, and you can access your stock clock app by clicking the time -nice little feature",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPR3loR0J0WGJpSDhfTU9FakZGOFEyV1h0UGkxeGh2ajk2cFZJMDhlX2s5OTgyNU9lYThXOHVBTGR0dEc1SWI2ajZ3N2xzWGhuV080T0VLY0Vn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Carrie Trujillo",
        "comment": "I have loved this app for years and have it on multiple devices with no problems. The latest update is now causing it to overload my system CPU what causes my phone to lag and has created other issues such as battery drain. for now I've turned off location services hoping that helps and I emailed the developer. If no response I will uninstall and knock my rating down to one star.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRUtsTlM4eTBnT1hDMWExaGx1bGxvOUh2SFc1c1FZS0wxNy11N3N4VzZQaEdVOVM5amlxXzlWVHE5VWk3ZlhqQVVrUm9PNjN0Y3dvWGFlSnhz",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Tonya Dowling",
        "comment": "Love it..mostly. looks great. Sync settings for weather updates don't seem to be in real time even when I set it up to do hourly syncs.  I have to go to weather area and resync. Totally defeats the purpose of having the home screen showing correct information.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPR2p0QnNIeWhDdGZ3MUdtdnlNdHlsVnVsdGFqTU9sckNkakZfbDQzT0xHd0dSeXdTekdXTzd6T1dhWDludVRFOFJfUDVKSFhYNEdXOEsycnNz",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Kimmy Porter",
        "comment": "I'm not sure how accurate the temperature is yet but I am concerned as to why I wasn't alerted about a fire that was only 10 mins away. I love the transparent clock and font/color choices.  Accuracy will be the final test.Knowing when a wildfire is close by and the rain accuracy is very important information for me.",
        "date": "October 28, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSGUzS1VRekdqVnZuVDFWTmQxWk5mMC1OcEQ1TnVEUHZNZUlFN1BPckNyZ08ySG5uZ2JvdzBpTE92b1ZoWHd5SE5uaTh5UEMwdW5LelJqRkY0",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Brian Davis",
        "comment": "So my phone has been crazy bonkers the last while so I wiped it. It got better for a couple days and then was probably even worse than before. Stopped sending texts. Took 100 years to load. I figured it must be one of the apps I put on there. The only one that really could have this widespread of an effect was a widget so I nuked my weather widget and my phone came back to life. Instead of 10-15% battery at night I have 75%. Speed way, way up. Yessss. Republic wireless Moto g 2.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRVlONGZ4M19MVXJCaXp0Y3QzRWhkbkJlQnN6N1VvRXVnZ1BEV3VMQ181MGVlTnhoVnNYNEJucXJWNlA0UnFNYmo3b1ZEcHdMYzkySG5YZ2lj",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "I used to love this app. But suddenly it caused my Note 4 to lag and freeze for 5 to 10 seconds. I narrowed it down to this app by doing a factory reset and then manually reinstalling all my apps one at a time. Once I installed this one the freezing immediately started back up. I uninstalled it and it stopped. I no longer can use it anymore. I'm using the stock app now. And my battery life is much better to boot. I hope you can fix this.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRk1faFlmaGd1bXhKY01sNEFxVVJyNjZxWHgyR0Z1ZjZmdEpuSURmM21wN2RQZ1JLYU9EelZld2pjZERhTkJWdHRkLXJLWkpsQVBmX19DV1ZR",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Roldan Pinos",
        "comment": "Bye Yahoo Weather!  Been using the Yahop but sometimes it act strange and it's lacking some important info. Also, it does not sync with my phone's time. So i went to the store and downloaded several and great thing i found this app. Highly rated with millions of fans. The widget has a lot of options and customization. Wonderful.   Might be getting the paid version soon to support the devs.",
        "date": "November 17, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRWZfMjdiMl9lMzNVZFp4ZWlWR3BHM0pFSDhWOXNxa2M4QVE5aW1ROHp3Q2RQMmZEYzFWN0YyNFFYcXdkbXFUcGhjazBqeEJiR3FFSDZHYXE0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Alan Shults",
        "comment": "Really liked the varied widgets; I changed up occasionally. I recently wiped my phone due to the battery draining and the screen randomly freezing. As I reinstalled I realized this app was the culprit. I then learned that others made similar complaints. I wish this to be resolved asap so I can use this app again.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRXdwdkVzdkFva0VqUjRSVXNsWERGMmFWMGtoQmpWcDZ3WThZcGxxVHFvNTZ2SDdCVVRoLVhVVEo3akI3U2owMko5a0h0NEVJaW5UeUlJeEZn",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Mitch Jackson",
        "comment": "I cannot share weather page in FB messenger. Not sure if FB or this app in error, but had no probs sharing weather in my last app. Disappointed. But otherwise a great looking and functional app! S7 Edge  Update - cannot share in SMS text either. Just sends the word \"weather\" to my contact. Hoping they respond. Love this app, but because of sharing not working gotta drop a star and keep looking.",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPR3pOdDdTNHZrenRYcDdvT01LS0s4QW5HWkg0a3lDMy13TTNtTFpFMFBDMnZTMGtWcjk4ellEZjRZREtKaDFxQ21yMlh2QjRhUjRQM3pRUXpz",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Its Me",
        "comment": "LG G3 phone would act sluggish in youtube, Google browsing, etc. Ran hot and slow and short battery life.. Did factory reset and as soon as this app reinstalled with 5x2 widget did it again. Be aware of this app widget.",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRW9Sa0JqbXJxd1Vhd3ZpX0xpVjRKYVYwQVhWbi1oWHM1cmVmU2swelVmTndFZ29yNlVwcERocldGdGZySmJvYi1Jc0dnYk84OVJ6Q29icmdZ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Barbara Principessa",
        "comment": "Before the app update, it was very good...5 star, but after the app updated, it no longer automatically updates the temperature when I touch on it and I have to manually make it update and it takes forever. Sometimes it updates the temperature, when I turn on my data, whereas before it always did.",
        "date": "December 27, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSEtlcVluUjIxVFN4VlNuMHNPUU1XaFoyaDN1bjlsOENzc0xqOGpSc01sR1VndHVyd21mQjFwVGN5T2VvM1N6UFVLa0lXQ3JBR0tFVlBoLXBn",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Paul Harris",
        "comment": "This app use to be really good, but the forecasts have been out quite a bit recently.   One night it forecast 4° and it was actually -2°.  This level of inaccuracy is increasing.  Time to change to another app - sadly.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRjhBRDNvOWlINWI1MUQ3N2JuUjlENHN1blZNcHVEX1pFU0NrbmhhdzQzYzBCXy1aV25uQTRPc0t1cU8tQU9ZLUZuLWRmbHBCeXRCVVNpOW9j",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Tudor Davies",
        "comment": "A good app & widget, shows waether and key info on home screen. One annoyance is that it seems to randomly change location for which it shows weather to one of the other places for which I've looked up the warther.",
        "date": "December 16, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSGNnQnNxWlBkT1czNDcyMXJKbENhWXEwWmNNTzdIckNtZTJDa3VwLTVrbzcwby11QmNYcGdXcjRuYlZqbXdrSFIzMXNLc1hndEZkTEdYVlFv",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Julia Dilmukhambetova",
        "comment": "Best weather app for me. Vast choice of widgets, very accurate data in my region, clock is functional (open clock app, shows alarm), no popping up add. The only thing is that you have to choose between hourly weather and few days forecast through menu, but this is not really a problem.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSHFNdkNIT1U3clRpSXhSVEF1Q1RRRkg3aFk4S3FEV2hjUk9LcjJvN1QtTjMyRGlKaU4zM2t5dFVxcElsdWZTdXZ3cGZwSWdqdG95cFAxTks0",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "This app used to be great prior to all the advertising. I'm ok with in app ads but to get full screen ads popping up while your using your phone is beyond annoying. Only reason it got two stars is because of how well this app functions. Hopefully they get rid of ads like that or offer an ad free version. Otherwise I will be finding a new one soon.",
        "date": "December 22, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSFpiRDBZRy1JZW1FazRYQ01ERnNpUkFHNXNGeFROSjFlbTdCOTNrak1pWnhvWU9SUERqWU1DekJSb0E3alZxX29oemRXYUFxa0pKSzQxQWtF",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "BHM UT BANDARA",
        "comment": "I like it its work better​ than others.thank you. I think it's much accurate than others.only matters is I can't turns off the sounds or changed ring ton. When I turn it off its even give it to the sounds.if you can fix this problem I will give it 5 stars",
        "date": "March 5, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPR3FXQS1mTzhuZVB1dVNnUjZEZ3IzT0NNdkhWX1pUcENaaU1DbTFaTlQ2Ujlkem5OVXZJSGh6TzY4TV8yeHdVbU9vR0ZGd3JGZk5SQUQ4SjFB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Tsogoo MNG",
        "comment": "Hello. I am using this wonderful app almost 4 years. But few days ago it caused temporary freezing. My phone is Galaxy Note 4, Android 6.0.1. When I uninstalled this weather app, all things going normal. Please fox this. I love th8s app. Please.",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSFg0Y3JhbzkyaE9oTXlJOHR4RjkwamlDSHdkdVNsLXl5SEpBY0ctc0N5bW5wWGVleEt4azdoV0RvX2ZhSkVPU1JWWGhhQS1KenRqQ2Z6bEEw",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "Annoying sound-on updates day and night. And wish it gave the hourly % LIKELIHOOD of rain. I'm a gardener, & want to know when I won't get rained on.",
        "date": "October 23, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPR2Z0Q2hSbWcyU2U4R2pmcDlPT2theDVwRXFuT0JwQlpPSVR3Ykkxa0hUVkdCc1JJUWhKWGRBSDFWb1BzRUxxWW4tQVhzalBVaFpocHZhMzJB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sweet One",
        "comment": "Total rubbish... According to the app our  city is supposed to be sunny the last 4 days it's been overcast cold and nonstop rain. Definitely not a weather app I can trust.",
        "date": "January 12, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRVpZcDFhMm81YlZ6V2ZoTk1WR1VVM3MyWG1VU2lQWTJ2b2pRcWp0UlNTMDEzcW84aWtxeFo3UzV0R3NId2RRQS13QmI4a0k5WEJldTgtUld3",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Leslie Harry Tindale",
        "comment": "Only installed about four days ago, so far so good. UPDATED 3RD FEB I'm still using this app and I'm still happy with it. My default location has recently been changed, have tried to delete and change it to what it should be, without success. Why? I have uninstalled the app and then reinstalled, then entered my location manually, this has sorted the problem out. Still using the app, would like to have % chance of RAIN. How do I set the widget on my home page/s? Would like to be able to sort my cities alphabetically, otherwise working well on my new phone.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSExtMHdDdDdpOXozWkpUT3pnN29fUFpIMlRMck1CYklRNXdBRWhxYXBZUXpITFowUThxNkJ6d3I0WjZmdWJmcFJfV3E4Y19DWGlrWnRBbGc4",
        "reply": {
            "author": "Devexpert.NET",
            "content": "Hi, \nThank for your feedback, you can change default location from Settings / My location. Either you can activate automatic location detection or deactivate it and select location manually.\nBest.",
            "date": "October 31, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Bedő Levente",
        "comment": "GOOD: can turn off GPS and still get weather info based on the location you choose. The BAD is, that if you refuse to turn on the GPS, the app does not offer to go manual. I had to dig the settings for that. SUMMARY: I like the way this app works. Thank you! Keep up the good work :)",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRzJjVkZSV1ZOU1FlcnY2eG9CcUlXTUdhOVJabXUySWlIMVUyZGFIdDJRUTItM3liLXBxODNpbjFIQm8zZE92MkpjVDFwSW54amc1dDJpdnlj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "The weather is never accurate. Weather underground is far better and uses local weather stations and allows me to choose which one works best. The clock and other parts of the widget are great, if only i could rely on the weather information.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSEJhdXhEY1R0dFloLWduMkNpLXpOOU5MbDVXY0FsMG9HSEhKekl1Z1pjMTdjQVp3LW1DMlg0NkpjWGZIOU9WOTZqU3dmMjhKY3J6ZmVpRGRF",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Used to work great but now causes phone to hang and prevents sms messages being sent or received! Factory reset my phone but this app messed it up again.  Uninstalled it and my phone works again.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPSHlLWkw0LWJwM2d3dVB0XzN1enp6VlZzbS15WGpuUkF4RjdKc2tmN1RKOUxrTVpxa3hCZjZmcjNETDVDeTJrUlFMakE0UWUzd18wd2ZfekVR",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Freedom Guy",
        "comment": "Would give it 5 if it had hourly forecasts. Thought it was present when I first installed but appears to do 3hr forecasts in the hourly view now. Can you pls fix - I'm about to uninstall otherwise",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPR0w0dXFVZ0x3WGtPOGxfd0p1TDIzUUVHTWpzanJkX0VXR3JMcVlWbUkwX0dqVHN1VGwwNXVWdURrdWFMQXVOelNkZVA2X2VHYnppaDdSOU5Z",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Andrew Stevens",
        "comment": "Great app, have had it for years. One problem I am having is the forecast widget shows me hourly updates rather than the forecast for the next few days. I've been all thru the settings and cannot find where to change this. Swapped the weather provider and it didn't change either. Please help!",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRldDQjVzV1ltWHBfRDktQldDMjh6Wm1MQWpoczVVQl91azMwOUtabjQxZWlfcHJIUGFuUmRvWmZCbDA3bTNBSE9feWFFbEZDSUk2ZFBfbkFz",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Mia Dorton",
        "comment": "I'm set the other apps that I've tried for weather if the gold digging around and hunt to find a 10 day forecast no, this one makes it so easy right off the bat. I love this app!",
        "date": "December 15, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weather&reviewId=Z3A6QU9xcFRPRmlxcFRRQi1aTzNxaU1wMDFjYXl0dnNLN3M5eVJ1bXFreEhoZEZwRGJZUnc5OGZ1R283Z2UyRUYzb0EwXzNWQ0tkVVdQbHVWVF9Kd0p3aEg0",
        "reply": null,
        "star": 5,
        "title": null
    }
]