[
    {
        "author": "thazleem ali",
        "comment": "I gave this app originally a one star rating & uninstalled it because of a battery drain issue. However, I decided to give the app a try again and installed an updated version which seems to have fixed the battery issue. Now I'm totally studied note with the app even though I still believe the interface can be made both more simple & useful",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRUQtQjg1LU9vTng5WFY0U3dLZER5bGFack0yYTlKblRGX0JCS1VCNzd0TEtTTGdydEVIQjBwOHY0UmdVT1BBTmI4dlBsNEotMlQ2RTdxWmc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We appreciate your feedback. To resolve this issue please download the latest version of the Fossil Q App. If the battery issue continues please email q@fossil.com. We will be happy to help. Have a great day!",
            "date": "October 23, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Nicolas Pieter",
        "comment": "As with other people, i too have an issue with constant refreshing of my phone when the watch is connected. Please fix because i do like the watch.  Here's an idea for the next update, make the app consider Whatsapp, Telegram, or Line calls as regular calls or make them as separate notifications. Now, when i get any calls from those apps, it thinks i just got a new message.",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRUNvMTg5aU8wRXN6WkVSWnBwdFh1TUZmREdJVUtuN3BmNjlCNEh5X2NubVZuWVJtN3U4LThHeGV0UUpTeF9tTmxkUlBYVW9lOG1DcTFUQmc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for sharing your review. We appreciate your feedback. With regards to the refresh issue, please email q@fossil.com with your serial number and account email so we can help.",
            "date": "January 25, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Revanth Raj",
        "comment": "I love the design and the features are great for a hybrid watch. Except for the app design. The stats doesn't show anything in a well established manner. Q legacy app is much more detailed and intuitive. I wish this app shows more details about live sleep and deep sleep atleast. What is the use of a sleep tracker that is unable to show you details of your sleep. Please add this feature so that I'll be happy to recommend this over to others",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRmkyRk9LRlVXWHZIQzU4V18zYzc5UHBOQjl2MHpNUEh1b09Vd1dpaFdDVGdTZG1vN0NLTlNqZi1NVF85el9lczlWVFpXRkQ2dlNFa3pBcnc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for sharing your review. We appreciate your feedback regarding the activity information in the app. We have shared your feedback with our team to take into consideration for a future update. If you have any other questions, please email q@fossil.com.",
            "date": "February 5, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Mark Acar",
        "comment": "I own a fossil and a Skagen hybrid smartwatch. They are both made by Fossil, yet the Fossil app is an utter mess! Both apps do the same thing essentially, but fossil favours animations and out of place fonts over intuitiveness and function. I don't want to press every button to find a function!  Please clean it up, the fashion statement ends with the watch!",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRXhuSlhxRzZOVGE2UU1uRFRNU3h2UEpyYUZvTV82ODFERTNIZlNzZXg4blhaekdxQlpVODdxSXRxYUlsd0pKOTBLVzdNVlQxNmcwN3ctZmc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "I appreciate the concept of the app but the constant refreshing is beyond annoying. I read an article or a story and it keeps refreshing to the top or backing out altogether. The refreshing is every few seconds it seems. Have narrowed it down to the Q app. I have disabled Bluetooth so can no longer use the app for all the other features but once I disabled the Bluetooth for the watch everything went back to normal. Now I can only use it for time, date and the step counter. Please fix.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRWhDMHltNnJZVG9ZRjZlVFR2dkxubzhWY2Zmb0RYSm1PT0FrTWtlN0drUEI1M1ZxMGFqTFJ6QkhfTmlVQ253YXB6Z0RldEwyQlA4cWVIOUE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We're sorry to hear about the trouble you've had with the app. We recommend alternating the shortcuts assigned to the buttons on the watch. If the issue continues, please email q@fossil.com with your serial number and account email so we may help.",
            "date": "February 13, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Cassidy Salisbury",
        "comment": "Got a gorgeous watch for my birthday but come to find out the Fossil watch and app cause my Samsung Galaxy s8 to constantly refresh. Can't scroll through Facebook, watch YouTube videos, or even read articles online without it going back to the top of the page every 30 seconds. Extremely disappointed, please fix this",
        "date": "March 4, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPSHJkSEVFMENYa1drSExqNGx2TFNpZXZpWEdCNWpKelAxeWZFODNrcFRyZVp0ZmVyS1FQak1ZYnZIUENmTzFuRnE4QlhXS09VUWpzWTh4ZVE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Linda Ng",
        "comment": "I was quite happy with the app till latest update, which makes the watch respect the phone's silent mode. This is EXACTLY why I hated Android Wear -- why would you want a smart watch if not to be able to keep the damn phone on silent mode?! I wish I can reverse the update. This app, and the watch, are useless now.",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPR05wWmU4bDhsTmtCeG5mNnJoOHNtUnNqVVFuYW8zZS1UZ1lPVE84NmtQOFUzdXV0R2o3a2IxNU9QNjlxTUFlZnY4b1JSZE41dTNlblJsbmc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "We're sorry for the trouble you've had. Your hybrid smartwatch is designed to be an extension of your phone. It will receive notifications that push to the lock-screen, even if the phone is on silent. However if the phone is in Do-Not-Disturb mode, you will not receive notifications since the notifications won't push to the phone itself.",
            "date": "February 1, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Samantha Howe",
        "comment": "Please change back to receiving notifications when my phone is on Do not disturb or at least give the option! The reason I have this watch is so I can silently receive targeted notifications to my Fossil Q device. Otherwise what is the point?  Conversely, now I'm getting notifications for muted WhatsApp conversations, which shouldn't happen.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRUxqbVNpS1A3RGxrRmpoT0tRSTIteEd3aHZYNURJNU8yODdVTi01Ty1od3M1MDhWUkpTTExGX19UYldvaHNiU19JdVp5TFhPRzN5aWZmUHc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for submitting your review. We sincerely apologize for the trouble you've had with the changes to the app. Please be advised notifications will only work for apps that not affected by Do Not Disturb. For WhatsApp, we recommend resetting the assigned notifications. Please email q@fossil.com for more information.",
            "date": "February 6, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Gareth Knight",
        "comment": "Do not disturb! Bought the watch yesterday and love it, the app would be fine but it renders the watch completely useless because it won't show notifications if the phone is in do not disturb mode, or even if the phone is on silent. Why would I need the watch to tell me I have a message or a call when the phone is ringing and/or vibrating? Surely the whole point it to be discreetly notified of a call or message from a preferred contact WITHOUT the phone ringing or vibrating!? I can see many others who agree but I am concerned that the response from the developers is not positive. Unfortunately I will have to return the watch while I can as I can't risk waiting to find out if this issue is rectified or not and ending up with a nice but pointless smartwatch.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRS1seTNIcURETjcydXRtU1NaUFEtVkRmZlZoUTAyTUpGbHhIN05kT25rTXk1T05TMzg1dE5kMk9oOHJCXzhOV3Fpc1JqVFM0cEF3d09yT0E",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We appreciate your feedback regarding the Do Not Disturb feature. The only notifications that will be received on the watch during Do Not Disturb will be from apps not affected by Do Not Disturb. Please email q@fossil.com if you have any other questions.",
            "date": "February 12, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Chris Hoarau",
        "comment": "Just bought the watch a few days ago. Since that day all my apps keep refreshing every minutes. Can I know if you guys are working on something to fix it ? Cos I really like the watch I would be sad to bring it back to the store. 😑",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPSGxxTW5JUGlGTmNtUjM0UlpCbWt0NWFDMzJHTTgxSFFEeEo1OGM2Z1R0VldGSVk4d2YtOE05MmpOczhmOS1lN1kyV0NaRTBsSllZQVkyNGc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We're sorry to hear about the trouble you've had with the refreshed apps on your phone. We recommend alternating the shortcuts for the buttons. Please email q@fossil.com with your account email and serial number.",
            "date": "February 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Erin Maher",
        "comment": "I'm really disappointed the dumped features on the legacy app still haven't been returned in the new one. I don't use the app nearly as much as I used to. It's a shame you don't appear to react to the requests for the features to be reinstated. I live in hope, and will keep using my watch for now. But unless there's a change I won't be recommending to others and will be looking for another product next time. I love everything about the watch except the app's missing features.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRy1IUHVvMzM0c1paT1l6dEdKSTVOWGlLc3NkMldNSlFnLUFHU1EzYkFLVTlXV3YtckNNd25WVXBfTmc1djdrWUp0WU1QUkJoVTE4TW9SSFE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We apologize for the trouble you've had with the updates on the Fossil Q app. We appreciate your feedback and have shared it with our team for further consideration. If you have any other questions or concerns, please email q@fossil.com.",
            "date": "February 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Sharon leung",
        "comment": "Setting calendar notification has a bug: I cannot reassign the number, or even deleting it. It just stays there forever unless I reinstalled the app.  Also, a suggestion on what to do with buttons. It would be great if there's a function to push and call someone specified.",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRW1WdXJ5ZndPVE4wR19ac3BkOGwxZnI3RWtyR0I0a2UyTWdpLTR2a0VpVFlSTUY0d01admJUdFlleF9iS0xMVkFOa1FidXNJM1lTN1lKZkE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We appreciate your suggestion for additional features. If the issue continues to occur, please email q@fossil.com with your serial number and email associated with your account.",
            "date": "January 24, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sherri Jakes",
        "comment": "App is nice enough and seems to work fine, but it causes my phone to auto refresh constantly. It's become so frustrating that I'll be uninstalling, rendering the watch nearly useless for anything other than keeping time.",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRlc5WE44Qi10bUJCV0JVVVc0UGxKd0hRRVlNUTV3YUdXc3JJRXRwT0YyVDhUdDVpaGtSX085T2x4UXE1clZhc25hN1R6aVBVRHdyNUlrdXc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We're sorry to hear about the auto refreshing issue. Please contact q@fossil.com with your serial number and account email so we can help.",
            "date": "January 25, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Chris Giordimaina",
        "comment": "Brilliant functionality and previous connectivity issues have largely been solved. Some requests for the team: The ability to assign one of the physical buttons to call a specific contact. Remove the maximum amount of apps you can get notifications from. I can think of a few apps that I would be more than happy to assign to the same number for notifications. Keep it up guys! Edit: For people having connectivity issues or issues with missed notifications, try turning off Bluetooth then clear all data including cache of your Bluetooth system app. Turn Bluetooth back on and connect to the watch. This solved my issues.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRzg5b3h1Nm1kQmVUNnBUUHZoMENseVA4cXlJX2NDd0xXRnRIbDNQZjZMTDlvaGFIS0Q4cWFIbThxbnRqLXlRM3JOQ3VOS0V0LTlkdWc4a1E",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your recent review. With the recent update, the notifications will respect your phone's Do Not Disturb setting and if the mode is on, notifications will only work for apps that are not affected by Do Not Disturb. For more information, please email q@fossil.com.",
            "date": "February 6, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "James McFarland",
        "comment": "Had to downgrade to a 1 rating due to this app refreshing issue that this app and/or watch is causing. It causes all of my apps on my phone to randomly refresh. It's a widespread issue and fossil has not fixed it. Love the watch but looks like I'll have to go to another brand.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRUVEczZqM25YSnVzaWRkRHlWMkZ4UzVGNXVPc1lEQkgtUlA0aHlhamlCMHlxdDFvel9HbXpWUk1FZkpoVVRFaGotXzZYaG5peXhFbTBzaUE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your recent review. We apologize for the trouble you've had with the apps refreshing. We recommend alternating the shortcuts assigned to the buttons. If you have any other questions, please email q@fossil.com.",
            "date": "February 7, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Rajesh Nair",
        "comment": "The watch is simply great! Some suggestions: 1. Could you add functionalities for double clicking, long press for these three buttons. This will help the user use all the functions to the fullest. 2. Also, would love to have this watch do more functions.  Amazing concept anyway. In love with the watch.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRlhCdldTYVdsN0xRRmJwdXprdGI5U2dYbk52TE04NXNkSEpnNzdTM0J0UVlwT3lGV0dzTVdmT1hhRHJyeTl2T3Z2UzVySm4xelhBWFNVOUE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We appreciate your suggestion for additional functionalities for our devices. We have shared your feedback with our team to take into further consideration. Please email q@fossil.com if you have any other suggestions.",
            "date": "February 19, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Renea 30",
        "comment": "My only problem with this app is I can't go back & look at my stats. I didn't look at any of my stats yesterday so I don't know I slept or how many steps I took. & thats one feature that I really like about the watch, you guys should fix this.",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRmtFSGowdHZfYVB5akFsMFhoUXpCU0Q3bzUwY3VZRjlTWVVSZlgzbjlIMjB3MFh0WF9waXZ4UlgyelJkWmFycThGcWNvQUl4VzhiV08yaGc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. To view your previous stats, you would go to the activity tracking page and select the option that says Today. It should drop to allow to view the previous days or it will you to view a date from the calendar. For more information, please email q@fossil.com.",
            "date": "February 19, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jake Seward",
        "comment": "I LOVE my Fossil watch. Don't get me wrong. Getting into the smart watch game was smart IMO. But man this app is killing me. My phone (Pixel 2 XL running 8.1) refreshes all the time due solely to this. I have to turn Bluetooth off and block the app from running in the background to prevent the refresh. Please help.",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPR1BoYWpPUkpfRHo0R3hJX28ydjZDWkUtSlhnb01GOVMxaHNCMjNwMEM4Q1N0Uk1yY2xXT2QyMjJUSGpKRjRRV2RVMnVJREJiN2pRVUdHbHc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for sharing your review. We apologize for the refreshing issue you've encountered with your device. Please email q@fossil.com with your serial number and account email so we can help.",
            "date": "January 25, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Jeremy Zeis",
        "comment": "I enjoy the app, and while all functions perform properly I wish the latest update did not make my watch silent when my phone is on do not disturb.  I think a good update would allow you to toggle if you want the watch to silence on do not disturb mode or not.  If that was updated, the app would get 5 stars.",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPR3lJRXB1U2xxSFA4SVRncnk5cXVMY2ZiRktMMDluc1NtRG1BakJrbTBtckpENVF1RnJVTHlsR0pPUXhsZ3ZZVnl4VXlaV3RvQU9VNHdVRkE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "The application will not allow me to map the camera function to one of the watch buttons.  There are other shortcut issues as well but this is the most disappointing. I tried calling and email Fossil Q support but never get a response. I'm using a Galaxy S7 with Q Grant. Would be great if support would help. Of course I have checked to make sure that the camera app permission is set.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRmdxR3psOXR3aXlPd2JOc1FkNGFWamw0bVQtekJhclgwdTRFaUJ2aDdTM2h6YlM0ekl1a1pBRS0wbXlYNDduV05WYWttVkJtbi1laWNLR2c",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We're sorry to hear you are having problems with the shortcuts in the app. Please email q@fossil.com with the style number from the back of the watch (FTW-####), your serial number and account email.",
            "date": "February 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Conor Ike",
        "comment": "I stopped recieving notifications from apps (whatsapp, messenger etc.) after the lastest update and the silent mode is an aweful idea. I want to be able to recieve notifications and keep my phone on silent. I reinstalled the previous firmware cause it was great.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPR0JZWElTeC1nWVVYUDVSRUh2eTFZYTNCNXdVWjJaV3FhcndJTWdtZ1dVamRGWGdNQnVMT1BGa0pNNHZHeDhpaUxpSVNXa3Z3dlI3VXAzTFE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for sharing your review. We apologize for the inconvenience. With the recent update, the notifications will now respect your phone's Do Not Disturb setting and if the mode is on, notifications will only work for apps that are not affected by Do Not Disturb. If you have any other questions, please email q@fossil.com so we may help.",
            "date": "February 6, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Rachel Leigh",
        "comment": "The app really needs improvement. When my Bluetooth is on all my apps just keep refreshing all the time. It's such a nightmare. Also the watch doesn't always vibrate when I get a call or text even if the watch is right next to my phone.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRXdfRjJ4akdpSE9DRUViUC1Hb3FlcEhvX1pmTmNicHNrTllZNlRfeHUxdjRVclZaUHEwM3BFUnA1V3kwR3ZScWdtOFhOMGhyZjNRaF9TVnc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for sharing your review. For the notifications, we recommend removing and reinstalling the app. With regards to the refreshing issue, please contact us at q@fossil.com with your serial number and account email so we may help.",
            "date": "February 5, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "The watch doesn't show any notifications when I put my phone into Do Not Disturb mode, making it totally useless. Would prefer an option to overcome this as I have my phone on Do Not Disturb at work but still want to have my watch notify me when I get a notification.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPR1Qxald6ZVd1V05NcDJxZmFKWXVOTUhNVWxHcHgxYUxheXEyVGNXUktCMV96RHRfenUyTUZSeGJIS3hrUjVpUFh1RTNpMnRTRGVqS3VrOUE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We appreciate your feedback regarding the app now respecting Do Not Disturb. Notifications will only work during this mode if the apps are not affected by Do Not Disturb. For more information, please email q@fossil.com.",
            "date": "February 6, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Mallory Keck",
        "comment": "If it's connected to my phone on Bluetooth then my apps constantly refresh, very irritating. Even when it is connected via Bluetooth I don't get any notifications on my watch.",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPR0N3Mzlhd3d0NGdhTHJENEl5UzBkaVdGdmdzN29NT0FjVDNDd1dOV3o5bk9IUV92TURHT1FCSnVPUVJYX1g2d2NESlVGVURiVkpFNThVQ0E",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We're sorry to hear about the apps refreshing on your device. Please contact us at q@fossil.com with your serial number and email associated with your account.",
            "date": "January 24, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Marc Laberge",
        "comment": "Functional app, not great or bad. Features list is good. However, the last update screw the notifications to respect the phone do not disturb mode. To me that is the point of the watch, to give a notification when the phone is on mute / do not disturb. It really needs an option to toggle this ...",
        "date": "January 30, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPR0o2S1FoZDZTb3NkQnNwWnEzNGFGT3RKR1ZZTXRIRFJKSHNhM1lUZ2pQcW0xcXJiZG5zUFUwNjhNa3Y3UHZBM21XT2R6OE93N2JFQ29uaWc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for sharing your review. We apologize for the trouble you've had with the recent update and change to the Do Not Disturb feature. We have shared your input with our team. If you have any other questions or concerns, please email q@fossil.com so we may help.",
            "date": "February 6, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jeff Shaw",
        "comment": "Had to stop using as when connected with Bluetooth,  it causes several apps including Facebook and USA Today to constantly scroll back to the top of the feed or artice you are viewing. Basically any app that has content you scroll down to view, this app keeps popping it back to the top.  Causes youtube video to pause So annoying.  Not sending serial number as you must be aware of thus oeobkem due to many other posts with same issue!  Please fix or returning watch.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRUJOUmNkRWFIY09zZTF0eGhjaURVWjljcS10ektaSUZEb2N2TmNxazZQY2RmYnRtaFFoSl8yQUVOc01ReFhUcHV2WWhZQXBOQl9UOGJwMEE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We apologize for the trouble you've had with your device and the apps refreshing on your phone. We recommend alternating the shortcuts for the buttons. In order to best assist you, you will need to send your serial number and account email to q@fossil.com so we may help.",
            "date": "February 5, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "G C",
        "comment": "Hey guys, can you guys combine the music volume button to have both go up and go down with the same button? Like press and hold for down, press once for up or something of that manner? Be really cool",
        "date": "February 15, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRXNUbndxUDQ4YVFBNGQzUU10OFJVUDdGcm5jTXhnY3RRcTRybUc2Z1FqTkVnSGl1dGI1RTh4Q0RBVXR0eVBXNk0zdkg5QnJyZHRjc09INFE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for sharing your review. We appreciate your feedback and have shared your suggestion with our team for further consideration. If you have any other questions in the meantime, please email q@fossil.com so we may help.",
            "date": "February 16, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "MaTheresa Halog",
        "comment": "Hello! I am really loving my Q Accomplice but the problems are with the app. I didnt have problems yesterday when i got it but then this morning, I was not able to change the buttons on the device using the app. They do not appear at all and I cannot change or select presets. Please fix this bug on your app.   EDIT: THEY FINALLY UPDTED IT",
        "date": "January 27, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRVcxWlFIYkVQUk1MbmFaalRfOU1oOG9lbEU0THFHa1N2Rk5PVHhqWWtVc3ZrME5Iai1RT2dtaU1mb29obThsMk1rZ0c3OVlEd2ZaV0VZSmc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your recent feedback. We apologize for the trouble you experienced, but are happy to hear the update resolved this issue for you. Should you have any other questions, please email us at q@fossil.com.",
            "date": "January 29, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Daniel W",
        "comment": "Latest Update 1.10. broke the Alarm feature. I can't set Alarms for 12:30 or 12:45 for example (basicly any alarm with 12:xx) since it gets interpreted as 00:xx. It won't let me set alarms for 12:xx.  I can select from 0:00 - 23:59, my phone is on 24h Format so no AM/ PM. My Watch is a Fossil Q Nate Hybrid. -- Furthermore please let us define stride length. Distance is far off. ------ Alarm issue resolved with newer version. Thanks! Stars going up for it.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPSHN5UFBFbUFMMW9EYTlxcFJKNGlaRHQ1NjQxa2l1S0lzQWRveHRrNFJPMGtTRkdLbnlnLW56R183OFlGcWJPZ09UZXRaLUxNM2l1b21IQXc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We're happy to hear the alarm feature has returned to normal. If you have any other questions, please email q@fossil.com.",
            "date": "January 23, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Nicolas Donnay",
        "comment": "Since last update (2.2.1) the notifications on my Q Grant don't work anymore.. Even after uninstall / reinstall... So now it's just a simple watch.",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPSHlMX0V3V2pFczVKYVQ0TGNaS3JKZ1pPVHZaWlctQ1pZbVI5YnFTOXpVbXN5N1FOUlFoNlo3TW5iQ3hyUG9aLVFRemVHc2JBNWpxcFp3UFE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "We are sorry to hear you are still experiencing issues. Please email q@fossil.com with your phone type and information, so we can further assist you.",
            "date": "January 29, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Kaushik Baporikar",
        "comment": "Used to work just fine. Now i dont get any notifications ☹️ I have a crewmaster. Edit. Have already done all of that. Checked online for solutions. reconnected the watch. Reinstalled the app. Nothing works.",
        "date": "January 24, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPSGFUWmtKeVktRzB4UFZTQ0VGVWdKaWJJdF9KZlZFWFRmcllnN0ZoZUtCVldFWEsxTkVFWVJmakpJWklpbDE3QnAxYWI5VS11SDcwQTJqRmc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We apologize for the continued trouble with the device. We recommend emailing us at q@fossil.com with your serial number and account email so we can help.",
            "date": "January 25, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Phil Vance",
        "comment": "Many UI and functionality improvements. Don't get notifications for MMS messages on the watch, though.  I appreciate that it doesn't insist that I have the GPS on my phone turned on to interact with the watch any more.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPSGlicmZQQ0E0QjV1VnpTZWNtN2N6U3UxMjhjMVlURjdvTDhYd0wxcHB4RnRWNjkwV0RsOWJEeGphdlhRRkVGNTlHNURQSFEzeWNWTzNpN1E",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We're sorry to hear you are not receiving MMS messages on the watch. We recommend trying to receive the notification with All Messages option under My Apps. If the issue continues, please email q@fossil.com.",
            "date": "February 21, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Nitin Shah",
        "comment": "No reply / didn't even read my problem as below - Return watch request recd from Fossil India. That's not solution. That means Fossil cannot correct issue of Fossil make watch !!! Then only GOD is solution.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPR0NjOVAxSXVUeUx0WVd3alFzVkExUmdPR3dKU1Byd2EzMmRGVjJyVEU5amZsMkRuUEFkWHFTaURseGlMRlBsUVo3b2kzMC1rYmlrb2lXb1E",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Brian B",
        "comment": "Fix the refreshing problem then I'll edit my review and don't give me the generic, switch shortcuts button and Uninstalled then reinstall. I have this problem with two different fossil watches and two different phone brands.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRmZ0cHUzM0FZcWZ6Y2NmSXp1enZoVEE2VWJDdDFubTFvdG5OZkFZOUJYSlhvWWM1YW9Id0VnUTNXYnlpcHlSVlB2b0FVV1dkQnBLOV9rNUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Fook Leong Tham",
        "comment": "Great job guys you finally turn of the features to turn on GPS for syncing. The notification UX is much better. The previous interface is confusing. Keep it up!",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRWtyLTR5bHJUMnA2ZUNURWVWZUpjWDJMTF9KcjVJTDFoenNxWGltYzZHQ1NFeU9MNVhBd0lNa0JxRXF3Y1FFTkNvcFZfNm90Q3l2Z2hzX2c",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review and feedback!. Our Fossil Q app only requires permission to access your location in order to connect via Bluetooth. This is a requirement by Android for any applications that use Bluetooth to connect to your phone. The app will not consistently check for location data.",
            "date": "October 30, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Kaity O'Hearn",
        "comment": "This app constantly refreshes the screen and all apps (including keyboards) on Samsung note 8. Confirmed via forum with other users. Loved the watch and capabilities, but if not fixed within the 30 day period, will have to return since that isn't the point of a smart watch.",
        "date": "February 16, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPSGl1b0xBYUNfTTEwZGUzQTJwdGxPLU5rM3I2VXhZQ3hjQncyOWxuc1NtSW9FYWY1RktBd29UWDJZdG5HSXRmaXNCV0gydFZKb0tYMnFVNVE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We're sorry to hear about the trouble you've had with your device and the apps refreshing. We recommend alternating the shortcuts assigned to the buttons. If you continue to have similar issues, please email q@fossil.com.",
            "date": "February 16, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Posma Prima",
        "comment": "With all your responses to the complaints going on about apps refreshing and not getting notifications in Do Not Disturb mode is giving me the impression that you don't really care about what your customers need. Honestly the apps refreshing is super annoying but I'm giving it the benefit of doubt that it's a bug you're trying to figure out but why in the world would you not give us the option to push forward notifications while in Do Not Disturb modes. But what do you care. I'll bet you'll just give me the generic cliche answer that has not satisfied anyone who have given their concerns.",
        "date": "February 14, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRWVQeGlYU01CTGF2UzVVR29qZzlidXFsandVaGZQZVBRSUFxYXBvYTgwdUFyMHJCMkg4dWhoeDFXbnlhV3MxZVh6M1V4TzZ2Mk5sZE1GNVE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for sharing your review. To receive notifications during Do Not Disturb, you will need to add the selected apps to your Priority list and use Do Not Disturb - Priority. For more information, please email q@fossil.com.",
            "date": "February 14, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Ade Fischer",
        "comment": "Works exactly as expected, very pleased! Living in a dangerous country I would love a panic button on the watch, I'm sure I'm not the only one. Is this possible?",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPSG1TaTEwLWlma3dibmVtY3JVN3czR1F3UDlqNFBLSE4xaFI2eGFnVGpzSVBSNDc4TmYtdzhPU2VNcC11WkdjTUl0NjlDQzRuNmdXbVVNelE",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your review. We appreciate your feedback and have shared it with our team for further consideration. If you have any other questions, please email q@fossil.com.",
            "date": "February 26, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Melvin Ch'ng",
        "comment": "Need more features. Came from Pebble and found out that it's super lack of simple features...",
        "date": "February 17, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPRnJtUGVaX2hSVl9aZXBWTmhCMi1oRk9QNXVId0todzRXZTJRblZOWmVSQ1NkRnRSenNVZjU2MEpCZnJNcVNiMkVXc1I0R21LRy0zOHNYdmc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for sharing your review. We appreciate your feedback. Our hybrid devices will be able to have shortcuts assigned to the buttons, such as Music Controls, Commute Time and Take a Photo. If you ever have any other questions, please email q@fossil.com.",
            "date": "February 19, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "While I'm happy to see that the latest update has removed the unnecessary location permission required to sync there's a new issue that has been introduced. While I can understand the new feature of \"notifications now respect phone's do not disturb mode\" this ruins the watch for me as the whole point of the watch is to get notified by it while I can leave my phone totally silent (i.e. no ring or vibration). To do that you need to enable do not disturb (alarms only) mode. Due to the update I can no longer keep my phone silent AND get watch notifications which is very unfortunate. PLEASE add a feature to make this optional. That all being said on a positive note it appears connectivity reliability has been greatly increased which is nice to see. EDIT: I appreciate the response but the point was missed. When I mean silent I mean no ring OR vibration on the phone, and only vibration being by the watch. Since Android 7 the only way to do this is via Do Not Disturb (Alarms Only) being turned on which is why I am not a fan of the new update in the regards.",
        "date": "January 26, 2018",
        "permlink": "/store/apps/details?id=com.fossil.wearables.fossil&reviewId=Z3A6QU9xcFRPR2dEOVAzb2pqSlNVNDlBS3ZQd0V6Uk9KM0hEXzVuZ1JqczRaZEpoMTlKRlFrNHQxMmY4akUxT2Q2ZkxWU3R5aVVFRVFEVFhPN0hPQ1RDMWc",
        "reply": {
            "author": "Fossil, Inc.",
            "content": "Thank you for your reply and feedback.We take your input very seriously and are committed to continuously improving our products. We will be happy to forward your feedback to our team. Please email q@fossil.com if you have any other questions.",
            "date": "January 29, 2018"
        },
        "star": 3,
        "title": null
    }
]