[
    {
        "author": "Jay Hch Ayy",
        "comment": "I like the watch, reason I downloaded it was because reviews and other people having zenwatch 2 issues. I have had issue with other faces and I believe it's because of that. But Gary Shook has a good suggestion to add steps counter in place of the battery percentage. Since the bars on the side show both phone and watch battery or if they do not perhaps label them respectively allow for that. It's a great watch face very pleased with it. Like the look of it very futuristic. Thanks.",
        "date": "May 4, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRW1PajZUeGNxOXRTUzRWRnItc2NEN3hCdUUtaU9VVF9NZURoeV9oOEs0eG5EVHEybmVJUWVVaEdBbU9JSUpiZXlxaUhNVkRLeXkzenB3NTNn",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Jorge, i could have it user selected... so the user would decide if they want step/heart/bat% ... im working on it.. Thanks for the support meanwhile :)",
            "date": "May 9, 2016"
        },
        "star": 4,
        "title": "Great face"
    },
    {
        "author": "Todd Cockrum",
        "comment": "Only problem is that I can't open the app from my phone. Works great on the watch though. I love the app but need to get to the options from my phone. Any suggestions? I have a Samsug Galaxy S5. Thanks, best dial I have ever seen. I have been a timepiece fanatic for decades(particulary automatics) and love now that I can replicate anything I want with software and LCD. Your app is what prompted me to buy a smart watch. I just came across the app randomly and was immediately sold. Thanks! Any help appreciate",
        "date": "March 19, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR3BIeVdsbUZ5dmpqTlA2WVBHYzJWWUxwSDllbUdMOFU5MkxUbmxlX2J6WUMwTlExQ2FfbnI5a0hvblBvSUNITkd4WmhBS2M2SzVDM2Y2RlE4",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Todd, can you send me a email about it? i'd love to help you out, we'll figure the settings location together... Thanks for taking the time to leave a feedback, much appreciated!",
            "date": "March 27, 2016"
        },
        "star": 5,
        "title": "Totally awesome!!"
    },
    {
        "author": "Paul Spoerry",
        "comment": "This was the third (of many now) watch faces I've scooped up made by Tha PHLASH. Mad futuristic style... many props.   Wear 2 folks, install to phone and it'll pop up on watch.   He has so many incredible designs. I can't help myself and switch them up constantly. If you have issues check his website/instructions first... if that doesn't work he is an EXTREMELY responsive developer. Two thumbs up and a Word Up to Tha PHLASH for some awesome designs.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR19VLVY4RUtua2pEQmdLLWk3Sk9OUjV3bTY3MGFYLTU5a1FsZklVUmZXeEs3MmQzcnpaTkYyZ292MXY5eGZ4elJ1MzBvdGFZc1ItNGs2X0U4",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Paul... thanks for the love, you're a kind person... I really appreciate that!",
            "date": "February 9, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Joe Paul",
        "comment": "I can't really rate this yet because I've not been able to use it. Stock Nexus 6P on Android N Developer Preview 3, Moto 360 1st generation. It's just not installing and don't see in options of Android wear or watch. It's like it doesn't exist. Once I can get using it I can review it. I appreciate it!                          EDIT: I was able to get it to install but it lags somewhat. Keep in mind I am using Android N so it may not be an issue with the watch face. It is highly customizable and nice function",
        "date": "May 23, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSGxUSTJsMWVHRmtocWZoQ01tMHpxWldrdWZqS2drNVNLdFZZeHRQUWR3cmlfQTFpZWs2WWZQMEl5dEdtRDFmemw0dS02cE9sdC1jd3JraFpJ",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Joe... can you email me ill help you out and get you all setup. Thanks for the feedback!",
            "date": "May 20, 2016"
        },
        "star": 4,
        "title": "Good looking but lags"
    },
    {
        "author": "Robert Dennison",
        "comment": "Love the default view/color scheme of the watch face. At this point it's a lost cause for me, since my watch (Ticwatch2) isn't supported, but I love this too much to justify not having it.  =]    Current issue I have, is changing any actual settings either from my watch, or from my phone; neither of which work.  =[  I'm having the same issue with your other watch faces.",
        "date": "January 11, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR2s2U0FhRDZnd25Rd1hodEhCNmlWNFNlYVVaUC1PY0RzNHRRcHdEcE5weXdTb1lGMGFPeUI4WnRDcERDUlQxWWVCWEJqSGt5QTZCQzJBSzQw",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Robert.... when you change the settings from the android wear app? You can email me if you want, ill see if i can help",
            "date": "January 21, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Daniel Ross",
        "comment": "Downloaded it and its no where to be found.  Does this not work with Wear 2.0?  Not seeing it as an option in any menu.  edit*  Changed to 4 stars, had to restart both devices and allow access from the actual watch once both were reconnected.  Would be 5 stars without that hassel, the face looks good and is highly customizable.",
        "date": "April 1, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRlY5cEJIRlR1OEtxQmVuTFhSTWdYUzdLblFoSnUyWEdMdmFfSlZhcGUtOFFyYWs3SDl3OHhXekZjMHhrekM5djlubGVKTGloM2tlZWk4a3Uw",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Daniel, install them on your phone, and then check the \"apps on your phone\" section of the Play Store on your watch.\nIt doesn't show up in the Play Store search on the watch, so you won't be able to install it without being paired to a phone. Also look at my NAVI2 watchface, thanks!",
            "date": "April 1, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Mick Forcelledo",
        "comment": "ASUS ZEN3 WATCH Ordered this face 3 times (two asked for payment).Although Google reports it is in my device it must be hiding rather deep. I have all my faces on one folder so looking for new faces is easy. I do hope I was not charged 3 times.. If this face iis NOT compatible with ZEN 3 -- SAY SO!",
        "date": "June 20, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSExya0hfa0swLUoydFZlQUFuc1Jfa2R3NWhTc2Eya1lzU25Za0MzLXd1ZEF3a0FUM3pSWmppWVNmcnhrWllYVGcxclZUQmFDb3pjaUplcmRr",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Mick.. if you have any problem i can help  with just email me...",
            "date": "July 11, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Howard Staples",
        "comment": "Despite saying it is compatible with the 360 1st Gen it clearly is not as it takes so long to load and animate when either moving your wrist or pressing the button that the watches screen has timed out. This renders it completely useless. This does not happen with any other watch face that I own (some 45 or more). Please optimise this or at least remove the 360 1st Gen from the compatibility list.",
        "date": "September 19, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSDEtaTBOM1QxRGk5OGxWOVcyMi1vdnJkT3FsZkloMENPVmdjeXhicHhPSXVCc2dvTFFZMFFRREFTT0tod0ViZ0o1c3M3T2tiVjZHcVlucllZ",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Howard, if you want to email me i will help you get it all silky smooth. I think you simply need to tweak your ambient mode settings. Anyhow, let me know. Thanks for taking the time to comment.",
            "date": "September 22, 2016"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Martin Ramirez",
        "comment": "Love this watch face on my moto 360(1st gen)... Only drawback is that it takes about half a second for the face to go from black and white to the theme you have chosen for it when the screen wakes up..... Would love to see a fix for this in the near future and this app would be perfect!!!!",
        "date": "May 6, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR1RmNDZhMThoM2JaUFBjRjhoWEZ2Tktmb0FfMXp6eG45RUlNN3Z1ZTB4MDBPNFA3VXFCNDJ6QnRTVF9FeXNLa0JwOXVGUi0xd2dQS2FNT0hr",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Martin, yeah i'll work on adjusting that, does this happen to you if you select the \"full color ambient\" mode instead of the \"Energy saver ambient\" mode? You can email me if you wanna talk about it, i'm here for ya.",
            "date": "May 9, 2016"
        },
        "star": 4,
        "title": "Awsome watch face"
    },
    {
        "author": "Chris Porta",
        "comment": "I really like this watch face.  It looks great, is highly customizable, and functions well on my Moto 360 2nd gen.  The only thing it's missing that would make it perfect is a step counter.  Please add one!  Maybe replace the digital battery readout and add a step counter there?  Or at least let it be an option?  The analog battery indicators are great, so the digital one is redundant in my opinion.",
        "date": "May 5, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSDFVN2swRHNmQS04c19TcndpRVYwUXJWTFZNWGo3eFpVelkzZFBmOV9zQWlaTUxESldTNXhIZlExR1dONHV3QzduZXpsejBlZHRyLTZyWEU4",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Chris, yeah.. i figured out the code.. its just a matter of implementing it on this watch, thanks for the support while i work on it, its much appreciated.",
            "date": "May 9, 2016"
        },
        "star": 5,
        "title": "Nearly perfect"
    },
    {
        "author": "elizabeth cantu",
        "comment": "I loved this watch face used it exclusively for a long time . Now does not work on my phone/watch after updates note 5/LG urbane . It's installed but doesn't show up as an available watch face on Android wear or anything. Clean install and pair on both. Still won't work.  Very sad",
        "date": "August 8, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRTM2VFlnV1o1UGxxYWdnZjhubnpOaWxzZUNMbHJ3OUZWRkx3aktSOFAxRV8zbUJHLXlYXzBDb3Jfdlg0T0xNRkItVVJlZ0ktajJHcTFPNk1B",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Elizabeth, Regarding Android wear 2.0 and my watchfaces ...install them on your phone, and then check the \"apps on your phone\" section of the Play Store on your watch. Email me if you need more help.",
            "date": "August 10, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Daniel Barton",
        "comment": "Running on a ZenWatch 2.  Constantly getting \"Wows\" when ppl see this on my smartwatch.  I'll load another face for a few mins then Nah not as good.  Can't remember if there was a price on this but if there was I bought it and its the best purchase I've made for the Zen to date.",
        "date": "June 11, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSGk3U2FtQmpsejlQMFl2Y0ZON3JKX2ZKZnB2dGM3cWJMT3FOLW5rNVFvcmNXbkYxbG1wZERNWEJYUnpEUWtQQnhvanhVampqYXduNlQzU3ZJ",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Daniel, well you just made my day much brighter, thx a lot for the awesome comment!!!",
            "date": "June 17, 2016"
        },
        "star": 5,
        "title": "Best Yet"
    },
    {
        "author": "Tyler Knox",
        "comment": "It looks cool so I purchased the face. But I can't find it on my watch or my phone. I'm using a Motorola droid turbo and a moto 360 (1st gen) doesn't give me an option to uninstall but only for a refund",
        "date": "November 3, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR2phOEFGa2ZuQlRDNEhyVllqU21FQW9lcERIME9NUVktLWJ1N08wZWlBUkQyVzBMRXUtVjdDdHgzWHRKQ1AtaXRfNS1zR1Y5Z2V0VENFNERB",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Tyler, just send me a email ill help you out... the watch face and its respective settings can be accessed tru Android Wear App.. . Thanks for the comment and support.",
            "date": "November 13, 2016"
        },
        "star": 4,
        "title": "I need help installing it"
    },
    {
        "author": "Gintoki Revan",
        "comment": "absolutely love it. a word of caution for zenwatch 2, and probably other watches. if you are using the companion app, (in my case zenwatch manager) it can cause problems with the watch face.  i had a problem where it would not sync settings from the android wear app to the watch. manually changing settings on the watch would not take affect as well.  the dev's are really nice. and they replied my support emails really fast. definately a 5 star app and a 10 star developer",
        "date": "March 2, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSERMaDNqM3poY3U1Qjl5NW1BVGV3S2dlTTJpZjNlU1YwYWhPVktnNk5pbnE4aGJYQnpyS000WmxaN0xGYk1HVGZpY2dUWEhYNjhIOUhtZlJJ",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Gintoki, Thanks a lot for you patience and cooperation, customer like you are very nice to work with.. polite and respectful. :D",
            "date": "March 3, 2016"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Alex Lopinski",
        "comment": "Love the face, however it seems to take a second to \"kick in\" shows a grey outline and then flashes to the customized face I created. If there is a fix, it would be perfect",
        "date": "July 4, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR0FfWlg2QnlkZ3pIMEtDb1VhcmxnOHVpWnhoQmY0TmZPYU5faTBvMVZXMEowaTFDekNNdDVITVoxN1owSEhnRkI3WHBmc19wVUpvQWFGbGpR",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Alex... can you email me about it, i'd like to see if we can fix you up... Thanks for the feedback, its very appreciated!",
            "date": "July 7, 2016"
        },
        "star": 4,
        "title": "Zenwatch 2 lag time upon start up"
    },
    {
        "author": "Brittany E",
        "comment": "Really love this app, totally worth the $2! Only thing is, would like to be able to make the date larger. It's a little hard to see the numbers on that. Otherwise, super happy with it! All the other customization is great.",
        "date": "October 20, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR1lvYW95Tk5QVGktYTdscHMwd3k0VTlNemRsdlVteDFrd0dZX0dnLXF6d1hiemVVaGJwZnBzRERidU93NG5NblZTU2VpUWQ4SWFTM3R5Q0dF",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Brittany, im currently working on a new version of this watch.. stay tuned while i make the magic :) Thx for the comment!",
            "date": "October 29, 2016"
        },
        "star": 5,
        "title": "Awesome app!"
    },
    {
        "author": "Evan Chu",
        "comment": "Beautiful watch face. After updating my Huawei watch to AW 2.0, the watch face began to lag when it would transition to ambient mode. I uninstalled it and cleared the cache and it was still lagging. I figured out the lag occurred when I toggled the card peeking and etc. Once I disabled the options, the lag transition to ambient wasn't as bad. Since the update to AW 2 the notification system is different. Please look into the lag otherwise I would rate it 4 stars. Thank you.",
        "date": "May 8, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRy0tdllSV3ByN1V4OWlHRktwYWRqWXc4LU1sZFg1ZTNKUXUyTXBVcEN5VXRTeDRWZjc1MDFlUFVvLVU3UXgxa1hXbUEtQThrbVQxc3NlZm9N",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Evan, ill check if i can duplicate your trouble and address it.. so far i was not able to have this behavior happen...  so this might take some time... thanks for the support tho!",
            "date": "May 14, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Joel Pérez",
        "comment": "Design wise is just... exquisite!! The colours, the lines.. just awesome, but I have 2 problems on my ticwatch E with AW 2.0.. weather indicator stays at 0°c, it doesn't update and the phone battery indicator also stays stuck at around 50%.. would rate 5* if developer address this..",
        "date": "February 7, 2018",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRTl1ekY0R2hkenR5bFRabURHQm04T1E0LWNxRWYyNm82cktidk5XNmNjTjhkQW1sbFVPTHhfaGxhdENtOUNja2J0ZVJJY05wNml2THBSOERr",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Joel.. Try to re-install it... and make sure the screen timeout is longer (that will give more time to the battery to update)",
            "date": "February 9, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Joseph Patacsil",
        "comment": "The watch face looks great, after troubleshooting with the developer and reinstalling the watch face app I was able to get the battery indicator working again, some settings still have some issues like the weather (location not accurate) and the auto day/night. Other than that the watch face looks great!",
        "date": "March 4, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRy1FNHRIaFB2bzE2R1NjeXhMUk1FSEd4al9hdktTWEItSmQycTlSMTItSzBndTI5OExoZkx5WVpVdFctd1pHb0Nxa1hrbVIwdko4ZUY3T1VR",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Joseph,  Thanks for the feedback.",
            "date": "March 4, 2016"
        },
        "star": 3,
        "title": "So far so good"
    },
    {
        "author": "Red Wolf Music",
        "comment": "This is the best looking watch face i have seen! That being said though, i have a couple of gripes with it. If hands are shut off, their shadows still show. Also, if you reset the phone or watch you have to redownload to get the weather and phone battery % to work again. And the face has no interactivity or function when pressed besides changing the battery display from watch to phone %. For the price i expected to at least be able to access extended weather menu by pressing the watch face.",
        "date": "January 12, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSGRvTVp2VFdZd2F3NjUwTmNPMVl0SVZKdzVkNHd5blVMMDY2eVVGVzhBQk5Deks0b29aWGNfa2NlMU8xeTFWZ0FDb1lMdWFlWnp4TnJQdzA0",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Red Wolf, can you try NAVI2 it has more features...  thanks.",
            "date": "February 22, 2017"
        },
        "star": 3,
        "title": "Awsome face but missing features."
    },
    {
        "author": "Gary Shook",
        "comment": "Edit: there's room right below the date and battery percentage.. Can we put a custom option there like steps walked/calories burned option there?  After trying this back in January and having an epic fail (Asus problem?), I decided to give it another shot today and I am happy to say that it is working correctly now on my watch. Kudos to who ever fixed the issue. Whether it was Asus fixing their app or PHLASH! It's the prettiest face in town. ;)",
        "date": "March 14, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRktzRjlYNjlPRE9RY1Vtc3lUcklNZDdUdFZCNVVTNmx6ang4dnpFZHVXaFh1U3lzQVg2dzA2ZjFCeHBoZ2N5UVNZYXdpYXZ4bFZVOUhaN25F",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Gary... Thx for the feedback's !",
            "date": "March 15, 2016"
        },
        "star": 5,
        "title": "ZenWatch 2"
    },
    {
        "author": "Jason Cartwright",
        "comment": "Really like this face but it is let down by a couple of issues, the most annoying is that the battery gauges keep swapping. For example the right hand gauge and digital representation is set to display the watches battery level but for some reason it keeps switching to display the phones battery level. I have checked the settings and all is correct there, it just seems to have a mind of its own. Secondly, there is a noticeable lag from when the screen activates to when the 'full' watch face is displayed.",
        "date": "December 29, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR0dDbjU1VW1IZlplbDZ0b0Y4QzVMZWhHMHMzUE9RYU9JQWoyWmZsZGN6QzdkMnRRUlllYnpvTzlnZXFWMERhTTAzdTdNcDFFVnFScDYwTUFF",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Jason ... seems like you just need to reinstall it, and change the ambient mode... You can email me if you want and ill do my best to help.",
            "date": "December 29, 2016"
        },
        "star": 3,
        "title": "Great effort but still some problems."
    },
    {
        "author": "Ryan Park",
        "comment": "I've made about 5 different color schemes and the watch face keeps resetting to premade colors. It is really irritating.",
        "date": "January 9, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRUlBdUs0MlhGSDBqRmFocGZILW1Eam9TU0NldklMTVdkdmlpVEltZDEwOVFQMk90M2toLU1Qb1FyZEhMZG1DVEJXeTBqcFVrQ2djOWl1RE9N",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Ryan ... seems like you just need to reinstall it, You can email me if you want and ill do my best to help.",
            "date": "January 21, 2017"
        },
        "star": 3,
        "title": "Colors"
    },
    {
        "author": "Jim Sipple",
        "comment": "Absolutely love the watch face! However, like another user said, I'm having minor problems syncing the settings & it seems to slow my watch down considerably. The slowdown is more of a concern for me as it effects all functions. 5 stars if developer can optimize. Running on ZenWatch 2.",
        "date": "March 25, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRk9yOG14NGw3TGY2RWo4WGQybnA3c0tpMlBld3dqTkI1bC1ZcVZsSXM3bm43d2x3ODAwZFFGWk9pS2hMUkNVYUstV0lhWFZrVnFuaENhWlAw",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Jim, can you shoot me a little email if you have time? We could go through a few things to make sure you're running smooth. Thanks for the feedback, much appreciated.",
            "date": "March 26, 2016"
        },
        "star": 4,
        "title": "Great, but..."
    },
    {
        "author": "Jeff W",
        "comment": "This face seems to lack features for the price.  Hopefully they update it soon,  if not I would consider other apps at a lower or similar price, it is just too expensive compared to the many other free faces that do more.",
        "date": "June 2, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSG9jeUtiUVRubDQxU2VjZWpLZWlOUkRFYkdLUVdqREI5cnZuM1k4QmpDZ1FNVndXaVRJM2xjb3ZuT3ltYld4cWdlN1ZyaXRTZ2ZFb21kck9V",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Jeff, yep i'll keep working at it and make sure it tic-toc's like a perfect clock :)  Thanks for the comment!",
            "date": "June 9, 2016"
        },
        "star": 3,
        "title": "Nice,  but could be better"
    },
    {
        "author": "Thomas Ansley",
        "comment": "You can customize everything to any color! But please please please add a feature to save customize color builds. I'm afraid to change to any other colors because I don't want to lose the face that I have created.",
        "date": "June 28, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRzBfSW9XUXdQQTI2MVpmd280eG9wc2VTZGEwOFotYm1CU0tVRGg3b0VnZV9LSnczdjRiM2FLS21XU1JzUHRoeS11aDNqc2Zld3ZjaWtZdk1j",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Thomas, i'll keep working at it, you could try to re-install it as well.. just in case. Thanks for the feedback.",
            "date": "May 29, 2016"
        },
        "star": 5,
        "title": "Amazing! Needs 1 thing."
    },
    {
        "author": "Harsh Patil",
        "comment": "Edit: I am using this on the huawei watch and it stutters alot in daily use. Ok the graphic glitch was not really a glitch, thanks for clearing that out. If there's anything to improve the stutters I will give it 5 stars again.",
        "date": "December 13, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRnhQQjFPaUJXV1p6SzhfbGxhY19PVk1LV01URHd4dmNwX01CWng0cUg5cVdMZlpuZUJlQm5vaVRGQ3UzMldiZHluT011bS1NTE9oRWtHTWtZ",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Harsh, its not a glitch, its a option in the settings called \"Transition when cards\" if you wanna email me i can help you set it up. Thanks for the comment.",
            "date": "August 14, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Hilton Tiam-Lee",
        "comment": "Love the colors and settings! Small niggle though, maybe you can remove the skinny white lines on top in battery saver mode, they sort of look out of place.",
        "date": "June 28, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSEVZUzNZNHg0NGwybHdISmFYMVd5SlFZTGpoeU5nMFZWVEh6Q0ptSmVCMldTMFRfOUNoeEZWMkNIZlRpYkI5anBLRS1UczU0cmJyX0trV1A0",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Hilton, ill look it over and meanwhile if you want (maybe) you can deactivate them and that in turn wont make them appear in saving mode.. Thanks for the suggestions and feedback's its much appreciated!",
            "date": "July 3, 2016"
        },
        "star": 5,
        "title": "Excellent watchface!"
    },
    {
        "author": "Matt Thurlby",
        "comment": "Downloaded this watch face for my Sony Smartwatch 3. Is an excellent addition to my watch face library. Problem is it make all of them seem very bland!!! I can't stop tweaking the watch face!! I can't fault it....  😁😁😁",
        "date": "June 22, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRWhJNEo4QVBnZW1KamdBUzB2aFhXUHo5V29WQlF5OWU0eVJGMG5lOUkySm9qbTFnZmd5NllNQkY1U1pSSEQxaFRsOXFjOFhLbVo4MEpMWDA4",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Matt..  :)   ....  You're awesome, THANKS!",
            "date": "June 25, 2016"
        },
        "star": 5,
        "title": "Possibly too good!!"
    },
    {
        "author": "Stacey Conley",
        "comment": "This is the first and only face I've used. It's gorgeous and the developer is active and makes updates. It has so many great features. Pick it up, you won't be sorry!",
        "date": "March 1, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSDR5SENHOUJoc29iNmNoUklpbUFpSWQ4TkRNVjZLVE1YQnRmd2xXcllFVmNzd3dBd1JIZ2NVUjVCMkcwdkh5TlNWeHM3UTdiTWlRREp0Um84",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Stacey, thanks a bunch, you know with great feedback's like this... it goes a long way to keep me motivated. Very appreciated.",
            "date": "March 2, 2016"
        },
        "star": 5,
        "title": "I Haven't Changed it Yet"
    },
    {
        "author": "Caroline Hann",
        "comment": "I love how this looks, and how easy it is to customise. There are so many options you can really change it to suit what you want. It looks extremely cool and futuristic. Also, the developer is great and works really hard to resolve issues and respond to users.",
        "date": "January 6, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSDlRZUpvTlBzQnNuZjVXaXdMSTJIa2ktd3VIMG9FVG5QbURvZFhTOXk3OHA3c25CWnJLczBOTUxzakZuLWhzLTRHNFhKRjhaVmZPUWRmRVYw",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Caroline, great to know you're set and a big thank you for the feedback!",
            "date": "January 6, 2017"
        },
        "star": 5,
        "title": "Fantastic looking watch face"
    },
    {
        "author": "Adam Gordon",
        "comment": "Really like this watchface, seems to drain the battery faster than some others on my Moto360 2 which is why it's not my daily driver. Not sure if that's an optimization issue or a watch issue.",
        "date": "January 24, 2017",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRmNkUzM5aTEtbmxMRncxSlQyRm5YU0lfSnpuUFRuXzl4UXBQM3RJMm95WnNQV01SLUU2MmJPVzFRbWZrNHhBNFkxbl9ORlUwRUI2blFEc2d3",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Adam, the watchface is optimized and should be the opposite of laggy, as in faster than most. Maybe you need to reinstall it? Thx for the feedback's.",
            "date": "February 1, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "TheInfinitum7",
        "comment": "Bought and installed today but already had to change to a different face because it will not come out of day mode and it crashed.  Installed on Huawei.",
        "date": "July 9, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR25BcldZNkNPNjB6cm5IaVF0SE4zM0Q5cVBfVTJCMDI5Nk5uc1dISHNEUlJFdmYwVHJDaUpPaWN5dWJPZXhjaXBjbUlpVTBnVTFTZXJfLUYw",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up TheInfinitum7.... if you want to send me a email i will help you out, no prob. Thanks for taking the time to speak out and leave a comment!",
            "date": "July 17, 2016"
        },
        "star": 2,
        "title": "Good looking, but. .."
    },
    {
        "author": "Matthew Schmitt",
        "comment": "I purchased nearly every cool looking watch face for my moto 360v2, and this is by far the best looking! By far! Of course, I have the faces I need for specific things, but this is my go-to!",
        "date": "July 15, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRl9SRWlDSG5vTkhzT3VqUnZoaXgtWmZmclVMUEk2U0xScGJDaVh5ZEtnd0VwakJjRi1UQUdWS1F0bEJGMl9XaHMyQ241RlhZQmJyNW9jMFc0",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Matthew, that is very sweet to hear. Thanks a lot for the positive energy, you rock!",
            "date": "July 17, 2016"
        },
        "star": 5,
        "title": "Sic!"
    },
    {
        "author": "barrington chung",
        "comment": "The weather is not displayed on the watch nor does it allow me to choose location & this started a week after I bought it, the longer I have it the less that works, I'm very unhappy, I'd like my money back please, it's a shame when I first got it it was because I  liked the look of it and everything worked, now I'm unhappy with this watch face, they won't give me a refund now I'm stuck with it. DON'T BUY THIS WATCH FACE YOU WILL BE UNHAPPY! !!!!!",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR19kZF8zM29yWWZYQWJUOVNkSUdVZmFrUTBqVG41bVlodWgxVUFhaHZFdndNUllTWVNvc2ZFRFVhdG5jLVhrTkVodUNVNXM0RDlJcHhkQ21v",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Barrington, something in your settings must prevent it from working.",
            "date": "February 9, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Ken J",
        "comment": "Love the face and customization.   Only problem,  its 10 degrees Celsius here,  and face says minus 17.  Picked up location correctly,  but 27 degrees C colder it says,  than it is.",
        "date": "March 14, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRkdodU9MN3ZyMzZ0SG5iVlNTY0ZYOC1zcHM4OVMzdlY2SGlHY3prb3BGZWVyT1JPNVpWaUczS2hLUVRiNFpWYWJJUEI5MnlYaEtfM1VYWnlj",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Ken, try to shoot me a email and we'll see if we can have it start. Thx for the feedback!",
            "date": "March 15, 2016"
        },
        "star": 4,
        "title": "Awesome,  but weather wayyyy off."
    },
    {
        "author": "Daniel Darby",
        "comment": "I'll bet this bad boy is going to attract more hot chicks than the Atlas watch face did. I better be careful with this thing.",
        "date": "May 27, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPSEMxUG5KNm5TTjRqdEwtdHN1bUdCOERfZnFHbnp1V0JoTEN3WkxDTGhuZWVUNXUzV09WaGdpOTJOd3hOblRLSzBjZ2hUMzJKeEFrRG5WN3JB",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Daniel, sorry for the late comment i was trying to write it but was trapped by a swarm of perfect ladies in love with my watch. Now that i have the chance tho, let me warn you... Close your doors and windows when you wear NAVI!!!!",
            "date": "May 29, 2016"
        },
        "star": 5,
        "title": "Fantastical mind blowing watch face"
    },
    {
        "author": "wayne mclean",
        "comment": "I missed my android soooooo much..  Its things like this which makes is worth so much.  This looks so cool on my moto..  Thanks you guy's.",
        "date": "May 1, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPRkotVHo3ZGpJNGJxUlZydVRXdWc1akU3TUFXdmdUM21Fa0hONU5XcnlHSmFmMzh1WHpseFZobk0yMGpqdGNpcm1yWFdnN25FRkM1eEp6RWc4",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Wayne, I really appreciate the props, Thanks a million!",
            "date": "May 2, 2016"
        },
        "star": 5,
        "title": "This is awesome"
    },
    {
        "author": "That's Lyte",
        "comment": "Good look but I can't use it. I don't get certain notifications now and the watch face doesn't stay consistent in what it shows me.",
        "date": "March 4, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR00wUU8xSGpkTDNfVDhocTQtTG55U0Yzcm9ZdTh3SFhsYktzZDVKRUtXY3E3R2Zrc2dJd3JWaTZSY09oOGMwZzNkcUxhamdaNUhvNFlaMXgw",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Isaiah... must be your Android Wear app... a few ppl have problems because they updated their watch and need a reset after. Just email me ill help you out... Peace.",
            "date": "March 4, 2016"
        },
        "star": 2,
        "title": "Way Too Many Bugs"
    },
    {
        "author": "Eduardo Trujillo",
        "comment": "Looks nice but makes my Huawei watch laggy. An option to disable ambient would be nice, even if I disable it through the watch it still transitions through it when waking up.",
        "date": "August 28, 2016",
        "permlink": "/store/apps/details?id=com.thaphlash.watch.navi&reviewId=Z3A6QU9xcFRPR1poSnRycUNpOFM4Snk1endnX0hIbHgzLTJSRkk4clpVN1RyUU1yR1FTV1g3WEg2RW1YQXF5SUxUQURIYTNXc0szOW9MajQ1UzZNZFhxVlRr",
        "reply": {
            "author": "Tha PHLASH",
            "content": "Word up Eduardo, the watchface is optimized and should do the opposite of laggy, as in faster than most. Maybe you need to reinstall it? For the ambient mode simply go in the watch face settings, and select \"Color\" instead of \"energy saver\". Thanks for the feedback, you can email me if you want a s well.",
            "date": "August 29, 2016"
        },
        "star": 3,
        "title": "It's ok."
    }
]