[
    {
        "author": "Iahel Cathartes Aura",
        "comment": "Has been great for several years. But recently has refused to update, even if I open app & refresh manually. Seems maybe an issue with weather providers for me area? Will uninstall for now but will try it again later. I have greatly loved this app, esp its ability to be set to hone in on tiny local climate areas! No other app is like this. Would be very happy to pay for special features if needed to make this work again as before in my obscure geographical area.",
        "date": "November 19, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRUFUQzZVMlcxSGw1WnB6dVlkNE5pcXAyVXZ4Nk9uUGVwcXZEQVM3cUc3d3FJUlRJZ25WSE9BcTVGNUdCU3gzX3BJRlkxQnllWFlRT2VCeEJR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Bill Verant",
        "comment": "This app's two weather prediction data sources are consistently 3-6 degrees F higher than actual temps as well as other sites like Weather Channel.  Weather prediction that isn't close to reality is useless.  Odd because this phenomenon with the two included providers started happening about 6 weeks ago.  Perhaps it is time to look for a replacement weather app that uses good data sources.",
        "date": "August 29, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRXowWDlwY3pla3l1NjlXM2xCWldkTEVNNG9CazVTeHpXUjRlemVvXzJXeDQ5YUhsMm1QOVVhUDhza2E4dy03THExc19xY2hNRHVvX244Q1pZ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Thomas Ostrander",
        "comment": "I love the customizability of the widgets, which are not only informative about the weather, but actually function as better clock widgets that the ones for my clock app. My only (tiny) quibble is that there doesn't seem to be a way to display rain probability as a percentage instead of an estimated depth (i.e. in, or mm). All in all I'd say it's a great app.",
        "date": "October 29, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRkU2TUhWYkdoVkowSzQ0Y1Y2UlM0UFQ5cHZYSzFtMWhESTJ0S1NTQmdlVnpXSGVLYVlEVVlmNzRSYWNZWjBlSndOSWZxVU54WmlJcnFabWJR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Lulu Dooblydoo",
        "comment": "Quite customizable and not overly informative widget. My gripe lays in non symmetrical hi/lo placement (should be centered to weather icon). Also, could use distinct color options per time, date, forecasts. Developer should group similar settings (eg. Units: imperial vs. metric, then the specifics to each class). As is but a roster with addendums.",
        "date": "August 23, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRmI3ZVdHWTktWjBfRmlZdXRTVjJYU2xCTnJnQTdwaGl3YWJNbFhJWElpa3dtWG5rZDR5X0VGMTM0eUhsWm50SHZyY2tYNFJ6b2JQNmF3YmlR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Mike Morley",
        "comment": "Nice and simple but could do with a widget with 24 hour clock on it. Also not compatible with my tablet. On watch the app doesn't display properly. Rating due to the compatibility problems which weren't previously there and developer doesn't respond to emails",
        "date": "November 13, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRmc2Yko4REIzRWlNZi03RTlpdUZJVTBwelBHTTRudlZQRndmTU9fMjlkN05JbkxYRUtlZk01M2NEXzVmc21Bb2NnQ3lIZ3Q5Tld5elZQeUk0",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Maciej Minszczak",
        "comment": "It's amazing application. It does what it supposed to. I use it for just what it is, weather and time. I do not know what else this application does, but it's worth it and it has remove the ads option which all the applications should have. I hate ads, because spyware and viruses can wreck your phones. BUY IT! 5-Stars!",
        "date": "December 7, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRlExSWgzTkN3T2lDQkVZWWNYRk5WQ1dkUXJ6di1HRkNNWjNmT01CWjBsR1lSd0Q1VTY4bXVINHVWb1lEczRlLUlCTXlxQ0RpbzlmOWpSUGlz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Shawn Rodgers",
        "comment": "Installed on all 4 of our Android phones, 3+ years running. Mom & Dad use the paid AccuWeather app for digging into detailed daily forecasts, especially for destination planning. But nothing beats this app for a \"Weather & Clock\" homepage widget. Ideal layout and appearance customizations couldn't be better. Especially appreciated is the calendar and clock sections of the widget can be configured to launch whatever calendar and clock apps you want. Can't even think of a small complaint (maybe more fonts?). Works beautifully with Nova Launcher too. Highly recommended.",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPSE1tQTZvQXBwZ1FXcXl4OHdmMlZXRVYydENHeFAwaWozTHJfUWdXRzR6Vl9BV0MyeFJnWHVyMEtFZUdhOGJ1TUM1RUVOc0xKcDdiREl3TlRR",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Joan Tilston",
        "comment": "What the hell is wrong with some of these weather apps? My location is almost my exact address but the location on the widget is shown as London. London is a big city. I've known it be raining in one part and not in another.",
        "date": "August 30, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRS1GVUFXeUpEellGWFdEdHNrZzlvSDFQZHdqZUNCdWpRUGc3N25tOC1nSHpWQmUtZVRZek5yd1pQQi1Vem1HdlBrU1IzX09oSWNuY3JRcldJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Joanne Dubnicka",
        "comment": "Love the clock and extended daily weather reports. I had given this app a 5 however something has changed.  The temperature shown is no longer the current temperature, it usually from a past day.  To get the current temp I have to either go to another weather website or dig deeper into the app.  Disappointing as I believe I paid for this app.",
        "date": "October 17, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR0J0Z0I0aE5zNTBDR1ZRcmVtTmlzS3hJaFBOVU1SWmowcXhMMmRkUlhQalN2S1Bxa0NiaHY0cE9hUzNFOXFoMHNUSGR0aW5PS1NqMHN0LWxB",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Charles Meixner",
        "comment": "😎 The accuracy of your weather reporting has increased quite a bit.  The graphics are better then average. For the time being 🇨🇭🇨🇭🇨🇭 stars are a fair deal. To be honest there is NO Wx program which deserves 5 stars,  unless you download Aviation METAR. I'm a retired professional  pilot for 40 yrs. You can't control the Wx. to your liking unless you have the key to HARP. Have a good day, Gulfstream",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRUctS2dTQ0dDa0NSUVJQYTZhMkVyYmlaMEJqNnc4c1hMNXhhWThnZUF3WGhBemRFY1ZTS3ZQZ3VQdHlkRU9YaXhWLUd6bnJoT20waHhqREhJ",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Stoic Robot",
        "comment": "Used this app for years, sure it's had it problems but nothing else comes close to this app. Has extra features an all but the widget and the forecast is pretty much accurate most of the time. Keep up the good work.",
        "date": "August 30, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPSE53dkdiTm1VekZ0QzRfSGpoZV9pdllqV0M0a2lmWnpyWmFYd3JxRm1GTl8wU0ZaclA4aVh3UEhFVUJjd1NKU2FtVDVZS1UzMmxTRzEyczNJ",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Amanpreet Saini",
        "comment": "As others have said, temperature reading from 2 providers are different from each other and different from google. Its useless App if it cannot add more providersand provide consistent reading.",
        "date": "January 29, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRi1IZDZlTXJZX3RoMDJMU1VrQlR1Tk54Q2t1bndQejZPRldsVktnZ251SDJSQTQ5M29EcjJlTDhlSUZUbVdkaVpOX01UczVVeG1Wc2hocm1B",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Andy Townsend",
        "comment": "This is my favourite Weather Widget. However a couple of things need fixing: 1. Ad Free and Paid versions use same icon. Google Play listing shows a '+' sign on the paid version. This does NOT display when you install on handset. So, confusion as to whether you are using Paid or Free versions. 2. Ticking box to display temperature in status bar DOES NOT WORK.  Developer - please fix. Will uprate to 5 Stars if above fixed.",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRjVuTGJWdHl1Q0tuU3pGS1gzLVJNUG9hOWk2bGcwZ2huM2J1czBkQ0s0aDFZdGtmMjNzQkVDZ2h1cEtMWTBRd1dqS1NxQTlja2tzR190clNn",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Chuck Fonte",
        "comment": "I contacted run previously on this app suggestion but have had no response..  I'm friends with a lot of people who use celsius although I still use Fahrenheit...  My suggestion was to have both Fahrenheit and Celsius display without my having to click open the app Quick Settings find the fahrenheit and change it to Celsius... Phew.  You could have this option: Low   f/c High f/c",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR1hQR0tPaUMtSUtGYWV2bUdIUk12dURnMExHRGlhUVV2c2k3SzVkV21yVlFqOF82b3NqUmNMZlA2SzNPYzVZZWxqUFNFaEtBcDRPRFBoUWRF",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Alfred Allen",
        "comment": "It's raining now, but says it's cloudy. If I am in Philadelphia Center City and it's raining Weather 2 said it's cloudy but Foreca says it's raining. If I am in East Oak Lane, Philadelphia and it's raining, Foreca says it's cloudy and Weather 2 says it's raining. They even gave different temperatures most of the time. Please use a better weather provider. I must say this is the most beautiful widget I have ever seen, I can also use my own photos to customize it, also you can change the home screen widget to any color of the rainbow.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRV85X0dSSV9TTUQ0T1p6Y0xnRXFmMjJ3MmpuSWJ5UzRoekJUZ25SY25pb3hDRXhTeDBQWlZydU9ael9IeVhJR1JCTGdqQnVFSHl1ZDJHcFdB",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "I use it on my home screen. I have the time access to clock and all clock features, also detailed weather.  Even a basic view of the week. I think there are alerts on the app as well. I dont really have a use for them so i rave a lot of the extras turned off. Set right, its low battery drain.",
        "date": "January 5, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR3pLWWtGWXY1bjBycEFGVTRWU0hESUkzeW9fb2VQUXgzb3hZRFl4YXNfS3ZvYlExelVvMmpzaTRGZ3duSmVOc3FReG9vUGNCSmxyZ0RBYjVn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Zev Mason",
        "comment": "I tried most other wx apps. Bought some.  ALWAYS come back to this one. Just wished they had better providers, but really can't complain. Would be nice if it had radar",
        "date": "August 26, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPSDJmbHRtWWZYZEdhSFJQN0d3SFVYUXFObENEM0M3ZjVmRGxjN01GbThLdjVteDhrVERBZUpEZ3NlTGM2ZWxmLXZ1NlJGaThXZUFMNmxLbWJV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tara Pickett",
        "comment": "It does't update. I have to update it myself  all the time to get correct temp. I'm always changing it from foreca to myweather2 which is ridiculous. Didn't use to have to do it.",
        "date": "February 4, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRlJHRE1TY2tyOXI0UWNJRnVHN25uOTMxOUhuWDJudy1hczVRYTlPNXo4VjVKS0Q3cl9CLXdJcjdVVm1DdURfaUVWTmNhY0dQYk9VTHowczhJ",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Brian Hancock",
        "comment": "I love this app except for one small problem. It occasionally does automatically update, including the current time, unless you tap the manual refresh. Other than this it is a great widget, but I can't rely on it for a quick check of the time.",
        "date": "November 20, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR3JPZTU0WWhzMnZDS05pN2xob3FUdFBWTlE1d3hzUDZRU0p0dE5zOExmMllrSC1vZFVsMFI0TkdDekdVUk1pQTlJTHNmM000X2ZVbURCLU9R",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Trenton Denbo",
        "comment": "Would be perfect and everything I need for a multi-timezone clock and weather widget, except for one minor glitch. When using 24-hour time, it still says p.m. for the evenings except, it's morning. So, for example, right now it is 8:45 in the morning but, it says 08:45 pm. Firstly, in 24 hour time, it should not have a.m. or p.m. Second, it shows p.m. for the mornings. Like I said, a minor glitch that I'm sure can be fixed in a future update. Other than that, it's excellent. So much so, that I paid for the full version after installing and trying out and many others before this one. If you fix this minor glitch, I'll be sure to go back and give the full five stars and revise this review.  Update: Now, it shows PM all the time. I just noticed! Just like in your first picture of examples!",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRmktcVc4UG0wdFYxbFhjZkhZSGFaTlhPc0lPeTZYTFpDRklTRkUxaGYxZ3p5VTMxVDk2V1B0eEJOYWdCVXZmZzh0dTc3WGJSWWgwcXowcDRr",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Geraldine Koomen",
        "comment": "What on Earth is the use of a weather widget that won't update? I don't want to know the conditions 8 hours ago I want to know them now. If you can't fix this thing stop being dishonest and don't sell it. I see other reviews on here letting you know about this problem. Why haven't you fixed it yet?",
        "date": "September 5, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRzE2N1RycWtsRlhmNFJYMnJNWk92X2xteEVQaUdWbUtQVUtRby1UVkhTT0RzRzB1MGR4OHFHcTdyQko4MHBYNlVIMXEyMGtCSnBiOWcwQXdn",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Ashton Tate",
        "comment": "I've used these widgets for 4 years and loved them. Since installing it on my new Samsung 8s+, it doesn't update unless I do it manually. Hate it.",
        "date": "February 24, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR2ZFMlNHUlhrSWlEeXZVaUx5N3REaU1xeTdqODIwTjZBcDFaOU8wQlpwLUlsazFnOTQ4X051ZUhGa2taZmJwT3k0bVJqYWI0YW9NRDJtaVpJ",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Rick Lewis",
        "comment": "I am rewriting this review. Initially, I gave this app a high rating and a favorable review. After purchasing the app and using it awhile, I have discovered that the stats on this app range from incorrect to erroneously. Nice looking widgets...terrible forecasts. Avoid is my advice.",
        "date": "December 14, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRkFtRVp6Z1lJbEpSWTV1NXVQUVh5NVo1NFNndjdjUnVPd0RMWlgxRzViUWRwMTVaVzJHNkNNUXZlOEl0NXZlQ0lIMy1VcUxlRFVwOUJWUXd3",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "ABC Expo Services",
        "comment": "It shows wrong city n widget. I am in Henderson NV put it keeps showing San Francisco. I have tried 3 times to remove and correct and still happens",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR3lkcmJCWWRCRm8tUTJVc2NQdlFoUjIzSmtZSkYzNjE3MVJjcHc2RHNnTTVscEM0dXVmazMxRVFKNmlGeDlRcFhzUnNwRm8zWkx6Ml9zN3Z3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Russell Moller",
        "comment": "The widget itself is perfect for what I wanted, but the forecasts were never really accurate. Temp was ok, but I lost track of how many times I got caught in the rain and how many times I carried around a large umbrella waiting for rain that never came - extremely annoying",
        "date": "October 22, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR1Q1WWxMNkxPZjRoUGVVZFJqbUVwNlFaUHNoU1lxaGtVWjUwZ0JleEIyYnFDWW9razlSYUVfVS1EWVFTUGRubkpSNXBaTGtxR01JUHpSTFJR",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Nancy Klocker",
        "comment": "I loved this app, but it does not update the forecast.  The only way it updates is to add my zip again and it says provider doesn't work and I select the other one.  But I don't want to do that all day.",
        "date": "August 14, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRWx4YnFSdjZxb2J5MTEycGx4NmxxejduMmpJaUJ5Rk05WWRvQTdUcTRKbEhHeDRvdE5jX1FwbDNESnoySGR2Y25Xa2xIUkdkelFEcGdMYXN3",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Graham Keating",
        "comment": "I love this app and how it looks. However, it only has 2 weather providers which are very inaccurate for Sweden. Two says ago it claimed the temp was -5 when it was +3. Please add more providers.",
        "date": "December 19, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRVU0U3o5NzVjRzA5ZEdWaFBQV3NKNWVyWFA5Z3RsMDhkaFljR1VPVHRLNGYzY0tKN01ReWZjVmE0ZTJWaTBuVVdyTU5MX0ZrSDNicEFuWTFv",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Diana Lynn Tritch",
        "comment": "UPDATE,  12.8.2017: SADLY,  I WILL PROBABLY REMOVE THIS APP.   IT HAS NOT UPDATED ON ITS OWN FOR NEARLY 2 YEARS.  ALWAYS IS 6 -8 DEGREES HIGHER THAN REAL VALUES NOW.  MONSTER SLOW EVEN WHEN MANUALLY UPDATED, IF IT WILL UPDATE AT ALL!  I HAVE THE PAID VERSION,  AND IT KEEPS TRYING TO BILL ME!  IT WAS SUCH A DELIGHT.  WORTHLESS TO ME NOW. SAD. WONDER WHAT HAPPENS DEVELOPERS QUIT CARING. OH WELL... HERE I GO AGAIN ...  I'VE USED THIS APP FOR SEVERAL YEARS. ONE OF THE VERY BEST EVER! I AM SO PROUD TO GIVE A REVIEW OF AN EXCEPTIONAL PRODUCT!ACES IN MY BOOK!",
        "date": "December 8, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR1BoWXprbG9xbzZpSVE4TFBEamRzSVg3YzZISG85dHBvbjJ3Z1p6NXdsU1hjdHFzOGlEbjh2MW5WS3piVWNwXy12RVZwT3hNNlFtMm9OeUE0",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Joe Carter",
        "comment": "This app is awesome! It tells me the barometric pressure, humidity, next alarm, and has customizable transparency. There are so many things on this that are useful. I have not noticed any bugs in the recent versions. Keep it up!",
        "date": "August 28, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRjlmQjJyUEg5NWZpc2xiaEhJb2ZnZHJzZFJZdnVINjFSZHlfdXEtOXF3cTNWMUZDenNuSFhkWUdTbWxqQUF5SlNneHFGcnVzam4xTlB4NEdV",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Thomas Guppy",
        "comment": "The weather options aren't very accurate for Australia. The best weather app I've seen for AUS is willy weather. Any chance of adding support for them?",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRnRULWdybmJpZDBmSXFGRlJHVTRxS0lRM1VSU1FVX2NNT1Fxb0x5MmFxYlhhRkc0a2RlODB4RndTZlhva3I0M3B0YTcyY3ZDTHJPNVIyWUg0",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "Now it is showing past days instead of forecast of days ahead. It doesn't update. I have to go into settings and change the weather provider for it to update. I am going to have to find another weather app.  Very sad it was so good.",
        "date": "February 8, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRnhNaldxWG1SVjhiNjN1eUpxZ05sb3RXbXVnVmVRWDN2VG5XcXItX3NpbWZyTjBxVkFmcl9FVXR2TE1YNUxBOGNyaDRXeVpoeHVvSEp3UUJv",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "It's beyond me why after few years you still can't add option for widget background to take full horizontal space available. The widget looks shrinked vs other widgets on my homescreen.  Otherwise good job.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR1ZZalpBOE0zM1JGckdBa3draERIbG9uZnVzYVVTZHVXLWd5ZTdiOXh4TGRBclZ5M2ZzOUtobjM3WGhjWDdSUER6bHRJeHpMWGpMRERVOGhF",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "",
        "comment": "For myself it's pretty much perfect. However, I seem to have a missing mist/fog icon on my favoured widget.  Still, 5 stars.",
        "date": "November 3, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRW5xOXF2SlNSVUFNTG1zdmZTa2t0N21tYzR3VjI3eU5DYTdvODdOSGMxUUpvWFI3MTJZUzBiTkVaMW5oRmM5cmFpOERyMUFDanhlTmM5T3E4",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Daniel Nikolić",
        "comment": "Very good app. The only problem: can't display two widgets for 2 different locations at the same time. But I recommend it nevertheless",
        "date": "February 9, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRVJncnJUVUNsZ0hLcWtyTlQ3WUhsNWR5Y3BPbGlQSUY5aEtMb3JLaFdmMFlEWTRfYkdEVy1SZV9vbEE1bmFINFhPMUpwaE9jdEtRWWdUZWFJ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "Was working fine since installed long time ago now will not update?! Useless as it is now.",
        "date": "December 7, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRXI0MGExVm81TEVDNVB6Z1RnSWJGallLeHotZHBVdjY1NEtGcnM3X1hQci00YmlMV2xVUk1JWWhlRk9YOWJjckVSdTQtbmJKTGlYMlNJeVpn",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Karl Mann",
        "comment": "This is the best weather app I have tried, and I tried about twenty.  Got the paid version because I hate ads.  Try it and customize it, you'll love it. ;)",
        "date": "October 2, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRzNHa1dRN3FsYVNYNlY2YURScHhpQ1AzMUlUaDFiLVhTYzFnRHpReGs5VFNSdGQzOTQyeElZbVVRc3J1cnc3ZFE0MU41YXFaNHpEemFCVmFn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Bakari Bryan",
        "comment": "This app has something like 25 beautiful widgets to choose from, and the ability to access your clock and calendar apps from the widget is a great idea - but recently, the app refuses to update, even if the refresh button is hit manually on my Samsung galaxy tab, running Nougat... Or it takes an hour after booting to do so, making the app next to useless. Please fix soon!",
        "date": "January 28, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRUdRUXFLT2N2NkFzMXMzSEZJVDQxX0VyUEhoZWI3TlhjUk5aRWZsaUZNWHY0cW5ZWDVPWU8wQTZfM0Y1alZZTFRHczRrb1hRVkNrRkJ5dlI4",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Don Barton",
        "comment": "Really like this app, very informative and easy to use. Suggestion, when looking at 5 day screen if I tap on one of the days, that it takes me to that days' hourly page.",
        "date": "February 21, 2018",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRlZFbnpldlhsZTBzZU55NzRtUkhQZXBnaXFfS0hHbGM1aVdyTzNNM0piVzhnSXRCTzBWclhRQ3pGVkJqLUFxclBKU25tT0R4MjZMaFpHTmJz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "kIT mERRILL",
        "comment": "Great - LOVE the 10 day forecast - LOVE the ≈43 notification events (I use showers/rain/storms - it's very dry here). One of your forecast suppliers is fine too often - the other shows accurate cloud cover and rain. I know that USA apps don't forecast well in Australia🇦🇺.",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPR0o3OTlqTDBPZUc0YVRvYmhocVJURE9IejRnck1YczB2NHlNNVlBdHg2dENRRVVOWmhWVWd1M2N5ZWI2NFpmT1MydlF3X0M4YkZfWmpEcmdn",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Hixson",
        "comment": "Incredibly inaccurate on current temp, although forecast daily temp range is pretty solid.  Also as a widget, clunky interface for multiple stored locations.",
        "date": "December 27, 2017",
        "permlink": "/store/apps/details?id=com.devexpert.weatheradfree&reviewId=Z3A6QU9xcFRPRnRBS2xfeDFpWGVWT2s1RDRvU2k1UFZWaHY5UUoyMlFRSzFXbWZsSzBwby1zQ2ZYRy11S215d1ZzQ1Bad2N2WnFCT2RNYkhWS09UV3hmRUF3",
        "reply": null,
        "star": 2,
        "title": null
    }
]