[
    {
        "author": "Julian Essex-Spurrier",
        "comment": "This face has tons of nostalgic appeal plus it just looks great and actually provides useful functionality with the battery indicators. I would love to see more functionality added, a nicer transition into ambient mode and more ambient options. It also really works well with the moto 360 flat tyre as this can ruin most faces really.",
        "date": "December 7, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRWQ2QlQ3MGh5cFlqMFozTXVieWRkU2p1aUV3R2RIT0RPWnhpaWtmbXN5Y3E4T1p6UGlydFJLdGdLV1BsblN4c0FWdGs5MGo4c0M3ektiMjVF",
        "reply": null,
        "star": 5,
        "title": "Love it!"
    },
    {
        "author": "Nick G",
        "comment": "I love this watch face a lot! It brings back so many memories, but the only thing is that I cannot get any sound effect to come through on my phone. I would love it of I could play a small sample of the in-menu music to GoldenEye when I raise my watch up but no matter how short I make it no sound ever comes through, BUT I understand that's still I'm beta so no stars subtracted. Great work!",
        "date": "April 16, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRktfbUFIT0ZOTkNJQk9VUGo4M1Y5YmVQNlg4bVpTVV83amY4bWZLZ2QwS0pXU2Z0S2tMV2RMT0lyc1dfVm54NXJPbU55NW5rWlY2YjNIMzZr",
        "reply": {
            "author": "rmuk apps",
            "content": "Sorry about the sound issue, there are multiple problems with that right now. Since I don't leave an app running in the foreground of your phone it sometimes loses the ability to stop a sound once it starts! One I figure that out and your issue, I'll take it out of beta. Thanks for letting me know.",
            "date": "April 20, 2015"
        },
        "star": 5,
        "title": "Love every second of it! Only one small problem"
    },
    {
        "author": "D L Cain",
        "comment": "When I glanced at the picture I realize that it was actually from Goldeneye on the Nintendo 64. Reminded me of hours upon hours of skipping class and playing 4 player with my suite mates. This watch face is awesome. Personalization is super easy and the \"health\" and \"body armor\" gauges show battery life of phone AND watch. Insane.  I will likely keep it on this for a looooong time. Thanks!!!",
        "date": "July 29, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRzREdWgyVFo0TWhTOGxKSHN3Z1o2SFNvNkowT3YzWm5CMXVMUDRoRkF1UE1fajNxa0RQbVNrUFoyWHBiUThGblIzZVF3YXYzQ1A4Vl9SVHVn",
        "reply": null,
        "star": 5,
        "title": "Nostalgia!"
    },
    {
        "author": "Yusuf Islam",
        "comment": "A fantastic watch face. It's almost exactly like GoldenEye n64's version. Makes me smile every time I see this. I'm hoping the dev makes a more complex, contemporary or updated HD design watch face for this, then again I can't see how he can improve it! Best watch face so far.",
        "date": "January 23, 2017",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRlV5dTNMeXZoU05RT1BqVzN2dTdGR3VlSTh3dzhpSGdLOXB4SXlJRDFULTdUVHZFYk9fclE5RGtaMy1qUWRtekNtbUNIOV9mVkdVaDVQUEtN",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Brandon Hanna",
        "comment": "But i do agree. I would pay for the ability to see weather and other things by scrolling L or R. And if there was a mission timer the said: complete or incomplete. Synced to you calender. Also i miss the flicker/flash... but so far this makes me super happy",
        "date": "April 8, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPR2xtczJVRE56UG54MU9mdnhZVTZ0X0xTeVBqSE00d055ZG85cGFzUmdqYUhUWjZlYTllY21PekVEWE8taWI4Skl2T0tzTGVfYWh2bFpLbDgw",
        "reply": null,
        "star": 5,
        "title": "Love the face."
    },
    {
        "author": "Alen Nezirevic",
        "comment": "This seems like a golden idea, but I happen to not have a watch. Could it be possible to have a seperate option for phones only? Say, the armor bar would show the second half of the remaining battery and vice versa. Thanks!",
        "date": "May 30, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSEZBY3pXNEpKaDlVdUpwMW9UNlFqRklnS19ZN1FkbGxEQTlqWFRxMWQxX0JkUVoybXVyVFFFY2tTNjdEUDFjZ1FidUlYc2U1UDJHWjdTQkFj",
        "reply": null,
        "star": 5,
        "title": "Good idea, but needs support for phone only as well"
    },
    {
        "author": "Diego Valdes",
        "comment": "I ran into enemy fire, guns blazing get, thinking my body armor was at full, only to realize it wasn't. It took two trips to the hospital to get the last of the rounds out. I love this watch face. Suggestions for customizing: decide what the health and armor displays mean: calories, steps, battery life, etc.",
        "date": "October 9, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRUFFY1FVZHRQVUl1NjV4Y0RRVVViRWIxYjRBYmdkbzVrejNRcXJZT3g2ZzRhdGVXOG1lSV9HcWVQaTJ4MXgyTFlBLWZnUUN0SmFxZ0FxcVVR",
        "reply": null,
        "star": 5,
        "title": "Body armor display inaccurate"
    },
    {
        "author": "brakbudy",
        "comment": "I love this watchface but it's been showing as all black at least maybe once a week and I end up having to update either android wear (if an update is available) or just uninstalling and reinstalling. Kinda tiresome and I wish it didn't do this. But it really is the best watchface out there.",
        "date": "July 18, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSFVCTEFWeUotSWRaTTQxSkhtdTlNUzNtY040LWQ1MHNhdEkxZUxWckRzUDdlZE5TTnBlc0hqTE1fR3VycFZPTHpKd1BXTzRfU3c5QlpPNm9r",
        "reply": {
            "author": "rmuk apps",
            "content": "Sorry about that.  Been trying to nail it down and will hopefully have a fix soon.",
            "date": "March 23, 2015"
        },
        "star": 4,
        "title": "Awesome, but keeps crashing"
    },
    {
        "author": "Matt Greenheck",
        "comment": "This is the reason I bought a Moto 360, I saw this watch face and was sold.  It shows everything important at a quick glance, at least for me. Phone battery, watch battery, and the Mission Status even flips over to \"complete\" when your meetings are done for the day!",
        "date": "February 15, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPR2kwNGUyWGwzUEpzT2Y5S3lpRExBVFRUNmNEUmdoTi00eXJVYWhEamVhNDYwNVduSVFqS09RRTZVbXZTTlhUd2VWWEhYZXdUTHJadWF4U1k4",
        "reply": null,
        "star": 5,
        "title": "Absolutely Fantastic"
    },
    {
        "author": "Phil Halliwell",
        "comment": "OK for free.  A few suggestion to improve it.... Hands are hardly visible when backlight is on.  (OK in power save mode) So high contrast on the hands would be great. Does not fit on a Square Watch (Sony SWR50) face very well.  A SQUARE FACE option would be brilliant please.",
        "date": "June 21, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRzh5T2pVQ0dZOGRES3NYNnlhSzBNWXNIOVJUd0pVZ202Z3ZvWVVYMXNIVUhtTW1wVUlvaXBtWFZ5TnBRSXVTdzV4Y29WaUpfV1VRWTRVazg4",
        "reply": {
            "author": "rmuk apps",
            "content": "Can you send me a few pictures of what it looks like on your watch? I originally designed this on a G watch (which is square) and it worked fine on that.",
            "date": "August 11, 2016"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Brendan McMorrow",
        "comment": "One of my favorite watch faces but it would really be nice to have the option to just have the watch hands in ambient mode. The G Watch R has the markings built in so it doubles up and looks really loud and too much.",
        "date": "November 2, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPR2V5YmdsZGNRdU5pLWhiaUZ2aGt5MFctZjdTZDhONWNoMHhXYjZJQ3VsdzdMT051T0c1OFpFR3JLY0JsOVBwUVMteWxTSHdXRmViazhrRDlV",
        "reply": {
            "author": "rmuk apps",
            "content": "Try out the \"Stealth Mode\" option in the settings menu.",
            "date": "December 14, 2015"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Juan Trejo",
        "comment": "This watch is awesome! The only problem is the \"life\" indicators on the sides display as ugly white outlines in ambient mode. (even when selecting full color option) I would use this watch face 100% of the time if it wasn't for this. Dude, I'd pay for it!",
        "date": "June 5, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRTY4ZFBoRGVrSHREQVkxSGs3eW1vWjdQX2pKcm9MMExndHpHSGVLclQ0Vm5GeDBEZFItRm81TTM4aEdVUnRXaVlTdkpIMWY2RmltUE5neXpn",
        "reply": {
            "author": "rmuk apps",
            "content": "Hi sorry about that but that limitation is in place to reduce screen burn-in if the face detects a certain screen type. It follows Google's guidelines for OLED watches. I may look into adding an override for that eventually.",
            "date": "August 11, 2016"
        },
        "star": 4,
        "title": "Would Love Full Ambient"
    },
    {
        "author": "Roy Gless",
        "comment": "I'm stuck in a train that's about to blow up and I need to use the laser to cut my way out before it explodes. I can't seem to figure it out though. Any tips?",
        "date": "May 10, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRWdSeUd6c0lhZlF0THRJN3EtTG9PUzRLV2REcVVLVWRmN3d3Snhic3FBT2tISEQyQ0RQN0dQXy1oQzU0cEprWUxWRlRwVXdVeGZuWUZ6U1NF",
        "reply": null,
        "star": 5,
        "title": "How do I use the laser?"
    },
    {
        "author": "Simon Stewart",
        "comment": "I'd give this 5 stars, but the laser doesn't work. [Update] It turns out that it is a hardware issue. I'll get in touch with Q in the morning. :D 5 stars.",
        "date": "March 31, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRzlHeFlSVjF0NHRUdjFud3JmVFJFemlJS200M0V3SkhmRXFtbEdXOUxreE96OUJqMnR5V3ZzZ1J5YkNRaFNLVlZlYVczeHhfNHJYNkd5WS1B",
        "reply": {
            "author": "rmuk apps",
            "content": "The laser only works on watches that have that feature built in.  :D",
            "date": "March 31, 2015"
        },
        "star": 5,
        "title": "A very nice face indeed"
    },
    {
        "author": "mario avendano",
        "comment": "I love this watch face it really makes me think of goldeneye back when i was a child. It would be awsome if it had more features like the health bars showing the actual battery life and so on. Also the distortion waves would make it even more awsome. Great job",
        "date": "August 22, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSEg5aUZfUmxCZk9haXhwWXo0R0pEb196TnZ2cWw2b0R3ZmdrTXV1Z0dOakdPQXM5czFVMWI1S3J1MjMwUkJOTVppYjFvZEprc3VDVUdPMS1Z",
        "reply": {
            "author": "rmuk apps",
            "content": "Just a heads up, the bars DO show the battery.  The left one is your phone battery life, the right one is the watch battery life.",
            "date": "September 1, 2015"
        },
        "star": 5,
        "title": "App is awsome Please make more updates"
    },
    {
        "author": "Junior Junior",
        "comment": "I liked it a lot, very retro feel. Lots of customizations compared to most watch faces. Tried out the beta option and of course I made it the watch beep from the game but it loops the audio file you choose so that was annoying. Please add an option to control loop on/off and I'll update to 5 stars! UPDATE: Thank you for the developer reaching out to me! I understand now the beta feature shouldn't loop. 5 stars!",
        "date": "February 15, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSGNjdzdrQ2poa2xsMnZYY3RhWDI4MTktMnRkMXpBSmV0eFJ2Ry1nOEd2NGRiclNKSTBWTWJqa1FxSE1nUjdSbklRUk9zeHN4VFpvOVhyNlN3",
        "reply": {
            "author": "rmuk apps",
            "content": "You actually ran into the reason why it's still a beta feature.  There's a bug where i lose the ability to stop the sound and it just keeps playing.  I've been trying to nail down the cause, but until i do, it will be staying as a beta feature.  Glad you're enjoying it though!",
            "date": "February 10, 2015"
        },
        "star": 5,
        "title": "Must have!"
    },
    {
        "author": "CK MONDAVI",
        "comment": "This is the old pause screen for golden eye. Pairs great to any round Android watch like the motor 360. Just be warned the app can crash every now and again, but stays pretty stable through out the day. I'd give it 5 stars if it never crashed, so the 4 is of the 4 times it has crashed",
        "date": "October 12, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSE9ZdVFhWTRWNkhJZkc2U2JoRmJrY1A4RzFkU2JuQ3A2S3pfalQwYV9USS0tUlNha1NFcGc2dFVUN1N6TWs2dkhGaWE3N25xaXFvTWxkVXI0",
        "reply": null,
        "star": 4,
        "title": "Awesome throw back to the 64"
    },
    {
        "author": "andrew weiss",
        "comment": "Nothing would make me happier then to have this as my watch skin on my gear but it won't show up in my Samsung gear clocks and there is no sync option. Please get this fixed so I can have my golden eye watch.",
        "date": "September 30, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSGo0MXk1UFYtUnRWTlp3NkRsQWlJZWZOUjdrQ05uOGVNSEFvc1B4NC1Md0lHd3dRNzdzSy1aM0t0ZE1TZVhFSHdqZHZwM1JtVjNqeXhDRElB",
        "reply": {
            "author": "rmuk apps",
            "content": "Sorry, but this watch is only compatible with Android Wear (as stated in the description).  If I were to make a version for the Gear watches, it would have to be a completely separate app from this one.  I appreciate the request, but rating this with one star won't help.",
            "date": "December 14, 2015"
        },
        "star": 1,
        "title": "Does not work with Samsung gear"
    },
    {
        "author": "Alejandro Godinez",
        "comment": "Was on the fence about getting a Moto 360, after seeing that this was available early on, I had to have the watch. There is a small bug that was introduced recently, At some point the watchface stops rendering, I haven't been able to deduce anything specific set of circumstances when this happens.  It only started after recent update which I believe introduced the smooth second hand, event though I don't have the option enabled. it doesn't stop me from using it the watch face but I have to switch to and from the watch face in order to fix its rendering.  P.S:  Ill send you an email with a video link as it is difficult to explain",
        "date": "January 26, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRkpQWlgzblNqVDZUajR1RUxERXZ2SDBOS25adTItMTFIdDNlZktIOW5BN1pCTDI4Y1Ryd1JVcTVmak8wUGFXZXIwbTE1dk5jbmxadFZwSWRF",
        "reply": {
            "author": "rmuk apps",
            "content": "Thanks for the review. I got your email and have seen this issue before.  It is rare, but it does happen.  It's been a bit tough to nail down since it happens so infrequently, but i am working on it.",
            "date": "January 29, 2015"
        },
        "star": 4,
        "title": "Makes Moto 360 worth it regardless of what anybody says"
    },
    {
        "author": "James T. George",
        "comment": "This is the best watch face I've installed. period. Brings back so many memories. I love the options and features added with every update. The only thing I would like to see added is having the power meters on the left and right animate while charging. It would be cool to see them blink back to 100%. Keep up the great work!",
        "date": "February 22, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRThtTFFWMFVXZldhb1ptMUc0bUh2ajdVbmRYNmViYXFmNlF0TURFdVhqd01nUmdTVE9NMnRnNklmMU9NalF2c01RYkFKT2xyMWpRNHZ3NzJN",
        "reply": {
            "author": "rmuk apps",
            "content": "Yup, that's on my to-do list.  However, it involves a complete re-write of the code for those bars so it might be a little while before it gets done.",
            "date": "February 23, 2015"
        },
        "star": 5,
        "title": "I just absolutely love this."
    },
    {
        "author": "Ron Oman",
        "comment": "Thanks for this, it brings back a lot of good memories from my childhood. It has crashed once but it hasn't happened since then. It's just what I need to escape from a train rigged with explosives.",
        "date": "March 19, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRWJ6SkpaQWxmM0N4dkQ1V0FVLVoweGxUOHA0MGxCQmFRWXNvV0g0MDFNU05TQ2lnU0dIamhPWDB6aWdqUzBsUU9yaTBQcDRJUHF4SmJES1JJ",
        "reply": null,
        "star": 5,
        "title": "Just like Goldeneye!"
    },
    {
        "author": "Ian Cap",
        "comment": "Love the style and functionality. The only thing that doesn't work is the phone power bar on the right. But other than that minor thing, I love it! Bring gs backups of memories of playing Goldeneye with my friends on N64. ☺️",
        "date": "June 17, 2017",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRXlaWTVkM2p6bk1MTTJmcWVMelozNWxFQzI2VS1zV0puVFhUTlJCVHRkckNYME9vWER2Mmd1dmduY2thMnc2RFB4RXpkNFNQS3IxSTROSzFJ",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jahmaal Garnette",
        "comment": "And super nostalgic. Idk of its just me though, but it does a weird thing where when the watch is waking up, it shoes a different watch face for half a second before showing this one's.",
        "date": "November 27, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSHFQalB4RHdJdlZDUkhBb0ZDRGpPMXd1YUtMMmNLemhqSk9MaEptRzMzWWNhOEN0ckxHNVZ6bFhKRUJXMkhqa1hCMnJqOGtVOFBOMHg0SGJR",
        "reply": null,
        "star": 4,
        "title": "Awesome!"
    },
    {
        "author": "anthony greco",
        "comment": "Uninstall do to excessive battery drain. UPDATE: still have battery issue but I don't believe this app is soley responsible. Waiting for Motorola to call me back. It's been a couple days. :-\\",
        "date": "March 29, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSDlqYjgydS1feDNFWTA5SllWbmg4T05tNUdPUG12M3pWZ2dqcU1jeGwyWGtUM2xtakFlTmJiRGRrRDB6bEQ1ODFvSEhnYjRQejVzWF9heGVZ",
        "reply": {
            "author": "rmuk apps",
            "content": "Please shoot me an email as i've done a lot to optimize battery life with this and get very few complaints.  I'd like to make this as battery friendly as possible.",
            "date": "March 26, 2015"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Dinico Win",
        "comment": "I used this watch face for months.. And it's actually still my favorite. Until one day I switch the watch face and notice screen burn of the time. From your secret agent watch face... I got scared and vowed to never use this again. Although Screenburn fixer fuxed the issue... It's a scary thought that my screen started with that ghosting affect",
        "date": "November 25, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSHEzeFFoTXYyU19XZk5JcU1aYkhfeU5DNE1lX0QyWmtnaGJyOGxkeFVuaHBPUm9zYlNoUXFGelZIbWg2aTNvN2xUOGEzXzdqMGoxUjlCQ3NR",
        "reply": {
            "author": "rmuk apps",
            "content": "Which options did you have enabled?  The G-Watch R has a screen type that is definitely susceptible to burn-ins no matter which watchface you use.  This face has been designed to protect against that as much as possible (note how it turns into outlines when it goes dim).  Let me know so that I can help if possible.",
            "date": "December 14, 2015"
        },
        "star": 3,
        "title": "G watch R"
    },
    {
        "author": "Greg McPheter",
        "comment": "I can't say enough about how cool this watch face feels.  The only suggestions I'd have is to have an option to display a transparent gun/ammo in the background too and possibly even a distortion wave every so often just like in the game.  Thanks again, I can't recommend this enough!",
        "date": "February 11, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRVVrYjFXWHNjVHVQTFBOT01tU2w3Q0R2Wi1fc3ZuSk53R0hHVGxESWExck9JOV9fdlJsZHZSN2Vrb3dYdUhMdDNFZTlyU1RFcXRjVzZ1amFj",
        "reply": {
            "author": "rmuk apps",
            "content": "I would love to eventually get a distortion wave in there.  Right now I have some other features i'd like to add first when i get time, but that's definitely on my list.",
            "date": "February 11, 2015"
        },
        "star": 5,
        "title": "Made me buy a smartwatch"
    },
    {
        "author": "Grant Walker",
        "comment": "My only gripe us that the ability to change the size of the date by toggling the Large Date button is pointless.  I can not see any difference in the size at all. Is it possible to change the size like the time? Apart from that......great stuff.",
        "date": "April 10, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSE1mOHNWVjR5TC1MaTVGbHRFM25xQU4zNlRKY2FQamFybFVVazJUN2VLelZnWGY4YzRvQm54bDVvX1VjZ09BTi03MUJxRGlZVVRLUy02ZDdZ",
        "reply": {
            "author": "rmuk apps",
            "content": "When you hit that button the date should appear at the bottom of the watch in a large font. Because of the amount of date text, it can't go very large. I could change it to a numerical format but that would kill the aesthetics a bit.",
            "date": "April 20, 2015"
        },
        "star": 4,
        "title": "Cool watch face"
    },
    {
        "author": "Nicholas Daszkiewicz",
        "comment": "The beta option for sound effects is great although doesn't always shut off properly, if I make changes in am app and am not on the watch face when I let it go idle... Occasionally the sound continues to play and the only remedy I've seen is to reboot my phone... Other than that, great job and keep up the good work, loving the watch face. Lg g watch r",
        "date": "March 13, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSDVKZlA2RnBVdG5nQWRhQUVhcnJsVmdqY1haR3hmLU5JdGhYdWpnQVZqbGFLTi1FN2x2SUlZZ2dGdkVvMHVBbjQ2dVZqZm5MVlFXb2IxRXVJ",
        "reply": {
            "author": "rmuk apps",
            "content": "Yes, sorry, that's why that option is beta.  It has that bug.  I hope to fix it soon.",
            "date": "March 23, 2015"
        },
        "star": 5,
        "title": "Fantastic"
    },
    {
        "author": "Eric Nabeth",
        "comment": "Sometimes the watch face crashes and theres just a black screen.  I found a fix where I just have to change the watch face back and forth, but I still shouldn't have to run to a problem like this. Great work in the end!😃",
        "date": "June 13, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSDZUWkw0WUFUWjJxWW5wREhHbzh3TGEwRU1XdWVlZlBiVzVzNlNzX2d2RkxCTHkzNFlZeEZYWGczSFI1N2ZQYUZqbEZJX0cxcHdKamUzYlNF",
        "reply": null,
        "star": 4,
        "title": "Great watch face! But....."
    },
    {
        "author": "Rob McDowell",
        "comment": "I love the way this face looks and functions, but it is a giant pain to get onto my watch.  I recently had to reset my watch to factory settings to correct a problem and now I cannot get this face to reinstall.  It appears to be handled differently than every other face I own.  It won't appear in Android Wear or the watch itself.  2 stars because when it works it is great, otherwise 1 star.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPR1RIVEZxQU5xX3NpYTEzeC0zV3dOckFNM1BSNm1EakZjRFdoUVNPSjhDWDV4UG9USzNrdEZzdElxb2JFOGNxS1hJa3RmMzhfZ3kxd1o2SVpj",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Andrew Williams",
        "comment": "This watch face is pretty radical and gives me the phone battery life monitor function that I wanted, but it always shows the digital time over the analog, and the dim features don't seem to do anything. I don't know if I just have the wrong type of watch for those settings, or if I'm just dumb and doing something wrong.",
        "date": "July 15, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPR19WZXRFTWoxQnJxWnhETHpGMVFPQ0ZjVGpUWDJRV1NNaFBSalo3Y3JSVHRsYUhRSFU1cHdEdmE1Rm9vdTFyQ2REai03dV9ESkxIZVl1ZWFR",
        "reply": {
            "author": "rmuk apps",
            "content": "it does depend on the watch.  If your watch has a POLED screen, certain things have to be disabled due to drawbacks with that screen type, sorry.",
            "date": "July 21, 2015"
        },
        "star": 5,
        "title": "Most excellent!"
    },
    {
        "author": "Wilf Moralee",
        "comment": "But no interactivity. Would be lot better if could go into weather, calendar, music, etc with same theming. Plus flashlight tool in watch face always handy.",
        "date": "January 15, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRWhiak1PWWJhTm5GMTh0LVUzeTRYcmRQSzdzTENKTWVsV3VIcDJXY1U3Y1BZSHZ1ajVNNkZ3VXRiSERFZm9KS0ladlprUlZWSEVobm9WZDl3",
        "reply": null,
        "star": 3,
        "title": "Good bit of nostalgia"
    },
    {
        "author": "Reo Cruz",
        "comment": "Android wear recently updated and installed on my watch and noticed recently that when I raise my wrist the watchface doesn't fade in smoothly anymore (but fades smoothly turning off). When the screen comes on it shows the monochrome face for a second and then just \"pops\" in the color. I've been trying to fix that but so far nothing has fixed that ugly pop in. Dunno if that's a bug or a way to turn that off. Great app overall though.",
        "date": "March 2, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRzJiV3cyMDZqaFd0Yk53R2VwUWg4NzVkX2hJRl9MLVNDQUJIOW9uOUVyYXowcGxXTS1tbWN2ODhFLVZybXVmVHV4dkdRZ0oxdk1IV0VTbDh3",
        "reply": null,
        "star": 4,
        "title": "Awesome but one minor issue"
    },
    {
        "author": "Daniel Barfield",
        "comment": "Awesome nostalgia. And free! They're aren't many great free watch faces. My only request is for a way to remove the hands behind the green screen, or maybe just the second hand. I no it isn't much, but I'm very interested in maximizing battery life so I'd like a screen that isn't animated at all. But still 5 stars! Every time I check my watch the James Bond jingle runs through my head and I'm taken back to the days of golden guns, remote mines, and shooting people's hats off while they're on the toilet.",
        "date": "June 1, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSFVURng5V2R5YzZUc1F4UXdQQlcxXzlPRVA4TXFDS2lSQmRySFdYak1ZT0pzdHpPN2pPQXpid2VmbmZQZWFBbEF4M25ENWFyOFUxak9JTHdr",
        "reply": null,
        "star": 5,
        "title": "Love it, only one (small) complaint/request"
    },
    {
        "author": "The KarateKid",
        "comment": "Force closes and freezes a lot on my first gen Moto 360. Noticed my watch would randomly power off because of it. Problems stopped after changing the watch face.",
        "date": "November 7, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPR0dDUVBBMXZRdXNGZ3JFQURfNG5nZjlNbFhnQ25wUGlwZFRJWlpqWER0dmxfaDczQkpaSFlWSmxaRHc2N1YxTnY3RS02ZXAxYWhTb3V1MmFZ",
        "reply": null,
        "star": 3,
        "title": "Cool but buggy"
    },
    {
        "author": "Christopher Yany",
        "comment": "For some reason the idle screen on the Huawei watch shows outlines of the phones battery life and the watch's battery life. I understand the color issue, but they should be at least grey scale, not just outlines. Looks a bit cheap without the fill. Or an option to just remove the indicators all together from the idle screen. Other than that great watch face. Only one I use. Let me know if you want screen shots to explain the issue. Thanks.",
        "date": "December 3, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSGtMTC1JWFFkU3BjSWZ2dVpsc05lejNlZGRrbW1NZW1sdTFYX0JqU0FlNjQ3RXB1Z3dyY0xRUmRFZGxrdEIybHJzTGJYRTdRYWNkc2NEV200",
        "reply": {
            "author": "rmuk apps",
            "content": "Hello, sorry about that issue, but it's being done to follow google's guidelines for that screen type.  They strongly suggest using as little of the screen space as possible to prevent burn-in issues for watches that use poled screens.",
            "date": "December 14, 2015"
        },
        "star": 4,
        "title": "Great watch face, idle screen needs improvements"
    },
    {
        "author": "David Atwell",
        "comment": "This is what made me want the Moto 360, and it is totally worth it.  The only issue is that when I look at it, the world doesn't pause around me, but I bet that's a hardware issue.  :-)",
        "date": "April 16, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSHNPdjJleVhBaVdBOXZZU2JNRFVES2ptSkJYNHBkMTZ4aXRLTnZpZjNHajlWeThxdXdJWGdadUlnVXBYTmxHZ0Fpd2lwUmZBZWdvSElxRjZj",
        "reply": null,
        "star": 5,
        "title": "Beautiful and nostalgic!"
    },
    {
        "author": "Brett Kerigan",
        "comment": "The second hand looks a little Janky in the 15 fps mode, but I can't say anything bad about this watch face. It's well-built and really impressed me. 5 stars... Easily.",
        "date": "April 15, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPSHVJTmpsZWYxN2tQZFRRR0hqWDZmT01rTkdrNlVXRE5OanRXdUE0RFZvZDd5cUY3cFFfT0RxN2FQT2VHSlFtZjVMUjgzY1dmNjNPaHJ4OHhv",
        "reply": null,
        "star": 5,
        "title": "Just amazing"
    },
    {
        "author": "Charles Hayward",
        "comment": "This is the best watch face as it is both highly functional and nostalgically awesome. I've been using it basically everyday since I got my watch Christmas 2015 and the fact that it shows the battery life of my phone and watch so clearly is excellent! Highly recommended to those who grew up playing Goldeneye!",
        "date": "May 24, 2016",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPR3E0WjJaUXRjSjFzeGJYenRIcEFXbjZDcE5Tb1JmbWtWUEtJWm5ud285WEdqazBWTjVyQUZyV3BFc1JOZjRWT2JrUlJoaHhxd2F0LTNzNmNz",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Sam RJ Coley",
        "comment": "I've been running around trying to set off remote mines, but I can't seem to get them to go off... Maybe a bug?  One thing that would be cool would be to have the little bars at the bottom underneath the date illuminate when you have notifications, if they're on mute - kind of like how some of the default watch faces will have a little \"2\" or \"5\" etc come up at the top to let you know you have notifications.",
        "date": "April 21, 2015",
        "permlink": "/store/apps/details?id=com.rmukapps.secretagent&reviewId=Z3A6QU9xcFRPRTJkdjMyNE5qSjh4bXBNTHdEcW9GY0FGUnZSVTUzaGVYS25rY3gzczBFaDRNbUxNNW1KMVJNQXVoN1BzNzZPMnJrV2l6cWdZRmY4MXZtQnkw",
        "reply": null,
        "star": 5,
        "title": "No remote mines function?"
    }
]