[
    {
        "author": "Brian Lalonde",
        "comment": "I don't see the brightly colored pie-chart style pictured. I'm only getting low-visibility, muted gray-on-white (or on black) lines and wedges, even for appointments assigned bright colors on my Google calendar. The date obscures the hands near the 9 too much.",
        "date": "October 17, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSEVLODkzdDc2S0pxeDNWMXNZaUJiUy1HYTRCcHNoaWsyamVQeElibUpMRmJOWTlBd0U0RG1wOS14YjR4cjQ0eEtEamdEbFEzUkxVaVU3R0tv",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Brian,\n\nUnderstood, then it looks like you haven't flagged any events as \"important\". The watch face allows to pick individual events and color them up, but while they are not flagged (not marked as \"important\") they remain grey.\n\nWe can share screenshots to explain how this works, if needed. Please, write us an email so we could contact you.",
            "date": "October 18, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Benjamin Moore",
        "comment": "Shows up for my Moto360 but not on my Fossil Q at the same time.  Is this by design or through error?",
        "date": "September 25, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPRVRpb2V5cFB6WFJnakJRS3hxYU92eGpVNHlxak43Z1F5ZDk5ZFdOWWEtdUkyX2g0NHhacXp6N29TUlNsTzZYeDJoZlZMZjQ4bWJ6Vld0ckdZ",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Benjamin,\n\nPlease, wait for 5 min to let all of the resources catch up. Sometimes it takes longer for certain watch faces to load. Also, please note that different smartwatch models operate at a different speed. Hope this helps!\n\nAnd don't hesitate to contact us via email if you still encounter any issues. We will be glad to help.",
            "date": "September 26, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Hoang C. Huynh",
        "comment": "It is really what I want: the price is a bit steep, but it's something really worthy. My suggestion: multiple calendar synchronizations, 12h time span, outlook accounts and more color customization, at least for the hilight color.",
        "date": "December 29, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSEliVnIzVzFzYXBKbTJFaV9lSmNKN1dJc1lmQWZ4bFR5TVVVd1I1RU41cXBfdXJfdEJIWnI4aUpGQlZHdk9qZW9DOGl1YmxoeU1PMjgxaXhj",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Tezza Tucker",
        "comment": "Not bad. Works ok on my Huawei Watch 2 Sports. Gives all the relevant information at a glance. Will never miss another appointment.  Thanks.",
        "date": "September 17, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSDJBbjZlclJldGJmTHZpakhzemJMYmZWUXlEOTZwTHpJc3VuNmx0dGVXcUM3UzBPSXRZbGJDM1c2SUI0cUlkbmV6ZUtOZkVUX3pYS3JWdktj",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jarrod",
        "comment": "I would love to give it a try but I have installed and unistalled it multiple times now and cannot get it to show up as an option for my Huawei watch.  I am now past my Google play return time and would like a refund if I cannot get it load on my watch.  I have read through the notes and tried resyncing all apps and it still will not show up.",
        "date": "August 23, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPRVo3Qlc2UURoYlFUR0p1TGNkNGtxLWRXNmprQnhwdEZpSGthOS1kTzBOV3JCbHE0VHhHSjBjSlRVLU9hSXZOa0J2Ui1uNmhQU2hhZEFnOXJZ",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Jarrod,\n\nThanks for your reply. It turned out to be a quite common issue due to the way the connection with Google services works with the watch face.\n\nAlthough we can't fix the random connection errors, we have included notifications and instruction messages in the latest update to help you out. Hope it helps!",
            "date": "September 4, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Adam J",
        "comment": "While it looks useful, I couldn't get this watchface to recognize any events on my Calender and there is no settings to control this at all. My watch is synced so the events show up on other apps on the watch, just not for this. Never take control away from the user like this as it puts them in a situation where they can't do anything to address the problem themselves.  For reference, I'm using a Sony Smartwatch 3 which has a square face.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPRUVDRU11bG5FSTZCbjUtS0N2Z2QxVXpVdmFIUXlrWHJmakRZWjQweHk1NWp6Q0F4cUdJTnZQYVBTbkN4dzNkTmY2bGZKN0t4YWplU2NQT05F",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Adam,\n\nThanks for your reply. It turned out to be a quite common issue due to the way the connection with Google services works with the watch face.\n\nAlthough we can't fix the random connection errors, we have included notifications and instruction messages in the latest update to help you out. Hope it helps!",
            "date": "September 4, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "",
        "comment": "After using this app, I noticed something that hinders it as a calendar keeping watchface. It will only show you events that occur within the next 6 hours. This means if you make plans for later in the day, suddenly you can be reminded that you have an event at that time when it is too late. Since the fastest update period is 30 minutes, this further damages the small time you have to see your events.  Highly problematic.  Second, the apps ambiant mode does not show you markings for your events. It only shows you a bar of white text of what time your next event is at and can be slightly covered by the watch hands.  In conclusion, this watch face is a great idea and looks very nice, however the features do not compliment it as a \"friendly\" calendar keeping face and, in my opinion, must be addressed if more people are to use it.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSG9ZOUdyN1E0VEhXbDN2a0QzdnI0SDNqLWozVm53VGhCeFdMdGxudnA1eXR4TUFEdDNrMlRJNlp4MS00VzJnRXdkVXRXVlNzVndHM2o0cVIw",
        "reply": {
            "author": "BoostApp",
            "content": "Hi! Thanks a lot for your reply, we've added the option to choose either 6 or 9 hours now (required to avoid UI cluttering). Also, we have included the Update Now button for events.\n\nRegarding the ambient mode, we're already working on improving it. Plus, we've already corrected some UI flaws in the latest update. Hope you like it :)",
            "date": "September 4, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Jeremy Hanes",
        "comment": "Although this app supposedly syncs to the calendar every thirty minutes I waited all day for it to never update. Unfortunately, I didn't realize this until after the refund time so now I'm out $2.99 for an app I'll never use again.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSHI3S19xY2d5c1hZSUFUb2pKMnpCb0JUaXpoSnpzWm9VM3dJb0tsdXAzQlU1aWhUY0dLdUNyZG9DVnlLUWgwSUdWWDdhenpPR25BdE9Qa3J3",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Jeremy!\n\nWe've investigated this issue and found the reason why some users cannot sync up correctly. The connection with Google services fails randomly (which we didn't encounter initially) and without notifications, the user couldn't know what to do with it.\n\nWe have corrected this along with the other most common issues in the latest update.",
            "date": "September 4, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Jenny Eldershaw",
        "comment": "I don't usually install paid apps directly in case they're awful but following a review from an Android website I took a chance on this. Never again! There's nothing basically wrong with it; it works perfectly well although one or two calendar entries seem to be missing (possibly my incorrect use of the settings) but it's BORING. And TINY.  It needs a larger and thicker font for starters.....and it's not the fault of my watch (SW3....and why no update to android wear 2, Sony?) because every other app is easily visible even in bright sun. The bar along the bottom of the screen is positively teeny and the colour so grey it may as well not be there. Come on, developers. You can do better than this. You've got my money now, so use it.",
        "date": "August 25, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSG54VlpLZ1U2UzE4SFhjQm9SWC1lejhEdk5qekg3dEUweDNEM3RsalRzTXVkdi1qbGN0S19VaUR3X0QwallkRVlEeEtYRlo2b2hHYmxqaVU4",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Jenny!\n\nThanks a lot for your reply, we have taken it into consideration and included the required changes into the latest update. Took us longer to complete it due to a number of additional issues other users have encountered, but here it is. Hope you like it :)",
            "date": "September 4, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Tim Parsons",
        "comment": "Unable to install on my Huawei watch so it's essentially useless.",
        "date": "August 31, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSGkzMDF0WWRWczV2T1lGc2FwUWxZZ2t5TVhCdnVyeWpHa1RPOERZb3NMX0kyb2xYbTE0SFg0UUEyMzhtNXBmSFpxNXlnLWRaSTZubWFIVlhN",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Tim,\n\nIt's quite regular with most of older watches that a user has to wait for longer till the watch face fully loads. Please, allow for 2-5 minutes of stable connection between your phone and the smartwatch to let all of the resources sync up.\n\nHope this helps!",
            "date": "September 1, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Stephen Solka",
        "comment": "Fonts too small and agenda items don't show event location. I need to know what room I'm supposed to be in.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSFk3VkdfTGM4UUR6QUtPbEQ3WmhEbThKVTdOaWdoZTB6UjBwa1BYNUdtT3RUdGRxb1B1LTJsRmZ5RkFmWDQtRzZQMVZpbFYtS1pWR2Ezc280",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Stephen!\n\nThanks a lot for your reply, we have taken it into consideration and included the required changes into the latest update. Hope you like it more with bigger fonts.\n\nRegarding the event location. We were looking for ways to fit it into the UI but so far we can't find any space for it. Maybe in the future updates ;)",
            "date": "September 4, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Briant Illescas",
        "comment": "Bigger font on watchface would be great.",
        "date": "August 23, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPRmktdmRra0VMc0FRMERzNUJDb0tUdG1sU29ORHdDVjJIQU1jSVNpcXQ2S1l0VDdiWDk1ZUhsb29wOW5DZGdJdmlPUlh6MHlaZGFlX3kxOGFR",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Caleb Townsend",
        "comment": "Great watch face, shows exactly what I need to see. Install perfectly on Huawei watch",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSGtTcjltU3RVd0ZWWDNLTDNPM3FPRGswdC1BWGlUWE9WNG1zWUc2RWFMeGhLdE5yOHdXdzhPRlN3S2NhOFA2a2h1SE1vRmxyblhxdEJobXVN",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "steve taylor",
        "comment": "Would not install watch face to my Moto 360 sport on wear2.0. not impressed",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPR3VoaTFEMEU4eWRieDh1VktaT0dyeFN5OXdLMDg2ZUJXTnh5UzlqN0k4TnFhZkVycEVDQlpUdEhnUHc3eHd3UnVpQ1I5Mm1LR01rVmVMMnlV",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Steve,\n\nPlease, wait for 5 min to let all of the resources catch up. Sometimes it takes longer for certain watch faces to load. Hope this helps!\n\nAnd don't hesitate to contact us via email if you still encounter any issues. We will be glad to help.",
            "date": "September 4, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Vasyl Skobley",
        "comment": "What a great watch face! This is what I'm looking for.",
        "date": "August 28, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPRTg1bkRHUFpqUkpTQVFmNG93d0Jpa3AzUEZHLWpZV1FLNnRGZk8yOW9UQXV4OWR0NV9LWEZUM2w5bTF4alJKTXdBQk1QOXRWdG5JT2dlNDRB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Konstantin Tseluch",
        "comment": "Very useful watchface",
        "date": "August 28, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPSFZBR2NuVjhtNU8ydzc4RDVmZDRVR2o2UW9WNzdsbWgzaXhYTVhQeXQyZXN0eWJoVEhlSDJEejVISFhCbFJPcmZaREVqZUF1c2ltcVVTLXRB",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Clifford Mosley",
        "comment": "Install experience was difficult. Once I finally got it up and running, the small font for the clock dial and other areas made me switch it quickly to something else.",
        "date": "August 24, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPR3pxMmFnUUZoVEJvck1fRGctXzg1cTYwakY0eEZjdjRHRTdMOXBWel9oenlxWURrTzZGVlhYZWhTQWFaX3pwNVhoZ2hpRDBMUGhmakQ5UXpR",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Clifford,\n\nThanks a lot for your reply, we have taken it into consideration and included the required changes into the latest update. Hope you'll like it more now :)\n\nPlus, we have added detailed install and setup instructions to the description here on Google Play. Now you can refer to them in case of any questions regarding the process.",
            "date": "September 4, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Aayush Arya",
        "comment": "Not only is this a piece of junk that never worked for a single minute, but it's developed by people who are in it to make a quick buck by cheating customers. I installed it at night and tried to set it up, but it wouldn't work right, so I figured I'd give it a shot in the morning. When I tried it out after waking up, it still wouldn't work, so I tried asking the developer for a refund, but they didn't even so much as reply to my email. Scammers like these make people hesitant to pay for apps and try them out.",
        "date": "September 2, 2017",
        "permlink": "/store/apps/details?id=com.boost.calendar&reviewId=Z3A6QU9xcFRPRXM1cVhwbmR6ZkttNnVjSFQ0ZGs4WDJnMFhRYmk4bURiekVWM3JZcFRsVHNjYUJrZVl3QjRCT3BpZVJRVklteXB4UHNqTXdfRUxNWUJoSHlV",
        "reply": {
            "author": "BoostApp",
            "content": "Hi, Aayush,\n\nThank you for an honest reply. Sorry for not replying, we were working hard on fixing the issues and rolling out the new update. We hope it will work for you. \n\nAlso, we are \"in it\" since 2015 and value our reputation in the Android Wear community. That's why we couldn't reply without actually having a solution ready.",
            "date": "September 3, 2017"
        },
        "star": 1,
        "title": null
    }
]