[
    {
        "author": "Kristen DeMichele",
        "comment": "There was an app similar to this called the daily plate by livestrong...it was much easier to find more specific items on the other app I.e. \"Starbucks venti nonfat butterscotch frappe\"  with no problem.. in this one I find myself having to scan everything, but all in all it does what it's supposed to...helps you track cals in vs cals out and stick to your intake/outtake goals.",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRm4tN0gyUE5KbVBNd2VvNDhVYjVZRXZKRTk1TS1SOV9TMWxqS3RRUTlhVjRpdlBsUy1GdXg4MHJYOG91clMyR0hTMFFJX00yQi1XU2NxbUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "wade mccallum",
        "comment": "over all this app is smooth however if one is truely a work out person with knowledge then this app won't cut it. We need to be eatting smaller meals 5 to 6 times per day perhaps even more. This app fails to allow us to add more then 3 meal slots. I'll be heading back to a different app",
        "date": "February 22, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSGFzbGFlLTJKZ3FzRGNEQ1A5LThfY2VHdHJQR21uaTc0eVdOWU1XdVdxLVFaWWdvczQyMzU0VGFUOEZ3RUEtYm9LTjRaWGhGNzJ2U0ttbnc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "andrea austin",
        "comment": "Signup was too complicated, there doesn't seem to be any way to delete food from a meal if you accidentally add it, and to set your age is beyond ridiculous! Unless you're 22, you'll have to click backwards through the calendar to get to your birth date. Trust me, I was clicking a long time. Such a simple feature to let you type in your date, too. I don't know why they don't have it. Used it for 1 day and uninstalled.",
        "date": "January 20, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRTgxaFB2NE95bjNkcERodTB2el9mWVdwMHdXbW15WGYwbVJ0d0pZaDJKbXhpbDhsbTJkd1lUblFDVWxxTzlVTTBLVjdGMmk5bVBkMGFTY3c",
        "reply": {
            "author": "LIVESTRONG",
            "content": "Hi Andrea. We're so sorry for this inconvenience. Our team is working on a fix for this issue.",
            "date": "January 23, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Rohit Nigam",
        "comment": "Using web version for years and always missed having a good android app. This improved app is surely a wow with useful features like add + button, barcode and intuitive recent list. Just improve the search - it does not search keywords within 'my meals' and 'recent' items on app do not sync with 'frequently used'  on Web version. Sometimes you lose  saved items - does it say 'saved changes' too soon?",
        "date": "September 12, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSFNUOFFjUjR1aF9Gd3JnUjVEb1NsVnFqY0FYdE1MbU8wa1djLVVIVTRmb0p0NGEzQklsZUkyeS13MXlUVnNYLVpwN0ZzUTlUWDc5TnhiM0E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jon Rivers",
        "comment": "Cant use app. Need to have a Fakebook account, which I dont have or go through process of signing up with an email (what if the app sucks and i went to the trouble for nothing). Instead ill give you a negative review because - get with the times this is Andriod, why cant we just use Google account login?!",
        "date": "January 1, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSEp1b2xGajUyNXZhQk44VUJ4LWtaNTdoczFPSjM5VG5XQ2FKQlEtZk1BYldDdDJsUGJqMmRDU0huRDNaMXBUQTNpLVY4aE42SXdvTlBVTUE",
        "reply": null,
        "star": 1,
        "title": null
    },
    {
        "author": "Fjóla Kristín Bragadóttir",
        "comment": "I really like this app. I've only been using it for a few days now so I haven't really seen any results in terms of weight loss but it is wonderful being able to monitor what I put into my body. My only problem is the barcode scanner. I not surprised it doesn't work for me since I'm in Iceland. It makes sense that the app doesn't have a lot of the stuff available here as I'm sure there aren't a lot of users from Iceland, but so far I've only been able to use the scanner once. I expected the app to at least have some of the imported stuff.",
        "date": "September 13, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSEtmMlg3emx0VXJacTBBangzTEZXSUVQRHRRN3FyUU1VbDI4c3dIa3hxQlZRQk96YjJuclBKOHI2azM2Vkk5MGZuaFNqdjYtQVQ5THVHZFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Amanda Dueck",
        "comment": "Ive only used for an hour so far so im not sure how helpful this review will be but so far i like it! I think the only thing that would make it better, is if you made your breakfast, lunch, or dinner from a online recipe it would be nice to take those exact ingredients. Otherwise pretty good",
        "date": "January 15, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRUJ6TUtrWVRmU2psZlhkOFJMRGtITXJjWE5Vd3I0Z0JsZzgyQlcyaGV0U2ZZdXA0ZjluVk05bmxMeHNDSnYtaVUwU3NlelNZUEJldXV5Q1E",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Louis Fink",
        "comment": "All in all I really like the layout of the app, it's easy to use and pretty straightforward. There's a fair amount of options and features for the app, I personally enjoy the ability to choose what time of plan you'd like to do for whatever you're trying to achieve. One issue I've come across that's really annoying is when using the add food feature. It closes out and refreshes what you were writing if you minimize the app. Which is really frustrating when you're trying to copy nutrition from online into the app. If they could fix that issue this app would be worth 5 stars to me.",
        "date": "September 8, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRVFoVDgyc2NBbVpoaWwwczNkeGtweEFaXzNTZG1fWUdJYi1LenhJa2FOek52VC01UzdaOFlpVHJHekJCdlc4R3lPZk9INGh5TGd4czhCVlE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Katie",
        "comment": "Decent for a free app. Has definitely helped me keep track of the basics and is easy to use. It does seem to lack customization even if you pay, for instances I do 6 small meals a day but only allows you to track 4. Also have to really mess with portions to get the correct count can't just choose 1 oz of chicken have to enter 0.33 of a 3oz portion.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRnJ4ODZEMmdad3d4OTh1VEN5dHBwYlVZU3NCNl9HR0dLSDl6cXFwTnFRRXhXNFdUWmhrRnlIRlRiM09iYU5lQklOZTFHcndWM3d6ZnpuMnc",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Suzanne Edjang",
        "comment": "This is an easy to use app.  I've actually tried other apps and keep coming back to this one. There is functionality that I would like that is available with an upgrade, but I'm not willing to spend $45/year for an app. A one time fee perhaps, but an annual fee seems excessive. I'll continue to use the free version and also explore other apps that might bring more functionality I want at a lower price.",
        "date": "February 19, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSHhrWEc4QUlYZ1c3YUlvZDVwc1V6UTlyWkNWMnBVbEZpOTBkU3dJQnAzMGU3LThVUW1IWWY0UXh3MjRyekFQZ2Z4QnpFdVJBRzZYMHNRbFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Carol Grassman",
        "comment": "Not convenient to log amounts of foods. This does not give you an option amount types (ozs, tsp, cups, etc) without having to look at ALL their options. I have found \"Lose It\" to be more to my liking.",
        "date": "February 25, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRl93cHNJRVNMLWo5UEVIUUdjNTJqb3FONGRWUFg2US1rMDRLYXlfMmtFRWZCdC12X3ZoQVdPYVBLajd1TWxxc0dEeUVzUG5JSUktUHRmUFE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Gaile Rohde",
        "comment": "I love this app. It has been the best app I have found and it has helped me become aware of what and how much I was eating. It reminds me on my front page that I haven't done excercise because it says \"0 calories burned\" so I do some exercise and all is well.",
        "date": "September 7, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRlpWSkIwT2pydjVzNVllYmptTnNKNk1QeHVhYTdVY2dfbWpVM2NuQXp2THdHY1hzSEJ6SFZSU0VRR3VCbm5GNThtYlA0Tkp6UzBHLXFKcEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "DJ Dixon",
        "comment": "The basic function of the app supposed to help you effectively create great workout and diet habits. Now they have taken away the burnt calories portion of the free app. So the greatest part of this app that was initially free you have to buy it now what's the point in having the app?",
        "date": "December 3, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSDk1VU1RSFd5enZweVZJRjFwU2ZSZVVmZ2gtUXhEakdkTFYxdUtSTkVrbVRBNVpNMUdtZkxvaWotZHM4N0pzUzJHdy11N0YwQzY4Z3RaeXc",
        "reply": {
            "author": "LIVESTRONG",
            "content": "Hi DJ Dixon! Tracking your calories burned is still completely FREE! Please email us at support@livestrong.com with any questions.",
            "date": "December 5, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Veranika Liaukevich",
        "comment": "Beautiful, simple app, but lacks a significant feature  I really liked the app's look and feel: clean, simple, yet beautiful. However, for every ingredient it has only one unit of measurement and you can't use others. For example, cooked rice is measured in cups and I can't add the needed amount simply in grams.  Such high hopes, so much disappointment.",
        "date": "December 15, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSEwtR1FvVnl5SlE4Y0dqNERYb3dsS1RqUUZQRFdGUmllRmJYT1V4VVEyTldJQkFrSHdoZDE2OXFYZWNDaU83OHFWMXBlajNuaHJiM3NXcGc",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "jamie childers",
        "comment": "I absolutely LOVE this app! It keeps track of pretty much everything for me. The graphs to see your progress are a great plus! Also, the option to speak with other people who may be doing some of the same things you are, or struggling with the same things, helps tremendously! I HIGHLY reccomend this app! Great work devs!!!",
        "date": "September 13, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSHBQaGtfWFV6S0ozRk9FWm9uS0t2WGUwM09EallzcUNMX1hueG1oSlhEVlk3ZTI3NnEzMVRrUk5nMUl5WGtRVDg3ZE9VQTAwc0N4Zy1BOFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I find it simple and pleasant to use, but it needs a few improvements to earn 5 stars -a favorite foods list, a working recipe bulder, and options for portion measures.  The barcode scanner works well for me.  The physical activity tracker overestimates calories burned, so I don't use it to track activities.",
        "date": "February 26, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSGs0TVhzeUNvNFNtLWhkb0RVWjBYZzdLd184UFVSaDN4UXg2bmRtSzU3MWJMbmJPT2JKVWdiN2ExdGJIXzNhQ1p3SUs3SXVrT2hMZzJHeEE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "T Franklin",
        "comment": "Great app and offers lots of features for free that similar apps charge for. Food library isn't too good so having to add a lot manually but I guess it's more accurate that way, therefore. It necessarily a negative!",
        "date": "January 16, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSEg1aWs1U3hnclU5aE5Wblc4UEk3TngtWHFHeUprZEFPRFBZNVVUN01ITTc3c2pCeml1cVBZeWdfeEoxNThyY05xeGtvRVBEODlDZEtOLVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Jay Hahn",
        "comment": "Great so far. There were a few things it didn't recognize when scanning bar code which is disappointing.  Also I had a mini bite sized snickers and when I scanned the Barcode it said 4 pieces was the serving size however on the bag it clearly states 3 pieces. Not a big deal but makes me wonder what else might be off. Still a great app though.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSHMxTF9oQnBPUEh1ck1TajNXMU1mOGFWOHVRQUZQV3U3U0xHa3pQQmZfa20ycTBaRnhrcExIZy1iZWVaYWRqd1QtZDV1cGZJSnR6S0NoV2c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Christopher Chin",
        "comment": "I had begun to lose weight before using this app. I had gone from a low carb diet to a modified CICO and then I found this. Now I feel fat.  And it's great.  Update: Found some bugs like sometimes not being able to remove certain foods from meals. I've logged out, restarted my phone, and now I've uninstalled the app. Hopefully it'll work after this reinstall.",
        "date": "September 29, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSGdybHNhUUFxcFFVMUpzYzNERnZiTHNMZFk4cUlFTldTNHJEVEVYeHJkRG12MWNKeUpadXN4ZDhCV0RFRTRHTXF3Qi1VR1g5c181NFdJQ3c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Alex Vidmych",
        "comment": "Buggy. Lost all my data when traveled into another time zone. Entering a new meal is such a pain. Doesn't support split screen. Search gets stuck on the first thing I searched for and keeps going back to it. Otherwise decent app. More features and less ads than MyFitnessPal.",
        "date": "February 27, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRlNqNGhha3R3Q0hWUzZ2U3VMRmkyM3UxckVkN1NlTmRHUFlheGNPYS1WM0ZCdjZpYlN3QkRxMjJpYjQxNUluR0NqV1RXSlJKSmpVclozb1E",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Leela Siecienski",
        "comment": "I'm a high carb, low fat whole plant food vegan and I'm so grateful that you can customize micros and macros to actually healthy amounts! I've struggled to eat enough calories in the past and this app helps me make sure I'm not accidentally under-eating.",
        "date": "March 1, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPR2R0blA2UEdFQURpa3RPNjVka3prR3k2RWxlSXdPT2tpTW9UREpPM1dvMEs0WmV5TGU0SW1lRmRnSUdwQ0VQREgwam1aQk0yRlpGaXZOLVE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I just started using it. I've been in recovery from a restrictive type eating disorder for 3.5 years and I'm hoping this app will help me stay healthy. It's hard to find some food items on the app, but it is doable so I'll keep giving it a chance. So far, I've had a good experience with this app.",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRUhsVGhoUS1DWS1yckRHZXJ0VWtzdkVLVHlPRkpvZE9ESDVSZ2tnX2t6bjM0NTdwckp5b2Ywd19XUjBsaC1HWmRBRVNOYTVxRDl4YnROLVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Taffy Thomas",
        "comment": "Update: Livestrong Customer Service said they are working on the glitch and helped me reset my app. I now have all the historical data. They were  great! This app makes dieting and staying on track super easy. Get it!!  I love this app, but when I have to turn on airplane mode, all data is wiped out. Submitted an online inquiry and got no response. Extremely disappointed!",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRVEwcFlDZl9ib2hGTmhBY1hGMVh5NWRYdWJtcXZQTktySzJLR1RHY1J1b3RNWmI3cWFMLVV0TVFYXzFYRk1HdGY0VzhOV21sZTdzc0I2Snc",
        "reply": {
            "author": "LIVESTRONG",
            "content": "Hi Taffy! We're so sorry this has happened. Please email us directly at support@livestrong.com so we can assist you with this.",
            "date": "February 27, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Jason Nordwick",
        "comment": "It lacks basic functionality like copying meals from one day to another. The recent item list in only about 10 long and not organized. The barcode scanner doesn't work nearly as well as other apps. The calorie estimate for exercise are much different than what you find online. Too many problems for what is essentially a very simple app.",
        "date": "November 13, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSFlkRzJGX2ttZXJrcWt6NUF3OGpjYzdVX095Mlg1UTlSQTVfZ3dHYUlHZXJ5YjlNUU9TLTdhR3IyMkoxbzlpRS1pQmdBYnhwV0lKVXl5U2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Tearshia Realta",
        "comment": "So you can't change the carb goal. It only lets you change protein and fat goals. The carbs are set at 40% and it will not allow you to change them. I quickly uninstalled this app. Searching for food on there is a nightmare and brings up just about everything else but what you are looking for. For example I typed in coconut oil and I get every other type of oil and had to go through about 20 different oils before it showed any coconut oils. Do not install this.",
        "date": "February 18, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRmxDOFF4NnJWaml6N0tTRGUwM3B3bzJmcFdPWVEtRlB5aXhmdFdTN05INVlIV2RQQ0RZbEluRHpsWVVsYllobTlZa3RfNzk3Sm41SURnN3c",
        "reply": {
            "author": "LIVESTRONG",
            "content": "Hi Tearshia, we're so sorry for this inconvenience! Our team is aware of a bug with the carb macro goal that is affecting a small percentage of users. We're working hard on a fix!",
            "date": "February 21, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Benson Gee",
        "comment": "This is a very good app. I really like how I can keep track of the calories that I am putting into me. I have lost about 22 lbs in about 4 months without doing any exercise. I plan to start working out very soon to tone up my body",
        "date": "September 7, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRjJ2QTJEN051US12UDBrTXVwVFRFczIxN3hvVG84SUU0V0FNa1VJRXNoRlBDdXVWdVo4a3l0Nk1ibVJpYWl0Y2RqNFZrZTBwcDBJVldPbVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Alexandra Avila",
        "comment": "I like the app layout and how the daily review shows me all of my daily nutrition facts however the food search needs to be worked on BADLY it is awful. I can never find what I'm looking for by searching with words and sometimes even scanning a barcode doesn't work. Once the search results are better I will give 5 stars",
        "date": "February 12, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRTJYMVA4eHZMSlE5T2FNSE9iM1g5UWpoOEprWl84S3I4Y3lGclVLTjFrSUVaSmtRajdqVXRyVFQtaUtvTWRQOWNqQVhmT2tsS01zNHA0cFE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "P Harris",
        "comment": "It's too hard to delete things - the gui is a little underbaked, probably since there are so many features that its hard to prefect any of them.  The barcode scanning is awesome, as is the food database. But for a $45 a year app, it should be easier to navigate. Expensive too!",
        "date": "January 9, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSDdPRGV1MS1IbVRmam1MZFhVNFJNbEZYMzNqRWhIOFdxbUlXNkZYWVUtODh1VXFjeW5kT2lCb3FiYjVBZ0RkZFRPSERHRzFET3JGY0RndEE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Sucheta Sirsikar",
        "comment": "I need to cut down on what I eat to lose a lot of weight in a short time along with excercise. So this helps me track my calories perfectly which in turn motivates me to control what I eat and how much of it I eat. And due to this I am already seeing a difference in just1 week which clearly indicates I was overeating and never knew it. Thanks to the app, now I know😃!",
        "date": "February 2, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRUlBaXYwTlpzY3BtYi1vWmxEaWlTTXJyRk1hRkZlcmd1LW5WQTNxN290al8tWXBWdnVOSENCT2R6RnNRZ3ZkZEY5emFSYlpiNkNGdDZYdGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Maheen Khan",
        "comment": "I have only had it for a few days and I can already tell that it helped me so much. I don't eat a lot of known food, so it helps that it has so many variaties that you can log. I needed this and it's the perfect app!",
        "date": "November 5, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPR0k1bWtuUEc2LUQ4YmxDbDdsMmV4ZGozRDNqUndtb181LVRTVTRvX3BHLUxrcGlXMEswWUh1blFvZUN5ZzZWLXljdGwzY08wU3FCcjBJdnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Logan Avery",
        "comment": "This app is kicass- super easy to use and has great features. One of my favorites is the exercise add-on that accounts for calories burned, ergo you get some calories in your day back! Plus it links with Google fit and can track your steps. Lost 20+ pounds so far and this app was key.",
        "date": "February 28, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRlljaV9UV3otSVE0NHdQVDFOUkNXZ1ByMXpjdjByZ3Jqak1MSjc3alVPV0dtZUpLWXRNZk9OZzdVeHcyV1RVb2h3UVpHcjdFaHNSN2ZTdXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jeff Emmerson",
        "comment": "This app helped me lose nearly 40 pounds and get in my best shape and Dr. Recommended \"ideal target weight\" at 41 years old. Never again will I allow myself to get heavy!   SO much more energy for hard workouts and life now! Do NOT settle for less than stepping into your own greatness!   As a newly published author (Beyond ADHD), this has helped me take my mental and physical health to the next level!",
        "date": "September 7, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPR1FHbUozMGlPQzBYQy1QLTA3M1ZhS2ZiWGhRVFYzOEFYMTVFam1uRHNxc3VvRVR5MzdEanUyWExFazZ3dW1FcExDS1pRMlFQbmFvSXJsUHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jeffrey Portouw",
        "comment": "Can't enter your own custom foods. At least half the stuff I eat isn't in their library, and the closest thing usually differs by 20% or more. So it's pretty useless for diet tracking.",
        "date": "February 13, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRkx0RTdueDBZeXZ2TTVmLWc5djRjbDc3Z0NYUGl6eHZPM2Y2ck5fVEJrTTljWFhQSTdxaEVpNmg0T2htQmw1QjlrcVo1ZXBEMnZlTlpONHc",
        "reply": {
            "author": "LIVESTRONG",
            "content": "Hi! You can enter your own custom foods! Tap on the blue plus sign. Tap the meal you'd like to track the custom food to. Then, tap \"My Food\". Next, scroll to the bottom of the page and \"Create A New Food\". Enter the name of the food and the nutritional information. When completed tap the check mark in the upper right corner.",
            "date": "February 13, 2018"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "amy norisya",
        "comment": "wow! believe or not, i just lost 4kg within 1.2 weeks by using this app to track my food calories intake. It helps me alot in choosing my daily diet with balance healthy food. I choose recommended calories intake and I'm less active person. I'm also like the features which is so straightforward and easy to use. I hope I will get my ideal BMI within time plan.",
        "date": "November 26, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPSFM4RGJ5Q1lNSmJkSUNQUDFxWUlxTjBib0ZiVjFLYi1sSUUzZ3lDdDctc2N6YjRqSHoza205SVNuUFY1X2lQLWNxRURiN2JGYWE2LVBRRHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rohana Purcell",
        "comment": "Don't waste your time. I have tried logging in to no avail. Have tried to reset my password numerous times, still nothing. Even emailed developers to ask for help and got no reply. If I could give 0 stars, I would.",
        "date": "January 31, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPR0xDdFVaWHBiZ18tWVo4dlcyR2MxWkh3S3k5TDBSeEZFV0dURDY2Z0hwa2RaMDdBd2JpR056eHFsVVN5QUcwbHVsSzlhaVRINUFqT1U1UHc",
        "reply": {
            "author": "LIVESTRONG",
            "content": "Hi Rohana! Have you emailed us at support@livestrong.com? We can easily reset your password for you. So sorry for the inconvenience!",
            "date": "January 30, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Tori Gibson",
        "comment": "I LOVE this app!! It's the only calorie tracking app that really works for me. All the other apps don't have all the food I eat already stored there, so I have to manually put my food in and say how many calories/macronutrients it has. Also, all the other apps didn't even have the correct amount of calories for simple things, like fruit & veggies.",
        "date": "January 11, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRlFVSlJLQXJoS3VPZlROQ2VjMEpIS21tRHdhNnRTdDZXUnU3SG8xdVdZZzd5dzdBVVkyazBKUGVuanFUYWhqdmoxN1Vha0dvbzdlVXN5a1E",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rebeca Torres-Rose",
        "comment": "So far so good.  One thing I noticed is that when I did an African dance workout and entered it, the steps I took during that workout were also counted by Google fit.  So isn't that going to skew my Cal count?  Also, the options for dance exercise could be expanded to include African, salsa, etc.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRVpYbHNyUVhOckJvWURDUlVpeWNHeVphM2FabzBtbFY1a2VJVGRvTEo0MFdkSE5jVHpvVFhZajA3NUxjZjJKRHpzdS0tbm9OZzV0TVR2Tnc",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "",
        "comment": "A great way to keep an eye on your calerie intake. Simple to use and a straight to the point app. Other apps have too many bells and whistles. I love that this app doesn't over load you with options that are not necessary.",
        "date": "December 1, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPR3NMbUNKMkhCck9hZk1vMXNfYUF4eEtxREZ4NlhpajZ1aG4wR1E3SV9QV0RYbVIycUNUTUxMLXYtNklCYUctakdCb2ljVWxYZ0JORlVvdUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Jose Gayta",
        "comment": "I really love this app and been using this for almost 2 months now. However, there are 2 bit annoying things I encountered so far. It sometimes autochanges my weight to 0.0cm making my calorie intake lower and messing up my calorie rate chart, and adding up new food closes automatically upon minimizing or changing tab. But overall, good job on this app. Looking forward for the improvements!",
        "date": "September 17, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPR19KeWx0Q2tyTlUtMk9fRHJyRHp5Y1hwRVVQR0k3ZWczRzZnUmEzWG9LMnY4WjNod2pGOVVHczgyVzBkVHFiczZOMmVnTjJQdGptaHZSblE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Marcos Lujan",
        "comment": "This app is pretty good in terms of being able to track what you eat, but I'm having the same issue someone else mentioned. My calorie goal will not update when I try to adjust my goal weight and choose a calorie plan. I have the option to pick a recommeded daily calorie plan, but when I select it, my calorie goal won't update to reflect it. It gets reduced by 1,000 calories for some reason. Why is this? Pretty frustrating.",
        "date": "October 13, 2017",
        "permlink": "/store/apps/details?id=com.livestrong.tracker&reviewId=Z3A6QU9xcFRPRUIwLWNuQXhPWFRxa2ZnNUR5cGgyeFVNSEtjeENRbk01UzV6S042dS1XY1BKdGcyU2p6eDZ4M3hxUzNIZTF6aUE2MXVNM0J0NlQ1V1F0V3c",
        "reply": null,
        "star": 3,
        "title": null
    }
]