[
    {
        "author": "JP Laloux",
        "comment": "I have been using if for few days and this is just the perfect face to go through you working day. The creator also added calendar view on ambient more few days after I suggested it which is nice and terribly practical to quickly see how your day look like. I use it with my business calendar synched to my phone from Outlook. By default event color was red but I used the app 'calendar color' to change it to a less stressful color.",
        "date": "February 6, 2018",
        "permlink": "/store/apps/details?id=com.tobotec.wearable.agenda12hwatchface&reviewId=Z3A6QU9xcFRPRVFhYTBEVlFGaWFMS2xnblZBeHNVWXBUUklWY0I5ZVY3UDhrdHVhelhqc0hQcEtTQ0tBN25zdGVxYmRRTHhWS2pWazRvUUtQVjhOU0FMUnc",
        "reply": {
            "author": "Tobotec AB",
            "content": "Thank you! I can add that I have contacted Google regarding problems to read categorized colors in Outlook and hopefully they will come up with a solution that will show all colors correctly from Outlook.",
            "date": "February 6, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Adam Kouse",
        "comment": "Pretty darn good! If options to   tweak a few more things were there, it'd be perfect. I still use it for my daily watchface though.",
        "date": "December 2, 2017",
        "permlink": "/store/apps/details?id=com.tobotec.wearable.agenda12hwatchface&reviewId=Z3A6QU9xcFRPSGVHemV4aDRMRm1sLTFJTC0yQlFQTnVQWEJONl9NLXQ5bW1OLXQ2bVJwc2M1MVJtS3liWU15YjlscnJWTDlicmpoZHJxVVlTUjh0SGNBX0E",
        "reply": {
            "author": "Tobotec AB",
            "content": "Thanks for your kind words. Please be more specific with what you're missing, it might already be on my to-do list.",
            "date": "December 2, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Nolan West",
        "comment": "Great concept. Would like ambient mode to be all digital no analog.",
        "date": "August 16, 2017",
        "permlink": "/store/apps/details?id=com.tobotec.wearable.agenda12hwatchface&reviewId=Z3A6QU9xcFRPSFFzN1FTOFhzWXkyQ0IzRks5SkZuUG1wbHFCVlJvSThFdnhZME85RlF3VUxJMEhBV3FVMXpuellsaVNjMVZzZXpLN1JrcGpPamhEZFVQWlE",
        "reply": {
            "author": "Tobotec AB",
            "content": "Thanks. Suggestion noted!",
            "date": "August 16, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Alyssa Eymard",
        "comment": "Does exactly what says it does.  A few suggestions to make it even better:  Maybe make it free and then add in a pro paid version where people have more options. People are much more likely to buy an upgrade when they can try it for free first.  Would be nice to have an app on the phone and to be able to change some things like font size, colors, etc. Especially if you could change where it shows the date because in practice it's not easy to see at a glance.  Since it grabs your location anyway, maybe change then background to show the weather? Like clouds over the sun or whatever. Doesn't need to move or be interactive or anything complicated like that.  Would be amazing and perfect if you could put what I think are called \"complications\" where you an add in weather or sync with Google fit for your step count.",
        "date": "July 7, 2017",
        "permlink": "/store/apps/details?id=com.tobotec.wearable.agenda12hwatchface&reviewId=Z3A6QU9xcFRPR2JrN2tfQkJFUEhFdjNmUTJJc0tvMHBHZzl1RzZHcy1PNm9TNWxPUFVTc2dmYTMzNzVVQ3RSSDlfVm5DRXhrTmR3Y0wyellvVUF4LWh6TXc",
        "reply": {
            "author": "Tobotec AB",
            "content": "Thank you for your input. Your first sentence is the best review I could ever ask for!\n- True that about free and pro versions, I'll give it a thought. \n- The options are coming but it will take a while.\n- Regarding the date issue I recommend turning on \"always on\" mode, I assure you the date has never been more visible on any watch face. :)",
            "date": "July 17, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Peter Mortensen",
        "comment": "Calendar events are not showing correctly, but they are in other watch faces. Other than that, looks very good but ambient could use a bit more agenda information and a digital clock too. Also, in general, option to hide minute and hour markers and some countdowns until next event and remaining for current event.",
        "date": "May 22, 2017",
        "permlink": "/store/apps/details?id=com.tobotec.wearable.agenda12hwatchface&reviewId=Z3A6QU9xcFRPRlE5SU9KQjJMNFZzd0J5ekxKU1NBa1hiQ01YWFJZbmVIVmwxN0lHclhyWTVJdEt5NkFnVWRWWFY5TTNwcjhZME02eElEU3BRWlcwZl9CZHc",
        "reply": {
            "author": "Tobotec AB",
            "content": "Events are now shown correctly, other watch faces used other fields for the query, the fields I used were removed by google without any warning. Not too happy about that...\nDigital clock is now in ambient mode too (from v1.2.8).\nOptions to hide markers now available i v1.5.",
            "date": "October 22, 2017"
        },
        "star": 2,
        "title": null
    }
]