[
    {
        "author": "Warren Black",
        "comment": "The watch faces they have are mostly decent, some are very well done. The problem is there just isn't enough of them. Not for the price you pay per year. Also, it's taking a very long time for them to fix the coming soon no connection issue. So at the moment, not only are you stuck with a limited number of watch faces to choose from, but there are zero new ones coming in. It's been like this for nearly a month. This app could well be one of the better ones, but still lacks in a lot of areas.",
        "date": "February 1, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPSEl6Wno4T0U2Y0tVRVRwbzRBcEc1X0VCQzQ2MWxvUnlQN1RSRjRqTGJSWlNVeHk0MEplSUhzZ2pzTVVwSXFDSDNTV3NTTHZGeEpJMFNkZ3Bv",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Warren. \nThank you for the feedback and we are again very sorry for the inconvenience. We are currently aware of the coming soon page issue and will be updating the application soon. Also on your feedback about not enough watchfaces, we will upload more wonderful watchfaces soon! Please wait for us. \nThank you again and best regards.",
            "date": "February 4, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Jimmy Steiger",
        "comment": "Love the watchface designs \"the classyness of them\" wish they had more of a clickable interface.. I would be giving a 4 Star review if almost every month now it keeps on telling me in no longer pro & asks me to subscribe again... even tho I'm subbed till 10/10/18...? Please fix this issue & I'll up the review",
        "date": "February 20, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPSDB3VFpaRS1tOWNWcVdRQjlXQ19sQlkzVEdONFY3SVVoMEFSdnktX2FEVmtmNU50ejhscVV4bTN4Sl8tVmQzMVdLT2Q3QURfWU5ROTBXSHNZ",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello there. If you have purchase the subscription from Google you must install the WatchMaster from Google Play store. This goes same for Samsung Galaxy, you must install the WatchMaster from Samsung Galaxy app store. Please delete the current WatchMaster and reinstall it from the app store where you have purchase the subscription.",
            "date": "February 21, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Sunil Kumar",
        "comment": "It stopped working with the new tizen 3.0 update. Please fix the issue. I love this app. Thanks for the response. But it doesn't detect my watch..",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRS1hVzU4ekZXZHFSNU9UZjVZWFo0LW9rb2cyTnl1cE5XS2dPdkZpNjRUT2hnekwyelA0X2s3NTM5Z2diSnVDNFQyZnhrbWtRcG1mWXNDbE9Z",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Sunil. Thank you for the feedback and we are sorry for the inconvenience. Please note we have already fixed the Tizen OS update within WatchMaster. Please delete your current WatchMaster for Gear S2&3 and install it to WatchMaster for Tizen or make sure you have updated the companion application. If needed help :ask.watchmaster@gmail.com.",
            "date": "January 24, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Barry McKinlay",
        "comment": "One of the MOST expensive watch face apps and has the FEWEST faces. Totally regret my purchase of $16.99. Basically the same number of faces from 11/2016 (approximately 400). This app is NOT worth the money.",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRXNBbGc5Qk14MVBUc1huZ0xCclFIRDJ1enN2TTVBWXhTOTFvcWFiamZGOTdhLTdSUTdLME1IN2FZTkhYWkFtNnM0a2thdzRCbXlKWXRTOGZr",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Barry. Thank you for the feedback and we are sorry for the inconvenience. Please note we have been updating with new watchfaces before and more will be updated soon. If you have any other issues email us at ask.watchamster@gmail.com. Thanks.",
            "date": "January 23, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Agustinus Huang",
        "comment": "Coming soon watch face error conection, please fix it",
        "date": "January 25, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRUFScTI5Z2hQSnBrR3c4cWZUem5PSm9lMDJzd1otaHBFZVROZXdPdVd1b3dLTHo5cUNkQ0I3WWM4RHBieUVwUl9jZFJ1TDdZTGxOUDFqZnln",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Agustinus. \nThank you for the feedback and we are sorry for the inconvenience. We are currently aware of this issue and will update the application very soon. Please understand the circumstances and wait for us. If you have any other issues email us at ask.watchmaster@gmail.com. Thank you.",
            "date": "January 25, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "kurt royston dos santos",
        "comment": "After the last update coming soon watchfaces cannot be seen",
        "date": "January 23, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRUpzX01WZ0dfQVlVaGdDeGlWM2tmZ3lwOGRJODZnM3k5UTJkSl80Zlp0eWZDU3BQbk5tdkNBaWJ3UnZJYkZfY005a1Fwc0JwZDBiQUU0N2dv",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello there! \nThank you for the feedback and we are sorry for the inconvenience. \nWe are currently aware of the issue and will update the application very soon! \nPlease understand the circumstances and wait for us! \nAlso new watchfaces will also be updated soon. \nHope this helped, if not email us. Thank you.",
            "date": "January 23, 2018"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Harveet Sehgal",
        "comment": "Bring back full subscription.",
        "date": "February 11, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRVZwSlBTdHBOcmF2YTJOY0o3RU5XbnZhdi1DS1NwMVpMc3V0WG8wVDI0Y2h2ZTN0TGZBLWp5bDl6d2pGUkpvYjJkX2ZLeEF0SnlMSEVHeXA0",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Harveet. \nThank you for the feedback we are sorry for the inconvenience. We are still working with the team to bring better solutions and services for the future. Please understand the circumstances and wait for us! If you have any other questions email us at ask.watchmaster@gmail.com. Thank you.",
            "date": "February 11, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Duy Tô",
        "comment": "Good",
        "date": "January 21, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRWtRS21WZXFQZHo2VUt6bUZnaHpYQS1VN29CVHdZSm1GS3paUEFObmRyMlM4S0FpOG5GRVppdFlxMTlILW1rY21CZlhhRl9zd3ZNTEktWmRB",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello there.\nThank you for the feedback and for rating us :).\nWe hope you tryout our other watchfaces as well. If you have any problems or issues while using our app please email us (tizen.watchmaster@gmail.com) and we will be happy to help you out. Thank you and best regards.",
            "date": "January 22, 2018"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Adam Nail",
        "comment": "I have been using this app for over a year now, I just tried to apply the N-on watch face from a new designer. It crashed my watch so bad that the app keeps stopping and restarting on my watch. I paid for premium over a year ago and genuinely enjoyed the app but this experience has completely ruined smart watches for me. I tried everything, even re-installing. EXTREMELY DISAPPOINTED.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPSDRiWnVvcng2QjRheXlqWUFSbmhCbGdFa3dRdzA2aUpBR1hDV0FyS0lnOHc4ZE84dDFJeEtKbmhUVVdaNDhVZk1GNkc5TFhBcVhJRTZxd1p3",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Adam. Thank you for the feedback and we are truly sorry for the inconvenience. We have notify the developing team on this issue. But in order to help you solve this issues, we need information on your device. Please email us the details at ask.watchmaster@gmail.com. We will do our best to help you out. Thank you and best regards.",
            "date": "December 5, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Rick L.",
        "comment": "This is a great collection of Watchfaces! In my second year of subscription & will continue to subscribe... Quick to catch and fix any problems with their app!  Why did you suspend unlimited subscription? I will gladly pay up too $15.00 a year for unlimited access!!! These are some of the best Watchfaces available!",
        "date": "November 27, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPSGtkWUpGWWJzcWtwaHVQd1VwbFhmdjBTa3JEUXItNjdaeHl5ZFM3U1BDamNmTWw0YTRYY2NQRGdzSkl1cUV5bVdJeFBzMEpmRWxSSWlFOHJN",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Rick. Thank you for the feedback and we are sorry for the inconvenience. We will be uploading details of the unlimited subscription soon in our WatchMaster app' notice section. We really thank you for the support! If you have any other questions or issues while using our app email us at ask.watchmaster@gmail.com. Thank you.",
            "date": "November 27, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Bee Banks",
        "comment": "I use to love this app. After the most recent update, I am unable to install faces on Gear S2. Extremely disappointed.",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPR2VUUEtjN1IyY1NKVEJzSW4zY054TW1VekY5Y3JfODJlQlphZlBhaFRjV214M2lMZkJIZjhhWGVIODB2WVBCQnUtcmJiQ2NXajl2aEE4Zjln",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Banks. Thank you for the feedback and we are sorry for the inconvenience. Please try deleting the WatchMaster for Gear S2 &3 and reinstall it to WatchMaster for Tizen. Also double check your connection status on both phone and watch. If the watchface is still not applying email us at ask.watchmaster@gmail.com. Thanks.",
            "date": "December 5, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Michael Lewis",
        "comment": "This simply has the best watch faces you can get on android wear right now, and its so awesome! I love the animated watch faces so much and I love being able to switch the watch faces from my phone. I just wish there were more digital watch faces. I strongly prefer digital to analog. Besides that its an amazing set of watch faces.",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPSERBMFU2WHRfTDJYRE90ekJ0ajlVNUEwRktxNGlqNEQzemJhSVRjRzF2OVFxMXRkNDhPUzY5MnhHNmF1STJ6RVlDZDBtSTJnQTVsblEybUNF",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Michael.\nThank you for the feedback and for supporting us! :)\nWe will be requesting more digital watchfaces to our designers and release them as soon as possible. So please stay tuned! If you have any other requests or questions while using our applications please email us at ask.watchmaster@gmail.com. Thank you and best regards.",
            "date": "December 10, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Cedric Yeo",
        "comment": "The designs of watch faces within the app is very good and beautiful, but the authentication to login is a hassle. It keeps logging me out saying that there is an authentication failure and when i tried again, it just keeps loading.",
        "date": "January 3, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRnRNcFQwaVAzY0xXN3A4blNaNklYeW1XdTNnSzU1bzIyVUlOWnZiVGtCcEJBdnprczNtaUc4dXVSby10MmNyZkhHMTJ5MmxaOGZiVlhuYU1z",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Cedric. \nThank you for the feedback and we are sorry for the inconvenience. \nPlease try to login for few more times . The authentication failure do occur but eventually it will let you login. We are current aware of the issue and will be updated on our next update. Please understand the circumstances. If any questions email us! \nThank you.",
            "date": "January 3, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Žygimantas Stauga",
        "comment": "Watchface doesn't automatically change timezone while traveling. Need to reapply watchface every time. Watch battery doesn't work anymore. Only changes when reapplying watchface.",
        "date": "December 4, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRXowUUw0N0NaZEZ4T1pZUWZ4YzdTcjZta0dyQTFIakJkSVlGSEN1bXg4ZFItZ1AzbFEwMnBEbWdMa0x5cVZJaHVkeUd0ckxuMUZnUWJ1TWNJ",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Žygimantas. \nThank you for the feedback and we are sorry for the inconvenience. We currently don't have the feature you are referring to, but we will meet with the team and discuss upon your request. For now you must manually change the timezone. Hope this helped, if not email us at ask.watchmaster@gmail.com. \nThank you and best regards.",
            "date": "December 4, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Richard Stewart",
        "comment": "I would give a five star rating if I knew how to remove notification icon for watchmaker on android zte quartz  (the little gray and white bell) 🔔 on the watch display",
        "date": "January 2, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRU5XRmlIXzdkLWk2Z2paNkdsMWR2UTBYNk5SRUhIY1QzcnlVdWpRenlTWGtVSUdBbmJ0NTUwSV9lSGRjUG5MWU10bGVXX1J6bExOWXpnU3JF",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Richard. \nThank you for the feedback. Please note this is WatchMaster not WatchMaker. Also the push notification can be manageable from Settings. Hope this helped, if not email us again at ask.watchmaster@gmail.com.\nThank you and best regards.",
            "date": "January 2, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Peter Giordano",
        "comment": "Garbage app. Half the faces don't work well.  Save your money",
        "date": "December 16, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRW9XOXozSDE1c29lZWRHN1BCcHEwc2c1aUFVdDF4NEpYSC1XeHdCRF9zN2YwWXJxX29kc2tjeVdMQUdfbEhsUmk3UjRIbGFUQmR3YXdyMFMw",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Peter. Thank you for the feedback and we are sorry for the inconvenience. If the watchfaces are not applying you must double check your connection status. Also please email us the list of watchfaces causing issues to ask.watchmaster@gmail.com. We will investigate and update them if the issues are found. Please get back to us. Thank you.",
            "date": "December 17, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Judah Brungard",
        "comment": "Crashes my watch. It pissed me off. Dont get this joke of a app.",
        "date": "December 27, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRU4zUU1VSjdCSE5FVWZ3LTlGYXltSkFwNWFLRGlHX2VSa0lPX25janJLZkhqYlpGdllBMS05bFV6czVXamhBeVVTdUc3TTFZX1lzajdFWTZ3",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Judah. \nThank you for the feedback and we are sorry for the inconvenience. Please email us the details about the issue you are referring to and we will do our best to help you out. (ask.watchmaster@gmail.com) \nThank you and best regards.",
            "date": "December 28, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Saahir Kapasi",
        "comment": "Hey, the watch battery doesn't seem to work on any watch face. The phone battery updates but my watch shows 95% when it's actually at 20%",
        "date": "January 14, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRmJfYTVIOVgwTVoxTFJDQ3NGeThIMzQ0N0o5SmtsLThPQkZKMGF5aHp4cjd5TnN5WUU4UUhselhWVWhZay0weExHdWJjX1FjZThETlJDQmRN",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Saahir. Thank you for the feedback. Please email us screenshot of which watchface is causing this issue also check if other watchfaces are causing the same issue. Because from our devices, the indicator seems to be working without an issue.  Please email us at ask.watchmaster@gmail.com with details.",
            "date": "January 14, 2018"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Sampheap Say",
        "comment": "Great collection of premium watch faces. The issue is it keeps asking for premium though I am already subscribed.",
        "date": "November 27, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPR3BDeHk0Q1FMTGJBSUJrY1dHMFQ4RjVoT0NPSVN5QUdCWlhZejNhdVpVeDNKUEVoTmhkbW1LWE9PSVhhX3VYd1hPYmxtUEFKUGU4S0pFQjJV",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello there, thank you for the feedback and we are sorry for the inconvenience. In order to help solve your issue we need to know where you purchased the subscription from and name of the app store you downloaded the WatchMaster application. Please email us the details, ask.watchmaster@gmail.com. Thank you.",
            "date": "November 27, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Kalman Sakal",
        "comment": "The best watchfaces for Samsung Gear S2/S3 users - anywhere! Also, fast and helpful customer service! Keep it up guys, you're the best!",
        "date": "December 5, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRV9acGxFeGpfVkh0bUtkQ1VhbmRKZzg0SkRFcFVvV3JXVUVGTHBhZ05fNVVlUTRLS3B5VDVCWThTbzZGNENGeGVBMGRBak9vZHFUU0ZGcW1N",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Kalman thank you for rating us and for the support. \nWe hope you enjoy, more watchfaces will be released in the future so please stay with us. If you have any questions or issues while using our app, please email us at ask.watchmaster@gmail.com and we will be happy to help you out. Thank you and best regards.",
            "date": "December 6, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Emrah Bolat",
        "comment": "It's not working with gear s3 version tizen 3.0   edit: I reset the watch, and the app is working now thanks",
        "date": "December 20, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRTdXb3BBZEV0engzMzBGS2FvRk12b1UxU2Vuczk3b3c3ZmdZeS1LY2RXT3Y2al9YaFRQYTZYUDVzUGhYTmtHeDZ1NjYzZlctaVhGSGxka2Jr",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Emrah. \nThank you for the feedback! We are glad that the problems are solved! If you have any other issues or questions with WatchMaster please email us at ask.watchmaster@gmail.com. \nThank you and best regards.",
            "date": "December 20, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Mickey Tanasijevic",
        "comment": "A very good collection of watch faces that look great on my Samsung Gear",
        "date": "December 4, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPR0hRNU8tT1U0RTZnT2FXdXpiWGdHNGFiZEwzUC03WXVUS1hwMC1kdEd4TGFaWDJuLTE3MUJfcGVqOE1YbnB4dHQtWE1KUmZrb2VNSENwX3NZ",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Micky thank you for rating us and for the support. \nWe hope you enjoy, more watchfaces will be released in the future so please stay with us. If you have any questions or issues while using our app, please email us at ask.watchmaster@gmail.com and we will be happy to help you out. Thank you and best regards.",
            "date": "December 4, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "karthik Steve",
        "comment": "I Love watc master..and all designer who develop watch.. Really love it..made my day dalily..",
        "date": "December 10, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPR3N2WlYyZFhRRFBYa19zQ196MllZZnRoOEhaYzMyX3dhUEpiQmRfNjBWQlZBclJFZ2lOS3hJd3VybF9WaTZvWjlydW00ay04Q0pQZ1hhX0tr",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Steve. \nThank you for the feedback and for rating us! :-) \nWe hope you enjoy WatchMaster and please stay tuned for more watchfaces by various wonderful designers! If you have any other questions or issues while using our app email us at ask.watchmaster@gmail.com. Thank you and best regards.",
            "date": "December 10, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "kumar shubhanshu",
        "comment": "Thank u now i am able to download and apply all faces",
        "date": "December 22, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRnhqOE1RNlJhT24wdW9WOE43dDBGSFZmeEdEUExwX0dXb3kweFBLYnBxNWRQMGRwMUJ1Mkk1R3hTdEpaa2dPTWt1OVNaNkFFN1hUVWxDVzIw",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Kumar thank you for rating us and for the support. \nWe hope you enjoy, more watchfaces will be released in the future so please stay with us. If you have any questions or issues while using our app, please email us at ask.watchmaster@gmail.com and we will be happy to help you out. Thank you and best regards.",
            "date": "December 26, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Kevin Rodriguez",
        "comment": "One of the best store to have a great number of faces.",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPR0dBR2FWSXZjU3lEUjJoTWx4eWx3Z0h4aTRvbDlnWXVqemg4LVJ4ZzhRSTNNaU1iVGtrMV9yMkJSaGxGdnpEUVJYQ0ppeHB2Q2JDa0MwaFA0",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Kevin.\nThank you so much for rating us! We hope you enjoy your time with WatchMaster. If you have any questions or issues while using our app email us at ask.watchmaster@gmail.com and we will be happy to help you out.\nThank you and best regards.",
            "date": "November 29, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "STAR LORD",
        "comment": "High in quality,low in quantity....for tizen.",
        "date": "November 28, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRnI4Ri1IcmVXREFwQzZkTWFldXNnMXRDNzRLR0FTd0hESnF0LVFzYmNtekVwS0swak9GVkg4S0RGa0FucDg1UmxMUDlQR0k1MUNvUkpZWENJ",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Star Lord! \nThank you for the feedback. We hope to bring better services and more high quality watchfaces in the future. Hope you stay with us! If you have any other questions or issues while using our app email us at ask.watchmaster@gmail.com and we will be happy to help you out. Thank you again and hope you have a wonderful day!",
            "date": "November 28, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Eni Ien",
        "comment": "Edited: problens solved, thanks Dear watchmaster: I'm having some issues with the app and my new galaxy note 8... I don't know why but the app does not appear anymore on my watch and the link provided when I open the app on my phone goes to galaxy apps app that shows that the app is already installed ... what can I do? Ps: my watch is LG urbane  The best app for wear, worth subscribing",
        "date": "November 22, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPR0RYWjh3MXUxbmNNeTFkSzAydnVMc2lUWUltTElhOGNFWFZNaXAwckxWVGdoUVVVTTVWVVJJMkE4Vk85ZTZzdWx5WVBBQnFLazZ0RHQ2dWNn",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Eni.\nThank you for feedback, we are glad that the problems were solved. If you have any other issues or questions while using our app email us at ask.watchmaster@gmail.com. \nBest regards.",
            "date": "November 22, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "David Clarkson",
        "comment": "I want to give this more stars. But I cannot get the app to apply the watchface. Maybe it's a Pro feature? I think I should be able to apply a free watchface to evaluate if I want to drop the money for Pro or not... Asus Zenwatch 3.",
        "date": "November 18, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRTFfQ0xRVG02NEd0TXpnMTJ4YUlqVmZPYnZ2NlNxQ2RzM3J1dDBxM3UtdmlHQjhzcy0xak5MM3VkQkVudFB5NnVteHpvZmkzUWhlZTFfN3RR",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello David. \nThank you for the feedback. Android wear 2.0 users must download WatchMaster again on their watch. If you go to settings please tap Install WatchMaster from Watch. This will send a link to your watch for download. If the applying is still not working after the download email us at ask.watchmaster@gmail.com. Thanks.",
            "date": "November 19, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Alan Webster",
        "comment": "I had some issues with subscription upgrades when moving to a new device, this has been resolved by the team. Great value for money. Well worth paying for the pro version.",
        "date": "October 25, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPSDVRNXEwcXB1NF95UTVkMHFLWlVqemtrRThwTWhNQVBmUHZpdzZTTnVZLXFtUy1ocV83Uml6Q1Q1TElZQjl6cVV4OUd5N1Nzci1VdTFkOG5v",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Alan. \nThank you for the feedback.\nWe hope you enjoy, more watchfaces will be released in the future so please stay with us. If you have any questions or issues while using our app, please email us at ask.watchmaster@gmail.com and we will be happy to help you out. Thank you and best regards.",
            "date": "October 25, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Mohammad Shafik",
        "comment": "Tizen 3.0 on my Gear S3 has broken Watch Master. When do you expect to be back and working? I have the full version.",
        "date": "November 25, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRndMUW9NdGlmam1YMkNMczZ3ZUg4QkM1Tk1feVJWZWhDQ0VIcm1oZ212a0s2TUVUZ2tEeUxucDNiUnlIMldFanEtdm1HalBWbXdFOUZHalFZ",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Mohammad! \nThank you for the feedback and we are sorry for the inconvenience. \nWe have already updated the Gear companion application.\nPlease update your WatchMaster for Gear S2 and 3 to WatchMaster for Tizen. \nIf the same issue occurs after the update email us at ask.watchmaster@gmail.com. Thank you.",
            "date": "November 26, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Albert Rinaldi",
        "comment": "Already not using it for more than 5 months because i sold my smartwatches. But i forgot to delete the auto-subscription so it auto-withdraw my token from my prepaid cellphone provider. I feel like being scammed right now",
        "date": "November 18, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRUMtR0FFNGV5Yk1aWXV1eHdGX3ozdDVrODZLdWNsdHE4cmxWcjA4UnBJOTB5bW5TVURldFRnZ1pfckQ2T3RIcUNuOGpyLS0tT3RiVGlYZjNB",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Albert. \nThank you for the feedback. If you are not using WatchMaster make sure to deactivate the subscription, or else it's going to automatically charge you a year later. This information is written on our Help section. Hope this helped, if not email us at ask.watchmaster@gmail.com. Thanks.",
            "date": "November 19, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Joseph Ilardi",
        "comment": "I like this app, but since the update it no longer works on my 3G gear S2. It keep freezing my watch and not displaying a watch face.",
        "date": "November 2, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRWRKZEFPYVl2RFpScmU2VGNhTURNTVhiZHZidW9TX0dKSGFKNVNrZUdEblVCWEZwcmZZSEx0VkpjR1VJRTZwTzRXZjQ1WUdZLWZtczdWVFJJ",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Joseph. \nThank you for the feedback and we are sorry for the inconvenience.  Please delete and reinstall the WatchMaster app on both phone & watch. If this doesn't help email us at ask.watchmaster@gmail.com. \nThank you and best regards.",
            "date": "November 5, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "William Aung Leyraud",
        "comment": "Last update crashed the app, can't use my watchfaces.",
        "date": "January 19, 2018",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRkc2NC1KSUJ3N1AxdWMyTzhLaGNtMWZ4QWJscFhwcjhZckxtSWYyaEt6SjdNdXpjYXVMVThjV1Y5cjZkZjFJS2NnVW8tdDNGVlJYSVNmQ0N3",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello William. Thank you for the feedback and we are sorry for the inconvenience. In order to help solve this issue we need more information on the how the issue occurred. Also detail outline of what kind of device you are currently using. Please email us back with the informations and screenshots. (ask.watchmaster@gmail.com) Thank you.",
            "date": "January 21, 2018"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "George Fragoulis",
        "comment": "I haven't gotten it to work on my gear s2",
        "date": "October 26, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRjJlb3RNM0syVjZaX0dnaU5xaUpzT1hTTzJhYWNOTl84dlBTeVNRME5MQ1NqWGJDdWdjR2dHZjBkRXdHcGdPdDEzTTIwZ29ndVMza0pyOVpz",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello George.\nThank you for the feedback and we are sorry for the inconvenience. Make sure to check if you have downloaded WatchMaster for Gear S2 from Samsung Galaxy app store. This is a companion app for WatchMaster Gear users. The instructions of how to set up your Gear is on our 'Help' Section. If you need help email us!\nThank you.",
            "date": "October 26, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "",
        "comment": "Updated to use with S3, no longer connects to phone. When uninstalled, watch would connect to Bluetooth again.",
        "date": "November 26, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRTZEZDJ4RktZaDNTQ0NxQmdEN09mN3d3cXRrbDFxai1yT0c4bDRtU1dSc01yS05PN1cyUndtZGczTlgtWGQzcjZ4QXBlWmpXSzJkbUFPTEg0",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello there! \nThank you for the feedback. You must download WatchMaster for Tizen from Samsung Galaxy app store. This is a companion application for Gear users who wishes to use WatchMaster. Please check out the Help section for how to install the WatchMaster properly. If you need help email us at ask.watchmaster@gmail.com. \nThank you.",
            "date": "November 28, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Juan Martinez",
        "comment": "WHY WAS YOUR GEAR S3 COMPANION APP REMOVED FROM THE GALAXY STORE IN THE US??",
        "date": "November 27, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPSDg1QlR3TEI5b25WY0plem1jNzcwX2RzWk5HTUxGZVJrNkNsRE5Ed1h4VFVpQ3hKaW16NkY5RDU0QTM4amhaTjRKTXhZTXN4elNxR1BreDFJ",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Juan. Thank you for the feedback and we are sorry for the inconvenience. Please note that WatchMaster for Gear S2, S3 has changed the name to WatchMaster for Tizen. Search WatchMaster for Tizen from Samsung Galaxy App store. If the same issue occurs email us at ask.watchmaster@gmail.com. Thank you.",
            "date": "November 27, 2017"
        },
        "star": 1,
        "title": null
    },
    {
        "author": "Hiren Patel",
        "comment": "please provide vxp watch faces...",
        "date": "October 28, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRjNvNl9NYW5ycDZRLUhBbEVDZXZrR0FYQkVSTHVpOGswVEJlMjdQZExoRE1Rb3haaDNydndReDlwZnFyMG5oall3aDhxaWZNckFPQ09saFpv",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Hiren. Thank you for the feedback and for the support. We will discuss your opinion with the team and notify the designer on your comments. If you have any other requests or questions while using WatchMaster email us at ask.watchmaster@gmail.com. Thank you.",
            "date": "October 29, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Maaz Kazi",
        "comment": "cannot set any watchface??",
        "date": "October 28, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRTFZQXBQei1hTzljWFNaRncwZzl2Mi00YjVMQ3Z3OUppdDlnb1JQemNDN1I0QzlncGFPLTlLc29rNXB4amo5TUx3ZmZrU2VLYTNEM3ZEWlVR",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Maaz. \nThank you for the feedback and we are sorry for the inconvenience. But in order to help solve this issue, we need more detail information on your device. Please email us the details at ask.watchmaster@gmail.com. Thank you.",
            "date": "October 29, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "John Wetton",
        "comment": "Any plans to make it compatible with the new Gear Sport?",
        "date": "October 30, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRlVlMUFzUVcyN2VERDJ2UzllYVgwaHhwM0c4UzlSdDExQWhRb1RVTHZ4WnB3LWJocU00c1NzYlItTGE4MXhPLXNSN3JCS0xLUjlYenF3RWNr",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello John. Thank you for the feedback and for the support. Please note we do support Gear Sport since it's running on Tizen OS. The watch name might not be listed on our watch list but you can register your watch. Please let us know if you are having any issues while using our app via email : ask.watchmaster@gmail.com. Thank you.",
            "date": "October 30, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "Frank",
        "comment": "This app is gorgeous and some watch faces look sharp on my Moto 360 gen 2.",
        "date": "October 5, 2017",
        "permlink": "/store/apps/details?id=dd.watchmaster&reviewId=Z3A6QU9xcFRPRW1Xb3l2ZU9pdDFReFFqZ2VOcHlsT19rWkIwa2RWTHlXSzA4NWZORFhGRzBubE0xM3B6ejFTRm1iazM5ZDRfX0VwbjJvWEhreE9RTHJiY0Qw",
        "reply": {
            "author": "WatchMaster",
            "content": "Hello Frank,\nThank you so much for the feedback and for the support.\nWe will do our best to fulfill your expectations. Please let us know if you have problem while using WatchMaster via email. Thank you so much for your time and support. (ask.watchmaster@gmail.com)",
            "date": "October 10, 2017"
        },
        "star": 4,
        "title": null
    }
]