[
    {
        "author": "Keith Scheiwiller",
        "comment": "Absolutely love Krona Sunlight! Weather is the thing I check most on my watch so I keep coming back to this one. It's a great example of how to pack a huge amount of data on a tiny screen while keeping it functional AND elegant! Definitely worth whatever initial price, and the additional data subscriptions are very reasonable.",
        "date": "March 24, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPSGxiM0ZkNFE2dENGY3RsQy1lNFoxWGRyc1Rzck5IZl9ySmdVNkkydVZBa0ZQVzFQQ3dOLXhObHpPdS1QZWgzaFpfenVndGFWSUMzRVNSdUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Kris Diehl",
        "comment": "Brilliant. Never thought I'd use \"just\" a weather face for my main watch face, but this adds so much at-a-glance info, without being ugly or digits heavy. Especially ingenious to estimate accurate forecasts even when disconnected. And I've never seen such a well-connected app, that I can always rely on it being up to date. Anxious to see where the app and dev go from here.",
        "date": "March 6, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR1h1TEZlZ0k3UVhGVmszWHJmLTktVnZyM0FieklSTGtqQ2hUa05sR0RLRTZTdlhMQ3JGVVB4NUZFbXhraEFpNldnVERKUm5zckFFZHp3UUE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Bill Reed",
        "comment": "This is exactly the kind of face I bought my watch to use. Visualizing a 24 hour weather forecast as a graph wrapped around the screen is brilliant. At a glance I can see projected conditions for any hour of the day, as well as watch and phone battery levels. Battery usage seems lighter than other watch faces I've tried as well, but I could just be imagining that.",
        "date": "September 21, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPSFlnOHZoaUt1NkduR0swMUlUVXAtWC02V3Jvb05penM5TEdaY1BBYzRBclJpMG5VeWl4aW1lLUxDU0pFZHlLRmNiSDhNQ0ZoUFcwamZVa3c",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Craig Ueltzen",
        "comment": "I'm redoing my review after updating to the latest version. Now, it's worthy of five stars. One gripe I had before was the short on-time, now with the slider I can make it whatever I want. Lots of information on the screen now, and I really like the new interactive modes. Great job!!",
        "date": "April 13, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR29PMWhiT05CNS14cUJpREdPNXBoLWtQUDFjbXM1a0FHQnZWckxEZHhQRVBrWUNDcXloUDMtMFA1VjhKc3EyZnQ3U2VpNTU2dXN3WXdTclE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Roman Khomynets",
        "comment": "At first I did not like the new subscription system. But after this update the watchface received the best design and functionality. Previously version was also the best among all. But now has become even better. The only thing I do not like it limit the number of updates the weather data. Thanks for your work.",
        "date": "February 14, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRkdZRFJfVVdmYTRrUjVKR2xjdWVQNEFrQlAzZERhREN6RkhNMUFqSXp1ci1zU1ZKUnhON0c3UlJQemtBNmFpaHlIREhZZkR4SXFWRWI3akE",
        "reply": {
            "author": "Simon Barke",
            "content": "No, you don't need to at all ^^ I got many requests for features that I could not implement without extra trees since the weather data simply is to expensive. Everything the old watchface could do, the new one can do without any extra fees. And more. If you are missing a feature from the old version, please let me know.",
            "date": "February 12, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Sander Messink",
        "comment": "Not your regular weather watchface, takes a little getting used to but definitely worth it. Looks great to!  Will turn subscription back on when the other providers are (finally) added again. DarkSky not accurate for Europe.",
        "date": "May 28, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR3hNVDgzMFpzRzlCUXhXSy1FQU5CMTVKNl92b1pTaGQ4XzJSa05PeVNXSTFIZGIxaEpNS0x0ZGhoNzZFVnJ6UFdNNHVrWmlqbUtGMjhXX3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Michael Reeves",
        "comment": "Once you learn what bars mean what, which is not difficult after a few days, it is very informative . You can be underground and still know how much sunlight 's left in the day or night. Mixes in a blue ring around face to show rain times. Awesome app. I would have paid 4.99. It worth it. A++",
        "date": "March 16, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRzBHQlNraThfb0w0Y3ZYbjRRby1nUHpEQVFHNmhWZVg0Zl9TLUZNY20yMF9aQlhzUDBWRmJ5QzhLbUFqYUo5c3JGcnVvRV9ySmgtVFNIbEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Melvin Thompson",
        "comment": "So I love this watchface.  The only problem I am having is that I can't seem to change my settings.  I go in and change something, then I go back, but it just changes the setting back to the original:-(  Edit: only one watch and wifi is turned off.",
        "date": "July 13, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPSDlodV93QmVuLVZOU0Etd3FxZ0tnallPSk85TjZjNnRPR2F2cTgzQXFLNEVMX0IyZXFrOUNxV1g2VzVBWnEyZDJQVURkcnBWcE9sZWVFN1E",
        "reply": {
            "author": "Simon Barke",
            "content": "That is really really strange. Can you try restarting watch and phone for me and enter the companion app via the Android Wear app? And see if this helps?\nWhat should happen: you enter a settings screen ans pulls settings from the watch. You change something and it pushes the settings to the watch. You enter it again and it pulls the new settings.",
            "date": "July 13, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Daniel Cressman",
        "comment": "This is my absolute favorite watchface. It's gorgeous, useful, and has everything you need.  Unfortunately, the latest update has rendered it completely unusable for me. The watchface shows no data and the app crashes immediately upon opening.  I am very much looking forward to when this is fixed, and I'm anxious to see the new features! Highly recommended as long as it's working.",
        "date": "May 26, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRlZ3Sm0xd0tHSnJxTHh3ajRkdUtCWmlFUzI3UjZaakM3U2lvMkRtTlNOOVI5TGRta3Uwa3RYTHNhSFNMWkg5ZWZTMnFmclJITmJOYW82YXc",
        "reply": {
            "author": "Simon Barke",
            "content": "Hey :-) it might be an Android 4.4. saw a couple of crash reports that indicate that. Not sure when I will be able to fix the issue. :-\\ but: I can send you an old version by email that still works on old devices.",
            "date": "May 23, 2017"
        },
        "star": 3,
        "title": null
    },
    {
        "author": "John Haggis",
        "comment": "Looks good on first install. I like the rings. I don't like how small the time is. The temperature numbers should be about 75% the size of the time numbers. Making them equal size distracts me when I look at the watch for the time. I also didn't like the way they didn't tell you that you had to install the phone app in order to configure it. I wasted an extra 5 minutes trying to figure that out, and almost trashed and refunded it.",
        "date": "December 18, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRTF1YndGdTFTVkowQndEUGNPRnJ0VXhaQVNCdnFjOFJHQmNUNE9QSW1PMThjb0ZCa2ZiVU1WWkVFSUpmTHJjTl9vUTZ3RWJ2XzZVbXhPSVE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Art Gelwicks",
        "comment": "I've been through a ton of watch faces and this one is the one that has stuck with me.  Not only from a good look and feel, but integration with Dark Sky makes this the best weather watch face I've had the pleasure of using.",
        "date": "April 26, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR2c3ZHFzSG5lSjdRajlSUUY1U0tpdm0wM0lQejZ3anVpdF9sS0FTYXhFU0c0YjNTV1c5b3R0czNyNS1zZXBuamtacy10QklxWXVBZUZaSnc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Todd Mitchell",
        "comment": "I love this app. It displays a ton of information in an easy to digest manner once you learn it. My only complaint is that it fails to report my phone battery percentage. AW 1.5 LG Urbane 2nd with LG V10.",
        "date": "April 24, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPSE90LWxrQkZUYTZTTDRQN3F2Tmk1TmZwZ2NWVVpzQ1pJZG1nRE1leG5Wanh2UjZOZUp1M3J2TFR6Uk5HNTdibUhCeVFwcFpuV3d3eWJSbkE",
        "reply": {
            "author": "Simon Barke",
            "content": "Hey, thx for the feedback :-) what exactly happens with the phone battery?",
            "date": "April 24, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "William Garrison",
        "comment": "A great-looking watch face, lots of useful weather info available all at once. Takes a little getting used to, but once you learn to read it, you have a whole day's detailed forecast in once glance. Phone-side configuration interface is very well-organized and has a good amount of configuration options. It also handles multiple watches paired to a single phone, and provides per-watch settings. Additional data elements (pressure, humidity) can be purchased with fairly reasonable subscriptions (to cover the cost of the weather providers' charge to use their APIs).",
        "date": "March 25, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRlNxM0V1NVI3S1lHU0dWN19jYk5xQWxNZXQySW5QNktja0hoV0pockVIYmNjVjhQcG5lbmptdHhhc1V4NGtQWTZGN2ZnT1NSZXNCbjdNaHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Dr Ho",
        "comment": "Great app!! Looks good on my Asus Zenwatch 3 and it's super useful. Only gripe right now is that the other two weather providers aren't working as Dark Sky isn't quite as accurate here where I am.",
        "date": "March 12, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRmh3QzJWR0VqN1RMX0Z1bHB0X05sLWhmc3EzYlFydlBmN0VQU2FfdUwyOUpYVVZsUy1JOUp2b180Q05PTEVlRjZ6TmJMWnBkSm5UU2tXQlE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Adam Pecoraro",
        "comment": "Excellent update! I love the new features and the ability to subscribe if I so choose. I'm finding it hard to see rain precipitation on the forecast ring though, has the color gotten darker?",
        "date": "February 15, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR2k0WnEtcy1uc0I0MFpLeF9nLXJmQzdZMUFtOXJDYTNISG1pSFpJaHliVkM4RTFmWFowb3BZVF9FdndpZEFjOXFNVUhaZ3ZXdFlHRjBaZXc",
        "reply": {
            "author": "Simon Barke",
            "content": "Thanks for the feedback. Yeah, the rain color now includes probability that adds darkness if the rain is unlikely to happen. If you cannot see it, it probably won't rain at all. ^^ should make it an option though for all the pessimists out there :-)",
            "date": "February 15, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Kyle Bartley",
        "comment": "Absolutely tremendous!  I love studying weather information and this app ticks all the boxes for information. Well organized, intuitive and concise. I find myself using my Wear device constantly checking stats.",
        "date": "July 30, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRXVsbEdJU0xETHV3YXMzbVI3QllVQ21uZHN5Ui0wSktVVmlRTTBkNDQ2cVQ2UzJjQjlOOXJpeWtrZ040U1c5am1TbXBrSGhMQTY2bmRjZEE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Richard Gammans",
        "comment": "Nice app, but where are the weather updates promised in a few weeks.. since last February, it's now the following march! 13 months! Has this app been abandoned?",
        "date": "March 2, 2018",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR1l6T0c2MXFfM1FabTNiUS1CUTFJX2dadS1UNC11Zi12UDhpcTZ5QUNjLW81X3l4Tk8taHV3dzZBbUo2OHhySjVGQk80dGNvY2NkQ3pnM2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Philip Korkus",
        "comment": "Update 11/28/17. I uninstalled \"everything\" then reinstalled the apps (this one, Google apps, phone app, etc) and working again. At least for now! When it works, this is my favorite watch face. YET, HALF THE TIME, IT WON'T SHOW UP ON MY PHONE. It did for a few months, but vanished. Why? I wrote to developer and never received a reply. Sad.",
        "date": "November 29, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPSGNKWDhmYVBqSXJYZkhQcjk5VlZpU2VXaEtPczNiazVtMzhDYTNTQmJIVlpvZXJCMzBrTFNYeDc2VUxwVG4zaHkxV3NHXzhwT2F5akRvZHc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Ryan Keshock",
        "comment": "This is probably one of the few watch faces with a learning curve, but once you get the feel for how information is displayed it's a fantastic and beautiful watch face. The amount of information packed onto the screen while still avoiding clutter is astonishing, and the customization options allow for fine-tuning to fit your preferences. Easily one of the best watch faces I've ever used.",
        "date": "April 14, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRk1wNzVrQkFBZlFBVWx2WS1SSUNZbTRQckJRMlZqWHQxX3VDaGJVbGN1eDNBbTk3S2lLc3hWSUMtNnlGV096LUtWUGpXanVXYlVXeFhEVGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Theo Murray",
        "comment": "Simply the best watchface out there. The 24hr weather dial is so readable that any other watchface feels unnatural. I can confidently say I have used this face for years and it's never been bested",
        "date": "August 19, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRV8yS0NsZnQyWk1oTGVNM1JqZ2NaWDl6V1RsSUVGRjA1MGxfQ25LM1VXM3U0ZnZ4cXphM1V4Mk5uQ1ZTYm53b1FEd0NWRGUyc0xRdHRzcXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Paul Delaney",
        "comment": "The idea of the watch face is superb and unlike any other I've come across effectivly giving you the forecast for the next 24 hours at a single glance. Deserved to be a 5 star app, so why only have I only given 3? A few reasons, firstly as it has a bug that loses/doesn't update the forecast data after every 3 days, only way round it is to reinstall the phone app! I appreciate it may not affect everyone but despite leaving a bug report and contacting developer via email, he hasn't replied.  The developer also stated that the 2 other weather providers will return in a few weeks but so far nothing. I don't mind too much but may affect others where DarkSky isn't the most reliable forecaster.  There are also plenty of other small improvements that could be made, would like to see a bigger clock option on the ambient screen. The text across the middle when changed to the agenda doesn't support all day appointments. I could go on, however despite the lower rating it's been my everyday watchface since I bought it as it's unique at what it does and is worth the hassle of the reinstalls regardless.",
        "date": "October 9, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRjF0WnNoMWk3YUhpcVZzaHJieklvQk9NbVgyQ25xUTkxd3d3V1pra3JnbzdfQzJJNndQaHBOcEVQZWw4WmpjNHh5RlJZbTVybk8yazRyc2c",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Christian Dysthe",
        "comment": "This is the perfect weather face for AW and one of those watch faces that uses the smart watch interface  in a new and unique way. It has all the weather information you need and then some at a glance, and the way it's done is just brilliant! Nice flat no nonsense design. All I now wish for is to be able to see my step count and even heart rate without losing other information. Needs an update and some of the announced new features. And this is the only watch face I've used that never crashes, disconnects or complain like many of the more advanced faces do on Android Wear. I've now used this watch face exclusively for a few months and it's rock solid without one single crash and moderate battery consumption even with the most frequent update set. Get it!",
        "date": "August 25, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPSDlqMFczbEtFQl81c1I3dVZmMlVMSHlkN0hPR0hXUnhlWUhjYVhBNF91NVhwaUg1Z01KQ3dNYmRhcUdhdXJIMU9CWFZ1NHVJRWZFdzNtdFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Mike Foote",
        "comment": "I don't rate apps. Thus watch face is simply awesome. The amount of info at a glance is ridiculous. Great work!",
        "date": "June 30, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR21QalNrX1dUU3NnQU16MElpSU9aUm9yUWZNZ24wZUNsTTB6b3pib2dKcmRlMG0wRmNkV1JSVkhTLWtLOXVNTU9WUlhfbURIbk93V2pwbXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Markus Ressel",
        "comment": "So much organized information on a tiny screen. great design! Such a great update for wesr 2.0, complications are great! Went instantly back on my watch after some time with other watchfaces. Great work dev!",
        "date": "April 12, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRzdtazMtN0E3M0hEYkdDcTZvS3Rjd3M5bHBNenFLMWN6SE1iTFd6U3RQN2NudERwWmtMZUZBc01BNWxwTHoyMFlSRUQybGlYYVd5RUZaNGc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Josh Davis",
        "comment": "Android Wear is weird to set up. This is not the fault of this app. Once installed it's working nicely on my Pixel XL and Moto 360 sport.",
        "date": "August 31, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRjZVdnJEY2x0dkl1akgtYUs0SnVjelZCSHFJVlFjUFVUR2prNHNUQjF6M2c3MTNocFk2MHlvUXdPeWQ5NlVBZE9oU0hsWnh4Vl9fWGdwcXc",
        "reply": {
            "author": "Simon Barke",
            "content": "But it should absolutely work. It's still Android Wear 1.4 or are you in 2.0? What exactly does not work?",
            "date": "August 31, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "",
        "comment": "I used to adore this app, until it started popping up full page ads over what I was doing several times in the course of a minute. Now I'm furious.",
        "date": "June 5, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR0dCeTF4TkZaNGF2aURyWEhXQ19KZVNYOGt2aHY1WU1GMlRoZXltTFgxcUg2dnNSQnNLdGZ6dkRYNlNLam9YaTZMQ1RKTFhoQ0trV3NmTFE",
        "reply": {
            "author": "Simon Barke",
            "content": "No. That does not sound right. Krona Sunlight does not contain any ads. This must from something else. I do understand your frustration tho. Krona Sunlight does not even have overlay permissions. So it cannot do any fullscreen overlays. And again, it's completely ad free. Pls let me know if you figure out the cause. Thx!",
            "date": "June 5, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Dan H",
        "comment": "It's the perfect watch face for what I want. My Watch has a round display but I prefer a digital display of time. I have no reason to search for another watch face after this. The only reason I deduct a star is because here on the Oregon Coast, AccuWeather is the only weather source we can trust. I find the \"Wordweatheronline\" option to be the closest to accurate of the two options currently available. It's still \"off\" enough that I must pull out my phone for the most accurate weather info.",
        "date": "February 15, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR3pSWk5fOHBBOFpFOHlZU0REekYySHRxWHJQWlA0WnV5RWZCSmxzR0ZHdldVc29wc1o3bGlNTlJieElUbDR6b1J4YVdnVnVIZkt0RzFqc2c",
        "reply": {
            "author": "Simon Barke",
            "content": "Thanks for the feedback. :-) We are about to switch to Dark Sky, can you check online on forecast.io how accurate the weather is for your location with this weather provider?",
            "date": "December 31, 2016"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Chris Pugh",
        "comment": "At the time of writing, some features are just placeholders (watch-based settings control) or yet to be re-added (like other weather providers). It's a little odd to see an unfinished app update over one that felt complete (that's what beta programmes are for! 😜). Still, what IS there is great: things like the subtle complication ranges on the edge (which default to phone and watch battery), and support for complication providers (as well as being one itself)... and that's just some of what's new!  (thought I'd update the review to be a bit more positive because the dev reply got me thinking that there wasn't much that really disappeared in the 2.0 update, just a few new things that are placeholders)",
        "date": "February 22, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRVFfeTdkUUNZamRNYTFlYVg1NDgydlRDd2E5UURpMGtBUTR3MWs2Y1EzUElPOHBSVTlHUVpfSlBhVXczanJmWi1RdGtNaENKdmJQaEpybVE",
        "reply": {
            "author": "Simon Barke",
            "content": "Thanks for the feedback. :-) I feel you. I hate it when Google is doing this to their own apps. But I was bullied into releasing Android Wear 2.0 compatibility until early February. So I published 2.0 in the stable channel as soon as it was working \"good enough\". It's a complete rework, way more modular, and adding new features is much easier now.",
            "date": "February 22, 2017"
        },
        "star": 4,
        "title": null
    },
    {
        "author": "Aloys Garnier de Kermerc'hou",
        "comment": "This watchface is absolutely brilliant. Clean, clear, most innovative way to display the weather forecast, never a performance issue, super reliable... I mean I try but I can't find something negative to say about it. It's an absolute must, and the promise of having more option for the indicators (notably the steps count) on the outer-most rings is very exciting. Superb work!",
        "date": "March 14, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRlh3X0Nlb2pBRmdpRzUxUXp0OHFHSU9BMTBfY0JaclJ6RE5sbEkzWFVuM2hnRlI2MkMxN1RRTDYxWnVSMDJYb0JnNTc3R2hfakNLcFZsWUE",
        "reply": {
            "author": "Simon Barke",
            "content": "Thx for the awesome feedback. :-) Step count so far only works with Android Wear 2.0 as short text complication. The outer most ring (currently reserved for internal battery) will be able to do a step count range complication soon. Cheers, Simon",
            "date": "March 14, 2017"
        },
        "star": 5,
        "title": null
    },
    {
        "author": "Dafydd Lawrence",
        "comment": "Used to be a great app but since the update the only way to see any weather data is to go to the phone and perform a manual update. Therefore my watch face mainly states no data with a red ring. If I need to open the ohone to update the weather I might as well just check the weather on my phone in the first place.",
        "date": "March 5, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPSC1ZVDdWaTA4VGJQLXFGZEFpVFJVS3lUVlUydFJfNDJFZEJMd2ZnRjZnMFNiQVI4aExCNnMxRWlJNndXRW9ySWkzYUEzWU1obGd4S0MxQlE",
        "reply": {
            "author": "Simon Barke",
            "content": "That's not how it is supposed to work. ^^ I got the same bug report from one user per mail. No one else so far experienced the issue. Not really sure what happens here. Can you take a screenshot of the logfile on the phone and send it to me? Thanks a lot, Simon",
            "date": "March 5, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Patrick Blanco",
        "comment": "Absolutely love this watch face. Very good on battery life and has all info I need to get me through the day. Well done developer A+++ I have over 10+ watch faces on my LG smart watch this has taken the #1 spot gonna be hard to top it.",
        "date": "October 15, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRjJIUGxSck4wZEtwa25iY0tyMHlQeEJndzlMcE00MnJDcDR3U0F6SmJZUWFkTVdwNTUzQ2FxMER2V1JkT29RYWlXRllrM1BjaXItMzdXYWc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Rhythm Rice",
        "comment": "No way to change your location or data provider, When the app was setting up it let me choose automatic location and it let me choose the data provider but when I compare the weather with two other weather apps, the temperature is just plain wrong, but unfortunately there is no possible way to change the location or data provider after the initial setup so I guess it just doesn't work.",
        "date": "February 16, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR1VqMzFjMS12emp6QXg2YkdxajFNTUM0Z0xyMWs2c096VlJ3ZHQ0OVRoSERrOElVZXZhZXkxUGxBSnFzamkwV0ZyMWV3SUFsTXJzQWRuTkE",
        "reply": {
            "author": "Simon Barke",
            "content": "The new app broke the compatibility with world weather online and OpenWeatherMap. For the united States, dark sky is superior to both other providers. For the rest of the world, dark sky data is pretty bad. I am working as fast as I can to bring world weather online and OpenWeatherMap back. Will take a couple of weeks. Sorry!",
            "date": "February 16, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Zak Kloes",
        "comment": "You could only use dark sky to get your weather meaning my temp was wrong most of the time and didn't update to where I was. And this watch face drained my battery like crazy. Fix those things and I'll be back for sure",
        "date": "July 10, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRzJlTFVTVlpwVEdDZFBBU19kTll0SWVSZGZfQUZRdjhlN2xPeXNKdDVTSGNFMXZLUUt6Vld6NTQyTEdINUN0TlYwcGplai1haGRvRUZvdkE",
        "reply": {
            "author": "Simon Barke",
            "content": "Thx for the feedback. :) More weather providers are coming. Saying that for a long time now. It's more complicated that predicted. But they are coming. Battery drain is not seen by other users. Make sure you don't crank up wake lock (screen on) time too far up. But the Watchface in general is extremely light on battery.",
            "date": "July 10, 2017"
        },
        "star": 2,
        "title": null
    },
    {
        "author": "Kairangi Macdonald",
        "comment": "This watchface surprised me, I was expecting to be disappointed since I can be quite picky when it comes to faces, but I really enjoy using this watchface, my only complaint is that it can hit your battery life a bit depending on your watch",
        "date": "December 8, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR19XTWNaUzgxaFNvdEpSMXVaWTE2d1dBUnNyWGRZOE15RWNOTVB2WVJwM1lnWm40WHZ2T3R2NFkxbjNVa1hIc2MxZ3ZEaF80dXNueTdZRUE",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Dean Lewis",
        "comment": "At a glance I can see the time, get a very quick idea of the weather as well as when I'll reach the top temperature. Very Useful!  Would love to see government weather data options (for me, the Australian Bureau of Meteorology).",
        "date": "February 27, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRWcwdTI0MHk5ODEwZ0hfWmstaEVMNGNTRFNVTWV4akZMTWlCMUoyQXY2VzhibzFuN3hTamhpUlNpdWs4Tm52V2ptQU9LUjJaOXRCMmdJbXc",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "Filipe Governa",
        "comment": "Not bad, but no hourly sound/vibration, no (working) full-color ambient mode, subscription instead of one-time payment for additional features, and starts automatically in the background after phone startup.",
        "date": "October 11, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRU9IREJXcG5lV1AwRXYwR3hya0ctV3ZSMEtLU21tRVBFMktUZk9yYVR6cTB0RlRaWG00ZzI2MHBTXy1sZlEtaFVNTjB2Q0ota0pOMzJyblE",
        "reply": null,
        "star": 2,
        "title": null
    },
    {
        "author": "Steve Mason",
        "comment": "Gives you 24hr weather at a glance and looks great whilst doing it! You don't need to subscribe but if you want to they are really cheap, so we'll worth it. Highly recommend.",
        "date": "July 20, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPRlkxdEFySHJQOXNCX2ZnVHpOa0h4cHZwaFNqeXJnNG4yTU5McTZVUTZiZTk0Z0NIZlVUamVxTVpfdkFscTduZGc0bTZ3OGZZYzVRckpTdFE",
        "reply": null,
        "star": 5,
        "title": null
    },
    {
        "author": "kenneth Spencer",
        "comment": "At first didn't work! Tried again and it did. Best looking weather app on my watch so far. May try premium.",
        "date": "August 13, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR2tDR00xWGp1UGFoRVRuQVRBai1GM1hUeFg2aUxZMDdHbkVIa1g0Zm91cjR3UWo5bXRqbG41SE1LcTdyaWNRbnYxWmhsanljanhnenZ6X3c",
        "reply": null,
        "star": 4,
        "title": null
    },
    {
        "author": "Chris Prettejohn",
        "comment": "Was working well but then has lost the weather feed which makes it a bit pointless. Not great for European market.",
        "date": "October 28, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPR1lJcV9DeVM4RHNQUm51bWNadHg1aHNPa2g1Z0c4UXAzZFFuVW0xRVdxU2ZHc1Rpd0VqTEQwVzNMYnF1SVVvVUdoSjF4SXpESWE3akQzZlE",
        "reply": null,
        "star": 3,
        "title": null
    },
    {
        "author": "Blake Dunlap",
        "comment": "Developer very responsive to problem reports through reviews. Very happy.",
        "date": "March 25, 2017",
        "permlink": "/store/apps/details?id=net.marscity.sunlight&reviewId=Z3A6QU9xcFRPSEd3ejVWQTkxRmREUDgxWVd3UlktNWlpWkpYenktcmNwem12Q0lGVXVQMXA3UnhwcmNCQ3dadkNfWWhWdkUwTnc1eFdBZmotNUkwR2RTa3c",
        "reply": {
            "author": "Simon Barke",
            "content": "Can you send me a screenshot of the log file? Maybe I can figure out what's going on. First time I hear of this issue. Thanks, Simon",
            "date": "March 25, 2017"
        },
        "star": 5,
        "title": null
    }
]