{
    "title": "AIB Mobile",
    "summary": "Put AIB Mobile on your phone, and your accounts in your hand",
    "icon": "//lh3.googleusercontent.com/TVV-VdzrFsPtOez6qDTUdBGiOVX4op6BecNPIgqO0_DUUE5fXWGz_npDdeakRcU3nA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.2,
    "reviews": 7046,
    "developer": "Allied Irish Banks, Public Limited Company",
    "developerId": "Allied+Irish+Banks,+Public+Limited+Company",
    "developerEmail": "internetbanking@aib.ie",
    "developerWebsite": "http://personal.aib.ie/ways-to-bank/mobile-banking",
    "updated": "February 6, 2018",
    "version": "5.20.1",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "What’s online banking without a mobile app?With the AIB Mobile on your phone you have access to:- View up to 2 accounts without logging in: press that Quick Balance button!- Although the app is linked to your profile, the 'One Time Log In' option lets you log into another profile if needed*- Share your IBAN & account details- View & export up to 7 years of statements- Report your card if it is lost or stolen (it happens!)- Reset your PAC or recover your Registration Number (it's hard to remember everything!)- View & cancel your Direct Debits and Standing Orders- Apply for Personal Loans while on the go- And much more...*Remember: if you let a friend log into their profile using ‘One Time Log In’ they could see your Quick Balance if that feature is turned on.To use the app you need to be registered for AIB Phone and Internet Banking.The app needs the following permissions to work on your phone:-\tIdentity/Contacts – we need the device name so you can unregister (ie. remotely wipe the app) from AIB Internet or Tablet Banking-\tPhone - so you can call our help or product numbers directly from the app-\tDevice ID & call information - to read phone status and identity-\tCalendar - so you can add reminders to your calendar when serving notice on Online Notice Deposit savings accountsFor more information visit our website http://personal.aib.ie/ways-to-bank/mobile-banking For information on our Loan products visit http://personal.aib.ie/our-products/loans AIB Mobile is available 20 hours a day, subject to our terms and conditions - we have some nightly maintenance needs you see. Transaction fees and charges, and transaction limits may applyAllied Irish Banks, p.l.c. is regulated by the Central Bank of Ireland.",
    "descriptionHTML": "What&#x2019;s online banking without a mobile app?<br><br>With the AIB Mobile on your phone you have access to:<br>- View up to 2 accounts without logging in: press that Quick Balance button!<br><br>- Although the app is linked to your profile, the &apos;One Time Log In&apos; option lets you log into another profile if needed*<br><br>- Share your IBAN &amp; account details<br><br>- View &amp; export up to 7 years of statements<br><br>- Report your card if it is lost or stolen (it happens!)<br><br>- Reset your PAC or recover your Registration Number (it&apos;s hard to remember everything!)<br><br>- View &amp; cancel your Direct Debits and Standing Orders<br><br>- Apply for Personal Loans while on the go<br><br>- And much more...<br><br>*Remember: if you let a friend log into their profile using &#x2018;One Time Log In&#x2019; they could see your Quick Balance if that feature is turned on.<br><br>To use the app you need to be registered for AIB Phone and Internet Banking.<br><br>The app needs the following permissions to work on your phone:<br>-\tIdentity/Contacts &#x2013; we need the device name so you can unregister (ie. remotely wipe the app) from AIB Internet or Tablet Banking<br>-\tPhone - so you can call our help or product numbers directly from the app<br>-\tDevice ID &amp; call information - to read phone status and identity<br>-\tCalendar - so you can add reminders to your calendar when serving notice on Online Notice Deposit savings accounts<br><br><br>For more information visit our website http://personal.aib.ie/ways-to-bank/mobile-banking <br>For information on our Loan products visit http://personal.aib.ie/our-products/loans <br><br>AIB Mobile is available 20 hours a day, subject to our terms and conditions - we have some nightly maintenance needs you see. <br><br>Transaction fees and charges, and transaction limits may apply<br>Allied Irish Banks, p.l.c. is regulated by the Central Bank of Ireland.",
    "histogram": {
        "1": 616,
        "2": 234,
        "3": 468,
        "4": 1358,
        "5": 4370
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/7kxVjHpPSeC-CrPfVvNBfJvOB2v4hbAj3Wfnn0gBmvbBMHLw1Y5NLRi34B0e6IWjB2s=h310",
        "//lh3.googleusercontent.com/q-JK0K0rdMrgZ6Der0-qBmFazINFY8PyD2i31AuECwhwHWW9gYqnsNdDMyVXNgTamO0w=h310",
        "//lh3.googleusercontent.com/CuaopDXv9oQGy2c-1Bnp7HxsppF0jql3tImCPDfv530UqHOUDwaYOZ1f-OPMk6ELhokA=h310",
        "//lh3.googleusercontent.com/CtV9HDkzZb6vxvSRwN3WVAyOzsl3UwJeCfLJLzLWmqx3k0De2g54qAoZC5LdZcUVHhw=h310",
        "//lh3.googleusercontent.com/-vEXFfZVuoHwavVpn0nWj0UwA6FrxU5fJT2WAoR9-i5NLdyLk0pdV4xnhg7Ku1Jc4-8E=h310",
        "//lh3.googleusercontent.com/okDJzSjR0RxA7aCpsgi2QAyB1tbomZ9VCLohSn2rY5C7sIRBhLNN8kQNJoWjXpKX8Ec=h310",
        "//lh3.googleusercontent.com/ky_LZQlbl0CLPrZlY4Lj06pYQgJMNsZORh1LNLDanBNdvmPpN56_futk1qJ1EvF3iyk=h310",
        "//lh3.googleusercontent.com/byS3uqSAl-yTpvbgooT4-MbSf3aJpNZMNvVJCgJrY6wPDwFpIrY_mjLYtWqvo9LyQw=h310"
    ],
    "comments": [
        "Finger print log in wont work on my Note 8. Worked on my previous samsung phone fine. Have reinstalled the app a few times but still not working. Very annoying!",
        "Try to open the app to view my balance, and an error message comes on saying : your account is my be closed, for more information contact the customer service.   Perfect app up 2 days a go.",
        "This app is so slow! All I ever see is the spinning purple circle as it thinks what to do. Not very user friendly in that regard.  ****UPDATE****  I reinstalled the app as suggested, but still the same issue. Does the fact that I'm based in NZ make any difference? Shouldn't really.",
        "App has stopped working since I updated it,  connection socket reset",
        "Unfortunately recent update hasn't solved the Finger Print Login issue (Galaxy Note 8).",
        "Against all the Irish banking apps this is the best I've found. Every query I've needed has been sorted."
    ],
    "recentChanges": [
        "In this update…",
        "We have added the ability for customers to order a replacement card for their damaged bank cards.",
        "and",
        "We have made some smaller bug fixes but nothing too fancy, just enough to keep the app ticking along.",
        "- Your AIB Mobile banking team"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=aib.ibank.android&hl=en&gl=us",
    "appId": "aib.ibank.android"
}