{
    "title": "Weather 14 days Pro",
    "summary": "Weather 14 days. The latest forecasts, maps, satellites, radar and widgets.",
    "icon": "//lh3.googleusercontent.com/qU-WQjYnVrszjVFcAfhNrjmNOzf5Mh8cYyTXeQx3uX79FOWi5sKEesc24W1fdqmQwps=w300",
    "price": "$1.99",
    "free": false,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.3,
    "reviews": 7858,
    "developer": "Meteored",
    "developerId": "8458932010894797678",
    "developerEmail": "support@meteored.com",
    "developerWebsite": "http://www.tiempo.com",
    "developerAddress": "C/ Patrón, 19\n30893 - Almendricos\nMurcia - España",
    "updated": "December 13, 2017",
    "version": "Varies with device",
    "genre": "Weather",
    "genreId": "WEATHER",
    "size": "Varies with device",
    "description": "VERSION WITHOUT ADS!!Weather 14 days is the official app of theweather.com . With the latest weather information for USA and the rest of the world. Featuring detailed 14 day forecasts, maps, satellites and radar. Compatible with any Android smartphone or tablet. The app features a modern layout based around Google’s Material Design making it very quick and easy to use.CUSTOMIZATION- Customize the app with your favorite locations like New York, Washington, San Francisco, Los Angeles ...or foreign cities such as Barcelona, Paris, London... We have over 250,000 locations all around the world for you to choose from.- Use WIFI or GPS to find forecasts relevant to your current location.- Customize your smartphone with our widgets, display temperature or rainfall information in your notification bar and select your preferred units such as Celsius, Fahrenheit or Kelvin.- Download the app for free and access the latest high quality forecasts. Use the app to integrate with Google Now and receive Google Now cards featuring our weather data.FORECAST-Check the daily forecast screen to see current weather conditions along with the main forecast information for the next 14 days. Browse between your favorite locations with a simple swipe of your finger and remember...the background colour of the app changes depending on temperature conditions.- Select a day to view detailed hourly weather information including temperature, rainfall, humidity, pressure, wind speed and direction as well as sunrise and sunset times and even the phase of the moon.- Don’t forget to try turning your smartphone sideways for the best view of our informative weather graphics.MAPS, RADARS AND SATELLITES- Check our animated forecast maps detailing temperature, rainfall, cloudiness and pressure for USA along with the rest of the world.- Watch animated Radar maps detailing recent and current rainfall with information provided by the Met Office. These maps feature standard pinch/zoom capability allowing you to zoom in and out smoothly.- View the latest weather satellite images provided by NOAAWIDGETS- Once you’ve installed Weather 14 days why not customize your Mobile Desktop with our great looking widgets. Get the current conditions updated hourly along with the forecast for the following days.- Choose between three widget sizes: 4x1, 4x2 and 2x2 (Clock Widget).SHARE- Share weather information with your friends and family anytime using social networks sites like WhatsApp, Facebook and Twitter.AVAILABILITY- App available for USA, France, Spain, United Kingdom, Portugal, Deutschland, Netherlands, Canada, Mexico, Italy, Brazil, Australia, New Zealand, Russia and many more.- Available languages include English, Spanish, French, Dutch, Portuguese, Polish, Russian, Hindi, Romanian, Turkish etc…",
    "descriptionHTML": "VERSION WITHOUT ADS!!<br><br>Weather 14 days is the official app of theweather.com . With the latest weather information for USA and the rest of the world. Featuring detailed 14 day forecasts, maps, satellites and radar. Compatible with any Android smartphone or tablet. The app features a modern layout based around Google&#x2019;s Material Design making it very quick and easy to use.<br><br>CUSTOMIZATION<br><br>- Customize the app with your favorite locations like New York, Washington, San Francisco, Los Angeles ...or foreign cities such as Barcelona, Paris, London... We have over 250,000 locations all around the world for you to choose from.<br><br>- Use WIFI or GPS to find forecasts relevant to your current location.<br><br>- Customize your smartphone with our widgets, display temperature or rainfall information in your notification bar and select your preferred units such as Celsius, Fahrenheit or Kelvin.<br><br>- Download the app for free and access the latest high quality forecasts. Use the app to integrate with Google Now and receive Google Now cards featuring our weather data.<br><br><br>FORECAST<br><br>-Check the daily forecast screen to see current weather conditions along with the main forecast information for the next 14 days. Browse between your favorite locations with a simple swipe of your finger and remember...the background colour of the app changes depending on temperature conditions.<br><br>- Select a day to view detailed hourly weather information including temperature, rainfall, humidity, pressure, wind speed and direction as well as sunrise and sunset times and even the phase of the moon.<br><br>- Don&#x2019;t forget to try turning your smartphone sideways for the best view of our informative weather graphics.<br><br>MAPS, RADARS AND SATELLITES<br><br>- Check our animated forecast maps detailing temperature, rainfall, cloudiness and pressure for USA along with the rest of the world.<br><br>- Watch animated Radar maps detailing recent and current rainfall with information provided by the Met Office. These maps feature standard pinch/zoom capability allowing you to zoom in and out smoothly.<br><br>- View the latest weather satellite images provided by NOAA<br><br><br>WIDGETS<br><br>- Once you&#x2019;ve installed Weather 14 days why not customize your Mobile Desktop with our great looking widgets. Get the current conditions updated hourly along with the forecast for the following days.<br><br>- Choose between three widget sizes: 4x1, 4x2 and 2x2 (Clock Widget).<br><br>SHARE<br><br>- Share weather information with your friends and family anytime using social networks sites like WhatsApp, Facebook and Twitter.<br><br>AVAILABILITY<br><br>- App available for USA, France, Spain, United Kingdom, Portugal, Deutschland, Netherlands, Canada, Mexico, Italy, Brazil, Australia, New Zealand, Russia and many more.<br><br>- Available languages include English, Spanish, French, Dutch, Portuguese, Polish, Russian, Hindi, Romanian, Turkish etc&#x2026;",
    "histogram": {
        "1": 386,
        "2": 337,
        "3": 579,
        "4": 2144,
        "5": 4412
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/v6kF0Lw0-SkR1wFOTm0RV0_lSZEPLSt2uoZKTwE1Nq6IHebFr06u5SX7fvx06SQQt60=h310",
        "//lh3.googleusercontent.com/m6BLT15t-kEy5mqRJcShCT0JLFKm9OGE7gAzjyQnzQLqJFtsFTrJRAOS8J3uJnUPwrY=h310",
        "//lh3.googleusercontent.com/IU7qRl7N-juqBSlMWK6_rG1ELCwXO06LH3CwCkxQeKHqaCXG_KaqGgHK_r9fO8dKInU=h310",
        "//lh3.googleusercontent.com/xyRxO-xaiHt_i7ZRHadj4lqmx4iYMkQDxZoCm_WwA8LU_F2tE-1UZ358Sege6TGtuII=h310",
        "//lh3.googleusercontent.com/PH0sx22npUcU8GQzWCsyEtlSzAZBXL7es4shK75YzzYUwEpvvQkpD7aRCxLJinSslb8=h310",
        "//lh3.googleusercontent.com/mD6a14bQpwDdKtchbbDDOloTvZNGstsgi8yMLEQNgXv-zNbMbS0NAFlwhP3igvNOcro=h310",
        "//lh3.googleusercontent.com/npdwNb2NU_xU6_Nt0RWPnlbPxlKfar5zrBzM15OmXXWhEaLRj_L0ehzl2AUF6Mo_fz0=h310",
        "//lh3.googleusercontent.com/58yhiRK45cXNr9WIsfvkIiFvuO9j4vgxO5eco90N3dB1jxsNoTyl7ajxOL55SoMDmQ=h310",
        "//lh3.googleusercontent.com/VsJ6d1YsN1Um0mVgtfeiV3yUp0NAt49jC7nB8XwrnpbFRSkDlsdXKhtSGMLeC_aAaN6R=h310",
        "//lh3.googleusercontent.com/MSvv0rOfkbDcPxtziZiY2t00n3BGYDtHSdW031YXfD6LP4MCDC6lRS1hUMORCHTJbeEv=h310",
        "//lh3.googleusercontent.com/yu1hc6UsyBw-RWJeyZ6dLBHFs11vJOtY5aexZy0i5KVZ7TPyUMxFc1RETVHViUF-oAiM=h310",
        "//lh3.googleusercontent.com/JenNTQj198iZkTgY4lc1QhsAGNq1x2U_4L6929o5lG0tkvKRhY7WqWK2sCZnOy4NSjc=h310",
        "//lh3.googleusercontent.com/wf1vMhWpCnahoJtwvMCgkAPoE_vecZ3zVdiFtIh3b1vuijIy1fbs5Ld1bg6_0v5mgWms=h310",
        "//lh3.googleusercontent.com/AueMaXB-XwhAvbdZ4xLOPaqKUHrAN9Or2LRqJubcMuj_CxbFTZ0NzTjRcwlgsok6Iu8=h310",
        "//lh3.googleusercontent.com/w2FB5M8zHeeYjXIFljmuafAQ0POmSCFnQepNU9BLshaSBixch7kPWuJNqP-qKAdagQ=h310"
    ],
    "video": "https://www.youtube.com/embed/UsGlhc2w-PU",
    "comments": [
        "Seems to be an ok app. Ive tried to submit feedback to the dev's but cant as the app tells me to use a valid email? Anyway the app is ok, however id like the ability to toggle notifications. Id only like to see for my current location, but im bombarded with notification for any place ive added.",
        "Works with android 4.04. Good presentations of forecasts: the continuous graphical display in landscape mode is very well designed, clear, simple but with complete information. Needs the Google Play Services hog to display maps, but don't require it to display forecasts. Many settings are adjustable. ECMWF based Forecasts as good as others (southern France Mediterranean), and sometimes definitively better than ones based on GFS and WMF models. Data consumption reasonable. Data for the favorite locations is stored for future use (even without Internet connection). One negative point  (hence 4 stars instead of 5): only 10 locations stored (Winfinder, Windguru and Meteoconsult don't have this limitation). An other negative point, shared by several other weather applications, is the lack of date an time of the prediction (Winfinder and Windguru show the date and time of the weather model run, while Meteo Consult and many others don't show this info).",
        "They invite you to include your city. Mine is Ningbo - one of China's most important cities. Having sent them your email numerous times, they do nothing about it. Lazy or what?!",
        "My favorite weather app was 1weather. Sadly 1weather has an issue now where the clock doesn't work so I was searching for a new weather with clock widget. This is the ONLY one I've found that has as much detail as 1weather, more in fact, and with a functional widget.",
        "First impressions mean a lot when you open an app since I have had this for a few days now I have to say this a very well thought out weather app the ui is nice clear I also like the little animations sun or moon that move in and out nice idea could be better like the widget @4.2 on my home screen again nice and clear no real complaints well worth the asking price ...",
        "It has incorrect information and is not great in certain countries, I was stood outside in the sunshine 15c and this stupid app said it was raining and 6 degrees so it's getting uninstalled"
    ],
    "recentChanges": [
        "- Discover another way to check the weather.",
        "- Forecast based on ECMWF. ©Meteored.",
        "- Chance of rain.",
        "- Sunset Theme.",
        "Our support team is always available to help if you with any questions, you can contact us at support@meteored.com"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=aplicacionpago.tiempo&hl=en&gl=us",
    "appId": "aplicacionpago.tiempo"
}