{
    "title": "paysafecard – pay cash online",
    "summary": "paysafecard - pay cash. pay safe.",
    "icon": "//lh3.googleusercontent.com/9xPP26Cn9AAknrLu6Hmjt7jP4nJhwnNeVParJGoUt07mpIoFEtLyE0vVyUnIiSDPLw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.4,
    "reviews": 22270,
    "developer": "paysafecard.com",
    "developerId": "paysafecard.com",
    "developerEmail": "info@paysafecard.com",
    "developerWebsite": "http://www.paysafecard.com/",
    "updated": "February 20, 2018",
    "version": "4.15",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "When it comes to your money, its security is just as important as being able to use it easily. The paysafecard app lets you pay online as easily, quickly and safely as paying in cash. Find sales outlets near you with the handy paysafecard app and use its built-in QR code scanner for your paysafecard PINs. The paysafecard app also lets you keep an eye on your spending and balance at all times, giving you complete control of your finances. Find sales outletsEnter your location or let your smartphone do it for you. In either case, the paysafecard app conveniently guides you to your nearest sales outlet. Check balanceCheck the balance of your paysafecard whenever you want and keep a close eye on your spending.my paysafecard*Log in to your my paysafecard account via the app, check your balance and transaction history, or top it up with another paysafecard PIN.paysafecard MasterCard*paysafecard MasterCard is a prepaid card that lets you pay in the same way as with a credit card. Top up your card from your my paysafecard account via the app and pay anywhere in the world - online and offline - where MasterCard is accepted.scan2pay*Pay using the scan2pay feature to pay even more easily and safely by simply scanning the paysafecard QR code displayed in the online shop’s payment panel with your smartphone!Promotions & competitionsReceive regular updates and the latest news about paysafecard and take part in fantastic promotions and competitions.Use your smartwatchUse your smartwatch (Google Wear) to quickly find your nearest paysafecard sales outlet!Help & infoGet useful tips and answers to frequently asked questions about paysafecard. The paysafecard app helps you quickly and easily.All the benefits at a glance:• Pay cash online without a bank account or credit card.• Find paysafecard sales outlets near you.• Check your balance whenever you want and top up your my paysafecard account by scanning paysafecard QR codes or manually entering the PINs.• Top up your paysafecard MasterCard via the app.• Have complete control of your spending and an overview of your transactions whenever you want.Do you have any questions? We’ll be happy to answer them for you: info@paysafecard.comMore information on paysafecard can also be found at www.paysafecard.com or on Facebook www.facebook.com/paysafecard or Twitter twitter.com/paysafecard.* Please note that these features are not available in all countries.",
    "descriptionHTML": "When it comes to your money, its security is just as important as being able to use it easily. The paysafecard app lets you pay online as easily, quickly and safely as paying in cash. Find sales outlets near you with the handy paysafecard app and use its built-in QR code scanner for your paysafecard PINs. The paysafecard app also lets you keep an eye on your spending and balance at all times, giving you complete control of your finances. <br><br>Find sales outlets<br>Enter your location or let your smartphone do it for you. In either case, the paysafecard app conveniently guides you to your nearest sales outlet. <br><br>Check balance<br>Check the balance of your paysafecard whenever you want and keep a close eye on your spending.<br><br>my paysafecard*<br>Log in to your my paysafecard account via the app, check your balance and transaction history, or top it up with another paysafecard PIN.<br><br>paysafecard MasterCard*<br>paysafecard MasterCard is a prepaid card that lets you pay in the same way as with a credit card. Top up your card from your my paysafecard account via the app and pay anywhere in the world - online and offline - where MasterCard is accepted.<br><br>scan2pay*<br>Pay using the scan2pay feature to pay even more easily and safely by simply scanning the paysafecard QR code displayed in the online shop&#x2019;s payment panel with your smartphone!<br><br>Promotions &amp; competitions<br>Receive regular updates and the latest news about paysafecard and take part in fantastic promotions and competitions.<br><br>Use your smartwatch<br>Use your smartwatch (Google Wear) to quickly find your nearest paysafecard sales outlet!<br><br>Help &amp; info<br>Get useful tips and answers to frequently asked questions about paysafecard. The paysafecard app helps you quickly and easily.<br><br>All the benefits at a glance:<br>&#x2022; Pay cash online without a bank account or credit card.<br>&#x2022; Find paysafecard sales outlets near you.<br>&#x2022; Check your balance whenever you want and top up your my paysafecard account by scanning paysafecard QR codes or manually entering the PINs.<br>&#x2022; Top up your paysafecard MasterCard via the app.<br>&#x2022; Have complete control of your spending and an overview of your transactions whenever you want.<br><br>Do you have any questions? We&#x2019;ll be happy to answer them for you: info@paysafecard.com<br>More information on paysafecard can also be found at www.paysafecard.com <br>or on Facebook www.facebook.com/paysafecard or Twitter twitter.com/paysafecard.<br><br>* Please note that these features are not available in all countries.",
    "histogram": {
        "1": 1738,
        "2": 470,
        "3": 1171,
        "4": 3188,
        "5": 15703
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/pb8TaAzHUFklSiy_6txppvaaw7tqAHY7TABPJryoCSOYonjHguNw7cGv68tGnAdiDCo=h310",
        "//lh3.googleusercontent.com/-CDB2nVeyjaKj1M7ejnLdZMDHHvXQ9s30AKp7KujfMmhk2CauvTQc4P-_KXOS9pHiXE=h310",
        "//lh3.googleusercontent.com/WJ_SicLaglk56woGkR0TuRthrcad-0sRdXE5dt8IJnmifmVsvzuFDL0xzbkLN1UgyGo=h310",
        "//lh3.googleusercontent.com/WUnChq27cN63ZZi5QfIUj0nakLyu2A8ccviGqA0BBxYC_4MoQxkA4Sbo0kFN2nVRkHk=h310",
        "//lh3.ggpht.com/MvlHmHr70CW54uX4C8YKt1XuIEl0-BUwCSOat3cgGcE5ouRSE2c9gdo8hixHPfDj2zk=h310"
    ],
    "comments": [
        "I wanted to try it on an online clothes shop, but I couldn't get it to work... Ended up just using it on steam. :P",
        "I thought the word card in the name stood for it being a virtual credit card.  But no what a freaken waste of money",
        "A.1",
        "It says u can use this in Lithuania but u can't...  When I want to buy one of those (cards)  everyone is confused and doesn't know what I'm talking about... No one knows paysafecards here",
        "Good application only one thing I noticed you don't give the chance to members to add 2 address for example living address and mailing address they are people using there P.o.box for secure mailing.",
        "Best app ever ,i dont need a credit card. If i dont like i can just undownload safely"
    ],
    "recentChanges": [
        "- Thanks to the Marketing department, you will be now be better informed in the app!",
        "- Ooh, paysafecard direct now offers several display options, so don't be afraid if you find a QR code.",
        "- Patch Notes: Bugfixes, bugfixes, bugfixes! And potatoes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=at.paysafecard.android&hl=en&gl=us",
    "appId": "at.paysafecard.android"
}