{
    "title": "Radioplayer Österreich",
    "summary": "The Austrian private radio stations in one app!",
    "icon": "//lh3.googleusercontent.com/oEN9nPkpr9XBMRMhjgNhjdl0WXGXUsKmfjkdd4p8tFGyhwAilhWmsn3UkjACLiMduxs=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.2,
    "reviews": 24,
    "developer": "Radioplayer Österreich",
    "developerId": "Radioplayer+%C3%96sterreich",
    "developerEmail": "support@radioplayer.at",
    "developerWebsite": "http://radioplayer.at",
    "updated": "August 10, 2017",
    "version": "3.10.306.15",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Der Radioplayer verbindet schon ab dem Start fast alle österreichischen, privat lizensierten Radiostationen auf einer Plattform. So können Hörer ihre Lieblingssender am Computer und dank der Radioplayer Apps auch auf Android Smartphones und Tablets hören. Neben den über UKW oder DAB+ ausgestrahlten Programmen bietet er außerdem Zugang zu den Webchannels und Podcasts der einzelnen Sender. Einige Sender bieten On Demand Inhalte an, durch die verpasste Sendungen zu einem beliebigen Zeitpunkt gehört werden können. Der Radioplayer ist auch auf Watches verfügbar und entwickelt sich derzeit zum digitalen Standard in modernen Autoradios, die über eine Datenanbindung verfügen.FunktionenUnter „Sender A-Z“ findet man die verfügbaren Radiosender aufgelistet. Wenn man diese anklickt, gelangt man in die Konsole des jeweiligen Senders. Dort findet man allgemeine Informationen zum Sender und kann direkt den gewünschten Webchannel zum Hören auswählen oder den Radiosender zu Meine Sender hinzufügen bzw. durch erneutes Klicken wieder entfernen. Auch eine Suche nach Inhalten (Sender oder Podcasts) ist durch das oben befindliche Suchfeld möglich.Im Menü, zu welchem man über jede der Sender-Konsolen gelangt, befinden sich die gewählten Sender (Meine Sender), zuletzt gehörte Sender sowie Empfehlungen, die sich durch die Liste in Meine Sender und der zuletzt gehörten ergeben. Dadurch erfolgt eine Personalisierung des Radioplayers.+ Auto-Modus: Große Favoriten-Buttons für die Lieblingsprogramme sorgen im Auto-Modus für sicheres Hören beim Fahren.+ Sleep-Timer: Träumen mit dem Lieblingssound. Das Radio schaltet sich rechtzeitig aus.+ Empfehlungen: Programme entdecken, die gerade im Trend liegen und zu dem passen, was man gerne hört. Sender in der Nähe: Radios aus der Nachbarschaft.",
    "descriptionHTML": "Der Radioplayer verbindet schon ab dem Start fast alle &#xF6;sterreichischen, privat lizensierten Radiostationen auf einer Plattform. So k&#xF6;nnen H&#xF6;rer ihre Lieblingssender am Computer und dank der Radioplayer Apps auch auf Android Smartphones und Tablets h&#xF6;ren. <br><br>Neben den &#xFC;ber UKW oder DAB+ ausgestrahlten Programmen bietet er au&#xDF;erdem Zugang zu den Webchannels und Podcasts der einzelnen Sender. Einige Sender bieten On Demand Inhalte an, durch die verpasste Sendungen zu einem beliebigen Zeitpunkt geh&#xF6;rt werden k&#xF6;nnen. Der Radioplayer ist auch auf Watches verf&#xFC;gbar und entwickelt sich derzeit zum digitalen Standard in modernen Autoradios, die &#xFC;ber eine Datenanbindung verf&#xFC;gen.<br><br>Funktionen<br>Unter &#x201E;Sender A-Z&#x201C; findet man die verf&#xFC;gbaren Radiosender aufgelistet. Wenn man diese anklickt, gelangt man in die Konsole des jeweiligen Senders. Dort findet man allgemeine Informationen zum Sender und kann direkt den gew&#xFC;nschten Webchannel zum H&#xF6;ren ausw&#xE4;hlen oder den Radiosender zu Meine Sender hinzuf&#xFC;gen bzw. durch erneutes Klicken wieder entfernen. Auch eine Suche nach Inhalten (Sender oder Podcasts) ist durch das oben befindliche Suchfeld m&#xF6;glich.<br>Im Men&#xFC;, zu welchem man &#xFC;ber jede der Sender-Konsolen gelangt, befinden sich die gew&#xE4;hlten Sender (Meine Sender), zuletzt geh&#xF6;rte Sender sowie Empfehlungen, die sich durch die Liste in Meine Sender und der zuletzt geh&#xF6;rten ergeben. Dadurch erfolgt eine Personalisierung des Radioplayers.<br><br>+ Auto-Modus: Gro&#xDF;e Favoriten-Buttons f&#xFC;r die Lieblingsprogramme sorgen im Auto-Modus f&#xFC;r sicheres H&#xF6;ren beim Fahren.<br>+ Sleep-Timer: Tr&#xE4;umen mit dem Lieblingssound. Das Radio schaltet sich rechtzeitig aus.<br>+ Empfehlungen: Programme entdecken, die gerade im Trend liegen und zu dem passen, was man gerne h&#xF6;rt. Sender in der N&#xE4;he: Radios aus der Nachbarschaft.",
    "histogram": {
        "1": 3,
        "2": 1,
        "3": 2,
        "4": 1,
        "5": 17
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/RFBQgqzbV2kg9F8lSDobjO0efMaKKUaNOvTZLugD3Onp1dT0PxzU03AH4wRuyFiXRw=h310",
        "//lh3.googleusercontent.com/fobjNyu0J7v2UPRErt-tu0b5obzznnQFfUG4bzxEv1tltnp8vCbhBUZjHdGbEsULyA=h310",
        "//lh3.googleusercontent.com/a4OIvuFIvcvkR34N6bVuWJC-CNtOPqYIqPtXzyZcKFntfgpFQC-mY8w1_eib3qPsBfk=h310",
        "//lh3.googleusercontent.com/3t_3qroDRvX9MNcn32wLIipTlG_jvHSAklkRZrDxTz2J-zvKWsDnqInxrj7Q4M8BmVw=h310",
        "//lh3.googleusercontent.com/_ECsTMes0dfBD4NbjGqKhkbYvf9GZtRrZj33y65G4PsMt1lkO_Gm2u_6XKrtlZnlxwI=h310",
        "//lh3.googleusercontent.com/SiaK_Bn5FZvNPdUh54ji8-ihz5teLBPrfeLB-hokvzPji_-N7zOfj7S2JPJ5Jf79myM=h310",
        "//lh3.googleusercontent.com/s7aGCon5-E_KJn56nWqBapxa37NdPhz055PXcTAVcKuEsSwQv0lqRiTPHIP1jeu2hCY=h310",
        "//lh3.googleusercontent.com/FFfFBUge4R1Id48VHJQSJvLxg33cFaNeOAot9mGeaX-61wqCaxT3-zz_fkuQlh87Uxc=h310",
        "//lh3.googleusercontent.com/elFLaq2AEzZ15PBT4GYwX79mDNZf-ZUvah6B35vhcTepXWg39waz6Rdn0AjwhNiqEWQ=h310",
        "//lh3.googleusercontent.com/6uz6UaNLYw0VCl7Frj9Vu4m4rD6yxnH3TAManNGQdCqgh2lf_a2bkz0fMd7Wshc-Jw=h310"
    ],
    "comments": [],
    "recentChanges": [
        "Fehlerbehebungen und Verbesserungen"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=at.radioplayer.android&hl=en&gl=us",
    "appId": "at.radioplayer.android"
}