{
    "title": "Pocket Casts",
    "summary": "We love podcasts, so we made an award winning app for listening to them!",
    "icon": "//lh3.googleusercontent.com/4aGFP7kTjcaxkIL38b5DPry-Na_E4ftOKHA2u0W_F1R_YAszOpPaw4-c6W7SiAz-Jg=w300",
    "price": "$3.99",
    "free": false,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.6,
    "reviews": 50108,
    "developer": "Shifty Jelly",
    "developerId": "8905816597800395524",
    "developerEmail": "androidsupport@shiftyjelly.com",
    "developerWebsite": "http://www.shiftyjelly.com/android/pocketcasts",
    "developerAddress": "ShiftyJelly Pty Ltd\n1190 Dandenong Road\nMurrumbeena VIC 3163",
    "updated": "March 1, 2018",
    "version": "6.4.10",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "description": "We love podcasts, so we made a podcast player that is full featured, beautiful and easy to use. We're no strangers to awards having been chosen as a Google Play Top Developer, a Google Play Editors Choice and winning a Google Material Design Award. Mostly though, we love you, our customers, which is why we always keep our app relevant and up to date based on your feedback.Here's what a few publications have had to say about it:Android Central: “Pocket Casts is the best podcast app for Android”The Verge: \"The best podcast app for Android\"Still not convinced? Allow us to walk you through some of our features:BEST IN SHOW Material design: Your podcasts have never looked so beautiful, colors change to complement podcast artworkThemes: Choose between dark and light display themesUniversal: Custom but familiar tablet interfacePOWERFUL PLAYBACK Up next: Build a playback queue from your favorite showsTrim silence: Cut silences from episodes so you finish them faster, saving hoursVariable speed: Change the play speed from anywhere between 0.5 to 3xVolume boost: Increase the volume of voices, while decreasing background noiseStream: Play episodes on the flyAudio & video: Play all of your favorite episodes, toggle video to audioSkip playback: Skip episode intros, jump through episodes with custom skip intervalsAndroid Auto: browse your podcasts and filters to find an interesting episode, then control playback. All without ever touching your phoneAndroid Wear: Control playback from your wristSleep timer: We'll pause your episode so you can rest your weary headChromecast: Cast episodes straight to your TV with a single tapSMART TOOLS Sync: Subscriptions, playback and filters are all securely stored in the cloud, ready to sync to the web app or iOSRefresh: Let our servers check for new episodes, so you can get on with your dayNotifications: We'll let you know when new episodes arrive, if you likeAuto download: Automatically download episodes for offline playbackFilters: Custom filters will organize your episodesStorage: All the tools you need to keep your podcasts tamedALL YOUR FAVORITES Discover: Subscribe to any podcast in iTunes and more. Browse by charts, networks and categoriesShare: Spread the word with podcast and episode sharingOPML: Jump on board without any hassle with OPML import. Export your collection at any timeThere are many more powerful, straight-forward features that make Pocket Casts the perfect podcasting app for you. So what are you waiting for?Visit pocketcasts.com for more info about Pocket Casts for the web and iOS.",
    "descriptionHTML": "We love podcasts, so we made a podcast player that is full featured, beautiful and easy to use. We&apos;re no strangers to awards having been chosen as a Google Play Top Developer, a Google Play Editors Choice and winning a Google Material Design Award. Mostly though, we love you, our customers, which is why we always keep our app relevant and up to date based on your feedback.<br><br>Here&apos;s what a few publications have had to say about it:<br>Android Central: &#x201C;Pocket Casts is the best podcast app for Android&#x201D;<br>The Verge: &quot;The best podcast app for Android&quot;<br><br>Still not convinced? Allow us to walk you through some of our features:<br><br>BEST IN SHOW <br>Material design: Your podcasts have never looked so beautiful, colors change to complement podcast artwork<br>Themes: Choose between dark and light display themes<br>Universal: Custom but familiar tablet interface<br><br>POWERFUL PLAYBACK <br>Up next: Build a playback queue from your favorite shows<br>Trim silence: Cut silences from episodes so you finish them faster, saving hours<br>Variable speed: Change the play speed from anywhere between 0.5 to 3x<br>Volume boost: Increase the volume of voices, while decreasing background noise<br>Stream: Play episodes on the fly<br>Audio &amp; video: Play all of your favorite episodes, toggle video to audio<br>Skip playback: Skip episode intros, jump through episodes with custom skip intervals<br>Android Auto: browse your podcasts and filters to find an interesting episode, then control playback. All without ever touching your phone<br>Android Wear: Control playback from your wrist<br>Sleep timer: We&apos;ll pause your episode so you can rest your weary head<br>Chromecast: Cast episodes straight to your TV with a single tap<br><br>SMART TOOLS <br>Sync: Subscriptions, playback and filters are all securely stored in the cloud, ready to sync to the web app or iOS<br>Refresh: Let our servers check for new episodes, so you can get on with your day<br>Notifications: We&apos;ll let you know when new episodes arrive, if you like<br>Auto download: Automatically download episodes for offline playback<br>Filters: Custom filters will organize your episodes<br>Storage: All the tools you need to keep your podcasts tamed<br><br>ALL YOUR FAVORITES <br>Discover: Subscribe to any podcast in iTunes and more. Browse by charts, networks and categories<br>Share: Spread the word with podcast and episode sharing<br>OPML: Jump on board without any hassle with OPML import. Export your collection at any time<br><br>There are many more powerful, straight-forward features that make Pocket Casts the perfect podcasting app for you. So what are you waiting for?<br><br>Visit pocketcasts.com for more info about Pocket Casts for the web and iOS.",
    "histogram": {
        "1": 1370,
        "2": 1187,
        "3": 1982,
        "4": 7033,
        "5": 38536
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ISmTimcMoBogZGokz8G0ZYWYwFrzwa79-I_0eexrHrqyY97q1WIoU2DDti_mz_OtfO0=h310",
        "//lh3.googleusercontent.com/N35WQ6-jNytSpm4A2JlHiRv96-QskmLQX9sQY-aWZT0vdedsq9hMrysjwalXUq8I6C6s=h310",
        "//lh4.ggpht.com/3PMTfvKu4SwzWjU-lMooLhFb4VxOkO-zJbxAm2nQGF_4M6ePTLq8yvcsbZTCKDtCkngr=h310",
        "//lh5.ggpht.com/QF7683VLgxDzlOOLHQFVKKXl54E7R7MKVkJWgNKRFZqHVW5do8bJH2rUmMGUUJDWoBwK=h310",
        "//lh5.ggpht.com/SO1Oa0TtcemeD3KurRfeIPUq5t_SqqzPvJ_7-jFjwcykEgiuxkTkcOKGwlZWGU9GjuA=h310",
        "//lh6.ggpht.com/0Dz0Kj3C9zVlRbe6fau-wF_sJlT6yI7ZpXNIcvMYr96_uqVuuLUbN_zDN4LDZF7qYYE=h310",
        "//lh5.ggpht.com/k0P__AfTMfALTxgTWYnpq52-jDjvGRut4sXLcop1HAntXPRfUBk-aRrsTyJnRO8phw=h310",
        "//lh4.ggpht.com/Jh4dEBxgRXO8RpqHDU9eZHT88hrvCdmB3TaxMEwJVRAsxVfpetHjUSLTlHd3tNEte5U=h310",
        "//lh3.ggpht.com/bP8RYFKtlmELp2183NkfDZVJXyIz6tOGrF64jBT9CBWvUeL41yitVyp9PZqGI4bn9g=h310",
        "//lh3.googleusercontent.com/CcxH1xGzK3bIqv4gEdF31JCZyg_5yzZeFhvvQVRuJmCB_ZEXHihlfLXnSbfjCusHTqip=h310",
        "//lh4.ggpht.com/XSUE1I7t69zKAdhR5wWgDE0qshu_bSM3rdfrokqV47dgRf6jjjh94vhoy1KKTosOLzA=h310",
        "//lh5.ggpht.com/5TuQHrXnmOxhFXWT7J0dqq8gacxdrX_7z1Bbh1hyIYli2nfzMB3BjfluZhZmF1zr9yA=h310",
        "//lh6.ggpht.com/N9lZk79mO9cCiPYexPl3wUsm6qXYXfrxlBlYqFgATeICIN07t4vq4MpTGnX9TE-Svg=h310",
        "//lh4.ggpht.com/PGUp3A92RheSSNnUEdHHwSg3vfdSzHBp_hGxwPRYFl4-fgEgPLmgJavqQhHepGWSIQ=h310",
        "//lh4.ggpht.com/i5PkqXYWiAYpwW1vFB3p3OtMNmY0ktBSr59f0XAzIQwQ1irYv64LbxsOIK8mNatng60=h310",
        "//lh6.ggpht.com/1Kpyz0HneBKwVz4Mp11tEMzBTQ4AsEGx39H6rEXLnRAYEQr18b5QsWwcdB_vXJOAbSvo=h310",
        "//lh5.ggpht.com/y_uotMPshEs7ziGYNt70mj6A1FGkMOyR91zjvpg0gf0ljQg4cStc_NssNXqpszOQqq0=h310",
        "//lh3.ggpht.com/h-6Hh1CqzEPMqIh0a1adKOPUlPKisI7Cus2PPNkYKDc1e_rUEnBDmSF0JQO3ZmEgFqng=h310",
        "//lh5.ggpht.com/EinaoX83DZUpNFC7B07QIVfUpU7tSyt4cAqq0o9Qnc-OJgFIkX4U2f7fM5YbSoSJF4Y=h310",
        "//lh5.ggpht.com/8tI41uFx3FfbyW8_FgyI_cTZ8YJFxNZpLleBdQXJhKJtJ7g_iqSH4G2fYvg9zt0WxVg=h310"
    ],
    "video": "https://www.youtube.com/embed/Jj6nF2NCDTA",
    "comments": [
        "Great app, just one problem that is pretty big (to me, at least). Unless you completely disable all notifications for the app, it shows what you're listening to on the lock screen. This mean I also don't get notifications for when new episodes are released nor can I easily pull down the notification bar to pause a podcast.  Other than this, the app is great. It's simple to use, you can easily search for new podcasts and it reliably syncs across all devices",
        "I use this app for at least 2 hours a day. I'm not sure what I'd be doing without it.  The previous version had an issue where the app would crash when re-ordering my \"up next\" podcasts, but this new version has fixed the problem.  Worth buying without a doubt. The devs really do care.",
        "I had to edit my review because it was old and needed to be 5 stars and I needed to say I absolutely love this app. Always read the app updates, because Shifty Jelly brings a little humor to them. Awesome app; two thumbs, five stars.",
        "I dare say it's the most beautiful podcast app as far as they go. However it's a bit light on features. I often feel the need to explore the episodes and descriptions available in a podcast feed and even listen to a couple before hitting the subscribe button.",
        "This is hands down one of my favorite apps! It works like it should. My podcasts sync between my phone and tablet easily and the ability to cast podcasts to my Google Home speaker groups is amazing! On top of all the features, the app looks beautiful with its elegant material design and smooth animations. The developers are quick to issue updates and fixes. I highly recommend this app.",
        "My favorite podcasting app. However, there's  recent changes I don't care for and would cause me to give it a poor rating.  . . . on my main playlist the podcasts are eliminated after they're played. Please allow me to clean up the playlists myself. I often return to the list for shownotes, to re-listen, etc. I dont seem to have that option now. I habe often hunted through long schedules of older casts to add them to my playlist. Now, if I want to return to the podcast on my playlist it is gone! Please return it back to how it was OR instruct me how to enable cleaning up the list myself."
    ],
    "recentChanges": [
        "Version 6.4.10:",
        "- Fixed some layout issues to do with rotation (which btw where all your fault, you're rotating it wrong people!)",
        "- Fixed stats page loading issue (yes we have stats, go check them out in Settings!)",
        "- Fixed an issue where episodes wouldn't be removed from playlists after being played",
        "- Fixed some issues with table rows and playback and download progress",
        "- Used two exclamation points in update notes just so you know we're serious!!",
        "- Dammit that's 4 now. See what you made us do?"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=au.com.shiftyjelly.pocketcasts&hl=en&gl=us",
    "appId": "au.com.shiftyjelly.pocketcasts"
}