{
    "title": "Feed Baby - Baby Tracker",
    "summary": "🍼 The perfect Baby Tracker. Tracks your babys breastfeeding, diapers sleeps. 🍼",
    "icon": "//lh3.googleusercontent.com/CBrmH0L49GvJoBlz06Q-WFzOZ7xw9m5g347vWo1QZF5zT2x7I8N68h6NsY0yVXPvdAE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 74813,
    "developer": "Penguin Apps",
    "developerId": "8558223608151028037",
    "developerEmail": "support@penguinapps.com.au",
    "developerWebsite": "https://www.feedbaby.com.au",
    "developerAddress": "P.O. Box 517\nChadstone Centre\nVIC, 3148",
    "updated": "February 14, 2017",
    "version": "25.2.7",
    "genre": "Parenting",
    "genreId": "PARENTING",
    "description": "The perfect breastfeeding and baby tracker.. Join over 1.2 million new parents who have used Feed Baby to log and record all aspects of their newborn’s development. This is the only app you will need to care for your little one.With this world class breastfeeding baby tracker you will never have to write anything down again! Feed Baby simplifies the logging and recording of your newborns breast feeds so that you can have more free time to yourself.Featured on the Google Play home page under \"Apps for New Parents\" and \"Wellbeing Apps\" Suitable breastfeeding logger and baby tracker for new parents to care for babies aged 0 to 5.★ Easily track your baby’s breastfeeding / bottle / solids / diaper / nappy / sleeps / pumpings / medicines / baths and journals with a single touch.★ Device-to-Device Synchronization between any number of devices so that Mom and Dad always knows whats going on!★ 44 WIDGETS to help you access key features from the home screen. You'll find a widget for any of your needs!★ Log 2 Babies (only available when Feed Baby Pro is installed). Supports Twins!★ Timelines shows you all of your activities across multiple days so that you can have a better understanding of your newborn activity patterns★ Record new events on your Android Wear watch★ Comprehensive charts, graphs and reports★ 16 different Themes/Skins!★ Export your entire Feeding History. You can then print it out for further analysis by yourself or your doctor★ Full screen clock is displayed during feeds so you can check at a glance the amount of time that has elapsed during a feed★ Individual feeds are grouped automatically into \"Feeding Sessions\"★ Fully customisable alarms to remind you when to breast feed and change your baby diapers.★ Fully supported with regular updates. 'Feed Baby' is a fully supported product. And we provide email support for any questions you have or issues you may encounter.Permissions Explained-------------------------------Following are the permissions we require, along with an explanation for eachREAD_EXTERNAL_STORAGE/WRITE_EXTERNAL_STORAGE - Required for handling syncing. Feed Baby writes and reads files to storage during the syncing process to ensure the proper syncing of your data. It is also required for storing the images of your child.",
    "descriptionHTML": "<b>The perfect breastfeeding and baby tracker.</b>. Join over 1.2 million new parents who have used Feed Baby to log and record all aspects of their newborn&#x2019;s development. This is the only app you will need to care for your little one.<br><br>With this world class breastfeeding baby tracker you will never have to write anything down again! Feed Baby simplifies the logging and recording of your newborns breast feeds so that you can have more free time to yourself.<br><br><b>Featured on the Google Play home page under &quot;Apps for New Parents&quot; and &quot;Wellbeing Apps&quot; </b><br><br>Suitable breastfeeding logger and baby tracker for new parents to care for babies aged 0 to 5.<br><br>&#x2605; Easily track your baby&#x2019;s breastfeeding / bottle / solids / diaper / nappy / sleeps / pumpings / medicines / baths and journals with a single touch.<br>&#x2605; Device-to-Device Synchronization between any number of devices so that Mom and Dad always knows whats going on!<br>&#x2605; 44 WIDGETS to help you access key features from the home screen. You&apos;ll find a widget for any of your needs!<br>&#x2605; Log 2 Babies (only available when Feed Baby Pro is installed). Supports Twins!<br>&#x2605; Timelines shows you all of your activities across multiple days so that you can have a better understanding of your newborn activity patterns<br>&#x2605; Record new events on your Android Wear watch<br>&#x2605; Comprehensive charts, graphs and reports<br>&#x2605; 16 different Themes/Skins!<br>&#x2605; Export your entire Feeding History. You can then print it out for further analysis by yourself or your doctor<br>&#x2605; Full screen clock is displayed during feeds so you can check at a glance the amount of time that has elapsed during a feed<br>&#x2605; Individual feeds are grouped automatically into &quot;Feeding Sessions&quot;<br>&#x2605; Fully customisable alarms to remind you when to breast feed and change your baby diapers.<br>&#x2605; Fully supported with regular updates. &apos;Feed Baby&apos; is a fully supported product. And we provide email support for any questions you have or issues you may encounter.<br><br><br>Permissions Explained<br><br>-------------------------------<br><br>Following are the permissions we require, along with an explanation for each<br><br>READ_EXTERNAL_STORAGE/WRITE_EXTERNAL_STORAGE - Required for handling syncing. Feed Baby writes and reads files to storage during the syncing process to ensure the proper syncing of your data. It is also required for storing the images of your child.",
    "histogram": {
        "1": 1166,
        "2": 714,
        "3": 2643,
        "4": 21709,
        "5": 48581
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/msrvj2r-vkfwKUXO1yoHanI6OlSOemzW4bYco0tO4bKBWwgRy0YxZJqeqrrmnZBaQiM=h310",
        "//lh3.googleusercontent.com/Q-D8_i4lBVsFTh5_J8tBcxegNqTOJaAUqfyHXAGcj3QNwUdTuDM_usmW6qUz1NnLrg1B=h310",
        "//lh3.googleusercontent.com/yqoFJZ6I-6zL02bppCSymIhLPNaz-R6Q4y2xdv3MZQfgLueGwqn0GNkme001JzXdOcrZ=h310",
        "//lh3.googleusercontent.com/Q6IPnpXi8aFDPUsGSamffHZOdc8D74XVDnUjrQBixoZ45xpsnpOVOsNquqtuQtS8h1A=h310",
        "//lh3.googleusercontent.com/7lsSrVyL-JdmSw83_npXupGMgS8hkaLmieuJnFhYYvSaEW3eL5Yzz_XY15Mu1VwU4ok=h310",
        "//lh3.googleusercontent.com/1Z7RgHk_RJytP3g4YjIFFd7BlSEv1nmVCGop3EHXsf4cJVeEQozhtWZxBHHs3HlxwDE=h310",
        "//lh3.googleusercontent.com/ESTf25CRxGrW-Sh8LhdAAOcdFdQIsd_MVPEWcFxepPA-qT-HD0p6NuVga4igpRSw3_U=h310",
        "//lh3.googleusercontent.com/1q9WS91OcMaIDnLWwtqDz1HIbu6SXO0c9lzWoXCBE43PIvhE_lusLSkBpr2dCYlVMxA=h310",
        "//lh3.googleusercontent.com/um6mLbPcF1F5YgoyWkscmHYL3GEfR6w5-gXLQp6zjCYu9CxdEoJGLbPEpqlrcFMBaA=h310",
        "//lh3.googleusercontent.com/NfUEtaw-nB0EIhDEalJ8Z-1IgHUPdA6lX1kmHRNE9egKwquALEicbNK_Vh1rVw9lA9Cc=h310",
        "//lh3.googleusercontent.com/rnICAgA4JKQPTwe2anf0iOqJObqcECWGHqpg68UZPXlFhNp_G8GfWsosXJ3GfQeS3pc=h310",
        "//lh3.googleusercontent.com/g6MnZ4Q-ULgT31NHU-aBBksNfs31wjZjwTehHHWcsLHc6LPcsbsbsMqp4Vb_BYhR-Q=h310",
        "//lh3.googleusercontent.com/qCP-wwG4bQ8YR5AN9yTdTkGl2Nh7u9tc3Pj6SmVn8gevOP5V7jL5tdSIvyPP0SyYPQ=h310",
        "//lh3.googleusercontent.com/C0_Pvp7445asN2v9tnZdcNWazTnfY-7ijbntLcYHtZMiULsuEON0poue-LboU-EHoJXB=h310",
        "//lh3.googleusercontent.com/SMRzqjrVx8H_ICqhkj7oDjpr9WMwU-EjjEIUP9HYGKA4dTrfZtVeEUhdVtYdqrEht0sS=h310",
        "//lh3.googleusercontent.com/VQCeAN5o6ZA2i9-nTPW9xpMnZ63Akzc1PxC3ApF0k56cAPfl_9COuFB8vDbogv05yA=h310",
        "//lh3.googleusercontent.com/eOQDX_HqM3mgjvyBqGdw5fX1Oxq57DEpbPIBWS2h_LLkK_SJFzkJmsphxJHN0uo5Hg=h310",
        "//lh3.googleusercontent.com/lFSlS5wvrCUSnkrMGVbpzqn5pMnGqm2q3chx6F2NwzS1KaikciJAdR8054eQkkMHbA=h310",
        "//lh3.googleusercontent.com/JeJv9DlJvpZkkLpsR2aIAhi2-ZSPgAJzu8KabicC_Ni91nHzSA8N8BVove8m-K7has5M=h310",
        "//lh3.googleusercontent.com/z2a_9_HNBCVbK0BFoI0JvnoE62QYQtmMNqVqXTVchIJscKnb3fgztHHSI1dG1y22j5c=h310",
        "//lh3.googleusercontent.com/7EPe00i0Kr8aZ_NshBV624nSXIZEfEVa9CmeTp03s0xRR0zTZQywK7IFcA4owd4xnSmw=h310",
        "//lh3.googleusercontent.com/sSAQkdjAH6zNwudygcr2YC6u5_e5C0738Ww15Kic3CYhdrgmBwO9wTaZa4sWyqqUpQk=h310",
        "//lh3.googleusercontent.com/43pw0C3W5YrWZHJY3GvgpBLCYImVjSg2SL0DXNUEq76ShQdkvJjgsibg8dPsNvRE2g=h310",
        "//lh3.googleusercontent.com/lh8GfwrUSR7HDaLpDpbQm3Cx_5RC98mPv1yuuft-IkSfUxL8cHOWOhF4YenTfWHdYLkm=h310",
        "//lh3.googleusercontent.com/FXtacnM39fbg079vdYJ2KQkRYRb9Y5yz6K0xroBK1wfDTO_j99HEZedUML60q3qAMfo=h310",
        "//lh3.googleusercontent.com/JeXJSIurYj7d5QWl1VONlfCSyyMIh8XrXT6wavE21y36T3FsDQLmRptUQVOF7h6smmg=h310"
    ],
    "video": "https://www.youtube.com/embed/BcXhb3RC7hg",
    "comments": [
        "Certain features are only free for 20-30 days. Then the app takes away those features. I've never heard of an app do that. Kind of shady on the developers part. Otherwise, App is easy to use and very user friendly. So much better than writing everything down. Just wish I would've known about this sooner. Unfortunately, the app stopped letting me and my wife sync and required upgrade to even look at timeline or summary. It was great for 2 weeks and then just kind of cut us off.",
        "I love this app and have used it with all my kids. From birth it was extremely helpful with keeping track of feedings and diapers. Now that my youngest are 2 and 4 I use it most to track medication, temperature and sickness. This app is wonderful and I'm so happy I purchased it 4 years ago. It has been well worth the money I spent. Not to mention there have been updates added throughout the years that make this app even better. Very user friendly. I used/use this alot when taking my kids to the doctor as it literally has everything the Dr wants to know on it. Highly recommended from this mother of 5!!",
        "If I could give this app more stars I would! We just had our first child and since our brains are utter mush with excitement and love for our newborn, we are lucky to get both shoes on the right feet, let alone chart bathroom stuff and which boob is getting more attention from our new baby. This app makes it all very easy. I can't imagine doing this without this app!",
        "I love this app! I ended up buying it to upgrade free version and it was worth every penny. I use it daily to track feeds (including solids), diaper changes, baths, temperature, meds, shots & doc visit weight & length. My baby is going on 8 months & I couldn't function without it especially at the beginning when I was sleep deprived & couldn't remember a thing. Best baby app in my opinion",
        "Very complete. Only issue is sometimes the sync does not seem to always be in immediate real time. I have Android, wife has IOS and we both had to pay $5 each for the priveledge if auto sync and yet it's not 100%. Also even after paying for \"premium\" they force you to write a review to remove that request that is plastered on the screen. Really their items should reduce to 3 stars but the app itself is very well done, thorough and intuitive.",
        "Suffices for everything it claims to do. Easy to use, making it helpful to keeping on track, therefore serving it's sought out purpose. Would suggest adding some options to be more detailed in the diaper logs, with the chances of it being a topic mentioned at least once between a parent and their pediatrician. Also another great convenience would ultimately be the option to add and customize your own tasks or journals while having the ability to edit and priorities with existing ones alike. I really like this app and I plan to stick with it. Unless of course, one comes along just like this one but with those features included ;) Thanks for the app as is, I must say. Makes my head hurt less than trying to keep track of everything by memory."
    ],
    "recentChanges": [
        "Added a toggle in the Setting screen to hide the summary on the Today screen.",
        "Added a Summary of key events to the top of the \"Today\" screen. It gives you a quick overview of where things are at immediately upon opening the Today screen. Check it out!",
        "Oh, and by the way ... if you enjoy Feed Baby and if it is helping you to track your newborn then please consider taking a moment (when you have the time of course!) to leave us a review. Thanks!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=au.com.penguinapps.android.babyfeeding.client.android&hl=en&gl=us",
    "appId": "au.com.penguinapps.android.babyfeeding.client.android"
}