{
    "title": "Domino’s",
    "summary": "A Domino’s Store in Your Pocket",
    "icon": "//lh3.googleusercontent.com/n_CKp3YtEOTGsYrl6UHYyJS1G9Qwc-8-J6qTAbJlFWBA4HERCR0ZTEBMuhpZlZsdPfHC=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.5,
    "reviews": 7777,
    "developer": "Domino's Pizza Enterprises Limited",
    "developerId": "Domino's+Pizza+Enterprises+Limited",
    "developerEmail": "feedback@dominos.com.au",
    "developerWebsite": "http://www.dominos.com.au",
    "updated": "January 15, 2018",
    "version": "Varies with device",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "size": "Varies with device",
    "description": "Want a Domino’s store anywhere, anytime? Now you can with the Domino’s app!     Introducing DRU Assist™ Beta - Your personal pizza ordering assistant. Order with your voice, or just type.Features:-\tIntroducing DRU Assist™ Beta-\tAndroid Pay now supported! -\tNew On Time Cooking is now available so your pizza is ready as soon as you walk in to store to pick up your order.-\tReceive notifications for great deals from your local store-\tQuickly and easily scan your credit card details using the camera on your phone -\tOrder in just 2 taps on your Android Smart Watch when reordering one of your favourite Quick Orders -\tOrder in as little as 4 clicks with Quick Order-\tSave a Fast Favourite Quick Order for faster ordering-\tReceive Live Pizza Tracker push notifications on the progress of your order directly to your Android device-\tBuild a better pizza using Domino’s Pizza Chef®-\tOrder your favourite pizzas, sides and desserts from the easy to navigate menu-\tCheck out quickly and easily with the PayPal payment option*Pricing shown may not be representative of pricing within the Ordering App",
    "descriptionHTML": "Want a Domino&#x2019;s store anywhere, anytime? Now you can with the Domino&#x2019;s app!<br><br>     Introducing DRU Assist&#x2122; Beta - Your personal pizza ordering assistant. Order with your voice, or just type.<br><br>Features:<br>-\tIntroducing DRU Assist&#x2122; Beta<br>-\tAndroid Pay now supported! <br>-\tNew On Time Cooking is now available so your pizza is ready as soon as you walk in to store to pick up your order.<br>-\tReceive notifications for great deals from your local store<br>-\tQuickly and easily scan your credit card details using the camera on your phone <br>-\tOrder in just 2 taps on your Android Smart Watch when reordering one of your favourite Quick Orders <br>-\tOrder in as little as 4 clicks with Quick Order<br>-\tSave a Fast Favourite Quick Order for faster ordering<br>-\tReceive Live Pizza Tracker push notifications on the progress of your order directly to your Android device<br>-\tBuild a better pizza using Domino&#x2019;s Pizza Chef&#xAE;<br>-\tOrder your favourite pizzas, sides and desserts from the easy to navigate menu<br>-\tCheck out quickly and easily with the PayPal payment option<br><br>*Pricing shown may not be representative of pricing within the Ordering App",
    "histogram": {
        "1": 1762,
        "2": 521,
        "3": 905,
        "4": 1430,
        "5": 3159
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/_svwkjll4Idjfv3BloH7g7Zt_CSmArxeyFJFDyTpXGi0wfAttmQo86CqpV_s0Yij7g=h310",
        "//lh3.googleusercontent.com/K8Lt_FFhbGhNVDEs5g1F0YBQJ96EysfYu9iz0KXNi2XfiR7k9mm3dfsmbGPUQ7GVNuA=h310",
        "//lh3.googleusercontent.com/ClIZL82J-0KbvT5FqSwHHmGXX0t4CrVLEFbSDNpPFdOfdh6VuvBunrr9FE1ttRWUfV4=h310",
        "//lh3.googleusercontent.com/zOxO7Txfy2uxb7zHqVUYLOB7yGk_UtuqbaN-MPIt8P3BwN6ZCvMMR4UmcVjku1RkD3JA=h310",
        "//lh3.googleusercontent.com/5LnGRBv2Yk63iUNqiZzmBgKq7vnRT9WzDpa1x0e-NOM2RgwihpSl4bRZ3Vl0KPd9ug=h310",
        "//lh3.googleusercontent.com/Volzb_aaIKGi9bAaKMkG4fI0jjA-XoOiPSZ4QgD7p97SKTzZdOP06hm1oVaNnLTclQ=h310",
        "//lh3.googleusercontent.com/x5h6GjtApUmuME4GkV1bAo8dgCoPPuRHxO33k70dDvBbBfGoS-T4eMayEuyL8Q5siw=h310",
        "//lh3.googleusercontent.com/7HhHC2jE1uTPsa8rn0VN4T0SaIAGV1y1ysUR4VKAccc9VGPnsLrJwcANUdGNI6K4A8k=h310",
        "//lh3.googleusercontent.com/CUlU1hYR8ddE-ZEv0y3QR3V9HTnrxz-1--GnTbzhy55e_XlHEodFSbxE9I-MUuvsz2E=h310",
        "//lh3.googleusercontent.com/qk-cHPVCcy98jKgOeojj4pwtDmb72tp-UKBa-K7Pt6l5YznXAy7DdfaYACrpYQbUvA=h310"
    ],
    "comments": [
        "Is this really an Android app? So sluggish. Slow. Not fluid at all. seems like in app HTML brwosr is used. Even the website is slow. It took me 20 min to place an order for one pizza.  Rather than spending so much in your marketing ( getting emails everyday) ,spend some on better server infrastructure",
        "App will not go past the wooden background screen when opened. Totally useless since the last update. Why can't you just leave things alone when they work instead of stuffing them up. Well Pizza Huts app works OK. You've lost me Dominos.!!!!!",
        "App is completely useless. Won't let me go past the screen to select pick up or delivery. And that's when I finally got the app to actually load! Using a Samsung galaxy 8 and have uninstalled and reinstalled. Still nothing. Just lost business off us sorry!",
        "Overall, I'm happy with the app - I can order from the menu and receive my order. However, it would be nice, if you make a mistake with the ordering store or delivery/pick up time, if the app allowed you to change those details mid order rather than having to cancel the order and start all over again. Being able to access store specific vouchers within app would be great too. Also, why present me with the option of paying $3 to guarantee 20 minute delivery then not actually make it selectable? Annoying...",
        "Some pizzas don't even show up on the app (eg. Chicken, bacon and avocado). Not a fan of the ordering process order, where you have to start your with location, pickup or delivery before you even get to see the menu.",
        "Need an option to add extra base sauce. I always have to call the store after i order and most of the time they are rude and tell me 'you should have done it online' but it doesnt give you the option."
    ],
    "recentChanges": [
        "- Performance and stability optimisations"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=au.com.dominos.olo.android.app&hl=en&gl=us",
    "appId": "au.com.dominos.olo.android.app"
}