{
    "title": "AutomateIt Pro - Easy task automation for Android",
    "summary": "Turn your smartphone into a genius-phone!",
    "icon": "//lh5.ggpht.com/2QBsyy6BPV3QuacOykNELYdnVYRvrY2ZWE-JgaScCqEpqyY2banVIio4YG2HuVLd5FI=w300",
    "price": "$2.99",
    "free": false,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.1,
    "reviews": 5974,
    "developer": "SmarterApps Ltd",
    "developerId": "8202756898217994038",
    "developerEmail": "support@automateitapp.com",
    "developerWebsite": "http://automateitapp.com",
    "developerAddress": "Petah-Tikva, Israel",
    "updated": "August 31, 2017",
    "version": "4.0.227",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "AutomateIt is designed to make your life easier by automating various tasks on your Android smartphone or tablet.AutomateIt Pro has all the goods that the free version has and it's an ad-free, popup-free version with some awesome new and advanced features (ALL locked features of the free version are unlocked with AutomateIt Pro)Limited time offer: Pro users don't need points to download rules from the rules marketwww.androidapps.com - \"Cool and innovative!\"AutomateIt Pro provides a set of useful rules:Conserve power when battery level is lowQuiet at night when screen is offVibrate mode during meetingsMax volume when headset unpluggedLower volume when headset pluggedUnmute by SMSAutomatically turn on/off speaker during call using proximity sensorAnd more...The advanced features included in this version are:• Composite Triggers - use more than a single trigger for each rule using AND/OR logic between these triggers• Composite Action - execute several actions as a result of a single trigger (which can be a composite trigger)• Rule Active Period - set an active period for each rule. Really useful if you only want a certain rule to be active only during daytime, weekends, just an hour a day etc.• Sensor Trigger - utilize all your device' sensors as a trigger for a desired action. This includes usage of all the sensors supported by Android - Accelerometer, Light, Proximity etc.• Calendar Trigger - monitor events on your different calendars• Enable/Disable Screen Lock Action - Enables or disables your screen lock slide/pattern/password/pin• Cancel delayed execution by trigger - Auto-cancel delayed execution when defined trigger is launched• Cell ID Trigger - Trigger when connecting or disconnecting from defined cellular cells (Unlimited number of predefined saved locations)• Recurring Event Trigger - Executes a defined action every defined time interval• Copy Rule - Create a new rule, based on an existing oneVisit the developer's website for user guide for these new features.If you are upgrading from the free version, follow these simple steps for an easy upgrade:Backup your existing rules from the main screen menuUninstall AutomateIt free versionInstall AutomateIt ProRestore your backed-up rulesNote: Some features might require root - see description of free version or visit developer's website.Want to AutomateIt with your own language ? visit http://automateitapp.com/translateit.Currently supports English, German, Spanish, Hebrew, Polish, Danish, French, Italian, Czech, Slovak, Romanian, Chinese, Hungarian, Portuguese, Japanese, Koreanת Dutch and Russian.",
    "descriptionHTML": "AutomateIt is designed to make your life easier by automating various tasks on your Android smartphone or tablet.<br><br>AutomateIt Pro has all the goods that the free version has and it&apos;s an ad-free, popup-free version with some awesome new and advanced features (ALL locked features of the free version are unlocked with AutomateIt Pro)<br><br>Limited time offer: Pro users don&apos;t need points to download rules from the rules market<br><br>www.androidapps.com - &quot;Cool and innovative!&quot;<br><br>AutomateIt Pro provides a set of useful rules:<br>Conserve power when battery level is low<br>Quiet at night when screen is off<br>Vibrate mode during meetings<br>Max volume when headset unplugged<br>Lower volume when headset plugged<br>Unmute by SMS<br>Automatically turn on/off speaker during call using proximity sensor<br>And more...<br><br>The advanced features included in this version are:<br>&#x2022; Composite Triggers - use more than a single trigger for each rule using AND/OR logic between these triggers<br>&#x2022; Composite Action - execute several actions as a result of a single trigger (which can be a composite trigger)<br>&#x2022; Rule Active Period - set an active period for each rule. Really useful if you only want a certain rule to be active only during daytime, weekends, just an hour a day etc.<br>&#x2022; Sensor Trigger - utilize all your device&apos; sensors as a trigger for a desired action. This includes usage of all the sensors supported by Android - Accelerometer, Light, Proximity etc.<br>&#x2022; Calendar Trigger - monitor events on your different calendars<br>&#x2022; Enable/Disable Screen Lock Action - Enables or disables your screen lock slide/pattern/password/pin<br>&#x2022; Cancel delayed execution by trigger - Auto-cancel delayed execution when defined trigger is launched<br>&#x2022; Cell ID Trigger - Trigger when connecting or disconnecting from defined cellular cells (Unlimited number of predefined saved locations)<br>&#x2022; Recurring Event Trigger - Executes a defined action every defined time interval<br>&#x2022; Copy Rule - Create a new rule, based on an existing one<br><br>Visit the developer&apos;s website for user guide for these new features.<br><br>If you are upgrading from the free version, follow these simple steps for an easy upgrade:<br>Backup your existing rules from the main screen menu<br>Uninstall AutomateIt free version<br>Install AutomateIt Pro<br>Restore your backed-up rules<br><br>Note: Some features might require root - see description of free version or visit developer&apos;s website.<br><br>Want to AutomateIt with your own language ? visit http://automateitapp.com/translateit.<br>Currently supports English, German, Spanish, Hebrew, Polish, Danish, French, Italian, Czech, Slovak, Romanian, Chinese, Hungarian, Portuguese, Japanese, Korean&#x5EA; Dutch and Russian.",
    "histogram": {
        "1": 483,
        "2": 360,
        "3": 519,
        "4": 1257,
        "5": 3355
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/2Dy-iHU_25X5WTGarSjddZRa34rj_YTeq1WbKmP2tJ-BSZjUF03SqY7u74Wv27JxqEGr=h310",
        "//lh3.googleusercontent.com/PqAlIYsnkGoFDCW-RLKZWy8Dbl8mYES7k0ghcObB1cXVDVA5kclL_hnpykiJPzSkQxD9=h310",
        "//lh3.googleusercontent.com/JcifvnmsB08hzFbfQ4s9qT1h-iWwYG6ai9-q2FyTBfUW565dUv5QyfAL_dDFuTMGbw=h310",
        "//lh3.googleusercontent.com/MUZjNNAv_b9ytU5YQVisRvdeL6Byeo1niGgDNm4j1OvPePWWZpPYPJhdnUxXgD4atQ=h310",
        "//lh3.googleusercontent.com/WlLWDFKDc_6jR6aRHKwWAHrTILbi3mYPVnIo-fBbiH3ioW4pUH99LQyNQJ6KGZ_KfSg=h310",
        "//lh3.googleusercontent.com/ll3lLY2eUpUAtOUVBdF6dl5UGtAVrrAW_-eCFqLs3VARDqm2hvLzYZzgGHhmUQsO4g=h310",
        "//lh3.googleusercontent.com/0ZaSWW-F3ENSfN83LvS7TSL9g0HMtDWwPDR2HcuOojpo0NASjmv95AKzDg4hWL5GJw=h310",
        "//lh3.googleusercontent.com/1wGTfnu2DOKmHMCiar1prbPDLxbUNAB4Zmn63EozHN2SraalDNWztt7oXxlWH0OocQo=h310",
        "//lh6.ggpht.com/VYRxzPqqmB-lkuX4tHubsdg5GX4FK8-RAXu6lJopRUK9ssG2tbWSG9qNrkxxeL8eEg=h310",
        "//lh3.googleusercontent.com/qMSHKkipFz6D1WxVwUoD_tw7Ooq-goSo1jtnOH09mkTAtzts-RlNVVSU81tNnquLcANc=h310"
    ],
    "video": "https://www.youtube.com/embed/hfnguZ2XMMM",
    "comments": [
        "Love you devs. Love this app. Using it for couple years. Please add support for tizen watches.   When one has 30+rules, it can get quite confusing and unorganized to find the right rule. Maybe a colour customization/grouping option to categorize our rules? Thanks!",
        "I have the paid version. By and large works OK. But definitely not foolproof.   I use it to play chimes every hour. Often does not play the entire tune but barely for a second or so.   Also the screen on off Plugin does not work on either Note 4 or on Asus Laser 2. So have to trigger a regular screen on off app which sort of defeats the purpose of using AutomateIt in the first place!   Closes in the background for Nougat. So none of the rules work. Rules execute only if the app is in the foreground.  There most certainly is scope for a LOT of improvement.  Till then 3 stars.",
        "A great app all around! Small request: How about Phillips Hue integration? IFTT has it, but it is not as detailed as your app.",
        "This is a great app. It allows you to do some things beyond the default capabilities. I have a suggestion for an added feature though: allow testing of rules by bypassing the trigger.",
        "Appalling tech support! Sent a debug report with problem description 4 months ago and  no reply!? Have been using it for a long time and thought of it to be an excellent app until it developed a problem of triggering  alarming sound on each rule trigger which is impossible to stop. Purchased version.",
        "Previous versions worked well, but now rules fire only rarely.  The rules market is also not working.  No response from support."
    ],
    "recentChanges": [
        "• Set notification bar icon to show only when notification bar is pulled",
        "• Bug fixes",
        "Help us translate AutomateIt at http://translate.automateitapp.com",
        "Join our Beta Users Group at http://goo.gl/PRgQGA"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=AutomateItPro.mainPackage&hl=en&gl=us",
    "appId": "AutomateItPro.mainPackage"
}