{
    "title": "BBC News",
    "summary": "The official BBC News app for UK audiences.",
    "icon": "//lh3.googleusercontent.com/YkvNw6IQ4J5NjeCOETH0qgUjtz7v5zLqaiT8BFtX1_QYffYXwvnl02WNaoNRtWWzJNs4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 3.9,
    "reviews": 107149,
    "developer": "Media Applications Technologies for the BBC",
    "developerId": "Media+Applications+Technologies+for+the+BBC",
    "developerEmail": "news@mediaapptech.com",
    "developerWebsite": "http://www.bbc.co.uk/news/help-30119608",
    "updated": "February 15, 2018",
    "version": "Varies with device",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "size": "Varies with device",
    "description": "Get the latest breaking news from the BBC and our global network of journalists. The app also offers the BBC News Channel streamed live, social features and personalisation so you can re-order the news categories to suit your interests. Key features:Top Stories brings you the latest, breaking news from our trusted global network of journalists.My News is a feature allowing you to personalise your news offering.Add topics wherever you see the + icon for a quick route straight to the stories you care about.Stories from topics you add will appear in your personalised My News feed. Here you can order stories by topic or time, and use the Manage Topics screen to stay on top of the news of the day.Find content fastThe app can suggest topics based on your location, stories you’ve recently viewed and what’s in the news now.And you can quickly find content and topics that interest you using the Search. Choose from the familiar list of BBC News indexes such as Politics, Business, Entertainment and Health or search for your own subjects of interest whether they’re people, places, things or themesMore of the news you care aboutWe now offer a fuller selection of stories from the newsroom, including:- Most Read and Most Watched. Keep on top of popular stories across the BBC, regularly updated throughout the day - Live BBC News channel, up-to-the-minute reports available 24-hours a day- Read the best journalism from BBC correspondents- Access to our full range of video and audio- Photo galleries and full-screen imagesOther features:- Push notifications for breaking news stories- Video over 3G and wifi- Improved offline experience. Download the latest stories when you have a signal and then read them at your leisure - Settings to allow the app to automatically update in the background- Share stories to your social networks, or email/SMS to a friend- Home screen widgets. Configurable to reflect your choice of topics, resizable to suit your screen layout and stylable to view as a headline or list widget- Font controls to increase or decrease the story text size to suit you- Related stories, related topics. Go deeper into a storyline with suggestions for further reading and viewing and a range of topics related to each story If you choose to receive push notifications, a unique identifier relating to your device will be stored by ProcessOne on behalf of the BBC to provide you with the service. No other personal data relating to you (such as a username or email address) is processed. The BBC will keep your information secure and not share it with anyone else in accordance with the BBC’s Privacy and Cookies Policy, available at http://www.bbc.co.uk/privacy/You can choose to unsubscribe from push notifications in the app’s settings screen.Permissions- INTERNET: Used to get the latest news content from the BBC- ACCESS_NETWORK_STATE: Used to determine whether you are on 3G or Wifi to deliver the best quality content- WAKE_LOCK: Used if you enable background updates in settings- GET_ACCOUNTS: Used to determine if your device is capable of receiving Push messages- C2D_RECEIVE/C2D_MESSAGE: Used to receive Push messages if you opt in- ACCESS_COARSE_LOCATION: Allows the app to suggest news based on your location (Android 4.0 and above)- READ_SYNC_SETTINGS/WRITE_SYNC_SETTINGS/AUTHENTICATE_ACCOUNTS: Used for managing background updates to get the latest news content from the BBC (Android 4.0 and above)",
    "descriptionHTML": "Get the latest breaking news from the BBC and our global network of journalists. <br><br>The app also offers the BBC News Channel streamed live, social features and personalisation so you can re-order the news categories to suit your interests. <br><br><b>Key features:</b><br><br><b>Top Stories</b> brings you the latest, breaking news from our trusted global network of journalists.<br><br><b>My News</b> is a feature allowing you to personalise your news offering.<br>Add topics wherever you see the + icon for a quick route straight to the stories you care about.<br>Stories from topics you add will appear in your <b>personalised My News feed</b>. Here you can <b>order stories by topic or time</b>, and use the <b>Manage Topics</b> screen to stay on top of the news of the day.<br><br><b>Find content fast</b><br>The app can suggest topics based on your location, stories you&#x2019;ve recently viewed and what&#x2019;s in the news now.<br>And you can quickly find content and topics that interest you using the <b>Search</b>. Choose from the familiar list of BBC News indexes such as Politics, Business, Entertainment and Health or search for your own subjects of interest whether they&#x2019;re people, places, things or themes<br><br><b>More of the news you care about</b><br>We now offer a fuller selection of stories from the newsroom, including:<br>- <b>Most Read</b> and <b>Most Watched</b>. Keep on top of popular stories across the BBC, regularly updated throughout the day <br>- <b>Live BBC News channel</b>, up-to-the-minute reports available 24-hours a day<br>- Read the best journalism from <b>BBC correspondents</b><br>- Access to our full range of <b>video and audio</b><br>- <b>Photo galleries</b> and <b>full-screen images</b><br><br><br><b>Other features:</b><br>- <b>Push notifications</b> for breaking news stories<br>- Video over 3G and wifi<br>- Improved <b>offline experience</b>. Download the latest stories when you have a signal and then read them at your leisure <br>- Settings to allow the app to automatically <b>update in the background</b><br>- <b>Share stories</b> to your social networks, or email/SMS to a friend<br>- <b>Home screen widgets</b>. Configurable to reflect your choice of topics, resizable to suit your screen layout and stylable to view as a headline or list widget<br>- <b>Font controls</b> to increase or decrease the story text size to suit you<br>- <b>Related stories, related topics</b>. Go deeper into a storyline with suggestions for further reading and viewing and a range of topics related to each story <br><br>If you choose to receive push notifications, a unique identifier relating to your device will be stored by ProcessOne on behalf of the BBC to provide you with the service. <br><br>No other personal data relating to you (such as a username or email address) is processed. The BBC will keep your information secure and not share it with anyone else in accordance with the BBC&#x2019;s Privacy and Cookies Policy, available at http://www.bbc.co.uk/privacy/<br><br>You can choose to unsubscribe from push notifications in the app&#x2019;s settings screen.<br><br><br><b>Permissions</b><br>- INTERNET: Used to get the latest news content from the BBC<br>- ACCESS_NETWORK_STATE: Used to determine whether you are on 3G or Wifi to deliver the best quality content<br>- WAKE_LOCK: Used if you enable background updates in settings<br>- GET_ACCOUNTS: Used to determine if your device is capable of receiving Push messages<br>- C2D_RECEIVE/C2D_MESSAGE: Used to receive Push messages if you opt in<br>- ACCESS_COARSE_LOCATION: Allows the app to suggest news based on your location (Android 4.0 and above)<br>- READ_SYNC_SETTINGS/WRITE_SYNC_SETTINGS/AUTHENTICATE_ACCOUNTS: Used for managing background updates to get the latest news content from the BBC (Android 4.0 and above)",
    "histogram": {
        "1": 11385,
        "2": 7346,
        "3": 9897,
        "4": 29198,
        "5": 49323
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone 10+",
    "screenshots": [
        "//lh3.googleusercontent.com/CvErDHQEw__vORv7pn3jHv_fN7qMOJqihLA-adZckn-TP5dvaTSV6Am6pPlCg6TDTS4=h310",
        "//lh3.googleusercontent.com/GMnkT_EINS9rx_wbN-E1CunXcSCPWW04mh16bLiQEyuzEsu-sdMnRT7eevE3rEynNQ=h310",
        "//lh3.googleusercontent.com/20hcaguaFllEbzXXu6M2tVAlXMylGSFvNsDBT7IIyLS1Ihw5iI7jjQQ4VT7PyOGW3VM=h310",
        "//lh3.googleusercontent.com/i1JrPQBmygGL6-HbIaUrhOA2oy5j3fF1YnajK6SiYywCSezcK_7faEhDaWb2y_L9MKc=h310",
        "//lh3.googleusercontent.com/Sw0VRdLhjZjbrbFAOB1XjlEq4smumdr14mQENCsMe1oDc7LDh7Hl2UxavR2-8GTRYw=h310",
        "//lh3.googleusercontent.com/CKSpMwKG4BO8z2rxAzBVe8WRzCBuEJZrTgK4ynHBlPh3Zg0KryXOUdivtbFakak0E5Ve=h310",
        "//lh3.googleusercontent.com/aUB6z3HecXVe5-vsm91KHE3ttdEjSREnM3s5tCKlBujSeZC54D5GDjCsqYzxBX5vgxI=h310",
        "//lh3.googleusercontent.com/Uj5Kp99HmgoFT-tUyN6sjJ6Knjzg7E9bZJN4B8WRNEUSFweNTkNf74tbPeBRGsxJCQ=h310",
        "//lh3.googleusercontent.com/YDDp4h-RMUf77aP73aoNH4Cxv5kkn6bdckUEywu41GCsctnloJ58wKrDdY_DWY_aKdo=h310",
        "//lh3.googleusercontent.com/tpTti3v0D3BdP9anqFpEDBdqVvgeQmxiob1Ly8QuYMltFXj9xKHMMJxxZ6iEniphXQ=h310",
        "//lh3.googleusercontent.com/vNeR3O9tG2XpVgV_iRoY_EwgEPHwIu3ZNslcxGntLsr6uOBFmY2KkH7NLsivshXIink=h310",
        "//lh3.googleusercontent.com/WqaewbvsS-g-vB4JFC9lm8FtqzOXUIKx8Ttpm9Qi5OQdzMPuXhAYgo_6_PueA7f8JMYx=h310",
        "//lh3.googleusercontent.com/sjmUieDfs-yH9oL7JaBrs_X0efWvXwCQlTnA1ZQ1PFtAP327_nNl8ACtfKkZuHiZcN8=h310",
        "//lh3.googleusercontent.com/u7zP91oEiPNIvSz2IKZHJndJhIHZAig3ZUJA0nwQ_Qd1W0vGXVyImFjpv6JrPOJf35Q=h310",
        "//lh3.googleusercontent.com/Rxnabvsel5JpO-FMSHoYxtcYrILdnZnog-qIINvbeEQpojFAcX27PdkhPZFceNxsE0k=h310",
        "//lh3.googleusercontent.com/hBlkDnY6ujR2d9ic86GgA0r5RjgNC-ilbCKHWpNi39EROwNW12mGLBRYy1HLFzsr0e4=h310",
        "//lh3.googleusercontent.com/_yjh8Vn_5x_47rpYzC9JGC7V-z_i3_R3uWK-tFjer1PR3WUmwy16HWm_B3wS1bTLhIc=h310",
        "//lh3.googleusercontent.com/r9s6WQxzKmC8fcKrrs-GBo2VjzoUpeJbYnht0FZi4tsFBKbLCaX-rdlDRX4EoNeSYEQ=h310"
    ],
    "video": "https://www.youtube.com/embed/BhsQI9vdopY",
    "comments": [
        "Used to have all my favourite topics easily on the top sliding bar. Now all missing. E.g.. football, formula 1, sport, now all missing. Tried to add them back once again. But says I've still got them all added to topics.  No I'm not searching for my topics  when a perfectly good app was working great before update. Please get it sorted. Always use this app, such a shame it's ruined in the update..  :0/",
        "Over the past few years, it has been made increasingly difficult to navigate through different news topics. It started years ago when users were forced to place topics into \"my news\" just to be able to see them on the nav bar, and now users can't even see them at all without clicking \"my news\", an additional hurdle. Poor UX design, thought better of the BBC - meant to be a professional service.",
        "Looking at other reviews, this isn't a new opinion. The changes to layout putting My News into one tab have significantly reduced the apps ease of use. There should at least be an option to display it the other way.  The result of the change is that I now find it harder to get to the news I want to read about. I am unlikely to continue using this version of the app.",
        "In the last update I've had to go from a five star rating to one star. The reason is that where all my favourite topics used to be listed on the top navigation bar, I now have to drill down a few levels in order to find them, and even then it is a case of scrolling through a load of pages rather than being able to go straight where I want. As a result I've largely stopped using the BBC news app.",
        "Somebody deleted my comment presumably because they did not like what I said. The new menu structure is rubbish! It is a massive backwards step. It would be much better to have the old menu system. It would also be better if they concentrated on having a login system using the licence number and postcode. That way we licence payers can see all the content when abroad instead of having huge chunks missing. I pay the licence fee and expect to be able to see what I pay for.",
        "Recent updates have ruined the formatting of articles on a tablet device to the point where the app is unpleasant to use, all images are full screen and it is just one long linear mess if full screen image then text then another full screen image then more text. Previously the images were a reasonable size and the text would flow around the image, much more present to read and use. Please revert to previous format !"
    ],
    "recentChanges": [
        "In this release, we’ve made some changes to how you find your way around the app:",
        "- Simplified menus",
        "- Improved accessibility",
        "- Your topics now have a new home in the My News tab",
        "- You can access the Search function from all sections",
        "As always we’ve squashed some bugs and made some enhancements behind the scenes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=bbc.mobile.news.uk&hl=en&gl=us",
    "appId": "bbc.mobile.news.uk"
}