{
    "title": "BBC News",
    "summary": "Download the official BBC News app for international audiences.",
    "icon": "//lh3.googleusercontent.com/Iip-8Yn3PLAzecCMb4ZaHTvFObl3ETUWZmd5zLflhbB6BXKyNc5aM4hrGAA9NXSs7i0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.3,
    "reviews": 281567,
    "developer": "BBC Worldwide (Ltd)",
    "developerId": "BBC+Worldwide+(Ltd)",
    "developerEmail": "mobileapps@bbc.co.uk",
    "developerWebsite": "http://www.bbc.com/news/help-30119608",
    "developerAddress": "BBC Worldwide Limited\nTelevision Centre\n101 Wood Lane\nLondon\nW12 7FA",
    "updated": "December 13, 2017",
    "version": "Varies with device",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "size": "Varies with device",
    "description": "The BBC News app has been completely redesigned with a fresh look and feel to bring you more content, greater personalisation and better overall performance. So you can get more of the news that matters to you.Key features:Top Stories brings you the latest, breaking news from our trusted global network of journalists.My News is a newly introduced feature allowing you to personalise your news offering.Add topics wherever you see the + icon for a quick route straight to the stories you care about.Stories from topics you add will appear in your personalised My News feed. Here you can order stories by topic or time, and use the Manage Topics screen to stay on top of the news of the day.You can also switch the My News by Topic screen to a more traditional carousel view from the Settings screen. Find content fastThe app can suggest topics based on stories you’ve recently viewed and what’s in the news now.And you can quickly find topics that interest you using the Topic Search. Choose from the familiar list of BBC News indexes such as Business, Technology, Entertainment and Health, or search for your own subjects of interest, whether they’re people, places, things or themes.More of the news you care aboutWe now offer a fuller selection of stories from the newsroom, including:- Most Read and Most Watched. Keep on top of popular stories across the BBC, regularly updated throughout the day - Live BBC World Service Radio. Expertise and insight from our journalists available 24-hours a day and ready to listen to in the background as you browse- Read the best journalism from BBC correspondents- Access to our full range of video and audio- Photo galleries and full-screen imagesOther features:- Push notifications for breaking news stories- Video over cellular and wifi- Improved offline experience. Download the latest stories when you have a signal and then read them at your leisure - Viewing modes. See more stories per index by choosing ‘Compact layout’ from the Settings screen- Settings to allow the app to automatically update in the background- Share stories to your social networks, or email/SMS to a friend- Support for dynamic text. The app will respect the font size in your device settings so you can increase or decrease the story text size as suits your preference- Related stories, related topics. Go deeper into a storyline with suggestions for further reading and viewing and a range of topics related to each storyIf you choose to receive push notifications, a unique identifier relating to your device will be stored by ProcessOne on behalf of the BBC to provide you with the service.No other personal data relating to you (such as a username or email address) is processed. The BBC will keep your information secure and not share it with anyone else in accordance with the BBC’s Privacy and Cookies Policy, available at http://www.bbc.com/privacy/You can choose to unsubscribe from push notifications from your device’s Notifications screen: locate the BBC News app icon from the list and turn off ‘Allow Notifications’.",
    "descriptionHTML": "The BBC News app has been completely redesigned with a fresh look and feel to bring you more content, greater personalisation and better overall performance. So you can get more of the news that matters to you.<br><br>Key features:<br>Top Stories brings you the latest, breaking news from our trusted global network of journalists.<br>My News is a newly introduced feature allowing you to personalise your news offering.<br>Add topics wherever you see the + icon for a quick route straight to the stories you care about.<br>Stories from topics you add will appear in your personalised My News feed. Here you can order stories by topic or time, and use the Manage Topics screen to stay on top of the news of the day.<br>You can also switch the My News by Topic screen to a more traditional carousel view from the Settings screen.<br> <br>Find content fast<br>The app can suggest topics based on stories you&#x2019;ve recently viewed and what&#x2019;s in the news now.<br>And you can quickly find topics that interest you using the Topic Search. Choose from the familiar list of BBC News indexes such as Business, Technology, Entertainment and Health, or search for your own subjects of interest, whether they&#x2019;re people, places, things or themes.<br><br>More of the news you care about<br>We now offer a fuller selection of stories from the newsroom, including:<br>- Most Read and Most Watched. Keep on top of popular stories across the BBC, regularly updated throughout the day <br>- Live BBC World Service Radio. Expertise and insight from our journalists available 24-hours a day and ready to listen to in the background as you browse<br>- Read the best journalism from BBC correspondents<br>- Access to our full range of video and audio<br>- Photo galleries and full-screen images<br><br>Other features:<br>- Push notifications for breaking news stories<br>- Video over cellular and wifi<br>- Improved offline experience. Download the latest stories when you have a signal and then read them at your leisure <br>- Viewing modes. See more stories per index by choosing &#x2018;Compact layout&#x2019; from the Settings screen<br>- Settings to allow the app to automatically update in the background<br>- Share stories to your social networks, or email/SMS to a friend<br>- Support for dynamic text. The app will respect the font size in your device settings so you can increase or decrease the story text size as suits your preference<br>- Related stories, related topics. Go deeper into a storyline with suggestions for further reading and viewing and a range of topics related to each story<br><br>If you choose to receive push notifications, a unique identifier relating to your device will be stored by ProcessOne on behalf of the BBC to provide you with the service.<br>No other personal data relating to you (such as a username or email address) is processed. The BBC will keep your information secure and not share it with anyone else in accordance with the BBC&#x2019;s Privacy and Cookies Policy, available at http://www.bbc.com/privacy/<br>You can choose to unsubscribe from push notifications from your device&#x2019;s Notifications screen: locate the BBC News app icon from the list and turn off &#x2018;Allow Notifications&#x2019;.",
    "histogram": {
        "1": 12502,
        "2": 8227,
        "3": 19310,
        "4": 72228,
        "5": 169300
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone 10+",
    "screenshots": [
        "//lh3.googleusercontent.com/yyKTXHMlm2Py2sT8ixZ1nV_pHb55YGr-ktOR6NciZ_2MrzU9vel7-5Q048YXbgyKZlk=h310",
        "//lh3.googleusercontent.com/S8lx3YyBkBBQ6SFlQSyx2F7BJD3yQFSp69mka1WPBY42Ol8PW_ep1eZYBIet78HitQ=h310",
        "//lh3.googleusercontent.com/ZX1v6hA6P011Y8cNzApKQ1aBBshhZagvRZkap4EUzgVImHuXvG0s2p1zQYxI8H5Dmxw=h310",
        "//lh3.googleusercontent.com/Egsh2WcarFrcba85vzntjZUFzsx4kCbFJIgPWCcasowCSToRZmArocrvS40Ri__pU30=h310",
        "//lh3.googleusercontent.com/WsOlO4qg2Io8DNEQhSH1himyA6V6tg7uxBH5hdLjeNUCTHEJp96j7UaMcM7YNem2ZQ=h310",
        "//lh3.googleusercontent.com/Driad29qDyn32zvyo7vsG0ULZUGQfdP9KQJvDKa75oPYeVGKNZJrVvMbnqyDc7CSsqI=h310",
        "//lh3.googleusercontent.com/nLTA4gCO6ZEPQ6xcIwXSPUHvB-9yAGPwqlMs6T_z02hz6LDdGcZgLL5uj42BZSZk4NE=h310",
        "//lh3.googleusercontent.com/Lh053JmciOkDvnfZvhJXoxFvOUgRLetizL8GTNKIcPewwY4KW0ikENoHr0-He7BE8g=h310",
        "//lh3.googleusercontent.com/TwkRMKQjd9w9ndlP7oT49oWN5eemRe6zBGyPdEdzFJqnNi8GjExFUEYIGLFW5eTLhmA=h310",
        "//lh3.googleusercontent.com/0ZZ2vECQs2PB8A-0DcDX46QIg7ybcmnMv0618YOwcUe0LwvBhFrejUZIHEB6DLeTqPg=h310",
        "//lh3.googleusercontent.com/8hSw5Qbaw3FkXcB76hKin5pqP7c7Xf6FcX8bhEmup5Yxw6OSA_mhZccdPW5m6SMREUE=h310",
        "//lh3.googleusercontent.com/nKc081rS-1UvR3bKp7fAykEjQQCU4NHbsdepu85f5Hq56pLMr8fTkEBm43KSLoms7Q=h310",
        "//lh3.googleusercontent.com/QG_GA46g61jOejKRBetcX3n3OwaL0iw7wkAxTR_QTcTWFAORsGGSzCE3jhFTtLVvYL4=h310",
        "//lh3.googleusercontent.com/U5bBHcBAf_eehxg0EOvYIwYH6moJ820brZhw5tSEcmsi1l8ONSmISVK27kPSUpVcGA=h310",
        "//lh3.googleusercontent.com/1FqHt1a-QsN0eGDRsNTKnDQ1v41BudDPqijPyAoQUcX-QRjQEZE_GP3UfQwDqi1uEw=h310",
        "//lh3.googleusercontent.com/XzeE7IzrZsF5lR9nkVVxVpoHBnVX-6YqOFmo1PJIBQahpP_GimUUV8y3hwPk6bkQmg=h310",
        "//lh3.googleusercontent.com/QdyMz-gmtWfG_3EU7KPnFycok12rMFgDsSpKkRiZ_tcg1ppM04SVxi9U2PvwZHRxNw=h310"
    ],
    "comments": [
        "It's good if want to read the news, works well. When it comes to any video content on the app it simply doesn't work most of the time. I can get and ad playing at the beginning of the video, but the video itself can't be displayed. Sometimes it requires to open another bbc media player and even after i install it, it won't open majority of the videos, just displaying the error.",
        "News stories are generally impartial and informative but many fluff pieces have come up, and we never seem to be able to escape new stories about the royalty.  Mostly just mad the videos rarely work and the companion BBC media app works maybe one in 20 times. Get a decent I.T. division geez.",
        "Great news app if you just want to read text news. Any videos that feature in the app never ever play successfully. But the ads that play before the video play perfectly fine. I try to play the video 2-3 times and only the ad plays, but never the content video. Sometimes just the audio plays and no video. I guess they are just interested in the ad revenue. I love BBCs unbiased and quality reporting, but the app needs serious troubleshooting. And yes, you also receive random \"content  does not appear to be working\" messages.",
        "Great articles, widget stops getting data and media player often does not work. And you have to watch 30 second ads in full only to find out that your video won't play. This app has some serious, longstanding problems they apparently can't or don't want to fix.",
        "I love the BBC app which I downloaded from Google Play for free. I have been using this app for years now and it catches me up on the biggest stories in a short time. As a US resident it gives me a taste of the largest international stories which I really appreciate. I also like the video highlight clips which are usually interesting and iften quirky but always pertinent.",
        "The app has nice design, but lately I have been struggling with the videos. There are many long annoying adds and then only blank screen with sound, no video. And please make it possible to move the app to the SD card, it's quite big..."
    ],
    "recentChanges": [
        "We release regular updates to the BBC News app to fix issues and improve performance."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=bbc.mobile.news.ww&hl=en&gl=us",
    "appId": "bbc.mobile.news.ww"
}