{
    "title": "MD Player",
    "summary": "Meet MD Player, a brand new music player for Android.",
    "icon": "//lh3.googleusercontent.com/qajOFSe6ik3dXgfWsmP8s3HFvvwlaDmL6_Q-bqOGp6LwMIac5CEneIpz2tegpJWVkLxo=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.3,
    "reviews": 1628,
    "developer": "MobiDev Corporation",
    "developerId": "MobiDev+Corporation",
    "developerEmail": "mobidevpublisher@gmail.com",
    "developerWebsite": "http://mobidev.biz",
    "updated": "July 6, 2017",
    "version": "Varies with device",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "size": "Varies with device",
    "description": "Are you still in search of a perfect music player for your Android smartphone? Are you an avid listener of audiobooks? Do you listen to music while driving? If yes, here's MD Player – your best music player created by MobiDev!Free of charge. No ads. Just the experience of listening to your favorite music.What do you get with MD Player?• Ease in use. You spend less time on controlling, more on listening. Our app embraced Material Design for your convenience.• Supported formats: aac, mp3, m4a, wav, ogg, flac.• Drive Mode. Adapted buttons and gestures to control the player while driving.• Compatibility with Android Auto.• Support for Android Wear.• Album covers never looked that great on a smartphone screen before.• Once you select a directory for music library, internal folders will be assembled in playlists for your convenience. You may easily create custom playlists as well.• Powerful equalizer and beautiful widgets to enhance and customize your listening experience.We'd appreciate your feedback about our product – we want to keep it perfect for you.",
    "descriptionHTML": "Are you still in search of a perfect music player for your Android smartphone? Are you an avid listener of audiobooks? Do you listen to music while driving? If yes, here&apos;s MD Player &#x2013; your best music player created by MobiDev!<br><br>Free of charge. No ads. Just the experience of listening to your favorite music.<br><br>What do you get with MD Player?<br><br>&#x2022; Ease in use. You spend less time on controlling, more on listening. Our app embraced Material Design for your convenience.<br>&#x2022; Supported formats: aac, mp3, m4a, wav, ogg, flac.<br>&#x2022; Drive Mode. Adapted buttons and gestures to control the player while driving.<br>&#x2022; Compatibility with Android Auto.<br>&#x2022; Support for Android Wear.<br>&#x2022; Album covers never looked that great on a smartphone screen before.<br>&#x2022; Once you select a directory for music library, internal folders will be assembled in playlists for your convenience. You may easily create custom playlists as well.<br>&#x2022; Powerful equalizer and beautiful widgets to enhance and customize your listening experience.<br><br>We&apos;d appreciate your feedback about our product &#x2013; we want to keep it perfect for you.",
    "histogram": {
        "1": 83,
        "2": 64,
        "3": 115,
        "4": 321,
        "5": 1045
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/59kWYpIfwKDy87_DQ5y3ahS39P6NOCKzMdVxxw4-pH8ih1x1Q_U4EPaOsb9IAnVidJc=h310",
        "//lh3.googleusercontent.com/9nMPe_b-rfkGc4deIvunwlxmDPaApCLP-VTT0sn4e4ZQd98dFGnDfm1zh0xjhHQTM78=h310",
        "//lh3.googleusercontent.com/SV-eYl49BO_NfE-kahVfPeIdWVYKrXSiYS4FL6uD_6zqM1ROzfhbEJVpOGnhGozqqQ=h310",
        "//lh3.googleusercontent.com/1ADMBOp198aCMB7eQzi8uscdz_7JylcJMg5WNR0vo4G4H5Xlf4tHsRvbtXB5A3IH-gY=h310",
        "//lh3.googleusercontent.com/pVgHQoPWCOM43kXO5kqpmmdSZcHpCc3SQuUbQojSMLJ3iDOMkgfPJJk8_vvctaGQCw=h310",
        "//lh3.googleusercontent.com/vioSAl6S4zrz9ZcxT9MFjEH-OYd18go-51M4di3rvbGPqVCk6HCFeTIShgt3kJnXVw=h310",
        "//lh3.googleusercontent.com/PCdAC3hBfrKh7xC6YoE1tTEG-NxUvdveWhbbM5Tib0A6a3IAwMbQwoKeYtX-DjjYTg=h310"
    ],
    "video": "https://www.youtube.com/embed/eOXPMgykgJY",
    "comments": [
        "Best player app for me. I've been using it for about a year. I like that it supports android auto, reads my music collection from the sd card, and has a reasonable simple-to-use interface. The only problem I have is that the recent version stopped keeping track of where I am in the default \"All Music\" playlist; I need to reselect it and start from the beginning every time.   2017-12-07 - It has stopped working with Android Auto. It freezes when I access the playlist menu. I'm using a MotoX Pure edition running Android 7.",
        "Crashes android auto when selecting \"folder/play list\" from side menu. Artist songs mixed alphabetically instead of proper \"artist-album-song# order. Samsung S7 edge android 7.0 verizon. Still looking for a touch menu driven local storage music player for android auto. Because google music doesn't know how to play albums that have the same title as one of their songs.",
        "I think is one of the best music app out there, great design and easy to use. But I have to give it this review because I have problems with Android Auto, sometimes I can only play one song in Android Auto and after the first one the next song doesn't sound.  2018/02/25: Hi! my device is a Honor 8 with Android 7.0",
        "Downloaded for Android Auto, but it doesn't resume playback or remember the last played song. Playlists are not separated from the folders/albums list, meaning more scrolling to listen to what you want. Could definitely use more work, but it lets me play all my music whereas Play Music won't.",
        "Overall it serves it's purpose (playing music) and I am able to use it with Android Auto.  Few issues that I think that developer can fix and make this app better: 1) Not able to edit the created playlist. User can only create a new list, add more songs into the existing list or delete the list entirely. User should be able to remove songs from the existing list. 2) The \"repeat one\" function does not work properly, it stops playing after completing the entire song. 3) While resuming the app, it freezes occasionally.  4) My pending play list sometimes became empty while resuming the app.",
        "I use this with Android Auto... It works but browsing for playlists, artists, and albums is a mess. Everything is dumped into one long list. No organization. So I can play songs, but finding specific things is not practical.  It needs proper organization and browsing categories. Artist/Playlists/Albums/etc when used with Android Auto."
    ],
    "recentChanges": [
        "• Material design"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=biz.mobidev.mdplayer&hl=en&gl=us",
    "appId": "biz.mobidev.mdplayer"
}