{
    "title": "Easy - taxi, car, ridesharing",
    "summary": "The largest on-demand transportation app in Latam, Saudi Arabia, and Jordan.",
    "icon": "//lh3.googleusercontent.com/Vr1Rnu8CuL6HjMdZFDJ2c3Q4tR5YQKOWL8Ft1DNbgQDrY_qO-XOAX-J7CLU_gvnLlQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.4,
    "reviews": 396916,
    "developer": "Easy Taxi",
    "developerId": "5092374325783016319",
    "developerEmail": "contact@easytaxi.com",
    "developerWebsite": "http://www.easytaxi.com",
    "updated": "March 2, 2018",
    "version": "Varies with device",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "size": "Varies with device",
    "description": "★★★ Now with a totally revamped interface and a seamless service selection experience. Because you deserve a choice. ★★★ Find out why more than 25 million users in 420 cities trust Easy. Enjoy the ride!Features - Fast: We always assign the nearest car to pick you up. - Safe: We thoroughly train our partners. Rating system helps select best drivers. - Efficient: Book a regular taxi or arrive in style with EasyPremium. Save up to 40% by sharing the ride with others.** The availability of services vary per location.How to use - Wait for the app to automatically locate your address using GPS. - Confirm your location. We suggest you add your credit card to unlock extra features. - Tap “Request here\" and watch how Easy assigns a nearby driver. Follow him on the map and in minutes he’ll be at the location you requested.LocationsYou can hail with Easy in the following places: - Argentina: Buenos Aires, Cordoba, Rosario - Bolivia: Santa Cruz de la Sierra, La Paz, Cochabamba - Brazil: São Paulo, Rio de Janeiro, Recife, Belo Horizonte, Brasília, Salvador, and 99 more cities! - Chile: Santiago, Iquique, Antofagasta.  - Colombia: Bogotá, Cali, Medellín, Cartagena, Bucaramanga, and 15 more cities  - Costa Rica: San José - Ecuador: Quito, Guayaquil, Cuenca - Jordan: Amman - Mexico: Mexico City, Queretaro, Cancun, Guadalajara, Leon, Monterrey, Puebla, Mexicali, Playa del Carmen, Merida - Panama: Panama City - Peru: Lima, Arequipa, Cusco, Trujillo, Piura, Chiclayo - Saudi Arabia: Riyhad, Jeddah, Dammam - Uruguay: Montevideo - Venezuela: Maracaibo, Valencia, Cabimas, Ciudad Ojeda, BarquisimetoAwards & RecognitionEasy is a recipient of multiple awards for its pioneering technology and ridesharing services. This includes Startup Weekend 2011, TNW Brazil 2012, Spark 2013, Vulcan Post 2014, and eCommerce Uruguay 2015. Still hesitating? Find out what users are saying - Nearly 90% of our reviews are 4- and 5-star!Support TeamWebsite: www.easytaxi.comEmail: contact@easytaxi.com",
    "descriptionHTML": "<strong>&#x2605;&#x2605;&#x2605; Now with a totally revamped interface and a seamless service selection experience. Because you deserve a choice. &#x2605;&#x2605;&#x2605; </strong><br>Find out why more than 25 million users in 420 cities trust Easy. Enjoy the ride!<br><br><strong>Features</strong><br> - Fast: We always assign the nearest car to pick you up.<br> - Safe: We thoroughly train our partners. Rating system helps select best drivers.<br> - Efficient: Book a regular taxi or arrive in style with EasyPremium. Save up to 40% by sharing the ride with others.*<br><br>* The availability of services vary per location.<br><br><strong>How to use</strong><br> - Wait for the app to automatically locate your address using GPS.<br> - Confirm your location. We suggest you add your credit card to unlock extra features.<br> - Tap &#x201C;Request here&quot; and watch how Easy assigns a nearby driver. Follow him on the map and in minutes he&#x2019;ll be at the location you requested.<br><br><strong>Locations</strong><br>You can hail with Easy in the following places:<br> - Argentina: Buenos Aires, Cordoba, Rosario<br> - Bolivia: Santa Cruz de la Sierra, La Paz, Cochabamba<br> - Brazil: S&#xE3;o Paulo, Rio de Janeiro, Recife, Belo Horizonte, Bras&#xED;lia, Salvador, and 99 more cities!<br> - Chile: Santiago, Iquique, Antofagasta. <br> - Colombia: Bogot&#xE1;, Cali, Medell&#xED;n, Cartagena, Bucaramanga, and 15 more cities <br> - Costa Rica: San Jos&#xE9;<br> - Ecuador: Quito, Guayaquil, Cuenca<br> - Jordan: Amman<br> - Mexico: Mexico City, Queretaro, Cancun, Guadalajara, Leon, Monterrey, Puebla, Mexicali, Playa del Carmen, Merida<br> - Panama: Panama City<br> - Peru: Lima, Arequipa, Cusco, Trujillo, Piura, Chiclayo<br> - Saudi Arabia: Riyhad, Jeddah, Dammam<br> - Uruguay: Montevideo<br> - Venezuela: Maracaibo, Valencia, Cabimas, Ciudad Ojeda, Barquisimeto<br><br><strong>Awards &amp; Recognition</strong><br>Easy is a recipient of multiple awards for its pioneering technology and ridesharing services. This includes Startup Weekend 2011, TNW Brazil 2012, Spark 2013, Vulcan Post 2014, and eCommerce Uruguay 2015. Still hesitating? Find out what users are saying - Nearly 90% of our reviews are 4- and 5-star!<br><br><strong>Support Team</strong><br>Website: www.easytaxi.com<br>Email: contact@easytaxi.com",
    "histogram": {
        "1": 23756,
        "2": 9835,
        "3": 21298,
        "4": 64746,
        "5": 277281
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Sm3OZ159ed-ND0eWQKkE4l_WMTlMDDnyj-RFJXHHYkVU3B6-8rQVesARWkK7Lx57xZY=h310",
        "//lh3.googleusercontent.com/DZhnJQc2sn8jXVs3MqP5yUNBvzpTLtrDulMJnWV_6lyR5ZNM0-aZidlMZ_yEB6pTCXk=h310",
        "//lh3.googleusercontent.com/fwv_7z-5xp5MSKBYdlHhTxPtWiX-jsoH_uDY1ddrH3E6KVHF7IUaGIpESxvv7YEhzg=h310",
        "//lh3.googleusercontent.com/mR-eYq9ZunI_4Cr3CJnOUmbhUPlR_-vTcglAIAnQac86im2HztCxQjgZKsYoYUrw6Q=h310",
        "//lh3.googleusercontent.com/X48AcLbk1X7A2ThL6YbgVLNpgMLXiPUWnqSBfcOGB0B5n1DMhoMu2MOQNm3XS0HUXA=h310",
        "//lh3.googleusercontent.com/49NtuEguBhV7r9n-KyYebXW8Z87I8VM_zoH5h2k1Ywe0cXGNU0dDxmsyp3zvn3NrtnI=h310"
    ],
    "video": "https://www.youtube.com/embed/BJEArDAntdQ",
    "comments": [
        "Costoso. Only Amex y Mastercard.",
        "Worked great for two days. During a trip with easytaxi, it forcibly logged me out and wouldn't let me log back in. The driver was upset. I tried to reset my password, but that didn't work either. I uninstalled, reinstalled, rebooted my phone, and even tried signing up under a different email and NONE of them worked. Please help",
        "O mapa da cidade não relação com o mapa na realidade. Impossível saber se o motorista está chegando em você ou não! Esse aplicativo não deveria mostrar mapa se é para mostrar como está atualmente.",
        "No hay ningún taxi que conteste si quiero tomarlo de noche. En el día no hay problemas pero nunca he conseguido uno si quiero pedirlo después de las 10 y lo he intentado millones de veces.",
        "Lo malo de la aplicación es que no presenta a priori la tarifa y cuando uno va a pagar te llevas la sorpresa que es más caro que UBER",
        "Genial"
    ],
    "recentChanges": [
        "• Add or remove your favorite address",
        "• Terms and conditions on the menu bar",
        "30% OFF all your taxi rides in Brazil !!! Just add your credit card and select 30% discount as your payment option. Let the games begin !"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=br.com.easytaxi&hl=en&gl=us",
    "appId": "br.com.easytaxi"
}