{
    "title": "Mobills: Budget Planner",
    "summary": "Create a budget, track your spending, and manage your money in one place.",
    "icon": "//lh3.googleusercontent.com/CDeHLqKtxmlv6i-Ou2_npBjuf_rEdAk1dY_LreMdiLw2LOrMo67C_EPEJs8TkdX5wQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 150326,
    "developer": "MobillsLabs",
    "developerId": "5723502633915819194",
    "developerEmail": "suporte@mobills.com.br",
    "developerWebsite": "http://mobills.com.br",
    "developerAddress": "Rua Costa Barros, 915 Sala 1309",
    "updated": "February 20, 2018",
    "version": "3.1.18.02.19",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "We all need a certified way to manage our money and make it work for us. Mobills is a budget planner and bill reminder that helps you to create customized monthly budget that works for you; Track spending and get reminded of it; Adjust your budget when you need it; Add expenses, income and make transfers on the go; Budget your trip and so on. Mobills is the best money manager app for sticking to budget. Get out of debt and build wealth by making a monthly budget for FREE!Mobills works like a budget spreadsheet and allows you to create a personal finance plan for your money, it ensures that you will always have enough money for the things you need and the things that are important to you. Using this budget planner and bill reminder will also keep you out of debt or help you work your way out of debt.With an expense tracker that allows you to determine in advance whether you will have enough money to do the things you need to do or would like to do. If you don't have enough money to do everything you would like to do, then you can use this financial planning process to prioritize your expenses and focus your money on the things that are most important to you.Mobills really work to keep track of your finances with just one tap. Plan your monthly budget in a few minutes using our exclusive budget feature and start saving money. Budgeting is not complicated when you use the best budget planner and bill reminder available. The simple interface helps you to manage your expenses and budget on the go even offline, anywhere, anytime. You can add new transactions while you are drinking a coffee or taking an Uber. It’s simple to do and all your data will be instantly synced in the cloud. Mobills is the expense tracker that everyone needs on a daily basis.Key features of Mobills - Budget Planner:✶ Create customized monthly budget that works for you.✶ Track spending and get reminders of it.✶ Credit Card Management.✶ Adjust your budget when you need it.✶ Add expenses, income and make transfers on the go.✶ Budget your trip and save money✶ No third-party advertisements.BUDGET PLANNERWith the use of budget planner, you are certain about the money coming in, how you spend it, and what you spent it on. Budgeting saves you from having to wonder where your money went to at the end of the month. Mobills budget planner helps you to know what you can buy, and take advantage of purchasing and investing in opportunities, and planning how to reduce your debt. Budgeting helps to tell you what is important to you, based on how you distribute your money, how your money is working for you, and how far you are towards reaching your financial goals. Keep track of your budgets today! Get Started with Mobills Personal Finance.",
    "descriptionHTML": "We all need a certified way to manage our money and make it work for us. Mobills is a budget planner and bill reminder that helps you to create customized monthly budget that works for you; Track spending and get reminded of it; Adjust your budget when you need it; Add expenses, income and make transfers on the go; Budget your trip and so on. Mobills is the best money manager app for sticking to budget. Get out of debt and build wealth by making a monthly budget for FREE!<br><br>Mobills works like a budget spreadsheet and allows you to create a personal finance plan for your money, it ensures that you will always have enough money for the things you need and the things that are important to you. Using this budget planner and bill reminder will also keep you out of debt or help you work your way out of debt.<br><br>With an expense tracker that allows you to determine in advance whether you will have enough money to do the things you need to do or would like to do. If you don&apos;t have enough money to do everything you would like to do, then you can use this financial planning process to prioritize your expenses and focus your money on the things that are most important to you.<br><br>Mobills really work to keep track of your finances with just one tap. Plan your monthly budget in a few minutes using our exclusive budget feature and start saving money. Budgeting is not complicated when you use the best budget planner and bill reminder available. <br><br>The simple interface helps you to manage your expenses and budget on the go even offline, anywhere, anytime. You can add new transactions while you are drinking a coffee or taking an Uber. It&#x2019;s simple to do and all your data will be instantly synced in the cloud. Mobills is the expense tracker that everyone needs on a daily basis.<br><br>Key features of Mobills - Budget Planner:<br><br>&#x2736; Create customized monthly budget that works for you.<br><br>&#x2736; Track spending and get reminders of it.<br><br>&#x2736; Credit Card Management.<br><br>&#x2736; Adjust your budget when you need it.<br><br>&#x2736; Add expenses, income and make transfers on the go.<br><br>&#x2736; Budget your trip and save money<br><br>&#x2736; No third-party advertisements.<br><br><br>BUDGET PLANNER<br><br>With the use of budget planner, you are certain about the money coming in, how you spend it, and what you spent it on. Budgeting saves you from having to wonder where your money went to at the end of the month. Mobills budget planner helps you to know what you can buy, and take advantage of purchasing and investing in opportunities, and planning how to reduce your debt. Budgeting helps to tell you what is important to you, based on how you distribute your money, how your money is working for you, and how far you are towards reaching your financial goals. Keep track of your budgets today! Get Started with Mobills Personal Finance.",
    "histogram": {
        "1": 3219,
        "2": 2237,
        "3": 7398,
        "4": 32269,
        "5": 105203
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/hQqF9Viv8yPPqkFJ2rauhovCPt0T59GmNgXGzW74cQMXR1T5sFoOXRBHx5LRRJOFOqmi=h310",
        "//lh3.googleusercontent.com/8TtItDO4kI09VNXrgzsbvbb6oiZNJrU_ANboLik1Fx6nU7F4zCz7Uyp2dLb0QKsin3La=h310",
        "//lh3.googleusercontent.com/hIQ1xIKZ5PjDLldDc_uea8GCCcu2mcVl_GOPaFb5tz_x06Ct1-CcYzyfq_luzhrZSA=h310",
        "//lh3.googleusercontent.com/IRfqxCkM-d5oCoQraudEO1Ec5egtVcbWnB1nSFOh7Clpmi0b-_N7UY5onB47UdknZC4=h310",
        "//lh3.googleusercontent.com/ZBwcDqzrzRuByT_jW0MUSb2L6FU74lXntEkJ5QHLQKt_l5W_Sh-N0hWGvrkigWdcSnA=h310",
        "//lh3.googleusercontent.com/LnBLwBFdxsyMWY2vz-9YOCibBIQSm9Tjp2wHuwIkHNuIgKEMXD_Q4xHa2-LFOl2DC1uf=h310",
        "//lh3.googleusercontent.com/rIJByVMBg5xFSxo4V6nQcHIBw0UzaqX6exa5z2wCA7ErXxqMJ9LNjor0loLaNVn5MLQ=h310",
        "//lh3.googleusercontent.com/h93VXEjhC1nz3kLx_lhDnO-2bIRcW6rcB5uUESR4f-Oi0lD5g55jPrqj6adfMGfB5T8=h310",
        "//lh3.googleusercontent.com/tQtjm8JnLmsWnK2F661W7hSeNiqKgEEzi9dAlvndzJr0OsKCvXKKmQ4Lbn2W39577Mrv=h310",
        "//lh3.googleusercontent.com/SCb54lL3O9mU9Ck869Cy2LMnBDfPdOUA5YLfq9ddv2RPTG1flooavFtHGrjG9izTqQA=h310",
        "//lh3.googleusercontent.com/DChDTa32TsTpKlHH3lle74B6pC1mcluI0uO1pRIRc5XyMpQZzsSJgzAyXTCXI2KMRbw=h310",
        "//lh3.googleusercontent.com/53pcVJo2sZbR8tdkqR9Kks10pzmYkM7P4hj8CjNu8cswcBDq_JhuOkWigXQxdWoEV0w=h310",
        "//lh3.googleusercontent.com/SGZComIa0miufCBZJDCHWgm1sKyiQhzuIJDRbg_IBxrc9cIA9yKgDqHZvIwM3LJzmQ=h310"
    ],
    "video": "https://www.youtube.com/embed/3nUAnaJ6RA4",
    "comments": [
        "It is costly. Only two budget entry is available. 155 php per month is too much a cost for an app that tracks money. I would opt to use excel and make all the formulas to balance check everything for free. Thanks anyway.",
        "Good app in free version, but after going to premium I'm not happy. One of the main reasons for premium is to use the filter by tag in order to calculate some expenses, but this filter is always missing some items. No matter how many times I edit the missing itens and re-search, it is always missing some and not closing the math. For a finance application, not doing math right is a totally no go.",
        "This is not user friendly at all. No instructions, no step by step, and I don't have time to go back and forth on an email. you should add a guide/instructions,  something to help your users out like other budget apps.",
        "I have trialed a few of these and this one is by far the simplest to understand and use. I love the budget function so you can track how much you are spending on certain things outside of your normal bills. Intuitive to use although it is the 'recurring' expense you want to use for monthly bills, not repeat. Great app. Love it.",
        "The app crashed when trying to export a CSV report. PDF and XLS options don't seem to work at all.",
        "Easy to use once you poke around and see what's where. Nice colors, not intimidating to use. Not as scared to look at my Bills now LOL"
    ],
    "recentChanges": [
        "Great news:",
        "-New! Export data",
        "-New app design",
        "-Improvements in usability",
        "-New modern menu",
        "-New reports and charts",
        "-New feature to search all your records",
        "-Improvements in performance",
        "-Fixed minor bugs",
        "-Improvements in data sync"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=br.com.gerenciadorfinanceiro.controller&hl=en&gl=us",
    "appId": "br.com.gerenciadorfinanceiro.controller"
}