{
    "title": "Tangerine Banking",
    "summary": "Tangerine Banking",
    "icon": "//lh4.ggpht.com/ofRSHEY3IF30AqcvuanLd7tilNQTTHHEvspVTTyuLU8HfE0D4Fk8VkNNy3xrmUB4mA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.7,
    "reviews": 4516,
    "developer": "Tangerine Bank",
    "developerId": "Tangerine+Bank",
    "developerEmail": "clientservices@tangerine.ca",
    "developerWebsite": "http://www.tangerine.ca",
    "updated": "January 11, 2018",
    "version": "2.4.3",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "The Tangerine Mobile Banking app makes your banking experience even more convenient than ever before with a fresh and intuitive design. Manage your Accounts, review transactions, transfer funds, locate ABMs, and receive important notifications. It’s a perfect way to do banking on the go.In today’s fast pace world, we know you’re busy and always on the go. That’s why we make it simple to do all of your banking with us anytime, anywhere.You can Save Anywhere™ with your smartphone or tablet at tangerine.ca or through our Mobile Banking app. Check your Account balances, review transactions, transfer funds, send Interac e-Transfers, locate ABMs, pay bills, buy and sell Tangerine Investment Funds and even deposit a cheque with our Cheque-In® feature.Accolades• Ipsos Best Banking Award for Mobile Banking Excellence (2014) Tangerine shared the 2014 Ipsos Award for Mobile Banking Excellence among all financial institutions.•IBM Mobile and Cloud Innovation Award at Impact (2014)By tapping the button or by downloading the Tangerine Mobile Banking app published by Tangerine Bank, you consent to the installation of this app further described below and to its future updates and upgrades. You can withdraw your consent at any time by uninstalling the app. To request removal or disabling of this app, please contact us.You acknowledge and understand and agree that this app (including any updates or upgrades) may (i) cause your device to automatically communicate with Tangerine’s servers to deliver the functionality described below and to record usage metrics, (ii) affect app-related preferences or data stored in your device, and (iii) collect personal information as set out in our privacy policy.To learn more, Contact us at:Tangerine Bank3389 Steeles Avenue EastToronto, Ontario M2H 3S8clientservices@tangerine.caHIGHLIGHTED FEATURES: Cheque-In®:Cheque-In is the easiest and fastest way to deposit a cheque. No line- ups at bank branches. You simply snap a photo of your cheque using your device’s camera, enter a few details and voila - the cheque is deposited into your Account. It’s that simple.Quick View:Quick View is a fast way for Clients to view their deposits, withdrawals, bill payments and Email Money Transfers (EMT).Android Wear:Get quick and easy access to your personal banking information from your wrist. You can review:- Account balances- Recent transactions- Transaction details- Important notificationsSign Me Up:Simple and fast Account enrollment using Cheque-In.ABM Locator:Helps you to easily locate nearby ABMs.ABM Locator Widget:Find the nearest ABMs from the Notification Center.FEATURES:View my Accounts:View your Account balances and details for all your Tangerine Accounts.Move my money:Transfer funds now, later or schedule ongoing transfers.Pay my bills:Register or manage your bills and pay them now, later or schedule ongoing payments.Orange Alerts:By choosing to receive Orange Alerts, you’ll never have to wonder if payments or deposits have occurred. Orange Alerts send you emails when your money is in motion, to ensure you're on top of it at all times.Refer a Friend:Refer friends and family for great Bonus offers.Language Supported:EnglishFrench® Cheque-In is a registered trademark of Tangerine Bank.",
    "descriptionHTML": "The Tangerine Mobile Banking app makes your banking experience even more convenient than ever before with a fresh and intuitive design. Manage your Accounts, review transactions, transfer funds, locate ABMs, and receive important notifications. It&#x2019;s a perfect way to do banking on the go.<br><br>In today&#x2019;s fast pace world, we know you&#x2019;re busy and always on the go. That&#x2019;s why we make it simple to do all of your banking with us anytime, anywhere.<br><br>You can Save Anywhere&#x2122; with your smartphone or tablet at tangerine.ca or through our Mobile Banking app. Check your Account balances, review transactions, transfer funds, send Interac e-Transfers, locate ABMs, pay bills, buy and sell Tangerine Investment Funds and even deposit a cheque with our Cheque-In&#xAE; feature.<br><br>Accolades<br>&#x2022; Ipsos Best Banking Award for Mobile Banking Excellence (2014) Tangerine shared the 2014 Ipsos Award for Mobile Banking Excellence among all financial institutions.<br>&#x2022;IBM Mobile and Cloud Innovation Award at Impact (2014)<br><br>By tapping the button or by downloading the Tangerine Mobile Banking app published by Tangerine Bank, you consent to the installation of this app further described below and to its future updates and upgrades. You can withdraw your consent at any time by uninstalling the app. To request removal or disabling of this app, please contact us.<br><br>You acknowledge and understand and agree that this app (including any updates or upgrades) may (i) cause your device to automatically communicate with Tangerine&#x2019;s servers to deliver the functionality described below and to record usage metrics, (ii) affect app-related preferences or data stored in your device, and (iii) collect personal information as set out in our privacy policy.<br><br>To learn more, Contact us at:<br>Tangerine Bank<br>3389 Steeles Avenue East<br>Toronto, Ontario M2H 3S8<br>clientservices@tangerine.ca<br><br>HIGHLIGHTED FEATURES: <br><br>Cheque-In&#xAE;:<br>Cheque-In is the easiest and fastest way to deposit a cheque. No line- ups at bank branches. You simply snap a photo of your cheque using your device&#x2019;s camera, enter a few details and voila - the cheque is deposited into your Account. It&#x2019;s that simple.<br><br>Quick View:<br>Quick View is a fast way for Clients to view their deposits, withdrawals, bill payments and Email Money Transfers (EMT).<br><br>Android Wear:<br>Get quick and easy access to your personal banking information from your wrist. You can review:<br>- Account balances<br>- Recent transactions<br>- Transaction details<br>- Important notifications<br><br>Sign Me Up:<br>Simple and fast Account enrollment using Cheque-In.<br><br>ABM Locator:<br>Helps you to easily locate nearby ABMs.<br><br>ABM Locator Widget:<br>Find the nearest ABMs from the Notification Center.<br><br>FEATURES:<br><br>View my Accounts:<br>View your Account balances and details for all your Tangerine Accounts.<br><br>Move my money:<br>Transfer funds now, later or schedule ongoing transfers.<br><br>Pay my bills:<br>Register or manage your bills and pay them now, later or schedule ongoing payments.<br><br>Orange Alerts:<br>By choosing to receive Orange Alerts, you&#x2019;ll never have to wonder if payments or deposits have occurred. Orange Alerts send you emails when your money is in motion, to ensure you&apos;re on top of it at all times.<br><br>Refer a Friend:<br>Refer friends and family for great Bonus offers.<br><br>Language Supported:<br>English<br>French<br><br>&#xAE; Cheque-In is a registered trademark of Tangerine Bank.",
    "histogram": {
        "1": 754,
        "2": 387,
        "3": 435,
        "4": 980,
        "5": 1960
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/82PJ4BOI3mLm9N50z75XkKZ9pRsp_jahY0TvWuh0xSEhZU2VnXcaWbddOSEPJik47w=h310",
        "//lh3.googleusercontent.com/xFYODlUCGm0XAAumYqx6aouNvv2sLVIeXrTCOcV7juV28t5cb93pXVme3PN_3ZB5nw=h310",
        "//lh3.googleusercontent.com/b0Hf5D58nhSAjKALzyxpPsF6YQfjCzfVIXw2pUCVf8XHnafafOoNKlxArNfgWxkU8Hg=h310",
        "//lh3.googleusercontent.com/txZr4jIgtYRmJDOdxGenIgbSzHg9GlEyssjyPwuKra5ijCGhAHUuej96w9v-kEv8CTc=h310",
        "//lh3.googleusercontent.com/OKdgznmHMQSQNyjk84sc1bQbitvPeWIroAZXvrxVLPv-9kfcKAZljaxZU2_MLCebqYw=h310",
        "//lh3.googleusercontent.com/AQuFRr2XrJKBAYkL4DDGcSGz8HW-doox6Axt4VlSd35TrgbdkYRx7vDImZufgAWAGMdO=h310",
        "//lh3.googleusercontent.com/JGyle1UJGS-gHb-a7nc_UNKdwqJ3ZPMVfjjsUTbuyrlOr-Te6J4fOyaRk5d2MlhTvA=h310",
        "//lh3.googleusercontent.com/Us7mkWJONNUe9PeiVH56PP7g5o37km1RKDZOVrCkeb7K6d9Z2coGKLIq62DnKCXBd4w=h310",
        "//lh3.googleusercontent.com/WcAGGRGKO75xWVqzOJMDVMbSYAwsibLr3kFNQ-Nykq6zk2SEtorNJ0ezfaHHQGrhrw=h310",
        "//lh3.googleusercontent.com/1tlOc6dNpvwpcVPQ_jKu6vCFSE4OESKZdwye8wv9fr8fAmYFnbBE_hXZv2F4m_8wOiQ=h310",
        "//lh3.googleusercontent.com/GGYMLoh6flbahIOsXseNloxRLDy9XiI4a5h2JjvuQvGB8yP-bCJVnCXTzMLWDAVkIQ=h310",
        "//lh3.googleusercontent.com/PctUncLliT-IZC8KNS-D8HlCAdI83PTrFNl1XR8WQvVk4rAWJXyIBL8LznlC2LJsLg=h310",
        "//lh3.googleusercontent.com/VPTP9e3l4HXWEITwJgknwz_ea4umcLsFzjBp5iMQERlFxQUqy4-F_v8iHIJfOhJ-yA=h310",
        "//lh3.googleusercontent.com/-fqQ2b9AEYXWpZ7P5LCfg9n0BFLxXnvw6vnZTt1zpQW3iweZgNCiITEozAJZt4oxIXwN=h310",
        "//lh3.googleusercontent.com/JueUEakJk2b6_VXaLooMMwywlikqp_AYiq8_-Igb3p5mNKu_yYUBXVndcmhgazy0D_Pz=h310"
    ],
    "comments": [
        "Loved the app when it would actually work. Now it refuses to let me even login. Continues saying I have no network connection, BUT I DO and literally every other app and website on my phone will work while it says this. And it won't even open if I use data. \"No connection\" message over and over and over and over.... VERY frustrating.",
        "For the Bank that listening their clients your app should be able to get closed without forcing it, also your clients should be able to use Android pay. Taking a picture and deposit of check is at best, pain in the neck. My question is what kind of update you are doing when app is getting worse?",
        "I called Tangerine and was told to reinstall the app because it wasn't functioning properly. The customer service rep asked me what phone I have and confirmed that I should uninstall and reinstall. (I could only see my balances and not the actual transactions). I uninstalled the app.. turns out I can't reinstall it... the app is not compatible with my S8. For a Bank that prides itself for being digitally savvy... This is ridiculous.",
        "Switched to tangerine for a simple modern banking experience but I'm disappointed with their Android support. Not only is the Android app well behind the Apple experience, they don't support Android Pay which every other Canadian bank has supported for 6 months now.",
        "Not sure how an online bank can have the worst app of them all. Promised Android pay 8 months ago and it's still not here. Horrible app, horrible features, and overall a horrible bank. Do not bank with tangerine.",
        "This app needs fingerprint authentication. It is a perfect use case for it. Also this app has a tendency to freeze during login requiring me to force close and try again. Lastly the design is not well thought out and very unintuitive and does not reveal info such as available balance without extra interaction. I also find it funny how they brag about an award they got 4 years ago. If you made it a native material design app maybe you would be bragging about getting that award for the last 4 years instead. Hire someone who knows native android development please!"
    ],
    "recentChanges": [
        "Feedback from our Clients is very important to us, since it helps us find ways to create an even better banking experience.",
        "Latest Updates:",
        "- Fixed minor issues",
        "If you’re experiencing any issues with our Mobile Banking app, please share your feedback: clientservices@tangerine.ca <mailto:clientservices@tangerine.ca>"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ca.tangerine.clients.phone&hl=en&gl=us",
    "appId": "ca.tangerine.clients.phone"
}