{
    "title": "Watch Camera for Android Wear",
    "summary": "Camera remote control for Android Wear. Take photos or videos from your watch",
    "icon": "//lh3.googleusercontent.com/W5cSFkIaFaBrFi2XbKJTZAfMi1YOsxYNT_6TKrvp80eTru9hYLgcQ5ml2EvaWSV5LQ=w300",
    "price": "$1.10",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.9,
    "reviews": 10,
    "developer": "Per Apps",
    "developerId": "Per+Apps",
    "developerEmail": "apps@perealemany.cat",
    "developerAddress": "Carrer Major 31 2n-2a\n08790 Gelida (Barcelona)\nSpain",
    "updated": "September 23, 2015",
    "version": "1.1.2",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "description": "Take pictures or record video remotely from your Android Wear watch. With Watch Camera you can open the camera and set parameters from your smartwatch or in your phone, as you prefer.Take your selfies to another level! Use rear camera to make high quality selfies. No matter if you're near or far*, with Watch Camera you will see the image of the camera in your watch as shown on your phone, auto-rotated and without cropping edges, so you can get a perfect image framing.Take advantage of your selfie stick! Put your smartphone with back camera pointing at you and uses your Android Wear watch to see how will your selfie look. You don't have enough hands to shoot photos? Don't worry! Watch Camera is compatible with most remote triggers, so you can use your stick selfie button as a trigger.ATTENTION: this app only supports Android Wear devices, if you have other type of smartwatch not download this applicationFeatures:• Remote view: from your watch you can see the camera image in real time and without cutting edges, so you always take the perfect photo• Simple interface: developed following the design principles android wear to provide an enjoyable and intuitive experience• Control it all: from your watch you can set the countdown timer, flash, front or rear camera, image ratio (4: 3 or 16: 9) or video resolution• Application on phone/tablet: Watch Camera can be opened from your watch or from your phone/tablet, operates synchronously. From your smartphone app you can configure the camera settings like in the watch, plus you can see the latest pictures and videos.• Photos with no distractions: at the touch of a button you can hide the controls of camera and take pictures or record videos by touching anywhere on the screen, both the clock and the pone• Remote zoom: double-tap the image in watch to zoom camera. You can also adjust zoom in your phone using two fingers to pinch• Auto-rotation: Watch Camera uses your phone's gyroscope to detect rotation of camera and automatically rotate the image displayed on your watch to the correct position• Compatible with most remote triggers: you can use your selfie stick button to shoot pictures or record videos easily• Video: You can set a countdown before you start recording, and you can see the time elapsed from start of recording on your phone and your wearable* limited to the range of bluetooth connection",
    "descriptionHTML": "Take pictures or record video remotely from your Android Wear watch. With Watch Camera you can open the camera and set parameters from your smartwatch or in your phone, as you prefer.<br><br><b>Take your selfies to another level!</b> Use rear camera to make high quality selfies. No matter if you&apos;re near or far*, with Watch Camera you will see the image of the camera in your watch as shown on your phone, auto-rotated and without cropping edges, so you can get a perfect image framing.<br><br><b>Take advantage of your selfie stick!</b> Put your smartphone with back camera pointing at you and uses your Android Wear watch to see how will your selfie look. You don&apos;t have enough hands to shoot photos? Don&apos;t worry! Watch Camera is compatible with most remote triggers, so you can use your stick selfie button as a trigger.<br><br><b>ATTENTION</b>: this app only supports Android Wear devices, if you have other type of smartwatch not download this application<br><br>Features:<br><b>&#x2022; Remote view:</b> from your watch you can see the camera image in real time and without cutting edges, so you always take the perfect photo<br><b>&#x2022; Simple interface:</b> developed following the design principles android wear to provide an enjoyable and intuitive experience<br><b>&#x2022; Control it all:</b> from your watch you can set the countdown timer, flash, front or rear camera, image ratio (4: 3 or 16: 9) or video resolution<br><b>&#x2022; Application on phone/tablet:</b> Watch Camera can be opened from your watch or from your phone/tablet, operates synchronously. From your smartphone app you can configure the camera settings like in the watch, plus you can see the latest pictures and videos.<br><b>&#x2022; Photos with no distractions:</b> at the touch of a button you can hide the controls of camera and take pictures or record videos by touching anywhere on the screen, both the clock and the pone<br><b>&#x2022; Remote zoom:</b> double-tap the image in watch to zoom camera. You can also adjust zoom in your phone using two fingers to pinch<br><b>&#x2022; Auto-rotation:</b> Watch Camera uses your phone&apos;s gyroscope to detect rotation of camera and automatically rotate the image displayed on your watch to the correct position<br><b>&#x2022; Compatible with most remote triggers:</b> you can use your selfie stick button to shoot pictures or record videos easily<br>&#x2022; Video: You can set a countdown before you start recording, and you can see the time elapsed from start of recording on your phone and your wearable<br><br>* limited to the range of bluetooth connection",
    "histogram": {
        "1": 2,
        "2": 0,
        "3": 1,
        "4": 1,
        "5": 6
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/bl5cxCt1zvVMdlZpf92o5ATYQ1TlQUuzCm-rtmOe38ranFReKnluyEO_hLiY85e37OnE=h310",
        "//lh3.googleusercontent.com/Gn13KoMM3hD8kyjzFNcq-R2vpwdhIySdgRdpRa-oe6uXMEy5pfnUYBeDZUGNUvYKGxg=h310",
        "//lh3.googleusercontent.com/_ZEtKXiFU1D4-6VMVWimv0Y7cxTTQ8rjaoK328wnhrDZaJ-7Hw5KDjtLfZBzEhnrmzU=h310",
        "//lh3.googleusercontent.com/5gNSXeJH9ZPcq7yrjmU-UZUiwU18UBsAnjSnlayObgTmuA7u2hfPKkFScd8gE1_xyg=h310",
        "//lh3.googleusercontent.com/_j4trEje-nh6ZyOgPwczFLK1SoozzB5bUGSZeqfIMg6tVj8rNC5mDfZAHoYCGXX8ntI=h310",
        "//lh3.googleusercontent.com/67Ba8Q5D2yr034jIci0lGXJRYzKifCicEgVa2W-eiQ4ag3FGmcKzJeNBblgKj8YajEQ=h310",
        "//lh3.googleusercontent.com/OwNV87MIdpPTyprMvb4luEH_Qr35u497Mx2crXhcVjTRPvFyPIQ3KdDoswhWJRbZsLPL=h310",
        "//lh3.googleusercontent.com/gXe4SNyPjp_m5n0Qc3XxNQel21dNmFHGIUENiYPztQuWYryVU1a9lmESy7IkL4QEkpI=h310",
        "//lh3.googleusercontent.com/_8fRu9ureKDpBcwm8PqUErwTbOiCU-Mt9DfYuUXnIKZsICPuo3f3il-u5dh7BacM7uDh=h310",
        "//lh3.googleusercontent.com/RhStxYjQELSEej38SLxb6D_ioQQno3qm0JZqnQIDayrBvw3ng4ZrhYVgcW-0Oe864g=h310",
        "//lh3.googleusercontent.com/8Lb22ZnYuaJzvu3PoaUDWa2supZHG9c3AK6v_iCEWtNR_KaUelzweG2RY0BH1wxz8diR=h310",
        "//lh3.googleusercontent.com/nEr9hxou7u4Omd_HFwnbTfn9YDrtQVOiJZC99nyUdW0Rvv7McmVS6EG8kevPkSruiWU=h310"
    ],
    "comments": [
        "This app works with the LG V20 phone and allows you full video viewing on the LG sport smartwatch while the LG V20 is video recording. I.E. True remote shutter video recording and full viewing in real time. Thank you for making this app. I tried all the other ones pay and free, and none of them allowed real time remote viewing while recording. One thing to note, is that you need to swipe right when you want to close the app. If you force close via the middle button on the smartwatch, the app will get a little buggy and you 'll need to restart the app twice and swipe one time to get the real time video to sync again. Please continue to improve this app. It works!",
        "Good app but it needs option for 4k recording right now the highest is 1080p. But its not a very big deal",
        "Photo is appearing upside down, need a option to fix this.",
        "It awesome app work perfect on my galaxy s6 and fosil watch."
    ],
    "recentChanges": [
        "- Added zoom function: double-tap the image in watch or pinch in your phone to zoom",
        "- Improved watch preview image quality",
        "- New app name: Watch Camera",
        "- Media directory changed: now your captures are saved to \"Watch Camera\" folder in photo gallery",
        "- Fix issues"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=cat.perealemany.cam4wear&hl=en&gl=us",
    "appId": "cat.perealemany.cam4wear"
}