{
    "title": "ATUR -  Smart Notification App",
    "summary": "Never miss urgent SMS or phone calls again: Control incoming message alerts!",
    "icon": "//lh3.googleusercontent.com/DWUwQkhpHYAZ3ArXGEgWquly_IpcDoQuqf-BSlFKhdSWmYrY0TRf4uFlSu-iLl20WMs=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 149,
    "developer": "Dolphin Systems AG",
    "developerId": "6451303675048327603",
    "developerEmail": "info@dolphin.ch",
    "developerWebsite": "https://www.dolphin.ch",
    "developerAddress": "Dolphin Systems AG\nSamstagernstrasse 45\n8832 Wollerau\nSwitzerland",
    "updated": "October 19, 2015",
    "version": "1.2",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "At its core, ATUR is a smart and powerful but simple notification app that filters text messages and phone calls.But thats not all: You decide who's messages are important enough to alert you!Take control over your incoming SMS message alerts or calls: ATUR is like having your own personal assistant. You can even silence your phone with confidence knowing that you will still get notified of selected incoming communications.ATUR is as of version 1.2 also available for your smartwatch. Once the app responds on important messages, this will be displayed directly on your wrist.You select incoming communications, and then setup the filter to apply to them - for example communications from particular contacts or phone numbers, or certain keywords in a message. If the filter matches, an alert / signalisation will be triggered: you can choose to be notified by a special audible (import any sound-file you want) alarm, your smartphones flashlight or simply by the vibration of your phone (By the way - a very helpful tool for deaf and hard of hearing persons). Until you respond, the alarm will repeat and remain prominent on the main screen. Missing an important message can cause financial damage and unhappy customers - not with the SMS PagerFeatures and benefits:•\tThis mobile app is free of charge and compatible with smartphone, tablet and smartwatch•\tOne-click import of contacts from your address book•\tA message will stay on your main screen until confirmed•\tRapid overview of important incoming SMS and missed calls•\tLog of all messages /\tVisual status indication•\tSelect from 3 different and specially developed alarm sounds or import another sound file•\tVibration and flash increase the impact•\tVibration and flash settings are customisable•\tDo-not-disturb-function interrupts the signalisation for a certain period•\tWidget to be included on home and lock screenWhy do I need this app?I receive countless messages on my smartphone every day: Calls, SMS, e-mail, WhatsApp, you name it. With all this, there’s a good risk of missing an important message. The information I really need just doesn't stand out enough in the flood of incoming information. Thanks to the google mobile app ATUR, I can now determine the message types and people I really need to be available for and it raises my punctuality. I definitely will not miss these messages. ***** ReviewMichael Wachter, one of our users said: Thank you for the great mobile app. Now I can sleep again quietly, because I know, that I will no more miss an Alert”About Dolphin Systems AGs:Dolphin Systems has been a pioneer in so-called cloud-based technology, providing communication solutions for more than 20 years, Dolphin has also developed specific products such as the kidnapping alert via SMS for the Swiss Federal Department of Justice and Police, or the emergency app for the Swiss Air-Rescue Company, Rega.More functions and areas of application•\tA text message (SMS) can be filtered after content. For example with a filter for the word alarm•\tAlarming with special events (failure reports, technical alerts, mobilization and so on) although suitably for fire brigades and police •\tNotification of special persons, like important clients, chief, team or family •\tNotification in surroundings, where mobile phone normally should be in the silent mode, like in Meeting, on events, in cinemas or in the theatre and while you are sleeping.•\tNotification in noisy surroundings (street noise or industrial noise)",
    "descriptionHTML": "<b>At its core, ATUR is a smart and powerful but simple notification app that filters text messages and phone calls.But thats not all: You decide who&apos;s messages are important enough to alert you!</b><br>Take control over your incoming SMS message alerts or calls: ATUR is like having your own personal assistant. You can even silence your phone with confidence knowing that you will still get notified of selected incoming communications.<br><br>ATUR is <b>as of version 1.2 also available for your smartwatch.</b> Once the app responds on important messages, this will be displayed directly on your wrist.<br><br>You select incoming communications, and then setup the filter to apply to them - for example communications from particular contacts or phone numbers, or certain keywords in a message. If the filter matches, an alert / signalisation will be triggered: you can choose to be notified by a special audible (import any sound-file you want) alarm, your smartphones flashlight or simply by the vibration of your phone (By the way - a very helpful tool for deaf and hard of hearing persons). <br>Until you respond, the alarm will repeat and remain prominent on the main screen. Missing an important message can cause financial damage and unhappy customers - not with the SMS Pager<br><br><br><b>Features and benefits:</b><br>&#x2022;\tThis mobile app is free of charge and compatible with smartphone, tablet and smartwatch<br>&#x2022;\tOne-click import of contacts from your address book<br>&#x2022;\tA message will stay on your main screen until confirmed<br>&#x2022;\tRapid overview of important incoming SMS and missed calls<br>&#x2022;\tLog of all messages /\tVisual status indication<br>&#x2022;\tSelect from 3 different and specially developed alarm sounds or import another sound file<br>&#x2022;\tVibration and flash increase the impact<br>&#x2022;\tVibration and flash settings are customisable<br>&#x2022;\tDo-not-disturb-function interrupts the signalisation for a certain period<br>&#x2022;\tWidget to be included on home and lock screen<br><br><b>Why do I need this app?</b><br>I receive countless messages on my smartphone every day: Calls, SMS, e-mail, WhatsApp, you name it. With all this, there&#x2019;s a good risk of missing an important message. The information I really need just doesn&apos;t stand out enough in the flood of incoming information. Thanks to the google mobile app ATUR, I can now determine the message types and people I really need to be available for and it raises my punctuality. I definitely will not miss these messages.&#x2028;<br><br><b>***** Review</b><br>Michael Wachter, one of our users said: Thank you for the great mobile app. Now I can sleep again quietly, because I know, that I will no more miss an Alert&#x201D;<br><br><br><b>About Dolphin Systems AGs:</b><br><a>Dolphin Systems</a> has been a pioneer in so-called cloud-based technology, providing communication solutions for more than 20 years, Dolphin has also developed specific products such as the kidnapping alert via SMS for the Swiss Federal Department of Justice and Police, or the emergency app for the Swiss Air-Rescue Company, Rega.<br><br><b>More functions and areas of application</b><br>&#x2022;\tA text message (SMS) can be filtered after content. For example with a filter for the word alarm<br>&#x2022;\tAlarming with special events (failure reports, technical alerts, mobilization and so on) although suitably for fire brigades and police <br>&#x2022;\tNotification of special persons, like important clients, chief, team or family <br>&#x2022;\tNotification in surroundings, where mobile phone normally should be in the silent mode, like in Meeting, on events, in cinemas or in the theatre and while you are sleeping.<br>&#x2022;\tNotification in noisy surroundings (street noise or industrial noise)",
    "histogram": {
        "1": 10,
        "2": 2,
        "3": 12,
        "4": 14,
        "5": 111
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/MzfHKB1cWQUP7NljrXomIG3ZUvOzgMMRlfqM1oPV7DDXnLBqjIiBmdNBPt1yMAWCmsw=h310",
        "//lh3.googleusercontent.com/rAi8QsSpbyzRL9P-idvzRvbjvJEU28yLP2zM9JcivM2cVDpVYadUp7YsLIjdOBeYs0M=h310",
        "//lh4.ggpht.com/i4npxCd6IOsy8yTq32h5_I0rZYsr4rlskoBWccFNc7Zuj6-PszMtZmJtKz3GYph3MVg=h310",
        "//lh5.ggpht.com/iK17LcpNxkMdvzjwePVudLuknpvJj9R4Q8UpL-QSAmqDxKmiRAvBq7cQj4qDGtx7G-0=h310",
        "//lh5.ggpht.com/14xIedL03t4Li3be3oLfj0vpdCPEIIGuwEn0MiTNQcgEI5uD9E5ZS5zM0MOrhFUyMdBw=h310",
        "//lh5.ggpht.com/fNnCt8ZNMR1FfRBE05JQe_q66OAmt0DE6LcrGrBC-0K4amSxtFc2YRJYKnpP0eiy4UI=h310",
        "//lh3.googleusercontent.com/RtVPbDFpX54YztQEct_LYyKNJp2b-mA8_USm8LQs0-_3EvsOmXmX0GeQ2BzevDsiLu4=h310",
        "//lh3.googleusercontent.com/N772JWO3j2GDOPODNfBJgnKaZXlbBkHopPLY7ksQtpTYUDAQQPaknywj91O9rj1aRw=h310",
        "//lh3.googleusercontent.com/EI_XXTtujIEAbe_9O3LP-bUUInWGXihzM-Vs4Jkwj5aZTeEkMaUpY_67K_9n5ituPg=h310"
    ],
    "video": "https://www.youtube.com/embed/18HkaE-15iE",
    "comments": [
        "It only alerts you if the program is running.  There seems to be no background task monitoring the SMS?",
        "just downloaded this app. Hoping it'll work with Lollipop!  Your Info on this app is Misleading! You say do your own sounds....... NOT. Only if you get the PAID version! The sounds you can choose from are no good. I mean what One chirp will wake a person? The Flashing and vibration are dumb too. if you're sleeping, that won't wake you.or if phone is in purse, you won't feel or see it....    Need to for Calls, to have a sound of a phone ringing! Going to hold my stars till possible improvement.",
        "I hope i like this.",
        "Eye filtet Help",
        "Haven't tried it yet",
        "Antivirous Ok"
    ],
    "recentChanges": [
        "Dolphin of system has improved the app and extended with new functions.",
        "<b>ATUR form Smartwatch:</b> There is now an App for smartwatch available. Incoming alarms will be displayed directly to your watch.",
        "<b>Short numbers:</b> If you use short numbers in your business environment, ATUR can now respond also on those numbers."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ch.dolphin.atur&hl=en&gl=us",
    "appId": "ch.dolphin.atur"
}