{
    "title": "Wake Up Well",
    "summary": "The smart alarm clock that wakes you up, when you are in the right mood.",
    "icon": "//lh3.ggpht.com/9TZKCj5aYphLr75g4YKuXhsD8Tq9fQKFLtz3XQ0bbMQisn6l_j-VyeWUmMDW_OiG-Cum=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.7,
    "reviews": 195,
    "developer": "AppDevs",
    "developerId": "AppDevs",
    "developerEmail": "wakeupwell@pete.ch",
    "developerWebsite": "http://wakeupwell.pete.ch/privacy/",
    "developerAddress": "257 Clarence St\nSydney NSW 2000\nAustralia",
    "updated": "September 16, 2017",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Transform your Android Wear watch into a smart alarm clock that lets you wake up well.Wake up alert and in the right mood!Can’t remember the last time you woke up fresh and energised? Are you stuck in an endless cycle of sleeping through or ignoring your alarm clock?Based on maximising the science of sleep, Wake Up Well has been designed to wake you up at the optimal time. Unlike the traditional alarm clock, which works to wake you up at a specific time, Wake Up Well wakes you up gently with vibrations at the optimal time – when you’re rested, relaxed and in REM or Rapid Eye Movement sleep.What is REM?REM Sleep was identified by sleep researchers as a phase in sleep in which a person sleeps lightly. It occurs throughout various times during sleep; one of the last instances it occurs is close to morning. It is said that during REM, the brain activity behaves similar to the brain activity during hours you are awake.How it worksWake Up Well detects the optimal time to wake you up. When using alarm clocks, most people’s bodies are not yet prepared or still in deep sleep. Notice that when you wake via your alarm clock’s command you’re often groggy, have a cloudy mind and lacking in energy? That’s because your body is still in deep sleep. With Wake Up Well, you’re gently awoken during REM – when your brain is more active and your body is naturally ‘waking up’.Wake Up Well detects your slight movements during REM and in the ‘wake up window’ you set. It is during this time Wake Up Well monitors when to wake you up.Start the day with more energy with Wake Up Well.Features:- improves your sleep- assists in improving your mood- lets you wake up fresh, animated and more energised- uses vibrations to wake you so your partner isn’t disturbed- especially designed for Android wear watches- operational on the watch only, no Smartphone needed- detect best wakeup time- repeating alarms (Premium only)- wakes up at the almost awake moments- shows wake up screen immediately- supports all Android wear watches- set wake up time directly on the watch- set a wake up window in which it wakes up at the best time regarding sleep phase (Premium only)- configurable snooze time- configurable alarm set reminderIn-app Products:- Premium: Unlock repeated alarms and adjust the wake up window- DonationTo set an alarm first open Wake Up Well on your watch. Touch \"New alarm\", then scroll to the time you need to wake up. This is the latest time the alarm will go off.Swipe to the right for options. The wake up window will determine the earliest time the alarm will wake you up - based on your sleep pattern. After setting your wake up window swipe to the right again and touch the days you want the same alarm to repeat. If you want just a single use alarm do not touch any days. Once you have finished setting your alarm, swipe left to return to the original screen and swipe again to receive a confirmation window.Use the ‘Wake Up Well’ Comlication on new Watch Faces to show the next alarm time.The frames of the watches in the screen shots are licensed under Creative Commons: http://wakeupwell.pete.ch/cc-attribution.txt",
    "descriptionHTML": "Transform your Android Wear watch into a <b>smart alarm clock</b> that lets you wake up well.<br>Wake up alert and in the right mood!<br><br>Can&#x2019;t remember the last time you woke up fresh and energised? Are you stuck in an endless cycle of sleeping through or ignoring your alarm clock?<br><br>Based on maximising the science of sleep, Wake Up Well has been designed to wake you up at the optimal time. Unlike the traditional alarm clock, which works to wake you up at a specific time, Wake Up Well wakes you up gently with vibrations at the optimal time &#x2013; when you&#x2019;re rested, relaxed and in REM or Rapid Eye Movement sleep.<br><br><b>What is REM?</b><br>REM Sleep was identified by sleep researchers as a phase in sleep in which a person sleeps lightly. It occurs throughout various times during sleep; one of the last instances it occurs is close to morning. It is said that during REM, the brain activity behaves similar to the brain activity during hours you are awake.<br><br><b>How it works</b><br>Wake Up Well detects the optimal time to wake you up. When using alarm clocks, most people&#x2019;s bodies are not yet prepared or still in deep sleep. Notice that when you wake via your alarm clock&#x2019;s command you&#x2019;re often groggy, have a cloudy mind and lacking in energy? That&#x2019;s because your body is still in deep sleep. With Wake Up Well, you&#x2019;re gently awoken during REM &#x2013; when your brain is more active and your body is naturally &#x2018;waking up&#x2019;.<br><br>Wake Up Well detects your slight movements during REM and in the &#x2018;wake up window&#x2019; you set. It is during this time Wake Up Well monitors when to wake you up.<br><br>Start the day with more energy with Wake Up Well.<br><br>Features:<br>- improves your sleep<br>- assists in improving your mood<br>- lets you wake up fresh, animated and more energised<br>- uses vibrations to wake you so your partner isn&#x2019;t disturbed<br>- especially designed for Android wear watches<br>- operational on the watch only, no Smartphone needed<br>- detect best wakeup time<br>- repeating alarms (Premium only)<br><br>- wakes up at the almost awake moments<br>- shows wake up screen immediately<br>- supports all Android wear watches<br>- set wake up time directly on the watch<br>- set a wake up window in which it wakes up at the best time regarding sleep phase (Premium only)<br>- configurable snooze time<br>- configurable alarm set reminder<br><br>In-app Products:<br>- Premium: Unlock repeated alarms and adjust the wake up window<br>- Donation<br><br>To set an alarm first open Wake Up Well on your watch. Touch &quot;New alarm&quot;, then scroll to the time you need to wake up. This is the latest time the alarm will go off.<br>Swipe to the right for options. The wake up window will determine the earliest time the alarm will wake you up - based on your sleep pattern. After setting your wake up window swipe to the right again and touch the days you want the same alarm to repeat. If you want just a single use alarm do not touch any days. Once you have finished setting your alarm, swipe left to return to the original screen and swipe again to receive a confirmation window.<br><br>Use the &#x2018;Wake Up Well&#x2019; Comlication on new Watch Faces to show the next alarm time.<br><br>The frames of the watches in the screen shots are <a href=\"https://www.google.com/url?q=http://www.google.com/url?q%3Dhttp%253A%252F%252Fwakeupwell.pete.ch%252Fcc-attribution.txt%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNFzs15RvUY0dZGByeTudG9hdx4XfQ&amp;sa=D&amp;usg=AFQjCNHSYIk3G1eDQskTUBMqc06hEKq4RA\" target=\"_blank\">licensed under Creative Commons:</a> http://wakeupwell.pete.ch/cc-attribution.txt",
    "histogram": {
        "1": 30,
        "2": 15,
        "3": 20,
        "4": 39,
        "5": 91
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ykFa_YQ9nztLrjzps3sT1zW91sA60IE0nzp_0_PELmJhokt2MOh2TiDct5d_wd_-OA=h310",
        "//lh3.googleusercontent.com/IqUjRNF8mTJp0R8AZKB_bL-3qKwC03Q6IhiU8nQPiaGLDrvDMCdiaI3m_-JcEL9JZJA=h310",
        "//lh3.googleusercontent.com/7fnxJxzvAryD5hlmftqven9wMd6hGMHqxC7aK9p_HWYQAtdsZJHfvXGFO9jJlYkJzIk=h310",
        "//lh3.googleusercontent.com/ixs9bPD5o47w2xBFGIKME-HCQjNR7-LF7wcPugDrSFoRIQ0M8VMmNEg41AMgbM0oRCc=h310",
        "//lh3.googleusercontent.com/RdBHYDQmyQSoPuKM92KzQKAufIbQA5kOvCPHoqs52BzxJVA5ZhBudUc4rpJVBRXy9Ab7=h310",
        "//lh3.googleusercontent.com/Hhh5pii57aL6JG_r-SblT2iRacXrnK34yeh5IAEXV3lARGl9j9MISOCimEHP93NvYQ=h310",
        "//lh3.googleusercontent.com/aKbU-r8VKJJDrCzmxVUmGi1BZVDdt2B6qhn2v2VuTGcFq1OorThcN_0uD8Wde5hq6GCN=h310",
        "//lh3.googleusercontent.com/EJX69nfVVoEmhe-LtTXHzDqsPGGcOOUwLYyWjYLELBXxxywCi_I9oWpYgySHA1DCFSg=h310",
        "//lh3.googleusercontent.com/ePaSNL-7Y8L3Jp3DnlXkAGsuMNLSaypgpuX7rFoNCMixe0T8dIlV8K6CAEWpN23fQFw=h310"
    ],
    "comments": [
        "Just installed and evaluating. Feature request: complication showing time untill next wake up alarm",
        "You have to pay for everything! -",
        "The biggest problem with the stock app, and the reason I got this one, is the fact that the stock app is too easy to dismiss (you sleepily cup your hand over the watch face, the alarm is turned off, and you go back to sleep). It's not so easy to dismiss this alarm. I wake up feeling more refreshed and it doesn't wake my wife up. Great job!",
        "I have trouble waking up even with 8 alarms set. This did the trick",
        "A great app. Wakes you up when hope you are ready. Get rid of your noisy alarms.",
        "Easy 5 stars, works 4/5 times but that is about my body and brain, the app and the algorythm it's 10/10"
    ],
    "recentChanges": [
        "Improve update of complication."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ch.pete.wakeupwell&hl=en&gl=us",
    "appId": "ch.pete.wakeupwell"
}