{
    "title": "Smart Time Tracker - Wear",
    "summary": "Keep track of your working hours with beautiful Material Design and Android Wear",
    "icon": "//lh4.ggpht.com/A_0WwY0CjJlJRHLYMxmTMQ9HYMMZtPXg4AZuiuGWfxH6NuCsAHz50whGpbJhVe6Xs_5Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.6,
    "reviews": 29,
    "developer": "Papers.ch Development",
    "developerId": "7633512823546139429",
    "developerEmail": "contact@papers.ch",
    "developerWebsite": "http://papers.ch",
    "developerAddress": "Sonnmattstrasse 121\n5242, Birr\nSwitzerland",
    "updated": "November 1, 2015",
    "version": "1.5.3",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Smart Time Tracker – Wear is a full-featured app for simple time recording and management. Featuring Android Wear support, tracking one swipe away, custom categories, statistics and much more. Smart Time Tracker provides a simple way to record your working hours or any time you want.Smart Time Tracker has a beautiful Material Design interface and brings Android Wear support.Smart Time Tracker – Wear highlights:•\tDesign – beautiful Material Design•\tSimplicity – Track your time from your notification screen•\tAndroid Wear – Compatible with Android Wear for watches like the Motorola Moto360, LG G Watch R and many more•\tCategories - Create your own categories with a name and an image•\tNFC – Write a category to an NFC tag for even easier tracking•\tSettings – Change the displaying of the time to working hours and much more•\tExport – Export your time to CSV/Excel/OpenofficeWe highly appreciate your feedback, to request something head on over to http://x61.ch/7f349a or drop us an email contact@papers.ch",
    "descriptionHTML": "Smart Time Tracker &#x2013; Wear is a full-featured app for simple time recording and management. Featuring <b>Android Wear support, tracking one swipe away, custom categories, statistics</b> and much more. Smart Time Tracker provides a simple way to record your working hours or any time you want.<br><br>Smart Time Tracker has a beautiful <b>Material Design</b> interface and brings <b>Android Wear</b> support.<br><br>Smart Time Tracker &#x2013; Wear highlights:<br>&#x2022;\tDesign &#x2013; beautiful Material Design<br>&#x2022;\tSimplicity &#x2013; Track your time from your notification screen<br>&#x2022;\tAndroid Wear &#x2013; Compatible with Android Wear for watches like the Motorola Moto360, LG G Watch R and many more<br>&#x2022;\tCategories - Create your own categories with a name and an image<br>&#x2022;\tNFC &#x2013; Write a category to an NFC tag for even easier tracking<br>&#x2022;\tSettings &#x2013; Change the displaying of the time to working hours and much more<br>&#x2022;\tExport &#x2013; Export your time to CSV/Excel/Openoffice<br><br>We highly appreciate your feedback, to request something head on over to http://x61.ch/7f349a or drop us an email contact@papers.ch",
    "histogram": {
        "1": 4,
        "2": 4,
        "3": 6,
        "4": 2,
        "5": 13
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "3.0 and up",
    "androidVersion": "3.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/6SFQyWXfyt3FoIZvoMot_vcQjj21cHdK74f5qqJsxFQtWSkGq7W98DcxiugPtHBURLY=h310",
        "//lh3.googleusercontent.com/zvk7C4QQackwbVzg3QgsrPcnKVuCdoX3mextvInCGK7IYSSajPk0M-aLmymDd2S8WgI=h310",
        "//lh3.googleusercontent.com/VfioCfuarYpK2e86jRUDVPsj0blPKG_ubOxjY2hagQxemo0ebHP66FrmQozXRVkoEJRb=h310",
        "//lh3.googleusercontent.com/z3img920maohHJocL1cAAoeqlLaemC_EjjJpbQFdOrOcdJLUa1-27dn3ebWnO0ELAA=h310",
        "//lh3.googleusercontent.com/x2XD46_CtZBmsL_4f6Pkl34uFdq_Qw4S7ObpP2TNMUMm_jfztkytfN8YqWelLiAZhQM=h310",
        "//lh3.googleusercontent.com/6VM7HZM_YFVpjNy_bFSYOw6viCQCurtRCHinD_t7kQzqCziU0pSlMLiq7X5J72RjWDc=h310",
        "//lh3.googleusercontent.com/ENNRg1tMH8rygY-biLj1ws6e37Lry4HA_0zY67YPEujeUQVoEnKScy1-yCZcvJNWmgg=h310",
        "//lh3.googleusercontent.com/os9zb8x31RLL4-YmT_By6qhdFU_weTs6-vQiyvDJCh1zmkDj1mD4_mQ4JsgoQyeNxpo=h310",
        "//lh3.googleusercontent.com/fdypZ5tnJ7TtCtKtrEF3VPMgqbwkTkhAXJsEzDXnOby8zZDb321fB6VVf2ExVzI11eVV=h310",
        "//lh3.googleusercontent.com/jyTjtZ8nzo3Ed6_Look3VZH0VmzpGDw0PplaCEBLSLpIqRf4w3grkYplYmpxUrZ7gQ=h310",
        "//lh3.googleusercontent.com/7CCLWc30qJ1aVz_zkweV95_AVcTZZNlk5_rU0__lMJ_0RHsXU3UVMQ4riDN8gCf7uAo=h310",
        "//lh3.googleusercontent.com/nK7B_3XTJ1C9QeJjvuFmQzC4PgZplYNk1DZr3kA_XraNlEipkxf1UOumx34uFYvtedR_=h310",
        "//lh3.googleusercontent.com/_MykqAyUMfFS1sgy1PJCuRYIxbl0Io6ct5YjDtDHMXIP-idPPKkoZWTyd3e57MQ5T6k=h310",
        "//lh3.googleusercontent.com/k55RUQl6B6kBncPLhKh8xN5vIr9meI6PuhR7mj4-nNoPwaRr5e9jpFfRWDJwCuf4NYI=h310",
        "//lh3.googleusercontent.com/b0mbFLbKWSUMANe4hmBKROW1SDqEXIllpTsIZMzF2TjscHM9zuw7ljTsR1IQvQBBhfyp=h310",
        "//lh3.googleusercontent.com/CXg86kHtAnpXLmtYgLTd-cTyn2J1mSd6uazKbTyG77curSSt_sWN2jIPiTIjglcKqnGP=h310"
    ],
    "comments": [
        "Not working good Not working good with zen watch 2. I actually bought my android wear to track my time during the day, and hoped this app to work alright. However it doesn't sync well and it keeps turning off. This app would be great if I can actually get to control it on my watch.",
        "As far as I can tell, the only way that this app functions on my Zenwatch 2 is if I start the app on my phone. Once you start the app on your phone, it parks what seems to be a button at the bottom of the screen to toggle the time tracking functionality on/off. But the button itself remains static, except for a short vibration that indicates you pressed it, so you can't be sure if the app is actually tracking your time or if it's standing by waiting to be activated because it doesn't change to indicate one way or another. I thought that the watch app would be more independent of the phone app, but it seems that you need to control most functionality of the watch app through the phone app. This makes the watch aspect of the app less than ideal, and the watch integration is what attracted me in the first place. And to those who think I may have something wrong with the Smart Time Tracker app on my watch, I thought the same thing when I first saw the less than stellar watch experience with this app. But even after a factory reset, I was presented with the same lackluster functionality.",
        "Android wear and phone are not in sync when switching categories. I think this is a potentially great product if you can get Android wear and phone app to work in unison so that I can track time directly from my watch.",
        "Not working with Android wear Kinda defeats it's name",
        "Hide notification during time range not working here - Galaxy S5, Gear Live. Cloud sync would be nice, but lacking.",
        "It's OK, but it's lacking. Good fit simple tasks, but I couldn't find a way to export per day/week/month. No way to clear task data."
    ],
    "recentChanges": [
        "- fixes category loss",
        "- geofence cleanup after clear"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ch.papers.timetracker&hl=en&gl=us",
    "appId": "ch.papers.timetracker"
}