{
    "title": "Bring! Grocery Shopping List",
    "summary": "Your beautiful and simple grocery list. Try it out now - it&#39;s free!",
    "icon": "//lh3.googleusercontent.com/HDH9pYi8m3Rh8bBEkoIttioFTBsPNE6vmHQB3SajXTFtB0VZ31unKWttb2txE7K-S80=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 29358,
    "developer": "Bring! Labs AG",
    "developerId": "8519184354148100199",
    "developerEmail": "hello@getbring.com",
    "developerWebsite": "http://www.getbring.com",
    "developerAddress": "Röntgenstrasse 44\n8005 Zurich\nSwitzerland",
    "updated": "March 2, 2018",
    "version": "Varies with device",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "size": "Varies with device",
    "description": "Bring! helps already over 2 million people around the world to plan and manage their grocery shopping. Thanks to the user-friendly shopping list and clever sharing functions, all people in the household are always aware of what needs to be bought. This way, you save a lot of time and money while shopping. Try it out now - it's completely free! ★Bring! is the only shopping list honored with «Editor's Choice» by Google Play. In addition, Bring! is recommended by Android PIT, Android Central, TechCrunch, Android Police and many more★The most important features of Bring! are:- Create and share your shopping lists with your family, colleagues or friends- Templates for all shopping lists you need - for your home, office, club or for holidays with friends- Bring! is optimized for smartphones, tablets and smartwatches- Add product photos to the items on the shopping list, so you always buy the right brand- Send clever, ready-made messages to inform your contacts that you are going shopping or have changed the list- The Bring! catalog includes several hundred articles. If something is missing, you can add articles yourself. The Bring! Shopping list can be downloaded and used free of charge. If you have feedback for us, please send an email to feedback@getbring.com.Simply clever shopping with Bring!",
    "descriptionHTML": "Bring! helps already over 2 million people around the world to plan and manage their grocery shopping. Thanks to the user-friendly shopping list and clever sharing functions, all people in the household are always aware of what needs to be bought. This way, you save a lot of time and money while shopping. Try it out now - it&apos;s completely free! <br><br>&#x2605;Bring! is the only shopping list honored with &#xAB;Editor&apos;s Choice&#xBB; by Google Play. In addition, Bring! is recommended by Android PIT, Android Central, TechCrunch, Android Police and many more&#x2605;<br><br><u>The most important features of Bring! are:</u><br>- Create and share your shopping lists with your family, colleagues or friends<br>- Templates for all shopping lists you need - for your home, office, club or for holidays with friends<br>- Bring! is optimized for smartphones, tablets and smartwatches<br>- Add product photos to the items on the shopping list, so you always buy the right brand<br>- Send clever, ready-made messages to inform your contacts that you are going shopping or have changed the list<br>- The Bring! catalog includes several hundred articles. If something is missing, you can add articles yourself. <br><br>The Bring! Shopping list can be downloaded and used free of charge. If you have feedback for us, please send an email to feedback@getbring.com.<br><br>Simply clever shopping with Bring!",
    "histogram": {
        "1": 1167,
        "2": 759,
        "3": 1549,
        "4": 5756,
        "5": 20127
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/LKWPPZdUAY6CqN4uZhNfhEFcOn-3x-xBQYFGqPJ0W_rgW8eZLTuGYaF8P9Fka_e5ygwa=h310",
        "//lh3.googleusercontent.com/6ge5iWe-uSQmyhN9HaDwQmtme7cDl_GI9TaZRM5HRLghuJmya8PFRCSxMw7ELXwMbg=h310",
        "//lh3.googleusercontent.com/rsz1Cvtxviim4XweG43p_U86ESRZfW1XgIVbcN6rR1WARmt58OjHtVIQssRHbb-tH6k=h310",
        "//lh3.googleusercontent.com/NXccA5_uVefVtkem_Ltuek0hZiWg-csguWRRjFnIv1ueAPpGE0pGDOsrod-eJNZ77rg=h310",
        "//lh3.googleusercontent.com/IK10gvBmkWewukB17dy7WUiHx6II8S9OIXVCpVdmSfpak7UO7QRv2qW9dcVcsgPsyK8=h310",
        "//lh3.googleusercontent.com/WY8sVNYF1hYOwe3R_A8F-FHei-xC6qdkk-fVF_u67mRAuti0nApgv3HTF-laxG6xfls=h310",
        "//lh3.googleusercontent.com/xX1IWFiWksjc09m8sl6c5MOrPipI0pTHYxTac3g1W3hnxXk5KLD1emImMag0k04gFjw=h310",
        "//lh3.googleusercontent.com/4bRlxmBqsKXUONA34p8QiTqtaDTYKhKbBoUUq3ZOBjK97hTrwYBJqIg-nqKCElrTZw=h310",
        "//lh3.googleusercontent.com/82NhHWySr2KI4KPb4TMMAs8ht-d5zHIQiCIrS5BD76UrGUMZ6uQE86lcJdb0Z7xsjA=h310",
        "//lh3.googleusercontent.com/Q7I112kJVPJVFUToNnFkHMiFsy8tL7q3f90fkqpFa0T6Cecu125QeqeT1zCSVnKZ5G21=h310",
        "//lh3.googleusercontent.com/LL6BE056amUV2UnMwUdRWKPU6oJIvZnVafVPBRtq4O-mbhgc9-i4x9OyPnDgURVaDyM=h310",
        "//lh3.googleusercontent.com/TPycTQaTl58tBHm32MbWZsge_pTvxBdDmlzEfqIyAqYMakJaTASBuX3iHHhOn-KxG7SM=h310"
    ],
    "video": "https://www.youtube.com/embed/dAle8-pl3-s",
    "comments": [
        "Wanted to try out this app, but it lacks some features. I would love to see a list of items that were just bought. It's very easy to accidentally tap an item and it's really hard to tell which item just vanished. Really missing the Dutch language as well as not all of my family members know English very well.  While I love the idea of adding photos to products, I'd really like to be able to see those pictures in the list without having to long press the item. I'd also love an easier way to add a different quantity straight from the list.",
        "Could you enable word auto completion? It's very annoying to it's deactivated on the input edit text",
        "And it works with the Amazon Echo now that's called progress good app I would recommend this app to anybody give it a try you'll see what I mean",
        "I love this app, is easy to use and helpful for my fam!",
        "Perfect for what we use it for.",
        "Hello, Bring! Team. Your app has been really helpful. The item listing is comprehensive, and the interface is snappy, easy to view and understand. I am unsure if I missed this as an option or setting though, but I hope there could be some reminder or notification (to get groceries) with the option to set time and date. Thank you so much!"
    ],
    "recentChanges": [
        "We work day and night to improve Bring! and make your personal experience better. Today we have optimized some things behind the scenes and improved our foundation. ✌️",
        "If you like Bring! please tell your friends and rate us in the Play Store. Thanks"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ch.publisheria.bring&hl=en&gl=us",
    "appId": "ch.publisheria.bring"
}