{
    "title": "SRF Meteo - Wetter Prognose Schweiz",
    "summary": "Stay up to date on the weather in Switzerland and worldwide.",
    "icon": "//lh3.googleusercontent.com/BHeWkufHCNh8t2-l65QT3FXLr0ILZXJyKYWbTq-lkPVMDFVupuLeKFEKmRmmJCX4Jx8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4,
    "reviews": 3015,
    "developer": "Schweizer Radio und Fernsehen (SRF)",
    "developerId": "5436652398406306309",
    "developerEmail": "srf@srf.ch",
    "developerWebsite": "http://www.srf.ch",
    "updated": "January 4, 2018",
    "version": "Varies with device",
    "genre": "Weather",
    "genreId": "WEATHER",
    "size": "Varies with device",
    "description": "Informieren Sie sich mit der SRF Meteo App schnell und einfach über das Wetter in der Schweiz und der ganzen Welt. Speichern Sie Ihre Lieblingsorte als Favoriten und behalten Sie das Wetter stets im Überblick. Der Meteo Niederschlagsradar zeigt Ihnen die Entwicklung der letzten sowie der kommenden Stunde und im 48h Modell. Während den Wintermonaten finden Sie in der SRF Meteo App die Schneewetter-Karte mit aktueller Schneehöhe, Neuschneehöhe und Lawinengefahr, herausgegeben vom Institut für Schnee- und Lawinenforschung SLF. Mit dem dreimal täglich aktualisierten Wetterbericht der SRF Meteo Redaktion sind Sie stets auf dem Laufenden über die Wetterprognose für die Schweiz. Täglich neues, spannendes rund ums Wetter finden Sie in den Meteo-News. Mit über 40 in der ganzen Schweiz verteilten Webcams machen Sie sich ein Bild über das aktuelle Wetter. Bei Wetterextremen an Ihren bevorzugten Schweizer Orten werden Sie per Pushmeldungen und direkt in der App mithilfe der Wetterwarnungen gewarnt. Zusammenfassung:-\tAlle relevanten Wetterinformationen auf einen Blick-\tPrognose und Wetterbericht für die Schweiz -\tLokalprognosen im Tagesverlauf für nationale und internationale Orte-\tNiederschlagsradar zeigt die Entwicklung -/+ 1h sowie der kommenden 48h-\tInteraktive und zoombare Wetterkarten-\tSchneewetter-Karte mit aktueller Schneehöhe, Neuschneehöhe und Lawinengefahr-\tÜber 40 Webcams zeigen in Echtzeit das Wetter in der Schweiz-\tFavoriten verwalten und vergleichen-\tWetterwarnungen per Push-Meldung-\tSRF Meteo News-\tInfos zum SRF Meteo Team",
    "descriptionHTML": "Informieren Sie sich mit der SRF Meteo App schnell und einfach &#xFC;ber das Wetter in der Schweiz und der ganzen Welt. Speichern Sie Ihre Lieblingsorte als Favoriten und behalten Sie das Wetter stets im &#xDC;berblick. Der Meteo Niederschlagsradar zeigt Ihnen die Entwicklung der letzten sowie der kommenden Stunde und im 48h Modell. W&#xE4;hrend den Wintermonaten finden Sie in der SRF Meteo App die Schneewetter-Karte mit aktueller Schneeh&#xF6;he, Neuschneeh&#xF6;he und Lawinengefahr, herausgegeben vom Institut f&#xFC;r Schnee- und Lawinenforschung SLF. Mit dem dreimal t&#xE4;glich aktualisierten Wetterbericht der SRF Meteo Redaktion sind Sie stets auf dem Laufenden &#xFC;ber die Wetterprognose f&#xFC;r die Schweiz. T&#xE4;glich neues, spannendes rund ums Wetter finden Sie in den Meteo-News. Mit &#xFC;ber 40 in der ganzen Schweiz verteilten Webcams machen Sie sich ein Bild &#xFC;ber das aktuelle Wetter. Bei Wetterextremen an Ihren bevorzugten Schweizer Orten werden Sie per Pushmeldungen und direkt in der App mithilfe der Wetterwarnungen gewarnt. <br><br>Zusammenfassung:<br>-\tAlle relevanten Wetterinformationen auf einen Blick<br>-\tPrognose und Wetterbericht f&#xFC;r die Schweiz <br>-\tLokalprognosen im Tagesverlauf f&#xFC;r nationale und internationale Orte<br>-\tNiederschlagsradar zeigt die Entwicklung -/+ 1h sowie der kommenden 48h<br>-\tInteraktive und zoombare Wetterkarten<br>-\tSchneewetter-Karte mit aktueller Schneeh&#xF6;he, Neuschneeh&#xF6;he und Lawinengefahr<br>-\t&#xDC;ber 40 Webcams zeigen in Echtzeit das Wetter in der Schweiz<br>-\tFavoriten verwalten und vergleichen<br>-\tWetterwarnungen per Push-Meldung<br>-\tSRF Meteo News<br>-\tInfos zum SRF Meteo Team",
    "histogram": {
        "1": 238,
        "2": 178,
        "3": 299,
        "4": 841,
        "5": 1459
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/k6Z1b6mLwrw45jX4uexvkxVXBYGPLa2SYejBq1UKUoEOOn6cltq6nzJt9UqSvLlL9kw=h310",
        "//lh3.googleusercontent.com/1RP0byuqW7sv3zWUNLp2x3NjYcxvt8N5G1SuCAwtrb2dVZ8gU7awTRHPPJzcEBB5NQ=h310",
        "//lh3.googleusercontent.com/NHyxQWNUpptN7HrxPDdcnGvfVr8foCo36poNSkAocgz3CwI1WTnWlbobGltuwaYOShI=h310",
        "//lh3.googleusercontent.com/SXIcEha5p7GNo7xmWx4KIFylWg6RPzc34g2rd-3nL0016QzLPKZu4qJGIiYnSvfKgM4=h310",
        "//lh3.googleusercontent.com/sWRp0E3ARAAspwY3yWJFgo1P4MqeqFZIAHT6aClQ8Qo3EuJDL_yQmbNGWx6HTRQrdw=h310",
        "//lh3.googleusercontent.com/-1qT_245FTEh1HmL-O5CbUm-lXzWSiFGqa3fzMrQLUTCRxkTrrdNiKx4eoMImBIfJa8=h310",
        "//lh3.googleusercontent.com/3VCtJapSQZX4v3kV0ZDumUIvg5JMX7VVnKowg07m06FcEsaWTv1WcOq-wgnA_MNMwQ=h310",
        "//lh3.googleusercontent.com/y1PGNdnIT6iXT4dDrIPsHAH3AjpraS9zOqbDxsTygAWUxr40EazbtrbC4d088_YC5KLj=h310"
    ],
    "comments": [
        "Super dir meteo bärn :-)",
        "Easy to use Favorites are very helpful to me.",
        "Wieso die App nicht mit Nexus 5X kompatibel sein soll, ist mir ein Rätsel...",
        "Totally inaccurate",
        "Absturz Anfänglich gut, dann plötzlich nur noch Abstürze. Neu installiert. Half aber auch nicht. Fix it, dann gibt es auch mehr Sterne!",
        "Android Wear Integration nervend Bitte dies optional machen, z.B als Einstellung. Bis dahin bleibt es deinstalliert."
    ],
    "recentChanges": [
        "Diese Version behebt mehrere Probleme in der App, die vereinzelt zu Abstürzen auf Smartphones und Android-Wear-Geräten geführt haben.",
        "Die SRF Meteo App wird laufend überarbeitet, um Ihren Bedürfnissen noch besser gerecht zu werden.",
        "Gefällt Ihnen die SRF Meteo App?",
        "Dann nehmen Sie sich doch ein paar Minuten Zeit für eine Bewertung im App Store.",
        "Bei Problemen mit der SRF Meteo App wenden Sie sich bitte an den SRF Kundendienst per E-Mail (srf@srf.ch) oder per Telefon (0848 80 80 80)."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ch.srf.meteo&hl=en&gl=us",
    "appId": "ch.srf.meteo"
}