{
    "title": "eBanking Mobile",
    "summary": "The Zürcher Kantonalbank always there.",
    "icon": "//lh3.googleusercontent.com/LrGePJIiDGT__ZT0m-fkdOQ8-4cb5liM1hKdwBofsWDnMBmb2FUiWldpEPrLOhtlgsA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.1,
    "reviews": 541,
    "developer": "Zürcher Kantonalbank",
    "developerId": "Z%C3%BCrcher+Kantonalbank",
    "developerEmail": "online@zkb.ch",
    "developerWebsite": "https://www.zkb.ch/app",
    "updated": "February 28, 2018",
    "version": "14.3",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Dank «eBanking Mobile» haben Sie flexiblen Zugang zu Ihren Konten. Überprüfen Sie Ihre Kontostände, machen Sie Kontoüberträge, bezahlen Sie mittels orangen Einzahlungsscheinen oder informieren Sie sich über das Geschehen an der Börse und tätigen Börsentransaktionen.ÜbersichtIhre Konten und Depots immer aktuell im Blickfeld. Prüfen Sie die letzten Buchungen und sehen Sie den Saldoverlauf ein. Überwachen Sie Ihr Depot und prüfen den Status Ihrer Börsenaufträge.ZahlungsverkehrErfassen und übermitteln Sie Einzahlungsscheine orange - dank integriertem Einzahlungsschein-Scanner auch ohne Referenznummern abzutippen. Führen Sie mit der QR Zahlung sofort und praktisch von eBanking Mobile zu eBanking Mobile Zahlungen aus. Überweisen Sie mit dem Kontoübertrag bequem den von Ihnen gewünschten Betrag von einem Konto auf ein anderes innerhalb Ihres eBanking Mobile. Und löschen Sie pendente Zahlungen direkt.FinanzassistentDer Finanzassistent analysiert automatisch Ihre Einnahmen und Ausgaben, ordnet sie Kategorien zu und unterstützt Sie bei der Ausgabenkontrolle. Erstellen Sie persönliche Budgets und überwachen Sie diese mit der eBanking Mobile App. Mit der Funktion Sparziele können sie einfach auf mehrere unerfüllte Träume hin sparen. Der Finanzassistent hilft Ihnen dabei.E-RechnungPrüfen Sie Ihre aktuellen E-Rechnungen, sehen die Rechnungsdokumente ein und geben die Rechnungen frei oder lehnen diese ab.BörsenSuchen Sie schnell und einfach nach einzelnen Titeln und erfassen direkt die gewünschten Börsenaufträge. Die Übersicht bietet Ihnen zudem die aktuellen Entwicklungen der weltweit wichtigsten Indizes mit den dazugehörigen Titellisten sowie den Tops und Flops.KurseZugriff auf aktuelle Kursinformationen von weltweit über 40 Börsenplätzen mit ca. 1.5 Mio. Titeln. Detaillierte Kursinformationen mit ausführlichen Performancezahlen, umfangreichen Charts sowie neusten Unternehmensnachrichten.NewsKompakte Börsen-, Unternehmens- und Wirtschaftsnachrichten mit der wöchentlichen Sendung «Börsen-Trend». Neben einer Übersicht über das aktuelle Marktgeschehen liefert «Börsen-Trend» einen Ausblick auf die wichtigsten anstehenden Wochenereignisse.MitteilungenVerwenden Sie für Mitteilungen an uns den geschützten Mitteilungskanal. Erfassen, lesen und beantworten Sie Ihre Mitteilungen bequem direkt von Ihrem Smartphone aus.BankverbindungNummern, Anschriften und weitere Informationen zu all Ihren Konten.WährungenAktuelle Noten- und Devisenkurse aus aller Welt. Schnelles und einfaches Umrechnen mit dem Währungsrechner.StandortePraktische Suche nach unseren Filialen und Geldautomaten mit automatischer Standortermittlung (auf Wunsch), Wegbeschreibung, Öffnungszeiten, Kontaktdaten sowie weiteren Services.KontaktDie wichtigsten Telefon- und Notfallnummern auf einen Blick.VoraussetzungenKompatibel mit allen Smartphones mit Android Betriebsystem 4.0 oder höher. Die Verwendung der eBanking Mobile Funktionen bedingt einen eBanking Vertrag.Den mobilen Zugang müssen Sie zuerst via eBanking aktivieren.Smartwatch AppKonfigurieren Sie beliebige Konten für die einfache und schnelle Saldoabfrage auf Ihrer Android Wear Smartwatch.KostenDer Download des «eBanking Mobile» im App Store ist kostenlos. Bei der Nutzung des «eBanking Mobile» fallen gegebenenfalls Verbindungskosten abhängig vom Provider an.",
    "descriptionHTML": "Dank <b>&#xAB;eBanking Mobile&#xBB;</b> haben Sie flexiblen Zugang zu Ihren Konten. &#xDC;berpr&#xFC;fen Sie Ihre Kontost&#xE4;nde, machen Sie Konto&#xFC;bertr&#xE4;ge, bezahlen Sie mittels orangen Einzahlungsscheinen oder informieren Sie sich &#xFC;ber das Geschehen an der B&#xF6;rse und t&#xE4;tigen B&#xF6;rsentransaktionen.<br><br><b>&#xDC;bersicht</b><br>Ihre Konten und Depots immer aktuell im Blickfeld. Pr&#xFC;fen Sie die letzten Buchungen und sehen Sie den Saldoverlauf ein. &#xDC;berwachen Sie Ihr Depot und pr&#xFC;fen den Status Ihrer B&#xF6;rsenauftr&#xE4;ge.<br><br><b>Zahlungsverkehr</b><br>Erfassen und &#xFC;bermitteln Sie Einzahlungsscheine orange - dank integriertem Einzahlungsschein-Scanner auch ohne Referenznummern abzutippen. F&#xFC;hren Sie mit der QR Zahlung sofort und praktisch von eBanking Mobile zu eBanking Mobile Zahlungen aus. &#xDC;berweisen Sie mit dem Konto&#xFC;bertrag bequem den von Ihnen gew&#xFC;nschten Betrag von einem Konto auf ein anderes innerhalb Ihres eBanking Mobile. Und l&#xF6;schen Sie pendente Zahlungen direkt.<br><br><b>Finanzassistent</b><br>Der Finanzassistent analysiert automatisch Ihre Einnahmen und Ausgaben, ordnet sie Kategorien zu und unterst&#xFC;tzt Sie bei der Ausgabenkontrolle. Erstellen Sie pers&#xF6;nliche Budgets und &#xFC;berwachen Sie diese mit der eBanking Mobile App. Mit der Funktion Sparziele k&#xF6;nnen sie einfach auf mehrere unerf&#xFC;llte Tr&#xE4;ume hin sparen. Der Finanzassistent hilft Ihnen dabei.<br><br><b>E-Rechnung</b><br>Pr&#xFC;fen Sie Ihre aktuellen E-Rechnungen, sehen die Rechnungsdokumente ein und geben die Rechnungen frei oder lehnen diese ab.<br><br><b>B&#xF6;rsen</b><br>Suchen Sie schnell und einfach nach einzelnen Titeln und erfassen direkt die gew&#xFC;nschten B&#xF6;rsenauftr&#xE4;ge. Die &#xDC;bersicht bietet Ihnen zudem die aktuellen Entwicklungen der weltweit wichtigsten Indizes mit den dazugeh&#xF6;rigen Titellisten sowie den Tops und Flops.<br><br><b>Kurse</b><br>Zugriff auf aktuelle Kursinformationen von weltweit &#xFC;ber 40 B&#xF6;rsenpl&#xE4;tzen mit ca. 1.5 Mio. Titeln. Detaillierte Kursinformationen mit ausf&#xFC;hrlichen Performancezahlen, umfangreichen Charts sowie neusten Unternehmensnachrichten.<br><br><b>News</b><br>Kompakte B&#xF6;rsen-, Unternehmens- und Wirtschaftsnachrichten mit der w&#xF6;chentlichen Sendung &#xAB;B&#xF6;rsen-Trend&#xBB;. Neben einer &#xDC;bersicht &#xFC;ber das aktuelle Marktgeschehen liefert &#xAB;B&#xF6;rsen-Trend&#xBB; einen Ausblick auf die wichtigsten anstehenden Wochenereignisse.<br><br><b>Mitteilungen</b><br>Verwenden Sie f&#xFC;r Mitteilungen an uns den gesch&#xFC;tzten Mitteilungskanal. Erfassen, lesen und beantworten Sie Ihre Mitteilungen bequem direkt von Ihrem Smartphone aus.<br><br><b>Bankverbindung</b><br>Nummern, Anschriften und weitere Informationen zu all Ihren Konten.<br><br><b>W&#xE4;hrungen</b><br>Aktuelle Noten- und Devisenkurse aus aller Welt. Schnelles und einfaches Umrechnen mit dem W&#xE4;hrungsrechner.<br><br><b>Standorte</b><br>Praktische Suche nach unseren Filialen und Geldautomaten mit automatischer Standortermittlung (auf Wunsch), Wegbeschreibung, &#xD6;ffnungszeiten, Kontaktdaten sowie weiteren Services.<br><br><b>Kontakt</b><br>Die wichtigsten Telefon- und Notfallnummern auf einen Blick.<br><br><b>Voraussetzungen</b><br>Kompatibel mit allen Smartphones mit Android Betriebsystem 4.0 oder h&#xF6;her. Die Verwendung der eBanking Mobile Funktionen bedingt einen eBanking Vertrag.<br>Den mobilen Zugang m&#xFC;ssen Sie zuerst via eBanking aktivieren.<br><br><b>Smartwatch App</b><br>Konfigurieren Sie beliebige Konten f&#xFC;r die einfache und schnelle Saldoabfrage auf Ihrer Android Wear Smartwatch.<br><br><b>Kosten</b><br>Der Download des &#xAB;eBanking Mobile&#xBB; im App Store ist kostenlos. Bei der Nutzung des &#xAB;eBanking Mobile&#xBB; fallen gegebenenfalls Verbindungskosten abh&#xE4;ngig vom Provider an.",
    "histogram": {
        "1": 46,
        "2": 38,
        "3": 49,
        "4": 108,
        "5": 300
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FIjKfoA41uXLD2LzTS8p8U2uvSiAIujL39w_ynVdhDbN30kWk-mypMFnug_OLLh8Dw=h310",
        "//lh3.googleusercontent.com/9daLReeBNfQVRUGW-d2a1DxOO7jlhfiB2XmGlgrBjox1w4AH-0mTuInTMDXeOgbpPw=h310",
        "//lh3.googleusercontent.com/LvCQbDRxasjuk6YyEUtobFr0IZ_OpAadNdnzKIJQ3mqOiIG42Dr2jN25p-mqqxZ2Y9S5=h310",
        "//lh3.googleusercontent.com/0OKg5VbUHWctXqCNdSRYW4Fp0K7Ek0EJmekOmYp_2yQaRHoIGJLVszSiHZmXWCcJRA=h310",
        "//lh3.googleusercontent.com/vX8dRhnKK3QU9LzWGigXgqRE-inAZlSkgaksORtGTp5RRrRiRRRthnszGpRdFyy0Kamv=h310",
        "//lh3.googleusercontent.com/l6up7i8yFtQ9oZUrV4UpdiAhYE5mEeHQsEvehiS4-9PPh9UCKgzChro8l3h-OM2Sw7k=h310",
        "//lh3.googleusercontent.com/y2rBinjqMhfcQ5aAb_bIEgYxCobozJv187l8LRdWzdldAJoLbOWbxscAoroF0arXZL2R=h310",
        "//lh3.googleusercontent.com/eS7gw_8VLF_gNDo5vxuubJUc_dg5hEgKSv0BuKzcwilYHnMV4a-Q_sDHuV90oUYw09I=h310",
        "//lh3.googleusercontent.com/U5nm7ICiXTufV3CaYrSRUox_NhSVAQcFQ3OitKfMNZ4mBRGE63tYj9YknHg1s5k6qNw=h310",
        "//lh3.googleusercontent.com/MGJ8rB3mNqSTyrt3885rOoMM0m54tMl9gVIs32D_nPhaJalK91ssOUSuZzlPKztPeUUD=h310",
        "//lh3.googleusercontent.com/tG3LhG6c8xfoOpAd3o6r4qZTBfSX9b2qFy27WQsIBU_Z5K4DBb8Zqrdm277-0fIb34U=h310"
    ],
    "comments": [
        "Decent app, works in English, allows me to do most of what I need in online banking. One issue is security: would be nice to have option for PIN *and* fingerprint; would also be nice to use this app for 2FA in the web interface. Making arbitrary SEPA payments doesn't seem to be possible as are payment templates.",
        "Insane lag for biometric login, very limited functionality. You can do much, much better than this",
        "could be better",
        "I have to scan the orange payment slip like 5 times until the autoscan finally works and on top of that I often still have to enter some additional info like in favour of:street, name, etc...",
        "Features \"Züritüütsch\" as language :-) Very helpful and seems to be reasonably secure.The scanning payment slips to the webapplication is very handy. If it works. the scanner is a bit fiddly. I would also like an option to block the app from triggering any payments at all. Read only mode. Thats what I use it for after they made it possible to scan slips to the web app.",
        "Two-factor security? Would it be possible to have both fingerprint authentication and a password required to log in?"
    ],
    "recentChanges": [
        "- Mit dem verbesserten Scanner für Einzahlungsscheine werden Fehler auf einigen Android Geräten behoben.",
        "- Sie können neu Ihr Mobile Passwort auch im eBanking unter Service & Kontakt > Zusatzfunktionen verwalten > eBanking Mobile ändern.",
        "- Wenn ihr Mobile Zugang gesperrt ist, können Sie diesen selber im eBanking entsperren.",
        "- Diverse Verbesserungen und Fehlerbehebungen."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ch.zkb.slv.mobile.client.android&hl=en&gl=us",
    "appId": "ch.zkb.slv.mobile.client.android"
}