{
    "title": "FitCloud",
    "summary": "Record GPS and Sensor based workouts and sync with Google Drive or Dropbox",
    "icon": "//lh3.ggpht.com/X4M10xjt_oWgV9HK0OcaXjMdYoI9A5U9YzteE5aOXFg7_gETMxYPb1YVy-AoMoqoOz0=w300",
    "price": "$6.04",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.4,
    "reviews": 32,
    "developer": "SPORTSTRACKLIVE",
    "developerId": "SPORTSTRACKLIVE",
    "developerEmail": "support@sportstracklive.com",
    "developerWebsite": "http://sportstracklive.com",
    "developerAddress": "SPORTSTRACKLIVE / TOUCOULEUR\nRoute de Bages, F-66450, Pollestres, FRANCE",
    "updated": "April 3, 2015",
    "version": "5.04",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Track your training and keep your workouts synced with your own cloud storage.Record GPS and Sensor based workouts and store in local storage (/Documents/FitCloud/) or Google Drive or Dropbox. For all outdoor (using GPS) and indoor sports (using sensors). For running, cycling, mountain biking, skiing, snowboarding, sailing, biking and indoor gym workouts and fitness classes. The best featured app to record your GPS track and monitor your performance and fitness. TRACK YOUR WORKOUT★ Recording of all GPS based activities.★ Recording of sensor based activities using bluetooth, BLE SMART and ANT+ ★ Track speed, distance, heart rate, time, pace, altitude gain/loss and moreTARGET YOUR TRAINING★ Customize speed, pace and heart rate based training plans in the app★ Race previous tracks ★ Receive highly customizable and detailed audio coaching and voice feedbackTRACK WORKOUT HISTORY★ Track workouts on your calendar and see your monthly totalsCOMPATIBLE WITH SENSORS AND WATCHES★ Android wear support (HR support on Moto360 and Gear Live)★ Bluetooth Zephyr HxM and Polar Wearlink BT and Zephyr BioHarness★ Bluetooth low energy SMART heart rate monitors, bike and running sensors★ Polar Wearlink® + transmitter with Bluetooth®★ Polar H7 and Zephyr Hxm SMART★ ANT+ heart rate monitors, bike and running sensorsEXPORT★ Export workouts in GPX and KML to your local storage, Google Drive or DropboxFor bluetooth sensors see http://sportstracklive.com/help/heart-rate for more info.For Bluetooth SMART (Bluetooth low-energy) sensors. See http://sportstracklive.com/help/bluetooth-smartThis app is ANT+ certified and supports ANT+ enabled heart rate sensors, footpods and bicycle speed & cadence sensors. Visit http://www.thisisant.com/directory for compatible devices.Email support@sportstracklive.com if you have any problemHelp, Feature requests and forum http://getsatisfaction.com/sportstrackliveBlog http://blog.sportstracklive.com",
    "descriptionHTML": "Track your training and keep your workouts synced with your own cloud storage.<br><br>Record GPS and Sensor based workouts and store in local storage (/Documents/FitCloud/) or Google Drive or Dropbox. <br><br>For all outdoor (using GPS) and indoor sports (using sensors). For running, cycling, mountain biking, skiing, snowboarding, sailing, biking and indoor gym workouts and fitness classes. The best featured app to record your GPS track and monitor your performance and fitness. <br><br>TRACK YOUR WORKOUT<br>&#x2605; Recording of all GPS based activities.<br>&#x2605; Recording of sensor based activities using bluetooth, BLE SMART and ANT+ <br>&#x2605; Track speed, distance, heart rate, time, pace, altitude gain/loss and more<br><br>TARGET YOUR TRAINING<br>&#x2605; Customize speed, pace and heart rate based training plans in the app<br>&#x2605; Race previous tracks <br>&#x2605; Receive highly customizable and detailed audio coaching and voice feedback<br><br>TRACK WORKOUT HISTORY<br>&#x2605; Track workouts on your calendar and see your monthly totals<br><br>COMPATIBLE WITH SENSORS AND WATCHES<br>&#x2605; Android wear support (HR support on Moto360 and Gear Live)<br>&#x2605; Bluetooth Zephyr HxM and Polar Wearlink BT and Zephyr BioHarness<br>&#x2605; Bluetooth low energy SMART heart rate monitors, bike and running sensors<br>&#x2605; Polar Wearlink&#xAE; + transmitter with Bluetooth&#xAE;<br>&#x2605; Polar H7 and Zephyr Hxm SMART<br>&#x2605; ANT+ heart rate monitors, bike and running sensors<br><br>EXPORT<br>&#x2605; Export workouts in GPX and KML to your local storage, Google Drive or Dropbox<br><br>For bluetooth sensors see http://sportstracklive.com/help/heart-rate for more info.<br><br>For Bluetooth SMART (Bluetooth low-energy) sensors. See http://sportstracklive.com/help/bluetooth-smart<br><br>This app is ANT+ certified and supports ANT+ enabled heart rate sensors, footpods and bicycle speed &amp; cadence sensors. Visit http://www.thisisant.com/directory for compatible devices.<br><br>Email support@sportstracklive.com if you have any problem<br><br>Help, Feature requests and forum http://getsatisfaction.com/sportstracklive<br><br>Blog http://blog.sportstracklive.com",
    "histogram": {
        "1": 1,
        "2": 2,
        "3": 2,
        "4": 6,
        "5": 21
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/_seYvBCBKzCdMKfq9qw4w6fyI9KPH2EpGz_B-crC8Jku8ksYtOlvtxgqjZ-TXeyeU9vU=h310",
        "//lh4.ggpht.com/uAIGAVdeo8ABNA--9Q_3W54SFWu-Im4Nn2H1wNdlA5KrSrNnLgwp34Q56ZXjfb7egTzU=h310",
        "//lh6.ggpht.com/K7a5TUGXKF56uN1gqBarK1_6t-1UcqnYEvmzayJhcoM0gPfcuVAu_cZGcBR4HyiCog=h310",
        "//lh5.ggpht.com/Yc9bHhxOpt9o055zUkvfmGcEAMlJ29jitpLGk5LHu01lclOXiHkKwSxEWAHwc0EOQJA=h310",
        "//lh6.ggpht.com/LhRS_7QT7daXExY3P-NehWVC2unoKqg8uz19tyJy1YzsCHWUX6NuWfrkkfnJEUMLx9Gv=h310",
        "//lh4.ggpht.com/aYVqDnurBvnFQFiFClGUzCc13tsFDdQIoD3lRvOOrUxLWnbW45ahkIHKEpE3JpjxyBM=h310",
        "//lh5.ggpht.com/makJlrQyP366GbItPc_tjVvd-pjjkWtmfwQMpH0NAyeOhek2Ktm75yFfZbJyi0Ad0aA=h310",
        "//lh6.ggpht.com/K1ClxCS5RmCBZyXt5wy2ZZZkv9UCitklAtjO9bpU6n7VxNAN_uHpukRvcaGSmW5LXg=h310",
        "//lh3.googleusercontent.com/RIckjL2tyn8EaCUdRV-8KGPXgIHLSr7r2YBPYsytCFOHmi6O4YmFvxClNBJwQ6MUGQ=h310",
        "//lh3.googleusercontent.com/aoVPx2GWop0gdVCoSAeTEP7I5WnkYFYrlpZPat0QQaAOgRU4A5HSZhGh_1l-ZL5N01s=h310",
        "//lh3.googleusercontent.com/dnvDw-ArbvbbJQBjDh7G-Dy-BlUpC5VsezY64RFwhwOIaVtNwPHjV3oGxDtHnthpOg=h310",
        "//lh3.googleusercontent.com/nmc7NaixoZXyzak_sfr2ncanVhexpeGfRg-JuEGjLxOuKvU2mAEUrR4m-8RQXafQzA=h310",
        "//lh3.googleusercontent.com/h73rKublI0EwK9S4Bh4o5kCJi8GT72zA-liJQM9Ji_Mfa-Mlgvw2O2ZN8VPVy0pBtOk=h310"
    ],
    "comments": [
        "Better indoor support needed When using the app in Sensor only mode (using heart rate monitor) in doors, I found that the unit was still searching for a GPS signal. The Category was set to Running Treadmill while indoors, so Distance is not tracked, would be helpful if stats like pace and distance could be manually updated. The ability to customize what is displayed on wearable android watches would be awesome.",
        "Best There is.... Enough said I've been using this for a long time after quite a few paid apps that fail to meet my needs.  Pros: easy to use, easy setup, pairs with HR monitor easily, can be uploaded to any social media or just use for yourself off the grid.  Lots of realtime data & graphs INCLUDED IN THE APP (you've already paid once, why use other apps where you pay a monthly fee for charts?).",
        "Pretty awesome",
        "Great App and Developer! I have been using Sports tracker live for years and haven't found an app quite like this. (basically an offline version of sports tracker live) I love that I can finally manage my own data! =]   Support this developer! He is doing all the right things and listens to his customers!",
        "Outstanding Application I've used SportsTrackLive for the past year. Of everything I've tried, I think STL has a noticeably better user interface / display. I only had one complaint - archiving my past workouts had to go through the STL website first. Now, with FitCloud, that is no longer the case. Kudos to the developer and thank you!",
        "Very Good Non-Subscription Fitness App I have tried ten different fitness apps.  All have had drawbacks, not least the fact that many require a monthly subscription to make certain features available.  FitCloud provides features for a one-off payment which are normally only available to subscribers to other apps.  These include the ability to set a GPS offset value to correct GPS readings to make altitude measurements more accurate, and good maps and graphs of each activity.  FIles are stored locally and are easily converted to KML or GPX files for use with other apps and programs.    Note that there are no social networking features, so this app may not be for everyone.  But if you don't need social networking, then this might be the app for you.    This app needs to have the ability to import tracks from other apps.  It would then get five stars from me."
    ],
    "recentChanges": [
        "V5.04 Bug fix for ANT+ device combined speed and cadence connection issue. Re-scan for your device in the ANT+ settings to make the connection faster on the next launch.",
        "More info http://blog.sportstracklive.com"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.fitcloud&hl=en&gl=us",
    "appId": "co.fitcloud"
}