{
    "title": "Nationwide Banking App",
    "summary": "Stay in control of your finances with Nationwide&#39;s Banking app.",
    "icon": "//lh3.googleusercontent.com/OXU7SpqLbvt1AqKljKfGWrBBg4E68dr2XdaXA-SaQhKjgox8rT7ry1m3giSWImDc_w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.9,
    "reviews": 18149,
    "developer": "Nationwide Building Society",
    "developerId": "Nationwide+Building+Society",
    "developerEmail": "mobilebanking.programme@nationwide.co.uk",
    "developerWebsite": "http://www.nationwide.co.uk/mobile-banking/",
    "updated": "February 23, 2018",
    "version": "4.1.4",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Stay in control of your finances at your convenience with our handy Mobile Banking app. To get started, all you need are your existing Internet Bank details. If you’re not already registered, it won't take long - you can do this via our website. **Features**Manage your money• Set up and pay a new payee*• See pending transactions for your current account(s)• Report your debit card as lost or stolen• Complete a balance transfer to your Nationwide credit card*• Log in with your fingerprint** – Fast, simple & secure access to your accounts• Transaction history – View the last 15 months' activity on your Current, Credit Card and Savings accounts plus 24 months of your mortgage payments• Search transactions – Helps you track down a particular payment quickly and easily• Payments and transfers – Send money to existing payees, now or on a future date• Manage payments – View and cancel regular payments/Direct Debits • Pay a contact using their mobile number – Send and receive money via Paym with just a mobile number• Cash flow bars – Your monthly spending habits made simple and visual• Quick Balance – See your balance without the need to log in• Smartwatch compatible – Check your balances with just a flick of your wrist• View your customer number and the contact details we have on file for youBecome a super saver• Create Savings Goals – Stay motivated (and on track) as you watch your savings grow• Impulse Saver – Quickly save without logging in, making it even easier to put some money away for a rainy day• Your savings interest rate – See what you're getting back for what you’re putting awayCustomise your accounts from your device• Increase or decrease your credit card limit• Text alerts and paperless settings – Sign up or amend your text alerts and cancel paper statements if you don't really need them• Manage your overdraft – Increase/decrease your overdraft limit • Apply for something new – Apply for a broad range of Nationwide accounts*You'll need your card reader for added security**Device and operating system compatibility requirements apply",
    "descriptionHTML": "Stay in control of your finances at your convenience with our handy Mobile Banking app. To get started, all you need are your existing Internet Bank details. If you&#x2019;re not already registered, it won&apos;t take long - you can do this via our website. <br><br>**Features**<br><br>Manage your money<br>&#x2022; Set up and pay a new payee*<br>&#x2022; See pending transactions for your current account(s)<br>&#x2022; Report your debit card as lost or stolen<br>&#x2022; Complete a balance transfer to your Nationwide credit card*<br>&#x2022; Log in with your fingerprint** &#x2013; Fast, simple &amp; secure access to your accounts<br>&#x2022; Transaction history &#x2013; View the last 15 months&apos; activity on your Current, Credit Card and Savings accounts plus 24 months of your mortgage payments<br>&#x2022; Search transactions &#x2013; Helps you track down a particular payment quickly and easily<br>&#x2022; Payments and transfers &#x2013; Send money to existing payees, now or on a future date<br>&#x2022; Manage payments &#x2013; View and cancel regular payments/Direct Debits <br>&#x2022; Pay a contact using their mobile number &#x2013; Send and receive money via Paym with just a mobile number<br>&#x2022; Cash flow bars &#x2013; Your monthly spending habits made simple and visual<br>&#x2022; Quick Balance &#x2013; See your balance without the need to log in<br>&#x2022; Smartwatch compatible &#x2013; Check your balances with just a flick of your wrist<br>&#x2022; View your customer number and the contact details we have on file for you<br><br>Become a super saver<br>&#x2022; Create Savings Goals &#x2013; Stay motivated (and on track) as you watch your savings grow<br>&#x2022; Impulse Saver &#x2013; Quickly save without logging in, making it even easier to put some money away for a rainy day<br>&#x2022; Your savings interest rate &#x2013; See what you&apos;re getting back for what you&#x2019;re putting away<br><br>Customise your accounts from your device<br>&#x2022; Increase or decrease your credit card limit<br>&#x2022; Text alerts and paperless settings &#x2013; Sign up or amend your text alerts and cancel paper statements if you don&apos;t really need them<br>&#x2022; Manage your overdraft &#x2013; Increase/decrease your overdraft limit <br>&#x2022; Apply for something new &#x2013; Apply for a broad range of Nationwide accounts<br><br>*You&apos;ll need your card reader for added security<br>**Device and operating system compatibility requirements apply",
    "histogram": {
        "1": 2648,
        "2": 1149,
        "3": 1502,
        "4": 3438,
        "5": 9412
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/r3j2ppDOew2DXr2aOJ-lxpL2orHN1q2O4G3r1Gwu6Tkr4-UyJbgZgxvNX3jGgLUwOiI=h310",
        "//lh3.googleusercontent.com/IAKy-VA3w2EoVYLA27xS1PNQAL6TZGOY_v37cPtGzSa2pDduFcBWiQS4kHBKYpPzG9A=h310",
        "//lh3.googleusercontent.com/Be-9YYEcdvKkqx5DmIxt2dzLoumvu4FabkoCEUx69FxqZDdZc67gLeIa4zJn-Dtn3Go=h310",
        "//lh3.googleusercontent.com/vqa1SP4gHq6JIFDKsXCt1Sa5E7-MmYNpi4OXKrEY_JHB2K_l7Hvqb2VC1HYAFE5wcA=h310",
        "//lh3.googleusercontent.com/TQmYERMSWJqW8Rke3grclicM7y9Dk98p0go61g3e754aomRSkFboPaqjL4Y5pPn0ayw=h310",
        "//lh3.googleusercontent.com/mkc39Gr3yTOmRfD7OYOi6Dq5aiSgeF2IoTzsQ12lHAD5EyDNg1rGbbVbyd_SBMSz_fU=h310",
        "//lh3.googleusercontent.com/bTrdX3WtsegHZ0Ae6tL6zQ4CfXSyotj48dQ1L71ppZfGNUHWniL3Fusqa2YVxLLDQEQh=h310",
        "//lh3.googleusercontent.com/NPwOaJmqb5QvTNVQYJ_4gcB3BNqk44KmouIfUSBBbi42dnrsKqd4fraM2zVvUwHrRaFE=h310",
        "//lh3.googleusercontent.com/Fo6P9hoZUqbhNS40dV8nYIESwFWaU5-h5EvdEBoEAN14DonEp17DtssLeqYpkFXZYxI=h310",
        "//lh3.googleusercontent.com/CjBNmIVaY_vAhwx3gDOsIBIP5Z2SQliDOoTloTTN6921kMg6MHNyLeAbaTRJsSaQZQ=h310",
        "//lh3.googleusercontent.com/YvA52OTY7ocqWi9PMirfYNHdh0eVHVVu4hwau3eZysX5DTN2fvK0ACS2nXKngFwPpvs=h310",
        "//lh3.googleusercontent.com/oK39bAElqTvkGys2ZWwXREw2LXsKZoaojxyitN2piYnt7I_mHl2uOoTI8zca2Axwr2I=h310",
        "//lh3.googleusercontent.com/6WURbhkSMuxzaLLn0_cTu5ikFqURPijDeWPErmK88FkAS_EYfrITlXF5Hh4L6fdLmbo=h310",
        "//lh3.googleusercontent.com/UG5leiiTcGDQlxo1Of7m0BywPVyIwrm0woU78x6s2oLKpyaOaC5Ckw8Ftw1SYnD-Ct8=h310",
        "//lh3.googleusercontent.com/uRtVgm3VmBpNraFVOjhwh5WvyVMwcV4vRRMF5uAatKkw8XCX4XqyjYrBnbLrGmJ48g=h310",
        "//lh3.googleusercontent.com/Ga5SqJe1NggIofYHeY-if1HW15hw50qfntcNW007tXuSkluWsbafUyCMMXiya426mYw=h310",
        "//lh3.googleusercontent.com/Cwm1bwhFaG60QtO9xShVKM1XomNCFCjkgsQGCGnf8TtH9HuNGxAdAAvc4SEj5Q7FnQ=h310",
        "//lh3.googleusercontent.com/GJy36v0gHU0lP_5ZO9O0Rm1tQ0rWK0BHHpchOeY2F4HIrBohYNHE-EF2wmVif6i2DhI=h310",
        "//lh3.googleusercontent.com/aFQbt5VQlCQdk4T4531WUy9tCWeDz5OeKNOyz9bY5Cv_ApsQBPgOhZ2UdI4nGx4doii6=h310"
    ],
    "comments": [
        "Absolutely sick of waiting for this to load and seeing 'Talking to Nationwide'. Usually end up logging in online which is just far more inconvenient. It really needs some work. Very frustrating! It's actually a brilliant app once you're on but very very unreliable.",
        "It's one of the few apps that doesn't do updates for pointless changes that just throw you. It's simple, and clear. The only suggestion: don't use 'Close' as a term, use 'Back' as the former makes you wonder if the whole app is going to close. A great app.",
        "Not working for Huawei Mate 10 Pro on Android Oreo 8.0.0 which isn't helpful get with the times and update the app.  Very frustrating!",
        "Love it! Just switched from Barclays and while it doesn't look as nice asthetically it is way more functional. Can see details of pending transactions and can use finger print login. Good stuff!",
        "Use to love this but since being told by your customer support that I don't have access to see references for payments coming in, I have been very unhappy. I use this for my window cleaner customers to pay into and their address references do not show up. I was told only nationwide staff get to see these. Seems so out dated as all other banks provide this service.",
        "When it works it's a great app. The problem is there are so many times when it is 'talking to Nationwide' without connecting rendering it useless. I would hate to have to rely on this app."
    ],
    "recentChanges": [
        "This is a minor update with some bug fixes.",
        "From the previous release:",
        "• Report your Debit card/s lost or stolen",
        "• Our new Personal Details section means you can now view your customer number and the contact details we have on file for you"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=co.uk.Nationwide.Mobile&hl=en&gl=us",
    "appId": "co.uk.Nationwide.Mobile"
}