{
    "title": "Vingle, Interest Network.",
    "summary": "Meet and share with people who love what you love.",
    "icon": "//lh3.googleusercontent.com/ZTutQMNGFCu1WXMzVuWHKxhFVe0S-3Dvia6Ckzi5hAWN38soEZ9wRPd_5-gT-ylXXWM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.7,
    "reviews": 65933,
    "developer": "Vingle Inc.",
    "developerId": "Vingle+Inc.",
    "developerEmail": "support.android@vingle.net",
    "developerWebsite": "https://www.vingle.net/",
    "updated": "February 11, 2018",
    "version": "4.1.7",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Vingle, Interest Network.Vingle, where people love what you love.Have you ever had a time when you start reading an article or talking to some friends about something and when you finally look up, hours have flown by? Do you have one hobby, book, or TV show that brightens your day? Then Vingle is the place for you.Think back to a time when you had a joke or a thought that was so funny that you had to share it with someone. You go to your close friends, but they never watched that Anime or aren't into that book series. They don't get it.  It's a bummer to not be able to fully geek out on something you love. In instances like this, we often censor ourselves on social media in order to maintain a certain image or just to not annoy our family and friends that don't have the same hobbies. On Vingle, though, there is no need to limit how many times you post about your stamp collection, or favorite boy band.  Your posts will go directly to a community of people who get you, who want to talk about that as much as you do!We believe that being ourselves and sharing what we truly love is the best way to relieve stress and simply be happier.  That uplifting feeling from finding someone who understands you, is priceless and invaluable to a joyful life.  It is our passion at Vingle to create that space for people to feel that sense of belonging.Whether you're looking for tips for your upcoming Japan trip from fellow Studio Ghibli fans, book suggestions from murder mystery addicts, or you just want to chat, share, and learn about your hobby or passion, Vingle is the community for you.Join communities based on your Interests, follow people who love what you love, and share anything from a simple question to a long post with videos and photos.  You can even create your own communities if you want to get more specific about your interest! Communities can be anything from general 'Movies' to something as specific as 'Quentin Tarantino's Left Eyebrow' if you're really that interested in it ;) You're in control!So stop hiding your passions and enjoying your hobbies alone.  Geek out on Vingle, where people love what you love.  The only question remaining is:\"What are you into?\"",
    "descriptionHTML": "Vingle, Interest Network.<br>Vingle, where people love what you love.<br><br>Have you ever had a time when you start reading an article or talking to some friends about something and when you finally look up, hours have flown by? Do you have one hobby, book, or TV show that brightens your day? Then Vingle is the place for you.<br><br>Think back to a time when you had a joke or a thought that was so funny that you had to share it with someone. You go to your close friends, but they never watched that Anime or aren&apos;t into that book series. They don&apos;t get it.  It&apos;s a bummer to not be able to fully geek out on something you love. <br><br>In instances like this, we often censor ourselves on social media in order to maintain a certain image or just to not annoy our family and friends that don&apos;t have the same hobbies. On Vingle, though, there is no need to limit how many times you post about your stamp collection, or favorite boy band.  Your posts will go directly to a community of people who get you, who want to talk about that as much as you do!<br><br>We believe that being ourselves and sharing what we truly love is the best way to relieve stress and simply be happier.  That uplifting feeling from finding someone who understands you, is priceless and invaluable to a joyful life.  It is our passion at Vingle to create that space for people to feel that sense of belonging.<br><br>Whether you&apos;re looking for tips for your upcoming Japan trip from fellow Studio Ghibli fans, book suggestions from murder mystery addicts, or you just want to chat, share, and learn about your hobby or passion, Vingle is the community for you.<br><br>Join communities based on your Interests, follow people who love what you love, and share anything from a simple question to a long post with videos and photos.  You can even create your own communities if you want to get more specific about your interest! Communities can be anything from general &apos;Movies&apos; to something as specific as &apos;Quentin Tarantino&apos;s Left Eyebrow&apos; if you&apos;re really that interested in it ;) You&apos;re in control!<br><br>So stop hiding your passions and enjoying your hobbies alone.  Geek out on Vingle, where people love what you love.  The only question remaining is:<br><br>&quot;What are you into?&quot;",
    "histogram": {
        "1": 1973,
        "2": 836,
        "3": 2222,
        "4": 7655,
        "5": 53247
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/e0nLF_uWQoC_q8ZLQhPe6Pni7z5uXlsJfUSCjD6NOzbE18KfaYGT7KKwU7guazedZvM=h310",
        "//lh3.googleusercontent.com/ksc3PTMZsxZDbiwWby3GkTe1WqAfB4lzJqIJOdEAyuVuMGZ0E8UGj4GwzhEP9LfhMA=h310",
        "//lh3.googleusercontent.com/VOuUrHUQJmyjpYQ9nPMRR3HYAdEsXxhDvSlTNcqvAlVrBUtU-2r9xGmz3RG3Mh3N0zQO=h310",
        "//lh3.googleusercontent.com/6UfwEHmCE6NUkXqYDcNxV5L41L0uC3QfVuvne00ekg2Db9h1cF2gToum5hIlVbvxTQ=h310",
        "//lh3.googleusercontent.com/aKvdsb-dznK7LuvyoSdHLqBhJuz_Dxd4F0nAxyWwfEcoYXcTzSwQ3Ga43M07WVESni0=h310",
        "//lh3.googleusercontent.com/xUEayYI2jIK8_rR3H4bFWPHHT30bW7Cb_4nitdb3oUfv-VwuO2N8qhBx2mZHhy1e0po=h310"
    ],
    "video": "https://www.youtube.com/embed/kQqETH788MA",
    "comments": [
        "LOVE IT!! I've been with Vingle for almost a year now and it has never failed to amazing me. There are a couple of things i would like to suggest, like create a chat section where you can create groups or make personal messages to each other. But thats just an idea. I LOVE VINGLE!!!",
        "I didn't really like the hashtag idea for this, but im used to it now. Right now the obly bug im having is it will say page not found even if im looking at the card. I hope this big gets fixed(when this happens my notifications stay )",
        "Why I can't log in again after I verified my account? 😔👀",
        "Cool app!",
        "Nice",
        "Brilliant"
    ],
    "recentChanges": [
        "Minor bug fixes and performance improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.vingle.android&hl=en&gl=us",
    "appId": "com.vingle.android"
}