{
    "title": "Facebook",
    "summary": "Find friends, watch live videos, play games &amp; save photos in your social network",
    "icon": "//lh3.googleusercontent.com/ZZPdzvlpK9r_Df9C3M7j1rNRi7hhHRvPhlklJ3lfi5jk86Jd1s0Y5wcQ1QgbVaAP5Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000000,
    "maxInstalls": 5000000000,
    "score": 4.1,
    "reviews": 75012826,
    "developer": "Facebook",
    "developerId": "Facebook",
    "developerEmail": "android-support@fb.com",
    "developerWebsite": "https://www.facebook.com/facebook",
    "developerAddress": "1 Hacker Way\nMenlo Park, CA 94025",
    "updated": "March 2, 2018",
    "version": "Varies with device",
    "genre": "Social",
    "genreId": "SOCIAL",
    "size": "Varies with device",
    "description": "Keeping up with friends is faster and easier than ever. Share updates and photos, engage with friends and Pages, and stay connected to communities important to you. Features on the Facebook app include:* Connect with friends and family and meet new people on your social media network* Set status updates & use Facebook emoji to help relay what’s going on in your world* Share photos, videos, and your favorite memories.* Get notifications when friends like and comment on your posts* Find local social events, and make plans to meet up with friends* Play games with any of your Facebook friends* Backup photos by saving them in albums* Follow your favorite artists, websites, and companies to get their latest news* Look up local businesses to see reviews, operation hours, and pictures* Buy and sell items and services* Watch live videos on the goThe Facebook app does more than help you stay connected with your friends and interests. It's also your personal organizer for storing, saving and sharing photos. It's easy to share photos straight from your Android camera, and you have full control over your photos and privacy settings. You can choose when to keep individual photos private or even set up a secret photo album to control who sees it.Facebook also helps you keep up with the latest news and current events around the world. Subscribe to your favorite celebrities, brands, news sources, artists, or sports teams to follow their newsfeeds, watch live streaming videos and be caught up on the latest happenings no matter where you are!The most important desktop features of Facebook are also available on the app, such as writing on timelines, liking photos, browsing for people, and editing your profile and groups. Now you can get early access to the next version of Facebook for Android by becoming a beta tester. Learn how to sign up, give feedback and leave the program in our Help Center: http://on.fb.me/133NwuP Sign up directly here: http://play.google.com/apps/testing/com.facebook.katanaProblems downloading or installing the app? See http://bit.ly/GPDownload1Still need help? Please tell us more about the issue. http://bit.ly/invalidpackageFacebook is only available for users age 13 and over.Terms of Service: http://m.facebook.com/terms.php.",
    "descriptionHTML": "Keeping up with friends is faster and easier than ever. Share updates and photos, engage with friends and Pages, and stay connected to communities important to you. <br><br>Features on the Facebook app include:<br><br>* Connect with friends and family and meet new people on your social media network<br>* Set status updates &amp; use Facebook emoji to help relay what&#x2019;s going on in your world<br>* Share photos, videos, and your favorite memories.<br>* Get notifications when friends like and comment on your posts<br>* Find local social events, and make plans to meet up with friends<br>* Play games with any of your Facebook friends<br>* Backup photos by saving them in albums<br>* Follow your favorite artists, websites, and companies to get their latest news<br>* Look up local businesses to see reviews, operation hours, and pictures<br>* Buy and sell items and services<br>* Watch live videos on the go<br><br><br>The Facebook app does more than help you stay connected with your friends and interests. It&apos;s also your personal organizer for storing, saving and sharing photos. It&apos;s easy to share photos straight from your Android camera, and you have full control over your photos and privacy settings. You can choose when to keep individual photos private or even set up a secret photo album to control who sees it.<br><br>Facebook also helps you keep up with the latest news and current events around the world. Subscribe to your favorite celebrities, brands, news sources, artists, or sports teams to follow their newsfeeds, watch live streaming videos and be caught up on the latest happenings no matter where you are!<br><br>The most important desktop features of Facebook are also available on the app, such as writing on timelines, liking photos, browsing for people, and editing your profile and groups. <br><br>Now you can get early access to the next version of Facebook for Android by becoming a beta tester. Learn how to sign up, give feedback and leave the program in our Help Center: http://on.fb.me/133NwuP <br><br>Sign up directly here: <br>http://play.google.com/apps/testing/com.facebook.katana<br><br>Problems downloading or installing the app? See http://bit.ly/GPDownload1<br>Still need help? Please tell us more about the issue. http://bit.ly/invalidpackage<br><br>Facebook is only available for users age 13 and over.<br>Terms of Service: http://m.facebook.com/terms.php.",
    "histogram": {
        "1": 9037751,
        "2": 3208912,
        "3": 6716534,
        "4": 11501837,
        "5": 44547792
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/mp4SqWczm2U5C_4AHOGgdCn_t0-_e7CTG-D6LLIB0wq-kXuaO-k7OrCuJERkYM6K3gs=h310",
        "//lh3.googleusercontent.com/U4KfYKLUyNPDff140ltryBdkoaMNw1wXcwO69T5qMtMQCoW6bKcJU5-A3TzFfT2e1RFo=h310",
        "//lh3.googleusercontent.com/GnhawJMfk4-mTG18PBF-EeHOHasGxp1WRC_p0SpwfetdqPzKJ2CvQbUqy4MhvOrwqlE=h310",
        "//lh3.googleusercontent.com/C90HL_QDU6nVVmRDkRz8pb5j7ZbVqc3-49o1uTyZT4A__9xBv-YAqFf4wJBRRU5GQw=h310",
        "//lh3.googleusercontent.com/QX-RaMTpbpy2_5T02Zo5PeBAymPFP0yy9O2ahuSL5gV4eYLEZwHn6IdGxWwUy8D-0b0=h310"
    ],
    "comments": [
        "Can't post on groups since latest update",
        "Why alter day updates?",
        "Earlier it was good but now a days its complete disappointed me . Ek dam kachra ha gaya hai bahut problem ho raha hai . Agar ye prob thik nahi hua to me use delete kardunga .",
        "Everytime i share a post the selection box gets stuck and i cant get out of whatevr im sharing...",
        "My mobile keeps telling me the app is causing my phone to run slowly at least 17 times a week!! Please sort it out!!!!!!!!!! Fed up of it causing me problems.",
        "Need to fix this update, it keeps on freezing."
    ],
    "recentChanges": [
        "• Improvements for reliability and speed"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.facebook.katana&hl=en&gl=us",
    "appId": "com.facebook.katana"
}