{
    "title": "Inbox by Gmail",
    "summary": "Already using Gmail? Try out our new email app.",
    "icon": "//lh6.ggpht.com/doFtR_H-dXJH0Mnm0zVchxrv0cWBy3O46_lWVYOnhY1M-cid2Tb7fX1FXPTyxx1BT24=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.2,
    "reviews": 393671,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "apps-help@google.com",
    "developerWebsite": "http://inbox.google.com/",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "February 26, 2018",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Your email inbox should help you live and work better, but instead it often buries the important stuff and creates more stress than it relieves. Inbox, built by the Gmail team, keeps things organized and helps you get back to what matters.• HIGHLIGHTS - Get the most important information without even opening the message. Check-in for flights, see shipping information for purchases, and view photos from friends right up front.• BUNDLES - Similar messages are bundled together so you can deal with them all at once. And get rid of them with one swipe.• REMINDERS - More than mail, you can add Reminders so your inbox contains all the things you need to get back to.• SNOOZE - Snooze emails and Reminders to come back when you are ready to deal with them: next week, when you get home, or whenever you choose.• SEARCH - Inbox helps you find exactly what you’re looking for— from your upcoming flight to a friend's address— without having to dig through messages.• WORKS WITH GMAIL - Inbox is built by the Gmail team, so all your messages from Gmail are here, along with the reliability and spam protection of Gmail. All of your messages are still in Gmail and always will be.",
    "descriptionHTML": "Your email inbox should help you live and work better, but instead it often buries the important stuff and creates more stress than it relieves. Inbox, built by the Gmail team, keeps things organized and helps you get back to what matters.<br>&#x2022; HIGHLIGHTS - Get the most important information without even opening the message. Check-in for flights, see shipping information for purchases, and view photos from friends right up front.<br>&#x2022; BUNDLES - Similar messages are bundled together so you can deal with them all at once. And get rid of them with one swipe.<br>&#x2022; REMINDERS - More than mail, you can add Reminders so your inbox contains all the things you need to get back to.<br>&#x2022; SNOOZE - Snooze emails and Reminders to come back when you are ready to deal with them: next week, when you get home, or whenever you choose.<br>&#x2022; SEARCH - Inbox helps you find exactly what you&#x2019;re looking for&#x2014; from your upcoming flight to a friend&apos;s address&#x2014; without having to dig through messages.<br>&#x2022; WORKS WITH GMAIL - Inbox is built by the Gmail team, so all your messages from Gmail are here, along with the reliability and spam protection of Gmail. All of your messages are still in Gmail and always will be.",
    "histogram": {
        "1": 25449,
        "2": 15678,
        "3": 35131,
        "4": 85912,
        "5": 231501
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Oz13JGyH0H2XBd_sflttWnAK_LRafyHW_P59Wfc4kqasiAMLhHLyZgKBTz2MpwZbJg=h310",
        "//lh3.googleusercontent.com/NqdzyzoxqTBXVZrrZYpU4BG19-QhA8gdBhmf3nkfvVJ7d4VqANee_F3114HHdt2lAHw=h310",
        "//lh3.googleusercontent.com/f4A9--8-kkmDzBtYh3ePhV3kKE5lQUKNOVN7yfceIw5w2vZvxl3mJ37tQNPNNEgk7Q=h310",
        "//lh3.googleusercontent.com/T9o2jv2HyJg6eGamvnDWZt464_4RtjibEB0I-FePxbX-FI-72_lgMmIpOtaeSsmorWg=h310",
        "//lh3.googleusercontent.com/OSQxwOdq-92Dpo0lTm4k7xLkTahYqqGpy2w3CictjZJ7pDidcEWlsS2nTRSPtXI4fy0=h310",
        "//lh3.googleusercontent.com/nD45KoRn7E5Sw6Cy6aQbYd713ZI1dgQd7Bz4ZWtfLVf4EUse9z6GpW4KgKAW3LcnI1c3=h310",
        "//lh3.googleusercontent.com/bCf1aJaKy9CG4W8viDPPEKfwW0aE_twWRR7acRL21fJFlBsNLKT2rAKO1uxxRC5daQ=h310",
        "//lh3.googleusercontent.com/W6TWAxL51Oy1TP5r5-k7wkYr3XZ5I3h5QSlQcadvY3kCS_JmDKjaMmx_NhMmQATrtCE=h310",
        "//lh3.googleusercontent.com/DQZox5v9OpuAPMntDWQ3XobPiztxEWKMhL6buWljUdrFAhDcvFS1xvAeIwk0l1GXfPs=h310",
        "//lh3.googleusercontent.com/ZbT0VPjRBdKcv5HoipgrOIbHBuIXlSWaKjnzEbo-BVUs62hc7FHDEsgPCk5IF1LenA=h310",
        "//lh3.googleusercontent.com/uhdkpaEYL-6PIe1S5lKc6cNMbaKwSrUnSNZO3TifbxBuRN4_4-V8p7pFE_Y8cUal1A=h310"
    ],
    "video": "https://www.youtube.com/embed/VCo3zZ0P4vU",
    "comments": [
        "Never had any problems with the app until the most recent update, now whenever I press reply to an email it crashes and I have to close the app.  I don't think the app can handle opening up an email thread, it takes a while to load the next screen then get the error message when I press to start typing. Please change it back so the reply box just expands like it used to rather than a whole new screen like I'm about forward the message, very annoying!",
        "All I can say is GOOGLE what happened?  You've totally dropped the ball.  This app was amazing I LOVED it but I recently went to send an email and literally all I can do is type and attach something.   I can't format any of my text and I can't even add links to my email.  If I wanted to just type and add a pic I would text message.   I am trying to send a professional email and I can't do it from my phone any more.   I checked and they did the same to the mobile version for my tablet as well.  I even logged into the regular gmail version to compose the email and the same thing!  This better just be a glitch that is fixed very VERY soon because this is just not acceptable.",
        "I love the app layout and many functions but the Spam filter is haywire. I synced my Outlook account with this app and it has placed 99% of my Outlook mail in the Spam folder. I like all my mail in one place; And I would like for this to be it. But.... It's not.",
        "Good enough for Google, then its good enough for me! (Quite honestly, its a shame I had a snip in my 20's. And now that I am well am unable to father more children! I had a mind to name a baby GOOGLE!  Sigh.)",
        "There's a problem when people send you other email addresses since I click on them and the app crashes. It goes white. Thanks anyways. Other than that it's perfect",
        "Why can't you make the contents of the trash and spam folders visible so it's not necessary to open those folders to see if there is any mail in them.. Gmail is so good at identifying spam why not filter it out so we don't ever see it??? These things fixed could make it a 5* app.. Still no progress on making the spam and trash folder contents visible."
    ],
    "recentChanges": [
        "• Bug fixes and performance improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.apps.inbox&hl=en&gl=us",
    "appId": "com.google.android.apps.inbox"
}