{
    "title": "Commandr for Google Now",
    "summary": "Add commands to Google Now, no root required!",
    "icon": "//lh4.ggpht.com/umYsKbjpHLOxiz9sXrpuhTlCN0oSd1VXlejrcRGU_6Xx_dHFM_oFu6U8Q9eRxLlbDCM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 29101,
    "developer": "RSenApps Inc.",
    "developerId": "RSenApps+Inc.",
    "developerEmail": "Contact@RSenApps.com",
    "developerWebsite": "http://Commandr.RSenApps.com",
    "developerAddress": "2740 Montlake Blvd E\nSeattle, WA 98112",
    "updated": "May 18, 2015",
    "version": "3.4.1",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Due to MIT overworking me, this application will no longer be supported by me. However, it is open source at https://github.com/RSenApps/Commandr-Android and I am more than willing to assist anyone who has the time to continue working on this.Add commands to Google Now, no root required!Android Authority Top 10 Best App of 2014As Featured on CNET, LifeHacker, SlashGear, Android Police, Android Authority, Android Central, Droid Life, Android Community, Android Pit, and more!\"If you are looking for a way to add a few extra voice commands to Google Now, give Commandr a try!\" - CNET\"... if you're using your phone hands free in the car, it can be a life saver\" - LifeHacker\"With the 3rd-party-developed app Commandr, Google Now gets a boost\" - SlashGear\"... meet Commandr, the new in-between service for flipping hardware switches in Google Now\" - Android PoliceGoogle Now Just Got BetterNow you can use Google Now to control your flashlight, toggle settings, control music playback, and much more!Google Now Just Got PersonalAdd your own custom commands through Tasker to make sure your device fits your lifestyle.Unify Your SmartphoneAccess all the features of your device through Google Now so you don't have to remember what app does what.Setup and ForgetOnce you setup Commandr, it will always be accessible from Google Now and will only run when needed. It won't slow down your phone or your boot.Full Android Wear SupportEither say \"Okay Google\" + the command to your watch or open up the full Android Wear app and tap on a command!OfflineCommands work fully offline! (have to type instead of speak)Command List (so far):- Flashlight On/Off- Wifi On/Off- GPS On/Off (some devices)- Bluetooth On/Off- Wireless Hotspot On/Off- Pause/Resume Music- Previous/Next Song- Read Unread SMS- Read Last SMS From Contact- Play Google Music Playlist- Chatbot (for Siri-like functionality)- Cellular Data On/Off- Read Unread Gmail- Raise/Lower Volume- Silence/Unsilence Ringer- Set Volume to Percentage- Unlock/Lock phone- Take a Picture- Take a Selfie- Shutdown (Root)- Reboot Recovery (Root)- Restart (Root)- Clear Notifications (Root)- Wolfram Alpha- Send Whatsapp message- Enable/Disable Rotation Lock- Enable/Disable Sync- Night mode (Disable wifi, data, and ringer)- Enable/Disable Airplane Mode (Root)- Enable/Disable Car ModeDeveloper: Ryan SenanayakeGraphic Designer: Adriano LoiaconoOpen Source Contributors: Aaron Disibio (firesoul453), Moksh Jawa, flyingtoaster0, Daniel Quah (emansih)Special thanks to Moksh Jawa for his outstanding work not only in his open-source contributions, but also in his relentless marketing of the productSource code: https://github.com/RSenApps/Commandr-AndroidWarning:Do not enable Talkback Accessibility service instead of Commandr. If you do this by accident and notice an orange box around tappable items, please see the Talkback support pages to turn off the service.Tutorials:Tasker (In-App): Use this for launching a single task1. Install Commandr and Tasker - [url]https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm&hl=en[/url]2. Navigate to Tasks and press the add button in the bottom-right3. Configure the command and keep note of the name4. Ensure that Tasker is enabled (icon in top left is colored)5. Go to preferences (top-right) > Misc and check \"Allow External Access\"6. In the Commandr app click Tasker7. Find the command you created and enable it by tapping the switch top-right8. (Optional) edit the phrase that will activate the commandTasker (Plugin): Use this for launching multiple tasks1. Install Commandr and Tasker - [url]https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm&hl=en[/url]2. Under Profiles Click Add3. Event4. Plugin5. Commandr6. Configure the phrase to listen for7. Add tasks to profile",
    "descriptionHTML": "Due to MIT overworking me, this application will no longer be supported by me. However, it is open source at https://github.com/RSenApps/Commandr-Android and I am more than willing to assist anyone who has the time to continue working on this.<br><br><b>Add commands to Google Now, no root required!</b><br><b>Android Authority Top 10 Best App of 2014</b><br><br>As Featured on CNET, LifeHacker, SlashGear, Android Police, Android Authority, Android Central, Droid Life, Android Community, Android Pit, and more!<br><i>&quot;If you are looking for a way to add a few extra voice commands to Google Now, give Commandr a try!&quot;</i> - CNET<br><i>&quot;... if you&apos;re using your phone hands free in the car, it can be a life saver&quot;</i> - LifeHacker<br><i>&quot;With the 3rd-party-developed app Commandr, Google Now gets a boost&quot;</i> - SlashGear<br><i>&quot;... meet Commandr, the new in-between service for flipping hardware switches in Google Now&quot;</i> - Android Police<br><br><b>Google Now Just Got Better</b><br>Now you can use Google Now to control your flashlight, toggle settings, control music playback, and much more!<br><br><b>Google Now Just Got Personal</b><br>Add your own custom commands through Tasker to make sure your device fits your lifestyle.<br><br><b>Unify Your Smartphone</b><br>Access all the features of your device through Google Now so you don&apos;t have to remember what app does what.<br><br><b>Setup and Forget</b><br>Once you setup Commandr, it will always be accessible from Google Now and will only run when needed. It won&apos;t slow down your phone or your boot.<br><br><b>Full Android Wear Support</b><br>Either say &quot;Okay Google&quot; + the command to your watch or open up the full Android Wear app and tap on a command!<br><br><b>Offline</b><br>Commands work fully offline! (have to type instead of speak)<br><br>Command List (so far):<br>- Flashlight On/Off<br>- Wifi On/Off<br>- GPS On/Off (some devices)<br>- Bluetooth On/Off<br>- Wireless Hotspot On/Off<br>- Pause/Resume Music<br>- Previous/Next Song<br>- Read Unread SMS<br>- Read Last SMS From Contact<br>- Play Google Music Playlist<br>- Chatbot (for Siri-like functionality)<br>- Cellular Data On/Off<br>- Read Unread Gmail<br>- Raise/Lower Volume<br>- Silence/Unsilence Ringer<br>- Set Volume to Percentage<br>- Unlock/Lock phone<br>- Take a Picture<br>- Take a Selfie<br>- Shutdown (Root)<br>- Reboot Recovery (Root)<br>- Restart (Root)<br>- Clear Notifications (Root)<br>- Wolfram Alpha<br>- Send Whatsapp message<br>- Enable/Disable Rotation Lock<br>- Enable/Disable Sync<br>- Night mode (Disable wifi, data, and ringer)<br>- Enable/Disable Airplane Mode (Root)<br>- Enable/Disable Car Mode<br><br>Developer: Ryan Senanayake<br>Graphic Designer: Adriano Loiacono<br>Open Source Contributors: Aaron Disibio (firesoul453), Moksh Jawa, flyingtoaster0, Daniel Quah (emansih)<br><br>Special thanks to Moksh Jawa for his outstanding work not only in his open-source contributions, but also in his relentless marketing of the product<br><br>Source code: https://github.com/RSenApps/Commandr-Android<br><br><b>Warning:</b><br>Do not enable Talkback Accessibility service instead of Commandr. If you do this by accident and notice an orange box around tappable items, please see the Talkback support pages to turn off the service.<br><br>Tutorials:<br>Tasker (In-App): Use this for launching a single task<br>1. Install Commandr and Tasker - [url]https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm&amp;hl=en[/url]<br>2. Navigate to Tasks and press the add button in the bottom-right<br>3. Configure the command and keep note of the name<br>4. Ensure that Tasker is enabled (icon in top left is colored)<br>5. Go to preferences (top-right) &gt; Misc and check &quot;Allow External Access&quot;<br>6. In the Commandr app click Tasker<br>7. Find the command you created and enable it by tapping the switch top-right<br>8. (Optional) edit the phrase that will activate the command<br><br>Tasker (Plugin): Use this for launching multiple tasks<br>1. Install Commandr and Tasker - [url]https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm&amp;hl=en[/url]<br>2. Under Profiles Click Add<br>3. Event<br>4. Plugin<br>5. Commandr<br>6. Configure the phrase to listen for<br>7. Add tasks to profile",
    "histogram": {
        "1": 2232,
        "2": 1256,
        "3": 2812,
        "4": 6769,
        "5": 16032
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/I6Ol9tIp4ZQZbdks6RhKkLlWPupLO4ZVsE6RfJNUbzYYpAyKAQeHNyYAl0xbVKeYJ1-k=h310",
        "//lh4.ggpht.com/kDPUohF4sNhsLfRXeY4W_tX2jkvnO7PpSOWf3QToDTsWp9R-NuO1GiWKJ0gpZ32ESzo=h310",
        "//lh3.ggpht.com/Z7KDAJLqkTIsqeH7v37CrQPu11pPuOGxel_lEVAbSYnfdbpEo5qvBzKXWkfNjgozkOI=h310",
        "//lh5.ggpht.com/j6bQafJHHRwzgcPt_Z4EjO8ozdyUjC3ax-cfaevYWnIff3V_9s06PeXjxBgrITCYFHwV=h310",
        "//lh3.ggpht.com/50x_EAsWgQdKhFB2X-hg-VDFOvk7iO8ucEZYc_g6d5yXsOtAoUItcXA8XX0k2RqpPw=h310",
        "//lh3.ggpht.com/kqKnh-dJH7bCWC74IQzcbHRiBS39ysptZRYO_FiOGVH0z-Fq1xuiSQDLmxHebVizJQ=h310",
        "//lh5.ggpht.com/HIVh9de9TMGvQNYTBQudo8pv9dnPOhqVmTNK0LYu5BRmmOvRihadZEIZE6BVDHUiDQ=h310",
        "//lh6.ggpht.com/guRafWOUfvNUBUHZiBh8DyiMs8DehAZU8C4MxB0xjQnxNzwngFOCwrssyKk_Ga99aac=h310",
        "//lh6.ggpht.com/QUhEJymDowM-jxhvj9nF4AvIetH3Url_SRCx6Ois4Qaaz3yb7lNeU4d1-ZCgsEmlRUGD=h310",
        "//lh3.ggpht.com/eS5X4HHtPKC3BX1qvuGdPiaqDa0spvDPnL41GfVMpLwBCtuyJ3Bhxvo8TWI3nKikuK5q=h310",
        "//lh6.ggpht.com/Hb3LhbkijwlCbgsjMstluGFnQ5ZT-8hGSR1idMbSpI4nwrnGTJapgi9Mz62DYeq8Dw=h310",
        "//lh3.ggpht.com/lt6b5OHjYZ7eqkLX3PQ2mJqTsmop6FM9H9zLEYBHykwMZ3_AYvJ7yGP_8xJVIc8dDg=h310"
    ],
    "video": "https://www.youtube.com/embed/DhqP4UCZfYA",
    "comments": [
        "Great... But had to Uninstall due to Battery Use Checked the battery stats and Commandr used 13% of my battery. More than the display. Wonderful app, but don't want to lose that much battery. The app is definitely donation worthy. Can't believe the kid is in high school. I will check up on later versions to see if battery use goes down. To previous reviewer: take a selfie works perfectly on Note 5, even with 3 camera apps installed.",
        "Selfie command not working When giving a take a selfie command,  Google Now opens the camera app but the camera is not automatically in Selfie mode. I had touch the back button only then the Selfie mode is activated and it will snap a photo. But Strangely none of the Selfie photos are available in the gallery app.  I am using an HTC One M7 running Android 5.0.2 in case this an important info. Hope you can help to fix this",
        "It does what I wanted it for. If you say, \"OK Google. Play Sail by AWOL.\" It will goto YouTube and play Sail.  This would be OK I guess if I were at home using wifi. Most of the time when I need to use voice command though, I'm in my car and don't want to use up cellular data. So with this app, I can say, \"Open Amazon Music,\" and with the AutoInput app it will open Amazon Music and start playing a play list of local music. I can't figure out how to make it play a specific song but this is better than nothing.",
        "Awesome This app will make Google now do practically whatever you want to do and you can trigger any of those actions with any words you type in for each command. I love this app, you still go to Google, it's not a separate app. It's a little buggy and a little slow if you don't have a good Internet connection, but 99% of the time, it works like magic. (I had an issue with the chat bot but I think that's something with what I told it to respond to and for a quick fix, I was able to just disable the chat bot.)",
        "Bugs? Ever since I installed this app,a couple of settings started changing by themselves (I.e. vibration on keys) and my phone switches to the home screen without me pressing anything. Other than a couple of the voice commands Google searching instead of activating (I.e read unread gmail) and strange settings changing, it works fine. Will give 5 stars and donate if help is offered. Using galaxy s6 active.",
        "Unfortunately not working for me now. I was only using this app to turn Bluetooth on when I'm driving. However, due to what I imagine was a change on Google's part, Google Now just opens Bluetooth settings, ignoring this app altogether, and I have to manually turn Bluetooth on. If I wanted to look at my phone to do it, I'd just use my Bluetooth shortcut from my Power Toggles App toolbar. Unfortunately, the developer is now in college so probably won't be updating this anytime soon. Too bad cause it was really good for a while there."
    ],
    "recentChanges": [
        "3.4.1:",
        "- Fixed recognition for new Google Search update. Sorry for the delay on this, I've been busy finishing up my last year of high school... I've setup some systems so that if an update breaks it in the future, it should be faster to fix...",
        "- Updated translations"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.RSen.Commandr&hl=en&gl=us",
    "appId": "com.RSen.Commandr"
}