{
    "title": "IFTTT",
    "summary": "Do more with the services you love",
    "icon": "//lh3.googleusercontent.com/nsQmY45E96O3AfktdvY7dG8HcVFj3EjFt-GgeRH9-NuphkwKlwIywTZjJOOCsV_5osU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 110405,
    "developer": "IFTTT",
    "developerId": "8591752306381892167",
    "developerEmail": "support+android@ifttt.com",
    "developerWebsite": "https://ifttt.com",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Applets bring your favorite services together to create new experiences. Over 400 apps work with IFTTT including Twitter, Telegram, Google Drive, Twitch, Weather Underground, Instagram, Gmail, and devices like Google Home, Amazon Alexa, Nest, Philips Hue, and your Android.Turn on Applets and:• Control everything around you with your voice and Amazon Alexa or Google Assistant• Stay informed about what’s happening from publications like The New York Times and ProPublica• Always stay prepared for the weather with custom daily forecast notifications• Message roommates when you’re near the local grocery• Get an alert as soon as there’s a new Craigslist listing that matches you search• Stay safe with automated and intelligent home security alerts• Streamline your social media• Back up and share your Android photos automatically• Back up important files, photos, and contacts to cloud-storage solutions, such as Dropbox or Google Drive• Set your home thermostat to an optimal temperature when you arrive home• Post all your Instagrams as Twitter photos or Pinterest pins• Trigger events based on your current location There are thousands of use cases! New services are added every week. Some popular ones include:Twitch, Telegram, Spotify, YouTube, Google Calendar, Tumblr, Medium, Pocket, Square, eBay, Giphy, Automatic, LIFX, Fitbit, Withings, littleBits, Google WiFi, Evernote, Reddit, Digg, Skype, Slack, LINE, MailChimp, Salesforce, Todoist, and hundreds more. Browse our curated collections to find Applets for:• The home, office, and car• Staying informed on news and politics• Your Android devices• Exploring outer space• Improving how you use social mediaDo more with the services you love. Discover the power of Applets at ifttt.com/discover",
    "descriptionHTML": "Applets bring your favorite services together to create new experiences. <br><br><br>Over 400 apps work with IFTTT including Twitter, Telegram, Google Drive, Twitch, Weather Underground, Instagram, Gmail, and devices like Google Home, Amazon Alexa, Nest, Philips Hue, and your Android.<br><br><br><b>Turn on Applets and:</b><br><br>&#x2022; Control everything around you with your voice and Amazon Alexa or Google Assistant<br>&#x2022; Stay informed about what&#x2019;s happening from publications like The New York Times and ProPublica<br>&#x2022; Always stay prepared for the weather with custom daily forecast notifications<br>&#x2022; Message roommates when you&#x2019;re near the local grocery<br>&#x2022; Get an alert as soon as there&#x2019;s a new Craigslist listing that matches you search<br>&#x2022; Stay safe with automated and intelligent home security alerts<br>&#x2022; Streamline your social media<br>&#x2022; Back up and share your Android photos automatically<br>&#x2022; Back up important files, photos, and contacts to cloud-storage solutions, such as Dropbox or Google Drive<br>&#x2022; Set your home thermostat to an optimal temperature when you arrive home<br>&#x2022; Post all your Instagrams as Twitter photos or Pinterest pins<br>&#x2022; Trigger events based on your current location <br><br><br><br><b>There are thousands of use cases! New services are added every week. Some popular ones include:</b><br><br>Twitch, Telegram, Spotify, YouTube, Google Calendar, Tumblr, Medium, Pocket, Square, eBay, Giphy, Automatic, LIFX, Fitbit, Withings, littleBits, Google WiFi, Evernote, Reddit, Digg, Skype, Slack, LINE, MailChimp, Salesforce, Todoist, and hundreds more. <br><br><br><b>Browse our curated collections to find Applets for:</b><br><br>&#x2022; The home, office, and car<br>&#x2022; Staying informed on news and politics<br>&#x2022; Your Android devices<br>&#x2022; Exploring outer space<br>&#x2022; Improving how you use social media<br><br><br>Do more with the services you love. Discover the power of Applets at ifttt.com/discover",
    "histogram": {
        "1": 5665,
        "2": 4517,
        "3": 9417,
        "4": 27035,
        "5": 63771
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/nHoiI51e8yMe_HjrKVaRb0CqYZcVMK-A0mh2n25NakZjqBGdHCaiyXWQVNhBwiz-oQ=h310",
        "//lh3.googleusercontent.com/TdeUbK6QJyXzCxDTca1ZkSmIf9jRI4HWisN4nL43_I30KvTi-bSTJHagkp0EHtS5kI8=h310",
        "//lh3.googleusercontent.com/9AmMLG-WDXRm0NCCDSJG-UgtxLdl2Cwh3QjWC4LduoOklEYbmhnUqvwOf4Evmvm8rg=h310",
        "//lh3.googleusercontent.com/nPjTu6kbOIZ9778ZP2h8WVr2KmJmvAzeR4yzqER35wKHnrmhXnhZiOg26lJLLec40KRZ=h310",
        "//lh3.googleusercontent.com/c4x3H0X1Xh5bLwQAdqH2ig5jJqqTPoLEsn77h7P85wYB0U0vsIdAespf2SBTz6c4eSIw=h310",
        "//lh3.googleusercontent.com/DNXWGL4fCT3eFSaaszaBYrdn0hFRNQ8Q4J4cpmSOs5DFN5aXrqlqvT0UlubebolWTL9L=h310",
        "//lh3.googleusercontent.com/7B9pErkEplvlqZYXzhg0ouIimt3s-UxlJRx_RW3nEpJGG9NkgE5oowVyI0QnuaKvN4g=h310",
        "//lh3.googleusercontent.com/RpsFhnjBNIEvK3TdQnHYW9wqq-A-L7fudVr_hLUjh_jVeuxdKVklKTwTmZ7z9WlhH9s=h310",
        "//lh3.googleusercontent.com/3P4gYfYH6exz_MVuYp3m7EXLuApeT_zL-PUF5RwARRJTFhmUnja7Z0Z8w6Xp2dQ2MfI=h310",
        "//lh3.googleusercontent.com/8MRVQg259RIeur0ea1u51gAhI9TFFmwAMtp8rK6zhidqgL0b4KvuI75GO372e9R3y9Bv=h310",
        "//lh3.googleusercontent.com/cfm6MxBxQYCeELRaMafJT_lb35HBOvmx08tZV2iC9fqvaqxoitMh6qxE5dEoTsBgEQ=h310",
        "//lh3.googleusercontent.com/DGaoqsXglUIT7lPigPuH2AKlrLyJOppETCYpgU5lxaEIkOccbmcKB_r7MnR46JAVZpN0=h310",
        "//lh3.googleusercontent.com/o-hCm31mxEQycLkC7cz0DDfhFpGjNTCbXEUd3ZX_uobYZpOV2-sO63uZBTexAarPhKs=h310",
        "//lh3.googleusercontent.com/l9aN26TkQHmT6H30UQ69WpMRQqr1dWde9a9D3aXouo8kXXX9B_dxXyvzhmvL98LAMzk=h310",
        "//lh3.googleusercontent.com/fcYi4N_1SCZSI6fMgJTSGG7sR05kTtaVvxOedELRH5q2eoSd_4SZwEac9K6i6BE66_8=h310",
        "//lh3.googleusercontent.com/K4bJM75gRnouxg5jE-dHosFL1muIh_YiD2QpE3-ASG0dxG3PYtbfRokEBJ5CFecaSXU=h310",
        "//lh3.googleusercontent.com/EOJXeat-SqLTROFH41NjJz8i2A4yBoGO9_KWtc5M3MmyJizS_FAvo9j8_xUOa3uXfuk=h310",
        "//lh3.googleusercontent.com/xZtyrQCI4pO21OngbamjzSQjS-PDyu5jE8TyEn_LstASYx4C2RtK8Huk-KD8mzngmhVj=h310",
        "//lh3.googleusercontent.com/8EX0C-h_XRynxZBiLbyOIf_PURVF1rHxGXtD_j_G_PZ_MbSJBMs2V2ocGSx9puI1t5E=h310",
        "//lh3.googleusercontent.com/5g9F4nw_W_PQVCDXc08U2GutpwH6t7sRHmSIZRZfGONhXYvoTCU4lTPyhY76XwYLpJXO=h310",
        "//lh3.googleusercontent.com/QgQV5YMypG0Qd99baOkwxx-TtObv4OVSuGCPRGadphF3Go58sRPCzdXCMtBpO1vUjAw=h310",
        "//lh3.googleusercontent.com/brlUz-n64U9Zx54uMbLAqxfXhGbwPimgf_FwQUkeBHND7lNhqYwlfP-ebmUfGymsb_U9=h310",
        "//lh3.googleusercontent.com/evEl_XcywJxp36whaR_9-e90MR_FVKy2b5nP06nuRwUQC84ejVDoQ156qjzl7jVijWk=h310"
    ],
    "comments": [
        "Needs more complex if then else options without involving other applications. Not everything is as simple as if this do that, as most times I need multiple if's and multiple then's. But I love the idea and start to this application.",
        "Guys...none of the applets I tried would work. I tried making my own and they don't work. Useless and frustrating.",
        "I like the interface and it's easy to setup up but it isn't delivering. I have a few location based 1s setup to turn off my Wi-Fi and my phone volume. They aren't working.",
        "App notifies me that WiFi was turned on or off based on location, but it doesn't turn it on or off. Also, it notifies that a text was sent, but it really doesn't send until I bring up the app itself.",
        "The applets work once or twice then stop working. You have to open the app every day te keep them working. That's pointless to me.",
        "Ifttt signed me up for appzapp. I disabled appzapp but I still get dozens of emails every day. Can't stop them. Very annoying."
    ],
    "recentChanges": [
        "+ Create your own customized, rich notifications! We introduced a new action for the Notifications service that allows you to customize a notification's link, image, title, and message. Before this update, you could only customize the message and every notification always opened the IFTTT app. Try out the new action in your own Applet creations!",
        "+ Now when you search for services, the app will return up to 15 results."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ifttt.ifttt&hl=en&gl=us",
    "appId": "com.ifttt.ifttt"
}