{
    "title": "LevelUp: Order food ahead and never wait in line",
    "summary": "Order ahead at thousands of restaurants for coffee, breakfast, lunch or dinner",
    "icon": "//lh3.googleusercontent.com/gmIijdcFulWG4W8ohFpkwDIVX2_EQnmdFZtxqkskpyeqgLyJMa892L9Lb8oKxcxY-w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.5,
    "reviews": 2844,
    "developer": "LevelUp, Inc.",
    "developerId": "LevelUp,+Inc.",
    "developerEmail": "support@thelevelup.com",
    "developerWebsite": "https://www.thelevelup.com/",
    "updated": "February 2, 2018",
    "version": "3.2.0",
    "genre": "Food & Drink",
    "genreId": "FOOD_AND_DRINK",
    "description": "Use LevelUp to save 15 minutes every day at breakfast, lunch, dinner or your coffee run. Browse your favorite local spots, order ahead and pay easily all within the app.• Open LevelUp to see all the places near you.• Browse through the menu and when you’re ready tap “Place My Order”.• Most orders are ready in 7-15 minutes. We’ll let you know when it's going to be ready and where to grab it in-store.• When you arrive, no need to wait in line! Your food is paid for and ready for you. Just grab your food from the pickup area and enjoy your meal.LevelUp gives you the power to order ahead your coffee, lunch, afternoon snack, breakfast, second breakfast and dinner with a single tap and have it ready when you get there.What type of food do you like? We’ve got all the favorites like pizza, donuts, burritos, sushi and burgers. Looking for a specific type of cuisine? We have everything from Korean to Spanish to Polish. Maybe you’re thirsty? Search for coffee, smoothies or a healthy juice! Whether you’re looking for some late night eats, low-carb ice cream or a good ramen restaurant we’ve got you covered!We’re adding more restaurants daily, so let us know if your favorite restaurant or cafe isn’t available and we’ll get them on board!Keyword: Level Up",
    "descriptionHTML": "Use LevelUp to save 15 minutes every day at breakfast, lunch, dinner or your coffee run. Browse your favorite local spots, order ahead and pay easily all within the app.<br><br>&#x2022; Open LevelUp to see all the places near you.<br>&#x2022; Browse through the menu and when you&#x2019;re ready tap &#x201C;Place My Order&#x201D;.<br>&#x2022; Most orders are ready in 7-15 minutes. We&#x2019;ll let you know when it&apos;s going to be ready and where to grab it in-store.<br>&#x2022; When you arrive, no need to wait in line! Your food is paid for and ready for you. Just grab your food from the pickup area and enjoy your meal.<br><br>LevelUp gives you the power to order ahead your coffee, lunch, afternoon snack, breakfast, second breakfast and dinner with a single tap and have it ready when you get there.<br><br>What type of food do you like? We&#x2019;ve got all the favorites like pizza, donuts, burritos, sushi and burgers. Looking for a specific type of cuisine? We have everything from Korean to Spanish to Polish. Maybe you&#x2019;re thirsty? Search for coffee, smoothies or a healthy juice! Whether you&#x2019;re looking for some late night eats, low-carb ice cream or a good ramen restaurant we&#x2019;ve got you covered!<br><br>We&#x2019;re adding more restaurants daily, so let us know if your favorite restaurant or cafe isn&#x2019;t available and we&#x2019;ll get them on board!<br><br>Keyword: Level Up",
    "histogram": {
        "1": 113,
        "2": 72,
        "3": 143,
        "4": 480,
        "5": 2036
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/jtEvZp3euW1qSq5JjONV41xd5hp92IAA4SK4mzqEf8DM_E0WnEVJI-Kn0JG4iijMjMI=h310",
        "//lh3.googleusercontent.com/h_juv9oV-Uu4dLP0QAXjjBfqrIcXmEY334F5fvKMotxN_gTQLp-XEfRQ6EwXCVNJZEw=h310",
        "//lh3.googleusercontent.com/d780KWr_nS55qH-_nNvEBFEeToXBoznzoVyfRulPjCodg8GTC7FVIIpggT6uQEfoFiA=h310",
        "//lh3.googleusercontent.com/YVeQGp8_ZNnhcle0lFsW50GZA11iOauMBDlHtRj43Ky2HzVBN6IVuxRp7NW-sExCtg=h310",
        "//lh3.googleusercontent.com/Zn1h1Xt5wf2ySSYWo3TLWIHwQtLFn5ecaDuJqfKvv2jY2trM4jHBrgy_Txyt7SG7qQ=h310"
    ],
    "comments": [
        "I used to use this app all the time when it was a few days before payday and hungry. I would be able to charge food to my Sprint account which was amazing! They unfortunately took that ability away so I literally have no reason to use this app anymore.",
        "Very easy to use",
        "1/24/18 Edit - Still a great app but would strongly recommend giving users the ability to cycle through their preferred payment method.  I was only allowed to have one card saved on file.  Minor inconvenience.",
        "If you're looking to use the Sprint billing option, don't sign up. LevelUp has known about this \"issue\" for over a year now without a fix in sight. I'm of the opinion that they disabled Sprint because they were losing money. You're better off just using your credit card.",
        "STILL crashes when I try to open it. NO RESPONSE TO REPORTS. It's been several months now. I GIVE UP!",
        "It works well for what I use it for - the cafeteria and sundry shop at my office."
    ],
    "recentChanges": [
        "Thanks for using LevelUp! We’re constantly updating our app to help you get your food faster.",
        "Our team has been hard at work on this update. We improved the user profile screen, added a tutorial for first-time users and swatted a few pesky bugs.",
        "If you're enjoying using LevelUp, please leave us a rating! We’d love to hear your thoughts."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.scvngr.levelup.app&hl=en&gl=us",
    "appId": "com.scvngr.levelup.app"
}