{
    "title": "UP® – Smart Coach for Health",
    "summary": "Track your health &amp; fitness with UP to get personal tips and beat health goals",
    "icon": "//lh3.ggpht.com/6SQHM4D6p3kPMTWRI-QePdCcLAz8RoGERdARqZyJhCoOFSfwjv41AldpOzjfOZD2MH8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 42376,
    "developer": "Jawbone",
    "developerId": "Jawbone",
    "developerEmail": "support@jawbone.com",
    "developerWebsite": "http://www.jawbone.com/up",
    "updated": "October 2, 2017",
    "version": "4.29.0",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Compatible with UP2™, UP3™, UP4™, phones that have motion tracking, and Android Wear watches.The UP(R) App guides you every step of the way to a healthier you. Get started today by tracking your sleep, activities, and diet. Smart Coach will guide you through better choices as an intelligent guide that gives you personalized tips.A PERSONAL COACH IS STANDING BYSmart Coach is an intelligent guide that learns and grows with you. It goes beyond showing you data and offers tailored advice to help you make better choices, so you can reach your goals faster. HEART RATE THROUGHOUT THE DAYSee how your Resting and Passive Heart Rate (UP3/UP4 needed) change over time and understand what a healthy heart rate means for your health.TRACK WORKOUTSWhether you are training for a big event or just want to get a few more steps in your routine, track your activities and UP will push you to reach your best with streaks, milestone, idle alerts and more.TRACK SLEEP AUTOMATICALLYAutomatically track your sleep (UP2/UP3/UP4 needed) to track sleep stages and get insights on how you can have more energy the next day to be at your best.TRACK FOOD TO MEET DIET GOALSSet goals, log your meals and use an easy to understand food score to get the information you need to improve your diet and reach your ideal weight.NO TRACKER YET? THAT'S OK!Use your phone and compatible hardware to get started with the revolutionary UP App!WORKS WITH UPPersonalize your UP experience with connected apps and hardware you already use to help you reach your goals faster.You can also set Alerts, Smart Alarms that wake you up during the most optimal time , and much more.There is a better version of you out there, get UP and find it!",
    "descriptionHTML": "Compatible with UP2&#x2122;, UP3&#x2122;, UP4&#x2122;, phones that have motion tracking, and Android Wear watches.<br><br>The UP(R) App guides you every step of the way to a healthier you. Get started today by tracking your sleep, activities, and diet. Smart Coach will guide you through better choices as an intelligent guide that gives you personalized tips.<br><br>A PERSONAL COACH IS STANDING BY<br>Smart Coach is an intelligent guide that learns and grows with you. It goes beyond showing you data and offers tailored advice to help you make better choices, so you can reach your goals faster. <br><br>HEART RATE THROUGHOUT THE DAY<br>See how your Resting and Passive Heart Rate (UP3/UP4 needed) change over time and understand what a healthy heart rate means for your health.<br><br>TRACK WORKOUTS<br>Whether you are training for a big event or just want to get a few more steps in your routine, track your activities and UP will push you to reach your best with streaks, milestone, idle alerts and more.<br><br>TRACK SLEEP AUTOMATICALLY<br>Automatically track your sleep (UP2/UP3/UP4 needed) to track sleep stages and get insights on how you can have more energy the next day to be at your best.<br><br>TRACK FOOD TO MEET DIET GOALS<br>Set goals, log your meals and use an easy to understand food score to get the information you need to improve your diet and reach your ideal weight.<br><br>NO TRACKER YET? THAT&apos;S OK!<br>Use your phone and compatible hardware to get started with the revolutionary UP App!<br><br>WORKS WITH UP<br>Personalize your UP experience with connected apps and hardware you already use to help you reach your goals faster.<br><br>You can also set Alerts, Smart Alarms that wake you up during the most optimal time , and much more.<br><br>There is a better version of you out there, get UP and find it!",
    "histogram": {
        "1": 3738,
        "2": 2010,
        "3": 3217,
        "4": 12394,
        "5": 21017
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/OFrqJvPC5J-N6SBb4-mYOUTwdv5iLf0_MA_aF2Jk0MVBIX0GlN9vvtoh8WL5TWFbBlc=h310",
        "//lh3.googleusercontent.com/MCndvjdBdVHudoTsgH9iJPRB_dclCXnkcXzOFDLVJCmk0ViGbt3HwsnusOlL6N38Kg=h310",
        "//lh3.googleusercontent.com/8pnYqddsyQbZKSwto4WEIA3XRcU5hXE2zEdBFML7NQy81fii_n2UbZ3L-irpDqzlzr8=h310",
        "//lh3.googleusercontent.com/83tcIubQGww8Z53QP1UgPV6v9IcC9f-yXAMTyN_coXNv5Cq_BoaRf0mAiKduQL4AC14=h310",
        "//lh3.googleusercontent.com/B7NtBSTVrO8YwxuoVtMYuqVeVXwLHdtwkL8vayDB8_S5DdSy7p7MlPtkewzwIMdZfw=h310",
        "//lh3.googleusercontent.com/uqtCSVMVjl0-YfNedtnj3MYdeutLEPuHey_-k5D7U3fruFbnrevnXAy9Qxm3nkVSwxxa=h310"
    ],
    "video": "https://www.youtube.com/embed/5_6beBXMLzY",
    "comments": [
        "I had to change my positive review of the app I left last year. I am experiencing the same issues one of the reviewers here, I believe Subhankar Ghosh has. The app is paired with the band, it seems to be working, but nothing shows. None of my steps! Can you please explain why this is happening? Is UP not providing support anymore?",
        "Very motivating app and great all-in-one tracker, especially when paired with a wristband tracker (UP3).   Only 4 stars because food tracking can be cumbersome and tech support seems to focus on tracking devices. (While the FAQ is great and thorough, I'm not sure whether contacting support about further issues with the app is appreciated - \"UP App\" is a subcategory of the tracking devices on the contact form, and I got a kinda canned response to a bug report).",
        "I love UP its not a watch, I have one of those.  Its not huge, good for wearing at work. It has a great app with lots of features.  My UP2 strap eventually broke so I've glued it to a latex wristband and it's still working fine.  Not had any sync issues with my android phone for months.  I'll continue to use UP as long as I can.  Thanks guys.",
        "My up app was working just fine on the 25th as with everyone else on here. Yesterday just quit co nting steps and heart rate. Today it only recorded steps till about 11 and not all steps (says i have only done 653 steps wrong) and no heart rate. It's such a pain I have re-sync band twice and uninstalled and reinstalled app a few times and still nothing. Please fix problems!!",
        "I used to love this app. I could drill down on sleep etc and add notes. I use this for medical tracking. I loved it. At some point after an update, I can no longer drill down on anything or add notes. I have an up3 and a Droid Moto z. No support response from UP at all. What little I got was worthless. I followed all online suggestions repeatedly with no positive effect. Now my app, my band and my tracking are of no use to me. Looking at a replacement. I hope you have better luck.",
        "The App is not showing any data since today morning. It's showing as 'syncing data' or 'crunching numbers' as usual, but not the readings. The internet connection is ok. The band is also fully charged and paired with my OnePlus 5 device. Haven't faced this issue since the last 6 months of usage. Can you help?"
    ],
    "recentChanges": [
        "• Bug fixes and performance improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.jawbone.upopen&hl=en&gl=us",
    "appId": "com.jawbone.upopen"
}