{
    "title": "Cards - Mobile Wallet",
    "summary": "Keep your cards in one app!",
    "icon": "//lh3.googleusercontent.com/BWb5qYEoSrptD3R1nBIjvpdwj3B6_q8yOrvRHe_MlNFNaV9YU8y42nJtYmHWhJ7r8g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 5901,
    "developer": "Cards",
    "developerId": "6469737508386097450",
    "developerEmail": "support@cardsapp.com",
    "developerWebsite": "http://www.cardsapp.com",
    "updated": "January 8, 2018",
    "version": "2.17",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Cards is a mobile wallet that keeps your cards in one app.Enjoy a walletless life: Cards is more useful, safer and faster than your wallet. With Cards you can pay, catch a bus, open doors, grab loyalty offers, identify to officials, get into shows etc.NEW! Cards Apps™ turns your digital cards into information hubs allowing you to check out messages, discounts, store locations and much more from your favorite cards!Cards Apps™ allows engaging card specific actions directly from your favorite cards: ordering a pizza from Pizza Card, flight tickets from Airline Card, tracking parcels from Courier Card etc.Cards Quick Card™ lets you instantly open any card without opening the app. You can open cards using our Quick Card™ unlock popup or using the cards shortcuts in the notification bar.NEW! Present Cards directly on your Smartwatch using Android Wear.You can keep:• Loyalty Cards• Payment Cards (Credit/Debit/ATM)• Transport Cards (Bus/Train/Metro)• Identity Cards (Driver's License/Student/ID)• Tickets (Shows/Movies)• Key Cards (Work/Car/Home Entrance)*** Cards acceptance depends on technology availability from the specific card brand, based on your country's regulation.*** Some functions may not properly work in some regions.What can I do with Cards?• Load any card to your phone• Send cards by tapping your phone on card readers (using NFC contactless technology)• Send cards by presenting Barcodes• Cards Apps™ - Perform tasks from within Cards without downloading bloated & unfamiliar apps• Quick Card™ - Instantly access any card • Read important messages from your card brandsHow secure is Cards?• Remotely lock your wallet• Unlock Cards with your fingerprint or PIN code• Sensitive data is double-encrypted in the cloudWhere can I install Cards?• Cards is available for FREE on Google Android, Apple iOS, Microsoft Windows 8/10 & BlackBerry OS.What are \"Community Powered\" and \"Official\" Cards?• \"Community Powered\" Cards are non-official cards based on crowd sourcing, information contributed by Cards users themselves, much like Wikipedia.• \"Official\" Cards are operated by the official organization that issues the card.What about developers?• We ♥ developers. Cards is all about inter-connectivity, crowd sourcing & community support. Go to https://cardsapp.com/dev and connect your app, website or NFC reader using our free and extremely easy to use SDKs (Java, C#, NodeJS, C++, Python) and APIs.You can use Cards as a replacement to the discontinued Beep'n Go app by Mobeam or Samsung Beaming Services.",
    "descriptionHTML": "<b>Cards</b> is a mobile wallet that keeps your cards in one app.<br><br>Enjoy a walletless life: <b>Cards</b> is more useful, safer and faster than your wallet. <br><br>With <b>Cards</b> you can pay, catch a bus, open doors, grab loyalty offers, identify to officials, get into shows etc.<br><br>NEW! <b>Cards Apps&#x2122;</b> turns your digital cards into information hubs allowing you to check out messages, discounts, store locations and much more from your favorite cards!<br><br><b>Cards Apps&#x2122;</b> allows engaging card specific actions directly from your favorite cards: ordering a pizza from Pizza Card, flight tickets from Airline Card, tracking parcels from Courier Card etc.<br><br><b>Cards Quick Card&#x2122;</b> lets you instantly open any card without opening the app. You can open cards using our <b>Quick Card&#x2122;</b> unlock popup or using the cards shortcuts in the notification bar.<br><br>NEW! Present <b>Cards</b> directly on your <b>Smartwatch</b> using <b>Android Wear</b>.<br><br><b>You can keep:</b><br><br>&#x2022; Loyalty Cards<br>&#x2022; Payment Cards (Credit/Debit/ATM)<br>&#x2022; Transport Cards (Bus/Train/Metro)<br>&#x2022; Identity Cards (Driver&apos;s License/Student/ID)<br>&#x2022; Tickets (Shows/Movies)<br>&#x2022; Key Cards (Work/Car/Home Entrance)<br><br>*** Cards acceptance depends on technology availability from the specific card brand, based on your country&apos;s regulation.<br>*** Some functions may not properly work in some regions.<br><br><b>What can I do with Cards?</b><br><br>&#x2022; Load any card to your phone<br>&#x2022; Send cards by tapping your phone on card readers (using NFC contactless technology)<br>&#x2022; Send cards by presenting Barcodes<br>&#x2022; <b>Cards Apps&#x2122;</b> - Perform tasks from within Cards without downloading bloated &amp; unfamiliar apps<br>&#x2022; <b>Quick Card&#x2122;</b> - Instantly access any card <br>&#x2022; Read important messages from your card brands<br><br><br><b>How secure is Cards?</b><br><br>&#x2022; Remotely lock your wallet<br>&#x2022; Unlock Cards with your fingerprint or PIN code<br>&#x2022; Sensitive data is double-encrypted in the cloud<br><br><br><b>Where can I install Cards?</b><br><br>&#x2022; <b>Cards</b> is available for <u>FREE</u> on Google Android, Apple iOS, Microsoft Windows 8/10 &amp; BlackBerry OS.<br><br><br><b>What are &quot;Community Powered&quot; and &quot;Official&quot; Cards?</b><br><br>&#x2022; &quot;Community Powered&quot; Cards are non-official cards based on crowd sourcing, information contributed by Cards users themselves, much like Wikipedia.<br>&#x2022; &quot;Official&quot; Cards are operated by the official organization that issues the card.<br><br><br><b>What about developers?</b><br><br>&#x2022; We &#x2665; developers. Cards is all about inter-connectivity, crowd sourcing &amp; community support. Go to <b>https://cardsapp.com/dev</b> and connect your app, website or NFC reader using our free and extremely easy to use SDKs (Java, C#, NodeJS, C++, Python) and APIs.<br><br><br>You can use Cards as a replacement to the discontinued <b>Beep&apos;n Go</b> app by Mobeam or Samsung Beaming Services.",
    "histogram": {
        "1": 466,
        "2": 172,
        "3": 370,
        "4": 900,
        "5": 3993
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/OCt_rz9YgJAHmgO71MF9xE6dC-CQwQFTL47CXaMm8cFnw8Jjq4P8pL4yrZ4NJ0g7IKo=h310",
        "//lh3.googleusercontent.com/aNJcJ5y5-lSigBRyw1Xmy7AMoeOaSM8OOuvvJKfCNCEYwrEwFkIy_waMo9xCkPNNqPg=h310",
        "//lh3.googleusercontent.com/8D_9Ul7500MiNF5Ql7RFOwe9EH2GQOf10fFDXfoiigqVhRqqkJJ-pGRoihylUdrGwR-o=h310",
        "//lh3.googleusercontent.com/NAenYO7EqMBBNQf1yDo_MPwtL6n27wvDeuXPIjrkFIQmyKxNJD4nhdVtMQYJwuAgZQ=h310",
        "//lh3.googleusercontent.com/vWz9PwUA0dl0Ghw4uyEiyLmJWUeQ3WfgN20rU_knB5EMmZZIwRBjrCbD-rivBpeR6A=h310",
        "//lh3.googleusercontent.com/ua0mM4mUMrKDzOeFxCNzrs1A40nEqP-KMWMx4FDBn7MQPWDMvVunH8IaqnESgkuojIA=h310",
        "//lh3.googleusercontent.com/L2ICUxxLE6xgE9H4m4zWNLRuqShHYOfT_nLHbn9-849l6BUKNVKtNMClNAwWf9n6xQ=h310",
        "//lh3.googleusercontent.com/ev7viBPFl6GDUVemSfM4rA3qP5cTbw250rPPaK2HUzaIA8LKO_-Bo0YjE34UR8AGmKs=h310",
        "//lh3.googleusercontent.com/5fziTGtgocQtnl11H9sIskHPLePtnuuKPuVbLVlSkojd8S_vSve84Ym245mTerJIDw=h310",
        "//lh3.googleusercontent.com/JScuEqVQ0LrLLXIjKFgodXCF7H3Ip2vFtuL0I-5UW7GzfoixV6FimaGgM6wqa8cr-K0=h310"
    ],
    "comments": [
        "Cool idea but very buggy. Couldnt get anything to work. May try it again in a year or so. Tried it again after updates (Jan21) it has improved greatly. I believe they need to post more information about thier encryption on the playstore in order for it to be a success. Today, they say its double encrypted. They need to provide how and what algorithm they use, in order for people to have confidence. Worth trying, but be careful which info you trust them with.",
        "Doesn't scan my student card (the one I want the most to work) but it does scan my debit card. Don't really like the way its laid out (could be a lot better with some development). Not even sure if it works with my phone (Huawei P8 Lite 2017)",
        "I wouldn't trust a random app with my personal details. Personality theft is a real thing. But this app can be used as a loyalty card wallet. it's just okay. There are better ones for that purpose. For example - any app that does not have background process running all the time, doing who knows what... Uninstall.",
        "I actually wanted to use this to clone my door access card so that I don't have to bring it around.  It can't. The phone detects the card but the app just does not show any response.  But I'm surprised that it actually pairs with my transit card, which I suppose to have more security features than my door card. Tried with other generic cards like student card, photocopy cash card, doesn't work.",
        "Not what I expected. 1) Doesn't allow me to manage my loyalty cards. Stocard for example can log into Payback and pull a list of my recent points. This app is just a picture database of my card. 2) Material Design, rings a bell?",
        "Great app to help store cards and no longer carry in wallet. One big problem... I can not find a way to BACK UP cards. This a must have feature2"
    ],
    "recentChanges": [
        "• Standalone mode",
        "• Enhanced security",
        "• Improved NFC for thousands of new cards",
        "• Interface improvements (mostly user requests)",
        "• Performance improvements",
        "• Bug fixes",
        "Feedback is always welcome. Please contact support@cardsapp.com with any issues or suggestions.",
        "Thank you for using Cards."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.cardsapp.android&hl=en&gl=us",
    "appId": "com.cardsapp.android"
}