{
    "title": "minube: travel planner & guide",
    "summary": "The app for discovering incredible places and saving your best travel memories.",
    "icon": "//lh3.googleusercontent.com/Be6XNDq1hsr9b0INutHUMcas4QkaDiHnxR9yPVQvrShYSA6CTW1K2NgUDnKmHSkAyH4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 23453,
    "developer": "minube",
    "developerId": "minube",
    "developerEmail": "android@minube.com",
    "developerWebsite": "http://www.minube.com",
    "developerAddress": "Paseo de Eduardo Dato 21.\nBajo Derecha. 28010.\nMadrid - Madrid (España)",
    "updated": "February 9, 2018",
    "version": "6.0276",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "​★🏆 New! minube enters the apps hall of fame. The Google Team rewards minube with the Editors' Choice Badge in recognition of its quality, excellent design and innovative functionalities.★​​★🏆 2015: minube is named one of Google's 50 Best Apps of the year, for the third year in a row.★​​★🏆 2014: minube is named one of Google's 50 Best Apps of the year, for the second year in a row.★​​★🏆 2013: minube is named one of Google's 50 Best Apps of the year.★​minube is travel planning app & travel organizer that lets you find vacation ideas, save favorite places in lists, and create your own travel itinerary & tourist guide.Minube is an app that lets you discover the best places around the world, all recommended by real travelers. Discover interesting places to visit in your own city or create your own personalized travel guides and save them to use offline during your vacation. The best part is that when your trip is done, the minube app will automatically create beautiful photo galleries of all the places you visited.Here’s how the minube app can help you with your travels:Deciding on where to take your next vacationOn minube, you’ll find over 2 million tourist attractions, restaurants, and hotels around the world, all recommended by our community of over 1.5 million real travelers. Find expert lists by topic like the world’s best scuba diving locations or the cheapest cities to visit in Europe, or use our Inspiration tool to discover destinations using filters like color, distance from home, and more. Planning your tripOnce you’ve decided on where to go, minube will help you unlock the best of the destination. Discover lists created by expert locals with themes like the best tapas restaurants in Barcelona or the most spectacular castles to visit in Germany. Or, read recommendations from real travelers and save your favorite places to see, eat, and stay into your own travel guides which you can then download and use offline during your vacation. During your tripThe minube app can also help you during the trip itself. Use the app to discover restaurants and tourist attractions near your location, see the exact location of places you want to visit, or discover recommendations and lists about the place you’re visiting. Don’t forget that you can create your own travel guides and use them offline wherever you are. When you’ve finished travelingFinally, your trips don’t end when you get home. Minube helps you relive your favorite travel moments again and again! If you have GPS activated on your phone’s camera, the minube app can detect all of the photos from your trip and organize them into beautiful photo galleries complete with maps and travel dates. Not only is it a lovely reminder of your trip, it’s also perfect to share with your friends and family.Want to learn more about minube? Follow us on Facebook → https://www.facebook.com/minubeFollow us on Twitter → https://twitter.com/minubeappWhy do we need these permissions? U+1F64BIdentity: So you can create an account and enter into minube and enjoy a more thorough travel-planning experience. Location: To find tourist attractions, restaurants, and hotels near you and get directions to local points of interest. Internet: To connect to the minube platform and discover thousands of new places and destinations around the world.",
    "descriptionHTML": "&#x200B;<b>&#x2605;&#x1F3C6; New! minube enters the apps hall of fame. The Google Team rewards minube with the Editors&apos; Choice Badge in recognition of its quality, excellent design and innovative functionalities.&#x2605;</b>&#x200B;<br><br>&#x200B;<b>&#x2605;&#x1F3C6; 2015: minube is named one of Google&apos;s 50 Best Apps of the year, for the third year in a row.&#x2605;</b>&#x200B;<br><br>&#x200B;<b>&#x2605;&#x1F3C6; 2014: minube is named one of Google&apos;s 50 Best Apps of the year, for the second year in a row.&#x2605;</b>&#x200B;<br><br>&#x200B;<b>&#x2605;&#x1F3C6; 2013: minube is named one of Google&apos;s 50 Best Apps of the year.&#x2605;</b>&#x200B;<br><br><b>minube</b> is travel planning app &amp; travel organizer that lets you find vacation ideas, save favorite places in lists, and create your own travel itinerary &amp; tourist guide.<br><br>Minube is an app that lets you discover the best places around the world, all recommended by real travelers. Discover interesting places to visit in your own city or create your own personalized travel guides and save them to use offline during your vacation. The best part is that when your trip is done, the minube app will automatically create beautiful photo galleries of all the places you visited.<br><br>Here&#x2019;s how the minube app can help you with your travels:<br><br><b>Deciding on where to take your next vacation</b><br>On minube, you&#x2019;ll find over 2 million tourist attractions, restaurants, and hotels around the world, all recommended by our community of over 1.5 million real travelers. Find expert lists by topic like the world&#x2019;s best scuba diving locations or the cheapest cities to visit in Europe, or use our Inspiration tool to discover destinations using filters like color, distance from home, and more.<br><br> <b>Planning your trip</b><br>Once you&#x2019;ve decided on where to go, minube will help you unlock the best of the destination. Discover lists created by expert locals with themes like the best tapas restaurants in Barcelona or the most spectacular castles to visit in Germany. Or, read recommendations from real travelers and save your favorite places to see, eat, and stay into your own travel guides which you can then download and use offline during your vacation.<br><br> <b>During your trip</b><br>The minube app can also help you during the trip itself. Use the app to discover restaurants and tourist attractions near your location, see the exact location of places you want to visit, or discover recommendations and lists about the place you&#x2019;re visiting. Don&#x2019;t forget that you can create your own travel guides and use them offline wherever you are.<br><br> <b>When you&#x2019;ve finished traveling</b><br>Finally, your trips don&#x2019;t end when you get home. Minube helps you relive your favorite travel moments again and again! If you have GPS activated on your phone&#x2019;s camera, the minube app can detect all of the photos from your trip and organize them into beautiful photo galleries complete with maps and travel dates. Not only is it a lovely reminder of your trip, it&#x2019;s also perfect to share with your friends and family.<br><br>Want to learn more about minube? <br><br><b>Follow us on Facebook &#x2192;</b> https://www.facebook.com/minube<br><b>Follow us on Twitter &#x2192;</b> https://twitter.com/minubeapp<br><br>Why do we need these permissions? U+1F64B<br><br>Identity: So you can create an account and enter into minube and enjoy a more thorough travel-planning experience. <br><br>Location: To find tourist attractions, restaurants, and hotels near you and get directions to local points of interest. <br><br>Internet: To connect to the minube platform and discover thousands of new places and destinations around the world.",
    "histogram": {
        "1": 852,
        "2": 538,
        "3": 2004,
        "4": 7501,
        "5": 12558
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/RZEU39AMrqAcYhjIvZnZVMCM-GOp4blEgtCyg2Wk0SGSRt4i8kv4LBnOP5cUqh_FuM8=h310",
        "//lh3.googleusercontent.com/-PJy0QtBaEsW4uQbPt7IknqGeSfQkZq3XACueDgO_K-ibrD4qL5uc7oUzwHkt0XeQ3w=h310",
        "//lh3.googleusercontent.com/J_M56N6cauiWrhCzC34z24s6mWSgGFQq_A5zpNRr2ZM08QgzzCeEBmehpAd_APCN-A=h310",
        "//lh3.googleusercontent.com/XUjH4L8IAOQ2QqIM05al_2JxECWmoIe6GSn-PR8p-rfyYjDk4ZYxlEBmCCvJSbwBi6M2=h310",
        "//lh3.googleusercontent.com/DQDNyWz2Zx-95zXq_nTa-nl6R-cFprQ2RSXHzQB73Ba-6yyveMW6upzekM69v0KUkc4=h310",
        "//lh3.googleusercontent.com/YXSA1on23JQw89ln_ScWIfjCq4ug8AUBwUBBN1azkkfJ0YMn1Yy-3cmao3nPmwdvs9s=h310",
        "//lh3.googleusercontent.com/c3ZJfzd7AIZtoh59F-HQFSWo3DEJe--IetjWIFba62WPRQpn2uH4nfMobT6kmOCWWFc=h310",
        "//lh3.googleusercontent.com/82EDS_VBjt4zZxEfDEsJd9mF11E92LlKLZ9IwVQR28QRRypjJ6s1K5zqS9UpVVjY3cM=h310",
        "//lh3.googleusercontent.com/qnu0d_Nof1eWaacWdeT36v5cJfsnXob-vPlmdH9afKi3kU_0dXFj8GLiCzszEbpBgCU=h310"
    ],
    "video": "https://www.youtube.com/embed/0vFh-XYycFM",
    "comments": [
        "Muy buena app para viajes y vlogs",
        "Error connecting to server 95% evrrytime i post comments",
        "Annoying push notifications",
        "It would be really useful to add the prices of the activities and the places to visit, so this way every traveller could have a closer idea of how much money we are going to need and spend.",
        "Mais um ruim....",
        "It doesn't work (infinite loading after clicking Begin button)"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.minube.app&hl=en&gl=us",
    "appId": "com.minube.app"
}