{
    "title": "Memory-Map",
    "summary": "GPS Navigation with offline Topo maps and marine charts, with AIS ship tracking",
    "icon": "//lh3.googleusercontent.com/8zFxD_MBm2fpBVeOHSmYoxEELkq616S_acY9vAlzdZiL9eUKejFPTHXI0H6ySMOtYLJ5=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 2548,
    "developer": "Memory-Map, Inc.",
    "developerId": "Memory-Map,+Inc.",
    "developerEmail": "info@memory-map.com",
    "developerWebsite": "http://memory-map.com",
    "developerAddress": "51 Elm St\nTrumansburg, NY 14886\nUSA",
    "updated": "January 12, 2018",
    "version": "Varies with device",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "size": "Varies with device",
    "description": "The Memory-Map app turns your phone or tablet into a full-featured Outdoor GPS or Marine Chart Plotter, and allows you to navigate with USGS Topo maps, NOAA Marine charts, and may other specialist maps, even without a wireless internet signal.Maps are downloaded on-the-fly and can be pre-loaded so that they can be used offline. Once the app and maps are loaded to the phone or tablet, cellular network coverage or internet connection is not required for real time GPS navigation.The Memory-Map app can be used as a standalone GPS navigator, but it can also be used in conjunction with the Windows PC or Mac app (free download) for planning, printing and loading up maps, waypoints and routes to the phone/tablet.Memory-Map includes free access to 1:250,000 scale topographic maps and many other free maps around the world. More detailed maps are available for download and purchase with a free try-before-you-buy, time-limited demo option. Available maps include Ordnance Survey, Hema, USGS quads, NOAA, British Admiralty, and DeLorme. Maps can be used on your PC as well as your phone and tablet. The Cloud Sync feature allows you to keep the overlay data consistent on all your devices.Features include:Access a vast range of Worldwide maps and charts.Automatically downloads a free map of your current locationCreate and edit marks and routes.Import and export marks, routes and tracks in the open GPX formatDisplay; Position, Course, Speed, Heading, Altitude and averagesPosition coordinates include Lat/Long, UTM and GB GridUnits displayed in Statute, Nautical or MetricSupport for GPS and Compass sensors, where available.Placename index, can be used offline.Moving map, lock GPS position and automatically scroll the mapRecords breadcrumb trail / tracklogs.Share position marks or tracklogs as GPX filesProximity AlarmFull marine instrumentation features, with AIS, DSC and Anchor alarmNMEA data interface via WiFi or BluetoothAIS collision alarm, with adjustable thresholds for Class A and Class B targetsDisplay Alarm notifications and Nav data on Android Wear watch\"Verdict: The Memory-Map App is a truly excellent, competent product, representing real value for money. It's straightforward to use, with just enough preference settings and options to describe it as customizable. Route-creation and route-following are ridiculously easy to set up, yet provide a tremendous range of route data. You can also import and export GPX files (via email). A really strong product at this price point.\" Andrew Knight, Yacht Arabella blog\"After buying about 6 navigational applications for my tablet I finally got one that really works the way it should. I now have a handheld version of my sailboat's navigation system. I am very happy with this app and would recommend it to any avid sailor\"\"I've tried all the mapping/tracking applications I can find and I rate this best. The 1:25k scale is essential for walkers and the ability to create a route at home or to log it (recording your time & distance etc) as you go along is superb. I like the direction indicator to show where you are heading on the map, the ability to save, describe and name tracks is neat. It's easy to slide the map about from your current position to see where you are heading next, the zooming in and out facility is good. I found it reasonably easy to learn how to use.\"\"This is not a cheap navigation program, it is a professional tool for viewing raster maps. And for this purpose, it is excellent. For viewing topo maps, this is the best software and hardware combination for the job, this alone was my reason to get an Android tablet, and it was the right decision.\"",
    "descriptionHTML": "The Memory-Map app turns your phone or tablet into a full-featured Outdoor GPS or Marine Chart Plotter, and allows you to navigate with USGS Topo maps, NOAA Marine charts, and may other specialist maps, even without a wireless internet signal.<br><br>Maps are downloaded on-the-fly and can be pre-loaded so that they can be used offline. Once the app and maps are loaded to the phone or tablet, cellular network coverage or internet connection is not required for real time GPS navigation.<br><br>The Memory-Map app can be used as a standalone GPS navigator, but it can also be used in conjunction with the Windows PC or Mac app (free download) for planning, printing and loading up maps, waypoints and routes to the phone/tablet.<br><br>Memory-Map includes free access to 1:250,000 scale topographic maps and many other free maps around the world. More detailed maps are available for download and purchase with a free try-before-you-buy, time-limited demo option. Available maps include Ordnance Survey, Hema, USGS quads, NOAA, British Admiralty, and DeLorme. Maps can be used on your PC as well as your phone and tablet. The Cloud Sync feature allows you to keep the overlay data consistent on all your devices.<br><br>Features include:<br><br>Access a vast range of Worldwide maps and charts.<br>Automatically downloads a free map of your current location<br>Create and edit marks and routes.<br>Import and export marks, routes and tracks in the open GPX format<br>Display; Position, Course, Speed, Heading, Altitude and averages<br>Position coordinates include Lat/Long, UTM and GB Grid<br>Units displayed in Statute, Nautical or Metric<br>Support for GPS and Compass sensors, where available.<br>Placename index, can be used offline.<br>Moving map, lock GPS position and automatically scroll the map<br>Records breadcrumb trail / tracklogs.<br>Share position marks or tracklogs as GPX files<br>Proximity Alarm<br>Full marine instrumentation features, with AIS, DSC and Anchor alarm<br>NMEA data interface via WiFi or Bluetooth<br>AIS collision alarm, with adjustable thresholds for Class A and Class B targets<br>Display Alarm notifications and Nav data on Android Wear watch<br><br>&quot;Verdict: The Memory-Map App is a truly excellent, competent product, representing real value for money. It&apos;s straightforward to use, with just enough preference settings and options to describe it as customizable. Route-creation and route-following are ridiculously easy to set up, yet provide a tremendous range of route data. You can also import and export GPX files (via email). A really strong product at this price point.&quot; Andrew Knight, Yacht Arabella blog<br><br>&quot;After buying about 6 navigational applications for my tablet I finally got one that really works the way it should. I now have a handheld version of my sailboat&apos;s navigation system. I am very happy with this app and would recommend it to any avid sailor&quot;<br><br>&quot;I&apos;ve tried all the mapping/tracking applications I can find and I rate this best. The 1:25k scale is essential for walkers and the ability to create a route at home or to log it (recording your time &amp; distance etc) as you go along is superb. I like the direction indicator to show where you are heading on the map, the ability to save, describe and name tracks is neat. It&apos;s easy to slide the map about from your current position to see where you are heading next, the zooming in and out facility is good. I found it reasonably easy to learn how to use.&quot;<br><br>&quot;This is not a cheap navigation program, it is a professional tool for viewing raster maps. And for this purpose, it is excellent. For viewing topo maps, this is the best software and hardware combination for the job, this alone was my reason to get an Android tablet, and it was the right decision.&quot;",
    "histogram": {
        "1": 340,
        "2": 141,
        "3": 225,
        "4": 681,
        "5": 1161
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/Um1OHEMsxJoMc6GBmpCFh2LZIRpHWNKuv7rl30bHLe6pVn5ArIE2T3B2oD-46M0iXyA=h310",
        "//lh4.ggpht.com/D2ELRwJHVUDXzPGaK9RYO6TkJzeHX1k7tfDpEE_wEjFBmMJsk0p9UmCSVKUcDPHVdgY=h310",
        "//lh3.ggpht.com/8YDzZeseyUTSaG8yBblPSoXq9AgXY5_aJOh5ZV-1I_-6rJc5Zc5r4b5sLekeINwooA=h310",
        "//lh6.ggpht.com/9lKeWGZxU_rDI9QJgmI2kuvGpV11dH3GwykfjmNbgXFOMYHgisz7dJTCICVQaY4FjuC4=h310",
        "//lh6.ggpht.com/RTuDZhns8PqJdzGvdyuEXEp1HYTfe7osk3exg_n8KVdR5nAhnxwIL9oPgRZdfz77Fq6h=h310",
        "//lh5.ggpht.com/bCyc7PoioTG4roMdx3To8ZBGlnXMbcYEleDym6Q-Ouasjkfdwo372Kv--nDrBv9T_jpE=h310",
        "//lh5.ggpht.com/cJCfVXtAk1YkhX-Nt6hewItVFekaAc79KZr2rROdzX-zITkPr_G6XdTuQPtJoizpOA=h310",
        "//lh3.ggpht.com/mDvnEojq7gtEzb5EXLNHDzKdCnrUh__PZnN1uPd2CiAauE16SQims_u3mD5Bf1IUEjWs=h310",
        "//lh6.ggpht.com/ldxBC5BRr3iX2nOOLtKBWrR8ti6huAacWJGFmTk6-cgS8VopHrc83k68opitR5vVH9I=h310",
        "//lh5.ggpht.com/PNCzGacMuF0KGZHcTljjVzpfYrGCLkZ9pJJv9pSk-ctzKUQ7jteaOQ0IrqQVIdNp3VH0=h310"
    ],
    "comments": [
        "I can't use my \"perpetual\" license for OS Landranger maps covering the whole of the UK unless I pay another £15 per device for the software to access them on a mobile device. I only bought the license in 2013 so that doesn't look like value for money to me. Bye bye Memory-map, I'll look elsewhere thank you very much.",
        "I have been using memory map for a couple of years now with hema and topo maps installed. I find it fantastic of off road use in both car and motorbike.   Only reason im not giving it 5 stars is it need a night mode, even with the screen dimmed it is too bright to use in the car at night. Also a line from current location to waypoint shown on the map as the direction to arrow is  a pain to use.",
        "The basic app is good and works very well at locating you on OS maps when walking. Licencing system is a nightmare if you change devices so getting access to maps you have paid for is difficult. The app has difficulty finding maps if you put them on an SD card",
        "Basic functionality good. When switching map scales often fails to pick correct map file on SD card. Recent change to add dynamic menu bar at top of screen makes app harder to use and leads to'jumpy'display.  Much better at recording tracks than previously.",
        "Very useful for tracking cycle rides and kayaking and also geocaching. Yes, OS maps are not cheap but quality and you can buy only what you need. Disappointed that icons on Android are not the same as PC so you can't transfer mark files between them.",
        "Most times it works very well. The distance logging is not very accurate on the pull down view, but the mileage shown on the saved track is, so use this one. If your app is out of date or the android has updated, then the background map will not show fully or at all. If you are in the middle of nowhere (no signal) then it is too late to update the app. This feature causes problems. You need the map area in your phone that you are in or this does not work, unless you like working off the road map. As the whole of GB maps are a large size - GB HD is over 28GB - an SD Disk with exFAT formatting is required and unfortunately there are not many phones that do this. The GPS lock is very useful and immediately lets you know your position. The saved files are good and go straight into your PC program. Overall, very good when it works, a pain when it does not."
    ],
    "recentChanges": [
        "Much faster bulk map downloads",
        "More reliable use of maps on SD card",
        "Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.memorymap.mm2&hl=en&gl=us",
    "appId": "com.memorymap.mm2"
}