{
    "title": "FOBO Tire",
    "summary": "24x7 round the clock monitoring of your car tire pressure and temperature...",
    "icon": "//lh5.ggpht.com/tX9RgxFRUdbIUc7J1knUWKinD6Pdai8zkEgN1qo2DJvi6MRhBoB18ukFLW-I4FYKkw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.1,
    "reviews": 175,
    "developer": "Salutica Allied Solutions Sdn Bhd",
    "developerId": "Salutica+Allied+Solutions+Sdn+Bhd",
    "developerEmail": "fobo@salutica.com.my",
    "developerWebsite": "http://www.my-fobo.com",
    "developerAddress": "No 3, Jalan Zarib 6, Kawasan Perindustrian Zarib, 31500 Lahat, Ipoh, Perak, Malaysia",
    "updated": "February 1, 2018",
    "version": "5.9.5",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "World's First All Bluetooth Smart Tire Pressure Monitoring SystemSave Life, Save Tire, Save Fuel...Key Features:- 24x7 monitoring of your car tire pressure- Flat tire alert even when you are away from the car- 3 level smart alert- Monitors up to 20 cars with one app- Share FOBO Tire with up to 100 users via simple app authorization- DIY install in 5 minutes- Easy tire rotation procedure- Easy tire sensor replacement procedure- Anti-theft features",
    "descriptionHTML": "World&apos;s First All Bluetooth Smart Tire Pressure Monitoring System<br><br>Save Life, Save Tire, Save Fuel...<br><br>Key Features:<br><br>- 24x7 monitoring of your car tire pressure<br>- Flat tire alert even when you are away from the car<br>- 3 level smart alert<br>- Monitors up to 20 cars with one app<br>- Share FOBO Tire with up to 100 users via simple app authorization<br><br>- DIY install in 5 minutes<br>- Easy tire rotation procedure<br>- Easy tire sensor replacement procedure<br>- Anti-theft features",
    "histogram": {
        "1": 17,
        "2": 6,
        "3": 14,
        "4": 43,
        "5": 95
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/yqi2oMjGre2MDSdDazVoICTJn_b6PCNs3GJkMuZs8i_tC9iiXyWocTafZr_qHIhjKFI=h310",
        "//lh6.ggpht.com/5XZD12769vnKMe2VbGbyLDitoPzocRyuo7Prp5bRDc3Xr9ojSn4iZvEHKYIBdJVmTVs=h310",
        "//lh3.ggpht.com/uANVhxSi3P1ahwI5Ra-BJUCHVHGSijwcthhBkchX4a3O-PAq5cNGTo6jvVUBS5PBrPc=h310",
        "//lh6.ggpht.com/sJIofrSuj5i66sATRb9rQM460oiGcrQOE_ySH_oMzAd3AETsqWx5imamntPvUBEuHxM=h310"
    ],
    "video": "https://www.youtube.com/embed/006cYt94N2c",
    "comments": [
        "Fantastic product and app. Worth every penny. I HIGHLY recommend it to anyone interested.",
        "Every time I got problem",
        "Where i can buy the receiver o sensor for the tire.",
        "Been using this for about almost 2 years now and has never failed me. Saved me twice on early detection of puncture by nail and screw. Easy to use but of cause still can improve. Would be great to have a graph to see how the pressure is while driving to get more data. Real time upload to mobile sync would be awesome. But overall it's an excellent device ad a definite need to ensure safety.",
        "Has never worked consistently for me, took my first set back to the shop for a replacement but that's the same as well, box buzzes all the time and won't read pressures even with new batteries. Some little kid stole one of them as well (looked on cctv), you can easily unscrew them by hand even if you tighten them up with the included tool. Overally this product has been a complete waste of money for me, have taken it off the car and will probably bin it, good idea but flawed in execution.",
        "کار نکرد ولی توتبلیغش خوب بود"
    ],
    "recentChanges": [
        "v5.9.5",
        "What’s new:",
        "- Vietnamese translations added.",
        "What's fixed:",
        "- Bluetooth connection fine-tuned.",
        "v5.9.4",
        "What's fixed:",
        "-Fix for below Android 5 version apps crashing.",
        "-UI bug fixed and improvement.",
        "Known issues:",
        "- Android 7 is not compatible with older firmware version of FOBO Tire Plus and FOBO Tire. Please contact fobo@salutica.com.my if you are facing any issues with Android 7."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.fobo.tire&hl=en&gl=us",
    "appId": "com.fobo.tire"
}