{
    "title": "Eat24 Food Delivery & Takeout",
    "summary": "Relax, let the food come to you. Order delivery from local restaurants.",
    "icon": "//lh3.googleusercontent.com/zfOx1nIkat4nYMa_vu7247eYDHE7JLrt72ouvEyU0qFPoYdoWXCEe1ROL981hFFAAA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 37315,
    "developer": "GrubHub",
    "developerId": "GrubHub",
    "developerEmail": "admin@eat24.com",
    "developerWebsite": "http://eat24.com",
    "updated": "February 26, 2018",
    "version": "Varies with device",
    "genre": "Food & Drink",
    "genreId": "FOOD_AND_DRINK",
    "size": "Varies with device",
    "description": "Order food for delivery or pickup from great local restaurants, without putting on pants. Whether you’re reordering favorite dishes or discovering new food, Eat24 is the free and easy way to order from over 40,000 restaurants in 1,500 cities, with more being added every day. With Eat24 you get easy searching and ordering, full menus, real reviews, free coupons, and fantastic customer support, all in one app. Because you should get exactly what you’re craving without having to jump through hoops (or even leave the house).Do you find yourself asking, “How can I order food delivery near me?” “How can I eat 24 samosas without leaving my house?” or “What’s that food delivery app that sounds like 24 eat?” The answer is Eat24 (or Eat 24 if you like extra spaces.) Eat24 is a free and easy way to order food online for delivery and pickup. Whether you’re hungry after a long day, throwing an office party, or need to order chinese food online, just use the Eat24 app. You could call us “Eat24hours,” “24 Eat”, or even “that takeaway delivery delivery with the menu menu”  if you like to speak in doubles. We’ll answer to all of those. Whatever you call us (but don’t really use the phone because we’re online food delivery), our mission is to provide food delivery from restaurants and feed people. Best of all, once you place your eat 24 food delivery or takeout order, we handle every part of the food delivery experience. No more screwed-up orders. No more wondering when they’ll deliver food. Something not right? Hit up our 24/7 Live Support with the app and a real human will help. And if you want to save money on that online food delivery order, just use an Eat24 coupon. Features:- Yelp Reviews are built right into the Eat24 app for food delivery and takeout so you won’t have to change apps. - Use filters to sort each eat 24 food delivery restaurant by distance, newest, top rated, takeaway food delivery from restaurants, and more. Because if you’re going to eat 24 eggrolls, they should be good ones.- Use the What’s Good filter to explore popular food delivery from restaurants near you, get tips and read customer reviews.- Use the Healthy filter to find delivery menu items that even your quinoa-obsessed friend approves of.- Customize it (with extra guac, no onions, etc.) when you order food for delivery online.- Scan your credit card and securely store the info for the next time you order food.- Don't like credit cards? Pay for Eat 24 hour delivery food delivery restaurant with PayPal or Pay with Google.- Search for specific cuisines under 24 eat delivery places. Even particular take out delivery menu dishes: Get pizza delivered to your office, order Chinese food online, have sushi meet you at home, delivery food near me, eat 24 burgers at your graduation, Pad Thai just because, and more.- Order in advance and the Eat24 delivery food service will take care of it.- Like to play favorites? We understand. (Mom liked us best.) The Eat24 (aka Eat24hours if you want to be different) food deliver app lets you save your favorite food delivery restaurants food delivery and orders for easy re-ordering.- 24/7 Live Support. Again, we really support your goal to eat 24 burgers from food delivery near me.- Cash back for future orders through CashCoupon rewards system.- Save money with a weekly Eat24 coupon and special offers when you order online restaurant delivery.Our app doesn’t ask for much, but it does have a few needs:- Camera Permissions: Allow access to your camera and scan your credit card to pay for your Eat 24 food delivery order.- Accounts Permissions (& C2DM): Receive important info about your Eat 24 food delivery delivery places, Eat24 coupon, and exclusive Eat24 deals.- Credentials Permissions: So you can use the Sign-in with Google feature. Need help? Email: support@eat24.comEnjoy,Eat24",
    "descriptionHTML": "Order food for delivery or pickup from great local restaurants, without putting on pants. Whether you&#x2019;re reordering favorite dishes or discovering new food, Eat24 is the free and easy way to order from over 40,000 restaurants in 1,500 cities, with more being added every day. <br><br>With Eat24 you get easy searching and ordering, full menus, real reviews, free coupons, and fantastic customer support, all in one app. Because you should get exactly what you&#x2019;re craving without having to jump through hoops (or even leave the house).<br><br>Do you find yourself asking, &#x201C;How can I order food delivery near me?&#x201D; &#x201C;How can I eat 24 samosas without leaving my house?&#x201D; or &#x201C;What&#x2019;s that food delivery app that sounds like 24 eat?&#x201D; <br><br>The answer is Eat24 (or Eat 24 if you like extra spaces.) Eat24 is a free and easy way to order food online for delivery and pickup. Whether you&#x2019;re hungry after a long day, throwing an office party, or need to order chinese food online, just use the Eat24 app. <br><br>You could call us &#x201C;Eat24hours,&#x201D; &#x201C;24 Eat&#x201D;, or even &#x201C;that takeaway delivery delivery with the menu menu&#x201D;  if you like to speak in doubles. We&#x2019;ll answer to all of those. Whatever you call us (but don&#x2019;t really use the phone because we&#x2019;re online food delivery), our mission is to provide food delivery from restaurants and feed people. <br><br>Best of all, once you place your eat 24 food delivery or takeout order, we handle every part of the food delivery experience. No more screwed-up orders. No more wondering when they&#x2019;ll deliver food. Something not right? Hit up our 24/7 Live Support with the app and a real human will help. And if you want to save money on that online food delivery order, just use an Eat24 coupon. <br><br>Features:<br>- Yelp Reviews are built right into the Eat24 app for food delivery and takeout so you won&#x2019;t have to change apps. <br>- Use filters to sort each eat 24 food delivery restaurant by distance, newest, top rated, takeaway food delivery from restaurants, and more. Because if you&#x2019;re going to eat 24 eggrolls, they should be good ones.<br>- Use the What&#x2019;s Good filter to explore popular food delivery from restaurants near you, get tips and read customer reviews.<br>- Use the Healthy filter to find delivery menu items that even your quinoa-obsessed friend approves of.<br>- Customize it (with extra guac, no onions, etc.) when you order food for delivery online.<br>- Scan your credit card and securely store the info for the next time you order food.<br>- Don&apos;t like credit cards? Pay for Eat 24 hour delivery food delivery restaurant with PayPal or Pay with Google.<br>- Search for specific cuisines under 24 eat delivery places. Even particular take out delivery menu dishes: Get pizza delivered to your office, order Chinese food online, have sushi meet you at home, delivery food near me, eat 24 burgers at your graduation, Pad Thai just because, and more.<br>- Order in advance and the Eat24 delivery food service will take care of it.<br>- Like to play favorites? We understand. (Mom liked us best.) The Eat24 (aka Eat24hours if you want to be different) food deliver app lets you save your favorite food delivery restaurants food delivery and orders for easy re-ordering.<br>- 24/7 Live Support. Again, we really support your goal to eat 24 burgers from food delivery near me.<br>- Cash back for future orders through CashCoupon rewards system.<br>- Save money with a weekly Eat24 coupon and special offers when you order online restaurant delivery.<br><br>Our app doesn&#x2019;t ask for much, but it does have a few needs:<br>- Camera Permissions: Allow access to your camera and scan your credit card to pay for your Eat 24 food delivery order.<br>- Accounts Permissions (&amp; C2DM): Receive important info about your Eat 24 food delivery delivery places, Eat24 coupon, and exclusive Eat24 deals.<br>- Credentials Permissions: So you can use the Sign-in with Google feature. <br><br>Need help? Email: support@eat24.com<br><br>Enjoy,<br>Eat24",
    "histogram": {
        "1": 3234,
        "2": 902,
        "3": 1597,
        "4": 6235,
        "5": 25347
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/rgbkly-9iHzhIIkNfN4H3fYMlbKjh7F6g9gD1g42cjH5rdQt_HfInYn-VArMvbnI2wQ=h310",
        "//lh3.googleusercontent.com/viSHXqBbnTe_W3KiNkdWmCipRn6lJgVk6HxtgMw8QBx7i471v2GTVS7JZNU4ynmLATXW=h310",
        "//lh3.googleusercontent.com/V000JYhAF60iW_mlfixGPfNQ9uGKdomT7jlM7dfWFHFpuRsbFVITOhgyMAyFQOkCzr0=h310",
        "//lh3.googleusercontent.com/IA8T8GBo_T-1UusN0yNYefFt3BPZhzcJVRnZ6IbiqQuLFb5EM5qONbztaVRmpjVkvVeq=h310",
        "//lh3.googleusercontent.com/GdpqqA9AILZNGBhUz4Y0K3iHgIKnddjyl-vDWd3ZyZ0JL6bY6Hq15Jp2Jqq68tkWSRo=h310",
        "//lh3.googleusercontent.com/vhsoiiOpuE3GHbXVX2ncIx_n5R_BMQFPWh5jOqeoh-WG2RomdyX5mi5OLNzt9u_-E2Y=h310",
        "//lh3.googleusercontent.com/sOlL81OiyFQpe44jXcPr9ShB8XehkyfR-FB9188p7UYt2uNspfZmeumcYb0d8poeQFA=h310",
        "//lh3.googleusercontent.com/9Q2lw_lypmI1vUwf_g7WeAsbaUXkuibWz_6yCvb9nIGdTJ3GCuZ4A-c0fo1jd5X0m6k=h310"
    ],
    "comments": [
        "Since \"update\" to GrubHub, I can no longer place orders. App either crashes or shows an error. My old orders are not compatible with the new app, some topping selections are no longer possible.",
        "The rewrite of the interface sucks. More clicks, confusing and my order didn't make it to the restaurant after they said they pushed it three times. Why fix something that wasn't broken?",
        "Wit yelp out and GrubHub in, it's going downhill quick.  No more Google pay when checkout, yet in setup???   Confirmations and updates are not as good as before.  Shame, was my go to app...looking for others now.",
        "The new GrubHub collaboration has eliminated every single Restaurant near my house that I loved and ordered from. WAY TO F**K YOUR APP UP!! LOSERS.",
        "I am revising my review. I love Eat24. I have downloaded other food apps before, including Grubhub, which I actually hate, and always went back to Eat24. I preferred the lay out and it was easy to find good food. Now Eat24 has joined Grubhub and has their stupid ugly layout. It doesn't show ALL the restaurants nearby, even the closed ones, like it used to and I can't even sort restaurants by distance. Y U DO DIS 2 ME???? You guys were so much better before. I miss my old Eat24.   Original: I hate calling to order food. I'm so awkward over the phone. This app is so great, not just because I don't have to call, but when I'm at work, I can order for my lunch break without worrying about making time for a phone call. This app is amazing and has even helped me discover great new restaurants while making it easier for the socially awkward, like myself, to order food. No more Dominos for me!",
        "Worked perfectly until the last update. The restaurants I order from most are listed is closed through the app I have to go to the Eat24 website to place an order and it works just fine there. It worked great before this update"
    ],
    "recentChanges": [
        "Minor bug fixes and improvements. Also... PLOT TWIST: GrubHub is our dad!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.eat24.app&hl=en&gl=us",
    "appId": "com.eat24.app"
}