{
    "title": "Yoyo Wallet",
    "summary": "Download and pay with your phone in 1 minute at participating retailers",
    "icon": "//lh3.googleusercontent.com/grDgq9FgesfcWzm1A-_jaa_qAxMpmy0S2iZIiw3qXq7Ni38OtK6doGfUqhM7D7z_Ew=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4,
    "reviews": 438,
    "developer": "Yoyo Wallet Limited",
    "developerId": "Yoyo+Wallet+Limited",
    "developerEmail": "support@yoyowallet.com",
    "developerWebsite": "http://yoyowallet.com",
    "developerAddress": "Yoyo Wallet Ltd\n2nd Floor\n78 Whitfield Street\nLondon\nW1T 4EZ",
    "updated": "March 4, 2018",
    "version": "6.3.1",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Yoyo Wallet is mobile payment and rewards rolled into one: collect points, stamps and vouchers for every single pound or cent spent. Free, fast, and rewarding - there’s a reason why Yoyo Wallet is Europe’s fastest-growing mobile payment app. Make payment more rewarding and upgrade your wallet today.INSTANT PAYMENT:All you need is your mobile phone - searching for credit cards, counting change and losing cash are now a thing of the past.Scan and Go - simply scan your mobile phone at the checkout for fast, secure payment.Keep track of your spending - no more paper receipts filling out your wallet. Save time, save the environment!GREAT REWARDS:Add value to every transaction - instantly earn loyalty points and use them to claim the things you love at a time that suits you. Never miss out on offers or rewards again - you’ll be notified automatically when a reward is waiting for you.Get more of what you love - whether it’s a free coffee or a discount burrito, we let you choose the rewards. Get ahead with Pre-Buy - benefit from exclusive offers and buy tickets, food and drink in-app. SECURITYPeace of mind - Yoyo Wallet never holds on to your money or your payment details. Pay with ease, pay with confidence.Mix it up - our QR code payment technology is randomised every few seconds to ensure that codes cannot be duplicated for fraudulent use. No code, no entry - Yoyo Wallet users are able to set a passcode. This adds a layer of security to ensure that you are the only one making payments from your account.Any questions? Don’t be shy, contact us at support@yoyowallet.comAlternatively, you can contact us via:facebook.com/yoyowallet/twitter.com/yoyowalletinstagram.com/yoyo_wallet/Want to join our beta?You can sign up at https://play.google.com/apps/testing/com.justyoyo",
    "descriptionHTML": "Yoyo Wallet is mobile payment and rewards rolled into one: collect points, stamps and vouchers for every single pound or cent spent. <br><br>Free, fast, and rewarding - there&#x2019;s a reason why Yoyo Wallet is Europe&#x2019;s fastest-growing mobile payment app. <br><br>Make payment more rewarding and upgrade your wallet today.<br><br>INSTANT PAYMENT:<br>All you need is your mobile phone - searching for credit cards, counting change and losing cash are now a thing of the past.<br>Scan and Go - simply scan your mobile phone at the checkout for fast, secure payment.<br>Keep track of your spending - no more paper receipts filling out your wallet. Save time, save the environment!<br><br>GREAT REWARDS:<br>Add value to every transaction - instantly earn loyalty points and use them to claim the things you love at a time that suits you. <br>Never miss out on offers or rewards again - you&#x2019;ll be notified automatically when a reward is waiting for you.<br>Get more of what you love - whether it&#x2019;s a free coffee or a discount burrito, we let you choose the rewards. <br>Get ahead with Pre-Buy - benefit from exclusive offers and buy tickets, food and drink in-app. <br><br>SECURITY<br>Peace of mind - Yoyo Wallet never holds on to your money or your payment details. Pay with ease, pay with confidence.<br>Mix it up - our QR code payment technology is randomised every few seconds to ensure that codes cannot be duplicated for fraudulent use. <br>No code, no entry - Yoyo Wallet users are able to set a passcode. This adds a layer of security to ensure that you are the only one making payments from your account.<br><br>Any questions? Don&#x2019;t be shy, contact us at support@yoyowallet.com<br><br>Alternatively, you can contact us via:<br>facebook.com/yoyowallet/<br>twitter.com/yoyowallet<br>instagram.com/yoyo_wallet/<br><br>Want to join our beta?<br>You can sign up at https://play.google.com/apps/testing/com.justyoyo",
    "histogram": {
        "1": 50,
        "2": 19,
        "3": 38,
        "4": 89,
        "5": 242
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/w3WvoYpIart2bO_TA9TQ1suuUxzh2j3cgaAZniWB5mOSFziN-tz-z6SrhyozxdW6Xw=h310",
        "//lh3.googleusercontent.com/m6mxg-sufO_l3dlX4KXJSjofyVQivNmZ67MlJnqLexA8wgAaUB2M3DH46GI0q_mKMg8q=h310",
        "//lh3.googleusercontent.com/kMQGWpHjDyEOsEB2RPP5UnR5RDDqOleodpfwJb07C6q80M5LJcETBABS3uXDUWsaIdTa=h310"
    ],
    "comments": [
        "Love having all my loyalty cards in one place. Getting better as more of my favourite restaurants are being added.",
        "Excellent app. No issues discovered so far. Intuitive interface.",
        "Finger print unlock doesn't appear anymore",
        "I keep getting an error when I go to update the app. I use it in college. This is quite irritating",
        "I cannot get this to work.  Get message    java.security cert  certpath validation exception   Trust anchor for certification path not found",
        "Amazing way to pay"
    ],
    "recentChanges": [
        "Check out our new activity feed for a greater insight into your spending and rewards!",
        "As always we've got 🐛 fixes and 🔧",
        "We've got a lot of exciting improvements and features coming your way, so watch this space. Any requests, ideas, feedback? Send your thoughts to support@yoyowallet.com"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.justyoyo&hl=en&gl=us",
    "appId": "com.justyoyo"
}