{
    "title": "IP Cam Remote with Audio",
    "summary": "IP Cam Remote is a mobile &amp; a wearable app for viewing &amp; controlling IP cameras.",
    "icon": "//lh6.ggpht.com/ICnRL1V0Yl7cQ_LYIrJAx3SYmMTC2B9dBy2d9OSI16DTyxjDGx3EIV0pjd4IQTwo43jy=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 1899,
    "developer": "SoratSoft",
    "developerId": "SoratSoft",
    "developerEmail": "soratsoft@gmail.com",
    "developerWebsite": "https://termsfeed.com/privacy-policy/4e86a3624d116a1bc33de00d98e5284c",
    "developerAddress": "PO Box 3025\nWakefield, MA 01880",
    "updated": "August 20, 2015",
    "version": "6.0",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "IP Cam Remote is a mobile and a wearable application which allows you to connect to your IP cameras remotely from anywhere. Two types of IP Cameras are supported, MJPEG (e.g. Foscam FI8910W) and H.264 (e.g. Foscam FI9821W V2). You can use the virtual joystick to pan and tilt the camera. Up to 18 IP cameras can be added to the list in the drop-down list (spinner).Two-way audio is supported (if your IP cameras support it). Press Speaker toggle button to ON to hear the audio. Press it again to turn the audio off. Hold Mic button to activate the microphone. Speak to your Android device to send your voice to IP camera. Release the button to deactivate the microphone.If you hold the Mic button while Speaker button is currently activated, the Speaker will be temporarily deactivated until the Mic button is released. This is to prevent or minimize echoes.Connection Settings dialog, Notification Setting dialog, and Screen dialog can be invoked from Android's Context Menu.Connection Settings dialog contains the required fields which you have to fill in before the application can connect to your IP camera remotely, assuming that IP camera has already been setup successfully in your home (or office) local network. If the Connection Settings dialog is already filled in for the currently selected slot in the drop-down camera list, the information can be removed by clicking the Clear button.Notification Settings dialog allows you to turn the email notification on and off, assuming that your email accounts have already been specified in IP camera's administrative setup. The “Enable Android notification” (MJPEG cameras only) option allows a background service to be activated or deactivated on your Android device. The notification will be created and will appear in the status bar with the alert sound when your IP camera, i.e. the one selected in the main screen, detects movements even when the app is not running.Screen/Control/Speaker Settings dialog allows you to flip the screen and the joystick control vertically and horizontally. This might be necessary in the case where your IP camera is physically mounted upside down. The \"Keep Screen On\" option tells your Android device to leave the screen on without going to sleep after a period of time. The “Keep Speaker On” (MJPEG cameras only) option keeps the speaker on even when this application is put in the background (e.g. when switching to another app, when Home button is pressed, or when the screen is off).Screen brightness and contrast (only on some IP camera models) can be adjusted by tapping anywhere in the camera's display area to bring up the adjustment bars. Under the low light condition, IR On button can be pressed to turn on IR LED lights, to enable the night vision. Pressing IR Off button will turn off IR LED lights.Spread your two fingers apart to zoom in or pinch two fingers together to zoom out. Press and hold the camera screen for a few seconds to reset the zoom level.The user can navigate to \"Real-time IP Camera Monitoring System\" by selecting \"Go to Monitoring System\" from the context menu.Android Wear app for IP Cam Remote has been introduced in version 6. This wearable app is installed automatically when you install or update IP Cam Remote. It allows the user to view and update screen shots of IP cameras right from his or her wrist. To refresh the screenshot, simply tap on the watch’s screen. Scroll up or down to navigate between IP cameras. Perform a long press to bring up camera list view which allows the user to quickly jump to a specific camera. The selected camera on the watch app can be opened on your handheld app by tapping on the “Open on phone” button. For more information, please access the Help page inside the watch app.Version History:============v5.0:H.264 (HD) cameras are now supported!!!It has been tested with Foscam FI9821W V2.For H.264 cameras, the wide screen mode (16:9) can be selected from Screen/Control/Speaker Settings dialog.",
    "descriptionHTML": "IP Cam Remote is a mobile and a wearable application which allows you to connect to your IP cameras remotely from anywhere. Two types of IP Cameras are supported, MJPEG (e.g. Foscam FI8910W) and H.264 (e.g. Foscam FI9821W V2). You can use the virtual joystick to pan and tilt the camera. Up to 18 IP cameras can be added to the list in the drop-down list (spinner).<br><br>Two-way audio is supported (if your IP cameras support it). Press Speaker toggle button to ON to hear the audio. Press it again to turn the audio off. <br><br>Hold Mic button to activate the microphone. Speak to your Android device to send your voice to IP camera. Release the button to deactivate the microphone.<br><br>If you hold the Mic button while Speaker button is currently activated, the Speaker will be temporarily deactivated until the Mic button is released. This is to prevent or minimize echoes.<br><br>Connection Settings dialog, Notification Setting dialog, and Screen dialog can be invoked from Android&apos;s Context Menu.<br><br>Connection Settings dialog contains the required fields which you have to fill in before the application can connect to your IP camera remotely, assuming that IP camera has already been setup successfully in your home (or office) local network. If the Connection Settings dialog is already filled in for the currently selected slot in the drop-down camera list, the information can be removed by clicking the Clear button.<br><br>Notification Settings dialog allows you to turn the email notification on and off, assuming that your email accounts have already been specified in IP camera&apos;s administrative setup. The &#x201C;Enable Android notification&#x201D; (MJPEG cameras only) option allows a background service to be activated or deactivated on your Android device. The notification will be created and will appear in the status bar with the alert sound when your IP camera, i.e. the one selected in the main screen, detects movements even when the app is not running.<br><br>Screen/Control/Speaker Settings dialog allows you to flip the screen and the joystick control vertically and horizontally. This might be necessary in the case where your IP camera is physically mounted upside down. The &quot;Keep Screen On&quot; option tells your Android device to leave the screen on without going to sleep after a period of time. The &#x201C;Keep Speaker On&#x201D; (MJPEG cameras only) option keeps the speaker on even when this application is put in the background (e.g. when switching to another app, when Home button is pressed, or when the screen is off).<br><br>Screen brightness and contrast (only on some IP camera models) can be adjusted by tapping anywhere in the camera&apos;s display area to bring up the adjustment bars. Under the low light condition, IR On button can be pressed to turn on IR LED lights, to enable the night vision. Pressing IR Off button will turn off IR LED lights.<br><br>Spread your two fingers apart to zoom in or pinch two fingers together to zoom out. Press and hold the camera screen for a few seconds to reset the zoom level.<br><br>The user can navigate to &quot;Real-time IP Camera Monitoring System&quot; by selecting &quot;Go to Monitoring System&quot; from the context menu.<br><br>Android Wear app for IP Cam Remote has been introduced in version 6. This wearable app is installed automatically when you install or update IP Cam Remote. It allows the user to view and update screen shots of IP cameras right from his or her wrist. To refresh the screenshot, simply tap on the watch&#x2019;s screen. Scroll up or down to navigate between IP cameras. Perform a long press to bring up camera list view which allows the user to quickly jump to a specific camera. The selected camera on the watch app can be opened on your handheld app by tapping on the &#x201C;Open on phone&#x201D; button. For more information, please access the Help page inside the watch app.<br><br>Version History:<br>============<br>v5.0:<br>H.264 (HD) cameras are now supported!!!<br>It has been tested with Foscam FI9821W V2.<br>For H.264 cameras, the wide screen mode (16:9) can be selected from Screen/Control/Speaker Settings dialog.",
    "histogram": {
        "1": 243,
        "2": 125,
        "3": 168,
        "4": 364,
        "5": 999
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/y5x0NzodFzyMAJWHn7FIClNJID8fKKzVjltETb6mcLckEqrd2tjy2aSYkCFd94LDq3M=h310",
        "//lh3.googleusercontent.com/eAT_5g5_tNLHHDaDKgX2jmiFoFIFj0oKma0MGnynXWMlwksDKd4-Uyv2MCbnArsvqOT-=h310",
        "//lh6.ggpht.com/sZ74EQdF3gCi9jp1l4Di9aa3XhmOrLga8bEIzJn6tl5dgtguhMoO7l2xMB2QdiWQ7Q=h310",
        "//lh5.ggpht.com/pExxT_wwsscUhq84ov2SjJSHDmmVq-nqV5yoqJDX_-3tTBv0O9dqrDlit81fqs9B2h90=h310",
        "//lh3.ggpht.com/NtSY9FaoTEfTcIEoKE4IenRSymxbJhCvPcuH2XtAiMrQWSRF_FZzPYJfCyRxmBdIzMY=h310",
        "//lh3.ggpht.com/o4h-xFYpx5hsPF7xFsWfNz8WLIeYhm2ks9wApzTtZNjgQNX94vTunr3VmlNO1njBAW9a=h310",
        "//lh5.ggpht.com/66bsbX186ogb_Mby5VtcRB9VxxxD_iXH_Ebne4H36vN1IWJrFvMxtLR3XW8ZCHjlNOo=h310",
        "//lh3.ggpht.com/VIcd_xMWRLLWmQmIiZ2AM5b7sl86qMYE9WleqrD1W7X_ptfFXx38rrE2PnjMbMojtZ0g=h310"
    ],
    "comments": [
        "Works, sometimes. I've had this app for years. Every time I switch phones, or my phone updates, there's a new issue with the app. Some get solved, others just annoy me daily. I have to force stop the app daily because it isn't responding or the speaker takes over a minute to come on, if it comes on at all. The app is ok but it requires patience.",
        "No longer working Used this app for over a year and it was working fine until last night. We use it as a baby monitor in our toddler's room and last night mine stopped working. My husband has a different app on his phone and his was working just fine. We quadruple checked my settings and everything was exactly right. Uninstalling and finding something else.",
        "Can't get it to work I eventually worked out that it needs the http port rather than rtsp or onvif, but then all I can get is a still. No ptz functionality. Using a vstarcam c33-x4. If there's something I can do to get this to work, please let me know!",
        "Works well so far I just downloaded the app and was able to connect from the second try. First used my DynDNS URL but was not able to connect. Then I used the ip address and it connects right away.  Will check the URL later and will give 5 stars if it works. Haven't checked the audio yet. So far this was the only app I got that can control the camera movement and settings. I have tried 5 others before: or nothing or the picture only.",
        "Finally found a great one! Foscam had a first party app and they completely broke it.  I looked for alternatives and found dozens of apps with different names that was the same exact app (scam).  Then I found this.  This app is fantastic.  It does everything I want, has unintrusive ads plus a premium option.  THANK YOU.",
        "Works great on my phone but tablet Works perfect on my Samsung S5 but on my Samsung Tab 3 I made a mistake on the ip address it could not find the camera but did find my other camera no problem. I try and change my mistake but no icon for the content menu. I have looked and pushed ever icon I can find but no success. Some help would be greatly appreciated. There is no icon for the context menu you mention."
    ],
    "recentChanges": [
        "v6.0:",
        "Introduce Android Wear app for IP Cam Remote!  This wearable app is installed automatically when you install or update IP Cam Remote. It allows the user to view and update screen shots of IP cameras right from his or her wrist. For more information, please access the Help page inside the watch app.",
        "Note: If there is a problem after the latest update, please try clearing the data from Settings -> Apps -> IP Cam Remote, try restarting your Android device, or try re-installing the app."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ksorat.foscamremote&hl=en&gl=us",
    "appId": "com.ksorat.foscamremote"
}