{
    "title": "Football Referee App - RefLIVE",
    "summary": "Football (soccer) referees can now record all match data directly onto our app!",
    "icon": "//lh3.googleusercontent.com/XrtO0Ge-S1WFGOBPEdt_ilY515GuhgKJCysSwbdZHar-t4TkqVO2Os7UKzHqaCERxpE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4,
    "reviews": 50,
    "developer": "RefLIVE",
    "developerId": "RefLIVE",
    "developerEmail": "support@reflive.com",
    "developerWebsite": "http://reflive.com",
    "developerAddress": "Docklands\nMelbourne\nVIC 3000\nAustralia",
    "updated": "January 15, 2018",
    "version": "1.1.8",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "The Football (soccer) Referee App by RefLIVE is the latest in sports officiating technology. Changing the way football (soccer) referees record match data.----------RefLIVE has designed the world's most advanced smartphone and smartwatch app for football (soccer) Referees. Having been tested at the highest level, including in an official FIFA International Match, RefLIVE’s Football (soccer) Referee App will have you throwing out your notepad and pen in no time.Parents, fans, administrators and the media have also embraced the use of the Football (soccer) Referee App to record match data and track time. With customisable features and ease of use, the Football (soccer) Referee App will save you time when recording match details, allowing you to concentrate on the things that matter.Join the revolution and see why users in over 60 countries choose RefLIVE! For more information visit us at www.reflive.com**Here's your A-Z guide to setting up and using your Football (soccer) Referee App**Pre Match• Select your teams & short team names and player numbers, names are optional but not compulsory• Set your half length• Select your location• Enter the Y (yellow card) & R (red card) codes for offences committed relevant to your association• Select whether or not substitutions are to be recordedDuring Match• Control the time with the larger stopwatch that starts and stops at your discretion with an elapsed timer that runs continuously. The screen will flash red when the timer has been stopped.• Record details of matches by swiping right for the home team events (goals, cards and subs) and left for away team events.• When recording goals you have the option of selecting a penalty when relevant or an own goal which loads through the numbers of the opposition players. Once you have selected the player who scored simply click done to return to the stopwatch screen and the score will automatically update.• For recording yellow or red cards simply select either the yellow or red icon and choose the appropriate reason for the caution. Once a player has received a second yellow card or a red card their number is removed from all match recording lists.• If substitutions are required to be recorded, select the substitution option and simply select the player who is coming off for the player coming on. • The number of substitutions used by each team is shown by the number of dots located next to the elapsed timer on the side of the corresponding team. • To check players that have received yellow and red cards or that have been substituted, simply scroll down from the home screen.Post-Match• Match summary contains all details recorded throughout the game. If the watch is used the details synchronise with the smartphone to provide a chronological list of the match events in clear detail. • Any details that were recorded incorrectly during the game can be edited in the post-match report.• The post-match report can be used to simply update manual paper team sheets or allow for the report to be sent via email.If you have any questions feel free to contact us at support@reflive.com",
    "descriptionHTML": "The Football (soccer) Referee App by RefLIVE is the latest in sports officiating technology. Changing the way football (soccer) referees record match data.<br><br>----------<br><br>RefLIVE has designed the world&apos;s most advanced smartphone and smartwatch app for football (soccer) Referees. Having been tested at the highest level, including in an official FIFA International Match, RefLIVE&#x2019;s Football (soccer) Referee App will have you throwing out your notepad and pen in no time.<br><br>Parents, fans, administrators and the media have also embraced the use of the Football (soccer) Referee App to record match data and track time. <br><br>With customisable features and ease of use, the Football (soccer) Referee App will save you time when recording match details, allowing you to concentrate on the things that matter.<br><br>Join the revolution and see why users in over 60 countries choose RefLIVE! For more information visit us at www.reflive.com<br><br>**Here&apos;s your A-Z guide to setting up and using your Football (soccer) Referee App**<br><br>Pre Match<br><br>&#x2022; Select your teams &amp; short team names and player numbers, names are optional but not compulsory<br><br>&#x2022; Set your half length<br><br>&#x2022; Select your location<br><br>&#x2022; Enter the Y (yellow card) &amp; R (red card) codes for offences committed relevant to your association<br><br>&#x2022; Select whether or not substitutions are to be recorded<br><br>During Match<br><br>&#x2022; Control the time with the larger stopwatch that starts and stops at your discretion with an elapsed timer that runs continuously. The screen will flash red when the timer has been stopped.<br><br>&#x2022; Record details of matches by swiping right for the home team events (goals, cards and subs) and left for away team events.<br><br>&#x2022; When recording goals you have the option of selecting a penalty when relevant or an own goal which loads through the numbers of the opposition players. Once you have selected the player who scored simply click done to return to the stopwatch screen and the score will automatically update.<br><br>&#x2022; For recording yellow or red cards simply select either the yellow or red icon and choose the appropriate reason for the caution. Once a player has received a second yellow card or a red card their number is removed from all match recording lists.<br><br>&#x2022; If substitutions are required to be recorded, select the substitution option and simply select the player who is coming off for the player coming on. <br><br>&#x2022; The number of substitutions used by each team is shown by the number of dots located next to the elapsed timer on the side of the corresponding team. <br><br>&#x2022; To check players that have received yellow and red cards or that have been substituted, simply scroll down from the home screen.<br><br>Post-Match<br><br>&#x2022; Match summary contains all details recorded throughout the game. If the watch is used the details synchronise with the smartphone to provide a chronological list of the match events in clear detail. <br><br>&#x2022; Any details that were recorded incorrectly during the game can be edited in the post-match report.<br><br>&#x2022; The post-match report can be used to simply update manual paper team sheets or allow for the report to be sent via email.<br><br>If you have any questions feel free to contact us at support@reflive.com",
    "histogram": {
        "1": 5,
        "2": 2,
        "3": 6,
        "4": 14,
        "5": 23
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/zT0LCdrJUUzQjHbfO4PQvxItOgmcmtIa2gFQjEC1nyYC8bp7YNsWxpueZhJDUOU4rv4=h310",
        "//lh3.googleusercontent.com/MOdEYDsCVp7hMwfF5FDY2jF5OqrbuvmPlGYN53UyYcmh8LTl6A6t48yFHtdbKYREbmw=h310",
        "//lh3.googleusercontent.com/AIk7Z387wnj_IxfsHj69QsnSLxXBVhBjwdb7ioF1pLL3-TKIA9mioQfrKJeSS9X1SkLF=h310",
        "//lh3.googleusercontent.com/mIB9Mfbu9QQdUhq6qBqpEL0xoI_5A5xPU4MoJ9ngRMaLST2u0uE5etG5hNWXPLh1sw=h310",
        "//lh3.googleusercontent.com/3DkKLV2z2JwrhstgINMtBXlhoTQV7KThrXIvIZqw2ViCOzcEiQsH4QcQkh3oK-MMdZ4=h310",
        "//lh3.googleusercontent.com/e7yjJSt27FTVGoqAD8AhmSiLC-XQKaVcsgVg6LnibCHB1qoJPiP6cWouSMTvCm-ONw=h310",
        "//lh3.googleusercontent.com/kVl2atihfGpoMSlTqlAiMo4_K3GiqlzT40CgcE0rSi5E7AoW8nGLB7Zi_XcFVLeLmA=h310",
        "//lh3.googleusercontent.com/R0ruv1OrE5GzRSoN3yk9vtTYR8v4xa2TSNjc_QxHOF-_Ds1MH1bf8csovPMiUvYJk1g=h310",
        "//lh3.googleusercontent.com/BhzqIwp7ZKyC86tgrMJOdJ4XWFzRqtnGvm_2In131vv8jBSZvP_N9RPQL9y1_sW80_Yp=h310",
        "//lh3.googleusercontent.com/qjYwIdnxcosxqAhS6oWAodrRuEUaRzbXdQjlMR7UN4OGu7RU1pRzIm0g2usCRtakkw=h310",
        "//lh3.googleusercontent.com/5wS-9tQ0e4dXRrab1L6V1cviROYpoL4z5JEgPKfH7DlLdoQgYrpQQimtFWNv71sOrA=h310"
    ],
    "video": "https://www.youtube.com/embed/JOojtSruPFc",
    "comments": [
        "Hello!  This looks like a fantastic app.  I am not able to send a match to my phone.  I touch the \"Send to Phone\" link.  Then I confirms that it will overwrite existing matches on the phone.  Then it gives a message at the bottom that it is moving the match to the phone.  But...nothing shows up on my phone.  I am using a Polar m600, which I believe comes with Android Wear 2.0.  I am able to get other apps to work.  (Nevermind ...I just figured it out)  With Android Wear 2.0, the user needs to manually install the app on the watch in the Google Play app once it's already on your android phone.  Request...I'd still like to be able to add player numbers on the fly on the phone in case a player arrives after kickoff.",
        "Of all the apps I've tried, this is by far the easiest to use for referees. Does everything I need. And the price is right!",
        "Awesome app 😍 Best out there for capturing match data. I even love using it for casual matches with friends!",
        "Hi guys i went to use the app on the weekend and I ran into a problem when I turned off record substitution. I had a message pop up to confirm the teams have the same starting numbers and could not figure out how to fix this",
        "Looks really useful, but a few things could really improve it:  Cancel/End match early (thanks for letting me know how to do this) Add Interchange option for lower level games (i.e. let players subbed off be able to sub back on)  Haven't been able to really test yet don't have watch but looks promising",
        "The first game it worked perfectly. The tournament match it froze multiple times and froze my phone. I am on a Pixel."
    ],
    "recentChanges": [
        "RefLIVE is now completely FREE!!",
        "We think every referee should have access to the best referee app on the Play Store. So this update will make all premium features available for free...no strings attached.",
        "The new update also contains the following:",
        "1. Fixed number of starting players check when subs are turned off. Any number of starting players are allowed as long as both home and away teams have equal starting players."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.reflive.reflive&hl=en&gl=us",
    "appId": "com.reflive.reflive"
}