{
    "title": "Polaris Office - Word, Docs, Sheets, Slide, PDF",
    "summary": "Android&#39;s Best Free Office : Word, Excel, PowerPoint and PDF, TXT + Zip file",
    "icon": "//lh3.googleusercontent.com/G6dkJHNV-Y0o-Jm3Yw3L_PaWiyQCJrIUtIIQI-5ePvjPDbqKcpob3wIK2bX7vC9GH-Ob=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.3,
    "reviews": 531049,
    "developer": "Infraware Inc.",
    "developerId": "Infraware+Inc.",
    "developerEmail": "support@polarisoffice.com",
    "developerWebsite": "https://www.polarisoffice.com",
    "developerAddress": "19F, Daerung Techno Town\n18, 19, Gasan digital 1-ro, Geumcheon-gu\nSeoul, 08594, Korea",
    "updated": "February 6, 2018",
    "version": "7.3.20",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Already 70 Million Users Across The World, Get the Latest Android Office App For Free.Experience New All-in-One Complete Office Suite compatible with MS Word, Excel, PowerPoint and Adobe PDF. \"Editors' Choice\", \"2015 Best App\", and \"Top Developer\"awarded by Google Play. ■ Features ■ • Supported File Formats : DOC, DOCX, XLS, XLSX, PPT, PPTX, PPS, PPSX, TXT, HWP, ODT and PDF.• Free Available for 24 templates, 20 various 2D/3D charts, 37 slide transition effects, 173 different shapes and 300 formulas for spreadsheet.• Supporting 18 global languages including English, French, Arabic, Japanese, Russian, German, Italian, Spanish, etc• Polaris Drive is a default cloud but also available other cloud service such as Google Drive, Dropbox, Box, OneDrive, clouds for 24 hours, 365 days.• Polaris Office has earned ISO 27001 certification for International Cloud Privacy Standard.Compact - Only 50 MB Size. Just one application enough for all different type of documents.• You can open, edit and save all type of office files such as word, excel and powerpoint by one android office app installed.• Experience your first mobile presentation in slide with pen and pointer features. Also, available Google Chromecast for full screen.Compatible - Fully Compatible with Microsoft Office, PDF Reader & Converter.• Open all file formats such as Microsoft Word, Microsoft Excel, Spreadsheet, Microsoft PowerPoint, Slide, and Google Docs.• View PDFs right from your Android phone and save as PDF files from other type of documents.• Without extracting zip files on Android device, you can easily open and read all type of documents.Creative - Improve your skill, enhance your creativity with handwriting input.• Draw and edit your idea with your own hands. Let you write on screen as though you were writing on actual paper.• Directly, take pictures from camera to documents or insert video clips from your Android phone.Connect - Quick and Easy Access for Anytime, Anywhere and Any device.• Across all devices like Desktop, Tablet and Android phone, Keep your all documents always up-to-date in sync via Polaris Drive or other cloud service.• Powerful search function will save your time to expand your search terms not just filename.Collaborate - Writing notes directly with your hands then sharing your idea easily.• Just simply sharing the link of documents with our cloud storage via SMS, email, Facebook and other channels.• Leave your comments right away even PDF files and invite your colleagues to in-app communication to discuss revision before printing it out. [Payment plan and auto-subscription] • Polaris Office is free all-in-one office suite but some features can be limited by your cloud usage or your subscription option. Generally, you can use more features with reasonable price, please check details on polarisoffice.com/pricing• You can upgrade to the Smart Plan ($3.99/month & $39.99/year) or the Pro Plan ($5.99/month & $59.99/year) to take the advantage of even more premium functions. (The price is based on US dollar. The actual price may differ depending on currency of each countries.)• You can remove advertisement by purchasing Remove Ad for $2.99.• Recurring payments and plan subscriptions are automatically processed. Your subscription will automatically renew.• If you would like to stop your subscription, please cancel your subscription any time within 24 hours before the next renewal date. Subscription cancellation is available within the Google Play Store app details page or Google Wallet. (Reference: support.google.com/payments/answer/6220303?hl=en) [Note] • Official Site : Polarisoffice.com• YouTube : youtube.com/user/infrawareinc• Support : [Application] - [Settings] - [Customer Support] or [Official Site] – [Support]• Privacy & Terms : www.polarisoffice.com/privacy",
    "descriptionHTML": "Already 70 Million Users Across The World, Get the Latest Android Office App For Free.<br>Experience New All-in-One Complete Office Suite compatible with MS Word, Excel, PowerPoint and Adobe PDF. &quot;Editors&apos; Choice&quot;, &quot;2015 Best App&quot;, and &quot;Top Developer&quot;awarded by Google Play.<br><br><b> &#x25A0; Features &#x25A0; </b><br>&#x2022; Supported File Formats : DOC, DOCX, XLS, XLSX, PPT, PPTX, PPS, PPSX, TXT, HWP, ODT and PDF.<br>&#x2022; Free Available for 24 templates, 20 various 2D/3D charts, 37 slide transition effects, 173 different shapes and 300 formulas for spreadsheet.<br>&#x2022; Supporting 18 global languages including English, French, Arabic, Japanese, Russian, German, Italian, Spanish, etc<br>&#x2022; Polaris Drive is a default cloud but also available other cloud service such as Google Drive, Dropbox, Box, OneDrive, clouds for 24 hours, 365 days.<br>&#x2022; Polaris Office has earned ISO 27001 certification for International Cloud Privacy Standard.<br><br><b>Compact</b> - Only 50 MB Size. Just one application enough for all different type of documents.<br>&#x2022; You can open, edit and save all type of office files such as word, excel and powerpoint by one android office app installed.<br>&#x2022; Experience your first mobile presentation in slide with pen and pointer features. Also, available Google Chromecast for full screen.<br><br><b>Compatible</b> - Fully Compatible with Microsoft Office, PDF Reader &amp; Converter.<br>&#x2022; Open all file formats such as Microsoft Word, Microsoft Excel, Spreadsheet, Microsoft PowerPoint, Slide, and Google Docs.<br>&#x2022; View PDFs right from your Android phone and save as PDF files from other type of documents.<br>&#x2022; Without extracting zip files on Android device, you can easily open and read all type of documents.<br><br><b>Creative</b> - Improve your skill, enhance your creativity with handwriting input.<br>&#x2022; Draw and edit your idea with your own hands. Let you write on screen as though you were writing on actual paper.<br>&#x2022; Directly, take pictures from camera to documents or insert video clips from your Android phone.<br><br><b>Connect</b> - Quick and Easy Access for Anytime, Anywhere and Any device.<br>&#x2022; Across all devices like Desktop, Tablet and Android phone, Keep your all documents always up-to-date in sync via Polaris Drive or other cloud service.<br>&#x2022; Powerful search function will save your time to expand your search terms not just filename.<br><br><b>Collaborate</b> - Writing notes directly with your hands then sharing your idea easily.<br>&#x2022; Just simply sharing the link of documents with our cloud storage via SMS, email, Facebook and other channels.<br>&#x2022; Leave your comments right away even PDF files and invite your colleagues to in-app communication to discuss revision before printing it out.<br><br><b> [Payment plan and auto-subscription] </b><br>&#x2022; Polaris Office is free all-in-one office suite but some features can be limited by your cloud usage or your subscription option. Generally, you can use more features with reasonable price, please check details on polarisoffice.com/pricing<br>&#x2022; You can upgrade to the Smart Plan ($3.99/month &amp; $39.99/year) or the Pro Plan ($5.99/month &amp; $59.99/year) to take the advantage of even more premium functions. (The price is based on US dollar. The actual price may differ depending on currency of each countries.)<br>&#x2022; You can remove advertisement by purchasing Remove Ad for $2.99.<br>&#x2022; Recurring payments and plan subscriptions are automatically processed. Your subscription will automatically renew.<br>&#x2022; If you would like to stop your subscription, please cancel your subscription any time within 24 hours before the next renewal date. Subscription cancellation is available within the Google Play Store app details page or Google Wallet. (Reference: support.google.com/payments/answer/6220303?hl=en)<br><br><b> [Note] </b><br>&#x2022; Official Site : Polarisoffice.com<br>&#x2022; YouTube : youtube.com/user/infrawareinc<br>&#x2022; Support : [Application] - [Settings] - [Customer Support] or [Official Site] &#x2013; [Support]<br>&#x2022; Privacy &amp; Terms : www.polarisoffice.com/privacy",
    "histogram": {
        "1": 30948,
        "2": 15987,
        "3": 42138,
        "4": 116654,
        "5": 325322
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/uwG049QaMAWpBeWZkZL9AcjX4Qn60tLifJK4Q1KHr5OMhu5x2ou1cgEEaEiVS_5MRkQ=h310",
        "//lh3.googleusercontent.com/GozAIP9pPSMfr5mxEKcshwTnGH4eoWQb5XpZ95UHVJe25rrIl8c4gWYYcgZrQI8THqA=h310",
        "//lh3.googleusercontent.com/KjAcqNNKtzIl_KemXU-E7brmZ7ij1zR3Hhf4vw8aWNPl-OsYj_QUvl3kAPxoIPs64Q=h310",
        "//lh3.googleusercontent.com/k2YljIwZd_fqdRdAlUczID0Bl5HimpO7T4k2lnAKUatK5-rPJk1qjBoLawt6-16yqvE=h310",
        "//lh3.googleusercontent.com/HXMIKjXphq1JA1jYmA_mW8LDJLBwcAkzcLHFLKqm16yRgutpqUfLaNzUXwNekBKI5Rk=h310",
        "//lh3.googleusercontent.com/1fp_otePKSo29RURGcIjU5_tK1vRU1XcXAOJRxQonGoP43SypPaYeqIm2TdHuSvh9vFx=h310",
        "//lh3.googleusercontent.com/-4lRWJD_XFwsCPlPHe7x_rii54Whi0JT5aAKQMJs1U6VrV9rJi-X2lnXRK-xu8cf1TFo=h310",
        "//lh3.googleusercontent.com/uwJbPmmF5iJk2vyIymMEiFmYAwjKfRUCH4qlxpsrULChhpmmY8WTw8B0cyfaEjrS5Q=h310",
        "//lh3.googleusercontent.com/8h_zzbUpo1wdkKWVld-pSkYpvp-u5vHUl_7PZCrAq2luMsqKwfu76rsSxQB-s9WZPRA=h310",
        "//lh3.googleusercontent.com/tTdL2kzVIDzZBu4ezgBSNzNrhKheogqr0h65RWZ0tLB-N3C30-1QWbS5KtLpzrWPSJc=h310",
        "//lh3.googleusercontent.com/qUowhTgGT09YZagezdvRFnSU2Ax_50c8nCdoOtx9Dte64AXi1F4o_YgzjOrWgp6D9tc=h310",
        "//lh3.googleusercontent.com/e8LJU6TMVj_vsWDEyiUhS-yJcLl7R59lilwQ7U_jBrEzDv1cLMpSmORaylq-s1leag=h310",
        "//lh3.googleusercontent.com/t5EVVKtO1OL6jg3oAsQSje6mwU0Ak5De0nSuNTZwBFVuZxIItwImCgAz5IjxnWnrPMpj=h310",
        "//lh3.googleusercontent.com/LjdIO0BpoK_msoeoj4zCEQNyuIhJXd2RyjeFkhZ0QHdP_3a2LvZ1FpLbSoZXE39FwiU=h310",
        "//lh3.googleusercontent.com/xrUFHmX_9FynANd-VsCmmwIIVRiq-UU4tD9bBECueqfXhlsWUghvxFP_7PuwNl9mPmQ=h310",
        "//lh3.googleusercontent.com/cyI5gdgbsLnPJ_Dp8eCIro0OHvy_44L9Sr1nOtKTVYVtlA34Z62XncKHLVfJ_b3vswg=h310",
        "//lh3.googleusercontent.com/dmH2TSGXk3u7yQXiAPvevoPKAxhq5AaldzNZiBN7-ZFZt4Rb04yLiJ9UpgPUoqAlsYXv=h310",
        "//lh3.googleusercontent.com/EmMCDIsN91eGLTYPADFti-RApHcrXLrcyM_BzZEem5qpbhutg8BB9dYPWVBjN82lqQ=h310",
        "//lh3.googleusercontent.com/YYGFGauhyrlRq0m9VSksxynqyIOySen5ctu76AAn9c2w-J__CgCrK-QvYESriWak_yw=h310",
        "//lh3.googleusercontent.com/rzqG5ev2NFMCUWUwKvcRlnxfVWl-E7UzzXUB_DMiWgJlkG9_YoJpOrcmWu5CRueU2js=h310",
        "//lh3.googleusercontent.com/GeBUm5h5Bljml7NlRdymcOJOTcMR6YwdagwWVgSfWuJY1O5iy3C8VR7OXZFZ6JiJh0bo=h310",
        "//lh3.googleusercontent.com/Brbn-qUQsCas-4WZ-sd6Gy82wBNtyAVsiLRcTFj5ZFXxyJy6UD4sFo3J5cqfdQu5AUA=h310",
        "//lh3.googleusercontent.com/8DqljTqanaZMlbaHEo7gWrvs-fmK4ng36ui9E42zxPraPwVib65ojhAdLeDqgz3okyw=h310",
        "//lh3.googleusercontent.com/Fct5E-T2z4NyZ7bIdQh0cPUN4iTYhqUkAD-gAh_8sTGM3D_aI50fgO1dyIvj2OmmDpE=h310",
        "//lh3.googleusercontent.com/jw1SwrCtmaSxprg2M8DECVcGjcarwbnkM8c_4kPUlweP6c9J9ju4nLE8NnyaAFqXavc=h310",
        "//lh3.googleusercontent.com/9yayGtJKkcJfbC1uFi0nZMMrGdK-cqoZa0ajW0sHrT9I_He5UJWSD_qsYbx3NtgBcg=h310",
        "//lh3.googleusercontent.com/I9-CRpLsrgWnq1Q9AmzuV-a5LY9kcZo_7tLLpZ6gx-vAOxJmd2i9pgzUHhfR1LE6zw=h310",
        "//lh3.googleusercontent.com/E9bjOhG2EOHXFey231aJVo2iju35b91Tpgu24sPUw7j91Ny7HI_3KOmB7n0b22_ATg=h310",
        "//lh3.googleusercontent.com/N48XZUIIHl8ZP8kk0h2onjjINaEIqGFEIUTm1DULKasmjwxoPVb3_xMIwpLa0LqIOVo=h310"
    ],
    "video": "https://www.youtube.com/embed/6pbZhZQIHeA",
    "comments": [
        "What a mesh.. too buggy.. I can't even select the line to edit it.. curser is out of control.. every time i press spacebar it just automatically types any tendon word from the current document.. and the feature of Gboard gliding on spacebar to move curser is out.. and this causes the used frustration, anger during very first page of document to be made. Why it's in the list of editors choice.. moto g5 is my device.",
        "Nice app. Although it has ads, It's ok since the app doesn't charge and the ads aren't too numerous . Also little salty cause Word was not letting me sign in for some reason so i uninstalled and then got this app, so I may not be the most unbiased source. Regardless, works well so far.",
        "Nice app but too buggy. Most of the time I want to save file which is on my cloud, the app telling me that there is no network connection and not saving my work and it's very frustrating. Uninstalling until devs fix it.",
        "What nonsense. I'm neither signing in nor giving you control over everything. Your competitors don't  require sign ins and they emulate Microsoft Office. Where is your Spell Check --first absolute requirement missing on slides. Delete my info, couldn't care less. Check out OfficeSuite. That should be you're primary concern.",
        "Having issue when saving my work in excel. It wants to create a new file with a new name. And also face data loss after reopening my old xls file. Please solve this issue.",
        "The ads make this app unusable.  Sometimes closing out of an ad will minimize the entire app.  Opening the app again starts the ad over.  Essentially it gets stuck in an inescapable loop of ads."
    ],
    "recentChanges": [
        "- Able to use \"Lock apps\" function for free. Use this function through password and fingerprint.",
        "- Fixed Memo edit mode in order to edit the memo more conveniently.",
        "- Fixed the error that some copies are created when opening a document.",
        "- Fixed the error that the app is stopped when opening a particular sheet document.",
        "- Fixed other errors that we found from customer reviews and inquiries."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.infraware.office.link&hl=en&gl=us",
    "appId": "com.infraware.office.link"
}