{
    "title": "B&H Photo Video Pro Audio",
    "summary": "Selling digital cameras, video equipment, computers &amp; electronics since 1973.",
    "icon": "//lh3.googleusercontent.com/mA_GdX3i4DzNXYlEPwStogWLrOxjHfsa0PQ2TDQRYc6O3VLnLke6GRsOW9_-OQP6=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 16453,
    "developer": "B&H Photo Video",
    "developerId": "6839195617288585708",
    "developerEmail": "androidappsupport@bhphotovideo.com",
    "developerWebsite": "http://www.BandH.com",
    "developerAddress": "440 9th Ave\nNew York NY 10001",
    "updated": "February 14, 2018",
    "version": "5.0.9",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": " Welcome to B&H! The  B&H Photo Video  Android App allows users to shop our vast product catalog on the go, in the most convenient, befitting way. View products with high-resolution photos, read professional reviews, get educated on features and specifications, all with an easily accessible, intuitive interface. Our mobile app makes it virtually effortless to browse and search for products, check product availability, and share products with friends and family. As you experience the “on-the-go” B&H experience, remember that B&H’s goal is to provide you with a state-of-art environment in which to shop, browse, and learn about the products you love, regardless of whether you shop on our Website, in our SuperStore, or on our mobile app.  Some of our app’s features:  •  Order securely and safely on the fly.• Check out using your favorite method: Android Pay, PayPal or B&H Secure Checkout.• Go back in time and check an old purchase, with our newly-designed Order History feature.•  Read professional product reviews, with detailed descriptions, specs, videos and high-resolution product images.•  Add products to your wishlist, share wish lists, and create wish lists, all on the go.• Share a product with a friend on Facebook, Twitter, Google Plus, email, and even SMS. All in all, the B&H Android App brings new resources to working professionals in the field, and to those preferring mobility. B&H Photo Video appreciates each and every customer, and looks forward to supplying you with the hottest, latest gear and accessories. Our Android app is an extension of our website and SuperStore, and includes reliable speedy shipping, competitive pricing, and excellent customer service, all of which you’ve grown accustomed to as a customer of B&H Photo Video. A Note on Requested Permissions •  Writing to external storage:  This allows us to save product manuals for offline reference. We also give you the option to move the app to your SD card, if you choose to do so. •  Camera:  This allows you to scan barcodes from the search bar, to find products quickly and accurately. You can also use it to scan your card when checking out. •  Identity:  This lets you use a Google account to check out quickly. •  Location:  To better improve your shopping experience. Stay tuned for new location-based features! •  Phone Calls:  To enable our Customer Service calling feature. Check it out on the bottom of a detail page. ",
    "descriptionHTML": "<b> Welcome to B&amp;H! </b><br><br>The <b> B&amp;H Photo Video </b> Android App allows users to shop our vast product catalog on the go, in the most convenient, befitting way. View products with high-resolution photos, read professional reviews, get educated on features and specifications, all with an easily accessible, intuitive interface. Our mobile app makes it virtually effortless to browse and search for products, check product availability, and share products with friends and family. As you experience the &#x201C;on-the-go&#x201D; B&amp;H experience, remember that B&amp;H&#x2019;s goal is to provide you with a state-of-art environment in which to shop, browse, and learn about the products you love, regardless of whether you shop on our Website, in our SuperStore, or on our mobile app.<br> <br><b> Some of our app&#x2019;s features: </b><br> <br>&#x2022;  Order securely and safely on the fly.<br>&#x2022; Check out using your favorite method: Android Pay, PayPal or B&amp;H Secure Checkout.<br>&#x2022; Go back in time and check an old purchase, with our newly-designed Order History feature.<br>&#x2022;  Read professional product reviews, with detailed descriptions, specs, videos and high-resolution product images.<br>&#x2022;  Add products to your wishlist, share wish lists, and create wish lists, all on the go.<br>&#x2022; Share a product with a friend on Facebook, Twitter, Google Plus, email, and even SMS.<br><br> <br>All in all, the B&amp;H Android App brings new resources to working professionals in the field, and to those preferring mobility. B&amp;H Photo Video appreciates each and every customer, and looks forward to supplying you with the hottest, latest gear and accessories. Our Android app is an extension of our website and SuperStore, and includes reliable speedy shipping, competitive pricing, and excellent customer service, all of which you&#x2019;ve grown accustomed to as a customer of B&amp;H Photo Video.<br><br><br><b> A Note on Requested Permissions </b><br><br>&#x2022;  Writing to external storage: <i> This allows us to save product manuals for offline reference. We also give you the option to move the app to your SD card, if you choose to do so. </i><br><br>&#x2022;  Camera: <i> This allows you to scan barcodes from the search bar, to find products quickly and accurately. You can also use it to scan your card when checking out. </i><br><br>&#x2022;  Identity: <i> This lets you use a Google account to check out quickly. </i><br><br>&#x2022;  Location: <i> To better improve your shopping experience. Stay tuned for new location-based features! </i><br><br>&#x2022;  Phone Calls: <i> To enable our Customer Service calling feature. Check it out on the bottom of a detail page. </i>",
    "histogram": {
        "1": 615,
        "2": 285,
        "3": 738,
        "4": 2739,
        "5": 12076
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/1Ohj_gi3JKq1-R_rCX1gR_n6wQb-z3KysCvlVCAgPaASqxEuiGZdtoJ3SWReeQ6kwg=h310",
        "//lh5.ggpht.com/F6LhxVUf2QPNU5o4Mn-ZDRo-LUxCdv-2aGTnhX1Vr7yEPKxfLEw-3yaQeVUd77wQPR5f=h310",
        "//lh3.ggpht.com/AwN9IPQnBR23tHJCOcNHZ14jlWXub-ZX1K3ALwxnHY_HqWjNGz8i8gRff7MuNQnU_w=h310",
        "//lh3.googleusercontent.com/1gcKFm6yx-kX6WowhDlv5VUKJJ61e5S25no15_TooAwZMPcDCxyTMGGr8EEAH1j7ZnQ=h310",
        "//lh3.googleusercontent.com/zwxmUGB3IRrSIYijuobQnuqJUbRfooX2yJ07tCOZX0gZ9YDu4EW48pTsSFf2ZMAg2d4=h310",
        "//lh3.googleusercontent.com/5DCJ5m19XLKg-YV6GAzHNltBBjeXZ1wlcXzwQwFfHXbn2ccMsTFhjVmYsIb_RDuN-FY=h310",
        "//lh4.ggpht.com/liD-528dpfIyOSyTp1z89tU71_dIIUTaQCoI5CKHfL4UiEiAGktn6HAJyaomEQo9pXE=h310",
        "//lh5.ggpht.com/UX4uL41t2aLNIg86x3juonSdtWCPuitW2ikHRHnhWnfo4BEFFDAlPvtrdRWGo-FeveIu=h310",
        "//lh3.googleusercontent.com/PGasj8BIVdQn4LwYnbYlh-7dBUYmIa0C3r21S1nqpQts_ipVnfUkMI5KEKkL2t9rnO4h=h310",
        "//lh3.googleusercontent.com/qdEbncxtlC33KS8SCJ6NSVDmShixMPZ46cWC_sp6nviUDeNF-oO9xS6nHJfIJ3vALZg=h310",
        "//lh3.googleusercontent.com/dQcF15nFfnqN1aDHq88tAok3Bc6QWwe7QB3bBCx8bbzJ_okvYbkCod_MhUQXJPzGiik=h310",
        "//lh5.ggpht.com/xzcMGR_8KRNUyubOuofgtHfTqpNy3-_V6UlNqbpS5TCo_ANojmzAeBGmQT13yM9uQBEP=h310",
        "//lh3.ggpht.com/2vvtXkQMXJa7jjjL33HJKbMc_L1_h567KLkNkkJGspvTcOQ9r-BwaYtNbNiQvCufQphR=h310",
        "//lh6.ggpht.com/TJVYZGGyWr_zcBvHVULLq4L_mf3N7O4TUgcqlsxhDCP-QOlBPpZXohvX3wv-rOX1rtPh=h310",
        "//lh3.googleusercontent.com/FW2-2N4071n7uhIDMyxCoXzCy3dXBBRJS9LJhtQ9IkkS3xvo0y81lnBw17JCcF_Cdg=h310",
        "//lh3.googleusercontent.com/ZMz6eVz0jf-RFdjWmPgsJiLBnN-gIHnof45K71CaAZcnqJ7YRM5iTT0IBSwS4Gpsr0w=h310",
        "//lh3.googleusercontent.com/eyZWDfYK6MsZ38cO6f2bsjud998m6-7m8F2Ckew_DP6iGEHWrVDmmmXMruk2dj2sMV7C=h310",
        "//lh3.googleusercontent.com/gneK1BnxLpmj_toM3G1_WXpMfN6hUVHIqDUNOHFnR3zDI2jdvKfNPHAllR2YyMyskGk=h310",
        "//lh3.googleusercontent.com/Td-aKSvG9Th7Br5cbI5ePaxdtQ9sYpov26qFqh2idmYANy9x_BOIIKeQ-rXbd1-3Oi5A=h310"
    ],
    "comments": [
        "(Update:  New version fixed the nagging message, and Deal Zone is back.  Kudos to the B&H dev team for a fast fix.) It started asking me to rate it every time I open it, and each time I go back to the app's home page, EVEN THOUGH I HAVE ALREADY RATED IT, which started at 5 stars, but is now 2.  App has been great, otherwise, and B&H is excellent.",
        "The recent update eliminated the annoying \"Rate Me\" pop up and Deal Zone is back!! This app is 5 stars.",
        "I've ordered around 30 things now over the past 2 years, and have loved it. Yes sometimes orders are late but they're good at making up for the mistake. Definently a 5 star service!",
        "Since the last but one update cannot search anymore. Wrote a message to support. Without the ability of searching the app is useless for me. Uninstalling. Used to be great though before this issue.",
        "Really enjoy the app. I like the daily deals and easy access to items I am interested in. Loading has a fe glitches sometimes but with the new update it's getting better.",
        "The app used to be great, but with the update, it doesn't work at all. Search seems to do nothing.  I can't get to any merchandise at all."
    ],
    "recentChanges": [
        "- Fixed the issue where the review pop up showed up more than once. Sorry about that!",
        "- Fixed the missing DealZone issue. Thanks for letting us know about that one! You guys truly make us better :-)",
        "- Other small bug fixes and enhancements to ensure that our customers have the best app experience possible",
        "Think we missed anything? Please let us know at androidappsupport@bhphoto.com"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bhphoto&hl=en&gl=us",
    "appId": "com.bhphoto"
}