{
    "title": "BZ Reminder",
    "summary": "Easy to use and flexible to-do list app",
    "icon": "//lh3.googleusercontent.com/K57DA4HLj2vnF4NiHoIz6XxfI-s15MiO9dmuHgbCXO0aO4jh6WxoI-vz6zHPvzdhUT0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.7,
    "reviews": 37656,
    "developer": "Atlas Profit",
    "developerId": "Atlas+Profit",
    "developerEmail": "support@bzreminder.com",
    "developerWebsite": "http://bzreminder.com",
    "developerAddress": "299 Freemont St\nSan Francisco, CA 94105\ndev.1reminder@gmail.com",
    "updated": "December 21, 2017",
    "version": "2.3.4",
    "genre": "Business",
    "genreId": "BUSINESS",
    "description": "How often do you forget to do something? With this app you can JUST REMEMBER EVERYTHING that you want to do, and improve your productivity! You can easily control all the tasks that are in your to-do list, and be sure that you will do them. ★ Easy to use and straightforward reminder & to-do list app. Made for those who want to set up tasks super quickly. You do not even have to take your phone out of your pocket, you can just set reminder right from your android wear smart watch. Also you can use it as notes app. Key features: • Repeating / Recurring Tasks • Birthdays• Alerts• Snooze tasks• Mark tasks with colors• Notes• Customizable Widgets• Calendar with reminders• Missed call reminder• Android wear smart watch support: create reminder with voice recognition, snooze or complete it right from smart watch• You can set a reminder every hour, for example, \"drink water.\" This can help you to drink more water and feel better• much more!★ Now you can add birthday or anniversary. Import birthdays from contacts and synchronize them so they are always kept safe and never lost. You can easily view all the birthdays on the calendar.Previous application name is Bzzz.",
    "descriptionHTML": "How often do you forget to do something? With this app you can JUST REMEMBER EVERYTHING that you want to do, and improve your productivity! You can easily control all the tasks that are in your to-do list, and be sure that you will do them.<br><br> <br>&#x2605; Easy to use and straightforward reminder &amp; to-do list app. Made for those who want to set up tasks super quickly. You do not even have to take your phone out of your pocket, you can just set reminder right from your android wear smart watch. Also you can use it as notes app.<br><br> <br>Key features: <br>&#x2022; Repeating / Recurring Tasks <br>&#x2022; Birthdays<br>&#x2022; Alerts<br>&#x2022; Snooze tasks<br>&#x2022; Mark tasks with colors<br>&#x2022; Notes<br>&#x2022; Customizable Widgets<br>&#x2022; Calendar with reminders<br>&#x2022; Missed call reminder<br>&#x2022; Android wear smart watch support: create reminder with voice recognition, snooze or complete it right from smart watch<br>&#x2022; You can set a reminder every hour, for example, &quot;drink water.&quot; This can help you to drink more water and feel better<br>&#x2022; much more!<br><br><br>&#x2605; Now you can add birthday or anniversary. Import birthdays from contacts and synchronize them so they are always kept safe and never lost. You can easily view all the birthdays on the calendar.<br><br><br>Previous application name is Bzzz.",
    "histogram": {
        "1": 943,
        "2": 575,
        "3": 1184,
        "4": 5194,
        "5": 29760
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/HWsmavEkY0ZQzr_NkQ6Cb5SmBZGQf3mpZ57htJndmyPXhO8OFILGqpHLsMRsUrKCLCo=h310",
        "//lh3.googleusercontent.com/YZUOQz3NPoUFpjZm5eRKvQe7Gd73jD4sMSuR2RADK5iSpy0hV-tqYeT_q0fqwTbtRgg=h310",
        "//lh3.googleusercontent.com/o8l7Ni2bhEUk5VRdEtkJD23kOxTfyYPpUmOKKi9pvcGu-5B-ll-nfqcEupGhnUvMg_4=h310",
        "//lh3.googleusercontent.com/V0T_KR5_XdZvYymb7fxU3IAY53Beq0UuMbW8VoMjSIXYD_dVrhxnwk8fCNToVm4UNQCZ=h310",
        "//lh3.googleusercontent.com/qMoggRQ7kcSYoLBzYXHE5qRQDHHSfZZei1SilxShMccpe4-pWyz2JrMetxoWjMnkHu4=h310",
        "//lh3.googleusercontent.com/_047FxPfgojvgTHhwPDoYrjJqL2z_czH6CmO-_mOkp6hz0B7D-0OF32eQUi103qfyOEe=h310",
        "//lh3.googleusercontent.com/TzAi7y9eD8ehajBHIx4QU0Uu5yjTJ9Fm4HaspOhP5MWeP_hggEBJ8_I6Mk-oRRzJ9w=h310"
    ],
    "comments": [
        "Are all reminders being auto backed up in case of permanent loss of phone etc? If not, is there a way to make backups through the app? These are important questions, please respond, thank you",
        "This is a great app. The developers have done a good job. There's a few idiosyncrasies to get used to, but once you understand them, and how to get the settings right, it's great. I'll play with the free version for a bit longer, but I'll probably upgrade to the paid version. 😁",
        "Nice. At first I thought it was just 2 stars worth but the author got back with me and I tried it again. It is the defaults that are inconvenient. If you don't like the defaults then go to settings and there are lots of customization settings there. I would give it 5 stars except for the default settings. But I would suggest that more options be added for reminder interval. ... For example \"remind every 3rd Sat of the month\".",
        "I like it because the notification can be repeated for a certain number of times with it displayed on the screen, and then it is hidden away in the notifications panel. Perfect for when you aren't actually attached to your phone in real life.  Edit: I'm going to stop using this app because when the notification is dismissed, I am taken to BZ Reminder's screen and away from what I was busy doing, which interrupts my work flow. Does the paid version do that?",
        "I have just transferred from anoying lifereminders, and it looks promising for now. Very easy to use. Hope it doesn't start with stupid ads..",
        "I tried a few disappointing apps before landing on this one, but this one makes up for all the rest. Simple to use and, best of all, reliable. I would highly recommend."
    ],
    "recentChanges": [
        "- bugfix and stability improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bzzzapp&hl=en&gl=us",
    "appId": "com.bzzzapp"
}