{
    "title": "Plantronics Hub™",
    "summary": "Plantronics Hub allows you to customize your headset experience",
    "icon": "//lh4.ggpht.com/_MSYRHkeCVC5Fzx4zOQHhfFDjliq6viH6G1CyafcZIJuG_57oxjsnUBU-hDabydpEsaR=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4,
    "reviews": 13978,
    "developer": "Plantronics Inc.",
    "developerId": "Plantronics+Inc.",
    "developerEmail": "mobilesupport@plantronics.com",
    "developerWebsite": "http://www.plantronics.com/us/support/",
    "updated": "July 11, 2017",
    "version": "3.10",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Discover how Plantronics Hub brings additional functionality to your new Plantronics Bluetooth® headset with helpful tools, notifications, and status information. Get the following features for Voyager Legend, Voyager Legend UC, Voyager Edge, Voyager Edge UC, Voyager Focus UC, Voyager 3200 Series, Voyager 5200 Series and Voyager 8200 UC: •\tUse Find MyHeadset to locate your misplaced headset using an audible tone or the BackTrack feature •\tCustomize settings •\tManage smart sensor options•\tCheck battery level •\tSee headset status•\tExplore headset features •\tManage your headset call features from your wrist with your smartwatch (Wear 1.0 only)•\tWirelessly update your headset firmware from your smartphone (Voyager 5200 Series, Voyager 3200 Series, Voyager 8200 UC only)•\tChange language option for your voice prompts (Voyager 3200 Series, Voyager 5200 Series, Voyager 8200 UC, Voyager Edge and Voyager Edge UC only)Get the following features for Plantronics BackBeat FIT, BackBeat PRO, BackBeat PRO+, BackBeat PRO 2, BackBeat SENSE, BackBeat 100,  BackBeat GO 2, BackBeat GO 3, Voyager PRO HD, Explorer 10, Explorer 50, Explorer 80, Explorer 100, Explorer 500 Series, Marque M155, Marque 2 M165, Marque 2 A170, Marque 2 M180, M25 Series, M55, M70 Series, and M90 Series:•\tUse the Find MyHeadset feature to locate your misplaced headset using an audible tone or the BackTrack feature •\tCheck battery level•\tSee headset status•\tExplore headset featuresRequirements:•\tAndroid OS v4.4 and higher •\tSome versions of the Android operating system and some phones/tablets may not support all features.©2017 Plantronics, Inc. BackBeat, Find MyHeadset, Plantronics, Voyager, and Voyager Legend are trademarks of Plantronics, Inc. registered in the US and other countries. BackTrack, Explorer, Marque, M25, M55, M70, M90, M180 and Plantronics Hub are trademarks of Plantronics, Inc. Bluetooth trademarks are owned by Bluetooth SIG Inc., any use by Plantronics, Inc. is under license. All other trademarks are the property of their respective owners. Patents: US 9,661,117",
    "descriptionHTML": "Discover how Plantronics Hub brings additional functionality to your new Plantronics Bluetooth&#xAE; headset with helpful tools, notifications, and status information. <br><br>Get the following features for Voyager Legend, Voyager Legend UC, Voyager Edge, Voyager Edge UC, Voyager Focus UC, Voyager 3200 Series, Voyager 5200 Series and Voyager 8200 UC: <br><br>&#x2022;\tUse Find MyHeadset to locate your misplaced headset using an audible tone or the BackTrack feature <br>&#x2022;\tCustomize settings <br>&#x2022;\tManage smart sensor options<br>&#x2022;\tCheck battery level <br>&#x2022;\tSee headset status<br>&#x2022;\tExplore headset features <br>&#x2022;\tManage your headset call features from your wrist with your smartwatch (Wear 1.0 only)<br>&#x2022;\tWirelessly update your headset firmware from your smartphone (Voyager 5200 Series, Voyager 3200 Series, Voyager 8200 UC only)<br>&#x2022;\tChange language option for your voice prompts (Voyager 3200 Series, Voyager 5200 Series, Voyager 8200 UC, Voyager Edge and Voyager Edge UC only)<br><br>Get the following features for Plantronics BackBeat FIT, BackBeat PRO, BackBeat PRO+, BackBeat PRO 2, BackBeat SENSE, BackBeat 100,  BackBeat GO 2, BackBeat GO 3, Voyager PRO HD, Explorer 10, Explorer 50, Explorer 80, Explorer 100, Explorer 500 Series, Marque M155, Marque 2 M165, Marque 2 A170, Marque 2 M180, M25 Series, M55, M70 Series, and M90 Series:<br>&#x2022;\tUse the Find MyHeadset feature to locate your misplaced headset using an audible tone or the BackTrack feature <br>&#x2022;\tCheck battery level<br>&#x2022;\tSee headset status<br>&#x2022;\tExplore headset features<br><br>Requirements:<br><br>&#x2022;\tAndroid OS v4.4 and higher <br>&#x2022;\tSome versions of the Android operating system and some phones/tablets may not support all features.<br><br><br>&#xA9;2017 Plantronics, Inc. BackBeat, Find MyHeadset, Plantronics, Voyager, and Voyager Legend are trademarks of Plantronics, Inc. registered in the US and other countries. BackTrack, Explorer, Marque, M25, M55, M70, M90, M180 and Plantronics Hub are trademarks of Plantronics, Inc. Bluetooth trademarks are owned by Bluetooth SIG Inc., any use by Plantronics, Inc. is under license. All other trademarks are the property of their respective owners. Patents: US 9,661,117",
    "histogram": {
        "1": 1528,
        "2": 691,
        "3": 1308,
        "4": 2733,
        "5": 7718
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/na8ugWRyPGOVL620BMZvatcq8KFrX1KZNinnFWn6MBZ7zGf9dJi7oEC7__QcVSgnBAI=h310",
        "//lh3.googleusercontent.com/e6sRHi0pqWQqtU9bkzJbqrPo6gocUB-QV2L-sc7NKgh4Q2if7kzwK02obq9yL9Z5Xdw=h310",
        "//lh3.googleusercontent.com/_yoxevGmMvfT3c2q0BXjAT8jpsNGjYNJmONACKdx7PD4mifE2m3jqiuF2JB0YIv0EJs=h310",
        "//lh3.googleusercontent.com/C1Lsse2VySCUaIA1nYWGMndAWLxkMLQ81LN06oNgIIS4Rlc5ErGkHxrQXcF9PTQSa2PQ=h310",
        "//lh3.googleusercontent.com/XvnRz4Yb8FulBIPd1XdgOMg3WHmtJjvycBvFq3x3Zb8oQqo6xcm_OM_elMXTraAySg=h310",
        "//lh3.googleusercontent.com/4NI94v9iHde93-Tcj8apBQdW_MJ0iwYJPB4dIjE85yqPud7tEGUpr_gIXSOX1QmS5A=h310"
    ],
    "comments": [
        "After losing expensive ear buds in the past, pleased with app's potential assist to locate lost buds. Don't recall that Underarmour + Jaybird had that upgrade. Also, must admit, after trying lots of competitors, returning to Plantronics Backbeat FIT was smart move. Their bud design offers the most stability + snuggest fit in my broad basis for comparison.",
        "CAN YOU PLEASE FIX THE COONECTIVITY ISSUES FOR MY HTC 10???  I have an up to date Android OS, running Nugat and after updating the firmware on my edge, the connection keeps jumping in and out. Thank you...",
        "Best EVER!  I lost when I was at the grocery store. With the app I tracked it to a cart in the parking lot!!!!!! Awesome!  If I got too far away from where it was it would tell me it wasn't connected then I go the other direction and it connected it and we searched every until I heard the signal@ found it sitting there waiting for me in the grocery cart stall with 4 baskets behind the one I used!!!! AWESOME!",
        "Do security lockup at my church Hope Chapel of the Valley got home discovered headset missing. The find my headset worked GREAT.  GPS indicated within 10 feet and with the annoying sound found. I do actually thank my LORD AND SAVIOR JESUS CHRIST for this application.",
        "Awesome app! Once again, I just found my bluetooth headset underneath the covers in my bed, where I most certainly would not have looked today. The other day I was in the store trying on clothes, and when I got outside to my car realized I had lost my Bluetooth. I actually had to ask them to turn the music playing over the speakers all over the store, which they did, and subsequently found my bluetooth in the pocket of one of the pair of pants that I had tried on. That was awesome! And I knew it was in the store because when I turn the app on in the store it was showing it and when I got to my car it said not connected anymore so I went back in the store and ask them to turn the music down so I can listen for the tone.",
        "I do like the app. But the app is not necessary in order to use the headset. The one thing where I can find fall is with the button labeled find my headset. Unless your headset is sitting or perched against something that can reflect the sound then you will never find it. The only way it might work is if you drop it in your car. If you know the general location you can use that in order to locate it. I would have preferred to be able to change the voice on the headset. There are a lot of things I would like but those are not considered in the versions of the app so far. Other than that the app works perfectly. I am using the Motorola Droid Maxx with the latest OS version. There is one additional problem which is easily remedied. I don't want the app running all of the time the. I believe I will choose which apps we'll run all the time and which won't. When you close the app it is running until you force it to shut down. Like I said it's an easy remedy."
    ],
    "recentChanges": [
        "Support for Voyager 3200 Series, Voyager 8200 UC"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.plantronics.headsetservice&hl=en&gl=us",
    "appId": "com.plantronics.headsetservice"
}