{
    "title": "TDM (deprecated)",
    "summary": "Stay secured when you need to be.",
    "icon": "//lh4.ggpht.com/uogGIe473_LjHqusRv_KrUn37W9AmcCqKO_yxVuWYwPmQskYLHVsa2rPVKEniNy3qzI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.8,
    "reviews": 107,
    "developer": "Tusch Development",
    "developerId": "Tusch+Development",
    "developerEmail": "tusch.development@gmail.com",
    "developerAddress": "3294 Superior Ave\nEast Troy, WI 53120",
    "updated": "March 19, 2015",
    "version": "1.5.14",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Trusted Device Manager empowers you to keep your phone unlocked when you don't need the security, and keeps you secured when you need to be.  Automatically.When you connect to a trusted Bluetooth device or Wifi network, TDM will keep your phone unlocked.  As soon as you disconnect, TDM will secure your device.Keep your device unlocked    • when at home and connected to your wifi network.    • when in your car connected to your vehicle's Bluetooth.    • when connected to your Android Wear or Pebble device.    • anytime you connect to a trusted Bluetooth device or Wifi network.    • temporarily even when not connected to a trusted Bluetooth device or Wifi network.    • when at a trusted location you choose. (With TDM Location Plug-in)Don't worry!  You can always temporarily lock your device even when connected to a trusted device!• NEW! Lock your device from Android Wear.A few notes:    • TDM must become a Device Administrator so it can manage your lock screen.    • Unfortunately TDM will not work if you have another app that enforces a password policy.        • ex. Email app that connects to a corporate exchange server    • TDM will not work if you use full device encryption.    • If TDM is active as a Device Administrator YOU WILL NOT BE ABLE TO UNINSTALL IT        • Either disable TDM from your \"Device Administrator\" screen, or from the settings in TDM.Notes for users with Android 5.0 Lollipop:    • TDM does work.  (Sort of)  When TDM removes your pin when connected to a trusted device, a bug in Android 5.0 causes the lock screen to still show up.  When this happens, you can just press enter to bypass the lock screen (You do not need to enter your pin).  This is a flaw in Android 5.0 and there is nothing I can do about this yet.  (I'm still working on it).This has been fixed as of Android 5.1.  Unfortunately Android 5.0 - 5.0.2 still have this bug and Trusted Device Manager does not work as expected on those versions.This is a fully functional \"3 day trial\" of Trusted Device Manager.  After 3 days, Wifi unlocking will stop working.  If after those 3 days, you would like to keep using the Wifi unlocking feature, please purchase the Trusted Device Manager Premium Key.The Premium Key is just that.  A key to unlock the wifi features.  This app must be installed.",
    "descriptionHTML": "Trusted Device Manager empowers you to keep your phone unlocked when you don&apos;t need the security, and keeps you secured when you need to be.  Automatically.<br><br>When you connect to a trusted Bluetooth device or Wifi network, TDM will keep your phone unlocked.  As soon as you disconnect, TDM will secure your device.<br><br><br>Keep your device unlocked<br>    &#x2022; when at home and connected to your wifi network.<br>    &#x2022; when in your car connected to your vehicle&apos;s Bluetooth.<br>    &#x2022; when connected to your Android Wear or Pebble device.<br>    &#x2022; anytime you connect to a trusted Bluetooth device or Wifi network.<br>    &#x2022; temporarily even when not connected to a trusted Bluetooth device or Wifi network.<br>    &#x2022; when at a trusted location you choose. (With TDM Location Plug-in)<br><br>Don&apos;t worry!  You can always temporarily lock your device even when connected to a trusted device!<br>&#x2022; NEW! Lock your device from Android Wear.<br><br>A few notes:<br>    &#x2022; TDM must become a Device Administrator so it can manage your lock screen.<br>    &#x2022; Unfortunately TDM will not work if you have another app that enforces a password policy.<br>        &#x2022; ex. Email app that connects to a corporate exchange server<br>    &#x2022; TDM will not work if you use full device encryption.<br>    &#x2022; If TDM is active as a Device Administrator YOU WILL NOT BE ABLE TO UNINSTALL IT<br>        &#x2022; Either disable TDM from your &quot;Device Administrator&quot; screen, or from the settings in TDM.<br><br>Notes for users with Android 5.0 Lollipop:<br>    &#x2022; TDM does work.  (Sort of)  When TDM removes your pin when connected to a trusted device, a bug in Android 5.0 causes the lock screen to still show up.  When this happens, you can just press enter to bypass the lock screen (You do not need to enter your pin).  This is a flaw in Android 5.0 and there is nothing I can do about this yet.  (I&apos;m still working on it).<br><br>This has been fixed as of Android 5.1.  Unfortunately Android 5.0 - 5.0.2 still have this bug and Trusted Device Manager does not work as expected on those versions.<br><br>This is a fully functional &quot;3 day trial&quot; of Trusted Device Manager.  After 3 days, Wifi unlocking will stop working.  If after those 3 days, you would like to keep using the Wifi unlocking feature, please purchase the Trusted Device Manager Premium Key.<br>The Premium Key is just that.  A key to unlock the wifi features.  This app must be installed.",
    "histogram": {
        "1": 16,
        "2": 10,
        "3": 8,
        "4": 22,
        "5": 51
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/G0RJK1AB8Z9Frgm6ZpPHdVVa-0Zjblmf_3NM9SP2e2mNFDiHu10wh24o6RMF34V2b4s=h310",
        "//lh3.ggpht.com/V3rylzPh8_ajITUfpHdxNkirDlezsTj0QWlxtKGd0vD-eG3J364EDzVoPXEIwbyAyZI=h310",
        "//lh3.ggpht.com/FEXqYl95tTb68lYZ45hymb1iEMBO0-7dWR2ZQsG6LIQm1ycCE0VnWTRZrRgVWomnHaM=h310",
        "//lh6.ggpht.com/Am9DAJXGXxnMw9uEjBWQb54-go9dkYdqcg_EOuDV0oNFNf4sr24UQ0CA0hlCGI7hjg=h310",
        "//lh4.ggpht.com/e4wdC4ZpkHWoM10AwtZfBgfmtmbm21Yn_XmCW0CpLv2Qd-jJr4L_jq2PYDztVQ8udQ=h310",
        "//lh6.ggpht.com/u-Ekx8JkrBUCIjIK3A0zS6nwXf256W_Q7kBKqcwCX9x1gSdkrhI-9R0tmm1iLenhuyY=h310",
        "//lh3.ggpht.com/SqY_bdOdLBQs19_z3VbMaga1Ga95ssEERo2pVIu3zTm312CG8855MfUKFtkyIfiUWA=h310"
    ],
    "comments": [
        "Confirming does not work with lollipop I have a Pebble smart watch and this app does not detect that I am connected. Therefore smart watch does not act as a trusted device. Also it asks me multiple times if my WiFi is a trusted device. After I say yes and confirm my pin, it forgets it and then asks again. Can't believe I spent money on this. How do I get a refund?",
        "Have Moto G2 just upgraded to MM. Was using another program on KK and it stopped on upgrade to LP. Found another but it stopped working on upgrade to MM. This program works with trusted wi-fi and does what it says it does. Hopefully third time lucky and the devs continue with work on this app. Well done guys!",
        "Works, sort of Bluetooth and WiFi work perfectly. Location-based locking/unlocking is hit or miss, even when it appears to have a correct location fix. I haven't tested Pebble or Wear. Update: Pebble doesn't work. Lost another star.",
        "Android 5.1 fixed! When ur product works, ur users do the advertising for u. Perfect rating for: clean, simplistic, material UI. Customizable options. Easy to toggle. Responsive developer. Fantastic app, I just hope u will include more ways of unlocking in a future update.",
        "The setup was complicated but it is working.  It doesn't seem to work well with Nougat Lineage ROM for my phone. I'm hoping for an update.",
        "i can set 5 digit password but when want to unlock show is 4 digit. what is the problem here? now my phone can't be unlock, what should i do? please help to advise."
    ],
    "recentChanges": [
        "1.5.14",
        "• Prep work to support future plugins",
        "1.5.13",
        "• Now works with Android 5.1!!!",
        "• FIX: Bug causing device to stay unlocked when disabling bluetooth",
        "• FIX: Facebook link now works",
        "• NEW: Show trusted device name in notification.  (Option in settings)",
        "• NEW: Added haptic feedback to some areas",
        "• Updated APIs",
        "• Now initiates trusted connection scan on device boot",
        "• Reverted screen flicker fix.  If you experience flicker, change option in settings"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tusch.assistr&hl=en&gl=us",
    "appId": "com.tusch.assistr"
}