{
    "title": "Our Groceries Shopping List",
    "summary": "The easiest way to share your family’s grocery shopping—and it’s FREE!",
    "icon": "//lh6.ggpht.com/tmqHihlzNED_tpsst9lyqS8h7Z5558Ilr9_WS9UDFdyw2UyGse_IcB0NwE6voMBaWQE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 38603,
    "developer": "HeadCode",
    "developerId": "HeadCode",
    "developerEmail": "support@ourgroceries.com",
    "developerWebsite": "http://www.ourgroceries.com/",
    "developerAddress": "1120 Persia Ave\nSan Francisco, CA 94112",
    "updated": "March 3, 2018",
    "version": "Varies with device",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "size": "Varies with device",
    "description": "OurGroceries automatically keeps your family’s grocery list in sync with the latest changes—on every family member’s phone or web browser.“Our Groceries Shopping List is one of the very best grocery list apps for Android.” — Joy of Android“It's simple to setup, free to use and it's integrated with Google Home as an Assistant app.” —CNET“I can only say one thing about this app, it is awesome.” — Fishers Android App Reviews“I love technology, but I also love simplicity. I've found the best of both in OurGroceries.” — The Kitch review“After more than a year of using OurGroceries, we have been very satisfied.” — Anne vs. Home review“So far OurGroceries is my app of choice.” — Android Mom review“It really shines when dealing with multiple family members or roommates that are responsible for splitting up the grocery shopping.” — Talk Android reviewEvery change to your shared shopping list is visible in seconds. See items being checked off as your partner shops!• Share your shopping lists with family members, even if they have an iPhone.• Share your recipes too; add them to your shopping list with one tap.• Add items using your Amazon Alexa device, such as the Echo.• Convenient shopping with your Android Wear watch.• Add photos to items (premium version only).• Add items by scanning barcodes (premium version only).• Ad-supported, but upgradable to turn off the ads.• iPhone and web versions are also available.Keywords: MyGroceries",
    "descriptionHTML": "OurGroceries automatically keeps your family&#x2019;s grocery list in sync with the latest changes&#x2014;on every family member&#x2019;s phone or web browser.<br><br>&#x201C;Our Groceries Shopping List is one of the very best grocery list apps for Android.&#x201D; &#x2014; Joy of Android<br>&#x201C;It&apos;s simple to setup, free to use and it&apos;s integrated with Google Home as an Assistant app.&#x201D; &#x2014;CNET<br>&#x201C;I can only say one thing about this app, it is awesome.&#x201D; &#x2014; Fishers Android App Reviews<br>&#x201C;I love technology, but I also love simplicity. I&apos;ve found the best of both in OurGroceries.&#x201D; &#x2014; The Kitch review<br>&#x201C;After more than a year of using OurGroceries, we have been very satisfied.&#x201D; &#x2014; Anne vs. Home review<br>&#x201C;So far OurGroceries is my app of choice.&#x201D; &#x2014; Android Mom review<br>&#x201C;It really shines when dealing with multiple family members or roommates that are responsible for splitting up the grocery shopping.&#x201D; &#x2014; Talk Android review<br><br>Every change to your shared shopping list is visible in seconds. See items being checked off as your partner shops!<br><br>&#x2022; Share your shopping lists with family members, even if they have an iPhone.<br>&#x2022; Share your recipes too; add them to your shopping list with one tap.<br>&#x2022; Add items using your Amazon Alexa device, such as the Echo.<br>&#x2022; Convenient shopping with your Android Wear watch.<br>&#x2022; Add photos to items (premium version only).<br>&#x2022; Add items by scanning barcodes (premium version only).<br>&#x2022; Ad-supported, but upgradable to turn off the ads.<br>&#x2022; iPhone and web versions are also available.<br><br>Keywords: MyGroceries",
    "histogram": {
        "1": 694,
        "2": 506,
        "3": 1515,
        "4": 9431,
        "5": 26457
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/tq_C0ZrAetuBdwrGZdsc7kP1atQJjjmv-x5VXjemQeu1KYIluYpGqoalOXSzcu1c9w=h310",
        "//lh3.googleusercontent.com/iCFqvq-K9ai-NBiKZS-Ez_XuX94kLl-6Gb1VSC8Iu7SC5qUJ7e9hc9bmGkq_6HnrLBM=h310",
        "//lh3.googleusercontent.com/UBfdruMybVz2fupwJW8S_hJV5esZ6LHsyR5QtJdUPYcc9v89AO9eHgfm9CWr8KX6GQ=h310",
        "//lh3.googleusercontent.com/ocnmmJYl7v1iSBmUeJYkx_B_alsij8sHZ9Zy6SoeSsfmzfj8Gfqp6huxSKoyZplO4KE=h310",
        "//lh3.googleusercontent.com/jhu2Yuq53AlvFt89ie0jPOiHuEqIFlUGWslwab-2jJH7XS9-GxngOatCC4ts1ONhegk=h310",
        "//lh5.ggpht.com/YGZ2iRosicbO9ukjkqKgHIkmo981PbgQGFEnXLLCvvict-GZ9NZb0voiEarJTEYb8Rs=h310",
        "//lh6.ggpht.com/7wSaWQA0BivOZ1Vo-Q_GcmD6BZp2v_BelF8zHp-t5Gymv1O1GEKm_4HCiSqxtk9JArQ=h310",
        "//lh4.ggpht.com/wRkSNGtD56oeSsBAP4hHXG1_PqQHgwjuBMsuOandk1zkhTlQMDs9ag8juxKgdRipW6o=h310",
        "//lh6.ggpht.com/hfe3Igc7_137dQwquyBGgjQWarE341yZNxc6GK37vsyk5oCSikSeY-CyZxxVs41oX24=h310",
        "//lh3.ggpht.com/O4G2C8GU12j85B8Mkd7eHMed-QKv15wwpaBtTdpzTx7qd7o-bLE36Vkhz5Tmw_k-7Vc=h310",
        "//lh4.ggpht.com/8INfj6L0L0_Q9r46VLTjXRN682tzDpMNU8H3cQsQlG4ALSWjJWtXCM784oRgurt-mpA=h310",
        "//lh5.ggpht.com/OmByVa0hLb9OfTKfEAjft9YEsu_BLvgqGypY1MV0_UdD3rIxAyacCU0XkHlTBGZf5hI=h310",
        "//lh6.ggpht.com/Mhl3Dv3DWcwBilLb3n_dlaQh0zN0k6bSSlXEyrfpcjjvcjAnjkQE1177svk0W1UjRA5M=h310",
        "//lh6.ggpht.com/9XrkN0b-WzWVfbx66rGkc14OVKsDUM6HfEThbx3c2EglB6QGlE-AjpCBhEKUmzTwew=h310",
        "//lh6.ggpht.com/TY6ZB9DykRJan4b2dknzcAlAH_gDNUelEN21elu1PfO4KL3v7VI1lwf8w_y1exCLVAk=h310",
        "//lh3.googleusercontent.com/Yl14ouCvW94D1ka0SnItgCum6Oi_cnhqgAPdNOh4EO72ghXOTyweD7lVJkT-AfXAzhAo=h310"
    ],
    "comments": [
        "This app is awesome. No more forgetting the grocery list, and you can add or delete items easily when sharing the list.",
        "The absolute best list app I've used. I love that it saves your crossed off items so you can quickly add them back to your list with just a tap.",
        "This app became a part of my life! Sharing lists with others is just great!",
        "I like this app because it gives you your grocery list to be with you at all times and you can send it to your husband if he's out and about great app",
        "Great app, not as flashy as others, but works every time and syncs with my wife's phone perfectly. Thank you.",
        "So many areas of improvement needed.  Almost no real improvement over the years. Looks like an Android 101 project + material design."
    ],
    "recentChanges": [
        "The \"Fresh\" theme is even fresher!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.headcode.ourgroceries&hl=en&gl=us",
    "appId": "com.headcode.ourgroceries"
}