{
    "title": "Voice Recorder",
    "summary": "A Beautiful, High Quality sound recorder that lets you add images. No ads shown!",
    "icon": "//lh4.ggpht.com/QE3n6dMtZsENHJHHKfR__9oKPpejWDsHxomDVgLVFJXQtWuo3NQHfcsNrrYDK9f9TI8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.1,
    "reviews": 7883,
    "developer": "Triveous",
    "developerId": "Triveous",
    "developerEmail": "android@triveous.com",
    "developerWebsite": "https://skyro.co/",
    "developerAddress": "#147, Vayputra Nilaya, JP Nagar 5th Phase, Bangalore 0 78",
    "updated": "January 6, 2018",
    "version": "5.0.27",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Please note: This Voice Recorder cannot record calls of any typeThis is not just a voice recorder, it is an intelligent voice recorder. It is the only app that lets you automatically add images of presentation slides, notes, whiteboard sessions and more to a recording to make it richer.It is also beautiful, reliable and records audio in high quality, that is why every day, thousands of people in over 200 countries and 15 languages trust this app to record their meetings, class lectures, music sessions, voice memos & more.Why you should try this★ Enjoy crystal clear audio recording for hours in all conditions on every device. ★ A beautifully simple user experience that’s been refined over years of user research. The experience is further enhanced by the principles of material design.★ No advertisements, no limits on the recording duration. Audio recording like it should be.★ Add images of notes, presentation slides and more to the recording to make it richer and watch how this automatically creates a slideshow for you.★ This makes searching for recordings easier than ever before. Organize your audio recordings with tags like work, important, school and even your location, so finding the right recording is always a breeze.★ This app auto-saves your recording every minute, so that even if the phone crashes or runs out of battery you should be able to recover it.★ We know space is always an issue with large recordings. That is why you can compress audio and save to an external SD cardOther features:★ You can also optionally backup your recordings to Dropbox so that you always have a copy of your recordings.★ This app makes it really easy to share your sound recordings and voice memos over bluetooth, mms, email & also with third party apps★ We love android tablets and that's why we've created a great, completely customized experience for tablets.★ Many many more recording options for the inner geek in us (hi-definition audio settings, sharing to soundcloud, adjusting recording volume with microphone gain)★ Fully accessibleThe pro version of this Voice Recorder allows you to do even more:- All compression bitrates- All Sync Settings- All themes- Recording on a bluetooth headset- Customized Pro Widgets- Change recording source (camcorder microphone)- Noise Suppression- Echo Cancellation- Automatic Gain ControlSo why use this app?This is the the best free voice recorder for businessmen, school & college students, musicians, journalists & people who love to record audio on the go. Use it forMeetings: It is the best voice recorder to be used as a business meeting recorder. Take photos of presentations, whiteboard sessions or notes during the meeting & they will be synced to the recording.Lectures: School, college & university students frequently use this app to record lectures. Take images of a whiteboard, notes or pages in a book & you have a virtual class on your phone. Tip: It might also make sense to create a shared dropbox folder for all students in a class, school, college or university & then use this app to share to that.Music & Sound: This audio recorder is also great at recording sounds of different musical instruments like the guitar, flute etc. so people love to use it as a dedicated sound recorder.Support- If you have any queries or issues with the app, please e-mail us at help@triveous.com & we will get back to you right away.",
    "descriptionHTML": "<b>Please note: This Voice Recorder cannot record calls of any type</b><br><br>This is not just a voice recorder, it is an intelligent voice recorder. It is the only app that lets you automatically add images of presentation slides, notes, whiteboard sessions and more to a recording to make it richer.<br><br><br>It is also beautiful, reliable and records audio in high quality, that is why every day, thousands of people in over 200 countries and 15 languages trust this app to record their meetings, class lectures, music sessions, voice memos &amp; more.<br><br><br><br><br><br><b>Why you should try this</b><br>&#x2605; Enjoy <b>crystal clear audio recording</b> for hours in all conditions on every device. <br>&#x2605; <b>A beautifully simple user experience</b> that&#x2019;s been refined over years of user research. The experience is further enhanced by the principles of material design.<br>&#x2605; <b>No advertisements</b>, no limits on the recording duration. Audio recording like it should be.<br>&#x2605; <b>Add images of notes, presentation slides and more to the recording to make it richer</b> and watch how this automatically creates a slideshow for you.<br>&#x2605; This makes searching for recordings easier than ever before. Organize your audio recordings with tags like work, important, school and even your location, so finding the right recording is always a breeze.<br>&#x2605; <b>This app auto-saves your recording every minute, so that even if the phone crashes or runs out of battery you should be able to recover it.</b><br>&#x2605; We know space is always an issue with large recordings. That is why you can <b>compress audio</b> and <b>save to an external SD card</b><br><br><br><br><b>Other features:</b><br>&#x2605; You can also optionally backup your recordings to Dropbox so that you always have a copy of your recordings.<br>&#x2605; This app makes it really easy to share your sound recordings and voice memos over bluetooth, mms, email &amp; also with third party apps<br>&#x2605; We love android tablets and that&apos;s why we&apos;ve created a great, completely customized experience for tablets.<br>&#x2605; Many many more recording options for the inner geek in us (hi-definition audio settings, sharing to soundcloud, adjusting recording volume with microphone gain)<br>&#x2605; Fully accessible<br><br><br><br><b>The pro version of this Voice Recorder allows you to do even more:</b><br>- All compression bitrates<br>- All Sync Settings<br>- All themes<br>- Recording on a bluetooth headset<br>- Customized Pro Widgets<br>- Change recording source (camcorder microphone)<br>- Noise Suppression<br>- Echo Cancellation<br>- Automatic Gain Control<br><br><br><br><b>So why use this app?</b><br>This is the the best free voice recorder for businessmen, school &amp; college students, musicians, journalists &amp; people who love to record audio on the go. Use it for<br>Meetings: It is the best voice recorder to be used as a business meeting recorder. Take photos of presentations, whiteboard sessions or notes during the meeting &amp; they will be synced to the recording.<br>Lectures: School, college &amp; university students frequently use this app to record lectures. Take images of a whiteboard, notes or pages in a book &amp; you have a virtual class on your phone. Tip: It might also make sense to create a shared dropbox folder for all students in a class, school, college or university &amp; then use this app to share to that.<br>Music &amp; Sound: This audio recorder is also great at recording sounds of different musical instruments like the guitar, flute etc. so people love to use it as a dedicated sound recorder.<br><br><br><br><br><b>Support</b><br>- If you have any queries or issues with the app, please e-mail us at help@triveous.com &amp; we will get back to you right away.<br><br>",
    "histogram": {
        "1": 749,
        "2": 366,
        "3": 726,
        "4": 1458,
        "5": 4584
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/OcVUU_omSCD4e6uPB2wo0iCgpdSegn-s5pkrSFcKMD113jqR33wATfHDB7JWPXJq81kf=h310",
        "//lh3.googleusercontent.com/YdKh0fMz155R2M6UtPbPoHPWDO9KqpuxeHPRojYVfZTJu7bYh2x27RWojtMRf9YPEg=h310",
        "//lh3.googleusercontent.com/kNtMFpglVmvmEaK6VcYEXBHvMrqU22D6-AkAoa--tU7S2OiPR8UZWfim8Ojk53OdfE8=h310",
        "//lh3.googleusercontent.com/RmtTyfLqInmH_yzk9W3eTFviPyN6O2AOD3vjwLsK8fAEZPNplcttbiMUQ2TLip0g3cOH=h310",
        "//lh3.googleusercontent.com/crLORkkEZ2rq2i1D-kqShw9-MTDFfVuKCTVWnFyBc_UxSB3Hx_N5oJYL1EphgRoqyJ0=h310",
        "//lh4.ggpht.com/AqdJrxtltC8IBXs4mdFNHwSDKWu1LgDCWghwnTPtG8uBnigeebexMmMT-U7SeVO1Ew=h310",
        "//lh4.ggpht.com/cjAdVuC-W2Lr1gJ2zpDM2GcCHYJDJVMoa31IdMeV4n4CGDY0xRg_Vz-VSoa7GH6zabk=h310",
        "//lh3.ggpht.com/6DNkTnnWQTcmviyjgLV_guX1A1sZbKaHCIH7HjDLDDv1RUImVd1Af6iRz9NAjflXolg=h310",
        "//lh6.ggpht.com/7uLy9Wem4yTVFg-uLyJYvsm8AblSnOQczkOyS6-Onp6FnbqE1E8DJtPNGAa5EKPJ2A=h310",
        "//lh5.ggpht.com/R6lAJ-PIVouwg6KshHm0cci4OENOQ1RU1-Ls1er0fUnO8Yk6ECYwdvWN3HpjviduJi1T=h310",
        "//lh4.ggpht.com/jQRhj7_iVb98ixf8NeizzSFZlDUKo7bfVLcCisCrciTqA3GCyPrffzq648-y_2Yq914=h310",
        "//lh3.ggpht.com/T9euoXJwyKICl0Nh7yG3g6xI-ibjtB7QIvEKfY89vOf_O_3j8OPgsO1oYeGf4rKP8w=h310",
        "//lh4.ggpht.com/cMyIeKeJr7wTb327j02xzbHQ5qzISMPjgg850rWCF3LhvD0ZqyBDmnNlwXZZnBcBQ68=h310",
        "//lh4.ggpht.com/zw3m7DMEw-Hr7qCVkZwcIJ1d00AK_U2-0QOagd-X-vZ_4KI9-H_w37Dmu18wShsuGg=h310",
        "//lh6.ggpht.com/o0af4aTHKZa5MiAa5Y9XQ1gF2_sCHqX5cJExsncOBhPRw6NROjXhKS7OxpsDIpu4Yc-m=h310",
        "//lh3.ggpht.com/pWb4iCtUaMWogqi1ecTmXR_AQx27zGWpMJsBoFNBPAmnPVrI4O7EfDKoaluZL2nFHQ=h310",
        "//lh6.ggpht.com/DPjl6YFPZUh8vlAXOedjrYnTGwkv5wS6L4DHq-IHWvt48JI9F0bwEkT9UeooX2da4ok=h310",
        "//lh4.ggpht.com/I9QUfdcP1cK0ArRkD7uaR_VKQ6Lp8KTHnlZyaUvu6yzRfQuPu3yL27XNE6-FXFtpycE=h310",
        "//lh5.ggpht.com/Q-0q98xZPprBUb5Uy79PZbHJVOBUzSeVTs2shG86cUE78Z5GIPPPWwBOfs6I37EwYA=h310",
        "//lh4.ggpht.com/PZy6UWgF6saU_eMdu5Dju0kPnxIn7xtDqcdlpFaq7yRueSGlFUIBAKgU7EzO922HVQ=h310",
        "//lh3.ggpht.com/G8ObUrf_eX6E2Ga5rvN13rxKDXMQhg2_8yZSfGIi9DKuw_FWXckVZH9kBONPbkwpNBs=h310"
    ],
    "video": "https://www.youtube.com/embed/wjs12a00zx8",
    "comments": [
        "I used to love this app for recording feedback to my students. I recently signed up for 12 months of pro and for some reason this week I can no longer share the files properly via wetransfer like I always have and it will only share a txt version of the file which is utterly useless to me. Everything worked fine last week and now it doesn't work at all. It also wants me to sign up for pro per month on top of the 12 months I've already paid for. If it's necessary to pay for both, fine but I at least want to be able to share my files easily",
        "I bought the paid version about a year ago - now I have to pay extra (as in, a subscription) mainly because the design of the application has changed? I hate this! :-(  Also the moment I do a second recording, it automatically writes over the first file valid file. Not Cool. Important Audio Lost....! But either way, I have chosen to discard this application from my devices for good and move on to other Better Quality Ones. (Sighs..)",
        "I just realized that when you name the recording in the app, it does not get saved with the file. Now I can't play it in the app because I renamed it in a file manager. This is not good because it I want to back it up onto my computer or flash drive, I will not be able to identify the recording. Please fix it. I recorded a 3 hour lecture and paused it. I accidentally closed the app. Now the recording says it is 0 seconds long. The description says that the recording would be saved if the phone lost battery. Why did it lose the recording?",
        "They keep finding new ways to make me have to pay again for my PAID FOR app. Last time might have been a mistake, but twice? They clearly have a policy of price-gouging users.  Ive also noticed the missed recording issue has been unresolved for years. This app is ok but the business practices are dodgy and the service cannot be relied on either from a business or technical point of view. You should avoid this app.",
        "I've been a paid user for a while, but recently I've been using (or trying to) the app more frequently.   This has made me realize how unreliable it is; roughly 50% of all of my recordings end up being about a minute or so of silence instead of the 30+ minutes they should be.   Everything looks like it's recording, but when all is said is done it hasn't. I'm not sure what the problem might be, but it renders the entire app untrustworthy.  When it does work, it works well though.",
        "I purchased the paid \"pro\" version for better sound quality for my classes. Now they are making me pay again for web/cloud storage??? No...please return my ability to use different formats/bitrates, and allow me to purchase the \"cloud\" functionality if needed."
    ],
    "recentChanges": [
        "Today we’re announcing a huge new update to the app, we’re adding highlights, notes, and many other new features including a completely new cloud subscription service for storing your recordings."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.triveous.recorder&hl=en&gl=us",
    "appId": "com.triveous.recorder"
}