{
    "title": "Apex Notifier",
    "summary": "Extension application for Apex Launcher Pro, DashClock Widget, and Android Wear.",
    "icon": "//lh6.ggpht.com/1H61lU4qQdmYFDDQ-p88BqLMjm9PRRQntZn4xGwCws1zHjzp8zEA8et7SMbRAAbwKvU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 3.8,
    "reviews": 11587,
    "developer": "Android Does",
    "developerId": "Android+Does",
    "developerEmail": "support@apexlauncher.com",
    "developerWebsite": "http://www.apexlauncher.com/",
    "developerAddress": "440 N Wolfe Rd, Sunnyvale, CA 94085",
    "updated": "December 20, 2014",
    "version": "3.2.0",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Apex Notifier is an extension application for Apex Launcher Pro (2.3+) and DashClock Widget (Android 4.2+). It provides notification data to those applications and does nothing on its own.NEW: Apex Notifier now supports Android Wear devices!Check the battery level of your phone straight from your wrist. There's no need to take the phone out of your pocket just to see how much battery is remaining. When an Android Wear watch is connected to your phone, a battery card appears on the watch that shows you the current battery level and charging status. To set up, just launch Apex Notifier on your phone and turn on Battery > Show on Android Wear. To customize the experience, you may control when the battery card shows up (e.g., when not charging or the battery drops below a certain threshold). You'll also find options to show additional battery information like health, temperature, and voltage.When used with Apex Launcher Pro, unread counts will show up in badges on application icons. Please enable Apex Notifier in Apex Settings > Notification settings.When used with DashClock Widget, Apex Notifier displays useful information from various sources. Please enable Apex Notifier in DashClock Extensions > Add Another Extension > Apex Notifier. You may enable up to 5 extensions for DashClock.Supported Apps• Missed Calls• Unread SMS• Calendar Appointments• Gmail• HTC Mail• Samsung Email• K-9/Kaiten Mail• Battery Level• Stock Email• Google Hangouts (Android 4.3+)• WhatsApp (Android 4.3+)• Google Play (Android 4.3+)• Google Voice• StarbucksNotes• Unread SMS provides the number of unread messages, not unread conversations.• Gmail unread count requires Gmail version 4.0.5 or higher.• If you update Gmail or install K-9/Kaiten Mail after installing Apex Notifier, you may have to re-install Apex Notifier to get proper permissions.• You do not need this extension for Aqua Mail. Just turn on external notifiers in Apex Launcher Pro, and you will see the unread count badge.• Battery level will be displayed in a numeric badge on Battery apps (the Settings app by default) in Apex Launcher Pro. Some battery settings (e.g., status, time, details) are only applicable for DashClock.• Notification data for Email, Google Voice, and Starbucks are retrieved from widgets. Please set up your account in those apps first. Depending on how often each app refreshes its widget, data may not be updated in real time.• Features listed under Labs are experimental and may stop working in the future.• When used with Apex Launcher Pro, please install Apex Launcher before installing Apex Notifier.• Apex Notifier only works with official versions of Apex Launcher Pro (2.3+). Please do not ask for support if you are using a modified or pirated version.Feature RequestsFor now, only apps listed above are supported. Integration with additional apps may be implemented in the future if there is official API or public content provider.Developers: Apex Launcher Pro also supports notifications from other apps. Please check out the notifications API at http://goo.gl/NC8EO",
    "descriptionHTML": "<b>Apex Notifier is an extension application for Apex Launcher Pro (2.3+) and DashClock Widget (Android 4.2+).</b> It provides notification data to those applications and does nothing on its own.<br><br><b>NEW: Apex Notifier now supports Android Wear devices!</b><br>Check the battery level of your phone straight from your wrist. There&apos;s no need to take the phone out of your pocket just to see how much battery is remaining. When an Android Wear watch is connected to your phone, a battery card appears on the watch that shows you the current battery level and charging status. To set up, just launch Apex Notifier on your phone and turn on Battery &gt; Show on Android Wear. To customize the experience, you may control when the battery card shows up (e.g., when not charging or the battery drops below a certain threshold). You&apos;ll also find options to show additional battery information like health, temperature, and voltage.<br><br>When used with Apex Launcher Pro, unread counts will show up in badges on application icons. Please enable Apex Notifier in <i>Apex Settings &gt; Notification settings</i>.<br><br>When used with DashClock Widget, Apex Notifier displays useful information from various sources. Please enable Apex Notifier in <i>DashClock Extensions &gt; Add Another Extension &gt; Apex Notifier</i>. You may enable up to 5 extensions for DashClock.<br><br><b>Supported Apps</b><br>&#x2022; Missed Calls<br>&#x2022; Unread SMS<br>&#x2022; Calendar Appointments<br>&#x2022; Gmail<br>&#x2022; HTC Mail<br>&#x2022; Samsung Email<br>&#x2022; K-9/Kaiten Mail<br>&#x2022; Battery Level<br>&#x2022; Stock Email<br>&#x2022; Google Hangouts (Android 4.3+)<br>&#x2022; WhatsApp (Android 4.3+)<br>&#x2022; Google Play (Android 4.3+)<br>&#x2022; Google Voice<br>&#x2022; Starbucks<br><br><b>Notes</b><br>&#x2022; Unread SMS provides the number of unread messages, not unread conversations.<br>&#x2022; Gmail unread count requires Gmail version 4.0.5 or higher.<br>&#x2022; If you update Gmail or install K-9/Kaiten Mail after installing Apex Notifier, you may have to re-install Apex Notifier to get proper permissions.<br>&#x2022; You do not need this extension for Aqua Mail. Just turn on external notifiers in Apex Launcher Pro, and you will see the unread count badge.<br>&#x2022; Battery level will be displayed in a numeric badge on Battery apps (the Settings app by default) in Apex Launcher Pro. Some battery settings (e.g., status, time, details) are only applicable for DashClock.<br>&#x2022; Notification data for Email, Google Voice, and Starbucks are retrieved from widgets. Please set up your account in those apps first. Depending on how often each app refreshes its widget, data may not be updated in real time.<br>&#x2022; Features listed under Labs are experimental and may stop working in the future.<br>&#x2022; When used with Apex Launcher Pro, please install Apex Launcher before installing Apex Notifier.<br>&#x2022; Apex Notifier only works with official versions of Apex Launcher Pro (2.3+). Please do not ask for support if you are using a modified or pirated version.<br><br><b>Feature Requests</b><br>For now, only apps listed above are supported. Integration with additional apps may be implemented in the future if there is official API or public content provider.<br><br><b>Developers:</b> Apex Launcher Pro also supports notifications from other apps. Please check out the notifications API at http://goo.gl/NC8EO",
    "histogram": {
        "1": 1597,
        "2": 752,
        "3": 1380,
        "4": 2091,
        "5": 5767
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/_ZAl9tmZAFHuDguUN2zmtEyoIqNaN6--vNUGUgwrfxkSu6NUNrWfiAiPo-Hm3Kz_iQ=h310",
        "//lh5.ggpht.com/8B_cjuzRZVwcjtVLvjN8rxnFRBs4aPg6l_iuPQzB8ua6Z5w5xOEu4CS0YZfMmLdcaI4=h310",
        "//lh5.ggpht.com/77V55Zl2CxtdsWSBtvKM3DaV-kAuehEVjEor8F47NnAngt3xHy6WnRV8b8_TjH5C_A=h310",
        "//lh5.ggpht.com/LUf_18UHAkNEToOeoyc5EYRSRLa_IL4nfEK10slWIlWHIumMMT1vsKwuSF2qheqk5cDP=h310",
        "//lh5.ggpht.com/Zl7hD2ZOPx7aSP6xYDVW6XByLvpcALFYC7KL6msiqhf8Y9LHIXIDmnt-EUerygRNhQc=h310",
        "//lh6.ggpht.com/aXpybAta7RxpBIghQphO23i7sCNJf-y7MEfX_L9GcLpwV95KCt7YwmgL3k-YE7w-piY-=h310",
        "//lh4.ggpht.com/DwATsBh5rHzWZ5OitNV0P4Dzv2988i2VR5zTfBU0eQlUOOSQK-1LOR9W3SqLmkHcW-uW=h310",
        "//lh5.ggpht.com/7wSVIkLG13RukT91ZkLS_oewBo7DkxBC2LvHdzV5wx-N__qVpxyAYp9zWZUpnrUkeQ=h310",
        "//lh6.ggpht.com/xMG-xS205OsKCRwBF4uZAMiQu8ibC_YhcGohQoFRXrLKsyZLeInrXM6e-_nnO3Bwcc8=h310",
        "//lh3.ggpht.com/aLFfarTL6q3XMN0vnUqBWtnZHxJrX2KYFCq_yURz46UWSyMGQLJbi3gVU9NbAHgyrw=h310",
        "//lh3.ggpht.com/UBNKVoZecHPK1eSwll6aN37yAz5iz8wGYgz74hlqZ7w7cIcz_JEG_teYOAarIMUtBAo=h310",
        "//lh4.ggpht.com/DB6Q56VMktJqPyLzUfXwMMpkQNMNvtHi8dNJ-_NKKiOBd08Y00N9BO1A4brhgoqsylI=h310",
        "//lh4.ggpht.com/7VnISHqQ82uk1dBD9uYpm80JAu0gP_3JvPmAZOhEgabLMp10tihOngILmt05fZ7G8eLK=h310",
        "//lh3.ggpht.com/ntryMnublvxgq6yxOdGW-Q-X2mVMGaXJYUAl4yFa6KApF5safGJA_l9H9zr98AboICk0=h310"
    ],
    "comments": [
        "Kinda useful at best I support the developer 100% and appreciate their efforts, but this is only mildly useful at best. I do have apex pro but my droid turbo came with Moto notification thing which takes precedence over this. So I pretty much have to scroll twice to get to apex notifier and that is an arduous task indeed. Also I'm not a big fan of this app being dependent on both apex launcher (to be expected) and DASHCLOCK (not expected) which is made by another developer. Are you guys friends/affiliates or what?",
        "Notifications Work Fine on GS5 w/Lollipop for Supported Apps Badges show as designed for *supported applications* (listed above) after Lollipop update on my Galaxy S5.  This includes the dock.  I did a factory reset before updating to Lollipop and another after the update.  I then installed all applications.  Then I installed Apex Launcher, Apex Launcher Pro and then Apex Notifier (in that order).  External notifications are enabled in Apex Launcher.    I did have one issue with a persistent notification that showed \"1\" unread SMS even after I cleared all of them.  This was resolved by going into the settings for the Android \"Badge Notifier\" app and clearing data.  This isn't Apex related, but I see several bad reviews here attributing it to Apex, so I thought I'd mention it.",
        "Does Not Work!! I love Apex Launcher but the Apex Notifier add on is not working for me. I have allowed it to receive notifications within the app/android settings but it still doesn't work. I'm on a Sprint Samsung Galaxy Note 4 and the unread message count is not showing for the Messaging app. I am not seeing notifications on any other icon either, for missed calls or anything else. PLEASE HELP!",
        "More notification designs would be excellent Design previews and options would be a good addition. I'd prefer the boxes to be wider as well, more noticeable. Also, Google recently released a new mail app to replace Gmail. It's called \"Inbox for Gmail\" and it doesn't seem to be supported.",
        "Pretty good It was working really nice for awhile, but now all of a sudden it keeps telling me I have 1 unread text message. I went through all my conversations and marked them as read, restarted my phone, and did a battery pull. Nothing has fixed it so far. :(",
        "Works but not well With Apex, I love it because I can resize icons. However, every time I get a notification and the badge pops up, the size of the icon shrinks back down to the original size. This does not look good and is annoying as I have to redo it."
    ],
    "recentChanges": [
        "* New material design UI",
        "* Added Greek translation",
        "* Updated translations"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.anddoes.notifier&hl=en&gl=us",
    "appId": "com.anddoes.notifier"
}