{
    "title": "CaroO Free (Blackbox & OBD)",
    "summary": "The best vehicle dash cam with OBD support on your phones with CaroO Free!",
    "icon": "https://lh5.ggpht.com/tUB4jkv0e7TwbPNoe0ie_Nlzp764lFBPFXqUebLeLs4vY6YMPcaAM2MbTYYcem5gpA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 3883,
    "developer": "Pokevian",
    "developerId": "Pokevian",
    "developerEmail": "apps@pokevian.com",
    "developerWebsite": "http://www.pokevian.com",
    "developerAddress": "(13320) 경기도 성남시 수정구 성남대로 1182 올레서비스드오피스 6층\n전화: 070-8264-0806\nFax: 031-752-8699",
    "updated": "February 16, 2017",
    "version": "3.2.0",
    "genre": "Auto & Vehicles",
    "genreId": "AUTO_AND_VEHICLES",
    "description": "CaroO Free Driving Recorder update with full features of PRO version! You can use 100 times freely with this new version and if expired, you can purchase PRO version or reinstall this free version again after deleting it first.  If you want to use the old version, please visit CaroO user service channel on Facebook or Google+.  CaroO Free Driving Recorder is a free and lite version of CaroO Pro Driving Recorder which supports full pack of features including video dashcam with collision detection, driving track recorder with GPS function, and car-diagnosis and monitoring with OBD-II device. You can use video event recorder function and car-monitoring function separately or together. Experience the stable background operation as well as no gaps between recorded files on Android 4.1 or higher devices!- Video dashcam supporting resolution and quality control up to full HD (1920x1080),- Camera exposure and focus control (depending on capabilities of phones),- Auto file deletion for normal/emergency video, - Emergency report via SMS, call and YouTube upload,- Car monitoring with connection of ELM327 compatible OBD dongles, - RPM, Speed, Battery voltage, coolant temperature, Baro pressure, and many more data (depending on cars),- Fuel-cut, eco-drive level, harsh acceleration/brake, idling indicator,  - Auto launch and termination options, - Co-working with Android Wear devices for notification and control  We recommend smartphones with Android 4.0 or higher, but most smartphones with Android 2.2 or higher are supported too. Android 2.2 or lower devices will not be officially supported from CaroO v2.3.0.  Before your purchase, please use the free version, CaroO Free Driving Recorder, in advance.If you have any problems or difficulties to use this app, please use the log button on the main screen and send log files to us. You can find a user manual of CaroO at the following link: https://drive.google.com/file/d/0B9VZrEUr0oBGMlhnd3ZWZFBrS0U/view?usp=sharing And you could also get some helpful information by visiting Facebook page or Google+ user community. http://www.facebook.com/CarooProDrivingRecorder https://plus.google.com/u/0/communities/114617914804645646011",
    "descriptionHTML": "CaroO Free Driving Recorder update with full features of PRO version! <br><br>You can use 100 times freely with this new version and if expired, you can purchase PRO version or reinstall this free version again after deleting it first. <br><br> If you want to use the old version, please visit CaroO user service channel on Facebook or Google+.  <br><br>CaroO Free Driving Recorder is a free and lite version of CaroO Pro Driving Recorder which supports full pack of features including video dashcam with collision detection, driving track recorder with GPS function, and car-diagnosis and monitoring with OBD-II device. You can use video event recorder function and car-monitoring function separately or together. <br><br>Experience the stable background operation as well as no gaps between recorded files on Android 4.1 or higher devices!<br><br>- Video dashcam supporting resolution and quality control up to full HD (1920x1080),<br>- Camera exposure and focus control (depending on capabilities of phones),<br>- Auto file deletion for normal/emergency video, <br>- Emergency report via SMS, call and YouTube upload,<br>- Car monitoring with connection of ELM327 compatible OBD dongles, <br>- RPM, Speed, Battery voltage, coolant temperature, Baro pressure, and many more data (depending on cars),<br>- Fuel-cut, eco-drive level, harsh acceleration/brake, idling indicator,  <br>- Auto launch and termination options, <br>- Co-working with Android Wear devices for notification and control  <br><br><br>We recommend smartphones with Android 4.0 or higher, but most smartphones with Android 2.2 or higher are supported too. Android 2.2 or lower devices will not be officially supported from CaroO v2.3.0.  Before your purchase, please use the free version, CaroO Free Driving Recorder, in advance.<br><br>If you have any problems or difficulties to use this app, please use the log button on the main screen and send log files to us.<br><br> <br>You can find a user manual of CaroO at the following link: <br>https://drive.google.com/file/d/0B9VZrEUr0oBGMlhnd3ZWZFBrS0U/view?usp=sharing <br><br>And you could also get some helpful information by visiting Facebook page or Google+ user community. <br>http://www.facebook.com/CarooProDrivingRecorder <br>https://plus.google.com/u/0/communities/114617914804645646011",
    "histogram": {
        "1": 212,
        "2": 140,
        "3": 512,
        "4": 1218,
        "5": 1801
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/eBIeGIwN1u4HqgsnNpX23V8WzutrzWHm1dQ799pyCPMqyJtkocZ6SIxBpyu780WPJg=h310",
        "//lh3.googleusercontent.com/oLmoLBX0GhOBhcWTmfJsFTBp3Xvvnp8bFN6__-yEm2SbKI0B9xPKma5A2cLA04jrfw=h310",
        "//lh3.googleusercontent.com/wnqwq9w2cuDv7mB8SWXXnUjlttXfyL0v6wz4iQS_U5VznUDTzqRebQpGinBblMXUGnU=h310",
        "//lh3.googleusercontent.com/3-YHABryOYbg-Mp-1VFGb2WEHDRrROL6UeqWbFWM9CzxAycV52ih6heVKlf_FEtNuKA=h310",
        "//lh3.googleusercontent.com/845SnumdycjXEgsrfEEc0MZhva_Aq3vYvDG3J4fPSrLSHdgBDRn4-OC9Op7Gl1q5S1tN=h310",
        "//lh6.ggpht.com/LSubCJbLupMfjyfapvWo-6cDZKfiqcCdkcESOmKkOZk1ege3cQdOcU1YZW3ttQ48RDs=h310",
        "//lh6.ggpht.com/98QA6fITnoJqM3vUYnu8U_Q_cXg29r2xfEbSId47W9iX3B9LUt7y0eV3ZO3KKX4udX0=h310",
        "//lh5.ggpht.com/OKew60w4EVmPqBjmevLS2cbsaIcVF5FjKSOntwIQkyjwJpsE1E5oW-zFOIRXb2xxs7gS=h310",
        "//lh3.googleusercontent.com/KnUXcr6fIYXj_js2G68x-lSN4qtePlItMkwX5-P0bAN1dbI-179slgnY_jFkAziPxg=h310",
        "//lh3.googleusercontent.com/CRlcIKVzceNsimk6OARiTZCa7VJeZf_8vcIUXYpDsLCb0IaDjUGMWxj4E-UKvoS3lDk=h310",
        "//lh3.googleusercontent.com/CaIY8iq3tn2v3XPefdcz1GKwu32RmkfoiCeqxT5U7qEDRYQ3Qeegp_70eo8rcOt9bA=h310",
        "//lh3.googleusercontent.com/Oi7G7fRk6Y_8oGR704GGvZE85FJIWAksOmlxas-F7MWaYFrXE6_NHPlnCQVN5gqx5PQ=h310"
    ],
    "video": "https://www.youtube.com/embed/pF7XCvFOYjw",
    "comments": [
        "Very good designed interface and very useful app, it works like a charm, just 2 suggestions: it would be very helpful if you add adjustable rpm notification , so it would be possible to adjust shifting and a notification for not eco driving, so no need to keep an eye on screen so much. Overheating while black box and sometimes running in background and draining battery is also problem for me too,",
        "Finally a dashcam app that doesn't freeze constantly! Only thing I don't like is that it records speed and other pointless data with the video, with no ability to turn it off. It clutters up the playback screen.",
        "good app but if you need to use it for evidence for your speed or location it's no good. You can't say to judge look at my phone. Needs software for PC.",
        "혹시 녹화 시작음,종료음은 무음으로 바꾸거나 끌수 없나요? 폰 자체 음량은 다 낮춰도 계속 소리가나서 조금 불편합니다 ㅠㅠ",
        "I love the user interface.  Its just that my phone holder keeps my phone on portrait, not landscape.  There is no option to change this.  Guess I'll keep using my other cam app.",
        "Great interface and gages. But choppy video and map does not work.  It would be an awesome app if fixed"
    ],
    "recentChanges": [
        "<Updated features in version 3.2.x>",
        "- Update OBD library",
        "- Add privacy policy"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pokevian.skids&hl=en&gl=us",
    "appId": "com.pokevian.skids"
}