{
    "title": "1800 Contacts - Lens Store",
    "summary": "World&#39;s largest contact lens store",
    "icon": "//lh3.googleusercontent.com/stKEvGYT5ndws7s1frVmS5oKTUug2TxVJxwlD27JkyhkoO9ab13tRFWbcjIFVmKLubw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.7,
    "reviews": 22492,
    "developer": "1-800 CONTACTS",
    "developerId": "1-800+CONTACTS",
    "developerEmail": "mobile.help@1800contacts.com",
    "developerWebsite": "http://www.1800contacts.com",
    "updated": "February 22, 2018",
    "version": "7.0.3",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "description": "The 1-800 CONTACTS app is the fastest, easiest, and most enjoyable way to order contact lenses.Where else can you reorder your contacts in 3 taps?SIMPLE ORDERINGOrdering for the first time? It’s slightly more than 3 taps, but it’s still simple and quick and we’ll walk you through the whole process.YOU HAVE QUESTIONS? WE HAVE ANSWERSIf you ever have any questions you can call, email, or text us right from the app, and you’ll receive a prompt reply from a real, live person.LENS GAUGE FOR EVERYONEPerhaps you aren’t a 1-800 CONTACTS customer yet. It’s OK. We aren’t here to judge. Our Lens Gauge feature can be used by anybody to be reminded when it’s time to swap out their lenses. Because nobody likes itchy red eyes. Nobody.FEATURES GALORE• Scan your contact lens box to upload your prescription – no typing required.• Upload a pic of your paper prescription and we’ll ship your contacts even sooner.• GPS-based search for a local eye doctor.• Import your doc’s information directly from your Contacts.• Scan your credit card with the camera or use PayPal for less tiny-keyboard typing.• Speedy reordering from your secure account.• Track your order from your Order HistoryWANT TO KNOW MORE ABOUT OUR PERMISSIONS?http://www.1800contacts.com/googlepermissions.html",
    "descriptionHTML": "The 1-800 CONTACTS app is the fastest, easiest, and most enjoyable way to order contact lenses.<br><br>Where else can you reorder your contacts in 3 taps?<br><br>SIMPLE ORDERING<br>Ordering for the first time? It&#x2019;s slightly more than 3 taps, but it&#x2019;s still simple and quick and we&#x2019;ll walk you through the whole process.<br><br>YOU HAVE QUESTIONS? WE HAVE ANSWERS<br>If you ever have any questions you can call, email, or text us right from the app, and you&#x2019;ll receive a prompt reply from a real, live person.<br><br>LENS GAUGE FOR EVERYONE<br>Perhaps you aren&#x2019;t a 1-800 CONTACTS customer yet. It&#x2019;s OK. We aren&#x2019;t here to judge. Our Lens Gauge feature can be used by anybody to be reminded when it&#x2019;s time to swap out their lenses. Because nobody likes itchy red eyes. Nobody.<br><br>FEATURES GALORE<br>&#x2022; Scan your contact lens box to upload your prescription &#x2013; no typing required.<br>&#x2022; Upload a pic of your paper prescription and we&#x2019;ll ship your contacts even sooner.<br>&#x2022; GPS-based search for a local eye doctor.<br>&#x2022; Import your doc&#x2019;s information directly from your Contacts.<br>&#x2022; Scan your credit card with the camera or use PayPal for less tiny-keyboard typing.<br>&#x2022; Speedy reordering from your secure account.<br>&#x2022; Track your order from your Order History<br><br>WANT TO KNOW MORE ABOUT OUR PERMISSIONS?<br>http://www.1800contacts.com/googlepermissions.html",
    "histogram": {
        "1": 271,
        "2": 173,
        "3": 504,
        "4": 3374,
        "5": 18170
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/isgaHAnWRGiZGikkQJcAFvl9jze1oMbZAYfY8bL8e-VlgKEZ0UTGqhn_9VEy7W_6FbQ=h310",
        "//lh3.googleusercontent.com/-0oQmCiFFZ1KJB5EaRmXDHHbdxDrZsAkvoMWVV2bK6tDEhrFaZIoZL7qYoyV8gzJjfY=h310",
        "//lh3.googleusercontent.com/Jo47ukvg68-E3_PwN4QEWzjylMQWl2uLr8k0IqSmTh6y5BVlvg8cwqBcyJyj7SbWww=h310",
        "//lh3.googleusercontent.com/XUWdxp7Ry67F3ezPbrM3KheT5efx-C_Ii4PTW8xNKT6GS1scJOzfQQNaA71kDk-xgGDa=h310",
        "//lh3.googleusercontent.com/dfmuRiAm5hZlkOrW1_jMe7Yw_6eV8_JM7OnsvBeoj5dpfgC_XmHkY0Li_XwYeaPy7u4=h310",
        "//lh3.googleusercontent.com/USQe7QHpzt97OJHabh6fcErdKBAUIHSZE7ST_OrUBaOe9jy5PNU2Z1AEhWDHl2eYKaQ=h310",
        "//lh3.googleusercontent.com/CEe9B2R6n39gMAYT66lfjvQKnAKWWgaEkS_hG7Ntyt17dBN6mW_t1XpjwCZQ3p3sO5M=h310",
        "//lh3.googleusercontent.com/6RK1kZxg4Usu2LHWx5F40M6o70pPTRpAbQGjYSZADw5puz81dOUOKMaeZEhbvsBRsJY=h310",
        "//lh3.googleusercontent.com/JqC7eOkiYGgw1poo4aWqzHp5QB4OULjXsrXksiWbiyU3VmiggIHquCvnLaHL8E341kU=h310",
        "//lh3.googleusercontent.com/Z2khA9eOBAG5xnVJVoMyjOypKhAJyn_sga7OlrNAxTXSyvHl44c6Uaw-_op-2fap_yY=h310"
    ],
    "comments": [
        "App doesn't let you delete old RX, addresses, or any basic information that might be outdated. I also have a problem with my RX constantly needing to be verified even if I've already uploaded it and ordered contacts a month ago. So while the process to order is easy there is definitely room for improvement.",
        "The one time I had a small issue with my order, customer service fixed it overnight. I can be difficult to please, but now I'm a customer for life!!",
        "I am extremely surprised at this new updated app the last time I used it I gave it a one-star because the prices were higher the shipping took four times as long and there was no customer service available but so far this time is looking way better prices are down now we'll just see how long it takes to ship the product.",
        "Quick, easy, 1-button press to order new contacts. I have no issues with the app on my Pixel phone.",
        "I knew little to nothing about how to order contacts before downloading.  This app made it very easy to understand how everything works.",
        "Fast, simple to and ive never had any problems getting my contacts in on time."
    ],
    "recentChanges": [
        "Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.contacts1800.ecomapp&hl=en&gl=us",
    "appId": "com.contacts1800.ecomapp"
}