{
    "title": "Lifelog",
    "summary": "Track your activity on Lifelog, the clever health &amp; fitness tool on Android.",
    "icon": "//lh3.googleusercontent.com/r-ZjUMj2jOP5gDYQ_S5DlQogvTxJRZ4P0KbPrmMjQAllPObd_GWG2yjf0N2SSofzO0ka=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.2,
    "reviews": 282459,
    "developer": "Sony Mobile Communications",
    "developerId": "4851747018805076305",
    "developerEmail": "apps@sonymobile.com",
    "developerWebsite": "http://www.sonymobile.com",
    "developerAddress": "Mobilev. 4\n22188 Lund\nSweden",
    "updated": "July 6, 2017",
    "version": "4.0.A.0.14",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Lifelog is the clever activity tracker app for Android that keeps track of what matters to you – like how many steps you take and how much you sleep – with or without a Smartband. You can set personal health goals, follow your progress and get insights into your behavior.Lifelog lets you look back on any day to see how active you were, where you went and how you got there. Log your day every day, in detail.This application uses analytics software to collect and aggregate statistics to help us improve this app and our services. None of this data can be used to identify you.",
    "descriptionHTML": "Lifelog is the clever activity tracker app for Android that keeps track of what matters to you &#x2013; like how many steps you take and how much you sleep &#x2013; with or without a Smartband. You can set personal health goals, follow your progress and get insights into your behavior.<br>Lifelog lets you look back on any day to see how active you were, where you went and how you got there. Log your day every day, in detail.<br><br>This application uses analytics software to collect and aggregate statistics to help us improve this app and our services. None of this data can be used to identify you.",
    "histogram": {
        "1": 13484,
        "2": 10216,
        "3": 31159,
        "4": 86695,
        "5": 140905
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/V_hH4g2WIYwOdNEkLmzZoHzQD0_zi6qPDWNjW0p8qS3LUsATLbF03RIlginTwX9rWMo4=h310",
        "//lh3.googleusercontent.com/hYdnuwPyE3KxKJaBBQ-8EJfC7_hOCil1mp9a8YuDXyOPSSVJJa30X4TLN1hcWagfmQ=h310",
        "//lh3.googleusercontent.com/5ZJ5riaZ9s8B_LauPCXAo3zO6W9srbKSCBIHNE9b8ixK8yOeYfWJGoZQqm29lnb7xQo=h310",
        "//lh3.googleusercontent.com/AwrDRLzb2AcaCjvjufmQVliFgrqKca6zYb0SHoejMs2F_8LQcwWwvDEjx4Lhka5yag=h310",
        "//lh3.googleusercontent.com/SwDtyzFiTgYooCwgQa7PlmccP8LlcTer1-f_XgsxNxdLdtEIsDfOM0a3dtFNzLg5y4oH=h310",
        "//lh3.googleusercontent.com/2fBC4nCDNSJ67Zy_XeL9cQ2p0viVPM4q55p-6Um6JyQEWkbN7DM3b7-I6cF4OOVLZVw=h310",
        "//lh3.googleusercontent.com/7TqgxQJu8hK9GPBGZ2jH0NbM53LfkdL6bFmTqLAsc7M-KtwJv7dm1a3yoFWGfkAccUUP=h310",
        "//lh3.googleusercontent.com/P-oJYUajLNy9EHOUHPt0NjTipSgh-5oTDmRjHDejJlgZYQqCLS7xG7ebZNmpTWNrA_Y=h310",
        "//lh3.googleusercontent.com/HQEIx3tfdysGx8vygEiKGMUWExjIr01s0xTHy7GteXFJEEatgj6r_FbhA8_Ip2Jx5A=h310",
        "//lh3.googleusercontent.com/q7hYZuUtOMitRgGxpnQYKRXHJmDo_rOYR7R6O1q2fcyqAsoxGzrAzjSrLia5kTSal9sA=h310"
    ],
    "comments": [
        "A fun aggregating journal, surprisingly enough this app is not too demanding on battery usage and still remains very functional, an improvement that I would like see implemented would be greater control over the sleeping record. Being able to manually add sleep eg perhaps if taking a short refresh nap would be a great help. The same goes for other events such as when hit phone is not moving or being used, you might be watching TV or on a game consol. Please keep up the good work",
        "Lifelong has a lot of potential. It's a shame it's not got the motion accuracy of others like Shealth and Google fit. The weight tracker could be improved by adding St and lbs rather than just lbs or kg. The sleep detection just detects the time the phone is unused. An eating plan or something where you can record your intake would be a good addition. Overall the app is worth having but the developers could make it so much more.",
        "I agree with Anni Koch, the app has great potential. I have seen some unusual occurrences though. For one, I can walk over 4000 steps but the animation shows that I only walked for a few minutes. So what happened there Sony? If I don't fall asleep until after midnight, that nights sleep doesn't show up on the report....it's like it never happened. Maybe I dreamed it!  I do like the animations and the reports though. That and the ability to add the different apps on the dashboard.  Basically, the app will show the steps you take during the day and isn't bad at others but they could be improved.",
        "Didn't understand that I wasn't home for a few hours though it can see where I am. Should be able to manually log time spent in car/bus. Why can't one log 2 moments of sleep? Never woken up in the middle of the night, unable to fall asleep for an hour or two? Other than that, it's definitely impressive!",
        "I really do love this app. Even when I don't have my SmartBand 2 connected, it's nice to have a comprehensive view of my activities throughout the day. Throw my SmartBand into the mix, and it's even better. It's a shame Sony isn't selling them very much anymore; I had to get mine off Amazon. Regardless, this app is definitely one of the best activity trackers I've ever used, and would recommend it to anyone who is interested in the field.",
        "As others have said, cool app. Love the potential of the animations. However, unless I'm missing some secret controls, it's usefulness is very limited. Especially if you're a person not tied to their phone.   Please, developers,  allow manual entry for all activities and creation of new activities (for instance, exercises besides running & walking.) Provide integration w Fitbit. I'd definitely purchase a full featured app like this."
    ],
    "recentChanges": [
        "Bug fix for application usage logging"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sonymobile.lifelog&hl=en&gl=us",
    "appId": "com.sonymobile.lifelog"
}