{
    "title": "Twilight",
    "summary": "Blue light filter for healthy circadian rhythm - gain one hour of sleep",
    "icon": "//lh3.googleusercontent.com/epcdqdS9mHndyyGKq-vSfLRSFTaszIYAWiVHc7tRFQYRkQIe7ismsiIr3xLjwRy2-sg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.6,
    "reviews": 301424,
    "developer": "Urbandroid Team",
    "developerId": "4728249198844412403",
    "developerEmail": "twilightinfo254@gmail.com",
    "developerWebsite": "http://twilight.urbandroid.org",
    "developerAddress": "Martin Stava\nBächlerstrasse 44\nKilchberg, 8802\nSwitzerland",
    "updated": "December 15, 2017",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Are you having trouble falling asleep? Are your kids hyperactive when playing with the tablet before bed time?Are you using your smart phone or tablet in the late evening? Twilight may be a solution for you!Recent research suggests that exposure to blue light before sleep may distort your natural (circadian) rhythm and cause inability to fall asleep.The cause is the photoreceptor in your eyes, called Melanopsin. This receptor is sensitive to a narrow band of blue light in the 460-480nm range which may suppress Melatonin production - a hormone responsible for your healthy sleep-wake cycles.In experimental scientific studies it has been shown an average person reading on a tablet or smart phone for a couple of hours before bed time may find their sleep delayed by about an hour.The Twilight app makes your device screen adapt to the time of the day. It filters the flux of blue light emitted by your phone or tablet after sunset and protects your eyes with a soft and pleasant red filter. The filter intensity is smoothly adjusted to the sun cycle based on your local sunset and sunrise times.Get more from Twilight1) Bed reading: Twilight is more pleasant on the eyes for night reading. Especially as it is able to lower the screen backlight far below the ability of the backligt controls on your screen2) AMOLED screens: We have tested Twilight on an AMOLED screen for 2.5 years without any sign of depletion or over-burning. If properly configured Twilight causes less light emission (by enabling dimming) with more equal light distribution (dark areas of the screen such as the status bar get tinted). This may in fact increase your AMOLED screen life time.Basics on circadian rhythm and the role of melatoninhttp://en.wikipedia.org/wiki/Melatoninhttp://en.wikipedia.org/wiki/Melanopsinhttp://en.wikipedia.org/wiki/Circadian_rhythmshttp://en.wikipedia.org/wiki/Circadian_rhythm_disorderPermissions- location - to find out your current sunset/surise times- running apps - to stop Twilight in selected apps- write settings - to set back-light- network - access smartlight (Philips HUE) to shield you household light from blueAutomation (Tasker or other)https://sites.google.com/site/twilight4android/automationRelated scientific researchAmplitude Reduction and Phase Shifts of Melatonin, Cortisol and Other Circadian Rhythms after a Gradual Advance of Sleep and Light Exposure in Humans Derk-Jan Dijk, & Co 2012Exposure to Room Light before Bedtime Suppresses Melatonin Onset and Shortens Melatonin Duration in Humans Joshua J. Gooley, Kyle Chamberlain, Kurt A. Smith & Co, 2011Effect of Light on Human Circadian Physiology Jeanne F. Duffy, Charles A. Czeisler 2009Efficacy of a single sequence of intermittent bright light pulses for delaying circadian phase in humans Claude Gronfier, Kenneth P. Wright, & Co 2009Intrinsic period and light intensity determine the phase relationship between melatonin and sleep in humans Kenneth P. Wright, Claude Gronfier & Co 2009The Impact of Sleep Timing and Bright Light Exposure on Attentional Impairment during Night Work Nayantara Santhi, Daniel Aeschbach & Co 2008Short-Wavelength Light Sensitivity of Circadian, Pupillary, and Visual Awareness in Humans Lacking an Outer Retina Farhan H. Zaidi & Co, 2007High sensitivity of the human circadian melatonin rhythm to resetting by short wavelength light. Lockley SW, Brainard GC, Czeisler CA. 2003Sensitivity of the human circadian pacemaker to nocturnal light: melatonin phase resetting and suppression Jamie M Zeitzer, Derk-Jan Dijk & Co 2000For a desktop alternative, try RedShift (Linux) or on Windows the app which has no relation to this project whatsoever, whose name cannot be said aloud or whispered as it is a Trademark, lets call it Lord Voldemort of the blue light flux filtering apps.Guessed it? Let us know in the comments.",
    "descriptionHTML": "Are you having trouble falling asleep? Are your kids hyperactive when playing with the tablet before bed time?<br>Are you using your smart phone or tablet in the late evening? Twilight may be a solution for you!<br><br>Recent research suggests that exposure to blue light before sleep may distort your natural (circadian) rhythm and cause inability to fall asleep.<br><br>The cause is the photoreceptor in your eyes, called Melanopsin. This receptor is sensitive to a narrow band of blue light in the 460-480nm range which may suppress Melatonin production - a hormone responsible for your healthy sleep-wake cycles.<br><br>In experimental scientific studies it has been shown an average person reading on a tablet or smart phone for a couple of hours before bed time may find their sleep delayed by about an hour.<br><br>The Twilight app makes your device screen adapt to the time of the day. It filters the flux of blue light emitted by your phone or tablet after sunset and protects your eyes with a soft and pleasant red filter. The filter intensity is smoothly adjusted to the sun cycle based on your local sunset and sunrise times.<br><br>Get more from Twilight<br>1) Bed reading: Twilight is more pleasant on the eyes for night reading. Especially as it is able to lower the screen backlight far below the ability of the backligt controls on your screen<br><br>2) AMOLED screens: We have tested Twilight on an AMOLED screen for 2.5 years without any sign of depletion or over-burning. If properly configured Twilight causes less light emission (by enabling dimming) with more equal light distribution (dark areas of the screen such as the status bar get tinted). This may in fact increase your AMOLED screen life time.<br><br>Basics on circadian rhythm and the role of melatonin<br>http://en.wikipedia.org/wiki/Melatonin<br>http://en.wikipedia.org/wiki/Melanopsin<br>http://en.wikipedia.org/wiki/Circadian_rhythms<br>http://en.wikipedia.org/wiki/Circadian_rhythm_disorder<br><br>Permissions<br>- location - to find out your current sunset/surise times<br>- running apps - to stop Twilight in selected apps<br>- write settings - to set back-light<br>- network - access smartlight (Philips HUE) to shield you household light from blue<br><br>Automation (Tasker or other)<br>https://sites.google.com/site/twilight4android/automation<br><br>Related scientific research<br><br>Amplitude Reduction and Phase Shifts of Melatonin, Cortisol and Other Circadian Rhythms after a Gradual Advance of Sleep and Light Exposure in Humans Derk-Jan Dijk, &amp; Co 2012<br><br>Exposure to Room Light before Bedtime Suppresses Melatonin Onset and Shortens Melatonin Duration in Humans Joshua J. Gooley, Kyle Chamberlain, Kurt A. Smith &amp; Co, 2011<br><br>Effect of Light on Human Circadian Physiology Jeanne F. Duffy, Charles A. Czeisler 2009<br><br>Efficacy of a single sequence of intermittent bright light pulses for delaying circadian phase in humans Claude Gronfier, Kenneth P. Wright, &amp; Co 2009<br><br>Intrinsic period and light intensity determine the phase relationship between melatonin and sleep in humans Kenneth P. Wright, Claude Gronfier &amp; Co 2009<br><br>The Impact of Sleep Timing and Bright Light Exposure on Attentional Impairment during Night Work Nayantara Santhi, Daniel Aeschbach &amp; Co 2008<br><br>Short-Wavelength Light Sensitivity of Circadian, Pupillary, and Visual Awareness in Humans Lacking an Outer Retina Farhan H. Zaidi &amp; Co, 2007<br><br>High sensitivity of the human circadian melatonin rhythm to resetting by short wavelength light. Lockley SW, Brainard GC, Czeisler CA. 2003<br><br>Sensitivity of the human circadian pacemaker to nocturnal light: melatonin phase resetting and suppression Jamie M Zeitzer, Derk-Jan Dijk &amp; Co 2000<br><br>For a desktop alternative, try RedShift (Linux) or on Windows the app which has no relation to this project whatsoever, whose name cannot be said aloud or whispered as it is a Trademark, lets call it Lord Voldemort of the blue light flux filtering apps.Guessed it? Let us know in the comments.",
    "histogram": {
        "1": 6065,
        "2": 4641,
        "3": 15187,
        "4": 56554,
        "5": 218977
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/3G6OmYex0jfdnxfzPxT1XqBQmpQTITxJuO08njSOVEsqGjfUORimIh0g8VKHgFYb2rE=h310",
        "//lh3.googleusercontent.com/nvFWt-PaD_tXfl3jtia_U3AbdbKEujTVyoyYw28fxCtx9G84DoIv6dCJBmCk0Fogbg=h310",
        "//lh3.googleusercontent.com/S_ajn6w1TfcunbaPB-OF_fa6OURbeSMkqAHj6pK2GC7ImtKhUKtN1Dxghh7FVy4dlajh=h310",
        "//lh3.googleusercontent.com/0Am12jrhtLlhrhgxy9bpqmmLN56SUNdpKyZg5jo5oEMW-NsUDP8rWRLXGuE95832Xa_9=h310",
        "//lh3.googleusercontent.com/83ZUvyMWHmlK0xTrl2wLQaFfRNiG9HHZLeeuqqfEyTEMq8FXHOM7ARQdvVtePYC-iNo=h310",
        "//lh3.googleusercontent.com/ZW7iYhHq0w-4mM-5m-eRxV_YoqmaRes6gf7h8-KalZ3usjeaCzdZiP4_0ztJv4qLA94=h310",
        "//lh3.googleusercontent.com/D8MWfFUWJo2N9eKlq25HC2mPbRTrOSaQ6VGkw2iu46bDCKxPepqg8pBIep1Fww3SoOD0=h310",
        "//lh3.googleusercontent.com/QFcMB8YUEf2HE-eITIW-oUjIzoQOWsFYl6LH5jhpi7sWdoNiCygo5i0Dy3Hqa22L3Q=h310",
        "//lh5.ggpht.com/xM9anXLLfV6Mtqk5bXGokxSIUYcuTAPEI6jMe0t9XIMQRx62GPyND1wNVCCCtwFsmQ=h310",
        "//lh4.ggpht.com/QwPS7UZYie648zGL2HZ54XKkkhWpFpTFdZM--81bTdl75tSdWqIKIbmXHFGHLexE9bSA=h310",
        "//lh3.googleusercontent.com/hiAW3FE0gLbx2Ew8ldacWh8cgD3xXMIJi9fhydSpsuSsD_5-VNbtekcgfAwHXhsuogc=h310",
        "//lh3.googleusercontent.com/kIKwZqGkBuiifwBdXIFoqCxEn8ZcXNrguxMV-HsKJ-qubXMS8fcJZ1w_4g6XejaPTtE=h310",
        "//lh3.ggpht.com/D-Gsy4d_y9i5HDblhcB71b0bHIdYVgboHsXxCncn15zNzyc4WafkOKR652IC8xQqrg=h310",
        "//lh3.googleusercontent.com/qmnAZw7G_thq1ItivPyatA423oxyZSpCqDDo_IukcrEzPjDQEyybqafetcpjroCG734=h310",
        "//lh3.googleusercontent.com/_z0caT5AXkTxvuJInHQrigaCy7GhrTwmVgyWLJfIKfdvTYv42gbbBM9o0l7kbgI5ssw=h310",
        "//lh3.googleusercontent.com/A5G4LBJHEfn9iWT24H3QRzUk9BCZQO4ktn0gmMeMuEXASg62LXJ7YrCRHksoDACWmfM=h310",
        "//lh3.googleusercontent.com/OXQkGrBp6fl2yBlk4TLXae3gF-0RFsPrhJYERfIj7UMYm1-W9M0-FRYdxzB3V5lHJ7ud=h310",
        "//lh3.googleusercontent.com/SOH5VrcXvVQEIvVtLifqZ2pwioech6fmTJthXGGopBkgwIAP5fOaKfSHyTWG0LVFKps=h310",
        "//lh3.googleusercontent.com/N6z_5YomGVfxQj4hb5AvaqWJEngmQuiQk6fTX2dseHd5MVZjEFBVxcjXWycz0LNPOKc=h310"
    ],
    "video": "https://www.youtube.com/embed/Dz-fxVta3QM",
    "comments": [
        "Not even 2 days into it and already can sleep easliy. I usually have my light on full blast on my phone, and have troubles sleeping. This automatically removes that light based on the time of day and helps me sleep much easier. Heck on the first night of use I had an enjoyable dream which may be a coincidence but Holy. Cow. Awesome sleep. Helped me wake up energized and fall asleep easily. I recommend it. Ye.",
        "This app actually does what it says it will do. I've been experiencing a much more restful nights sleep. The only complaint I have, is that the navigation bar on my phone isn't covered. I have a Droid Turbo 2. Other than that, I'm quite happy with this app and I have definitely felt the difference when reading late at night. I have less headaches and wake up feeling more alive than I did perviously. Fantastic app and I recommend it for everyone!",
        "My phone was making it take longer to fall asleep at night, even on a low brightness. But with using this apps settings of 1000k relaxing, intensity 50%, and screen dim 30%; I've noticed a huge difference. I wish I had started using this sooner! We need sleep, and this app actually helps with that (if you usually use your phone at night)",
        "Gave it 5 stars BUT there is a major problem.... Screen Sharpness reduces significantly as long as it's on.. I hope devs would look into it.. Sharpness reduction is not much noticeable untill you start any FPS game.. In FPS games you need high sharpness for higher accuracy.. I have to turn it off during any FPS run.. Other games aren't much affected from this..",
        "This is the best app for screen dimming on Android. You can set a custom schedule if you work a late shift so it won't dim until 2am or 3am.  But the one thing that would make it better, to leave the blacks as dark as possible without reducing the contrast by making black kinds of red, is not something any app on Android can do. Not sure why, but it's a disadvantage of the Android platform.   Twilight does night mode better than any other app I've found, so it's what I'm sticking with.",
        "I thought I'd try this out after reading an article about how evil blue light was robbing us of sleep. It's been a few months and I'm sleeping better than ever. Thank you, Twilight! Also, it's neat that it can be set to turn on according to local sunrise/sunset times. Very helpful."
    ],
    "recentChanges": [
        "8.1",
        "- fix for Android 5.X auto-pause in apps issues",
        "- fix for Chromebooks",
        "8.0",
        "- Black quick settings tile panel with Android 8.1 and home screen filtering enabled",
        "- Because of wallpaper filtering the app may require the storage permission on some phones, but if you are not using this you can revoke the permission after updating",
        "- get rid of Accessibility option for auto-pause in apps as of new Play Store policies (if you are still using this, please re-configure)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.urbandroid.lux&hl=en&gl=us",
    "appId": "com.urbandroid.lux"
}