{
    "title": "Motorola Camera",
    "summary": "A simple and faster way to capture moments.",
    "icon": "//lh5.ggpht.com/_SonJiQvfOVM_gXqk3Y_CZ0yNPBDSrKGNFHgXGwVVpfbl_2KGF0jLIK7xgocvij9W_k=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000000,
    "maxInstalls": 100000000,
    "score": 3.6,
    "reviews": 216566,
    "developer": "Motorola Mobility LLC.",
    "developerId": "Motorola+Mobility+LLC.",
    "developerEmail": "playstor@motorola.com",
    "developerWebsite": "http://www.motorola.com/support",
    "developerAddress": "222 W. Merchandise Mart Plaza, Suite 1800, Chicago, IL 60654",
    "updated": "January 25, 2016",
    "version": "Varies with device",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "size": "Varies with device",
    "description": "Touch anywhere on the screen to take a photo, even while recording video. Hold your finger down to shoot photos continuously. Swipe for quick access to settings like flash, HDR, panorama, and slow-motion. You’ll never take a photo the same way again.",
    "descriptionHTML": "Touch anywhere on the screen to take a photo, even while recording video. Hold your finger down to shoot photos continuously. Swipe for quick access to settings like flash, HDR, panorama, and slow-motion. You&#x2019;ll never take a photo the same way again.",
    "histogram": {
        "1": 46139,
        "2": 14423,
        "3": 21943,
        "4": 35140,
        "5": 98921
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/6jxHRk3NLqh4Z94jZcN-7qOzixSjjjE_6zsDOBz81ihQ-tZLGUMg_1uy36uGxMCVZA=h310",
        "//lh3.googleusercontent.com/s-e5WIehJIwoDit7ZhsJ-inccuEfa5RfsOMBXYLbvJA3rtupHBe8duBHp3E8BUm2kMY=h310",
        "//lh3.googleusercontent.com/YIb6nlT-AysC4OZq7RufXSkyuhYCxsb3hkU8pEaxxx8tBzpLyVPqCSoavVFRE1pj-IM=h310",
        "//lh3.googleusercontent.com/QIpWUj76PDCCtqffxrdKHmLBTMig4lMrRLdkOY4jDZA3wMJTbSLlTfZchTHuL1_nMP0c=h310",
        "//lh5.ggpht.com/lwp3Ga0kUJEYwdMbYrh0wIgNgud24Bzb8SjOYLpBrIDqGOm0kET3U6Qoluz7bbFLXSis=h310",
        "//lh5.ggpht.com/04EaXX0DwI-5mQZ9guu2dukXMUG71X-NSvf03X4N3PYwwa_o7Vbsb7h6o_MBeHYyBA=h310",
        "//lh3.googleusercontent.com/6guLoOqWGnonsaum9w8WY051kAX1kmNmibBD8uvyRRHM1e-NX2-jGV8x_K-LVC0K_Ug=h310"
    ],
    "comments": [
        "Need to add IMPORTANT FEATURE IN THE APP There's a need to add this important feature in the app: The brightness of the screen should not be 'adaptive' when camera app is opened. It should be at full brightness. Because if adaptive brightness is 'on' even when taking photos, it  becomes difficult to see whether the focus is good or not. Sometimes, i noticed that i was not at all able to see what i am capturing when i suddenly enter from dark room to sunlight. So, screen should be at full brightness when app is open. Please add that feature",
        "Love the camera but missing things I love the camera, I have taken pics that I've never been able to in crystal clarity. I wish I could share with you to show you. However I am kinda sad I cannot change settings to polarize or do black and white, maybe even do some effects on it. It's my only disappointment on it. But I love the focus on it so much. I've got this pic at the tulip festival of a bee and you can see the pollen on his legs.",
        "Very poor update.  1. Shutter Sound option has been removed. 2. Picture quality is poor after the update done. 3. Storage location must be customized, not only \"Phone\" and \"SD Card\". It should give more specific option to save the pictures. 4. Auto Flash is not working every time. 5. Quick capture is not working. (Not sure if this problem is happening in my phone only)  It was far better before the update. MOTOROLA please get these issues fixed. I really liked the Camera features and the picture quality when I bought this phone.",
        "Fast and gets the job done. The app might be a bit basic, but it does exactly what you'd expect - takes photos and videos with no hassles. It also has a HDR mode, and slow motion video. If you really want to you can go into the advanced settings and get a lot more specific.",
        "Needs 720p video! Needs file size control Does a pretty good job with everything only problem is the file size. I recorded a video that is 2 min 40 secs and the size is 340MB. So that eats up my hard drive really quick. Same with pics.  Each one is 3-4MB. It'd be great to have the option to lower the quality from 1080p recording to 720p or something smaller. Don't need the best quality all the time. Besides that its pretty good",
        "Loved the improved focussing, but... WOW. Focusing has improved marginally. I can say that now it is at par with iPhone. I simply love it! Now my only concern is the newly added feature, scanning of QR and Bar codes. Please shed some light on how to use it as I didn't find any soft key for this in the app. I unsuccessfully tried to scan a bar an QR code by putting my phone camera in front of the code. Please help."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.motorola.camera&hl=en&gl=us",
    "appId": "com.motorola.camera"
}