{
    "title": "Run with Map My Run",
    "summary": "MapMyRun tracks the route, distance, pace, and more in real-time using GPS.",
    "icon": "//lh3.googleusercontent.com/G-SIsEBm55Iog80cU76-0B41XDE3nQEfJvOBANnUknJScGQmNhHRX0VYH30_GGZVQfA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 173750,
    "developer": "MapMyFitness, Inc.",
    "developerId": "MapMyFitness,+Inc.",
    "developerEmail": "support@mapmyfitness.com",
    "developerWebsite": "http://www.mapmyrun.com",
    "developerAddress": "211 Walter Seaholm Drive\nSuite 200\nAustin, TX 78701",
    "updated": "March 1, 2018",
    "version": "18.2.3",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Track and map every run with MapMyRun and get feedback and stats to improve your performance. Discover the best running routes, save and share your favorites, and get inspired to reach new running goals with a community of over 40 million runners. Whether you’re a beginner looking to log your first mile or a seasoned runner, you’ll find the features and tools you need to stay on track and motivated along the way.- Named one of the 25 best lifestyle Android apps of 2016 by PCMag.- Featured in the NY Times, TechCrunch, Wired, & TIME.- Voted Best Running App Readers' Choice on About.com.TRACK AND MAP YOUR WORKOUTS- Log over 600+ activities with the largest selection of activity types, including: running, cycling, walking, gym workouts, cross training, yoga, and more.- Get audio feedback on every GPS-tracked run, with customizable voice feedback for stats like pace, route, distance, calories, and elevation.- Connect with 400+ devices to import and analyze all your data in one place.- Add your running shoes and track mileage with Gear Tracker. Get notified when it’s time for a new pair and avoid injuries.- Use Routes to find nearby places to run, save your favorite paths, add new ones, and share them with others.CONNECT WITH APPS AND WEARABLES- Track your runs with the Android Wear app and view your progress at a glance.- Let your shoes do the tracking with UA Record Equipped connected shoes that automatically track your runs and sync your data with your MapMyRun app.- Sync your data with the hottest apps and wearables, including Google Fit, Android Wear, Garmin, Fitbit, Jawbone, and more.- Take control of your nutrition by connecting with MyFitnessPal for a comprehensive look at your calorie intake and burn.JOIN THE COMMUNITY- See what your friends are doing on your Activity Feed. Whether just getting into fitness, or competing to win—there’s always someone there to motivate you. - Get social and share your workouts on Facebook and Twitter.- Join Challenges to compete with others, climb the leaderboard, and win awesome prizes.TRAIN LIKE A PRO WITH MVP PREMIUM FEATURES- Become a premium member for an ad-free experience with special features.- Get Training Plans and reach your running goals (e.g., 5K, 10K, Half Marathon, Marathon) with personal training plans that adapt dynamically to your fitness level as you improve. - Monitor & analyze your Heart Rate zones to adjust your training based on your goal.- Set a target for your run and stay on track with audio coach updates, including pace, distance, duration, calories & more.- Use Live Tracking to share your real-time running location and give loved ones peace of mind.- Access additional premium features on MapMyRun.com.If you upgrade to a premium MVP subscription, payment will be charged to your Google Play account at confirmation of purchase. The monthly subscription costs USD 5.99 per month, while the yearly subscription costs USD 29.99 per year, or USD 2.50 per month. Your subscription renews automatically unless canceled at least 24 hours prior to the end of the current period. There is no increase in cost when renewing.Subscriptions can be managed and auto-renewal turned off in Account Settings under ‘Subscriptions’ in the Google Play Store after purchase. Once purchased, the current period cannot be canceled. Any unused portion of a free trial period is forfeited if you choose to purchase a premium subscription to MVP.Find the full terms and conditions and our privacy policy at https://account.underarmour.com/privacy_and_terms. Note: Continued use of GPS running in the background can dramatically decrease battery life.MapMyRun is part of the world’s largest digital health & fitness community, Under Armour Connected Fitness, which includes UA Record, MapMyFitness, Endomondo, & MyFitnessPal. These apps were built to empower healthy and active lifestyles with one mission – to make you better.",
    "descriptionHTML": "Track and map every run with MapMyRun and get feedback and stats to improve your performance. Discover the best running routes, save and share your favorites, and get inspired to reach new running goals with a community of over 40 million runners. Whether you&#x2019;re a beginner looking to log your first mile or a seasoned runner, you&#x2019;ll find the features and tools you need to stay on track and motivated along the way.<br><br>- Named one of the 25 best lifestyle Android apps of 2016 by PCMag.<br>- Featured in the NY Times, TechCrunch, Wired, &amp; TIME.<br>- Voted Best Running App Readers&apos; Choice on About.com.<br><br>TRACK AND MAP YOUR WORKOUTS<br>- Log over 600+ activities with the largest selection of activity types, including: running, cycling, walking, gym workouts, cross training, yoga, and more.<br>- Get audio feedback on every GPS-tracked run, with customizable voice feedback for stats like pace, route, distance, calories, and elevation.<br>- Connect with 400+ devices to import and analyze all your data in one place.<br>- Add your running shoes and track mileage with Gear Tracker. Get notified when it&#x2019;s time for a new pair and avoid injuries.<br>- Use Routes to find nearby places to run, save your favorite paths, add new ones, and share them with others.<br><br>CONNECT WITH APPS AND WEARABLES<br>- Track your runs with the Android Wear app and view your progress at a glance.<br>- Let your shoes do the tracking with UA Record Equipped connected shoes that automatically track your runs and sync your data with your MapMyRun app.<br>- Sync your data with the hottest apps and wearables, including Google Fit, Android Wear, Garmin, Fitbit, Jawbone, and more.<br>- Take control of your nutrition by connecting with MyFitnessPal for a comprehensive look at your calorie intake and burn.<br><br>JOIN THE COMMUNITY<br>- See what your friends are doing on your Activity Feed. Whether just getting into fitness, or competing to win&#x2014;there&#x2019;s always someone there to motivate you. <br>- Get social and share your workouts on Facebook and Twitter.<br>- Join Challenges to compete with others, climb the leaderboard, and win awesome prizes.<br><br>TRAIN LIKE A PRO WITH MVP PREMIUM FEATURES<br>- Become a premium member for an ad-free experience with special features.<br>- Get Training Plans and reach your running goals (e.g., 5K, 10K, Half Marathon, Marathon) with personal training plans that adapt dynamically to your fitness level as you improve. <br>- Monitor &amp; analyze your Heart Rate zones to adjust your training based on your goal.<br>- Set a target for your run and stay on track with audio coach updates, including pace, distance, duration, calories &amp; more.<br>- Use Live Tracking to share your real-time running location and give loved ones peace of mind.<br>- Access additional premium features on MapMyRun.com.<br><br>If you upgrade to a premium MVP subscription, payment will be charged to your Google Play account at confirmation of purchase. The monthly subscription costs USD 5.99 per month, while the yearly subscription costs USD 29.99 per year, or USD 2.50 per month. Your subscription renews automatically unless canceled at least 24 hours prior to the end of the current period. There is no increase in cost when renewing.<br><br>Subscriptions can be managed and auto-renewal turned off in Account Settings under &#x2018;Subscriptions&#x2019; in the Google Play Store after purchase. Once purchased, the current period cannot be canceled. Any unused portion of a free trial period is forfeited if you choose to purchase a premium subscription to MVP.<br><br>Find the full terms and conditions and our privacy policy at https://account.underarmour.com/privacy_and_terms. <br><br>Note: Continued use of GPS running in the background can dramatically decrease battery life.<br><br>MapMyRun is part of the world&#x2019;s largest digital health &amp; fitness community, Under Armour Connected Fitness, which includes UA Record, MapMyFitness, Endomondo, &amp; MyFitnessPal. These apps were built to empower healthy and active lifestyles with one mission &#x2013; to make you better.",
    "histogram": {
        "1": 4422,
        "2": 2252,
        "3": 6251,
        "4": 44756,
        "5": 116069
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/7QVDo_Wnq0T4GjDlcnJsaHqmJI3PU2R9iJIkBjEWQV1y3BTU5NJNm2ZZ55HCTB_TnJI=h310",
        "//lh3.googleusercontent.com/GNgZ3iT3VxVVL0-3tmM3dQ6-P04Fsd9SL9A1KmGcs0psmB4p0px-MkVOiXOUs-pqV2M=h310",
        "//lh3.googleusercontent.com/fHGqw0XyebArG1bSIsb5CKAgbsg0AKlLjN4-qFErZaReDYnlm6yjk_MoyD64KUgMoRfY=h310",
        "//lh3.googleusercontent.com/or83qT_6m2MUw_mDxUvEM6U9lNZGR0dUqJgXKe5r1G270s_DAJS3McSU0wWo-84qMA8=h310",
        "//lh3.googleusercontent.com/e77quHAGn_xqQgDCsMZjxBJJlt5Kq1Jvj3gHU1zDbcm9Kb1h61kzuKJDEr30VMH71A=h310"
    ],
    "comments": [
        "Whats the point of tracking your runs if you can't put in your time by the seconds. How am I supposed to pr or track any progress. I'm hating the update that got rid of inputting seconds.",
        "Great app for me!!! Love it",
        "Worked well for me.",
        "Love it",
        "Needs work. Takes forever to sync with other UA apps, including MyFitnessPal, on my phine, and their sister apps on my SGear. UA makes billions in gear sales, invest more into the foundations. I'm not buying \"smart shoes\" if the app takes an hour to sync with them.",
        "Was using it on previous phone with no issues..  Download it on my new phone and the mapping was horrible..  After the first try with it, app shows 0.12km in 14 mins. 2nd run was 0.18 in 12mins... Going over to other apps..."
    ],
    "recentChanges": [
        "* You spoke, we listened. The feed now defaults to the last tab you visited (Community, Friends, Me).",
        "* New ordering of items in the More menu.",
        "Under Armour Connected Footwear Users:",
        "* Receive periodic personalized coaching tips on the workout details page of runs completed with the latest Connected Footwear shoes with HOVR.",
        "* Only workouts > 2 minutes sync from your shoes to prevent unintended workouts.",
        "* Workouts synced from your shoes will now use your default workout privacy setting."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mapmyrun.android2&hl=en&gl=us",
    "appId": "com.mapmyrun.android2"
}