{
    "title": "ZenWatch Remote Camera",
    "summary": "Remotely control your smartphone’s camera with ASUS ZenWatch.",
    "icon": "//lh3.googleusercontent.com/pk0Xj0PR9eSfwePrexseIeSWPEMHJ1B8aKGJ-0_oBkRQA_nMEz_ahF_d-4tMsxR9BA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 1518,
    "developer": "ZenWatch, ASUSTeK Computer Inc.",
    "developerId": "6794897890411822139",
    "developerEmail": "zenui@asus.com",
    "developerWebsite": "http://www.asus.com/zenwatch",
    "developerAddress": "NO. 400, Sec. 7, Chende Rd., Beitou Dist., Taipei 112, Taiwan",
    "updated": "December 15, 2016",
    "version": "1.0.0.161207",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "description": "ZenWatch Remote Camera is a companion app for your ASUS ZenWatch that turns it into a remote control for the camera on your smartphone or tablet. Remote Camera opens up new photographic opportunities by displaying your smartphone's camera viewfinder remotely on ZenWatch, freeing you to take photos from creative angles where the viewfinder would be difficult to see, such as when holding the phone overhead at a concert or other crowded event. Remote Camera is also useful for group photos, letting you compose the photo, release the shutter, and check the final result while being included in the shot.[Reviews]ASUS ZenWatch: A Fancy Smartwatch That Measures Your Relaxation Levelshttp://mashable.com/2014/09/03/asus-zenwatch/ ASUS' stylish ZenWatch is all about security, remote control and wellnesshttp://www.engadget.com/2014/09/03/asus-zenwatch-android-wear-specs/[Key features]With ZenWatch Remote Camera, you can:•\tOperate your smartphone’s camera from your ZenWatch •\tSee the camera viewfinder remotely on your ZenWatch •\tTake single photos, optionally with location info•\tRecord videos•\tZoom in and out•\tStart the camera’s self-timer•\tMove your wrist (or shake the ZenWatch) to release the camera shutter.[Tips]•\tIn ZenWatch Remote Camera, tap anywhere on the preview screen on the watch, or twist your wrist to take shot.[Note]ZenWatch Remote Camera is only compatible with ASUS ZenWatch smart watches.[Contact us]ZenWatch Remote Camera is designed by ASUS ZenUI. More information about ASUS ZenUI is available here:Web: http://www.asus.com/ASUS_ZenUI/Email: zenui@asus.com",
    "descriptionHTML": "ZenWatch Remote Camera is a companion app for your ASUS ZenWatch that turns it into a remote control for the camera on your smartphone or tablet. <br><br>Remote Camera opens up new photographic opportunities by displaying your smartphone&apos;s camera viewfinder remotely on ZenWatch, freeing you to take photos from creative angles where the viewfinder would be difficult to see, such as when holding the phone overhead at a concert or other crowded event. Remote Camera is also useful for group photos, letting you compose the photo, release the shutter, and check the final result while being included in the shot.<br><br><b>[Reviews]</b><br>ASUS ZenWatch: A Fancy Smartwatch That Measures Your Relaxation Levels<br>http://mashable.com/2014/09/03/asus-zenwatch/ <br>ASUS&apos; stylish ZenWatch is all about security, remote control and wellness<br>http://www.engadget.com/2014/09/03/asus-zenwatch-android-wear-specs/<br><br><b>[Key features]</b><br>With ZenWatch Remote Camera, you can:<br>&#x2022;\tOperate your smartphone&#x2019;s camera from your ZenWatch <br>&#x2022;\tSee the camera viewfinder remotely on your ZenWatch <br>&#x2022;\tTake single photos, optionally with location info<br>&#x2022;\tRecord videos<br>&#x2022;\tZoom in and out<br>&#x2022;\tStart the camera&#x2019;s self-timer<br>&#x2022;\tMove your wrist (or shake the ZenWatch) to release the camera shutter.<br><br><b>[Tips]</b><br>&#x2022;\tIn ZenWatch Remote Camera, tap anywhere on the preview screen on the watch, or twist your wrist to take shot.<br><br><b>[Note]</b><br>ZenWatch Remote Camera is only compatible with ASUS ZenWatch smart watches.<br><br><b>[Contact us]</b><br>ZenWatch Remote Camera is designed by ASUS ZenUI. <br>More information about ASUS ZenUI is available here:<br>Web: http://www.asus.com/ASUS_ZenUI/<br>Email: zenui@asus.com",
    "histogram": {
        "1": 193,
        "2": 52,
        "3": 94,
        "4": 260,
        "5": 919
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/aViW0VzOmnfBF_rDWGQ3g_vs2sfH1y1r0MG2D-DId42JOrqhb7_xmqMWCHb3nmvtGg=h310",
        "//lh6.ggpht.com/K3GHPnSLt1x8ooeIJOg3ue5H4Ku3BFeV6fEUbFWMRSq9gzsL2iq8hutzH-koCm5ZBRA=h310",
        "//lh5.ggpht.com/TTAAt0TUZRfEZ6xj7nlRKYNILHTGSKXQeXgBbU88BRfpW4s6uh_1paNyYrcLC2KQRyU=h310",
        "//lh6.ggpht.com/M3kJZBHv4BW0l2SAWVjIvsKX3THnaDuyj77nq1CV5ynNkmngHzW5fui_dNzhlAqGlSA=h310",
        "//lh4.ggpht.com/1qsIshnERh7MYso1pOx7CZEDzSr2nrHH44mN5Bs8-JyKlx8L6HStS_fFxUhIdylaD5Y=h310",
        "//lh4.ggpht.com/r3CxgtZuHEhsQ9MiIz2_jKUNgqi7ButPP1-Fp4qIyI5yr4POt_LZaqUhFYJDpcArxoQ=h310"
    ],
    "comments": [
        "Doesn't work Fails on my idol 3 paired with a zw2. I'm guessing it's not meant for non asus phones? I haven't been able to get any of the free remote camera apps to work, which sucks because it's one of the features I was really looking forward to in a smart watch.",
        "I was unhappy for the android wear updare 1.5 to 2.0 on my new asus zenwatch 3 after i bought it for 5day. Now after the update some of the features like ZenWatch manager, zenwatch remote & facedesign cannot be install to the watch. Cannot copy google account to watch, therefore play store on watch doesn't work. Eventhought google play music doesn't exit anymore on the watch. New gorgeous watch because an update felt like less features..... Pls fix this matter asap.  If not the watch not worthy for me any more. Fed up with this problem.",
        "Does not work on Pixel phone. All pictures come out black. Reinstalling didn't fix the problem. I allowed all requests for access.  Too bad - It used to work really well on an older phone.",
        "Used to work but after the update. It's no good. Im using a s7 edge +",
        "Does not start, saying it can't find the watch. But the watch is connected to the phone and works otherwise. Help.",
        "Used to work fine... now crashes with my Zenwatch 3... really embarrassing and worthless.. fix it ASAP"
    ],
    "recentChanges": [
        "↑ ★ ★ ★ ★ ★ ↑",
        "Like this app? Keep us inspired by giving a 5-star rating!",
        "V1.0.0.161207",
        "1. Performance improvements and bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.asus.rcamera2&hl=en&gl=us",
    "appId": "com.asus.rcamera2"
}