{
    "title": "hovernote",
    "summary": "hovernote is a floating notepad app that enables true multitasking on Android.",
    "icon": "//lh3.ggpht.com/bF4zcg1Jeqjp7p2SWY__KfdfGaCq79XeOuYQ91WHQR2T2nGWo90K6_0YKsSdqQfu-A=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.5,
    "reviews": 1138,
    "developer": "mjlim",
    "developerId": "mjlim",
    "developerEmail": "hovernote@mjlim.net",
    "developerWebsite": "http://mjlim.net",
    "updated": "January 9, 2015",
    "version": "3.0",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "hovernote is a floating notepad app that lets you write text notes on top of other apps without having to switch out of them. hovernote lets you experience true multitasking on your Android device-- you can have a note open while using your browser, messaging app, pdf viewer, or any other app. The app can read and write .txt files on your device, features zero-effort autosaving capabilities that Just Work, and can Share notes to other apps. Dropbox Sync support is in beta.★★★ Feature List ★★★• Floats over other apps, allowing true multitasking• Several different themes that you can assign to individual notes or as a default• Share notes with other applications, such as Dropbox, Evernote, or whatever else you use. hovernote works with the apps you already have.• Autosave keeps track of all of the notes you write in the Recent Notes list• Select and edit text using the Edit Toolbar• Reading and writing to .txt files on your device• Reading and writing to .txt files synced with a Dropbox App Folder (BETA)• Can have an unlimited number of notes open simultaneously• Android Wear support: create quick notes with your watch using either voice input or a tiny keyboard• Configuration Options:‣ Whether to keep a persistent notification after closing all of the notes, to quickly open a new note‣ Whether to autosave a .txt file note‣ Whether to hide the window controls when switching away from a note, to save screen space‣ Window Transparency‣ Font style and size‣ Whether to automatically show the keyboard when you focus a note window★★★ Suggestions, Bug Reports, etc? ★★★If you have any questions please send me an email: hovernote@mjlim.net. Emails responded to on a best-effort basis.I work on hovernote (sometimes) in my spare time. Development is typically slow.The app is now free due to the new requirement for me to have my physical address on the app store page if I want to continue selling it.",
    "descriptionHTML": "hovernote is a floating notepad app that lets you write text notes on top of other apps without having to switch out of them. hovernote lets you experience true multitasking on your Android device-- you can have a note open while using your browser, messaging app, pdf viewer, or any other app. The app can read and write .txt files on your device, features zero-effort autosaving capabilities that Just Work, and can Share notes to other apps. Dropbox Sync support is in beta.<br><br>&#x2605;&#x2605;&#x2605; Feature List &#x2605;&#x2605;&#x2605;<br>&#x2022; Floats over other apps, allowing true multitasking<br>&#x2022; Several different themes that you can assign to individual notes or as a default<br>&#x2022; Share notes with other applications, such as Dropbox, Evernote, or whatever else you use. hovernote works with the apps you already have.<br>&#x2022; Autosave keeps track of all of the notes you write in the Recent Notes list<br>&#x2022; Select and edit text using the Edit Toolbar<br>&#x2022; Reading and writing to .txt files on your device<br>&#x2022; Reading and writing to .txt files synced with a Dropbox App Folder (BETA)<br>&#x2022; Can have an unlimited number of notes open simultaneously<br>&#x2022; Android Wear support: create quick notes with your watch using either voice input or a tiny keyboard<br><br>&#x2022; Configuration Options:<br>&#x2023; Whether to keep a persistent notification after closing all of the notes, to quickly open a new note<br>&#x2023; Whether to autosave a .txt file note<br>&#x2023; Whether to hide the window controls when switching away from a note, to save screen space<br>&#x2023; Window Transparency<br>&#x2023; Font style and size<br>&#x2023; Whether to automatically show the keyboard when you focus a note window<br><br>&#x2605;&#x2605;&#x2605; Suggestions, Bug Reports, etc? &#x2605;&#x2605;&#x2605;<br>If you have any questions please send me an email: hovernote@mjlim.net. Emails responded to on a best-effort basis.<br>I work on hovernote (sometimes) in my spare time. Development is typically slow.<br>The app is now free due to the new requirement for me to have my physical address on the app store page if I want to continue selling it.",
    "histogram": {
        "1": 43,
        "2": 25,
        "3": 65,
        "4": 218,
        "5": 787
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/dxYvzelFh_3nMjsc3-8bYunRMvBlmA6bT_5FOiFjE5p3NFTJ9s1x4Q8CZVLruXuGeQ=h310",
        "//lh4.ggpht.com/al5zIqna7aB56_SQEpzSvRvCmuEK5MK6NF-C9e9IcxyAQVwQLJu_ju1bBeHbIdNwtT0=h310",
        "//lh4.ggpht.com/tCCjKfCNLA-YFNvIz4Z6Q6NPXbEQNephRaRjSKHg-aUUZ6Tn-EQ2GGV6JZZmcJp3mYFJ=h310",
        "//lh4.ggpht.com/RUcoz1dEgvX1a2LFvcQSQXqNes9LA_baZx7Z9oP3Uxht4GWwiMtF7ZfEH_ZGhwfoMy4b=h310",
        "//lh3.ggpht.com/RtZHzQPRwEL4XKUVqyt7wfIQYwPYUNNhRj7y_n-mIfWOlB69WdkXnrZthcwFE5EkEfb6=h310",
        "//lh5.ggpht.com/w7TiAZ_FkBTPMLm1WV_Po_5-SkcQkmu9GohRZI1rGnRtQSl1N_8ppEvjYH67TWoFY936=h310",
        "//lh3.ggpht.com/mk_uV9c4vky9Gr26x6hamg2p4vwci135EgRhCCHJJPWUtNciOkBrcrOztNiJhcLHBk8=h310",
        "//lh6.ggpht.com/L8NkIs-mqAZBz9cECl0HxGvmXKOeHDaMB8qyHBSiD9HGK-RWHXX_By__jR-mbQEK_cc=h310",
        "//lh6.ggpht.com/vkYhrKofG4IOpnU_fePhpONw7hoZpMal7UilS78_Z_OsjvQBEWtR6cw2_POP46X3bJlh=h310",
        "//lh6.ggpht.com/MObiOr7QgCscJzevX8eZmx2Dht91dCSAi2rWoRoOv2xCbZWv7P6e8KwrVlvNMKvFGwY=h310",
        "//lh4.ggpht.com/Zv1bNVLR0IB9hlZPkKW8JMilTmzSIplLGjVCz3OYuWl4mPGZ-o0t_8HWZhsHhhXuxcE=h310",
        "//lh5.ggpht.com/QRsHvUFqb8xaXmMatuzubaz5uOLRENrZgqZvdBL3FTEbyQ6IC4IDNAvrXyeSTq8dII4=h310"
    ],
    "comments": [
        "The best damn note taking app imho. I can easily assign an always showing shortcut on the screen to open this app, if you are on the keyboard I can  use the pause function on the keyboard for a video lecture whilst simulatenously typing on the notepad. You can also open multiple notes, use keyboard shortcuts, automatically save. The only thing I want added is universal cloud access to the notes on multiple systems like google keep. This app is closely similar to one other app I know of, but this one has better features. Thank you so much developer, I'm going to check out your apps, if there are any. This is helping me with my lecture viewing alot. Thank you.",
        "I love this app. It is so helpful because I'm always forgetting some thing. With this app you can have a reminder of what you need to get done right on your screen. And I use my tablet on a daily basis. Plus you can choose your own theme. The only thing I don't like, is that you can't create your own theme. Please make this an option, and I will put to 5 ❇",
        "Really cool idea and useful Love that its free and no ads, very functional allos multitasking.  Complaint though, on my slide kb if I type the number 2 it closes immediately and doesn't save or anything just vanishes (not even to notification bar).",
        "Great App, Logo Could Use Work The app itself is really nice. The logo and icon could use some work. Especially the icon when you minimize it. It doesn't feel modern, or look that amazing on my phone screen. I had removed the app for a while, but no app works as well as this one. So I guess I'll live with it for now.",
        "Instant multitasking done well Very solid note app with seamless and customizable floating window. Yes it doesn't have many themes, but it works very well with no compatibility issues at all. Features I'd like to see would be a word count and spell checker function and I would love to pay for them.",
        "One of the best apps. in the store Just wanted to thank you again for your  Outstanding  app.  It's the best floating text out-there. I use it in conjunction with metamoji,  freenote and journal binder and these are the bread- and- butter of my editing work. I would struggle to function without  them."
    ],
    "recentChanges": [
        "Full changelogs at http://mjlim.net",
        "3.0",
        "* Theme selector",
        "* Scrapped the theme introduced in 2.1 for a much more flexible and better looking theme engine.",
        "* Replaced all of the icons",
        "* Add a setting to enable/disable automatic keyboard on window focus",
        "* An assortment of small bugfixes",
        "* (BETA) Android Wear support: Create notes with your watch using either your voice or a tiny keyboard."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mjlim.hovernote&hl=en&gl=us",
    "appId": "com.mjlim.hovernote"
}