{
    "title": "Scotiabank Mobile Banking",
    "summary": "Scotiabank® Mobile Banking. Everyday banking. Everywhere you go.",
    "icon": "//lh3.ggpht.com/GZXkzHxbRYGnehTg0ehjslPj4ummxV-oQklcE1Ba7hmq4zvBKfy2bR7zWEMOWqlcK6k=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.5,
    "reviews": 19737,
    "developer": "Scotiabank",
    "developerId": "Scotiabank",
    "developerEmail": "mobile.banking@scotiabank.com",
    "developerWebsite": "http://www.scotiabank.com/mobilebanking/",
    "updated": "February 5, 2018",
    "version": "18.1.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "The Scotiabank Mobile Banking app makes it easy to manage your accounts, make payments, transfer funds, and more, all from your Android device.BANK WHEN YOU WANT, HOW YOU WANT• Deposit CAD and USD cheques in minutes using Mobile Deposit• Stay on top of your account activity with Scotia InfoAlerts.• Add eligible Scotiabank debit and credit cards to My Mobile Wallet for fast, secure payments.• Pay on-the-go with Android PayTM and eligible Scotiabank debit, credit, or prepaid cards.• Digitize and store paper receipts with eReceipts and sync them with your transaction history.• Set up travel notifications to avoid disruptions and protect your accounts while you’re away.•Send money to anyone, anywhere with Interac e-Transfers in Canada and Western Union Money Transfers around the world.IMPORTANT DISCLOSURES• By pressing the button, downloading the Scotiabank mobile banking app published by The Bank of Nova Scotia, or setting up your device to do so automatically, you consent to the installation of this app, its future updates and upgrades. You can withdraw your consent at any time by deleting the app.• If you enable Location services for our app, we’ll use this information to provide you with maps of services available in your area.• If you enable Travel Reminders, we will note the last country where you used our app and remind you to create a credit card travel notification when you change locations.• If you enable Contacts, we’ll use this information to populate e-Transfer recipient information.• If you enable eReceipts, we’ll require access to your camera.• When you use Scotiabank’s Mobile Deposit feature, we will access your device camera to take a picture of your cheque; record the cheque number, account number, institution transit number, and amount; record your device model, as well as its OS version and manufacturer.• When you use Scotiabank’s My Mobile Wallet, Scotiabank accesses the following mobile device functions or feature for the purpose of storing your credit card information and making payments : send and receive a text, instant message or push notification to assist with set up; prevent the processor from falling asleep while a transaction is being processed; access NFC chip; read and store IMEI (International Mobile Station Equipment Identify) number, device phone number, model, and country code; access SIM data; trigger NFC transactions.When you download or update this app or when you apply for, enroll in or use a Service via mobile banking, we may collect information about your computer or device, operating system, internet connection or telephone account, settings, IP address and device locational data, and transaction data, as well as personal information. We may collect, use, disclose and retain this information as set out in the Scotiabank Privacy Agreement ( http://www.scotiabank.com/ca/en/0,,351,00.html) and to determine which settings are appropriate for your computer system, to provide or enhance digital functionality and banking options, and for security purposes, internal analysis and reporting. You may withhold consent to the collection, use and disclosure of this information, although this may prevent you from using the digital channel to apply for or use a Service, to communicate with us, or may reduce the functionality of that channel.Contact us at 1-800-472-6842 (Canada/USA) or at +14162883899 if you need support, or help uninstalling our app.The Bank of Nova Scotia 44 King St West Toronto ON M5H 1H1mobile.banking@scotiabank.com",
    "descriptionHTML": "The Scotiabank Mobile Banking app makes it easy to manage your accounts, make payments, transfer funds, and more, all from your Android device.<br><br>BANK WHEN YOU WANT, HOW YOU WANT<br>&#x2022; Deposit CAD and USD cheques in minutes using Mobile Deposit<br>&#x2022; Stay on top of your account activity with Scotia InfoAlerts.<br>&#x2022; Add eligible Scotiabank debit and credit cards to My Mobile Wallet for fast, secure payments.<br>&#x2022; Pay on-the-go with Android PayTM&#xA0;and eligible Scotiabank debit, credit, or prepaid cards.<br>&#x2022; Digitize and store paper receipts with eReceipts and sync them with your transaction history.<br>&#x2022; Set up travel notifications to avoid disruptions and protect your accounts while you&#x2019;re away.<br>&#x2022;Send money to anyone, anywhere with Interac e-Transfers in Canada and Western Union Money Transfers around the world.<br><br>IMPORTANT DISCLOSURES<br>&#x2022; By pressing the button, downloading the Scotiabank mobile banking app published by The Bank of Nova Scotia, or setting up your device to do so automatically, you consent to the installation of this app, its future updates and upgrades. You can withdraw your consent at any time by deleting the app.<br>&#x2022; If you enable Location services for our app, we&#x2019;ll use this information to provide you with maps of services available in your area.<br>&#x2022; If you enable Travel Reminders, we will note the last country where you used our app and remind you to create a credit card travel notification when you change locations.<br>&#x2022; If you enable Contacts, we&#x2019;ll use this information to populate e-Transfer recipient information.<br>&#x2022; If you enable eReceipts, we&#x2019;ll require access to your camera.<br>&#x2022; When you use Scotiabank&#x2019;s Mobile Deposit feature, we will access your device camera to take a picture of your cheque; record the cheque number, account number, institution transit number, and amount; record your device model, as well as its OS version and manufacturer.<br>&#x2022; When you use Scotiabank&#x2019;s My Mobile Wallet, Scotiabank accesses the following mobile device functions or feature for the purpose of storing your credit card information and making payments : send and receive a text, instant message or push notification to assist with set up; prevent the processor from falling asleep while a transaction is being processed; access NFC chip; read and store IMEI (International Mobile Station Equipment Identify) number, device phone number, model, and country code; access SIM data; trigger NFC transactions.<br><br>When you download or update this app or when you apply for, enroll in or use a Service via mobile banking, we may collect information about your computer or device, operating system, internet connection or telephone account, settings, IP address and device locational data, and transaction data, as well as personal information. We may collect, use, disclose and retain this information as set out in the Scotiabank Privacy Agreement ( http://www.scotiabank.com/ca/en/0,,351,00.html) and to determine which settings are appropriate for your computer system, to provide or enhance digital functionality and banking options, and for security purposes, internal analysis and reporting. You may withhold consent to the collection, use and disclosure of this information, although this may prevent you from using the digital channel to apply for or use a Service, to communicate with us, or may reduce the functionality of that channel.<br><br>Contact us at 1-800-472-6842 (Canada/USA) or at +14162883899 if you need support, or help uninstalling our app.<br><br>The Bank of Nova Scotia 44 King St West Toronto ON M5H 1H1<br>mobile.banking@scotiabank.com",
    "histogram": {
        "1": 4337,
        "2": 1588,
        "3": 1883,
        "4": 3702,
        "5": 8227
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/WPhQKNqfaFrWj2AhVFnxu1cqTpSaKJdP0ZfwX6MTs5V0e9-_YJRb1KFjn3pwop8WCtc=h310",
        "//lh3.googleusercontent.com/Sy5rtqkx1WQvhfDteWZjSWg3KhK5MjtVxoTcpnsi0Hsc-LroAFZAaVv-JYc5qd81=h310",
        "//lh3.googleusercontent.com/hNzWRkAtE1oAPh-rtwdZ5Xy61M4gh2W7y24bodMw2uWEbKDjH-ODk4zUaQIwo4ApXCM=h310",
        "//lh3.googleusercontent.com/1-1DQOTkOUKPS6RuMZSSCguY-0pZ2EitWoc0Sv1BWPKT6ZmubtRte_ilqhjkXNd4FpI=h310",
        "//lh3.googleusercontent.com/ffUt7XLhrzwSJK7olCw8B6YSyKAMKSXUPsjq4Es2AzGVEsTGbgsVDs8oo172mLF1ezwX=h310",
        "//lh6.ggpht.com/Eoqnz9Dxq31E4t4YiT4MHYC5IHOWjS53GgsLaA0lFNWXhZpz4PjNnznN3c2DDAnfSg=h310",
        "//lh4.ggpht.com/6OOxHXweJd_Z3yaEpn3Ls-dckE0Ns0MgYq81Qtp2Iv7Ve0pyfN_EOeQVsSxXlrOYXQ=h310",
        "//lh6.ggpht.com/IlX8QC72_41L3vnwdtWJOBsGJVb9lwMiBRl0K662SYd3mmwioY-s7xoDYi8EmsFx_A=h310"
    ],
    "comments": [
        "I just recently moved from Apple to Samsung and I have to say hands down the iPhone version of this app is far superior, hopefully they get the bugs worked out soon as I really enjoyed the iPhone version.  Update... I cannot get this app to work at all. It says to hold near the reader and does a countdown of 10 seconds but the debit machines just double beep and tell me its not supported. Happily I have 15 days to return this S8+ , I've tapping my iPhone for years with never a problem :/",
        "It's my bank and therefore use the app regularly, but it needs tweaking. Most banks have fingerprint authentication (a must today) The login has a glitch where if you input the password wrong, putting the right password won't work and you have to reset the app. Needs work, especially considering this is a big bank.",
        "-The app told me to refresh a card in my mobile wallet but I am unable to remove it. -The login screen always refreshes a few seconds after opening and it messes up the password I'm trying to input. -Fingerprint login as an option would be great.",
        "Crashes continuously. Can't do anything without it going down. Cannot get out of services screen. You can take check pictures forever and it keeps asking to repeat. I have yet to get anything to work on this app.",
        "Mobile wallet worked once. Never again. I set up all my cards in the wallet and verified them etc. One card worked one time. The feature has never worked again. When I click the card it just begins the countdown and says to tap it. Nothing happens. The machines are never able to read it.",
        "UI is outdated. It's a little slow performance-wise. Functionally, I guess it works. Just enough to get by but it is definitely lacking compared to using web login."
    ],
    "recentChanges": [
        "This release includes the following bug fixes:",
        "* Fix Terms and Conditions not displaying",
        "* Error message issue for CAD & USD Prepaid Visa",
        "* E-statement fix",
        "* Account Details - swipe fix",
        "* Fixes addressing previous crashes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.scotiabank.mobile&hl=en&gl=us",
    "appId": "com.scotiabank.mobile"
}