{
    "title": "FLIR ONE",
    "summary": "FLIR ONE app with the FLIR ONE accessory turns your phone into a thermal camera.",
    "icon": "//lh3.googleusercontent.com/DkxVjMZFmSsMNNiBS_SsxuaOcuHlk4L8-njlrbVct0nLCqBgWXuWOGXLAC5jYgDKcA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 2.8,
    "reviews": 1191,
    "developer": "FLIR Systems, INC",
    "developerId": "FLIR+Systems,+INC",
    "developerEmail": "flirone@flir.com",
    "developerWebsite": "http://www.flir.com/flirone/",
    "updated": "March 3, 2018",
    "version": "Varies with device",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "size": "Varies with device",
    "description": "With the ability to see what the naked eye can't, the FLIR ONE and FLIR ONE Pro provides a visual image of minute temperature differences, giving users the power to see in the dark, observe invisible heat sources, compare relative temperatures, and see through smoke.Its advanced image processing includes FLIR MSX®, which blends the image detail from the color camera with the thermal image to give you the best of both worlds. The revolutionary OneFit™ adjustable-height connector ensures that your FLIR ONE and FLIR ONE Pro will fit your phone or tablet, even when it’s in a compatible protective case. An improved FLIR ONE app lets you stream thermal images to your smartwatch for remote viewing and share images and videos with social media while keeping you up to date on the latest FLIR ONE tips and tricks. Explore the neighborhood, solve problems around the house, and see the world from a new perspective with the new and improved FLIR ONE and FLIR ONE Pro.Connect with the FLIR ONE at:www.facebook.com/FLIR www.instagram.com/flir www.twitter.com/flir www.youtube.com/flirseetheheatFor more information on the FLIR One, visit flir.com/flirone",
    "descriptionHTML": "With the ability to see what the naked eye can&apos;t, the FLIR ONE and FLIR ONE Pro provides a visual image of minute temperature differences, giving users the power to see in the dark, observe invisible heat sources, compare relative temperatures, and see through smoke.<br><br>Its advanced image processing includes FLIR MSX&#xAE;, which blends the image detail from the color camera with the thermal image to give you the best of both worlds. The revolutionary OneFit&#x2122; adjustable-height connector ensures that your FLIR ONE and FLIR ONE Pro will fit your phone or tablet, even when it&#x2019;s in a compatible protective case. An improved FLIR ONE app lets you stream thermal images to your smartwatch for remote viewing and share images and videos with social media while keeping you up to date on the latest FLIR ONE tips and tricks. Explore the neighborhood, solve problems around the house, and see the world from a new perspective with the new and improved FLIR ONE and FLIR ONE Pro.<br><br>Connect with the FLIR ONE at:<br>www.facebook.com/FLIR <br>www.instagram.com/flir <br>www.twitter.com/flir <br>www.youtube.com/flirseetheheat<br><br>For more information on the FLIR One, visit flir.com/flirone",
    "histogram": {
        "1": 466,
        "2": 129,
        "3": 120,
        "4": 160,
        "5": 316
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ZPd1MnX-_pb8-kAtYkvRMimmYe90jc4yJyewJnJyVZtx_KCZ2FN6OnrXEzknmeVQH7w=h310",
        "//lh3.googleusercontent.com/gMcMF4EmY5e4oxIMYBvC4AmHO42sw81BAxdMxIgBphmRJs2cl0EufHGmh_iWdgz92Qqp=h310",
        "//lh3.googleusercontent.com/JR1ldWTki2O1h_iJ-WTPM3CQgPgxg_4l7EqwqIyZlxDv0s05_IyGezxPRXlcMnuGByY=h310",
        "//lh3.googleusercontent.com/a9xZ2nTPqrGcaaQrnDZSMvvWS0L1351JS5RL-eqsXvhRbr8rQ86wE2e03mlBVLbBIlg=h310",
        "//lh3.googleusercontent.com/exKvT30DsF8hmnfANmTLotIuSIIfoBMuC7TPWIZ7NDVz6uO4Dpu9CxIzBd-eN3EPCXZG=h310",
        "//lh3.googleusercontent.com/P-R7N5_Qbm-yL8_6_RtZF5mANwsFNKTSoFpIbBTJBB__kla4mtalTPOTGwqy4PMLWhQ=h310",
        "//lh3.googleusercontent.com/1Oo_jD6yJ-J98QyYBm9I6bFyUHk6Qe9yFuPifqSfS60_dpRZZRyh6nPylMMTN22dRyM=h310",
        "//lh3.googleusercontent.com/wNRe0WG615htcDxDnPnbkT9kjmflHiHlldSHOs_B3CAFjZ0CNiPJr6nrvSGzl2CltA=h310"
    ],
    "comments": [
        "I have a FLIR ONE GEN 2 I bought in March 2017. It worked great on my Samsung S7 with the app at that time, and is the app shown in the user manual. However FLIR updated the app and my phone updated it automatically, and now there is no more live view and the app doesn't really work. Very disappointed with losing the use of this expensive device.",
        "Flir One 1st gen device is not recognized by my OnePlus 2 phone. I've tried various micro USB to USB-C adapters that support USB OTG, but no luck. The issue must be that the device hardware or this app's software is not compatible with my phone.",
        "Since today's update, I am unable to use the regular camera on the phone.  Did something in this update disable my phone's ability to access it's built in camera?",
        "Updates always break stuff. Couldn't load calibration info after update. Cleared cache and storage for app then worked.",
        "I have just receive my flir one pro today Amazing.... realy Amazing  \"You can see what the others can't\" Very happy to work with it Its work fine with my Samsung note 8 .... Highly Recommended",
        "Following an update this app has become glitchy and temperamental with my FLIR One. It's always asking for the camera to be reconnected, mis-reporting a low battery, and failing to load calibration data.  The latter is probably why it now shows all spot temperatures as '&lt;-50C'.  Did no one test this before release?"
    ],
    "recentChanges": [
        "This build contains general bug and stability fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.flir.flirone&hl=en&gl=us",
    "appId": "com.flir.flirone"
}