{
    "title": "Google Keep",
    "summary": "Google Keep",
    "icon": "//lh5.ggpht.com/DY9VpGNRSHoICKJVpIy9dMjgm7TOb3lTveLtsv4got8aqbLGpSS4w5xXiR7VBe-mr_M=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.4,
    "reviews": 663872,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "apps-help@google.com",
    "developerWebsite": "https://support.google.com/?p=notes_main",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "February 26, 2018",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Quickly capture what’s on your mind and get a reminder later at the right place or time. Speak a voice memo on the go and have it automatically transcribed. Grab a photo of a poster, receipt or document and easily organize or find it later in search. Google Keep makes it easy to capture a thought or list for yourself, and share it with friends and family.  Capture what’s on your mind • Add notes, lists and photos to Google Keep. Pressed for time? Record a voice memo and Keep will transcribe it so you can find it later. Share ideas with friends and family • Easily plan that surprise party by sharing your Keep notes with others and collaborating on them in real time. Find what you need, fast • Color and add labels to code notes to quickly organize and get on with your life. If you need to find something you saved, a simple search will turn it up. Always within reach • Keep works on your phone, tablet, computer and Android wearables. Everything you add syncs across all of your devices so your thoughts are always with you. The right note at the right time • Need to remember to pick up some groceries? Set a location-based reminder to pull up your grocery list right when you get to the store. Available everywhere • Try Google Keep on the web at http://keep.google.com and find it in the Chrome Web Store at http://g.co/keepinchrome.  Permissions Notice Camera: This is used to attach images to notes in Keep. Contacts: This is used to share notes to contacts. Microphone: This is used to attach audio to notes. Location: This is used to set and fire location-based reminders. Storage: This is used to add attachments from storage to their notes.",
    "descriptionHTML": "Quickly capture what&#x2019;s on your mind and get a reminder later at the right place or time. Speak a voice memo on the go and have it automatically transcribed. Grab a photo of a poster, receipt or document and easily organize or find it later in search. Google Keep makes it easy to capture a thought or list for yourself, and share it with friends and family.<br> <br> Capture what&#x2019;s on your mind<br> &#x2022; Add notes, lists and photos to Google Keep. Pressed for time? Record a voice memo and Keep will transcribe it so you can find it later.<br> Share ideas with friends and family<br> &#x2022; Easily plan that surprise party by sharing your Keep notes with others and collaborating on them in real time.<br> Find what you need, fast<br> &#x2022; Color and add labels to code notes to quickly organize and get on with your life. If you need to find something you saved, a simple search will turn it up.<br> Always within reach<br> &#x2022; Keep works on your phone, tablet, computer and Android wearables. Everything you add syncs across all of your devices so your thoughts are always with you.<br> The right note at the right time<br> &#x2022; Need to remember to pick up some groceries? Set a location-based reminder to pull up your grocery list right when you get to the store.<br> Available everywhere<br> &#x2022; Try Google Keep on the web at http://keep.google.com and find it in the Chrome Web Store at http://g.co/keepinchrome.<br> <br> Permissions Notice<br> Camera: This is used to attach images to notes in Keep.<br> Contacts: This is used to share notes to contacts.<br> Microphone: This is used to attach audio to notes.<br> Location: This is used to set and fire location-based reminders.<br> Storage: This is used to add attachments from storage to their notes.",
    "histogram": {
        "1": 23145,
        "2": 16472,
        "3": 46892,
        "4": 142593,
        "5": 434770
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/qu4pd8lh0flORz1IAihatgmH1CzUxZf237LAPZR3zPenNFyE1C0ZZM5eEwyVfKzGrZ8F=h310",
        "//lh3.googleusercontent.com/o9u_9PLbE0peD02MHryHZNwAQ2CLR7U_T1dhQB3X6L_jIXDrnDlKr7Ktb53IU8MIPQ=h310",
        "//lh3.googleusercontent.com/OKgZCCSW7-s7tYQ4XWNFQq53iyW1lIbveMhRpNoxjub-PRDj0GQ20Cah8Yb06luqWg=h310",
        "//lh3.googleusercontent.com/fJIBwNRA20s3hUBd4dduKA7w6R42hdCnFScDxjB55znvQQ_IM5yYoEWkwMCj1sE8_SQ=h310",
        "//lh3.googleusercontent.com/TKVtIbs30P_T4yb6XzPCRV3iaR-noP8h8M3NZC-5EvlJNpA77shzLtgB8ocML7dbO_Q=h310",
        "//lh3.googleusercontent.com/lGtZdNy8qL7TGqO6g3o_IAgDi9MBQwvclP0myC4Nf8tlXhLrWo6_T4PuEg7AR4UCbC8=h310",
        "//lh3.googleusercontent.com/Wl3Ca7InHF-bWZxkc84g8-DLNDF8V_EqVxW3TzS46SyermF95JrXPHxrv0pnG_SOaw=h310",
        "//lh3.googleusercontent.com/t8U2VWypU6_es7yzpamVvYU5qDnsYdYm4jY4Vm7OgR_MgmCpeqycWCtP0JXsmAGDxg=h310",
        "//lh3.googleusercontent.com/vl6wXAnAD8WsDuVQ-fFWvSWnaoQpVu-vdIjxdugUrgbtT910-UOiaHmwYoJ4N8T5vi0p=h310",
        "//lh3.googleusercontent.com/NkDzciV2BL_r1Gskl16hEj_3UYD5dITuwd6p9a2W4Lor_QTGuQz9EG19eTUkEG4cbw=h310",
        "//lh3.googleusercontent.com/rpKeDlACwh_NwcELfrL4poxG4IJp7iZRvJnBffoqVu59oUTb6Zli6jhPqzY4GfY0gqs=h310",
        "//lh3.googleusercontent.com/iqYHCpFvSQuIxHIn0R4M2ZJ-JN54yff9U1WgRDyiWHAgGxruPz4dAsFXZRCV7c3Pcw=h310",
        "//lh3.googleusercontent.com/ToDSwfhRc-sFV-wmFOxLvB-dwbMNepCC-BrzF7YPTJpg7oTup-9DT-DP_Yy9bu5V2w=h310"
    ],
    "comments": [
        "Sometimes you're too accustomed to a way of working that you see simplicity as a burden. I really like to have a desktop interface for entering data massively and quick, while having an up to date counterpart. I also like to have a simple design. The search behaviour is also well done. I do hope the app keeps improving while retaining simplicity.",
        "Update 25 Feb 2018: Although still an excellent app, I've had to return to OneNote for Folders and Menus. Keep is good up to a point then it just takes too long to jump to a note quickly. 1st  review: This is a cracking good Note app and I use it on all my devices. I would ask for only two things to be added - Folders to contain my different  subjects and a start page with an alphabetical index of folders so that I can jump directly to my required folder and thence to my note.",
        "I have been using OneNote, developed by Microsoft, for last two and half years in my local branded phone. I'm also trying Google Keep last one month.  Actually, I'm falling in love with Google keep. It's easy to use. It has plenty of customized and productive features.  I don't know why I'm facing some lag like scrolling, late response etc. But, To be honest, I haven't face that kind of lagging in OneNote.  Please, fix it. At last, I wish it could have unlimited entry capability like OneNote.  Thank you.",
        "There's a huge problem with handling images. 1. Images cannot be seen on full screen, a white bar covers them for no good reason.2. High resolution images look completely distorted at first on all phones. However they become clear when the pen icon is pressed to edit them and when they are saved again, their resolution drops but clarity is maintained.",
        "Double notifications becoming exceedingly annoying. It would a much better experience of we could swipe between reminders once we are viewing them individually, instead of going back to main screen - like I'm Gmail Thanks for more colors!",
        "If Keep had encrypted notes it would be the best thing going. Apple has it. Why don't you? I got tired of having to use gpg for random notes. Way too many extra steps. Now I use 'Standard Notes'. Problem solved. Doesn't have as many bells and whistles, but I have privacy."
    ],
    "recentChanges": [
        "* Bug fixes and performance improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.keep&hl=en&gl=us",
    "appId": "com.google.android.keep"
}