{
    "title": "Pulse Play for racket players",
    "summary": "Scorekeeper, ranking system, match history for racket players",
    "icon": "//lh3.googleusercontent.com/RoK0O62gwC5JyfnDV6WA71n6VJj-k3B8HAygv0PcinzJWetPdZ-DZiEXvLEc-aNK-g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.2,
    "reviews": 21,
    "developer": "Alerteenz",
    "developerId": "Alerteenz",
    "developerEmail": "yariv.goren@s-fbi.com",
    "developerWebsite": "http://www.pulse-play.com",
    "developerAddress": "8 THE GREEN, STE A, DOVER DE 19901",
    "updated": "August 4, 2016",
    "version": "2.7.0",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Pulse Play is the perfect app for racket sport players. The app is designed for Android Wear  smartwatches and the Pulse Play smartwatch, and it serves racket players with a professional experience, with live scorekeeper, score announcements, match history and stats, and a social ranking system.Pulse Play is suitable for all racket sports: tennis, badminton, ping pong (table tennis), and squash.*** Pulse Play cannot be used without a smartwatch: Android Wear or Pulse Play smartwatch ***Main features:•\tScorekeeping made easy – score your match live from your Android Wear or Pulse Play smartwatch with a touch of a button •\tStop announcing the score – let Morgan Freeman or Arnold Schwarzanagger do it. •\tKnow how good you are compared to friends and other players, with our unique ranking system•\tSee you improvement with our full match history and player statistics•\tOpen as many private leagues as you want – for weekend tennis friends or for workplace ping-pong league•\tCompare yourself to other players and rivals with our Head-to-Head overview",
    "descriptionHTML": "Pulse Play is the perfect app for racket sport players. The app is designed for Android Wear  smartwatches and the Pulse Play smartwatch, and it serves racket players with a professional experience, with live scorekeeper, score announcements, match history and stats, and a social ranking system.<br>Pulse Play is suitable for all racket sports: tennis, badminton, ping pong (table tennis), and squash.<br>*** Pulse Play cannot be used without a smartwatch: Android Wear or Pulse Play smartwatch ***<br>Main features:<br>&#x2022;\tScorekeeping made easy &#x2013; score your match live from your Android Wear or Pulse Play smartwatch with a touch of a button <br>&#x2022;\tStop announcing the score &#x2013; let Morgan Freeman or Arnold Schwarzanagger do it. <br>&#x2022;\tKnow how good you are compared to friends and other players, with our unique ranking system<br>&#x2022;\tSee you improvement with our full match history and player statistics<br>&#x2022;\tOpen as many private leagues as you want &#x2013; for weekend tennis friends or for workplace ping-pong league<br>&#x2022;\tCompare yourself to other players and rivals with our Head-to-Head overview",
    "histogram": {
        "1": 1,
        "2": 2,
        "3": 3,
        "4": 1,
        "5": 14
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/pepjePNOcgPB_Tb_vHszzdFMuR2UwpmAHYU0L5N0Y5iA8i8ZGPzYicVgTr402jPFjg=h310",
        "//lh3.googleusercontent.com/34dCTuN3QQJLNMDX_zlu9Xpx2XXGMHSRYmKtU9Ap122-vBcNPN5R2U3_ozjixFVP6w=h310",
        "//lh3.googleusercontent.com/y1oBnpvd1CNJ0KLsgFuQr0_jHj2ouQGH7pTBZsa4EcWF6ZsAnFTtGLFwWszRCeRsjg8=h310",
        "//lh3.googleusercontent.com/-CbkZuOkxYBRjmBXmB4G2Mi6rRIiZW8uk1oMha16vOYGJp00au-bxMPyIxXS6NyVmgs=h310",
        "//lh3.googleusercontent.com/JydPLWhIJn4trt0hWKt7Id6mHxtF9AdE2q29elzUzXS5-RgDijWNPyqK8IFI4pjomw-M=h310",
        "//lh3.googleusercontent.com/2ZFTymchV9nb-Z7sSnYfUdjeWjqdOqwGmTbAv-DAHjVpJCBtwppLWtu2JSrD3sTfeeo=h310",
        "//lh3.googleusercontent.com/1-D2K-wz7ZneDQsIkIskun-XQLv5kg-xz5SD0VpD2bGXtxt4huYLpTFhIxNPXwOZVd4=h310",
        "//lh3.googleusercontent.com/OLyFPuWGme4nsSiuQjYCNcX7WcOLGw8uFhc1BSzTso1zIX4jQgqS1Mo4iA0hYCBsln0=h310",
        "//lh3.googleusercontent.com/EH14v4wqnVZkv7k-voESGMElvVfWrtfE0wetmwzsY-wbQwBSVIcQV-XLkpOb8vM6T7Q=h310"
    ],
    "comments": [
        "Can't connect Huawei Watch App looks good. 3 star. Huawei Watch not connecting. Keeps saying turn on device Bluetooth! I am on Android Wear Dev Preview.",
        "Hi I liked the app but since in May 2016, you mentioned that Tizen was in your roadmap for the next few months, I wonder when you think you will have it ready? I have a Samsung Gear S3 and this app would be very useful for me. Thanks Raul",
        "tizen store The app looks great, when you gonna release  an tizen store app?",
        "Needs work I've barely installed it and started updating my profile and I'm already disappointed...can't enter height in imperial measurement, only 2 racquet brands render \"Willson\" and \"Dunlop\"...yes that's right Wilson is spelled wrong. Amazing. And only 2 choices. First impressions are important. They need to fix some of these things soon. Otherwise people will abandon.",
        "works fine on my pulse play watch but on the DZ09 android smartwatch has only sounds but no display. not sure if it needs to install the app on the watch or it only works in a specific android wear brand.",
        "It doesnt connect to my gear s2 I tried to start a game but there is a message that says:\" no devices were found\". if you will fix it ill give 5 stars"
    ],
    "recentChanges": [
        "Players can now score a match with one smartwatch. Both players will still need to have the Pulse Play app downloaded to their smartphones and a Pulse Play account, however one player will be able to score points made by both players entirely from their own smartwatch. Only one smartwatch will be needed per game.",
        "Bugfixing"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sfbi.pulseplay.android&hl=en&gl=us",
    "appId": "com.sfbi.pulseplay.android"
}