{
    "title": "Android Messages",
    "summary": "Texting and chat made easy, by Android",
    "icon": "//lh3.googleusercontent.com/uKucj78tM1f6HoLBzoT8FNgH4oVxK5QSLz49ZnpthjAXmjLXGQ2Ge8cn8WGyoRsscg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.2,
    "reviews": 630865,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "apps-help@google.com",
    "developerWebsite": "http://www.google.com/mobile/android/",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "February 22, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Meet Android Messages, Androids official app for texting (SMS, MMS) and chat (RCS). Message anyone from anywhere with the reliability of texting and the richness of chat. Stay in touch with friends and family, send group texts, and share your favorite pictures, videos, and audio messages.Clean designA colorful, intuitive design makes communicating faster and more fun.Easy sharingSelect or take pictures and videos directly from the app and share easily. You can even send audio messages to your contacts.Richer conversationsSend audio messages, emoji, stickers, or your location.Powerful searchSearch through conversation threads to find exactly what youre looking for. Chat features (RCS) On supported carriers, you can send and receive messages over Wi-Fi or your data network, see when friends have read your message, and more. Android Messages is supported on devices running Android™ 4.4, KitKat, and above.",
    "descriptionHTML": "Meet Android Messages, Androids official app for texting (SMS, MMS) and chat (RCS). Message anyone from anywhere with the reliability of texting and the richness of chat. Stay in touch with friends and family, send group texts, and share your favorite pictures, videos, and audio messages.<br><br><b>Clean design</b><br>A colorful, intuitive design makes communicating faster and more fun.<br><br><b>Easy sharing</b><br>Select or take pictures and videos directly from the app and share easily. You can even send audio messages to your contacts.<br><br><b>Richer conversations</b><br>Send audio messages, emoji, stickers, or your location.<br><br><b>Powerful search</b><br>Search through conversation threads to find exactly what youre looking for. <br><br><b>Chat features (RCS)</b> <br>On supported carriers, you can send and receive messages over Wi-Fi or your data network, see when friends have read your message, and more. <br><br>Android Messages is supported on devices running Android&#x2122; 4.4, KitKat, and above.",
    "histogram": {
        "1": 46551,
        "2": 27817,
        "3": 64956,
        "4": 130169,
        "5": 361372
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/hVn70FSAgWUcc8vfxSuy5Wu6uGY-2Yyf56kDqO7okYU54mnI02v31CkyFaOV3k3AKnc=h310",
        "//lh3.googleusercontent.com/IuHRVEACEPQnj9tbDUEG-lQnEYAbXgvLpCo73JNt_oEJM2ZDL1YAiif4-Gg67I_VaWw=h310",
        "//lh3.googleusercontent.com/E8m1yfwVXqCs5NI9bkMIrZOfZcAWmCZ3yZOvdubzhMzSExhXTAkLZCSt-XBJ_t4vuC0=h310",
        "//lh3.googleusercontent.com/zi-oVaV2OBzF_2J_042aOb62sz6czmY7DZPw4fpsp9iox7BO2ce9isoEpJb-1_8bdll2=h310",
        "//lh3.googleusercontent.com/nIvQJujew5_FKvlYtlDLTj1AH1_jUv44ntQT_P5fI_yeR8iVl5XPdAFL7Eer_fYQ9_c=h310",
        "//lh3.googleusercontent.com/6iKnh2-mnA0wjDD4HvBTumGZcAkQ8NsI5STYyF3XC-cbwGbFgcDO_JAE7qbIz_V_3w=h310"
    ],
    "comments": [
        "How I felt about the app can be seen below. As of late though, the notifications appear to be broken. I'll receive duplicate notifications, no notifications, or my phone will vibrate like I'm receiving a message when I send one, with no option to turn that off. Google please fix this or I'll have to get another messaging app.   Great app, needs to have the ability to like/Love a message. Also needs better integration of knowing when someone's typing and to be able to text anyone with the app over WiFi like iMessage. Then it'll be the best around.",
        "I love this app, however, the camera button needs to be on the RIGHT side of the camera window. How can you hold the phone one handed and take a picture when the button is in the MIDDLE of the screen (especially in landscape)? Also, can you please add the ability to change backgrounds and balloon styles like the stock app? I have to agree about the RETURN key. Please bring it back.",
        "I like the app, I think it's definitely an improvement over what the default Android messaging app was. That being said, I don't always get all the texts particularly from iPhones and sometimes the text will be half of the next text mixed with part of an older text? It's pretty bizarre. It makes it not particularly reliable when it only works completely some of the time. Fix that issue and it'd be a great messaging app...",
        "Wish you could change background on the messages. As much time as we spend texting, people like to have the ability customize or give a theme to their messaging app and in order to use some of the features of the Gboard you need to use this app for messages. I don't want to change the colors of every contact. I want the ability to change the colors of all of them as well and the message bubbles and background. I don't think that should be to hard since almost all the other message app allow that.  Adding the ability to personalize this message app would make this the best app. I don't know if I will use it bc of that. I would rather be able to Personalize my message app over using the features of the Gboard that only work with this app. Silly maybe, but when you text all the time but only use a feature once in awhile it makes a difference.",
        "This app does show when typing when other users are using same app. Sorry but if your friend has iSheephone then no you can't see them type. Tell your friend to get their head out of their Apple and get a droid. Works great. Double texting error is often a carrier issue when send read receipt isn't established. Works good for a text app.",
        "Motorola Memo is better. This Google version won't let you start creating a SMS draft version without first naming a recipient. Motorola phones used to let you create the text body of a SMS then when you were happy with it, add the recipient, so you could compose and edit SMS's without accidentally sending an unfinished version because you could add the recipient as the last thing to do but this version won't let you do that."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.apps.messaging&hl=en&gl=us",
    "appId": "com.google.android.apps.messaging"
}