{
    "title": "Remind Me - Quick Reminder App",
    "summary": "Quick &amp; Easy Intuitive Reminder App for Call, Email &amp; Text Reminders - Remind Me",
    "icon": "//lh4.ggpht.com/1vDobHbVy9X1zyXpP85Q1x_fk2oGlD_FKrKDou3TVkvl-NqnMJZt8ZQOuyGlXMd2aTI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4,
    "reviews": 340,
    "developer": "Designers X",
    "developerId": "Designers+X",
    "developerEmail": "support.remindme@designersx.com",
    "developerWebsite": "http://remind-me.pw",
    "developerAddress": "699, Sec 82, Mohali, Punjab, India",
    "updated": "June 17, 2016",
    "version": "0.99",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Remind Me is a simple yet useful reminder app for your daily tasks which you forget to do & for which your mobile can easily help. Have a user friendly, fast & intuitive User interface for user to manage everything with just the thumb holding the phone with 1 hand. The layout is careful crafted for user to set reminders with ease. Features of the app include:- Timely Managed & sorted Listview- One finger operation for everything- Color Themes- Unique UI/UX Design- Easy category selection by sliding down- Android Wear Support and Notifications.- Catch missed calls and offer to call or add reminder.The app can used as a digital companion which simply reminds you of tasks which you can do with your phone & want to do, But busy schedule does not let do them on time. Its more than a To Do list & Even more than a To Do list with reminders. It helps you by opening the related app on your phone so you just confirm the action & do it.It helps you to add reminders for:- Calling a contact- Sending Text Message- Emailing a contact- Add Reminders to Wake up- Add To Do tasks with or without Reminders- Add Calender Events for Birthdays & AnniversariesThis version of the app is here with some basic but useful features and more advanced features are still being coded. Features like- Custom app selection- Cloud Sync with Chrome app- Voice Command for RemindersWe at DesignersX sincerely hope this app will help you solve some of the daily problems by reminding you to do tasks. We have tested this app in a closed group for 3 months and improved it as per best of our knowledge. If you still find a bug with your specific phone, we would encourage you to submit crash/error report to App store or email us at support.remindme@designersx.com",
    "descriptionHTML": "Remind Me is a simple yet useful reminder app for your daily tasks which you forget to do &amp; for which your mobile can easily help. Have a user friendly, fast &amp; intuitive User interface for user to manage everything with just the thumb holding the phone with 1 hand. The layout is careful crafted for user to set reminders with ease. <br><br>Features of the app include:<br>- Timely Managed &amp; sorted Listview<br>- One finger operation for everything<br>- Color Themes<br>- Unique UI/UX Design<br>- Easy category selection by sliding down<br>- Android Wear Support and Notifications.<br>- Catch missed calls and offer to call or add reminder.<br><br>The app can used as a digital companion which simply reminds you of tasks which you can do with your phone &amp; want to do, But busy schedule does not let do them on time. Its more than a To Do list &amp; Even more than a To Do list with reminders. It helps you by opening the related app on your phone so you just confirm the action &amp; do it.<br><br>It helps you to add reminders for:<br>- Calling a contact<br>- Sending Text Message<br>- Emailing a contact<br>- Add Reminders to Wake up<br>- Add To Do tasks with or without Reminders<br>- Add Calender Events for Birthdays &amp; Anniversaries<br><br>This version of the app is here with some basic but useful features and more advanced features are still being coded. Features like<br>- Custom app selection<br>- Cloud Sync with Chrome app<br>- Voice Command for Reminders<br><br>We at DesignersX sincerely hope this app will help you solve some of the daily problems by reminding you to do tasks. We have tested this app in a closed group for 3 months and improved it as per best of our knowledge. If you still find a bug with your specific phone, we would encourage you to submit crash/error report to App store or email us at support.remindme@designersx.com",
    "histogram": {
        "1": 30,
        "2": 18,
        "3": 35,
        "4": 85,
        "5": 172
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/FRbFv7XPtK418gwAQA1OAgqDgTxUiIi6-Gs-NMeplFvtsw8qBBiZ5Hz9W8qviyTGx3c=h310",
        "//lh4.ggpht.com/JSURqyAOUafGKXRmTWE-uUcfdBxUn4YEneHFPwWXj03yn8QPvYCc-3Cy_fD2pZxL1Q=h310",
        "//lh4.ggpht.com/GUSPfE7zBmoaEJgrCZfPHEbrwbphGjLfEMizEaf56Oan2GL_l8lGEDdVBqIHiwUIkw=h310",
        "//lh4.ggpht.com/g9YTCFzkUN8qliXEbyDYS2BghbWjyvNBIl9aL-wjNdHe3CEMdGojmuQpOObhqAppqDCj=h310",
        "//lh6.ggpht.com/Qfwn1audSaaxtn4E_NaV1keqTkTDroKORtAxEHKdM-VFfW6uh4uEI4iIKrTSHr4G6r4=h310",
        "//lh5.ggpht.com/VKQpoNuSJd181bZ-K99GJG0zrr_VUXcams2zMk7OARHqD8E0aBgscs79f67GV7JV2r7p=h310",
        "//lh6.ggpht.com/PFP-7aWsbRI0xVw7xr7Qua0MnYxRldrJMNHMlORSFGwbMKnEb5rltnawTJaKnvMYKF0=h310",
        "//lh6.ggpht.com/DClvhMc0y3hwmRBe0X5PuirLpEkvGM8NpIj1TlVQfSvTcPKu3jjz05sjHuCiykicwA=h310"
    ],
    "video": "https://www.youtube.com/embed/xIWY2_rVCiw",
    "comments": [
        "It's not bad functionally, just more cumbersome than I had hoped I find it's too cumbersome to create a reminder for many things throughout the day. The process of adding a new reminder is not streamlined. You have to do, what I would consider, a lot of clicking around which just make the app feel clunky. Setting a time is really obnoxious because they use slider bars. Overall needs a lot of work, imo.",
        "I love this app. I feel that it is the best reminder that I could have. It is very reliable. The the only thing that I do not like about it is that I haven't yet discovered how to duplicate a reminder to create multiples, but with a different time for each one. Other than that, it's fantastic.",
        "Use of Volume buttons to silence reminder Please set the volume buttons to silence & snooze alarms even if screen is off, infact any hard buttons, this would really help in meetings or if you are just too busy to look at your phone & respond, thanks for the great app!",
        "Not performing basic functionality I set a birthday reminder and it either doesn't even ring. Reminder alarm never rings. Total waste.",
        "You should make one that keeps the correct time, and that I don't have to constantly reinstall",
        "Amazing app to recall important stuff in day to day to life.."
    ],
    "recentChanges": [
        "- Stability & Performance improvements",
        "- Settings for Call Reminders Activation",
        "- Settings for Text Reminders Activation"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.remindme&hl=en&gl=us",
    "appId": "com.remindme"
}