{
    "title": "WinGPS™ Marine",
    "summary": "The navigation app for boaters. Now with weekly updated NOAA chart tiles.",
    "icon": "//lh3.googleusercontent.com/7o11k9Y9MoFko_4uvbId958t6I9tyJu71llXtm2Ue7Qsgk1hL-by01AFPhyVxIsJsv4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4,
    "reviews": 746,
    "developer": "Stentec",
    "developerId": "8447410866328691299",
    "developerEmail": "stentec@stentec.com",
    "developerWebsite": "http://www.stentec.com",
    "developerAddress": "Harinxmastraat 29\n8621 BJ Heeg\nThe Netherlands",
    "updated": "March 1, 2018",
    "version": "2.85",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "WinGPS Marine offers you modern, easy to learn navigational tools for a safe trip. Long press on the chart to plot your route. The GPS on board will show your exact location. Download the charts to your device and go boating offline with the most up-to-date charts. Connect your AIS via WIFI and prevent possible collisions. Developed by Stentec for navigation on sailing and motor yachts, sloops and canoes at sea, tidal and inland waters. Ideal when renting or chartering a boat.NEW [2017]• Support for the waterways for the inland charts Western Europe and Donau with bridge-, locks and waterway information. With this you can plot and adjust your routes quickly, indicating any obstacles. The names of the waterways and distances will be shown during your trip.• Smart labeling prevents overlapping text labels (with waterways also) for an optimal chart image. Bridge and lock data will always be readable on Course Up rotating charts.   HIGHLIGHTS• Navigating on up-to-date charts of Stentec, Imray, NOAA and Delius Klasing.• SD-card support for chart storage.• Manage tracks, charts, routes and waypoints.• NOAA World GRIB-files: wind, air pressure, rainfall and temperature. • Connect AIS and GPS via wirelesss WIFI or Bluetooth connection.• Prevent collisions with the speed vectors of the AIS ships.• Man-overboard button helps to retrieve lost crewmembers.• Chart moves along underneath centered GPS position. NorthUp, CourseUp (Marine) or HeadUp (Plus).• Harmoniemodel KNMI with detailed weather predictions (Plus, Netherlands only)• NOAA wave prediction at open sea (Plus, Worldwide)When WinGPS Marine is installed for the first time, this will be WinGPS Marine Lite with limited functions. Ideal as a chart viewer with GPS support.IN-APP PURCHASEAfter putchasing WinGPS Marine, you will unlock the full capabilities of your personal navigation system. You are now able to plot routes, download GRIB files, save previous tracks and connect AIS and GPS. Use the handy time table to view the predicted wind, rain, air pressure and AIS targets.With the WinGPS Marine Plus upgrade, you will be able to connect additional board instruments via wireless connection to you board PC, multiplexer or AIS transponder. You can display current and tidal information in your data plotter or view it on the chart. Also, the advanced KNMI’s Harmonie weather model is supported as well as the NOAA waves worldwide. KUSTFIJN Getijmodel Rijkswaterstaat with two day wind depended predictions of currents, tides and water levels on the Waddenzee, Ijsselmeer, Markermeer, Randmeren and Zeeland. Red depth lines limit the safe waterways depending on depth, tides and deviations because of the wind.CHART COVERAGE & INSTALLING THE CHARTSWhen you start WinGPS Marine you will automatically see the (online) topographic default chart of ESRI. You can also turn on the NOAA charts of the US and download the free world chart via the Chart ManagerFor safe navigation, you can purchase digital charts at www.stentec.com.  It’s also possible to purchase the charts in the app or via Google Play™.  Your charts can be installed on 3 different devices. For example, on your Android tablet, phone and Windows laptop or computer. Log in with your Stentec Account in the Marine app and download or update your purchased DKW2 charts in the Chart Manager.For example, the popular DKW1800 series with weekly BaZ updates and the NL Chart with biweekly updates. Our online shop offers up-to-date sea charts and all inland charts of Western Europa including the Donau.With the DKW Builder (optionally), you can use scanned or BSB charts to build your own DKW2 chart set. The new DKW2 charts can be copied to the DKW2 folder on your tablet via a USB cable to use the charts in WinGPS Marine. More information: www.wingpsmarine.comUSERS INPUTFor improvement of the app we are very much interested in your experience and suggestions. Please send an e-mail to helpdesk@stentec.com.",
    "descriptionHTML": "WinGPS Marine offers you modern, easy to learn navigational tools for a safe trip. Long press on the chart to plot your route. The GPS on board will show your exact location. Download the charts to your device and go boating offline with the most up-to-date charts. Connect your AIS via WIFI and prevent possible collisions. <br>Developed by Stentec for navigation on sailing and motor yachts, sloops and canoes at sea, tidal and inland waters. Ideal when renting or chartering a boat.<br><br>NEW [2017]<br>&#x2022; Support for the waterways for the inland charts Western Europe and Donau with bridge-, locks and waterway information. With this you can plot and adjust your routes quickly, indicating any obstacles. The names of the waterways and distances will be shown during your trip.<br>&#x2022; Smart labeling prevents overlapping text labels (with waterways also) for an optimal chart image. Bridge and lock data will always be readable on Course Up rotating charts.   <br><br>HIGHLIGHTS<br>&#x2022; Navigating on up-to-date charts of Stentec, Imray, NOAA and Delius Klasing.<br>&#x2022; SD-card support for chart storage.<br>&#x2022; Manage tracks, charts, routes and waypoints.<br>&#x2022; NOAA World GRIB-files: wind, air pressure, rainfall and temperature. <br>&#x2022; Connect AIS and GPS via wirelesss WIFI or Bluetooth connection.<br>&#x2022; Prevent collisions with the speed vectors of the AIS ships.<br>&#x2022; Man-overboard button helps to retrieve lost crewmembers.<br>&#x2022; Chart moves along underneath centered GPS position. NorthUp, CourseUp (Marine) or HeadUp (Plus).<br>&#x2022; Harmoniemodel KNMI with detailed weather predictions (Plus, Netherlands only)<br>&#x2022; NOAA wave prediction at open sea (Plus, Worldwide)<br><br>When WinGPS Marine is installed for the first time, this will be WinGPS Marine Lite with limited functions. Ideal as a chart viewer with GPS support.<br><br>IN-APP PURCHASE<br>After putchasing WinGPS Marine, you will unlock the full capabilities of your personal navigation system. You are now able to plot routes, download GRIB files, save previous tracks and connect AIS and GPS. Use the handy time table to view the predicted wind, rain, air pressure and AIS targets.<br>With the WinGPS Marine Plus upgrade, you will be able to connect additional board instruments via wireless connection to you board PC, multiplexer or AIS transponder. You can display current and tidal information in your data plotter or view it on the chart. Also, the advanced KNMI&#x2019;s Harmonie weather model is supported as well as the NOAA waves worldwide. <br>KUSTFIJN Getijmodel Rijkswaterstaat with two day wind depended predictions of currents, tides and water levels on the Waddenzee, Ijsselmeer, Markermeer, Randmeren and Zeeland. Red depth lines limit the safe waterways depending on depth, tides and deviations because of the wind.<br><br>CHART COVERAGE &amp; INSTALLING THE CHARTS<br>When you start WinGPS Marine you will automatically see the (online) topographic default chart of ESRI. You can also turn on the NOAA charts of the US and download the free world chart via the Chart Manager<br><br>For safe navigation, you can purchase digital charts at www.stentec.com.  It&#x2019;s also possible to purchase the charts in the app or via Google Play&#x2122;.  Your charts can be installed on 3 different devices. For example, on your Android tablet, phone and Windows laptop or computer. <br><br>Log in with your Stentec Account in the Marine app and download or update your purchased DKW2 charts in the Chart Manager.<br>For example, the popular DKW1800 series with weekly BaZ updates and the NL Chart with biweekly updates. Our online shop offers up-to-date sea charts and all inland charts of Western Europa including the Donau.<br><br>With the DKW Builder (optionally), you can use scanned or BSB charts to build your own DKW2 chart set. The new DKW2 charts can be copied to the DKW2 folder on your tablet via a USB cable to use the charts in WinGPS Marine. <br><br>More information: www.wingpsmarine.com<br><br>USERS INPUT<br>For improvement of the app we are very much interested in your experience and suggestions. Please send an e-mail to helpdesk@stentec.com.",
    "histogram": {
        "1": 81,
        "2": 37,
        "3": 82,
        "4": 154,
        "5": 392
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "3.1 and up",
    "androidVersion": "3.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/fzuEEmlfLx1zZgYjGtiZ5NC0iI7PHkxFei5cj0xWWDrz-dICM-fR-eHvphJ3WR4RBnQ=h310",
        "//lh3.googleusercontent.com/aED4TYDYQXbuXValDregSddMHiAipc7HxquZbsrKrb-2q9OcmixLxqWRDiyMczDLasA2=h310",
        "//lh3.googleusercontent.com/fAyQmf1S9QPrQhUi7NeMz4N-jt4mbESgD2FPw3m3rN6ZdWswOaISI_T_-P8nlMAumQ=h310",
        "//lh3.googleusercontent.com/VH4a67YU79SCuucs_mYbZhAmN5WtW1i2VAo517fiAYBFArLgXbzaaEBPpjcOlbae6w=h310",
        "//lh3.googleusercontent.com/IHlskPFMJEPIr_Jzcb5AOJXixne7bHcq39M8XuIl4cjGOkOBpXoVMCXHVyyl1Org-dA=h310",
        "//lh3.googleusercontent.com/Wgjk2_cQ1NAFEa1M0Inu--SeFYT6fujK_Q0P4GI7vHpnwpRQPOlaosJ4A37s7uU1v08=h310",
        "//lh3.googleusercontent.com/sadqPMi-przFuNCOpZ0ubYvLb5Hlc2gG5HItP65a83rzqs9NkqNCYmcBsA1eMqBKvKA=h310",
        "//lh3.googleusercontent.com/T0P8LeAi4kW0X_zPTTJiTpYjKelW64PKuEOXHxC4D00yajLElws3rGDkNFYXNYnhCBez=h310",
        "//lh3.googleusercontent.com/nbFwU13j95X6IZQqx83yed8wrQ6BpHIjW8WN-O4nbl8M_wvrL1t6Mj-4XOswiLMuEA=h310",
        "//lh3.googleusercontent.com/9t26ewO2I0avZRFjxIKS_N8m6GqiBrO-rxRyQfYoqWsdhn999zfY0MgqzWbCUKwDp25O=h310",
        "//lh3.googleusercontent.com/DULicsM9VVzVaYCGZQPNHTPI-uCAL5VDL_uI2ElDYXzFqx-0leg0PdKBsygPFME1Cw=h310",
        "//lh3.googleusercontent.com/WOt5xm8vPfu7Kj-5jQ3aG5k0EeV5lFbGmhA6rTEujJzIvpK196smTqkDBu__26AfWpI=h310",
        "//lh3.googleusercontent.com/yNCLqyR5M3ZqroZs3AKb7DuQWcnQB6zJD5eiqS0Rc4ThjWv2H4nVcw7Zd6eeJv9B0Q=h310",
        "//lh3.googleusercontent.com/tnr4RTCFblKrj5Y4lfEGzXpI4-LiYOsQw_bhQUacMDZDPCwIcoNKSOig4I8ISgl7Ue8=h310",
        "//lh3.googleusercontent.com/cjxY-_OHV7r145utWdEIU_wvdiu3dDUu0LaWgVoKVbS_qKCfsxtslJOhJjrSfHjqB70=h310",
        "//lh3.googleusercontent.com/cHXfyDVU2Cmb7A3RMU7W0FbZdDGlsVmASA74Iou9b0v-DTgx_OJ50ZyOhRkmAHuijw=h310",
        "//lh3.googleusercontent.com/JrSfOt60CVZ0GoUyzshtQqkPgymsC7FM6oS4GeIOektgX81qy-_PMhYVWe84420Cag=h310",
        "//lh3.googleusercontent.com/yQaG-DLTeCl5ntZGolKWt1tVoVQABCZqggzUSvbW94gKhrBkbjngBmlFQPERA3oRgRU=h310",
        "//lh3.googleusercontent.com/5IUWFG_VQlT43zJ7AJtmtN7eMkimIedrPKPK33_5-3RK_YgbqNtiQ4mCR1Z8uBqg-Q=h310",
        "//lh3.googleusercontent.com/8i34Vq6e_PLayqS9U9vdQ2rBJ91fpkuV1KkD_QIMqryxCtfBv84v_zMGangZI8WYNQ=h310",
        "//lh3.googleusercontent.com/FsY0BD0OMV_N5o0hdi8_WjPMY5kR2hH0Q6Jo30kFJGWkBtEkAu9v0zUY4zBRu3CbGMA=h310",
        "//lh3.googleusercontent.com/fa8_ecbZHw90ZVWk6JD6HZrSH_bd2b1XuiwAbF0hFLx5F-j-1tj423P6HXD7ph3j5g=h310",
        "//lh3.googleusercontent.com/Vx598A1R9UD_VpWWffGYZR87fLMJZxrp6L06MkbRd5zIfeu_1EfPfhlEQmen_nqofA=h310",
        "//lh3.googleusercontent.com/FlFE9YCwI_62HpI2dXjoS3c6tnvwyEzLDuqPrTWbOexkBntangGa8nofioNRxH8atQxo=h310"
    ],
    "video": "https://www.youtube.com/embed/u3p3nKdkrzM",
    "comments": [
        "You have to create an account to get this thing to work and I'm not about to do that. Also requires access to everything on your phone. There are much better boating apps than this one.",
        "Trash app. Feels like compiling Linux programs, very user NOT FRIENDLY setup. Not to mention that is a PAY ONLY app, not free at all.",
        "Absolutely no after-sales support from Stentec. Upgraded to the Plus version, failed to receive any upgrade code so stuck with the light version. Several polite emails sent to the developers, but no response. So wasted £72.71. Fraud.",
        "Funtastic",
        "SmartWatch App useless I took my Sony 2 smart watch with me in the dinghy (Supernova tri). WinGps Smart watch  app sucked the battery empty in less than 1 1/5 hour... did anyone from the development team ever go sailing with the watch app?",
        "Insufficant depth nav. Needed to be good app.  Color tint each depth"
    ],
    "recentChanges": [
        "Updates:",
        "- Removed the limit of 50 visible AIS-Targets. The user can still limit the number of visible AIS-targets, by filtering by range (RNG)."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.stentec.wingps_marine_lite&hl=en&gl=us",
    "appId": "com.stentec.wingps_marine_lite"
}