{
    "title": "Naukrigulf- Career & Job Search App in Dubai, Gulf",
    "summary": "Find jobs in Dubai, UAE, Gulf by top employers including part time, walk in jobs",
    "icon": "//lh3.ggpht.com/gR8BaT5kG-4wLIRzT2D-KKv_33aBVgWqkL1_beNBdreA_MCjOuZIcJ_mKRKjuSIGes0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.4,
    "reviews": 46576,
    "developer": "infoedge.com",
    "developerId": "infoedge.com",
    "developerEmail": "android@naukri.com",
    "developerWebsite": "http://www.naukrigulf.com",
    "updated": "January 18, 2018",
    "version": "3.25",
    "genre": "Business",
    "genreId": "BUSINESS",
    "description": "Looking for Jobs in the Gulf? Apply to the latest Jobs anytime, anywhere with the Naukrigulf app. Indeed, we are among the top choices of job seekers as more than 1 million Android phone users count on the Naukrigulf app to find the best career opportunities.Why Naukrigulf app?- It is the best-rated job and career search app in the Gulf- It’s free, simple, fast and offers the most relevant job search results- It lets you choose from a wide range of 40,000+ job vacancies in the Gulf- It lets you find Jobs in the UAE, Saudi Arabia, Bahrain, Qatar, Kuwait, and Oman1. Find & Share Jobs- Find full-time, part-time, and contractual Jobs- Refine job search results by:o Location – Dubai, Abu Dhabi, Sharjah, Riyadh, Jeddah, Doha, Muscat, etc.o Industry/Department – Oil and Gas, IT, Healthcare, Finance, Retail, HR, Admin, Design, etc.o Company Name – Marriott, Qatar Airways, Air Arabia, ADNOC, etc.o Designation/Skills – Executive, Senior Executive, and Managerial Jobs across industries.o Experience – Entry Level, Mid-Level, and Senior Levelo Freshness- Share Jobs with your friends via email or social networking sites2. Explore Job Recommendation- Get personalized Jobs directly to your email inbox:o Jobs based on your profile and preferenceso Jobs trending among profiles similar to youo Jobs similar to the ones you likeo Jobs based on the alerts set by you- Explore Jobs similar to ones you apply3. Shortlist & Apply- Save or email Jobs you would want to view and apply later- Apply to Jobs with a single click without registration- Create your profile directly on the app via Facebook/Google+- Create/Upload your CV directly on the app and start applying to relevant Jobs4. Monitor Profile Performance- View detailed insights on your job applications, including:o How well your profile matches with the job requirementso Where do your applications rank amongst other applicantso Who all and how many recruiters reviewed your applicationso What actions the recruiters have taken on your applications- Discover recruiters who showed interest in your profile without any job application5. Update & Customize- Update your profile and CV on the go- Update your job alert preferences- Subscribe or unsubscribe to emails6. Stay Notified- Receive recommendations for latest job vacancies- See recruiters’ actions on your application- Receive regular suggestions for improving your profile- Stay updated about the latest app developmentsCommitted to making the job search a hassle-free experience, the Naukrigulf Android App helps job seekers get linked to the employers as well as with the latest Job opportunities. Download the app for free today and get Jobs delivered directly to your phone! Can’t find something or have suggestions? Mail us at feedback@naukrigulf.com.",
    "descriptionHTML": "Looking for Jobs in the Gulf? Apply to the latest Jobs anytime, anywhere with the Naukrigulf app. Indeed, we are among the top choices of job seekers as more than 1 million Android phone users count on the Naukrigulf app to find the best career opportunities.<br><br>Why Naukrigulf app?<br><br>- It is the best-rated job and career search app in the Gulf<br><br>- It&#x2019;s free, simple, fast and offers the most relevant job search results<br><br>- It lets you choose from a wide range of 40,000+ job vacancies in the Gulf<br><br>- It lets you find Jobs in the UAE, Saudi Arabia, Bahrain, Qatar, Kuwait, and Oman<br><br><br>1. Find &amp; Share Jobs<br><br>- Find full-time, part-time, and contractual Jobs<br><br>- Refine job search results by:<br><br>o Location &#x2013; Dubai, Abu Dhabi, Sharjah, Riyadh, Jeddah, Doha, Muscat, etc.<br><br>o Industry/Department &#x2013; Oil and Gas, IT, Healthcare, Finance, Retail, HR, Admin, Design, etc.<br><br>o Company Name &#x2013; Marriott, Qatar Airways, Air Arabia, ADNOC, etc.<br><br>o Designation/Skills &#x2013; Executive, Senior Executive, and Managerial Jobs across industries.<br><br>o Experience &#x2013; Entry Level, Mid-Level, and Senior Level<br><br>o Freshness<br><br>- Share Jobs with your friends via email or social networking sites<br><br><br>2. Explore Job Recommendation<br><br>- Get personalized Jobs directly to your email inbox:<br><br>o Jobs based on your profile and preferences<br><br>o Jobs trending among profiles similar to you<br><br>o Jobs similar to the ones you like<br><br>o Jobs based on the alerts set by you<br><br>- Explore Jobs similar to ones you apply<br><br><br>3. Shortlist &amp; Apply<br><br>- Save or email Jobs you would want to view and apply later<br><br>- Apply to Jobs with a single click without registration<br><br>- Create your profile directly on the app via Facebook/Google+<br><br>- Create/Upload your CV directly on the app and start applying to relevant Jobs<br><br><br>4. Monitor Profile Performance<br><br>- View detailed insights on your job applications, including:<br><br>o How well your profile matches with the job requirements<br><br>o Where do your applications rank amongst other applicants<br><br>o Who all and how many recruiters reviewed your applications<br><br>o What actions the recruiters have taken on your applications<br><br>- Discover recruiters who showed interest in your profile without any job application<br><br><br>5. Update &amp; Customize<br><br>- Update your profile and CV on the go<br><br>- Update your job alert preferences<br><br>- Subscribe or unsubscribe to emails<br><br><br>6. Stay Notified<br><br>- Receive recommendations for latest job vacancies<br><br>- See recruiters&#x2019; actions on your application<br><br>- Receive regular suggestions for improving your profile<br><br>- Stay updated about the latest app developments<br><br><br>Committed to making the job search a hassle-free experience, the Naukrigulf Android App helps job seekers get linked to the employers as well as with the latest Job opportunities. Download the app for free today and get Jobs delivered directly to your phone! <br>Can&#x2019;t find something or have suggestions? Mail us at feedback@naukrigulf.com.",
    "histogram": {
        "1": 1368,
        "2": 942,
        "3": 3782,
        "4": 12623,
        "5": 27861
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/OkwV5Kz_dlV19oCTFm8QDv5l9zeVFG9VShMKEvo80IuIBqCdfwzbtJBgmCwKKL1vRQ=h310",
        "//lh3.googleusercontent.com/-fXWfj9m_n-MtzlZILeyu_VIxuvyqp8RJTDuZBq0BqA3wzR5J1QvJbd0CvSTTN48hQ=h310",
        "//lh3.googleusercontent.com/BByyWw45uo4LWnrxMmLZmbX11ING4JGfa3VEn9ELik4M1SoP-tPA58SZEc-XEeS4erw=h310",
        "//lh3.googleusercontent.com/lM7fGIj-dIr95GPqcGMGVGT2ZJB9o2fEmICIVaO8XBjBaUBZTMcKfVUXXBF1LKtJ1A=h310",
        "//lh3.googleusercontent.com/v0mHawt6hsvSoyeGPafWL26DnSKZNxTjQkMpR-7kI5kBRR8_nH9_UPHCNBgzlo8B030=h310",
        "//lh3.googleusercontent.com/c9_qOuRYwAqd7QEus1AMSWnTT5QTTfn6EfyyoUgYMT72JzjIoZvws51OOveIXXPO_ik=h310",
        "//lh3.googleusercontent.com/ctz1NxhedwXAftKfA5ZNWAsPxMxQTWGnOkb4yMVxlHIg_AK-EwBHTWMLru2DO7NnIg=h310",
        "//lh3.googleusercontent.com/IdZw1U9wyLhlqiZd71Knj1LLBtTgbEaHGAbQ7U7C3IOpxkpS8U4L1op3E_tBqz3hnS3f=h310",
        "//lh3.googleusercontent.com/1UXd6n-vkOJcF8vmJbouhFCTCxk459qBOiq7poWmzg1m1O0nYno8acsvC-Akl4Ojvf4=h310"
    ],
    "video": "https://www.youtube.com/embed/hJxnnf9xrLc",
    "comments": [
        "I dnt like it all. Even if u put your Work Experience as Fresher. U will get the Shorlist Job of Atleast 2-10 year Experience. And if u wnt to Keep your Profile on the Top thn u hve to pay for it i.e $82. If this Is the Thing Thn whts the Difference between NaukriGulf And Monster/Shine... They 2 do the same  Charge for Something. HATE This App. I think so they dont even Deserve 1Star",
        "Most pathetic paid services. They will not forward your application till you pay them. Once you pay them they will not bother to talk to you. Very bad experience. Try Times job as Naukri has registered fake recruiters, who will call you and ask for money. Please someone let me know that how can I sue Naukri, I will be grateful to that person.",
        "Good App but Worst Service. Naukri India Deserves more than 5 star but Naukri not even deserves a Single. all the openings Look Like fake as there's no Response from the recruiters. If recruiters really needs employee atleast they see your profile.Naukri Should Stop their Gulf Services. Waste of Money and Time.",
        "Everywhere I read never, pay any amount to any job portal or company to get hire, I never ever have been selected or contacted by any  hr, any company, or any employer, numbers of application I have submitted here but no response, always shows that 50%, 40% or 30%, matching, nothing else more than it. May be i'm not paying any amount to them, this is  the only reason,  its simply ennui, wastage of time full of garbage, now boycotting from this app.",
        "Unable to find jobs in my field, nor recruiters are viewing profile... unsure whether it really works for job purposes outside India",
        "Don't ever go with their premium package, crappie outdated resume templates, profile spotlight that doesn't give anymore visibility, a scrap of available jobs, no exclusive placements for them to offer you... Simply avoid"
    ],
    "recentChanges": [
        "Naukrigulf App version 3.26 is now available for Download at Play Store",
        "·         Experience one-click apply to selected jobs posted on external website",
        "·         Other Performance Enhancements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.naukriGulf.app&hl=en&gl=us",
    "appId": "com.naukriGulf.app"
}