{
    "title": "Source (News Reader)",
    "summary": "All of your news, all in one place.",
    "icon": "//lh3.ggpht.com/Bgg_cMk8HCEKPqQqBJwG-BUp_YrectAo1pL5DAQ2Bzv4cfKE5ipwWq9QlzegiOoLUyQ=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.6,
    "reviews": 252,
    "developer": "Luke Klinker",
    "developerId": "6337185423976596164",
    "developerEmail": "luke@klinkerapps.com",
    "developerWebsite": "http://www.klinkerapps.com",
    "developerAddress": "1218 NE 49th St\nAnkeny, IA 50021",
    "updated": "June 29, 2017",
    "version": "3.5.3",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "description": "Simple, smooth, and fun. Source puts all of your news in one place!  Source pulls articles from different services such as Feedly, Twitter lists, Inoreader, RSS, and The Old Reader to give you all of the most up to date news that you are looking for. You can easily sign in to any of these services that you want to use and start personalizing your content to fit your needs, or you can choose from the default list of sources through Twitter. Features:- Beautiful, simple, and smooth user interface you'll love- Tons of theming and color options to make make the app personalized to your favorite look- Android Wear support to read your news right on your wrist- Feedly,Twitter, Inoreader, The Old Reader, and RSS integration to find all of your favorites, all in one place- View full articles in the app, not just summaries that Feedly or other services provide- Chrome Custom Tabs support if you need to head to the webpage instead of just viewing the textSource isn't a fully-featured replacement for services such as Feedly, and that isn't the goal! It won't allow you to add new subscriptions to each category or manage subcategories. Where Source shines is putting content right where you want it, all in one place so you can read what you want and skip past others without missing a beat. News is fun, easy and beautiful to look at!Enjoy, and feel free to reach out to us if you've got any questions!",
    "descriptionHTML": "Simple, smooth, and fun. Source puts all of your news in one place!  <br><br>Source pulls articles from different services such as Feedly, Twitter lists, Inoreader, RSS, and The Old Reader to give you all of the most up to date news that you are looking for. You can easily sign in to any of these services that you want to use and start personalizing your content to fit your needs, or you can choose from the default list of sources through Twitter. <br><br>Features:<br>- Beautiful, simple, and smooth user interface you&apos;ll love<br>- Tons of theming and color options to make make the app personalized to your favorite look<br>- Android Wear support to read your news right on your wrist<br>- Feedly,Twitter, Inoreader, The Old Reader, and RSS integration to find all of your favorites, all in one place<br>- View full articles in the app, not just summaries that Feedly or other services provide<br>- Chrome Custom Tabs support if you need to head to the webpage instead of just viewing the text<br><br>Source isn&apos;t a fully-featured replacement for services such as Feedly, and that isn&apos;t the goal! It won&apos;t allow you to add new subscriptions to each category or manage subcategories. Where Source shines is putting content right where you want it, all in one place so you can read what you want and skip past others without missing a beat. News is fun, easy and beautiful to look at!<br><br>Enjoy, and feel free to reach out to us if you&apos;ve got any questions!",
    "histogram": {
        "1": 28,
        "2": 31,
        "3": 54,
        "4": 45,
        "5": 94
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/PSdH44wvVTCKMWZJvEOxeso50le2DI_LXVmD6DlMOfW36P3l5tYG3jMHWSZXYv2bxA=h310",
        "//lh3.googleusercontent.com/w_KO9MF57SKrQGBfzU34hXuEigDsOrwTq6zCmfjsIsXfaK4utO4CexYdxT0iyIbutKk=h310",
        "//lh3.googleusercontent.com/6AObDqRFWXew9y13_SQ5503lGzpXSr9mIbnMPnqZQpSBC6FpSG6sZP8wuA3N_aa5kB4=h310",
        "//lh3.googleusercontent.com/zZn2lwQrCx0YMGyP42m7qxAPNaZJKCOGT0A5xbgbZM_Ck2LwRCEgyGI10yyZ1-e01e0=h310",
        "//lh3.googleusercontent.com/DkZugVQmK8Gsm6nI5G-s4VTglWsr9tsZRWEzlLP4yIcrek2A7XMdObaLKfTZUddttKA=h310",
        "//lh3.googleusercontent.com/Ad2ANFFn9dqOi-cySNDElqHKn8-AYzu5Os91sKArnvAykWXARj6q1mwsmiSDgJR-KnE=h310",
        "//lh3.googleusercontent.com/IjDCsfiIVKIjiwhDNgvVQd_jGuY71wnMugfesSHqt6WvxywQzvpDRwCEKjAyT5dfs48o=h310",
        "//lh3.googleusercontent.com/hQVBGcx-0dhtXlOqb71N2ZPE_xhstHO-BqzwxOEMUI2FB25pIaK7bsMiBiNqcEpy8Zo=h310",
        "//lh3.googleusercontent.com/xxYAXTc2IMixmGTB9FqaFYyT29-yhmjHUxdcCHFoXh9dfWZQxwsvtQtoPpoTpHyyXz4=h310",
        "//lh3.googleusercontent.com/0fm3rQgajyubQ1HBkOlO1VtcUO503WPP6BxRuynxBdco_3grQy4BQnua4PmYIwS3uqo=h310",
        "//lh3.googleusercontent.com/XdpKCtwsPq17CI5BqX-YH4L3kaqToJjkw4X1OZlwZJLLqM96LY4ukN3XKxLW9Swx5ct1=h310",
        "//lh3.googleusercontent.com/zNEXbuQmThRyYt7-tFGRf6mAeSCQm67seRNVFkjBvaw6S6B9ofYGvTdzCOjOUuTd4fM=h310",
        "//lh3.googleusercontent.com/Is2-rx3ZfRgFHH1yeuR8eucwDAJSx4aKHe11uWGIUJzWuNK2sm5GRTjglAht7ra0Pg=h310",
        "//lh3.googleusercontent.com/mnWMocOJILSlxtvI2fQ3bMQSUCxybbWFiH9j1JaevWm1b_3HxD7tNOuEeSLNUvwlWYG0=h310",
        "//lh3.googleusercontent.com/4nqow3IF_P6HrMRDkxiiGwlOJGT7qQRijgBiXVuhwS1F3UbN_ntXoDE2xf8oEupIQQ=h310",
        "//lh3.googleusercontent.com/lpX473cr7XsXnnzFdjR7HF9xeca0WAnVZ7kRM01iav6w_EEnIns79sdtz_xANlnpwTgB=h310"
    ],
    "video": "https://www.youtube.com/embed/WSukdY_UrNo",
    "comments": [
        "I like the layout of the app. It looks great and transitions smoothly, but it's impossible to see the full headline (when you use a large font), making it hard to recommend to people who use large fonts.",
        "Great app that makes it so much easier to read my Feedly list! I can only imagine this getting even better with Luke Klinker behind the wheel.",
        "Not terribly active development, at this time, but from an exceptional developer, and has definite 5 ⭐ potential, but not quite there yet. I'm sure if it gets back to 'the front burner' it will quickly evolve into an app with no competition even in its league.",
        "Update: Take a page from the app called \"The Digg\" as u can sign Into your FB and Google accts, etc accounts for personal news... Also, Can now share right to FaceSlim, awesome!  I only have one more wish, keep up the cool swipe away Blackberry like gestures and take a few notes out of flipboards page as in an example if/I can Type \"turtle\" for searching news and it shows up but if I type more specific types of turtles like \"Fly River Turtle\" as in more specific unlike Flipboard it will not show yet I know it is out there and this has the better interface, gestures, etc this is going to be HUGE, keep it up!! Another excellent app for news by an excellent dev of my fave app Evolve SMS. I just wish one thing, please allow us to search ANYTHING at all as flipboard used to do. As in any single word search everywhere for new articles matching any word for instance \"turtles\" or even a specific breed of turtle as in not just what's pre picked for me as in most popular topics but an extremely personalized news \"source\" which will search YouTube and Google, Quora, etc for any words put into favorites.. Then this app will be my one and only news app! Thanks dev... Please update this and sms messages. Talon is becoming for user friendly as well... Source is on its way!..... Love the way it doesn't stay in recent app list when opening widget. I suggest giving this app away free for a few days or weeks or some advertising as its only issue ATM is people do most know about it. Maybe give people a notice in evolve somehow without pissing them off, hmm... the folks who didn't pay for evolve maybe?...",
        "If you are looking for news app that integrates Twitter and other sources.. This is it. Wonderfully done.",
        "Revisiting this app: Still can't import OPML..."
    ],
    "recentChanges": [
        "This version fixes login issues for Feedly, when using a Google account."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.klinker.android.source&hl=en&gl=us",
    "appId": "com.klinker.android.source"
}