{
    "title": "Jungle Crush: Fun Adventure",
    "summary": "Fun block puzzle game combining brick-style gameplay with fast match-3 action",
    "icon": "//lh3.googleusercontent.com/weoFFXUsUljf9Le61r83Fj-_PI9D5v1cemleZeHM8sw3ISGXNfiBf6hwOzzVo1PwvQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.4,
    "reviews": 45,
    "developer": "ElitApps",
    "developerId": "7213613173124737428",
    "developerEmail": "support@elitapps.com",
    "developerWebsite": "http://www.elitapps.com",
    "developerAddress": "207 Regent Street\nLondon\nW1B 3HH\nUnited Kingdom",
    "updated": "December 15, 2015",
    "version": "1.03.3",
    "genre": "Adventure",
    "genreId": "GAME_ADVENTURE",
    "description": "Jungle Crush is a block puzzle game that combines the brick-style gameplay of Tetris with fast match-3 swipe action. Stop crushing candies, it’s time to crush enemies!Follow the adventures of John, a young explorer whose plane crushed in a jungle full of dangerous animals. You must help him advance through the jungle and find Jane and his daughter Alex. With 50 captivating levels, Jungle Crush is an entertaining journey only for the bravest adventurers. Crush jungle enemies by swiping down bricks on their heads while protecting the heroes from being smashed. Tap on the blocks that contain rubies to collect gems and use those to earn the trust of jungle animal friends that help you destroy enemies faster.Main Features:✓ Unique Gameplay. While Jungle Crush includes some familiar gaming elements (i.e. falling blocks, brick breaking, collecting gems), it provides an unique gameplay. Rows of blocks advance steadily from the top of the screen and you must swipe those down to destroy the enemies. Make sure there’s a gap in the row of blocks to avoid crushing your heroes by mistake. The action is fast paced so don’t hesitate too much as blocks will fall by themselves if you wait too long. ✓ Vibrant Graphics. Enjoy jaw-dropping graphics that depict the jungle environment in a captivating way. Vibrant colors and attention to detail will captivate your eye no matter what your age is. Remember those treasure/jungle books you’ve read in childhood? Jungle Crush re-creates that experience through its storytelling visual style. From friendly jungle animals to annoying jungle attackers, you’ll admire every character design in a playful environment.✓ Dozens of Fun Levels. Once the game starts, the fun goes on for dozens of hours as Jungle Crush has no less than 50 different levels. Each level brings in different enemies and new elements that you can match for a more powerful hit. The more you advance, the tougher levels get but this only adds to the game’s addiction. Aside regular levels, you’ll get to play side games such as dodging continuously falling rows of blocks for bonuses.✓ Helpful Jungle Animals. Jack is not alone in his quest through the dangerous Jungle! You can unlock 16 friendly Jungle animals to help him defeat the enemies. From parrots, lions to frogs or piranhas, you’ll be able to collect them all when you have enough gems. To unlock a jungle friend use 100 gems to spin the slots and a random animal will be released. Once an animal is unlocked you can use it during a level. Just match 3 different animal-shaped blocks and unlock an attack from your friendly animal towards the enemy. Collect gems throughout each level to get all the 16 different endearing Jungle animals and see what powers they have.✓ Power-ups. Some blocks will have stars on them and if you manage to swipe 5 of those you’ll activate a temporary power-up (or a jungle friend) that randomly unleashes hell upon your enemy. Make sure you match the stars from each block with an empty star spot beneath Jack to collect them all.Jungle Crush is not yet-another block puzzle game, it also contains unique gameplay elements that make it addictive. Play it often and receive rare gem bonuses and daily prizes. Once you master the Jungle Crush art of swiping bricks, collecting gems and dropping blocks you can invite your friends and see who can get the highest score. The game is available in 10 different languages so you can play it in your native tongue!Do you have what it takes to help John get out of the deadly jungle alive with his friends? Just install the game and start an amazing jungle adventure! We’ve put a lot of effort in developing Jungle Crush so please do share your reviews or send feedback to help us make this the best brick-breaking-meets-block-puzzle game:▶ Facebook: https://www.facebook.com/elitapps ▶ Twitter: https://www.twitter.com/elitapps ▶ Google+: https://plus.google.com/+Elitappscom",
    "descriptionHTML": "Jungle Crush is a block puzzle game that combines the brick-style gameplay of Tetris with fast match-3 swipe action. Stop crushing candies, it&#x2019;s time to crush enemies!<br><br>Follow the adventures of John, a young explorer whose plane crushed in a jungle full of dangerous animals. You must help him advance through the jungle and find Jane and his daughter Alex. With 50 captivating levels, Jungle Crush is an entertaining journey only for the bravest adventurers. <br><br>Crush jungle enemies by swiping down bricks on their heads while protecting the heroes from being smashed. Tap on the blocks that contain rubies to collect gems and use those to earn the trust of jungle animal friends that help you destroy enemies faster.<br><br>Main Features:<br>&#x2713; Unique Gameplay. While Jungle Crush includes some familiar gaming elements (i.e. falling blocks, brick breaking, collecting gems), it provides an unique gameplay. Rows of blocks advance steadily from the top of the screen and you must swipe those down to destroy the enemies. Make sure there&#x2019;s a gap in the row of blocks to avoid crushing your heroes by mistake. The action is fast paced so don&#x2019;t hesitate too much as blocks will fall by themselves if you wait too long.<br> <br>&#x2713; Vibrant Graphics. Enjoy jaw-dropping graphics that depict the jungle environment in a captivating way. Vibrant colors and attention to detail will captivate your eye no matter what your age is. Remember those treasure/jungle books you&#x2019;ve read in childhood? Jungle Crush re-creates that experience through its storytelling visual style. From friendly jungle animals to annoying jungle attackers, you&#x2019;ll admire every character design in a playful environment.<br><br>&#x2713; Dozens of Fun Levels. Once the game starts, the fun goes on for dozens of hours as Jungle Crush has no less than 50 different levels. Each level brings in different enemies and new elements that you can match for a more powerful hit. The more you advance, the tougher levels get but this only adds to the game&#x2019;s addiction. Aside regular levels, you&#x2019;ll get to play side games such as dodging continuously falling rows of blocks for bonuses.<br><br>&#x2713; Helpful Jungle Animals. Jack is not alone in his quest through the dangerous Jungle! You can unlock 16 friendly Jungle animals to help him defeat the enemies. From parrots, lions to frogs or piranhas, you&#x2019;ll be able to collect them all when you have enough gems. To unlock a jungle friend use 100 gems to spin the slots and a random animal will be released. Once an animal is unlocked you can use it during a level. Just match 3 different animal-shaped blocks and unlock an attack from your friendly animal towards the enemy. Collect gems throughout each level to get all the 16 different endearing Jungle animals and see what powers they have.<br><br>&#x2713; Power-ups. Some blocks will have stars on them and if you manage to swipe 5 of those you&#x2019;ll activate a temporary power-up (or a jungle friend) that randomly unleashes hell upon your enemy. Make sure you match the stars from each block with an empty star spot beneath Jack to collect them all.<br><br>Jungle Crush is not yet-another block puzzle game, it also contains unique gameplay elements that make it addictive. Play it often and receive rare gem bonuses and daily prizes. Once you master the Jungle Crush art of swiping bricks, collecting gems and dropping blocks you can invite your friends and see who can get the highest score. The game is available in 10 different languages so you can play it in your native tongue!<br><br>Do you have what it takes to help John get out of the deadly jungle alive with his friends? Just install the game and start an amazing jungle adventure! <br><br>We&#x2019;ve put a lot of effort in developing Jungle Crush so please do share your reviews or send feedback to help us make this the best brick-breaking-meets-block-puzzle game:<br><br>&#x25B6; Facebook: https://www.facebook.com/elitapps <br>&#x25B6; Twitter: https://www.twitter.com/elitapps <br>&#x25B6; Google+: https://plus.google.com/+Elitappscom",
    "histogram": {
        "1": 2,
        "2": 4,
        "3": 2,
        "4": 1,
        "5": 36
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/HMS1dFm3LXx-tVSNdriZW7sKcz13uZLfoR1jAGUuRB6g2Hh8q2OE_3G2OZYZ4aFDnl0=h310",
        "//lh3.googleusercontent.com/XUPvLJKJbCHZ0xg5vGOUi5HmN1uAbg4kcyyQDEGXVQWNdFM-7ihH6SplJrpFpA6fyhM=h310",
        "//lh3.googleusercontent.com/DGBhrePCE50pEwH2HzKTQs3DE-rJPku8sQniz4ZJyLylUGG92pdTXfppnMgBBqjVpbwm=h310",
        "//lh3.googleusercontent.com/k0ma6m7V3eRVcpi1W5_DvRAIGtH3IzDT6NhmoKRVWINcd3jur_qpJGNLN_pjVmMMtQ=h310",
        "//lh3.googleusercontent.com/mWyaiWHncjs8NP35Gx5z3wJTOSYsFCGoBB4E1ZFLZbwrkDFsPCcLZrA4_E7s8_qeTnrV=h310",
        "//lh3.googleusercontent.com/dUY4hA3zGKO31CGq1_m-e6eBY88nWdD2nxGRLM6xcud4TOWYb5zQjtpzlhYZiedMYQ=h310",
        "//lh3.googleusercontent.com/tnMJHipKYX7P_pq9oT_E5brH-43rYcX-nLuL0gK7EPDghJSjY68rlO9W5qh4QskpUw=h310",
        "//lh3.googleusercontent.com/hfgkpIlMeaTMawwiYDtv5I6sgqaJSttIVvZNrFUmDDiEakqReKWjsBy80XAFvz6mcp0=h310",
        "//lh3.googleusercontent.com/8zpcC8t1NvzsDa3OvPcb-UVsdmGPJsUSHZiLNZlD2cOnzDyi0SuHn8ULMRV-NffpNo6h=h310",
        "//lh3.googleusercontent.com/uXoO1fj3jvpwUZDfj_kf_hAuSemQn6AmnzTZdhWAGLSOz6iFKWD-Jr-mcKWEsmY5Ag=h310",
        "//lh3.googleusercontent.com/DpEII5ZpDkeOQe-3yloGcyRURHLdzbJALF-Mfrk2Zs3RD_x2QPmhZ3Ef_R0Ua9I-7_g=h310",
        "//lh3.googleusercontent.com/ObrVYBLPPNUGqppH6ifwyA6No5qH-iYXV7-_FHo6zww14zyfQybTrTKwT6KX8pwx3AQ=h310",
        "//lh3.googleusercontent.com/IMlwy2hTiXHqGG5frXWKbvJXjvau8id3uuwXoo7clOQsoKTphOM38U7TL7vgIj65eAU=h310",
        "//lh3.googleusercontent.com/C2a4KX2n_U1r2mfxDsWTvMe52p1ySzx0PfLto7N94-SsGz4VNFZbgdxANXQDRL2JaA=h310",
        "//lh3.googleusercontent.com/0oMyrWEuFYnIXgOw6OVzozy5jQ9XNQb9FkbEHz6BL1HxAuH8spgez7tkCKDQn6aWLjc=h310",
        "//lh3.googleusercontent.com/8inTLqPK0l4ntrQdhjbr2ktXs-tI3AUEneWkoPs6uh3mN83snMG94LifgLLcSfGvar0=h310",
        "//lh3.googleusercontent.com/6V7b0f_AlKnXVXSRYvCqdvnpLHHub2B4DRiGpoJkNgLc3hReUXysFXlwgsKh3j0GWrY=h310",
        "//lh3.googleusercontent.com/cTmgBGsykYADK4xLEze3lSTLA4fqeIXT6iRhrnCFxM06QWDlOwut7mM52fSI-vxjjA=h310",
        "//lh3.googleusercontent.com/BE0_o8X8iBMbTvvOXdWVwTqf7lsQOewtykFEK5Q2f8uFpHJcDmZgR8hnBHZxXImyWGco=h310",
        "//lh3.googleusercontent.com/acz6NQ6NqeU6HluD-0Fzt6sLNxkZaWy8vwbVjRni5EzxhCSw60MkmfCvJaxdM53DEQ=h310",
        "//lh3.googleusercontent.com/Wk5l5ZOKDX5eCh2Oo6d94LjQEfWFffjIyZjKYDUhZoNswOs8Iwo_p9uEjtgiVB6fjeg=h310",
        "//lh3.googleusercontent.com/dyYtAE2UVZyU4MdOb2fCha8HOQ1Yt7TXlJW47vZnWZCMopgAuf8tuZL-reIUjEK1fYI=h310",
        "//lh3.googleusercontent.com/VsS_XQ7uR-5rNRlaQTeNOZniiwqmbTyQgoREhlpazw8rUy0WnyqRN075VfDtnXsSfSI=h310",
        "//lh3.googleusercontent.com/2P5eYJqbynctPQUB1cbQRwQl2ocbBziro9gmiMRbABiJg7iG0lvMRP2JAhDIcjYqBQ=h310",
        "//lh3.googleusercontent.com/FLp1Yb-3WgPplkRMhlNRwZvIDpGKx2kCMbVA8L9Vhh1HcXNN7LHrcBkzIt3Fh7b96gM=h310",
        "//lh3.googleusercontent.com/edRq2rGGQnvkX9J89bI5V10e83uEHSyGisGePKEfFXZQX86M--E5ysneq2Gn2i_CLs4=h310",
        "//lh3.googleusercontent.com/x2tiF7lPZocMCyhiWyxAsJJI837cncMhvFQ_ubEeAdlFGVbg8pMy4yjSya0xZGrq7hP-=h310",
        "//lh3.googleusercontent.com/o8q2NkKOcykvwRNn116kfcT037JQPiwX1XplC6o9gH-XbpusxfKLipOyOT8_gOcOxg=h310"
    ],
    "video": "https://www.youtube.com/embed/IAVUi2arJAU",
    "comments": [
        "Quirky and addictive! Great concept, easy to get into and has that 'just one more go' feel. Ads have been reduced since my last comment! Loving the cute animal attacks :)",
        "It's a nice game I  have played this game for several weeks and I can say, is very addictive.",
        "My fav game It's just so awesome,amazing and addictive. Love it!",
        "It's a game A great,  fun way to kill time",
        "I love this game so much its alot of fun and good to pass time",
        "Great app This is a very fun app and its good for passing the time"
    ],
    "recentChanges": [
        "First public release of Jungle Crush on Google Play!",
        "We hope you'll enjoy our game!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.elitapps.JungleCrush&hl=en&gl=us",
    "appId": "com.elitapps.JungleCrush"
}