{
    "title": "PowerIP (for Aviosys IP Power)",
    "summary": "Remote control devices anywhere with your mobile &amp; an Aviosys IP Power strip",
    "icon": "//lh3.ggpht.com/QbnkF8uUDOaVwrleSg4N-_3Erm02Ee1Q_vjrcJwlytOJ1fMnQXowyEGajmYHLMaCDoU=w300",
    "price": "$1.98",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 4.6,
    "reviews": 25,
    "developer": "Amapps",
    "developerId": "Amapps",
    "developerEmail": "amapps2012@gmail.com",
    "developerWebsite": "http://twitter.com/amapps2012",
    "updated": "July 15, 2017",
    "version": "11.4",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "* Please contact me if you have any issues rather than leaving a negative review *This software is for the IP Power 9258 / 9222 / 9223 / 9255 / 9212 / 9280 / 9820 / 9858 / 9216 range of Aviosys network controlled power strips (PDU's). You can power on or off an unlimited number of devices remotely from anywhere in the world using your Android mobile or smart watch, schedule events for the devices to turn themselves on and off, or power cycle a device such as a router or server to reboot it.   The various available Aviosys IP power strips are here: http://bit.ly/10qUS9n There is a full user manual here: http://bit.ly/1a9oM5GNOTE: to access the menus in PowerIP use your phone's menu button or press the three dots on the screen. See section 13.11 of the manual if you're not sure where to find it.Possible applications for PowerIP are:  -\trebooting or power cycling a server or router by remote control if it has crashed-\tturning your computer on or off when you are out so that you can use it remotely-\tremote control security lights to turn them on or off when you are out-\tremote control heating systems-\tusing your Aviosys power strip as a remotely programmable time switch-\thome automation applications-\tpower off your devices to save energy rather than leaving them on standby-\tmonitoring equipment (with the 9212 Delux)-\tcontrolling equipment based on events such as ambient light, timers, location (using Tasker, available separately) Features: -\tremote control as many power strips as you like (including the 1, 4 and 8-port variants of the Aviosys power strips/switches)-\trun macros to control your equipment-\tAndroid Wear support-\tgive each power strip a nickname-\tuser definable names for each of the controllable outputs-\tget output names from the power strip during setup to save yourself having to type them in-\tgroup your frequently used equipment onto a favourites screen-\tcreate shortcuts on your home screen-\tget and set schedules on the power strips themselves to switch devices on or off automatically at preset times-\tpower cycle an output using a specified delay-\tread the status of the inputs on the 9212 Delux-\tmonitor temperature and current-\tpassword protect your settings-\t\"protect\" individual power outputs to prevent a user from accidentally powering off important equipment-\t“protect” power outputs so that certain users cannot control them at all-\timport/export server settings for easy deployment across multiple devices-\tintegration with other apps using Android intents It's easy to set up. Just go into the server configuration menu and enter the user name, password, server address (an IP address or domain) and port for each of the power strips/switches. For the server address, you should not include \"http\", but instead just the address e.g. myserver.myhouse.com or 192.168.1.2. Then enable/disable the security options for each power strip. If the \"protected\" checkbox is enabled, then any output names which are enclosed in round brackets e.g. \"(FTP server)\" will be disabled from being switched. In the settings menu, a preferences password can be applied by selecting the \"password required\" checkbox and entering a password. The default password is \"admin\". Once set up, the status and names of each output will be shown as on or off. To toggle each output, just press the appropriate output. Swipe left/right to move to other power strips, or up/down to pick from a list. Long press an output to power cycle it (if supported by your power strip/switch). If supported by your power strip/switch, you can also get/set schedules for the outputs to turn on/off automatically. Currently supported switches are: IP9258 S/T/PingIP9258 SPIP9258 HPIP9258 WiFiIP9258 W2IP9223 KIP9258 SXIP9258 DSIP9258 ProIP9258-1UIP9258 xxIP9255IP9222IP9212 DeluxIP9255 ProIP9255 WIP9280IP9820IP 9858/DXIP Sensor 9216If yours isn't listed, please get in touch and we can add support.",
    "descriptionHTML": "* Please contact me if you have any issues rather than leaving a negative review *<br><br>This software is for the IP Power 9258 / 9222 / 9223 / 9255 / 9212 / 9280 / 9820 / 9858 / 9216 range of Aviosys network controlled power strips (PDU&apos;s). You can power on or off an unlimited number of devices remotely from anywhere in the world using your Android mobile or smart watch, schedule events for the devices to turn themselves on and off, or power cycle a device such as a router or server to reboot it.<br>   <br>The various available Aviosys IP power strips are here: http://bit.ly/10qUS9n<br> <br>There is a full user manual here: http://bit.ly/1a9oM5G<br><br>NOTE: to access the menus in PowerIP use your phone&apos;s menu button or press the three dots on the screen. See section 13.11 of the manual if you&apos;re not sure where to find it.<br><br>Possible applications for PowerIP are:<br>  <br>-\trebooting or power cycling a server or router by remote control if it has crashed<br>-\tturning your computer on or off when you are out so that you can use it remotely<br>-\tremote control security lights to turn them on or off when you are out<br>-\tremote control heating systems<br>-\tusing your Aviosys power strip as a remotely programmable time switch<br>-\thome automation applications<br>-\tpower off your devices to save energy rather than leaving them on standby<br>-\tmonitoring equipment (with the 9212 Delux)<br>-\tcontrolling equipment based on events such as ambient light, timers, location (using Tasker, available separately)<br> <br>Features:<br> <br>-\tremote control as many power strips as you like (including the 1, 4 and 8-port variants of the Aviosys power strips/switches)<br>-\trun macros to control your equipment<br>-\tAndroid Wear support<br>-\tgive each power strip a nickname<br>-\tuser definable names for each of the controllable outputs<br>-\tget output names from the power strip during setup to save yourself having to type them in<br>-\tgroup your frequently used equipment onto a favourites screen<br>-\tcreate shortcuts on your home screen<br>-\tget and set schedules on the power strips themselves to switch devices on or off automatically at preset times<br>-\tpower cycle an output using a specified delay<br>-\tread the status of the inputs on the 9212 Delux<br>-\tmonitor temperature and current<br>-\tpassword protect your settings<br>-\t&quot;protect&quot; individual power outputs to prevent a user from accidentally powering off important equipment<br>-\t&#x201C;protect&#x201D; power outputs so that certain users cannot control them at all<br>-\timport/export server settings for easy deployment across multiple devices<br>-\tintegration with other apps using Android intents<br> <br>It&apos;s easy to set up. Just go into the server configuration menu and enter the user name, password, server address (an IP address or domain) and port for each of the power strips/switches. For the server address, you should not include &quot;http&quot;, but instead just the address e.g. myserver.myhouse.com or 192.168.1.2.<br> <br>Then enable/disable the security options for each power strip. If the &quot;protected&quot; checkbox is enabled, then any output names which are enclosed in round brackets e.g. &quot;(FTP server)&quot; will be disabled from being switched.<br> <br>In the settings menu, a preferences password can be applied by selecting the &quot;password required&quot; checkbox and entering a password. The default password is &quot;admin&quot;.<br> <br>Once set up, the status and names of each output will be shown as on or off. To toggle each output, just press the appropriate output. Swipe left/right to move to other power strips, or up/down to pick from a list. Long press an output to power cycle it (if supported by your power strip/switch).<br> <br>If supported by your power strip/switch, you can also get/set schedules for the outputs to turn on/off automatically.<br> <br>Currently supported switches are:<br> <br>IP9258 S/T/Ping<br>IP9258 SP<br>IP9258 HP<br>IP9258 WiFi<br>IP9258 W2<br>IP9223 K<br>IP9258 SX<br>IP9258 DS<br>IP9258 Pro<br>IP9258-1U<br>IP9258 xx<br>IP9255<br>IP9222<br>IP9212 Delux<br>IP9255 Pro<br>IP9255 W<br>IP9280<br>IP9820<br>IP 9858/DX<br>IP Sensor 9216<br><br>If yours isn&apos;t listed, please get in touch and we can add support.",
    "histogram": {
        "1": 2,
        "2": 0,
        "3": 0,
        "4": 1,
        "5": 22
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/x5nr03g1_GRQtKESzPdqrhOOrgWTJqqcp1oZ8toQB4JjWCUf45-SRoLqYU-1z63r6jg=h310",
        "//lh3.ggpht.com/683GvRQqi92VzBSeclkG01qqTheMgX0_ojMXJVtD8ZYhoMamvFPM6fJuatsgRv7FbD0=h310",
        "//lh3.ggpht.com/n3p_1d9cfHCRpRyL_J7CE0iNlrKhhqlMaUtwNvEg-1R0qLNte1uRPGDAmpJ1KpOoVA=h310",
        "//lh3.ggpht.com/uI35GOCY7iGWWJQZ6We6bwrWriUrWXFCWaOBwkmfp6pPC4UCKc1YybVONdsCZ_xd1RM=h310",
        "//lh3.googleusercontent.com/4TUMWZyJ_dhsq6awgRlyNDetcbZBwzaCm3CNq7axjL6jxIMiaCI53i4hjRla4mYpx_U=h310",
        "//lh5.ggpht.com/JsZwW271iLF1_FfVtIBSgku0-fswW8femjQh1kQGutbW--XclY2uzKFMf7IaBbJUqaU=h310",
        "//lh6.ggpht.com/sIilH3hyi2I1WNAm87adRP9paSXesWVNwde4Q833twE8KM7ZKcmrM6zkOpDIIwzd_zw=h310",
        "//lh5.ggpht.com/zJPC5O1e72k-t13gkma09Czd40z4hanifkuVoSxGqhJDB7lUZSsVXuiJ_DV_-ZpcEpA=h310",
        "//lh6.ggpht.com/2gqRjY0gQOVD_znT8bzV0w7xjJEKxX95ZhbI8ONadAWkKgEbuqcz5MZocM9ss6uD9w=h310",
        "//lh4.ggpht.com/1YoJ0WJt92bLn-42tvqyQ__g3ejFZhd5D1gqQKybKL1yWVeU2k8bupz6bBosde41i9g=h310",
        "//lh3.googleusercontent.com/N0DSRv_CRQ-6a-EnnsmN5jfOsbFe8Wb70JjzCqoXd8MdlWToH2i4j9jou3sQkVrSWg=h310",
        "//lh3.ggpht.com/fXazeJLp8KzseFghJU8cBoFBUxTdIemFcDRdYLaYGkpA3Mc6wPDXFvnYaD2-VbUJ0fUM=h310"
    ],
    "comments": [
        "Much better than the official version",
        "Fantastic!!! I've used this app since I had my note 2 and then when I purchased my note 3 I used it again and Note 4 and now I'm using my Note 5. And now the developer has updated the app to include the setup page on the main screen. He worked so well with me getting that accomplished and I'm so happy that now we can have the set up on the upper right hand corner of the screen. Fantastic app.  Love it everyone should get this one",
        "Fantastic Great convenient APP. Had slight issue with one feature and developer worked tirelessly and promptly to address issue and updated APP to suit. Would thoroughly recommend.",
        "Excellent App Fantastic app for accessing your remote power. Really easy to configure. Had an initial problem with connection to remote power unit but the developer has been outstanding in replying and fixing the issue..easily gets 5 stars Just configured a couple of macros with the aid of the excellent manual....love the way you can put shortcuts to macros on your home page!!!",
        "Awesome This app is great works very good...",
        "AWESOME Flawless app, easy setup, faster than web IU. 10 stars app"
    ],
    "recentChanges": [
        "11.4: Fixing bug in the \"test server\" feature",
        "11.3: Fixing bug in the \"create shortcuts\" feature",
        "...",
        "11.1: Adding support for power cycling on the IP 9820",
        "11.0: Adding sunrise/sunset function when setting schedules",
        "Adding location/timezone in server settings for the \"sunrise/sunset\" function",
        "Changing the \"now\" function so that it returns the time and date based on the timezone for the switch if specified",
        "Adding #wifion and #wifioff macro commands"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.amapps.android.PowerIP&hl=en&gl=us",
    "appId": "com.amapps.android.PowerIP"
}