{
    "title": "Airbnb",
    "summary": "Find the perfect vacation rental, live like a local, discover new experiences.",
    "icon": "//lh3.googleusercontent.com/BQnvuZR500pg2ulvv3FBmRI93ODz3AjNfbz92hCieuJLvmbGY36AKhETMTTfTDgpPQI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.4,
    "reviews": 261246,
    "developer": "Airbnb, Inc",
    "developerId": "Airbnb,+Inc",
    "developerEmail": "m.feedback.android@airbnb.com",
    "developerWebsite": "https://www.airbnb.com/mobile",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "size": "Varies with device",
    "description": "Unforgettable travel experiences start with Airbnb. Find travel adventures and new places to go far away or near to you, and access vacation home rentals, new experiences, and places to visit all around the world. Book everything for your trip, or start earning money as a host. BOOK TRAVEL EXPERIENCESGo on local experiences led by native experts, whether it’s for multiple days or just an afternoon. Explore Seoul's underground music scene, hunt for truffles in a Tuscan forest, or give back to the community with a social impact experience.BOOK VACATION HOMESChoose from over 4 million vacation home rentals across 191+ countries. Search by price, neighborhood, amenities, and more.POPULAR DESTINATIONSExperience the beautiful sights & find local guides for the perfect vacation:• Rio – Explore the birthplace of Samba or Hand Glide over the sights• Paris – Find your fill in some of the best culinary tours and museums• Barcelona – Discover the cities beauty with guided walking toursFor travelers: • Book vacation home rentals and travel experiences for your next solo journey, family vacation, or business trip• Search for last minute travel accommodations or long term rentals• Save your favorite rental homes, experiences, and places—and invite friends and family to plan the trip with you• Add experiences and events to your itinerary• Message your host and get directions to your homeFor hosts:• Share your extra space or lead experiences that showcase what makes your city great• Update your listing and calendar availability• Share what’s special about your neighborhood with a host guidebook• Message guests and manage their reservations",
    "descriptionHTML": "Unforgettable travel experiences start with Airbnb. Find travel adventures and new places to go far away or near to you, and access vacation home rentals, new experiences, and places to visit all around the world. Book everything for your trip, or start earning money as a host. <br><br>BOOK TRAVEL EXPERIENCES<br>Go on local experiences led by native experts, whether it&#x2019;s for multiple days or just an afternoon. Explore Seoul&apos;s underground music scene, hunt for truffles in a Tuscan forest, or give back to the community with a social impact experience.<br><br>BOOK VACATION HOMES<br>Choose from over 4 million vacation home rentals across 191+ countries. Search by price, neighborhood, amenities, and more.<br><br>POPULAR DESTINATIONS<br>Experience the beautiful sights &amp; find local guides for the perfect vacation:<br>&#x2022; Rio &#x2013; Explore the birthplace of Samba or Hand Glide over the sights<br>&#x2022; Paris &#x2013; Find your fill in some of the best culinary tours and museums<br>&#x2022; Barcelona &#x2013; Discover the cities beauty with guided walking tours<br><br>For travelers: <br>&#x2022; Book vacation home rentals and travel experiences for your next solo journey, family vacation, or business trip<br>&#x2022; Search for last minute travel accommodations or long term rentals<br>&#x2022; Save your favorite rental homes, experiences, and places&#x2014;and invite friends and family to plan the trip with you<br>&#x2022; Add experiences and events to your itinerary<br>&#x2022; Message your host and get directions to your home<br><br>For hosts:<br>&#x2022; Share your extra space or lead experiences that showcase what makes your city great<br>&#x2022; Update your listing and calendar availability<br>&#x2022; Share what&#x2019;s special about your neighborhood with a host guidebook<br>&#x2022; Message guests and manage their reservations",
    "histogram": {
        "1": 16482,
        "2": 6555,
        "3": 12967,
        "4": 50773,
        "5": 174469
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/CyPUSX6FmOp147cy3LJorl6oGcuBMNomDOsh56VuUNjLhyUhPYJ_S2L5n7OR49Bs-uE=h310",
        "//lh3.googleusercontent.com/dOqLcUmwrYJ0vEwpMaNffAkXv8KCJ5hZaMIbnb3_aT6hlg6AXU9gj127LLJRJ0Nw8A=h310",
        "//lh3.googleusercontent.com/rI7i_qL_iW_VV-F1njcKQ1eovacXhGHbFqKp5hOttuFZAZwPLWZN8H7bmH8AxSjuHJFz=h310",
        "//lh3.googleusercontent.com/Q5NPkkT0xpQU_1Xl-wJvNFbKJMhKBwVPw1I78VurC_UzqeDvl4JVvGk_oPQWtSO00zzZ=h310",
        "//lh3.googleusercontent.com/hlVCGLeCE4JRBc7mDlTtxfU1XGOEAM8s0jvnJQwgpzOPhek7MpiAYHRmzKjb5R_V7t4=h310",
        "//lh3.googleusercontent.com/7x3_CrO4TTN4R2r0QlLOeYsMzGiDiz-eiIIrXD-ztHvB9LyfqSp6DZJOXPfy5m87OrX2=h310",
        "//lh3.googleusercontent.com/MvB23-f9pIWcpZqGoVIDBcRW746iDdmv7QiYlPZgKzpwKRB8xUnqzTI19F1S3_Tjwg=h310",
        "//lh3.googleusercontent.com/RUxuSsWfO7jiBcOnw7HXYmbnc9huiT6z1y7Ya5s_Ko_fcX2Z-OuwkMfLlNkNCO074w=h310",
        "//lh3.googleusercontent.com/hGAlWkFPaxVWGWKpMkBsUJJgNnih6JRLK-gMgZGtlMpv36o1Gc0Cvyc77kLlX9ohnk8=h310",
        "//lh3.googleusercontent.com/SfTgN0PZGYZprbcyuALz_qiIxbsZRtBG-XCcUHApRtWl4Go9PkoljVWI4ea90hhSA80=h310",
        "//lh3.googleusercontent.com/qVtWXpz6lxw9nKm9jeS64i37emfrIN_nH5WHATgAvKuHvT0XaeSviBvnHNxiYzTpJgU=h310",
        "//lh3.googleusercontent.com/qHa6Blji9b2CiH441wPJFR4cNYkBj-WDgsYADxkhAkdMeWjgqTu4KQ6vhsNf6_jbTsA=h310",
        "//lh3.googleusercontent.com/d5fsWT-CwRZ3J73LFrejoXtEKU-PO_PQ_UtNo9CvO7XUZzJRePVEs18PSwDgEXSH7as=h310",
        "//lh3.googleusercontent.com/NWlV-qK9stGJv8k7u7qWHpotncyJ-3HvRn5QZWvxTmvMUQ5C686YaCZmzTtMlz0wyg=h310",
        "//lh3.googleusercontent.com/gFNDiWeGRWoMLQ1BWbE9ZkfL9vbSoLKOYxLO5oa89p-8EzOOe52eoyv7SIMyjDJz1jw=h310"
    ],
    "comments": [
        "From the side of a host...AirBnB is quirky. I receive instant book reservations after I knowingly shut I.B. OFF and a few other things. From the travel side, difficult to see distacne to unit you may be booking from area you desire to stay. ...often property is 50 miles from where you think you're booking. Need better location software.",
        "Hell customer service. The host wanted to fully refund to me while i cancelled the booking, but couldn't changed the system of the refund policy if the booking was set. That's why I've asked for a supporter to interfered in. She told me to cancel the booking then help me for the refund. Eventually, i didn't even get my full refund because she couldn't reach the host over the issue. I've lost the 50% refund and the service fee,worse, i gotta to looking for a new room.",
        "For a company that has great reputation in software developers community, the app is amazingly bugged and clunky. Chat seems to work intermittently, requiring the app to restart. Desktop app is so slow and lagging it makes me wonder, as I'm a dev myself, what possibly could go wrong there. Doesn't anyone do performance profiling?",
        "Norton Security has flagged some unusual behaviors in this app.  Why are you guys sharing my information to an unknown location? Is this a bug or deliberate?  To be detailed: the app was flagged to contain intrusive ads, and auto-installing apps in the background.",
        "After my ID was accepted and my booking paid for, I received an email saying my ID was not clear and a refund would take 15 days. Customer support is useless and won't give a reason, or assist in verifying my ID. Very poor experience.",
        "It'd be nice if you can see if they are available for the dates you choose. Real time. I booked, submitted my credit card information like I was going to pay, owner replied. Sorry. This was my first Airbnb."
    ],
    "recentChanges": [
        "Bug fixes and performance improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.airbnb.android&hl=en&gl=us",
    "appId": "com.airbnb.android"
}