{
    "title": "Under Armour Record",
    "summary": "UA Record: Exercise Smarter, Feel Better, Live Longer",
    "icon": "//lh3.googleusercontent.com/b6p6HMKmriUfQexo04p179AQbWITm_mURR0AA62uigO5HbDPm1zqNvj7ILqSJy3g7DY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4,
    "reviews": 14378,
    "developer": "Under Armour",
    "developerId": "Under+Armour",
    "developerEmail": "androidsupport@mapmyfitness.com",
    "developerWebsite": "http://record.underarmour.com",
    "developerAddress": "211 Walter Seaholm Drive\nAustin, TX 78739",
    "updated": "February 20, 2018",
    "version": "3.18.5",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "UA Record™ is the world’s first 24/7 connected health and fitness system. Track sleep, fitness, activity and nutrition. Set and reach goals, connect and sync devices, and follow friends and UA athletes. Get personalized insights to help you feel, look, and perform better. Use the complete and powerful UA Record™ app on its own or with UA HealthBox™. Track and Analyze Sleep, Fitness, Step Activity, Nutrition and Weight⊕ Log workouts including gym, running, fitness classes, yoga, outdoor workouts, and more. ⊕ Use your phone's GPS to map your routes and see how far and how fast you run or ride. Connect your UA Band™, UA Heart Rate™, or other Bluetooth Smart heart rate straps to track heart rate for any kind of workout, including gym, treadmill and yoga. ⊕ See sleep, fitness (workouts), step activity, nutrition and weight activity all in one place. Use any Android phone equipped with Google Fit to track your steps or connect an activity tracker (like UA Band™) or GPS watch. ⊕ Cross-compare data such as fitness vs. sleep, step activity vs. nutrition, and other combinations. ⊕ See your data visualized to identify trends and improve your performance. Set and Reach Goals⊕ Set goals for sleep, fitness, activity, nutrition, and weight. ⊕ See progress to goals by the day, week, month, or year. Join and Challenge the Community⊕ Get inspired by the Under Armour fitness community and invite friends to join. ⊕ Like and comment on friends’ workouts, photos, and videos. ⊕ Create Challenges and invite friends to see who can log the most workouts, take the most steps, burn the most calories, and other activities.  ⊕ Follow Under Armour’s elite athletes and see how the pros get it done behind the scenes and on the field. ⊕ Connect and Sync Devices⊕ Easily connect UA HealthBox™, UA Band™, UA Scale™, UA Heart Rate™ and other devices. ⊕ Use with MapMyFitness® and MyFitnessPal® to aggregate data and have a single view of your activity and progress.",
    "descriptionHTML": "UA Record&#x2122; is the world&#x2019;s first 24/7 connected health and fitness system. Track sleep, fitness, activity and nutrition. Set and reach goals, connect and sync devices, and follow friends and UA athletes. Get personalized insights to help you feel, look, and perform better. Use the complete and powerful UA Record&#x2122; app on its own or with UA HealthBox&#x2122;. <br><br>Track and Analyze Sleep, Fitness, Step Activity, Nutrition and Weight<br><br>&#x2295; Log workouts including gym, running, fitness classes, yoga, outdoor workouts, and more. <br>&#x2295; Use your phone&apos;s GPS to map your routes and see how far and how fast you run or ride. Connect your UA Band&#x2122;, UA Heart Rate&#x2122;, or other Bluetooth Smart heart rate straps to track heart rate for any kind of workout, including gym, treadmill and yoga. <br>&#x2295; See sleep, fitness (workouts), step activity, nutrition and weight activity all in one place. Use any Android phone equipped with Google Fit to track your steps or connect an activity tracker (like UA Band&#x2122;) or GPS watch. <br>&#x2295; Cross-compare data such as fitness vs. sleep, step activity vs. nutrition, and other combinations. <br>&#x2295; See your data visualized to identify trends and improve your performance. <br><br>Set and Reach Goals<br><br>&#x2295; Set goals for sleep, fitness, activity, nutrition, and weight. <br>&#x2295; See progress to goals by the day, week, month, or year. <br><br>Join and Challenge the Community<br><br>&#x2295; Get inspired by the Under Armour fitness community and invite friends to join. <br>&#x2295; Like and comment on friends&#x2019; workouts, photos, and videos. <br>&#x2295; Create Challenges and invite friends to see who can log the most workouts, take the most steps, burn the most calories, and other activities.  <br>&#x2295; Follow Under Armour&#x2019;s elite athletes and see how the pros get it done behind the scenes and on the field. <br>&#x2295; Connect and Sync Devices<br>&#x2295; Easily connect UA HealthBox&#x2122;, UA Band&#x2122;, UA Scale&#x2122;, UA Heart Rate&#x2122; and other devices. <br>&#x2295; Use with MapMyFitness&#xAE; and MyFitnessPal&#xAE; to aggregate data and have a single view of your activity and progress.",
    "histogram": {
        "1": 1409,
        "2": 713,
        "3": 1254,
        "4": 3870,
        "5": 7132
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/HzPxiVfB1h7Ch4BlPkne-hTbPJisp9WPURSF5TaAa5Pxp9vE6sgu1kOFsSwbRub2sw=h310",
        "//lh3.googleusercontent.com/dRGFEBKIZ5eyAJesLz1-Qyw1oyhH88TlhppXkcqj_aSu7fY0up6Wex8Pucqy5kLIIA=h310",
        "//lh3.googleusercontent.com/A5v7UCcAnceH5VOXgB1pF7EPN7Ts1F37VLokBbjwzUMvSJijVBUdwHxD8qge7K8O0Q=h310",
        "//lh3.googleusercontent.com/lgFJHCaJ96_EC9GWscujmgaMC6HGWh2WA-ZbPMInpXqx30fADQpLEn8y21JHqElSHzea=h310",
        "//lh3.googleusercontent.com/EhA_QZ6NyAsaGxWx0zMXSA7eOEW8KFWPkg5UmDUy7eys3pY1y1YCPrt1kmVtjMyHb00=h310",
        "//lh3.googleusercontent.com/_m8TtZ8vfMXlEqqM6SP4d5Au6cEN0iBbvMsDsVF9IfYH0aaZKB1fnshGCRs8Zm0Z-XBb=h310"
    ],
    "comments": [
        "I really wanted to like this app.  However after a while it stops tracking my steps from S Health.  My steps tracked by my Gear fit 2 pro show up in S Health and MyFitnessPal, both of which are connected to UA record, but the steps don't show in my UA app.  Might try this app again if that bug is fixed. Gonna stop using for now tho.",
        "I would give it a great, but it lags bad at times. It has even caused me to restart my phone. However, it's pretty accurate (gps in small spaces not so much)! It has lots of choices for exercises performed or if you need help designing a plan. It also links up to a lot of fitness apps and trackers. I just wish they would fix the lag/freeze up problem!",
        "I am having an issue, over the last 30 days UA Record has stopped talking to Samsung Health for my steps. Before that time they were talking to each other beautifully. Now Record is only counting about 1/4 of my steps recorded by my watch.  I have reloaded both apps on my phone, and am now at a loss as to why this is happening. Help please!",
        "Do not even bother trying to link this to S Health. It works one minute and not the next. Troubleshoot till you're blue in the face and it won't work. Absolute junk. Update: 2/26/2018 the 2/20/2018 app update did not solve the problem.",
        "Integration with UA Band and Samsung Health is a nightmare. I have app permissions for sleep tracking is to sync with UA Band and exercise with Samsung Health, but suddenly it only wants to sync exercise with UA Band.  I checked my app settings and they are correct. When I check \"My Workouts\" it shows that it is syncing with UA Band. It worked just fine in previous app versions.",
        "Gear widget doesn't update. UA Record app doesn't sync properly with Samsung Health. When it does finally sync the steps are incorrect. Map My Run is good, but UAR is awful. Uninstalling from phone and watch."
    ],
    "recentChanges": [
        "Bug fixes and performance improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ua.record&hl=en&gl=us",
    "appId": "com.ua.record"
}