{
    "title": "Anghami Music",
    "summary": "Discover, play and download millions of Arabic and International songs",
    "icon": "//lh3.googleusercontent.com/JFS6-PP5PJf4apuibZMhj1_yHDH6nTEkvqzXHvb2uFEwPJ7q4BsdkqjVJug-73qhrzQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.5,
    "reviews": 654031,
    "developer": "Anghami",
    "developerId": "Anghami",
    "developerEmail": "support@anghami.com",
    "developerWebsite": "http://www.anghami.com",
    "developerAddress": "5th Floor, Zardman Building,\nJal El Dib\nLebanon\nP.O.Box: 1662 Jounieh",
    "updated": "February 23, 2018",
    "version": "3.3.27",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Want to have access to unlimited music, get recommendations that fit your style and keep all your songs in one place? Anghami is the MENA’s largest music streaming app and it has everything you need. Discover, play and download from a library of millions of Arabic and International songs, make playlists for every minute of your day, and share them with everyone.Or let Anghami surprise you with ready-made playlists that will make you fall in love!Create your personalized music library - Gather your favorite songs and create playlists for your every mood and occasion. We will recommend music according to your taste. The more you play, the better the recommendations will be!Discover new music - Let yourself be carried away with the best hits from your favorite artists non-stop by choosing radios or exploring playlists curated by our own team of experts. Find your musical soulmates - Discover music through people whose music style fit yours! Share your best discoveries on Instagram, WhatsApp, Twitter, Facebook, and Messenger!Stay up-to-date - Follow your favorite artists and we will make sure you stay up-to-date with their new music!Enjoy high-quality music - Enjoy music in pure Dolby so you listen to top quality and use little data.Get all this for FREE or aim for much more by enjoying the ultimate Anghami experience with one of our plans!ANGHAMI PLUS:Get unlimited downloads and play them without internet!Enjoy uninterrupted ad-free musicSkip all you wantSing along with the right lyricsAll for 4.99$/month or 49.99$/yearANGHAMI FAMILY PLAN:Get 6 Anghami Plus accounts for less than the price of 2You and up to 5 family members get to enjoy all Anghami Plus featuresEveryone gets to keep their own music and their own playlistsEveryone gets their own recommendationsAll 6 Plus accounts for only $7.49/monthANGHAMI STUDENT PLAN:Enjoy the ultimate Anghami Plus experience with 50% off!Problems? Feedback? We are ready to answer any of your questions on support@anghami.comAnghami Plus, Anghami Student and Anghami Family Plan LegalDetails:Payment will be charged to your Google Account at confirmation of purchaseSubscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current periodAccount will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewalSubscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchaseNo cancellation of the current subscription is allowed during active subscription periodTerms of Service & Privacy Policy http://www.anghami.com/legal",
    "descriptionHTML": "Want to have access to unlimited music, get recommendations that fit your style and keep all your songs in one place? <br><br>Anghami is the MENA&#x2019;s largest music streaming app and it has everything you need. Discover, play and download from a library of millions of Arabic and International songs, make playlists for every minute of your day, and share them with everyone.<br><br>Or let Anghami surprise you with ready-made playlists that will make you fall in love!<br><br><b>Create your personalized music library - </b>Gather your favorite songs and create playlists for your every mood and occasion. We will recommend music according to your taste. The more you play, the better the recommendations will be!<br><br><b>Discover new music - </b>Let yourself be carried away with the best hits from your favorite artists non-stop by choosing radios or exploring playlists curated by our own team of experts.<br> <br><b>Find your musical soulmates - </b>Discover music through people whose music style fit yours! Share your best discoveries on Instagram, WhatsApp, Twitter, Facebook, and Messenger!<br><br><b>Stay up-to-date - </b>Follow your favorite artists and we will make sure you stay up-to-date with their new music!<br><br><b>Enjoy high-quality music - </b>Enjoy music in pure Dolby so you listen to top quality and use little data.<br><br><b>Get all this for FREE or aim for much more by enjoying the ultimate Anghami experience with one of our plans!</b><br><br><b><u>ANGHAMI PLUS:</u></b><br>Get unlimited downloads and play them without internet!<br>Enjoy uninterrupted ad-free music<br>Skip all you want<br>Sing along with the right lyrics<br>All for 4.99$/month or 49.99$/year<br><br><b><u>ANGHAMI FAMILY PLAN:</u></b><br>Get 6 Anghami Plus accounts for less than the price of 2<br>You and up to 5 family members get to enjoy all Anghami Plus features<br>Everyone gets to keep their own music and their own playlists<br>Everyone gets their own recommendations<br>All 6 Plus accounts for only $7.49/month<br><br><b><u>ANGHAMI STUDENT PLAN:</u></b><br>Enjoy the ultimate Anghami Plus experience with 50% off!<br><br>Problems? Feedback? We are ready to answer any of your questions on support@anghami.com<br><br>Anghami Plus, Anghami Student and Anghami Family Plan Legal<br>Details:<br>Payment will be charged to your Google Account at confirmation of purchase<br>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user&apos;s Account Settings after purchase<br>No cancellation of the current subscription is allowed during active subscription period<br>Terms of Service &amp; Privacy Policy http://www.anghami.com/legal",
    "histogram": {
        "1": 44251,
        "2": 15757,
        "3": 35067,
        "4": 62740,
        "5": 496216
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/aPjgqouOOMYNO1emFLfkbwOtktNarldw-S0V1FaeJ0j2mB6nV0OMsquBTnhKWk1Bb24=h310",
        "//lh3.googleusercontent.com/85Vdxqt6owGycKAQhI5vVp8e80iBDoDTXr8EmHGfLoTF1AtjqFlLXKKpTKLuKnIvMQ=h310",
        "//lh3.googleusercontent.com/jauuTnVBuxrMUYL-PfZIijXuv5dDJ81NMy2JiKXS8VklqC22BnuU2jEzUj4i5PGLCf4=h310",
        "//lh3.googleusercontent.com/LbDh8qvQhh7BSDBuIQqXCmqenGUY8LQQSNU2plyTgU-rBPWBddLBU4CjqvbQEdvTv6M=h310",
        "//lh3.googleusercontent.com/P-FZBfcEYCIvkeUjzR9JLm-kbt2f1cdvIss8HUHE4EqbstCX8SNxOhp2GBBjDntfbIAg=h310",
        "//lh3.googleusercontent.com/UXRvPv84UxEWd-dotmYTKbK9cS7hTSIgxlzvBaq3uHNHPuKhdqWV5UZLKcwLWdwVaFs=h310",
        "//lh3.googleusercontent.com/7Uz5wV6AhbASmmuH0laaOGru8ltMbfKQMymV3h_aqfEdK4jnRNFjaUMlBOEG53xwYw=h310",
        "//lh3.googleusercontent.com/wmOqRe6RUrzqF79ZFElvNfWocZ2ViW6PEYVfKi96i2HjwfNB2_z_yjz5RV_3r6M8dl0=h310",
        "//lh3.googleusercontent.com/-MAwsWlBHdeYTnx2lP6959bLNZA98zsP-b4b1520bSosOh6DD8XELUeqi2SgOOzJng=h310",
        "//lh3.googleusercontent.com/vmGsNSWOXPXVwowXxHjah_lGF8ym8mc20EiNvTBBJzEBW1KTh_vuLdU37PKQVR2Gfw=h310",
        "//lh3.googleusercontent.com/CB6awRXSPoIKdMY9EMPlEcAgLCqdROFIRN724wKf0SzBjImcFA-wBHe4CbsDoBjR9Jlf=h310",
        "//lh3.googleusercontent.com/JGlcNdPj590qhZ58D6zQtWtXKeAd8M-6wSwKcw780QjvU97qzgvQ8BcIIPlVpab5ipM=h310",
        "//lh3.googleusercontent.com/fISimj2ooGVy7er0hmIBN0RmLBm2dAByhrIFc4t5ysKdCCPQXF3N9huWMfX9f3R6NQ=h310",
        "//lh3.googleusercontent.com/_1yD5bcll25cVQ7CRjo1f7YZ2Pi7dETuX4Te7EE1WX0h9kKb_dxnp4YrsFD4Cyyygmw=h310"
    ],
    "comments": [
        "I had recently moved on from Apple music because it's android version is just trash. Anghami seemed really nice to me at first but now the app downloads songs on its own and annoys me. I had to sit down and personally delete the songs I don't want . This is really annoying and disastrous. I want to move on but this app is the only decent one I can find in this country. Please improve!!",
        "I previously wrote an angry review on no scrubbing anymore. And all of a sudden I got 2 months of plus features... This happiness is temporary knowing it would end. Anghami you were a great app but now you have lost the way. I did my best to give feedback and suggestions in the previous ver but now i am Dissappointed.",
        "It's a great app. Even the FREE experience for the user without subscription is great. You can't find this free service anywhere with Class A labels and a huge library. I can't believe some people are nagging about this. And Soundcloud is nothing like this app, it's mostly indie free music.",
        "Im in love with anghami But i have few suggestions i'd like to see: first i'd like you to add a timer and then the misic stops alone. Second i'd like you to add an optional lock screen anghami so we can skip songs and like the one playing without unlocking the phone. Keep up the good work 👌",
        "Anghami is simply the best music app in our region, it includes both arabic and international songs, most of the international releases come out almost instantly on the app too, its phenomenal!  Only issue is just that I wish we had more general podcasts on here instead of it beeing music exclusive.",
        "Good music app. Pretty decent music library that has greatly improved, and the subscription is much cheaper than Spotify. However, the free user experience is held back by many issues, most annoying of which is the inability to play the previous track."
    ],
    "recentChanges": [
        "• Forget chocolate, buy an Anghami Plus gift to your loved one",
        "• Introducing Collaborative Playlists: invite your friends to collaborate to your playlists by adding their songs.",
        "• Anghami now supports Google Assistant. All you have to do is say “Play Elissa on Anghami” and start enjoying the music.",
        "• Anghami now supports Android Auto",
        "• Anghami now supports Android Wear",
        "Give us your feedback on @anghamiCare or feedback@anghami.com",
        "Show us some love with 5-star ratings!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.anghami&hl=en&gl=us",
    "appId": "com.anghami"
}