{
    "title": "Conference Call Dialer",
    "summary": "True one-touch conference calling",
    "icon": "//lh3.googleusercontent.com/aE-W-jNtk5PFaHkXKOxdzRQjXMEEVNTrwgoyZJytuFstH1ArG8xTG40KdTNTJPNwcav9=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 1350,
    "developer": "Acorn Studio",
    "developerId": "Acorn+Studio",
    "developerEmail": "acornstudiodev@gmail.com",
    "developerWebsite": "http://bit.ly/conferencecalling",
    "developerAddress": "Wroclaw, Poland",
    "updated": "August 30, 2015",
    "version": "1.9.3",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "The smartest, quickest and easiest way to join conference calls (aka ATC, Audio Tele Conferencing, bridge calls or reservationless conferences in AT&T, Intercall) from your mobile device with a single touch of your screen. It’s a must have if you are working in a global environment and was already trusted by multiple top Fortune 500 companies. Conference Call Dialer is created by and for people who join multiple conference calls in a day, while traveling (like driving a car, using public transportation, on the airport, while jogging) or who are simply away from their computer. HOW IT WORKS:1.\tConference Call Dialer reads content of your Android calendar2.\tAll the events are parsed, phone numbers, conference codes, PINs and pass codes are automatically detected3.\tAll the events are displayed in Conference Call Dialer in a nice daily overviewFor meetings that cannot be parsed automatically you can use the 3-tap approach where after selecting event you tap on the items in the invite content and press the call button.Conference Call Dialer allows also for reach configuration where you can define the standard prefixes that should be used to detect phone numbers, conference codes and leader pins. It also supports regular expressions (regex) for a complete freedom of data detection. For more details about how Conference Call Dialer discovers data, please see FAQ at http://bit.ly/conferencecallingConference calling has never being easier!FEATURES:•\tRetrieve information about meetings from your calendar (Gmail, Inbox and Outlook if it's synchronized into the google calendar)•\tDial into conference calls with conf code/participant code from the invitation - allows for selection if more than one conference code is found•\tSupport for multiple default gateway numbers and favorites conference calls (up to definition of custom DTMF code)•\tCustomization of waiting times, notification times, prefixes•\tWidgets for the home screen for fast \"My conference call\" and \"Join current meeting\" actions•\tQuickly join your own conference call from the app•\tAutomatic import of bridge numbers for selected companies•\tNotifications before the meeting (Android Wear friendly)•\tSupport for the most popular conference calling systems – webEx, Go2Meeting, Microsoft LyncThanks to Conference Call Dialer you will never again need to write down the participant code or search for the invitation in your mail. Everything is available right at your fingertips. No need to create any external account (like with some other apps) or synchronize your calendar into external data store, Conference Call Dialer simply works the moment you download it to your device!IMPORTANT•\tIf your device has a \"privacy guard\" functionality included (e.g. CM 10.1+ builds), don't forget to white-list Conf Call Dialer. Otherwise you'll see no calendars on the calendar selection list.•\tGoogle Voice and Skype users - unfortunately neither Google Voice nor Skype handle pauses from external applications, so CCD will NOT be able to enter the conference code or leader pin if you are using Google Voice or Skype. Please provide feedback to Google and Microsoft that you are looking for that feature, maybe it will soften their hearts...•\tNote that Conference Call Dialer is not meant to host conference calls directly on your phone. You require a 3rd party service to use it (like WebEx, Go2Meeting, Microsoft Lync, etc)•\tConference Call Dialer works with your device built-in calendars. If you are using 3rd party calendar applications (like Touchdown, IBM Lotus Notes or Samsung Knox) that don't expose their data as standard calendars, please sync their content with built-in google calendar.Want to get Conference Call Dialer branded for your organization? Please contact me directly at acornstudiodev@gmail.comPhotos thanks to courtesy of Steve Wilson - https://www.flickr.com/photos/125303894@N06/",
    "descriptionHTML": "The smartest, quickest and easiest way to join conference calls (aka ATC, Audio Tele Conferencing, bridge calls or reservationless conferences in AT&amp;T, Intercall) from your mobile device with a single touch of your screen. It&#x2019;s a must have if you are working in a global environment and was already trusted by multiple top Fortune 500 companies. <br><br>Conference Call Dialer is created by and for people who join multiple conference calls in a day, while traveling (like driving a car, using public transportation, on the airport, while jogging) or who are simply away from their computer. <br><br>HOW IT WORKS:<br>1.\tConference Call Dialer reads content of your Android calendar<br>2.\tAll the events are parsed, phone numbers, conference codes, PINs and pass codes are automatically detected<br>3.\tAll the events are displayed in Conference Call Dialer in a nice daily overview<br><br>For meetings that cannot be parsed automatically you can use the 3-tap approach where after selecting event you tap on the items in the invite content and press the call button.<br><br>Conference Call Dialer allows also for reach configuration where you can define the standard prefixes that should be used to detect phone numbers, conference codes and leader pins. It also supports regular expressions (regex) for a complete freedom of data detection. <br><br>For more details about how Conference Call Dialer discovers data, please see FAQ at http://bit.ly/conferencecalling<br><br>Conference calling has never being easier!<br><br>FEATURES:<br>&#x2022;\tRetrieve information about meetings from your calendar (Gmail, Inbox and Outlook if it&apos;s synchronized into the google calendar)<br>&#x2022;\tDial into conference calls with conf code/participant code from the invitation - allows for selection if more than one conference code is found<br>&#x2022;\tSupport for multiple default gateway numbers and favorites conference calls (up to definition of custom DTMF code)<br>&#x2022;\tCustomization of waiting times, notification times, prefixes<br>&#x2022;\tWidgets for the home screen for fast &quot;My conference call&quot; and &quot;Join current meeting&quot; actions<br>&#x2022;\tQuickly join your own conference call from the app<br>&#x2022;\tAutomatic import of bridge numbers for selected companies<br>&#x2022;\tNotifications before the meeting (Android Wear friendly)<br>&#x2022;\tSupport for the most popular conference calling systems &#x2013; webEx, Go2Meeting, Microsoft Lync<br><br>Thanks to Conference Call Dialer you will never again need to write down the participant code or search for the invitation in your mail. Everything is available right at your fingertips. No need to create any external account (like with some other apps) or synchronize your calendar into external data store, Conference Call Dialer simply works the moment you download it to your device!<br><br>IMPORTANT<br>&#x2022;\tIf your device has a &quot;privacy guard&quot; functionality included (e.g. CM 10.1+ builds), don&apos;t forget to white-list Conf Call Dialer. Otherwise you&apos;ll see no calendars on the calendar selection list.<br>&#x2022;\tGoogle Voice and Skype users - unfortunately neither Google Voice nor Skype handle pauses from external applications, so CCD will NOT be able to enter the conference code or leader pin if you are using Google Voice or Skype. Please provide feedback to Google and Microsoft that you are looking for that feature, maybe it will soften their hearts...<br>&#x2022;\tNote that Conference Call Dialer is not meant to host conference calls directly on your phone. You require a 3rd party service to use it (like WebEx, Go2Meeting, Microsoft Lync, etc)<br>&#x2022;\tConference Call Dialer works with your device built-in calendars. If you are using 3rd party calendar applications (like Touchdown, IBM Lotus Notes or Samsung Knox) that don&apos;t expose their data as standard calendars, please sync their content with built-in google calendar.<br><br>Want to get Conference Call Dialer branded for your organization? Please contact me directly at acornstudiodev@gmail.com<br><br><br>Photos thanks to courtesy of Steve Wilson - https://www.flickr.com/photos/125303894@N06/",
    "histogram": {
        "1": 198,
        "2": 75,
        "3": 124,
        "4": 218,
        "5": 735
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/J-0mVqH004F51BXCzWhr8XI0cbvNneJI5UoxazIY3opGmPx5hRm1jWYNw-8oErcNoBI=h310",
        "//lh3.googleusercontent.com/WhWRT_kXnxoZLy88eWtwcHkmYoHQn_qC6U_RVAVtXuX00BmZLZ-I__L5Fj17LLA6tsfR=h310",
        "//lh3.googleusercontent.com/VLzWJPUCHVnh4OwpGEAdq-vqVamYuh2HHmUt89Ngz980JwobNQ09yvL4rmqoBDd6Ik4=h310",
        "//lh3.googleusercontent.com/YO_26zFY-D-l7bj4nvuEUy7wkSnPqcTlHzoXF_SOHwWngGsVdZJ5BR6JMz9vNDsoaUI=h310"
    ],
    "comments": [
        "Works perfectly. Literally a life saver. As with many business people, I inevitably wind up having to get on conference calls while driving. Even when call organizers include the \"mobile-friendly\" dialer in invites, you often have to hunt around the invite to find it, and often my phone doesn't identify it for one tap dialing, especially from the Outlook app. Very dangerous to deal with while driving. This app does a great job of finding conference call details from invites, and I no longer have to miss these calls while driving. And even when not driving, i rely on this app because our bridge system uses 7 digit codes which are hard to remember. Invaluable.",
        "Useless app for Lenovo a7000-a I tried to conference call but greeted by 'Cannot find a call' msg. All it uses is the system setting. It did nothing to make a conference. Waste of space for me as I still didn't get a conference call feature.",
        "Works fine The interface is a little clunky but it worked fine for me. Most importantly, it got the correct dialing string to enter my participant and leader codes! I'm happy..",
        "It works OK, but can't give it a higher rating as it doesn't always  pick up the correct numbers.  In that case, there is a feature to allow you to manually chose so it can dial correctly.",
        "Very helpful dialer, especially for calling in to meeting while driving It just needs some help getting the rules to work better at helping to auto detect the phone number and conference codes in my meeting events. I've tried to teach it by making rules, but not a lot of luck there. I still recommend the app though!",
        "Conference code is required The biggest problem with all of the apps that I've tried is that none of them picked the number from the location field. This is the only app that picked it. Unfortunately that's as far as I got. It doesn't let me dial into meetings that don't have a conference code.  There isn't even an option to disable this required field check."
    ],
    "recentChanges": [
        "Fix for notifications and edit/create favourites dialog size",
        "Added Help button",
        "Added share happines in feedback"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.abzdev.confcalldialerstd&hl=en&gl=us",
    "appId": "com.abzdev.confcalldialerstd"
}