{
    "title": "Air Canada",
    "summary": "The new Air Canada app. Designed to enhance and simplify your travel experience.",
    "icon": "//lh3.googleusercontent.com/ODADesUAYyEEnxiI2xdihU1RSyfzQlCdPz_ucJCQMoMDJMclGAwNOWpZxqpOZTV3YQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.1,
    "reviews": 1975,
    "developer": "Air Canada",
    "developerId": "Air+Canada",
    "developerEmail": "android@aircanada.ca",
    "developerWebsite": "http://aircanada.com",
    "developerAddress": "7373 boul. Côte-Vertu Ouest\nSaint-Laurent, Quebec H4S 1Z3",
    "updated": "February 28, 2018",
    "version": "1.20.0",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "The new Air Canada app (“app”). Designed to enhance and simplify your travel experience.By pressing the “Install” button or by downloading the app, or setting up your device to do so automatically, you consent to the installation of the app, its future updates and upgrades and to the Air Canada Mobile App Terms of Use (“Terms of Use”) that govern the use of the app that are available here: http://www.aircanada.com/en/mobile/tc_android.html. You can withdraw your consent at any time by uninstalling the app. For help uninstalling the app, please contact us at android@aircanada.ca.Home ScreenGet contextual updates based on your travel plans and preferences.Aeroplan®† SyncRetrieve your bookings automatically by linking your Aeroplan account to your Air Canada mobile+ profile.NotificationsGet notified for check-in and boarding reminders, gate changes, flight delays, cancellations, booking changes and more. You can receive notifications by push notifications, email or text message.Boarding PassSave your electronic boarding pass for easy access and online use.Book Flights & Manage TripsPurchase flights and manage your trips (select seats, purchase travel options, change, cancel a booking).Air Canada Altitude® Digital CardDownload a digital version of your Altitude membership card for presentation at the airport, and access to lounges.Air Canada Rouge® player (In-Flight Entertainment)Watch Air Canada Rouge® movies, TV shows and more on d'Air Canada Rouge® flights.Air Canada mobile+Store your information, preferences and payment details in a secure environment, allowing you to purchase Air Canada products and services from your mobile device quickly and easily.Support for Android WearFollow your flight status, boarding time countdown and access your boarding pass directly on your Android Wear device.IMPORTANT DISCLOSURESThese functions apply when enabled:• Location: your location data is used to show the closest airport for booking, flight status and check-in.• Contacts: allows contacts you select to receive flight status notifications.• Calendar: your flight information is added to your calendar.• Camera: you can add your Aeroplan number, credit card number and expiry date using the camera to ease future purchases.• Notifications: (push notification, email, SMS message) are used to send you service messages such as check-in and boarding reminders, boarding pass updates, booking changes, flight status changes, credit card and passport expiry reminders. You can customize these preferences in the app’s Menu > Settings > Notifications• Wi-Fi connection information: used to determine if Wi-Fi internet access and a connection is available for the in-flight entertainment system on Air Canada Rouge® flights.• File system access/system storage: used to temporarily store data for in-flight entertainment system content.• Your device identity log information (phone make/model, device language, operating system and app version) is attached to emails you send us when you report an issue using the app.PRIVACY POLICYBy downloading or updating this app, you understand that Air Canada may: collect data about your device in order to serve you the correct software, as well as maintain and develop its services; require that you change some of your device settings to use specific features; collect personal information as detailed in our Privacy Policy. For more information, please see http://www.aircanada.com/en/about/legal/privacy/policy.htmlAir Canada, PO Box 64239, RPO Thorncliffe, Calgary, Alberta, T2K 6J7 privacy_vieprivee@aircanada.ca ® Air Canada Rouge, Altitude and Star Alliance Registered trademarks of Air Canada in Canada.®† Aeroplan is a registered trademark of Aimia Canada Inc.",
    "descriptionHTML": "The new Air Canada app (&#x201C;app&#x201D;). Designed to enhance and simplify your travel experience.<br>By pressing the &#x201C;Install&#x201D; button or by downloading the app, or setting up your device to do so automatically, you consent to the installation of the app, its future updates and upgrades and to the Air Canada Mobile App Terms of Use (&#x201C;Terms of Use&#x201D;) that govern the use of the app that are available here: http://www.aircanada.com/en/mobile/tc_android.html. You can withdraw your consent at any time by uninstalling the app. For help uninstalling the app, please contact us at android@aircanada.ca.<br><br>Home Screen<br>Get contextual updates based on your travel plans and preferences.<br><br>Aeroplan&#xAE;&#x2020; Sync<br>Retrieve your bookings automatically by linking your Aeroplan account to your Air Canada mobile+ profile.<br><br>Notifications<br>Get notified for check-in and boarding reminders, gate changes, flight delays, cancellations, booking changes and more. You can receive notifications by push notifications, email or text message.<br><br>Boarding Pass<br>Save your electronic boarding pass for easy access and online use.<br><br>Book Flights &amp; Manage Trips<br>Purchase flights and manage your trips (select seats, purchase travel options, change, cancel a booking).<br><br>Air Canada Altitude&#xAE; Digital Card<br>Download a digital version of your Altitude membership card for presentation at the airport, and access to lounges.<br><br>Air Canada Rouge&#xAE; player (In-Flight Entertainment)<br>Watch Air Canada Rouge&#xAE; movies, TV shows and more on d&apos;Air Canada Rouge&#xAE; flights.<br><br>Air Canada mobile+<br>Store your information, preferences and payment details in a secure environment, allowing you to purchase Air Canada products and services from your mobile device quickly and easily.<br><br>Support for Android Wear<br>Follow your flight status, boarding time countdown and access your boarding pass directly on your Android Wear device.<br><br>IMPORTANT DISCLOSURES<br>These functions apply when enabled:<br>&#x2022; Location: your location data is used to show the closest airport for booking, flight status and check-in.<br>&#x2022; Contacts: allows contacts you select to receive flight status notifications.<br>&#x2022; Calendar: your flight information is added to your calendar.<br>&#x2022; Camera: you can add your Aeroplan number, credit card number and expiry date using the camera to ease future purchases.<br>&#x2022; Notifications: (push notification, email, SMS message) are used to send you service messages such as check-in and boarding reminders, boarding pass updates, booking changes, flight status changes, credit card and passport expiry reminders. You can customize these preferences in the app&#x2019;s Menu &gt; Settings &gt; Notifications<br>&#x2022; Wi-Fi connection information: used to determine if Wi-Fi internet access and a connection is available for the in-flight entertainment system on Air Canada Rouge&#xAE; flights.<br>&#x2022; File system access/system storage: used to temporarily store data for in-flight entertainment system content.<br>&#x2022; Your device identity log information (phone make/model, device language, operating system and app version) is attached to emails you send us when you report an issue using the app.<br><br>PRIVACY POLICY<br>By downloading or updating this app, you understand that Air Canada may: collect data about your device in order to serve you the correct software, as well as maintain and develop its services; require that you change some of your device settings to use specific features; collect personal information as detailed in our Privacy Policy. For more information, please see http://www.aircanada.com/en/about/legal/privacy/policy.html<br><br>Air Canada, PO Box 64239, RPO Thorncliffe, Calgary, Alberta, T2K 6J7 privacy_vieprivee@aircanada.ca <br>&#xAE; Air Canada Rouge, Altitude&#xA0;and Star Alliance Registered trademarks of Air Canada in Canada.<br>&#xAE;&#x2020; Aeroplan is a registered trademark of Aimia Canada Inc.",
    "histogram": {
        "1": 625,
        "2": 199,
        "3": 179,
        "4": 293,
        "5": 679
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/PFhiQwd-lYzjjo3XxAZ5Ygkz_dRQ4l2DBsWwNshmGUYB9Li7xf-TwWNOgcHF-2OlZQ=h310",
        "//lh3.googleusercontent.com/I0BM_Kc8JumXj4nEcAAwrEl4Li_lXWPlJVMyEXbq2--ZXZMD63Cwj0-2kuKcyZwcTA=h310",
        "//lh3.googleusercontent.com/ff3bkTw-OMgYgetC-vgjGQ-mEAojZ91riYaO_80DWTAkh7ay1uDIy4ZFjEfyjxXCME8=h310",
        "//lh3.googleusercontent.com/Ut_L9v7j1HvqarZ9n4lhGS4Y2zd0lnGFpDfI25syfyUWCUrCvPTMCD9D4Amul2teteXQ=h310",
        "//lh3.googleusercontent.com/5DRxWlcaTQ7oaiKr_cacLyNHQakGivfX0DZoo5CQSytsLyflJOHge7puPJpqIieRHw=h310",
        "//lh3.googleusercontent.com/Ie0XY_8RiFLCpfehJ5uArx349Ir6jV61m2osYllH4_YZw3Gr2JMz4QEQIPLp9mu2_bAO=h310",
        "//lh3.googleusercontent.com/7giowE1LU9OAV4k3qeeQug0Qo4dpeW4MYiBeDfE6DbqVM0aslN-FxV1_hSpl6S9zp8dS=h310"
    ],
    "comments": [
        "Consistently crashes trying to open boarding passes from menu panel. Other \"view boarding pass\" buttons in the app simply do not work.",
        "This app lets me track multiple trips, flights, and boarding passes. Updating flights in real time. I love it.",
        "Finally supports multiple boarding passes and live updates! Thanks AC!",
        "Air Canada actually replied to my original posting and told me that the app could do this if you linked the accounts. This was not obvious to me so there is a problem there but it did work after I looked into it. The app does retrieve my information now. Way better.   Thanks for responding.  When a person signs in it should pull up their flights not ask you to submit tracking numbers - useless app - perhaps the writers should try using it.",
        "AC, please stop replying telling everyone that the log in is different.  There is a problem with you app right now.  My existing password doesn't work any longer, and neither does trying to reset it.  Please let us know when we can expect to log in again.",
        "Honestly, I do not understand the huge ranting going on about this app. It is working very well, tracking my future flights, having my Aeroplan synced, etc. The features are working as expected and information is provided as expected. I am just removing 1 star for excessive unnecessary visual information... It can be simpler and even more intuitive for its purpose."
    ],
    "recentChanges": [
        "Multiple Passenger Boarding Pass Support",
        "- Support for multiple passenger boarding passes.",
        "- Added dedicated boarding pass section, find it from the Menu.",
        "Altitude 2018",
        "- Updated our digital Altitude cards with a fresh coat of paint for 2018.",
        "This app release also contains general bug fixes and smaller enhancements to keep it running smoothly on your journey to your next destination."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.aircanada&hl=en&gl=us",
    "appId": "com.aircanada"
}