{
    "title": "Qeyorb Messenger for Wear Demo",
    "summary": "Qeyorb Messenger for SMS conversations on your Android Wear smartwatch.",
    "icon": "//lh3.googleusercontent.com/SgbQXagHKL8xfBlVCL7PiBIXpqJTdw6BESsN7wUWIgw150LhpJSXptnbMvdDE_1_Vjw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 4.1,
    "reviews": 7,
    "developer": "CoinUI",
    "developerId": "CoinUI",
    "developerEmail": "coinuicorp@gmail.com",
    "developerWebsite": "http://coinui.com",
    "updated": "August 22, 2016",
    "version": "1.0.7",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Did you ever use your smartwatch for text messages? Reading incoming message, voice to text or using templates to reply could be a solution, but is that really enough and convenient? Lack of text input limits the smartwatch usability and usefulness. You have to take your smartphone out of the pocket every time you need to reply to a text message. But have you ever thought of composing, typing and chatting right on your smartwatch screen? Meet Qeyorb Messenger for SMS conversations on your Android Wear smartwatch.Coin size design.Qeyorb was specifically designed to create an efficient single multi directional input technique (minimum UI) to create convenient typing method while maintaining small coin size design.Small but fast.You can easily type text messages and edit them with just one finger.Fully functional SMS messenger.Now you can create your custom messages in seconds and forget about using templates. You can compose, send, forward and reply. You can review all of your conversations and continue chatting right on your smartwatch screen. Now your smartphone will stay in your pocket and you will be able to gain maximum functionality from your smartwatch.Functionality:SMS conversation supportEasy setupHelpful tutorialSingle multi directional typing techniqueSingle layoutType in receiver numberEnglish onlyPremium Features (Full Version):More skinsMultiple languagesMore typing modesEmojis supportCustom signatureConfigurable layoutsSelect receiver from your contact listPlease note that your standard text messaging rates may apply.The Wear Messages app is compatible with all Android Wear smartwatches:Motorola Moto 360Sony Smartwatch 3LG G WatchLG G Watch RLG Watch UrbaneLG Watch Urbane 2nd EditionASUS ZenWatchASUS ZenWatch 2Huawei WatchSamsung Gear LiveFossil Q FounderTAG Heuer Connected",
    "descriptionHTML": "Did you ever use your smartwatch for text messages? Reading incoming message, voice to text or using templates to reply could be a solution, but is that really enough and convenient? Lack of text input limits the smartwatch usability and usefulness. You have to take your smartphone out of the pocket every time you need to reply to a text message. But have you ever thought of composing, typing and chatting right on your smartwatch screen? <br><br>Meet Qeyorb Messenger for SMS conversations on your Android Wear smartwatch.<br><br><b>Coin size design.</b><br><br>Qeyorb was specifically designed to create an efficient single multi directional input technique (minimum UI) to create convenient typing method while maintaining small coin size design.<br><br><b>Small but fast.</b><br><br>You can easily type text messages and edit them with just one finger.<br><br><b>Fully functional SMS messenger.</b><br><br>Now you can create your custom messages in seconds and forget about using templates. You can compose, send, forward and reply. You can review all of your conversations and continue chatting right on your smartwatch screen. Now your smartphone will stay in your pocket and you will be able to gain maximum functionality from your smartwatch.<br><br><b>Functionality:</b><br>SMS conversation support<br>Easy setup<br>Helpful tutorial<br>Single multi directional typing technique<br>Single layout<br>Type in receiver number<br>English only<br><br><b>Premium Features (Full Version):</b><br>More skins<br>Multiple languages<br>More typing modes<br>Emojis support<br>Custom signature<br>Configurable layouts<br>Select receiver from your contact list<br><br>Please note that your standard text messaging rates may apply.<br><br><b>The Wear Messages app is compatible with all Android Wear smartwatches:</b><br>Motorola Moto 360<br>Sony Smartwatch 3<br>LG G Watch<br>LG G Watch R<br>LG Watch Urbane<br>LG Watch Urbane 2nd Edition<br>ASUS ZenWatch<br>ASUS ZenWatch 2<br>Huawei Watch<br>Samsung Gear Live<br>Fossil Q Founder<br>TAG Heuer Connected",
    "histogram": {
        "1": 1,
        "2": 0,
        "3": 1,
        "4": 0,
        "5": 5
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/VjjX0jYsaS8ZcyG0xyXDJQXInQht_64RvTXg0nxWNiLTf0-hBoWiqJqgBkW6eQSpR4Ce=h310",
        "//lh3.googleusercontent.com/1jiEtms-oBsPalZGk7xFcBl5F__9trQiwA88ItyU-mFEvOq1NAfhaSKPxEXVKNq1W_wv=h310"
    ],
    "comments": [
        "It's okay, and you can use it to type successfully but it's hard to get used to and I'm not sure of it is a decent method of texting. I'll stick with it for a week or so and tell you what I think.",
        "Doesn't even work at all",
        "Love it Works with my LG urbane with no issues :) lets see how it works in the long run",
        "اب ای"
    ],
    "recentChanges": [
        "Improve UI and logic",
        "Go Live"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.coinui.qeyorb.watchmessenger&hl=en&gl=us",
    "appId": "com.coinui.qeyorb.watchmessenger"
}