{
    "title": "Runmore 5K Trainer (with Wear) - Easy Running",
    "summary": "Runmore is a beautifully simple 5K trainer perfect for beginners and pros.",
    "icon": "//lh3.googleusercontent.com/5xS6XKM08R9hS4nmhs3VdXWLfmlZ8R5MUp0oNoluXe757dDpDneewwswXCX4aAiulQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 321,
    "developer": "Runmore",
    "developerId": "Runmore",
    "developerEmail": "runmoreapp@gmail.com",
    "developerWebsite": "http://RunmoreApp.com",
    "developerAddress": "5-10 Taviton Street, London, WC1H 0BX",
    "updated": "November 23, 2017",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "★ Now compatible with all Android Wear devices ★★ Google Fit Compatible ★❝ Really good. Literally never run before and this has got me started! ❞❝ Simple clean interface App is really good at what it does. The interface is much better Zen labs'. ❞❝ After being out of running for 3 years with injuries and surgeries, I was looking for an app that would work me back into running comfortably. This did just the trick. ❞❝ This is also the only app that I've found that allows wear only, so no need to lob a phone around with you. To add to the experience the customer service is second to none with the developer quickly responding to emails. I can't rate this app highly enough! !! ❞Runmore is based on the proven Couch to 5K (C25K) Workout schedule to get you off your couch and on to running 5K in 9 weeks. Whether you're a first time runner or training towards a 5K run, Runmore C25K is perfect for you.Runmore clearly visualises the 9-week C25K plan and provides you with clear audio instructions as you complete each session to help you focus on the running and keep your phone in your pocket. Runmore C25K then tracks your weekly progress along the way, guiding you to that 5K finish line.✓ Clear Audio coach✓ Detailed day by day schedule✓ Create reminders to plan your schedule✓ Keep track of your progress along the way✓ Effortlessly sync your progress with Google FitAndroid Wear✓ Workout instructions sent straight to you wrist✓ Pause, skip or stop workouts from your wrist✓ Leave your phone at home mode and automatically sync when you returnDownload Runmore 5K for FREE now for a healthier lifestyle.",
    "descriptionHTML": "&#x2605; Now compatible with all Android Wear devices &#x2605;<br>&#x2605; Google Fit Compatible &#x2605;<br><br><br><br>&#x275D; Really good. Literally never run before and this has got me started! &#x275E;<br><br><br>&#x275D; Simple clean interface App is really good at what it does. The interface is much better Zen labs&apos;. &#x275E;<br><br><br>&#x275D; After being out of running for 3 years with injuries and surgeries, I was looking for an app that would work me back into running comfortably. This did just the trick. &#x275E;<br><br><br>&#x275D; This is also the only app that I&apos;ve found that allows wear only, so no need to lob a phone around with you. To add to the experience the customer service is second to none with the developer quickly responding to emails. I can&apos;t rate this app highly enough! !! &#x275E;<br><br><br><br><br>Runmore is based on the proven Couch to 5K (C25K) Workout schedule to get you off your couch and on to running 5K in 9 weeks. Whether you&apos;re a first time runner or training towards a 5K run, Runmore C25K is perfect for you.<br><br><br>Runmore clearly visualises the 9-week C25K plan and provides you with clear audio instructions as you complete each session to help you focus on the running and keep your phone in your pocket. Runmore C25K then tracks your weekly progress along the way, guiding you to that 5K finish line.<br><br><br>&#x2713; Clear Audio coach<br>&#x2713; Detailed day by day schedule<br>&#x2713; Create reminders to plan your schedule<br>&#x2713; Keep track of your progress along the way<br>&#x2713; Effortlessly sync your progress with Google Fit<br><br><br>Android Wear<br><br>&#x2713; Workout instructions sent straight to you wrist<br>&#x2713; Pause, skip or stop workouts from your wrist<br>&#x2713; Leave your phone at home mode and automatically sync when you return<br><br><br>Download Runmore 5K for FREE now for a healthier lifestyle.",
    "histogram": {
        "1": 9,
        "2": 12,
        "3": 28,
        "4": 51,
        "5": 221
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/-mPrrPE8pT_utO6wJPUhTPO8H-da2e16n748DQFGjWfR6ZV3vfQZ5-XY3VUKXWHTeQQ=h310",
        "//lh3.googleusercontent.com/0Q4-8VE6bP7b49U8k4mAD7WtdnrtoRGg8udhPjaJhJExeWF6U2r-gmNdABmufIlco1k=h310",
        "//lh3.googleusercontent.com/qkPRUui5Ou0PiDry5JOOTPHbzAAWaViB1ZTGcNDnTwGnbEM1tj3JbTR4dAeLqnJzfw=h310",
        "//lh3.googleusercontent.com/LFBrAYcazRin_BErijCNRG5xCGj4_KVkZCbM8zNnNolEknk1xq34mLl-I4KgzHixBXI=h310",
        "//lh3.googleusercontent.com/t35MznnRnIJau3aZ8Z73eGR71D-Ocd2Wy11puKT_UVxa4rUJaZ5b4FFDfD5zTvnSbA=h310",
        "//lh3.googleusercontent.com/YJybvFyk9cdrVEHtDIEdD7FuVbUMVRIGi1GzdL3pjHiaX5IWZwvdo7Eeo0p4JAt8SYc=h310",
        "//lh3.googleusercontent.com/wbs2ntNt1TvLKhPDt0vL430F6T8eABD4xBvxInjkBslsN9lxmHvljMNwZ0tGKfErSL7M=h310"
    ],
    "comments": [
        "Nice clean and easy to use interface. However, the interval timer gives up half way through the run. Leaving me to guess on when to run and when to jog. What's the point of this app then?",
        "Great app to get you into running for the first time.  Did my knee in when I tried running on my own, this app will get you running gradually.",
        "Fantastic. It lets your music play in the background, but has an audio cue so you never need to check your phone. Simple app, but has great design.",
        "There are many apps that help you with the C25K program, but this is easily the simplest and easiest to use!",
        "Simple and serves its purpose. Makes it so easy to get started and stick with it.",
        "Good App but wish had more informative interface."
    ],
    "recentChanges": [
        "+ Introducing effortless Google Fit Sync",
        "+ Wear: It's now more fun to scroll through lists",
        "+ Wear: Fixed progress sync issues on Wear only mode",
        "+ Fixed pesky timer synchronisation bugs & wear bugs",
        "+ Now available for Android Wear only"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.runmore.fivektrainer&hl=en&gl=us",
    "appId": "com.runmore.fivektrainer"
}