{
    "title": "Cookbook Recipes - Free recipes app",
    "summary": "Free recipe app for all your cooking and grocery needs",
    "icon": "//lh3.googleusercontent.com/2JwKIrCLfICLBzHIKvontcLsJdkJdHih6lQyiQpAl8tV95Wt2jyqvI8d5IVZtXMuAm3e=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.1,
    "reviews": 46448,
    "developer": "Recipes by Riafy",
    "developerId": "5870118196889058228",
    "developerEmail": "riafytechnologies@gmail.com",
    "developerWebsite": "http://thecookbk.com/privacy.php",
    "developerAddress": "Riafy Technologies\nMadathumkudy House\nCheriya Vappalassery, Mekkad\nErnakulam, Kerala 683589\nIndia",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Food & Drink",
    "genreId": "FOOD_AND_DRINK",
    "size": "Varies with device",
    "description": "Cookbook recipes is one of the best recipes and shopping list apps in the world. We provide recipes for free in more than 20 languages around the world. We designed the Cookbook recipes app to support offline usage.Cookbook's recipes saver allows you to edit a recipe from the web. The recipe can be modified to your taste and then saved into your recipes collection. Our recipes maganer allows adding new recipes, removing and editing saved recipes.Are you preparing to start a diet plan? Cookbook's healthy recipes section is here to help. Get cooking ideas for low carb recipes, low calorie recipes, diet recipes to lose weight fast and more for free. Our shopping list and intelligent meal planner allows you to shop and eat healthy.At Cookbook, we understand you passion for recipes. That is why we build a recipe finder by ingredients. The recipe finder by ingredients allows you to discover easy recipes with ingredients on hand. These yummy recipes come with a build in recipe converter to allow you to change recipe servings. Ingredient quantities are automatically changed based on your serving size.A wide range of recipes are available in Cookbook like soup recipes, veg recipes, egg recipes, easy recipes, juice recipe, recipes for kids etc.​ Our recipe app in english, hindi, spanish, portuguese etc has offline support. You no longer need any of the old printed recipe books. Upgrade from the old recipe books to Cookbook recipes - a modern, smart and tasty recipes app.🔍 Search by ingredientSearch for recipes with ingredients you have in your refrigerator. We can convert ingredients into recipes.👩‍🍳Cooking assistantCookbook assistant lets you create intelligent grocery list and shopping list. Cookbook has voice search for recipes built in. Search for recipes based on cuisine, cook time & techniques (grill, bake or fry). Get curated collection of the finest recipes for every event, that too for free. It can also suggest recipes for birthdays, anniversaries, weekend parties and getaways.Cookbook Recipe managerOur recipe manager helps you to create meals plans for special occasions. You get reminders for your meal plans and shopping alerts from recipe manager. Shopping for quick and easy recipes is also now simple.🌎 Popular recipes - WorldwideCookbook's trending section has Victoria sponge recipes, tuna casserole recipes, sea bass recipes, bok choy recipes, minestrone recipes, chicken wing recipes, quesadilla recipes, egg salads and mussels recipes.Our baking section has recipes for cakes, cupcakes, muffins, cheesecake, mug cake recipes, banana cake recipes etc you can cook without a big oven. Recipes for pizza, lasagne, baked salmon etc that need a big oven are also available in Cookbook.❤︎ Healthy recipes for healthy livingCookbook has a healthy meal planner with grocery list. Using the meal planner, you can add healthy recipes to the calendar. Ingredients required for the meal plan gets added to your shopping list.Special DietsCookbook helps people suffering from food allergies to dairy, seafood and peanuts eat healthy meals. Cookbook covers people following vegan, paleo, vegetarian and gluten free diets. Keep track of nutrition requirements for fat, calories, carbs and cholesterol using Cookbook. Non-vegetarian recipes for prime ribs, beef stew, pork chops are available in Cookbook. It also covers crock pot and seafood like shrimps and prawns. Appetizers and desserts for Christmas cookies, banana bread, cheesecakes and snickerdoodle are also available.🚫Offline recipesCookbook allows you to download recipes for offline use.  You'll never have to worry about internet while cooking your favourite Italian, Spanish or French recipe.",
    "descriptionHTML": "Cookbook recipes is one of the best recipes and shopping list apps in the world. We provide recipes for free in more than 20 languages around the world. We designed the Cookbook recipes app to support offline usage.<br><br>Cookbook&apos;s recipes saver allows you to edit a recipe from the web. The recipe can be modified to your taste and then saved into your recipes collection. Our recipes maganer allows adding new recipes, removing and editing saved recipes.<br><br>Are you preparing to start a diet plan? Cookbook&apos;s healthy recipes section is here to help. Get cooking ideas for low carb recipes, low calorie recipes, diet recipes to lose weight fast and more for free. Our shopping list and intelligent meal planner allows you to shop and eat healthy.<br><br>At Cookbook, we understand you passion for recipes. That is why we build a recipe finder by ingredients. The recipe finder by ingredients allows you to discover easy recipes with ingredients on hand. These yummy recipes come with a build in recipe converter to allow you to change recipe servings. Ingredient quantities are automatically changed based on your serving size.<br><br>A wide range of recipes are available in Cookbook like soup recipes, veg recipes, egg recipes, easy recipes, juice recipe, recipes for kids etc.&#x200B; Our recipe app in english, hindi, spanish, portuguese etc has offline support. You no longer need any of the old printed recipe books. Upgrade from the old recipe books to Cookbook recipes - a modern, smart and tasty recipes app.<br><br><b>&#x1F50D; Search by ingredient</b><br>Search for recipes with ingredients you have in your refrigerator. We can convert ingredients into recipes.<br><br><b>&#x1F469;&#x200D;&#x1F373;Cooking assistant</b><br>Cookbook assistant lets you create intelligent grocery list and shopping list. Cookbook has voice search for recipes built in. Search for recipes based on cuisine, cook time &amp; techniques (grill, bake or fry). Get curated collection of the finest recipes for every event, that too for free. It can also suggest recipes for birthdays, anniversaries, weekend parties and getaways.<br><br><b>Cookbook Recipe manager</b><br>Our recipe manager helps you to create meals plans for special occasions. You get reminders for your meal plans and shopping alerts from recipe manager. Shopping for quick and easy recipes is also now simple.<br><br><b>&#x1F30E; Popular recipes - Worldwide</b><br>Cookbook&apos;s trending section has Victoria sponge recipes, tuna casserole recipes, sea bass recipes, bok choy recipes, minestrone recipes, chicken wing recipes, quesadilla recipes, egg salads and mussels recipes.<br>Our baking section has recipes for cakes, cupcakes, muffins, cheesecake, mug cake recipes, banana cake recipes etc you can cook without a big oven. Recipes for pizza, lasagne, baked salmon etc that need a big oven are also available in Cookbook.<br><br><b>&#x2764;&#xFE0E; Healthy recipes for healthy living</b><br>Cookbook has a healthy meal planner with grocery list. Using the meal planner, you can add healthy recipes to the calendar. Ingredients required for the meal plan gets added to your shopping list.<br><br><b>Special Diets</b><br>Cookbook helps people suffering from food allergies to dairy, seafood and peanuts eat healthy meals. Cookbook covers people following vegan, paleo, vegetarian and gluten free diets. Keep track of nutrition requirements for fat, calories, carbs and cholesterol using Cookbook. Non-vegetarian recipes for prime ribs, beef stew, pork chops are available in Cookbook. It also covers crock pot and seafood like shrimps and prawns. Appetizers and desserts for Christmas cookies, banana bread, cheesecakes and snickerdoodle are also available.<br><br><b>&#x1F6AB;Offline recipes</b><br>Cookbook allows you to download recipes for offline use.  You&apos;ll never have to worry about internet while cooking your favourite Italian, Spanish or French recipe.",
    "histogram": {
        "1": 4025,
        "2": 2335,
        "3": 4734,
        "4": 9292,
        "5": 26062
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/a4q06MH3BxZ98rw9UpC5yTI0mHEkwCR2OadyHEDCpXmTvAcrmFmi1MmIty4jD4WtmhST=h310",
        "//lh3.googleusercontent.com/81j_zyPCOMtRfVOcdDCL3pIlElWjSnVB-NEBxiUJaGJKX09QD1ir_lUwP7kB2gi-HW4=h310",
        "//lh3.googleusercontent.com/_b-UIknAVm_dg_jaBUFypmNClEVJJbLRhkYqu3iiICFTGcJlYjUjMxS6a3zho8B1RQK_=h310",
        "//lh3.googleusercontent.com/5jZo3NtV_nryBUkAXGWrPRnaUAKjBvtyiqHDaF6SSdunRyDLLzl0TqwFKP5Fqtj5KQ=h310",
        "//lh3.googleusercontent.com/xxkJrGcqZQ6H8JWlf4cyVQbqLngtUGguC68vYX8aeTlJ5cv9dMPJ2_V3vwVL34DXww=h310",
        "//lh3.googleusercontent.com/e0V4eq7dk6b242et86IyIujhDns-Lw7p076-Rbo7_vFnveSuMg8hB8cS3vUb6hr_4b2P=h310",
        "//lh3.googleusercontent.com/BwHNrz2idCE29Wn4xcxnRk3DIsTIOevmlatt3tjlJV0_IvlPSpdeu9sNl4O6F7rDqS4=h310",
        "//lh3.googleusercontent.com/ePfAEbRphduymsYjZPZj440Qa36n9PQXf_sLGmofUCQS4XyiTkWZPr02CKcRC3GgCTbx=h310",
        "//lh3.googleusercontent.com/vdDiao6T2sIbvzV1dpja34O_qg7ZMcV0ukPiOYjlnSo2ws263NmwLX7EvzjQUUO14oI=h310",
        "//lh3.googleusercontent.com/f0b0-coqmWR87ghD3gTyvzWOA4VHhGlsACxL6UVZ8U1gJrOHOAyxHWhy4Kkfm79XNDQ=h310",
        "//lh3.googleusercontent.com/nfXesKL6yjRgRcjWMPMLz_kyfjw-XYBhtGZI-ttesf9ipf-OBrE644Nz_WUrxK8Qfvg=h310",
        "//lh3.googleusercontent.com/6KtpCfnm5jsh7zoUsk6h6sEdu6nZaXPHsjMC6qgAvJ-3aa8-QvlUyU5kZnJ_FcdY8A=h310"
    ],
    "comments": [
        "Cool",
        "I love it!",
        "Very helpful guide",
        "The best app for the best recipes in the world",
        "It is helpful",
        "I recently bought an upgraded phone. On my old phone I had this app, I loved it, I upgraded to premium to delete commercials and to give me unlimited access. When I bought my new phone, I was told that all apps would reload to my phone as they we currently installed. Now I'm being told again that I need to upgrade my app to premium to enjoy unlimited access to recipes. I had hundreds of recipes saved, which i cannot currently access. I am very disappointed in this and wish to ask consideration of you to rectify this inconvenience. Thank you"
    ],
    "recentChanges": [
        "Now you can organise your favourite recipes into collections of your choice.",
        "Personalised Diet Plans with workouts is here..!",
        "Added metric converter to make cooking more easier.",
        "Now get new personalised magazines with recipes, videos, food stories and more.",
        "🥘Change servings of recipes🥘",
        "Easy login and signup with Smartlock🔐🔐 🍔🍖"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.riatech.cookbook&hl=en&gl=us",
    "appId": "com.riatech.cookbook"
}