{
    "title": "l.ist - Simple Lists",
    "summary": "Get rid of the clutter. Keep it simple with l.ist.",
    "icon": "//lh3.ggpht.com/iW5X7kmvam-O2G0iuBKInhK0TcPfBUIbMkg60OeAbG3hBc5bAgC_Df5TroXRKhCRhBk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 1635,
    "developer": "Nasah Apps",
    "developerId": "Nasah+Apps",
    "developerEmail": "nasahapps@gmail.com",
    "developerAddress": "715 NW Hoyt St.\nPortland, OR 97208",
    "updated": "March 3, 2015",
    "version": "2.0.3",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "l.ist is simple. Just make one list. Or two. Or ten. Keep track of whatever's on your lists. Groceries. Clothing. Birthday wishlist. Even have it remind you before you leave the store to make sure you got everything. Like we said, that simple.  Oh, and you can change the list color. If you're into that.  And if you have Android Wear, view your list from your watch. If you like reading lists from your wrists.",
    "descriptionHTML": "l.ist is simple. Just make one list. Or two. Or ten. Keep track of whatever&apos;s on your lists. Groceries. Clothing. Birthday wishlist. Even have it remind you before you leave the store to make sure you got everything. <br><br>Like we said, that simple.  <br><br>Oh, and you can change the list color. If you&apos;re into that.  <br><br>And if you have Android Wear, view your list from your watch. If you like reading lists from your wrists.",
    "histogram": {
        "1": 27,
        "2": 23,
        "3": 125,
        "4": 493,
        "5": 967
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/5uYhmXNE57rvFuAeAM9EcsQM0q7lDxqOYNYg_Tm38-n4-tBm9UVi-mxrM1ELlHIr1z8=h310",
        "//lh3.ggpht.com/eyNO6ssoiKEs7TvrOXRRnc59ybk9V178Yp3Ya176kKBZvCCFQoNCG5aVYB0wwAVgz3LH=h310",
        "//lh6.ggpht.com/qm3vWgzPvhwmpUyaD7k8eoXB4s7tUvE1U0nRaqgiLb5AUMTS7hpfqXxsLDL3ouoS-II=h310",
        "//lh3.ggpht.com/H9eOPuT6QM10VtJPnb8obh4JW2vNywItpiRfwHNLtxojjveag0ushHR4Eo3ZAc6ouVU=h310",
        "//lh3.ggpht.com/bRdgvBcSnDuBX6A3WpnyIhtPkxLl99k1wMIng1ZdIKrFPzDQfW5JO-8jZ0PBxpau0eA=h310"
    ],
    "comments": [
        "Simple, good as what it does In it's simple way, it's fine. No outline style subcategory levels here  -  it allows plain one level list making, re-ordering items is possible by checking as 'done' then unchecking to move to base of list. I'd appreciate a less long-winded way to re-order items. But good, it neatly allots each list its own tab as new lists are made. I'll try a few competitors before I revisit this critique. My main sniff is that this does what a paper list can do, but re-ordering would take it  a bit further.",
        "Fantastic! Great little app. Just what I was looking for when doing the shopping. Haven't had a chance to check out the reminder. Can't see how that would work though cause there's no option to add location. Without that though, a top app nevertheless",
        "Loved it at first but... It froze up my text messages bad.  Every time I opened up an app it forced a game app from Google play and took over my phone.  Had to delete the app.",
        "Simple I like it. I agree with other reviewers about adding a tap-and-drag function for sorting. Also would like to see ability to make each list a different color. Is there a button to purge all completed tasks?",
        "It's  simple and clean, but reordering is inefficient.   You have to check it complete and it reorders to bottom;then you can uncheck the item. Awkward.  It would be nice to be able to reorder with a simple number system which would avoid having to move items.  Colors and look of the product is nice.",
        "I have rated it because it kept bugging me to rate it If I were in bad mood, I would give this 4 because of the bugging. But I'm not. (And the app is great.) It's really minimalistic, the colours are pretty, you can edit items and titles without maneuvering."
    ],
    "recentChanges": [
        "2.0.3",
        "*Fixed a bug that caused the app to crash on tablets.",
        "2.0",
        "*You can now create multiple lists! Also, lists will be backed up to your Google account.",
        "1.3",
        "*Added option to donate.",
        "1.2.1",
        "*Fixed the \"Unknown issue with Google Play services\" error.",
        "1.2",
        "*Added support for Android Wear! Now you can view your list from your wrist!",
        "1.1.2",
        "*Fixed a major bug where you couldn't make a list bigger than 8 items.",
        "1.1.1",
        "*Fixed widget so it doesn't show the blank list item."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.nasahapps.list&hl=en&gl=us",
    "appId": "com.nasahapps.list"
}