{
    "title": "WearResponses Unlocker",
    "summary": "Reply to SMS messages in a new way on your Android Wear device!",
    "icon": "//lh5.ggpht.com/KmS-cd0hM2F5lipdVkfNoNsrOi12yWgVW1KnQFs4J_1lE_ETtKTjvvRpyIlEQwT2uoXu=w300",
    "price": "$2.99",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.3,
    "reviews": 36,
    "developer": "Brandon McAnsh",
    "developerId": "Brandon+McAnsh",
    "developerEmail": "support@brandonmcansh.com",
    "developerWebsite": "http://brandonmcansh.com",
    "developerAddress": "11151 Manchester\nWashington, MI 48094",
    "updated": "July 15, 2015",
    "version": "2.3.2",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "This is not a standalone app, and is only accessible via the free version of WearResponses. Once installed, a popup window will show in WearResponses to take you to validate your license.  With the purchase of the Unlocker, you gain access to the following:* Ad-free experience* Unlimited canned responses* Create a new canned response directly from your Android Wear device* Send an SMS to any contact on phone, with any of your canned responses; all without saying a word!* Dial or Call any contact on phone directly from your Android Wear device The app must remain installed for the Pro features to remain available.",
    "descriptionHTML": "This is not a standalone app, and is only accessible via the free version of WearResponses. Once installed, a popup window will show in WearResponses to take you to validate your license.  <br><br>With the purchase of the Unlocker, you gain access to the following:<br>* Ad-free experience<br>* Unlimited canned responses<br>* Create a new canned response directly from your Android Wear device<br>* Send an SMS to any contact on phone, with any of your canned responses; all without saying a word!<br>* Dial or Call any contact on phone directly from your Android Wear device<br> <br><br>The app must remain installed for the Pro features to remain available.",
    "histogram": {
        "1": 12,
        "2": 2,
        "3": 0,
        "4": 6,
        "5": 16
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/UHcEeBjiIkFDtPSFVPCae41mmp1YdEwxE_SDQGsO7aRj55N2DxlsM5sCZTrrmqcXnXw=h310",
        "//lh6.ggpht.com/_ZnUJLG_YHlr3cRAnlu1lK8Gvk-k7Kh9hRT2sPmmWgFP8C3-ejfqm7WugS0fUmH86T4=h310"
    ],
    "comments": [
        "Purchased. Doesn't work. Developers support email no longer active. Can't get a refund. Nice little ripoff!",
        "Good app Simple but good allows me to send better messages than the standard :)",
        "Moto 360 I liked the app. Good idea,maybe you could add whatsapp and hangout, thanks",
        "Great Really well done. Does exactly what it claims to. Only problem is the sudden crashes when selecting specific contacts (upon creating a new message). Would also love WhatsApp support, if possible! I like it a lot because google does not let me dictate messages in my native language, and because most of my conversations are in it, it's quite restricting. Plus I speak 4 languages, so this is an even bigger plus to me. This app, though, enables me to easily reply in any language, without even having to go through the embarrassment dictating in public can attract in some cases. I do, however, imagine google will at some point add a more native way to do it.",
        "Does Not work Paid £1.83 and all it done was block the app! All it says is unauthorized unlock key found and locks all the features!",
        "Key not working Bought the key. Not wirking. Refunded."
    ],
    "recentChanges": [
        "Unlocker update to match current production release (2.3.2)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bmc.wearresponses.key&hl=en&gl=us",
    "appId": "com.bmc.wearresponses.key"
}