{
    "title": "Wake me up! Smart Alarm",
    "summary": "Your next-generation smart alarm clock!",
    "icon": "//lh3.googleusercontent.com/qJKC0k0I6K02lQuPx91NFzbqKae2xvI7ErFti4zJeV283WRxRBxTTEB7xTvowNpGBRFG=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 128,
    "developer": "FiveZ",
    "developerId": "FiveZ",
    "developerEmail": "five.z.contact@gmail.com",
    "developerWebsite": "https://fivez.github.io/policy",
    "developerAddress": "92250\nFRANCE",
    "updated": "March 3, 2018",
    "version": "6.2",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Wake me up! is a constantly improved smart alarm application with advanced features, thought with Material Design in mind from the start.It is fully compliant with Android 6 Marshmallow, Android 7 Nougat, Doze mode and DirectBoot. Even in Doze mode, the alarms fire properly and on time.Scheduling features• Non-repeating alarm for multiple days• Repeating alarms can ring every week, every 2 weeks, etc.• Prevent your alarm to ring during a short or long period of time without disabling it.• Define a specific date from which your repeating alarm will automatically disable itself• Change the time your alarm will ring on specific days• \"Gentle wake up\": will start ringing softly some time before the scheduled alarm.• Skip an alarm or go back to a previously skipped alarm in one tap• Quick nap: easily set an alarm to ring in 15 minutes, 30 minutes, 45 minutes or 1 hour in one tapCalendar-related scheduling featuresAssociate your alarm with one calendar and:• Prevent an alarm from ringing on days having \"all-day\" event (multi-days event are supported)More already planned for future releasesIntegrate your alarms with Android Wear and Tasker, as an event plugin or following an event.Informational features• Weather forecast (Weather forecast summary up to seven days, temperatures chart, maximum and minimum temperatures, etc.).• TTS message after dismissing an alarm: Greetings, Current date, Current time, Weather forecast, Max & min temperaturesRingtone features• Progressive ringtone• Repeating TTS message• One time TTS message, then repeating ringtone• Use a music file as a ringtone• Vibrations• Progressive, specific or default brightness• Lower or mute ringtone volume when taking the phoneSnooze and missed alarm features• Limit the number of snoozing or even forbid any snoozing• Customize the sooze length• Decreasing snooze length: snooze length will decrease after each report, down to one minute• Auto-snooze: missed alarms will be automatically snoozed (a maximum number of automatic snoozing can be defined)• Change the length of you alarm for its last repeat before being missed instead of automatically snoozed • Snooze an alarm by flipping the phone or waving your hand over the phoneLook features• Theme your alarm using default colors• Choose one of your pictures as your alarm background and use one of your picture's palette color as its theme• Automatically see a picture background related to your weather forecast• Custom notifications: a notification that displays your next alarm, permits to dismiss it and shows weather forecastNight mode• Shows current weather summary and temperature• Different types of night modes: Standard, Increase brightness on tap, Fully black screen and shows information on tapTasker integrationOther features• Backup (Online or local)• Timer• Dark theme• Clone and lock your alarm with a passcode• Permanent notification: Always display a notification about your next alarm, that permits to skip it or go back to it, and shows weather forecast.• Challenges: solve a mathematical challenge, reproduce a text• Widgets: a widget that shows the next ringing alarm, permits to skip it or go back to a previously skipped alarm• Test your alarmsGoogle+ Community: https://plus.google.com/communities/100666839075148296567Google+ Beta Community: https://plus.google.com/communities/109444887841058364077",
    "descriptionHTML": "Wake me up! is a constantly improved smart alarm application with advanced features, thought with Material Design in mind from the start.<br><br><b>It is fully compliant with Android 6 Marshmallow, Android 7 Nougat, Doze mode and DirectBoot. Even in Doze mode, the alarms fire properly and on time.</b><br><br><u><b>Scheduling</b> features</u><br>&#x2022; Non-repeating alarm for multiple days<br>&#x2022; Repeating alarms can ring every week, every 2 weeks, etc.<br>&#x2022; <b>Prevent your alarm to ring during a short or long period of time without disabling it.</b><br>&#x2022; Define a specific date from which your repeating alarm will automatically disable itself<br>&#x2022; <b>Change the time your alarm will ring on specific days</b><br>&#x2022; &quot;Gentle wake up&quot;: will start ringing softly some time before the scheduled alarm.<br>&#x2022; <b>Skip an alarm</b> or go back to a previously skipped alarm in one tap<br>&#x2022; <b>Quick nap</b>: easily set an alarm to ring in 15 minutes, 30 minutes, 45 minutes or 1 hour in one tap<br><br><u><b>Calendar-related</b> scheduling features</u><br>Associate your alarm with one calendar and:<br>&#x2022; <b>Prevent an alarm from ringing on days having &quot;all-day&quot; event</b> (multi-days event are supported)<br><i>More already planned for future releases</i><br><br>Integrate your alarms with <b>Android Wear and Tasker</b>, as an event plugin or following an event.<br><br><u><b>Informational</b> features</u><br>&#x2022; <b>Weather forecast</b> (Weather forecast summary up to seven days, temperatures chart, maximum and minimum temperatures, etc.).<br>&#x2022; TTS message after dismissing an alarm: Greetings, Current date, Current time, Weather forecast, Max &amp; min temperatures<br><br><u><b>Ringtone</b> features</u><br>&#x2022; Progressive ringtone<br>&#x2022; Repeating <b>TTS message</b><br>&#x2022; One time TTS message, then repeating ringtone<br>&#x2022; Use a <b>music file</b> as a ringtone<br>&#x2022; Vibrations<br>&#x2022; <b>Progressive, specific or default brightness</b><br>&#x2022; Lower or mute ringtone volume when taking the phone<br><br><u><b>Snooze and missed alarm</b> features</u><br>&#x2022; <b>Limit the number of snoozing or even forbid any snoozing</b><br>&#x2022; Customize the sooze length<br>&#x2022; <b>Decreasing snooze length</b>: snooze length will decrease after each report, down to one minute<br>&#x2022; <b>Auto-snooze</b>: missed alarms will be automatically snoozed (a maximum number of automatic snoozing can be defined)<br>&#x2022; Change the length of you alarm for its last repeat before being missed instead of automatically snoozed <br>&#x2022; Snooze an alarm by flipping the phone or waving your hand over the phone<br><br><u><b>Look</b> features</u><br>&#x2022; Theme your alarm using default colors<br>&#x2022; Choose <b>one of your pictures as your alarm background</b> and use one of your picture&apos;s palette color as its theme<br>&#x2022; Automatically see a picture background related to your weather forecast<br>&#x2022; <b>Custom notifications</b>: a notification that displays your next alarm, permits to dismiss it and shows weather forecast<br><br><b><u>Night mode</u></b><br>&#x2022; Shows current weather summary and temperature<br>&#x2022; <b>Different types of night modes</b>: Standard, Increase brightness on tap, Fully black screen and shows information on tap<br><br><b><u>Tasker integration</u></b><br><br><u>Other features</u><br>&#x2022; Backup (Online or local)<br>&#x2022; <b>Timer</b><br>&#x2022; Dark theme<br>&#x2022; Clone and lock your alarm with a passcode<br>&#x2022; Permanent notification: Always display a notification about your next alarm, that permits to skip it or go back to it, and shows weather forecast.<br>&#x2022; <b>Challenges</b>: solve a mathematical challenge, reproduce a text<br>&#x2022; Widgets: a widget that shows the next ringing alarm, permits to skip it or go back to a previously skipped alarm<br>&#x2022; Test your alarms<br><br>Google+ Community: https://plus.google.com/communities/100666839075148296567<br>Google+ Beta Community: https://plus.google.com/communities/109444887841058364077",
    "histogram": {
        "1": 9,
        "2": 5,
        "3": 13,
        "4": 20,
        "5": 81
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/6mDoR49AlUlc52f3AKyYKbxx1ZQpxipfw3iKStE6VslKfGwXN2GfjB0xMwK5kgOKQQAB=h310",
        "//lh3.googleusercontent.com/YBVK7lc_GWxfrzsIPSdStjLjKV9QC4agFFGzHozIVP4AYSg1vIZqgEflUpxSUrub-xg=h310",
        "//lh3.googleusercontent.com/zIDfLBvxA5btl9GB45rPTwrL_mJZu4jOfvBPGqIw4JFmF_3pcD3-9UdnJROUYakpDYw=h310",
        "//lh3.googleusercontent.com/uXrd-d3twrQqCioZknpGwKWGirmkr8M9qIFi9c6hlpL7WthGZsCJzYjX2v2TT6a3XjVW=h310",
        "//lh3.googleusercontent.com/aeVJf7OqzD09-ojg174lO7ndpHNjva90YmtyaL6cMBUD080DpytH_F4HkufWFjKloSA=h310",
        "//lh3.googleusercontent.com/6H7RxKquGrbOvVPrlOuAprQ8WvkWID3bei_3G6AroDHc9m181zWlmU-U7NuXQZQe57M=h310",
        "//lh3.googleusercontent.com/pBWGdO8mmYwT8HXoqG-2zjqPHUa4PgrmujcRTj9xqiwPe9X2hE7hoa1rK6gbeStt8FI=h310",
        "//lh3.googleusercontent.com/QWIRhvYi8-jv06ZnQO9H6T2C4OMYSkOTt1EcQtZgSzUcsFmjM5fgyBIpz4SVxN1wEbeE=h310",
        "//lh3.googleusercontent.com/TPNNppFIssIFMlIWqvYdRndJLNYDU-GbDF1FLDJWWWpV_WdxyRJx-Y8rw3NfhrLaqA=h310"
    ],
    "comments": [
        "The app is an OK alarm app as it sits now. The calendar sync functions are a little confusing and limiting, but the features it does have work well. I gave it 4 stars because the developer was really response to my questions and concerns and I'm really excited about his future plans for this app. I think with a couple updates that this will be a 5 star, goto alarm app in the near future.",
        "So is this just the demo for a paid app? It would be nice to know that up front. All the alarms I set have disappeared and it's asking me to pay for the full app. 😑",
        "Great app! But does not speak time in Hindi(India) language, even my TTS is set to Hindi(India). Please do something",
        "It's OK",
        "Best alarm app",
        "Best alarm yet. Great looking and feature filled. One suggestion though, one use disposable alarms, or alarms that delete themselves. This would make it perfect for me, and would certainly earn the pro unlock for me."
    ],
    "recentChanges": [
        "- New type of scheduling based on calendars",
        "- NFC Challenge",
        "- New layout for the list of alarms",
        "- New ringtone type: TTS once, then repeating music",
        "- New weather forecast",
        "- Lots of improvements and bugfixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.chlochlo.adaptativealarm&hl=en&gl=us",
    "appId": "com.chlochlo.adaptativealarm"
}