{
    "title": "LIFX",
    "summary": "Control LIFX light bulbs directly from your Android device",
    "icon": "//lh6.ggpht.com/TNqvnIKJgBqe-RHRX7Fpa2LwjxCsgR7qY7REXjFQOv2OPjFFIz6zoM7vZxXiWTJ_HwA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.3,
    "reviews": 4466,
    "developer": "LiFi Labs Inc.",
    "developerId": "LiFi+Labs+Inc.",
    "developerEmail": "support@lifx.co",
    "developerWebsite": "http://www.lifx.co",
    "updated": "February 14, 2018",
    "version": "Varies with device",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "size": "Varies with device",
    "description": "Discover 16 million vibrant colors and a thousand shades of white. With LIFX there are no cables or hub; all you need is Wi-Fi, your Android device and a LIFX Light. We think life is better in color. So why not transform your home without the mess? Dive into the amazing range of colors available from LIFX and make your home personal. Set your lights to suit your mood, music or even your style with your Android phone, tablet or wearable. FEATURES. THE LIFX WAY.There’s more to light than on and off and you can do it all with LIFX. Be delighted with our experience and discover light in a whole new way.EXCITING EFFECTS: Enjoy special effects like the music visualizer, candle flicker, strobe and color cycle.GROUPS: Choose your lights and group them together for easy control.SCENES & THEMES: Choose from our beautiful preset themes or capture your own and save the moment via scenes.ON THE MOVE: Never come home to the dark again. When you connect to the LIFX Cloud you can control your lights from anywhere with an Internet connection.SCHEDULES: Make your day and evening automatic by creating schedules to wake you up the natural way with slowly increasing light.CONNECTED. LIKE YOU ARE.Make your home a smart home by connecting your LIFX Lights to some of your favorite smart devices and apps.GOOGLE NEST: LIFX works with the Nest Thermostat and Protect. If Nest Protect detects smoke, your LIFX Lights can flash red to let you know there might be danger. When you are Away LIFX can save you energy and give you peace of mind with vacation mode.LOGITECH HARMONY: Use your remote control to automatically dim your lights in time to watch the latest blockbuster.SAMSUNG SMARTTHINGS: Let your LIFX Lights talk to smart locks, cameras and motion sensors to automate your home.IFTTT: Connect your LIFX Lights with the online apps you use everyday like Facebook and the Weather Channel. STAY IN TOUCH.We are always striving to offer the best possible experience and the best way to do this? By hearing directly from you. You can reach us at support@lifx.co, facebook.com/lifxlabs and twitter.com/lifx.LIFX Lights are available at lifx.com, Amazon.com, BestBuy and other select retailers.",
    "descriptionHTML": "Discover 16 million vibrant colors and a thousand shades of white. With LIFX there are no cables or hub; all you need is Wi-Fi, your Android device and a LIFX Light.<br> <br>We think life is better in color. So why not transform your home without the mess? Dive into the amazing range of colors available from LIFX and make your home personal. Set your lights to suit your mood, music or even your style with your Android phone, tablet or wearable.<br><br> <br>FEATURES. THE LIFX WAY.<br><br>There&#x2019;s more to light than on and off and you can do it all with LIFX. Be delighted with our experience and discover light in a whole new way.<br><br>EXCITING EFFECTS: Enjoy special effects like the music visualizer, candle flicker, strobe and color cycle.<br><br>GROUPS: Choose your lights and group them together for easy control.<br><br>SCENES &amp; THEMES: Choose from our beautiful preset themes or capture your own and save the moment via scenes.<br><br>ON THE MOVE: Never come home to the dark again. When you connect to the LIFX Cloud you can control your lights from anywhere with an Internet connection.<br><br>SCHEDULES: Make your day and evening automatic by creating schedules to wake you up the natural way with slowly increasing light.<br><br><br>CONNECTED. LIKE YOU ARE.<br><br>Make your home a smart home by connecting your LIFX Lights to some of your favorite smart devices and apps.<br><br>GOOGLE NEST: LIFX works with the Nest Thermostat and Protect. If Nest Protect detects smoke, your LIFX Lights can flash red to let you know there might be danger. When you are Away LIFX can save you energy and give you peace of mind with vacation mode.<br><br>LOGITECH HARMONY: Use your remote control to automatically dim your lights in time to watch the latest blockbuster.<br><br>SAMSUNG SMARTTHINGS: Let your LIFX Lights talk to smart locks, cameras and motion sensors to automate your home.<br><br>IFTTT: Connect your LIFX Lights with the online apps you use everyday like Facebook and the Weather Channel.<br><br> <br>STAY IN TOUCH.<br><br>We are always striving to offer the best possible experience and the best way to do this? By hearing directly from you. You can reach us at support@lifx.co, facebook.com/lifxlabs and twitter.com/lifx.<br><br>LIFX Lights are available at lifx.com, Amazon.com, BestBuy and other select retailers.",
    "histogram": {
        "1": 976,
        "2": 480,
        "3": 609,
        "4": 899,
        "5": 1502
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/5COnKjoe7zqHGw7rO6x-WMZxKGyFo9PwVFXC3efv3n6jQ6avBqWm4K8CnC8GJ-M_bXU=h310",
        "//lh3.googleusercontent.com/Su-0ts7b4wWhQEH01T7ZN3911BeYhDnCxd9YE1rPqyPEwp9ECevPkiGZulFtOF9m0w=h310",
        "//lh3.googleusercontent.com/pRigAKDgDj2IKP1ffqsaFhsP2T5KiREKVDFF0bj_3D7oLcF1S8tqIMtwt9aUnHNG4Bk1=h310",
        "//lh3.googleusercontent.com/4ByxNqd4sXd6Y2xY56hlBg1SnK0jEovPRJp3rLgrNTpREK8uSukb-9RcQhI8BQdgaHc=h310",
        "//lh3.googleusercontent.com/u2zfVn_lr7KEcS8jH1DplP2LmcfjLSrzzzpiwmazn6srukNf75g6TLysC9fwF55FAzo=h310",
        "//lh3.googleusercontent.com/mMgpD8PANHhBObSJkLlJ9ZqsUOj-jq7lZV8Ru8QfClNJ68GCaokcGLfoJcFS8V1aax8=h310",
        "//lh3.googleusercontent.com/27OfZxYPNezMx5Xgidz9kewrbd7wiPEI5UMDekG_fffsZscwX2fm9gOBf_MYFErauQ=h310",
        "//lh3.googleusercontent.com/QCmH95V6dwpx5_0ZzGabS-AQ5L9-OobEqA3YSQWqhiVu4hJqawk6-JtIFsX76mULZ_o=h310",
        "//lh3.googleusercontent.com/CNHdEm_92gUlZDlT_yRuZrWT1q-4k5SpHGVqpHJrqf-TorHCwilOfculheoAQ0A87Ko=h310",
        "//lh3.googleusercontent.com/YgRtkUl0qpVwGruH0sx4Wr8RVzHEg3jOTdk4A6bFHuqdkXU8NOgwn78IIGcxNKTMhLA=h310",
        "//lh3.googleusercontent.com/1kWrV-MIAjcx-LvOFtkS9lcyP90Z-bbIfY2cuImcofHA5Swt3r0gzNPn_Lfi9d5szg=h310"
    ],
    "video": "https://www.youtube.com/embed/teBBPPBT3Uw",
    "comments": [
        "Just got 1 bulb to try. Well love it! Easy setup. Easy integration with Alexa. Super rich in features. Still exploring them. I would definitely recommend these. But as I may want more controlled lights, I have to decide if I want to switch to hub based solution. Certainly the color realism blows the others away. Ok price for the bulb, but 39 instead of 53 woul be better, but what the heck",
        "I have this app rated 5, however I deleted my rating to put a one because of the horrible new adaptation of the app. It is difficult to use the lights look a lot worse because of the switching between lights the modes are horrible and not customizable at all. If you're going to add new things at least give us the ability to change back to the way we liked it.",
        "Hardly ever works. I have to restart app several times before the bulb gets detected. Very frustrating. My WiFi settings and signal are all good and I tried it on 2 different devices. Seems to be getting worse and worse. Full of annoying ads. UPDATE: completely useless. Worse than ever. I would give it -5 stars id I could. Don't bother",
        "App has come a long way. If you have a dual band router and you're having connectivity issues, hide the SSID of the band the bulb is not using. DEVELOPERS: please work with Automateit devs to fix plugin and keep it from crashing.",
        "Recent updates have done nothing but ruin the integrity of this app. It constantly disconnects my light randomly and can never \"re-find\" it. When it works it does its job pretty well but its just to unreliable to get a better rating. Going with the more expensive but trustworthy company like Phillips Hue is a far better idea for anyone wanting this technology.",
        "Frequent poor connection and lag on the software side. Not a fan of how the update split the white and color wheels - far less simple.  A shame that the bulbs are a definite 5/5 and I struggle to give the app a 2/5 rating."
    ],
    "recentChanges": [
        "Added more options for applying themes to Tiles, fixed a bug with turning groups containing mixed power state Off, added software licenses to Legals section, fixed a range of crash fixes and minor bugs."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.lifx.lifx&hl=en&gl=us",
    "appId": "com.lifx.lifx"
}