{
    "title": "Ride with GPS - Bike Computer",
    "summary": "Official Ride with GPS app. GPS logging for your rides and voiced navigation.",
    "icon": "//lh3.googleusercontent.com/Jrtl9WjHvD6Fs5LUTSr0_SKcUr7RNiXPPYvTQru63oJQZiqlXhesT4KyhgubcDOU3cc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 3159,
    "developer": "Ride with GPS",
    "developerId": "Ride+with+GPS",
    "developerEmail": "info@ridewithgps.com",
    "developerWebsite": "http://ridewithgps.com",
    "developerAddress": "Ride with GPS\n2222 NE Oregon St, Suite 210\nPortland, OR 97232",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Looking for rock-solid GPS logging? How about excellent bike navigation and live tracking? With support for bluetooth cadence, heart rate and power accessories, Ride with GPS is the best bike computer on the market. Come experience our passion to make riding easy, safe and fun for cyclists worldwide.Ride, Record, Snap, and Share - Ride with GPSRIDE• One press and you’re off; we’ll provide a map, distance traveled, ride duration and more.• Designed to be stable and efficient; we’ll record all your stats while leaving battery life to spare.• See routes and cuesheets planned with our website, http://ridewithgps.com• Love your Garmin? Keep it. Our product can stand alone or work in tandem with your existing bike computer.• Live logging lets your friends track your ride with GPS.  Basic/Premium only.• Route navigation; turn by turn guidance with voice prompts and cue sheets so you never get lost while riding your bike.  Basic/Premium only.RECORD• Rock-solid GPS Logging; accuracy and stability are important. Like you, our GPS won’t quit.• Comprehensive Bluetooth and Bluetooth Smart support; capture power, cadence, heart rate, and more. Can also be used when riding indoors.• Bicycle profiles for more accurate data; keep your stats organized by equipment for a more complete look at your ride history.• We love all bikes; Whether you ride a mountain bike or a road bike, our software is the perfect companion.SNAP• Make it memorable; take photos using your preferred camera app, and we’ll automatically associate them with your ride.• Remember great spots; photos with location data are geotagged on your ride.• Enhance your Garmin; even if you prefer your own bike GPS, the Ride with GPS app makes it easy to take and upload photos when you are done.SHARE• Be social; publish your rides to social media, or keep them within our community.  Of course we value privacy, it's simple to hide any rides from public eyes.• Make it presentable; add additional details using the Ride with GPS website, and share your rides and photos in a format your friends and family will enjoy.• Between other software and devices; export GPX, KML, or TCX files from the website for use in other software or compatible bike GPS units.• Your data; we believe that our users own their data.  We’ll never hold your ride history hostage.FOR OUR CUSTOMERS• Turn by turn navigation; whether you’ve planned a bike ride in advance, or you’ve found one from our catalogue, we’ll keep you cycling in the right direction.• Keep it real with live logging; publish ride stats and photos in real time, so your friends and family can track your progress.• Offline Maps keeps you on route even when you have no cell service.SUPPORTED DEVICESRide With GPS supports all Bluetooth Smart (Bluetooth 4/BTE/BTLE) sensors, as well as Polar and Zephyr regular Bluetooth heart rate sensors. We’ve thoroughly tested the following:Wahoo Fitness Blue HR StrapWahoo Fitness Blue SC speed and cadence sensorWahoo Fitness RPM cadence sensorStages power meterPolar Wearlink+ BTLE heartrate strapPolar H7 Bluetooth Smart heart rate strapZephyr HxM Bluetooth heart rate sensorJarv Bluetooth 4.0 Cycling Speed and Cadence SensorTopeak PanoBike Bluetooth Smart Cadence and Speed SensorRuntastic Speed and Cadence Bike SensorPowertap BTLE speed and cadence sensorMagellan EchoWhile we haven’t tested it, Powertap’s Bluetooth Smart Powercap should work.Come visit us at http://ridewithgps.com for more ways to improve your ride.",
    "descriptionHTML": "Looking for rock-solid GPS logging? How about excellent bike navigation and live tracking? With support for bluetooth cadence, heart rate and power accessories, Ride with GPS is the best bike computer on the market. Come experience our passion to make riding easy, safe and fun for cyclists worldwide.<br><br>Ride, Record, Snap, and Share - Ride with GPS<br><br>RIDE<br><br>&#x2022; One press and you&#x2019;re off; we&#x2019;ll provide a map, distance traveled, ride duration and more.<br>&#x2022; Designed to be stable and efficient; we&#x2019;ll record all your stats while leaving battery life to spare.<br>&#x2022; See routes and cuesheets planned with our website, http://ridewithgps.com<br>&#x2022; Love your Garmin? Keep it. Our product can stand alone or work in tandem with your existing bike computer.<br>&#x2022; Live logging lets your friends track your ride with GPS.  Basic/Premium only.<br>&#x2022; Route navigation; turn by turn guidance with voice prompts and cue sheets so you never get lost while riding your bike.  Basic/Premium only.<br><br>RECORD<br><br>&#x2022; Rock-solid GPS Logging; accuracy and stability are important. Like you, our GPS won&#x2019;t quit.<br>&#x2022; Comprehensive Bluetooth and Bluetooth Smart support; capture power, cadence, heart rate, and more. Can also be used when riding indoors.<br>&#x2022; Bicycle profiles for more accurate data; keep your stats organized by equipment for a more complete look at your ride history.<br>&#x2022; We love all bikes; Whether you ride a mountain bike or a road bike, our software is the perfect companion.<br><br>SNAP<br><br>&#x2022; Make it memorable; take photos using your preferred camera app, and we&#x2019;ll automatically associate them with your ride.<br>&#x2022; Remember great spots; photos with location data are geotagged on your ride.<br>&#x2022; Enhance your Garmin; even if you prefer your own bike GPS, the Ride with GPS app makes it easy to take and upload photos when you are done.<br><br>SHARE<br><br>&#x2022; Be social; publish your rides to social media, or keep them within our community.  Of course we value privacy, it&apos;s simple to hide any rides from public eyes.<br>&#x2022; Make it presentable; add additional details using the Ride with GPS website, and share your rides and photos in a format your friends and family will enjoy.<br>&#x2022; Between other software and devices; export GPX, KML, or TCX files from the website for use in other software or compatible bike GPS units.<br>&#x2022; Your data; we believe that our users own their data.  We&#x2019;ll never hold your ride history hostage.<br><br>FOR OUR CUSTOMERS<br><br>&#x2022; Turn by turn navigation; whether you&#x2019;ve planned a bike ride in advance, or you&#x2019;ve found one from our catalogue, we&#x2019;ll keep you cycling in the right direction.<br>&#x2022; Keep it real with live logging; publish ride stats and photos in real time, so your friends and family can track your progress.<br>&#x2022; Offline Maps keeps you on route even when you have no cell service.<br><br>SUPPORTED DEVICES<br><br>Ride With GPS supports all Bluetooth Smart (Bluetooth 4/BTE/BTLE) sensors, as well as Polar and Zephyr regular Bluetooth heart rate sensors. We&#x2019;ve thoroughly tested the following:<br><br>Wahoo Fitness Blue HR Strap<br>Wahoo Fitness Blue SC speed and cadence sensor<br>Wahoo Fitness RPM cadence sensor<br>Stages power meter<br>Polar Wearlink+ BTLE heartrate strap<br>Polar H7 Bluetooth Smart heart rate strap<br>Zephyr HxM Bluetooth heart rate sensor<br>Jarv Bluetooth 4.0 Cycling Speed and Cadence Sensor<br>Topeak PanoBike Bluetooth Smart Cadence and Speed Sensor<br>Runtastic Speed and Cadence Bike Sensor<br>Powertap BTLE speed and cadence sensor<br>Magellan Echo<br><br>While we haven&#x2019;t tested it, Powertap&#x2019;s Bluetooth Smart Powercap should work.<br><br>Come visit us at http://ridewithgps.com for more ways to improve your ride.",
    "histogram": {
        "1": 301,
        "2": 161,
        "3": 288,
        "4": 736,
        "5": 1673
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/wrkzfFmuiySaXaGQsI33j7ZLcmYRqKVU9LNgR0o7H8hdPaTvMqEeKPzvm_n82Mw5xSTq=h310",
        "//lh3.googleusercontent.com/fDa4L8EAOt9GvJdA-o_GwhdHUwfygRfeaGvnPrq0_V9P1YqVRtrR3nGOd9L8xaGm2SI=h310",
        "//lh3.googleusercontent.com/G9_Ar_5dpljhw4YpW8epAgwgNGFI831M1IOGx5E_k9RAFStQHrk4mlSE6dLKyoswLxU=h310",
        "//lh3.googleusercontent.com/iNvQunojwk-Xb6_Vf4ck5xb0Dfqg4SUOyzAGqcN2POwPL3jQNSrv1U7CZ5r0ERynihQ=h310",
        "//lh3.googleusercontent.com/4Emt5TVVdk4C_IFwDvuMQ3LBEOKiiw1brUbWc14sKsWyWDTHwLAtEAWzHk1kFiykCBs=h310",
        "//lh3.googleusercontent.com/qgcjS1uVkY7FSCEolLD_9ib4v2UVzGtNFxV-xRNv189qtbmxeUU6UEfwFj_7ZmFhhPk2=h310",
        "//lh3.googleusercontent.com/ekQ7OErUAih23WdX21uIk_m7yqQZ3iHK8SrbeKSLI-9JMQF_8Hc88s19-qxb8Ix8bZ8=h310",
        "//lh3.googleusercontent.com/FbLnGCkSCXTBGwUvp2C89xRL0mdqYPdyylq_NxFEbJC-Rzsi8_1-ui_QPeDVJ8jZOGQ=h310",
        "//lh3.googleusercontent.com/uxnTnV6Q5jkAtp-4zS7Luwipz_dxmf82j9dsIhHbH3cxy8_7kg4SLT3dixwL8CG6HLE=h310",
        "//lh3.googleusercontent.com/RfJ-AYim4iO16SpVUN46BwaIaNoo49PB-mlTFZ3Ganx0hDpBGPSFv6tni28EvU-plA0=h310",
        "//lh3.googleusercontent.com/K0UvvAxNVLCCm0z7k2Wdvn6nI7nN7vweQL5lgFHSrY3LDNWzj5ncVTF6WBg0QJwIXF5D=h310"
    ],
    "comments": [
        "Not user friendly. Strava is still better",
        "Overall fantastic but photos taken from inside the app are very potato - nothing near what my phone camera is capable of. That makes me sad. Any chance that can be improved? It really is unfortunate to take a picture back on some beautiful mountain bike trail and then look at it later and the picture quality is pitiful.",
        "Well it shows me that I'm located in Oregon which is wrong I'm in Arizona and can't find a setting to change it. So how accurate can this app be? I haven't used it yet as I can't even get it to be correct.",
        "Great app for tracking individual rides as well as trends and ensemble performance over time. I'd give it five stars if it had Di2 integration/display.",
        "Great app. Allows me to plot routes on computer and follow on the phone. App seems reliable enough after over a year of usage (have paid for navigation etc). Helpful support team.",
        "I use the web site all the time . The app just crashes every time I try to use it"
    ],
    "recentChanges": [
        "GPS Acquisition Status:",
        "- A status banner replaces the old GPS status pop up",
        "- See your map as soon as you start recording.",
        "- See your ride recording status from the home screen and jump to it without pausing or resuming.",
        "Lots of bugs fixed including:",
        "*  Weekly/monthly stats starting at the wrong time.",
        "*  Elevation profile not rendering correctly.",
        "*  Many UI glitches resolved.",
        "*  BTLE connection when adapter is off before starting.",
        "*  USGS Tiles"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ridewithgps.mobile&hl=en&gl=us",
    "appId": "com.ridewithgps.mobile"
}