{
    "title": "Reminder App With Alarm: To Do",
    "summary": "MarkO Reminder - The Best Free Todo App to create reminder list for your Tasks",
    "icon": "//lh3.googleusercontent.com/XXIPXhUlwsj6j_Nm41_oMWIEw7cF5DjEvd7I-tDmLcPYr7q30qhIHMyyD9O2R7O2pw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4,
    "reviews": 378,
    "developer": "CodeWell Unlimited",
    "developerId": "CodeWell+Unlimited",
    "developerEmail": "feedback@marko.rocks",
    "developerWebsite": "http://marko.rocks/",
    "updated": "August 8, 2017",
    "version": "4.0.4",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "MarkO, Reminder App with Alarm: to do  is now available in Google Play Store for free. It is a unique productivity app that will surely make your life easier with efficient time management as well as task priority management.We get reminder support for completing all our daily tasks by deadline. In fact a gentle task reminder about some urgent pending work makes magic for streamlining the pending tasks todo. It may be about calling your doctor, buzzing your plumber, making payment to banker, or simply to call your sister wishing her happy anniversary! Gone are those days of maintaining an organizer for alarm reminder; now you can easily turn your mobile phone into a reminder widget simply by downloading the productivity app MarkO, with versatile reminder facilities.How the app is uniqueThe most beautiful feature of MarkO is its unique adaptability and immaculate simplicity. Once you download this todo app on your mobile device, you will get its virtual assistance round-the-clock, round-the-year: MarkO, the reminder app with Alarm: to do will hark back you about your pending priority jobs in the most appropriate manner, on time, everywhere, so that you never miss anything. The advantage of this todo app is peace of mind and smart task management. The reminder facility will offer enough time to concentrate you on your task in hand; you need not to worry about “what next”? Its daily reminder, voice reminder, note reminder, and hourly reminder features will help you in streamlining all your to-do tasks timely and without taking extra load in your memory. As a result, you can invest quality time in office as well as you can coordinate your minute household chore even with best accuracy and punctuality. How the app works:This aide memory app works in simple way but it offers unfailing productivity due to its algorithm and integrated features for conveying reminders in most comprehensive ways. The app it integrated with artificial intelligence and is capable of providing its users smart suggestions based on the perspective of the reminder and offers the best possible ways to set reminder. The main functionalities are multifaceted. With this app, you will facilitated for•\tSetting a reminder: Setting a reminder is really stress-free,•\tEditing a reminder: you can change/modify the reminder,•\tImporting your contacts: You can free to import your vital contacts from your Phonebook/ Facebook account.•\tFiltering contacts: You can filter your contacts on “Share Task” screen,•\tEnjoying location awareness: MarkO, the utility app, is designed with unique algorithm that will remind contextually near the most appropriate location to complete the task. Even better this works perfectly regardless where you come from. •\tSharing features of the app: you can get to access your friends via the most popular interactive platforms like Facebook,  Skype etc. and share with them unlimited number of reminders, regardless they are using MarkO or not.•\tLocation based reminder setting: Using MarkO you can categorize your task location wise. Your to do jobs at home and at office will never get jeopardized.•\tVoice recognition facility: You can generate your reminders by voice mail. When you are busy with some other task, the audio support will be an added support for remembering your pending task.Download the app MarkO, Reminder App with Alarm: to do and start using its all-rounder reminder facilities to stay away from all confusion. With the support of the versatile task reminder facility, you will never forget anything from your “to do” list.If you like this to do list with reminder task app, don’t forget to support it by rating, reviews and sharing it with your friends and family. Send your suggestions to make MarkO smarter, your feedback is valuable to us.Join US:Facebook:  https://www.facebook.com/MarkO-Your-smart-task-buddy-That-ROCKS-1485329245062270/Google+:  https://plus.google.com/+MarkOTheBuddyThatRocks",
    "descriptionHTML": "<b>MarkO, Reminder App with Alarm: to do </b> is now available in Google Play Store for free. It is a unique productivity app that will surely make your life easier with efficient time management as well as task priority management.<br><br>We get reminder support for completing all our daily tasks by deadline. In fact a gentle task reminder about some urgent pending work makes magic for streamlining the pending tasks todo. It may be about calling your doctor, buzzing your plumber, making payment to banker, or simply to call your sister wishing her happy anniversary! Gone are those days of maintaining an organizer for alarm reminder; now you can easily turn your mobile phone into a reminder widget simply by downloading the productivity app MarkO, with versatile reminder facilities.<br><br><b>How the app is unique</b><br><br>The most beautiful feature of MarkO is its unique adaptability and immaculate simplicity. Once you download this todo app on your mobile device, you will get its virtual assistance round-the-clock, round-the-year: MarkO, the reminder app with Alarm: to do will hark back you about your pending priority jobs in the most appropriate manner, on time, everywhere, so that you never miss anything. <br><br>The advantage of this todo app is peace of mind and smart task management. The reminder facility will offer enough time to concentrate you on your task in hand; you need not to worry about &#x201C;what next&#x201D;? Its daily reminder, voice reminder, note reminder, and hourly reminder features will help you in streamlining all your to-do tasks timely and without taking extra load in your memory. As a result, you can invest quality time in office as well as you can coordinate your minute household chore even with best accuracy and punctuality. <br><br><b>How the app works:</b><br><br>This aide memory app works in simple way but it offers unfailing productivity due to its algorithm and integrated features for conveying reminders in most comprehensive ways. The app it integrated with artificial intelligence and is capable of providing its users smart suggestions based on the perspective of the reminder and offers the best possible ways to set reminder. The main functionalities are multifaceted. With this app, you will facilitated for<br><br>&#x2022;\tSetting a reminder: Setting a reminder is really stress-free,<br>&#x2022;\tEditing a reminder: you can change/modify the reminder,<br>&#x2022;\tImporting your contacts: You can free to import your vital contacts from your Phonebook/ Facebook account.<br>&#x2022;\tFiltering contacts: You can filter your contacts on &#x201C;Share Task&#x201D; screen,<br>&#x2022;\tEnjoying location awareness: MarkO, the utility app, is designed with unique algorithm that will remind contextually near the most appropriate location to complete the task. Even better this works perfectly regardless where you come from. <br>&#x2022;\tSharing features of the app: you can get to access your friends via the most popular interactive platforms like Facebook,  Skype etc. and share with them unlimited number of reminders, regardless they are using MarkO or not.<br>&#x2022;\tLocation based reminder setting: Using MarkO you can categorize your task location wise. Your to do jobs at home and at office will never get jeopardized.<br>&#x2022;\tVoice recognition facility: You can generate your reminders by voice mail. When you are busy with some other task, the audio support will be an added support for remembering your pending task.<br><br>Download the app MarkO, Reminder App with Alarm: to do and start using its all-rounder reminder facilities to stay away from all confusion. With the support of the versatile task reminder facility, you will never forget anything from your &#x201C;to do&#x201D; list.<br><br>If you like this to do list with reminder task app, don&#x2019;t forget to support it by rating, reviews and sharing it with your friends and family. Send your suggestions to make MarkO smarter, your feedback is valuable to us.<br><br>Join US:<br>Facebook:  https://www.facebook.com/MarkO-Your-smart-task-buddy-That-ROCKS-1485329245062270/<br>Google+:  https://plus.google.com/+MarkOTheBuddyThatRocks",
    "histogram": {
        "1": 46,
        "2": 18,
        "3": 44,
        "4": 62,
        "5": 208
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ztB74jMZeIQ-ga8hYeKHkhUsJsebT0WCoJ44iqYyH58RLTH8LQZnBormfLQmdLzXLmE=h310",
        "//lh3.googleusercontent.com/IJuDYP4ZsSJIpAOLFSJaoUKA94QR-T0SQEO6c8eNBP2prj3HKlKALKPgvnFes9gp7A=h310",
        "//lh3.googleusercontent.com/fEWlEmOJnPybdNg0tmGG4E8C95zwOLM-_zPjZ-sczzMcQw0Pno40YAC0jJY5leUjTx8u=h310",
        "//lh3.googleusercontent.com/fh4QORVKR2funENvrC6KUYqsAjpyvo2SBVsxQvpj0zFBsbhGoGEtfPU9l9iZOmCZmA=h310",
        "//lh3.googleusercontent.com/QAD5oJFAhcFkcEpN9X1XzNsX3CR2t-LMyfF1YHkwKx1haf2HP1m4v7yj8a9X-FGZNg=h310",
        "//lh3.googleusercontent.com/E07MR60BNXHzGXThzKV44D7NUk_yPOyYK9NWFvPDFh4AIYpr-KCh4ZwxlEFPoIJxzE4=h310",
        "//lh3.googleusercontent.com/HrMZ33B2ZYaLZVG1RweraK0w3CZbFKIPHVgvcEtj6l0zq85STw7wtUnjx7ejXR3flkQ=h310",
        "//lh3.googleusercontent.com/sDC2XG7rkOsZKaNuiYl58ndbKKlouujMluVUG2IXzWkhn5CnOakK2uLPqzYKEsryxg=h310",
        "//lh3.googleusercontent.com/an0NjSb93koV1Tjb16oDOqeoA7QavJRTWCmxlCsH5xEyp9VNnSD7EGt5q2Y8lDrhrXES=h310",
        "//lh3.googleusercontent.com/2AfAApwUoRb2tfAC1K_l7En2Jzx02LVibgclr9KlXghqxqQga2SnLk18SNzzl6oFFbY=h310"
    ],
    "video": "https://www.youtube.com/embed/-ak-BLiXcSk",
    "comments": [
        "Installed this app to evaluate it when I had the the time to do so. In the meanwhile it just started crashing 3 times a minute and uninstalling is just the most seductive solution, because first impressions count most",
        "Good but sign  error issue",
        "Why request for email?",
        "Very good Reminders are my most used type of app on my phone - always looking for a better one. MarkO ticks most boxes and it's free. If you're into reminder apps - check it out! 4 stars because I'm anxiously awaiting snooze function... Thanks for the updates dev!",
        "Location problem Insert address, full address even comes up after only street no and name are entered but the app still cannot find location. Location doesn't work.",
        "May try again later if the bugs get fixed. Locations not found or settable. Voice recognition is not very good. Goggle now far superior."
    ],
    "recentChanges": [
        "- Google Calendar Integration (sync control)",
        "- UX Updates"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.codewell.unltd.mk.projectmarko&hl=en&gl=us",
    "appId": "com.codewell.unltd.mk.projectmarko"
}