{
    "title": "WeChat",
    "summary": "The messaging, voice &amp; video call app used by 900 million people",
    "icon": "//lh3.ggpht.com/zC5Q4atR1JytzagSPIPAg-z4uItJGsTVjZHvf9nSeGdwrwnuPPW_OqMk6FAI3DJvzQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.2,
    "reviews": 5277460,
    "developer": "WeChat",
    "developerId": "WeChat",
    "developerEmail": "support@wechat.com",
    "developerWebsite": "http://www.wechat.com",
    "developerAddress": "661 Bryant St, Palo Alto, California, USA, 94301",
    "updated": "February 22, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "\"Much better, much more popular, much more user-friendly” - USA Today\"Simple enough that anyone can use it, versatile enough that everyone has some use for it\" - WiredWeChat is a messaging and calling app that allows you to easily connect with family and friends across countries. It's the all-in-one communications app for text (SMS/MMS), voice and video calls, Moments, photo sharing, and games.WHY USE WECHAT:• MULTIMEDIA MESSAGING: Send video, photo, text, and voice messages.• GROUP CHAT & CALLS: Create group chats with up to 500 people and group video calls up to 9 people.• FREE VOICE & VIDEO CALLS: High-quality free calls to anywhere in the world.• WECHAT OUT CALLS: Make calls to landlines and mobile around the globe at low rates (in certain regions only).• STICKER GALLERY: Hundreds of free, fun, animated stickers to express your feelings from some of your favorite cartoons and movies.• MOMENTS: Share your best moments on your personal photo stream.• BETTER PRIVACY: WeChat gives you the highest level of control over your privacy. It's the only messaging app to be certified by TRUSTe.• MEET NEW FRIENDS: Use “Friend Radar”, “People Nearby” and “Shake” to meet others. • REALTIME LOCATION: Instead of having to tell others where you are, just use real-time location sharing.• LANGUAGE SUPPORT: Localized in 20 different languages and can translate messages to any language.• AND MORE: Desktop app, custom wallpapers, custom notifications, and Official Accounts.",
    "descriptionHTML": "&quot;Much better, much more popular, much more user-friendly&#x201D; - USA Today<br>&quot;Simple enough that anyone can use it, versatile enough that everyone has some use for it&quot; - Wired<br><br>WeChat is a messaging and calling app that allows you to easily connect with family and friends across countries. It&apos;s the all-in-one communications app for text (SMS/MMS), voice and video calls, Moments, photo sharing, and games.<br><br>WHY USE WECHAT:<br>&#x2022; MULTIMEDIA MESSAGING: Send video, photo, text, and voice messages.<br>&#x2022; GROUP CHAT &amp; CALLS: Create group chats with up to 500 people and group video calls up to 9 people.<br>&#x2022; FREE VOICE &amp; VIDEO CALLS: High-quality free calls to anywhere in the world.<br>&#x2022; WECHAT OUT CALLS: Make calls to landlines and mobile around the globe at low rates (in certain regions only).<br>&#x2022; STICKER GALLERY: Hundreds of free, fun, animated stickers to express your feelings from some of your favorite cartoons and movies.<br>&#x2022; MOMENTS: Share your best moments on your personal photo stream.<br>&#x2022; BETTER PRIVACY: WeChat gives you the highest level of control over your privacy. It&apos;s the only messaging app to be certified by TRUSTe.<br>&#x2022; MEET NEW FRIENDS: Use &#x201C;Friend Radar&#x201D;, &#x201C;People Nearby&#x201D; and &#x201C;Shake&#x201D; to meet others. <br>&#x2022; REALTIME LOCATION: Instead of having to tell others where you are, just use real-time location sharing.<br>&#x2022; LANGUAGE SUPPORT: Localized in 20 different languages and can translate messages to any language.<br>&#x2022; AND MORE: Desktop app, custom wallpapers, custom notifications, and Official Accounts.",
    "histogram": {
        "1": 431224,
        "2": 195801,
        "3": 456887,
        "4": 872729,
        "5": 3320819
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/q1WJfJxaXmy5i4tfdv8N_Gmj9rqgbViqa4hvWPvkKLLGL6DGnrMn_rQGpsvT2qBT7l8=h310",
        "//lh3.googleusercontent.com/hLEBkQfx0ndeRLG_nwgiytWwdutPvcTNjCDhES8JM7TxtVta7GN1gJEHVYu4KxtuhA=h310",
        "//lh3.googleusercontent.com/_gJ6tFseIRJ37QidhoafHcXVTNgbKCNdRscDu-galB6PFERvJ_KRYadetEdAxbmyH1g=h310",
        "//lh3.googleusercontent.com/RrXCnIwok1tv2jNuFIzP3DJzNNKI5FE740diGq8bA4BiLdph-iwJ98J8GVKaIPxr-cY=h310",
        "//lh3.googleusercontent.com/f6JC6E1BdGU7v87VAU-u8HHXHHZoB-e1_J-BJENJqTzXA_PXyg6AWc4nzJ6K9iV8tQ=h310",
        "//lh3.googleusercontent.com/CxY2F3fTX9zghZfGDj0uoBUgJGIIyUFpL6DqOA0RC4jvwCiWptRj30GoOWMjfJsieG0=h310",
        "//lh3.googleusercontent.com/0EOExbfuljKb1kHVopdZiVUpfddA796Pxfde79I0jeu9WLmxte8GuCJ5dvbt6BZKzrs=h310",
        "//lh3.googleusercontent.com/WjLIz91hzNr056iS1b4kx8RlVj2Tb8sfhwGYOVAPS8WM1Kf0nv9MqqNIPyz6AQK02g=h310",
        "//lh3.googleusercontent.com/xVnSr7_YTwtis_e5ZM-abEztocjVwsvcweH8ybbMmPy2xV5ZYhbcEfe5yJD7GWKxi1k=h310",
        "//lh3.googleusercontent.com/SYbuSUEr4TATgp9eFz8qPaNC7o8POTXbBOCQ78gHz8jjy5ovGbibGh_osLWSjV4dpfc=h310",
        "//lh3.googleusercontent.com/cqnkuPD7ydpIx6hLbDkHwHqr1z_zx1LJ1QXny8h_V1FLssgQMLrQRQ6HtTlX2aVsL2v7=h310",
        "//lh3.googleusercontent.com/Z37jgZMxreLbnGylQfCMck8QTljbWc--zQheGrZ-ybrBrDN9oa_p9laCgO1nr9G4Ug=h310",
        "//lh3.googleusercontent.com/kYqu-OazWG2l8JI_5-pgXtp_lP-LZChhQuCpoK4suJ7pIiO0r8dOwdjrRjkoRcXMHv3M=h310",
        "//lh3.googleusercontent.com/F7TDQn051CuwML4SB-4650sbc4IqFcdPadxtq-gj1rPJtDcRI5aCAp-UAlfftsJAeA=h310",
        "//lh3.googleusercontent.com/ZuyT83_fzI7WxbTlkpaTIw601CWDeo3hOtYir0zd27maXEPwdPfokcg6n1u8Z718b7I=h310",
        "//lh3.googleusercontent.com/4TISX11UWJ2AwL9uqddoxrlp6Jjv1nGk18vpjEYIG2qPGmsM61SGC_9z63VbCuErvbA=h310"
    ],
    "video": "https://www.youtube.com/embed/2jtucwuXdCc",
    "comments": [
        "Worst app ever. Got blocked out of my account for no reason and they didn't even let me know. It is impossible to unblock it and every method of trying to unblock it just leads to another dead end. Nobody uses this stupid app!! Avoid at all costs, it sucks!!",
        "Hello WeChat team, I cannot login to my account since im using a new device and it need me to verify it through my friends. But I didn't know any of my friendlist on this app and it is almost 1year I uninstalled this app. Please help me I need to use this fun app again. 😭",
        "I like the idea, has a lot of interesting features. Hate the 'system maintenance' which happens whenever something screwy happens in china, or any anniversary or something happens in china. Not a big fan of being monitored by the ccp either.",
        "i want to rate this as five..but too bad i can't use the payment.  it was only in mainland china  i hope they can access it to Philippine so when i order goods from china i can pay easier..  a big hope.. keep it up WECHAT 😘😉",
        "People nearby, radar, throw bottle & shake feature didn't work. Plus, other user can't added me even i have wechat ID. They're can't find me on people nearby & by contact numbrt at all even after i try to fix the problem for twice. So disappointed with your apps",
        "i am very unsatisfied with this app. i was trying to add a friend into a group but all of a sudden i wasnt able to,the reason being that i have violated wechat regulations in on of my post. however i have posted the same post in another group and that group did not have such an issue. please address this problem as quick as possible and i will give this app 5 stars."
    ],
    "recentChanges": [
        "- In \"Settings\"-\"General\", configure what features you want to appear in your Discover screen.",
        "- After logging in to a separate account on your mobile, quickly switch your log in to another account with a single tap."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tencent.mm&hl=en&gl=us",
    "appId": "com.tencent.mm"
}