{
    "title": "ExakTime Mobile–Time Clock App",
    "summary": "ExakTime Mobile turns your phone or tablet into a powerful time tracking device",
    "icon": "//lh6.ggpht.com/jX7lfPeg76pu5fCLHu8Vun7Qg9mS-SfhaSSOKDYdcjEaEQSFo_plJwe-WST75J-oY8s=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.6,
    "reviews": 387,
    "developer": "Exaktime, Inc.",
    "developerId": "Exaktime,+Inc.",
    "developerEmail": "support@exaktime.com",
    "developerWebsite": "http://www.exaktime.com/time-clock-app/",
    "updated": "March 1, 2018",
    "version": "2.44.7.0",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Our powerful time clock app gives you the power to track and manage your workforce using your mobile device. This easy-to-use app offers accurate time tracking plus advanced management tools for monitoring your team’s location, activities, overtime and more. Our app syncs automatically with ExakTime’s online time clock software, which means instant oversight from any web-based device so you can make more informed business decisions on the go. Data is also easily shared with your accounting program, saving time and money on payroll.No cell service? No problem. Your data will be securely stored until service is resumed.Accurate Time and Labor Tracking• Clock-in for individual employees with PIN code• Track hundreds of work activities/cost codes• On-screen selections in a choice of 3 languages• GPS location stamp on every time punch• FaceFront Biometrics eliminates buddy punchingPowerful Management Tools• Clock in an entire crew at once• Add employees, crews, work locations and cost codes• Keep track of who is clocked in and where• Create text, photo and audio “field notes” for later review• Wirelessly transfer time records to the office*Please note that the purchase of additional software is required for full use of this app. To purchase a system, please contact ExakTime.",
    "descriptionHTML": "Our powerful time clock app gives you the power to track and manage your workforce using your mobile device. This easy-to-use app offers accurate time tracking plus advanced management tools for monitoring your team&#x2019;s location, activities, overtime and more. <br><br>Our app syncs automatically with ExakTime&#x2019;s online time clock software, which means instant oversight from any web-based device so you can make more informed business decisions on the go. Data is also easily shared with your accounting program, saving time and money on payroll.<br><br>No cell service? No problem. Your data will be securely stored until service is resumed.<br><br>Accurate Time and Labor Tracking<br>&#x2022; Clock-in for individual employees with PIN code<br>&#x2022; Track hundreds of work activities/cost codes<br>&#x2022; On-screen selections in a choice of 3 languages<br>&#x2022; GPS location stamp on every time punch<br>&#x2022; FaceFront Biometrics eliminates buddy punching<br><br>Powerful Management Tools<br>&#x2022; Clock in an entire crew at once<br>&#x2022; Add employees, crews, work locations and cost codes<br>&#x2022; Keep track of who is clocked in and where<br>&#x2022; Create text, photo and audio &#x201C;field notes&#x201D; for later review<br>&#x2022; Wirelessly transfer time records to the office<br><br>*Please note that the purchase of additional software is required for full use of this app. To purchase a system, please contact ExakTime.",
    "histogram": {
        "1": 100,
        "2": 18,
        "3": 30,
        "4": 44,
        "5": 195
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3.3 and up",
    "androidVersion": "2.3.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/eSAeDu351_rZ1K1XNlkNoVPTqcnAUywNcU1fwHgg3OFCxTE_TqTEhhJskTLqno7CVPc=h310",
        "//lh3.googleusercontent.com/O-PdIA1m96_FEgQboy-7IxKC2w7Y7W00WszMWnlk2c6PpOvnZLVWB3uSq8-aNsez18sC=h310",
        "//lh3.googleusercontent.com/uGM_J-wBYcrJaDSSGnbB185KeElrfnOzeB-qpa69alcdC4AjahMBRdi8M7nW5mICkQ=h310",
        "//lh3.googleusercontent.com/Mav1oAFrKcR9ikTU7HElMfhuEEvnkITgGYOqyMMeyBxE9hVAUAy1zkL6qKpzeif0cpw=h310",
        "//lh3.googleusercontent.com/5ZT2TcRU2GpXXITQTcLdxYK5erkyGRZzhGL9ZbvlLMIbOttCKJtt3FDFbowL1Kj_iRs=h310",
        "//lh3.googleusercontent.com/MKa_GwJnpiM6NJbnv5kjh4JOlelkY6qyPWZy-54qXmXResRS4Y--AB6syVfkOXQtUFC2=h310",
        "//lh3.googleusercontent.com/wMTYQKZ12ekTo2Dw-h1EHEq7clWq39XjJ7IGxUqt-TiPXSaCR4lV_KzUVm8D_Ffi2ac=h310"
    ],
    "comments": [
        "It does the basic clock in and out fine,  but there is room for improvement.  You can see your history, but it does not provide totals.  It would also be great to have a pause/break button with a reminder for lunch time.   If you need a breakdown of your hours ask your company to send it from the desktop version.  This should be available in the app, but since it is not a supervisor needs to send it.  The good thing is that it only takes 1 click to email it.",
        "Giant pain in the ass to use everyday",
        "Drains phone battery really fast",
        "It doesn't indicate on the main screen if you are currently logged in or out. There's no way to see how long you've been logged in. It has to have location activated in order to log in and out.  Just the same old crappy timecard app.",
        "Must have ability to see total hours worked. This app is great for honest employee's but if i can't see my total hours worked i will request my employer drops this and finds something else for the 50+ employee's.",
        "You can't even check your punches after the fact to see if the hours are correct. If you can't trust your employees then don't hire them."
    ],
    "recentChanges": [
        "Our February update is all about improvements to the forms that you see when clocking in and out."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.exaktime.mobile&hl=en&gl=us",
    "appId": "com.exaktime.mobile"
}