{
    "title": "Hydro Coach PRO - drink water",
    "summary": "Go Pro and unleash the power of water to raise up your fitness!",
    "icon": "//lh6.ggpht.com/dL9--GgOGLaQxycrYCgvyyxU-dn6L9_eHf73Exwm_D8_1aciSfGEFCxcMs6jRc-hmf4c=w300",
    "price": "$4.49",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.6,
    "reviews": 7459,
    "developer": "Codium App Ideas",
    "developerId": "8190631062502857716",
    "developerEmail": "office@codium.at",
    "developerWebsite": "http://www.hydrocoach.com/",
    "developerAddress": "Pater Schwartz Gasse 11a\n1150 Wien\nAustria",
    "updated": "October 28, 2016",
    "version": "3.2.4-pro",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Drinking water regularly is a big challenge in day-to-day life. Hands up – who really drinks enough water every day? Hydro Coach will help you by calculating how much water you need, tracking what you drink, and gently reminding you when to drink. It's time to unleash the power of water to improve your health. Because your health is worth it! PRO features:* Unlimited Diary. Look back to all past days in your diary.* Additional monthly statistics and unlimited weekly statistics.* More widgets (e.g. 1x1 widget for fast drink inputs).* Use hydration factors to define how well drinks are hydrating or dehydrating.* Fast and easy intake from each notification.* Export your drink history intor a CSV file.* No ads. Benefits of drinking water for your health:* It’s an effective method of combating stress and tiredness* Drinking enough water can clear up your skin* Drinking enough water can improve your health in a few days* It’s beneficial to weight loss and the basis of every professional diet* Drinking more water can relieve headaches Key features:* Improve your health with personal drink notifications* Keep perfect track of your water balance through a simply designed diary* Get a graphical insight into your water drinking habits with week and month statistics* Practical widgets provide clear information about your water intake* Create custom drink volumes easily* Supports imperial (fl. oz.) and Metric (ml) units* Share your water intake with your friends* Direct water input through your android wear* Synchronization with your google account How it works:Our formula calculates your ideal personal water requirement based on multiple factors like age, weight, gender and lifestyle. Select your favorite glass you normally use, and Hydro Coach will remind you to drink and refill it. Join a fantastic communityBlog: http://blog.hydrocoach.comFacebook: http://facebook.com/hydrocoachGoogle+: http://google.com/+HydrocoachAppInstagram: http://instagram.com/hydro_coach",
    "descriptionHTML": "Drinking water regularly is a big challenge in day-to-day life. Hands up &#x2013; who really drinks enough water every day? Hydro Coach will help you by calculating how much water you need, tracking what you drink, and gently reminding you when to drink. It&apos;s time to unleash the power of water to improve your health. Because your health is worth it!<br> <br><b>PRO features:</b><br>* Unlimited Diary. Look back to all past days in your diary.<br>* Additional monthly statistics and unlimited weekly statistics.<br>* More widgets (e.g. 1x1 widget for fast drink inputs).<br>* Use hydration factors to define how well drinks are hydrating or dehydrating.<br>* Fast and easy intake from each notification.<br>* Export your drink history intor a CSV file.<br>* No ads.<br> <br><b>Benefits of drinking water for your health:</b><br>* It&#x2019;s an effective method of combating stress and tiredness<br>* Drinking enough water can clear up your skin<br>* Drinking enough water can improve your health in a few days<br>* It&#x2019;s beneficial to weight loss and the basis of every professional diet<br>* Drinking more water can relieve headaches<br> <br><b>Key features:</b><br>* Improve your health with personal drink notifications<br>* Keep perfect track of your water balance through a simply designed diary<br>* Get a graphical insight into your water drinking habits with week and month statistics<br>* Practical widgets provide clear information about your water intake<br>* Create custom drink volumes easily<br>* Supports imperial (fl. oz.) and Metric (ml) units<br>* Share your water intake with your friends<br>* Direct water input through your android wear<br>* Synchronization with your google account<br> <br><b>How it works:</b><br>Our formula calculates your ideal personal water requirement based on multiple factors like age, weight, gender and lifestyle. Select your favorite glass you normally use, and Hydro Coach will remind you to drink and refill it.<br> <br><b>Join a fantastic community</b><br>Blog: http://blog.hydrocoach.com<br>Facebook: http://facebook.com/hydrocoach<br>Google+: http://google.com/+HydrocoachApp<br>Instagram: http://instagram.com/hydro_coach",
    "histogram": {
        "1": 65,
        "2": 67,
        "3": 278,
        "4": 1654,
        "5": 5395
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "3.1 and up",
    "androidVersion": "3.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/oB-IbqamBmWgUG-7-1YTcyx0DqTj4Spo-hvzyjpDYGuRLJ7wPQNnasQCTSYHRRTWETY=h310",
        "//lh3.googleusercontent.com/f3R5XJdycNvS7nunsVuWtEw7m0pGFmjOqwbcE-_iyCb1aA2Vai4Z7UPPlCDT0Q8U6Cw=h310",
        "//lh3.googleusercontent.com/qrQpQOtmnztOhTxwRFMeJLt_M9PLZ8hAMF_JIqac6GD6hg77WwLiWVzQ_-xebzhzARM=h310",
        "//lh3.googleusercontent.com/2WRhLrxhLWj9lxXGyGIA9qKvsuzVRhIO2dcgQE9a0J8LwmPfws8rd5W1JsgJNNWXE6I=h310",
        "//lh3.googleusercontent.com/_9Jr-JrOXcYpfyXHZ6OblSNCg0TFqrxh7T-bT5pr8qyUF3hEaaKjZswynorSavNMtw=h310",
        "//lh3.googleusercontent.com/7vYqZPHiT8sbeeBByk-yXgAr43_KETJEq-BS0_ILUJ6RD50AIuPLphfFmwnveq0kymER=h310",
        "//lh3.googleusercontent.com/4uDmHXY0pDgLrXuFkfbRFonjYE3mzCH6457sseJraO4TEI7rTBqmDTHlMQqbcDjW5aI=h310",
        "//lh3.googleusercontent.com/DhTxvfYQtYp0nNhJCYJveaw30F4Bc09_fVeV91W9geo782X4qMH3migQ9w4LFzd0oQ=h310",
        "//lh3.googleusercontent.com/AVK1LfAjltNd4naXzEHPBG8AhrJ9RTe-ObZDrfoCsHCzUPeVZzj4IYN2Fr8IV9RkvpJm=h310",
        "//lh3.googleusercontent.com/KXILsUPcjCDAHBCzjmYvSuQjqIPEIgWZH12MoOhGCPJeY3-7n6bUL4bTliF0FAD3G_Q=h310",
        "//lh3.googleusercontent.com/ASh30WxizCRHh6rMw4ZJSH0Tm2dKC_QPGWg4lkHdoDBXTV219ReRvfmN45mks8KZVKU=h310"
    ],
    "comments": [
        "Very scarce on explanations Very good and useful app for all people who need to be better with their fluids intake. Needs more explanations of some features, e.g. hydration factor of common drinks and what constitutes warm/cold/hot weather or a very active lifestyle (all of these you can use to modify your daily water goal). And why can you page your water diary into the future if you can't see anything there or at least set up future activities?",
        "Great app. Use it everyday since i bought it. Everyone should use it. Keeps my migraines down. Wish it had different styles instead of the goofy face. LOVE THAT IT WORKS WITH FITBIT!. Only thing i would like to see is a more professional style. The app logo is awsome but the little drop charecter makes me feel like a child. And i recommend it to everyone because its so IMPORTANT.",
        "I love this app. I'm excited to see how I feel after drinking the amount I'm supposed to to stay hydrated. I'm also excited to see if I lose any weight by drinking so much water. I love how you can set the amount you want to drink for each day and it goes up if the temp outside gets warmer. It also has reminders you can set and the app will remind you to keep drinking so you can reach your goal. You can also customize how many oz are in your bottle or cup. Your weight can play a factor to on how much your goal is. What your supposed to drink a day is half your weight but in ounces so I'm supposed to drink 171 oz a day. I'm really happy I found this app and I think it will help me live a healthier life!",
        "Good app, improvement possible The app works nicely but there are some shortcomings. Drinks you added via widgets while the app is open don't show up in the list unless you close and reopen the app. The weather function is not very precise. Today it is -4 and the app shows 2. Finally, I don't know when to pick 'active' or 'very active'. A bit more information would be nice. With these issues resolved this app becomes a 5 star app.",
        "My weather thing never adds extra water........ so, i think Pro was a waste of money. I would rank 4 stars if it calculated \"equivalencies\"... such as 8oz of black coffee = __oz of water, or 8oz of skim milk = __oz of water... I drink skim milk, black caf. coffee, sweet iced tea, soda.... I understand they may not want to list everything, but some basic options would be nice.",
        "I have sampled quite a few hydration/water tracking apps and this is the first one I am willing to pay for. The interface is great, the widgets are very useful, and I really like the way drinking reminders are handled (popup with options to dismiss, snooze, etc). I like that it takes into account environment, activity levels, and weight.    A few improvements could be made, however. First, I wish the environmental/activity levels were defined (what temperature range is \"hot\", how active is \"active\"?). Also, I would like there to be an option to add extra water for that day. Say you have a cold, in which case you need to drink more water. It would be nice to be able to add an extra glass or two into your requirements without having to tell the app that you are extra active that day or that it's hot outside.  Overall good app. Very helpful to me."
    ],
    "recentChanges": [
        "NEW: Use the latest weather data to adapt your daily target",
        "v3.0:",
        "* Sync weight and drinks with Fitbit",
        "* Android Wear App",
        "* Choose from over 80 different glasses",
        "* Assign a title to your drinks",
        "* Define how well drinks are hydrating or dehydrating (PRO)",
        "* Fast intakes with 1x1 widgets (PRO)",
        "* Choose a color for your notification light",
        "* Bulk delete your drinks",
        "Recently:",
        "* Google Fit support",
        "* S Health support (min. version: 4.0)",
        "* Individual target setup for hot or active days"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.codium.hydrocoach.pro&hl=en&gl=us",
    "appId": "com.codium.hydrocoach.pro"
}