{
    "title": "Your DPD",
    "summary": "Your DPD – Never miss a parcel delivery again!",
    "icon": "//lh3.googleusercontent.com/Xv-etgGyn9nkGTCVXA0Y7rl0AUBsMMpvzQOmG4G-CdjMC-ypi16j51BnSptSiU9IGrA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.4,
    "reviews": 7975,
    "developer": "DPDgroup UK",
    "developerId": "DPDgroup+UK",
    "developerEmail": "app@dpdgroup.co.uk",
    "developerWebsite": "http://www.dpd.co.uk",
    "updated": "December 3, 2017",
    "version": "1.8.9",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Your DPD – Never miss a parcel delivery again!Your DPD lets you arrange the best possible delivery experience. Just tell us how and where to deliver from the range of options available and we’ll do the rest. Personal delivery preferences - if you’re not going to be in, you can use the DPD app to make sure you can still receive your parcels.  Tell us to deliver straight to your chosen DPD Pickup location or, to your chosen neighbour or safe place.  You select your preferences and we’ll make sure we follow your instructions every time!30-minute delivery alerts - we don’t want you to wait in all day so with all your DPD deliveries, we’ll let you know in advance when to expect delivery and when we are just 30 minutes away. We’ll come back - If we’ve missed you earlier in the day and have been unable to deliver your parcel, we may even come back later that same day.  We’ll check to see if you’re at home first and then make a return journey. Active and previous deliveries - using your DPD app you can see a list of current deliveries and track when your parcels will be with you. When we’ve delivered to your chosen safe place we’ll even send you photos of your parcel in that location for added peace of mind you.Multiple addresses - set your work, home, or even family member’s address preference, so you can tailor your delivery experience and still get your deliveries, wherever you are in the UK.Driver tracking - see the name and a picture of your driver or why not track their location and find out where you are in the delivery queue. See your driver's estimated arrival time so you know when to expect your parcel.In flight options - when we’re on our way to you, if your plans change you can still rearrange your delivery right up until we deliver your parcel. You can instruct our driver to deliver on a different day, to a preferred neighbour, to a safe place or even to one of our 2,500 DPD Pickup shops.Pickup shops - if you’re collecting your parcel from a nearby DPD Pickup shop, get opening hours, your pickup pass for collection and directions from your delivery address.***Existing users Please note: Thinking of deleting our app? If you do, your profile will be retained. To make sure your profile is deleted first, please delete this from Settings in the app before removing from your device.***",
    "descriptionHTML": "Your DPD &#x2013; Never miss a parcel delivery again!<br><br>Your DPD lets you arrange the best possible delivery experience. Just tell us how and where to deliver from the range of options available and we&#x2019;ll do the rest. <br><br>Personal delivery preferences - if you&#x2019;re not going to be in, you can use the DPD app to make sure you can still receive your parcels.  Tell us to deliver straight to your chosen DPD Pickup location or, to your chosen neighbour or safe place.  You select your preferences and we&#x2019;ll make sure we follow your instructions every time!<br><br>30-minute delivery alerts - we don&#x2019;t want you to wait in all day so with all your DPD deliveries, we&#x2019;ll let you know in advance when to expect delivery and when we are just 30 minutes away. <br><br>We&#x2019;ll come back - If we&#x2019;ve missed you earlier in the day and have been unable to deliver your parcel, we may even come back later that same day.  We&#x2019;ll check to see if you&#x2019;re at home first and then make a return journey. <br><br>Active and previous deliveries - using your DPD app you can see a list of current deliveries and track when your parcels will be with you. When we&#x2019;ve delivered to your chosen safe place we&#x2019;ll even send you photos of your parcel in that location for added peace of mind you.<br><br>Multiple addresses - set your work, home, or even family member&#x2019;s address preference, so you can tailor your delivery experience and still get your deliveries, wherever you are in the UK.<br><br>Driver tracking - see the name and a picture of your driver or why not track their location and find out where you are in the delivery queue. See your driver&apos;s estimated arrival time so you know when to expect your parcel.<br><br>In flight options - when we&#x2019;re on our way to you, if your plans change you can still rearrange your delivery right up until we deliver your parcel. You can instruct our driver to deliver on a different day, to a preferred neighbour, to a safe place or even to one of our 2,500 DPD Pickup shops.<br><br>Pickup shops - if you&#x2019;re collecting your parcel from a nearby DPD Pickup shop, get opening hours, your pickup pass for collection and directions from your delivery address.<br><br>***Existing users Please note: Thinking of deleting our app? If you do, your profile will be retained. To make sure your profile is deleted first, please delete this from Settings in the app before removing from your device.***",
    "histogram": {
        "1": 817,
        "2": 180,
        "3": 181,
        "4": 435,
        "5": 6362
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/nk0L4Q7NxGZZI1PqEWjQD_SnUhh_3Ow_VZUzVVKMkolVyflmTdiD74dzy70ZrZUHsw=h310",
        "//lh3.googleusercontent.com/Fmup-BByuQcJrnQZvPA9b7rDPhJruN2EiykzVo6OY9RYlWqfYhC5K_H5DF1ljbhws9Q=h310",
        "//lh3.googleusercontent.com/THOCRichwt_4aRqrLE_ipMQobQinHmqL_UMYobw-CN0zXgYKEp0uCIZ8mWeBOVUZ8osJ=h310",
        "//lh3.googleusercontent.com/qW78tA6H2a3Ee4JJ0o-LdInAtzmOJgguPPTINHQxEw4PnTUpK1g9eOm4o-1cwjJcYZM=h310",
        "//lh3.googleusercontent.com/8KBgQhf3FhPSx6q50BnbmZZZ6kpZjMsBs9GUAPqi6zqrsa4d8FQQvzgMrhUoMfRH-qw=h310",
        "//lh3.googleusercontent.com/6bisaaFjEyNeSeGgf_sM0jSWHEEFP4LsNgMG8j5zQ1NWToO6cD2svXf7s2CydcCqaLI=h310",
        "//lh3.googleusercontent.com/k4bsZ0OjhCAYhgUdjM42yvqQE52ffPdcmoHnoq_ufdL-nVc60OKc-92Xae5-Nl5WGqo=h310",
        "//lh3.googleusercontent.com/9dShD_JYgwJGY2TFs0ceAuvMKYOFZmeVq4_iouKnO22Zr4naSsmg0vE6c7PAIdJbpJ4=h310",
        "//lh3.googleusercontent.com/Lu1VCpsAzJnntfzoX-yeT_xia2TQyDf73hYmQ_Ez0W8geyLAdbQsjI3uJSEuArL50Lg=h310"
    ],
    "comments": [
        "Didn't get past the \"we need your mobile number and ANY email addresses'. Their web site does not need this to track so why the app?.  Could not get past this screen to track one delivery. I personaly use multiple email addresses and phone numbers, but wanted to use the app to track a delicery going to my 90+ year old parents as the driver has been too quick for them when delivering earlier.",
        "Does exactly what you would expect...    It's an app designed to allow you to track your DPD deliveries.  It does this very well with realtime updates, a tracking map once your parcel is out for delivery, an option to add trusted neighbours in case you are out etc...  You can also contact the driver directly to fine tune your delivery.  To those asking why it would ask for multiple emails...  This is so as it can track all your future parcels from whatever store you've signed up to with whichever email.    Otherwise it can only track orders placed with the one email account you provide it.",
        "Brilliant app, tells you exactly when your parcel is being delivered & who by.  Easy to change delivery options (change day, deliver to shop, safe place or neighbour).  Organised page with all your orders.  Only down side is live chat is automated sometimes so doesn't provide much help.",
        "Ok. Sometimes it shows me when my deliveries are coming. Sometimes it doesn't. Despite all my parcels coming from Amazon with the same details. Even with a tracking number, it is not possible to add details for a parcel which is not automatically displayed.  My other big gripe is the way that they spell their app name. Not under d for DPD. Not under p for parcels. Not under d for delivery. Not even under m for the frustrating \"my DPD\" cliché. No, they choose to file the app under y for \"your\" DPD. I'm sure there is an executive out there with only one app on their phone who thinks that this is a good and clever idea.",
        "DPD as a company are absolutely fantastic. The DPD app however is worse than poor. I frequently get an error message 'your connection is slower  than usual' In spite of uninstalling and reinstalling the application multiple times it still constantly fails to perform. Avoid this application it is awful.",
        "Decent as long as you have the sender put your phone number on the delivery address as that's the only way it works. Shame it can't pick up my delivery based on my name or even email. Also another suggestion is to have the ability to input it manually as herms has this ability when expecting a delivery from them."
    ],
    "recentChanges": [
        "Bug fix."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.dpd.yourdpd&hl=en&gl=us",
    "appId": "com.dpd.yourdpd"
}