{
    "title": "Smith's",
    "summary": "Save with Smith&#39;s! Coupons, ads, rewards &amp; shopping list in one app!",
    "icon": "//lh5.ggpht.com/jn-32HHnF9qOtYQkqgEVZKzKQCUBSHEZtXvGCNVIke4dbsc1HavXEevwVBLNDfxwRw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 2288,
    "developer": "The Kroger Co.",
    "developerId": "The+Kroger+Co.",
    "developerEmail": "android.support@kroger.com",
    "developerWebsite": "http://www.smithsfoodanddrug.com",
    "updated": "February 22, 2018",
    "version": "13.5.2",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "Looking for a faster, easier, more rewarding shopping experience? Save time and money with the Smith’s app! It puts convenience, savings and rewards at your fingertips. Simply download the app, create an account and register your Smith’s Shopper’s Card to access all these great benefits:- Shop ClickList® curbside pickup or delivery right from the app!- Easily build your online shopping list, and use it to shop in-store or to place your ClickList® order.- View your Weekly Ads and quickly add sale items or specials to your shopping list.- Load digital coupons directly to your Shopper’s Card and use them to save on items from your shopping list.- Get even more savings when you choose items from our Smart Suggest feature.- Refill your Smith’s Pharmacy prescriptions directly from your phone or tablet. Just type in your prescription number, select your Pharmacy and schedule a convenient pickup time.- Check your fuel points.- Use our locator to find the closest Smith’s store or fuel center.- View your purchase history. Use it to create standard orders that will save you time.- Save BIG with exclusive promotions, personalized offers and bonus rewards.To use the Smith’s app, you'll need a Smith’s digital account. You can register for your account and link your Shopper’s Card through the app. If you don't have a Shopper’s Card, you can create one when you register to access all of these savings and rewards!",
    "descriptionHTML": "Looking for a faster, easier, more rewarding shopping experience? Save time and money with the Smith&#x2019;s app! It puts convenience, savings and rewards at your fingertips. Simply download the app, create an account and register your Smith&#x2019;s Shopper&#x2019;s Card to access all these great benefits:<br><br>- Shop ClickList&#xAE; curbside pickup or delivery right from the app!<br><br>- Easily build your online shopping list, and use it to shop in-store or to place your ClickList&#xAE; order.<br><br>- View your Weekly Ads and quickly add sale items or specials to your shopping list.<br><br>- Load digital coupons directly to your Shopper&#x2019;s Card and use them to save on items from your shopping list.<br><br>- Get even more savings when you choose items from our Smart Suggest feature.<br><br>- Refill your Smith&#x2019;s Pharmacy prescriptions directly from your phone or tablet. Just type in your prescription number, select your Pharmacy and schedule a convenient pickup time.<br><br>- Check your fuel points.<br><br>- Use our locator to find the closest Smith&#x2019;s store or fuel center.<br><br>- View your purchase history. Use it to create standard orders that will save you time.<br><br>- Save BIG with exclusive promotions, personalized offers and bonus rewards.<br><br>To use the Smith&#x2019;s app, you&apos;ll need a Smith&#x2019;s digital account. You can register for your account and link your Shopper&#x2019;s Card through the app. If you don&apos;t have a Shopper&#x2019;s Card, you can create one when you register to access all of these savings and rewards!",
    "histogram": {
        "1": 150,
        "2": 96,
        "3": 212,
        "4": 484,
        "5": 1346
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/aCFYvxLU-r35ZsU0mcUF5T6X3dyQQR7WRlJ9j03kmd7ZmDdaeFviHeiWfcRgs1ZJ_Kw=h310",
        "//lh3.googleusercontent.com/HO_-DtDbFCfDSnLRSyoLkOprFAn0dUS_w8oZ3LtIUTWlDkw0TkMZGJ4qj4L_BpLBQv0=h310",
        "//lh3.googleusercontent.com/QvI1gr9fqr1CW---5dckLykQrezGGFsH_TYVrtzOwT6QLAIFNOT2mVKV22tQivk1_w=h310",
        "//lh3.googleusercontent.com/Gn6Y1TtHD3kvZGr9Pr4r8Rfge_x42mnxvsMcIMBNxAJ-cTinsNA5mDVi1294BChLjmI=h310",
        "//lh3.googleusercontent.com/X0wZ3bz6bs5lvtDHicUBpts5hx2STdTez8PiUbI6Rz1Bf971b72Ufk0_WC5yeKgUvh0=h310",
        "//lh3.googleusercontent.com/t9IDrjFmYLZ7OPiXwk27mm1RrXfSHbLtn-elb_HgbtZ115cHmsAh63ojMWSaK0GNqgg=h310",
        "//lh3.googleusercontent.com/ajubSDLAk3cz53KV30WI0Z33ZQuPVIuzfxYNpg0KWlMwf3tzGi3Ytt-atv9-nAMlNm4E=h310",
        "//lh3.googleusercontent.com/-7SoShgE6-pVj6YMHqkuEUiNxvl35IGRqSG3Km2vxvZdTYUmqxfvN4RwpskVI1iLwcA=h310",
        "//lh3.googleusercontent.com/53gXpzqIBQh5Iy18M-TIDvAJ_yBocT9qaiYK4FjX5vOsjp-9cmqoTst6xykJk9oohAU=h310",
        "//lh3.googleusercontent.com/TmTZxg3JWGoTdVwdWBVAwDlXJDqxFUfF1WuXKWVCFI8VCPpHajaWkEZUH25W2PhRCH40=h310",
        "//lh3.googleusercontent.com/6LvIcT1C0iMI4GLMA3wfraKUWl6K2vxdSpSsw0hIUfk-w-sDin9_ORe5Xd2r21s3M9Y=h310",
        "//lh3.googleusercontent.com/Htt12RXuP0VopyLquadIVvmYdji8Sh66mzmG92x4TMu7nxxRtNwgCdbAC-BksYPjChDP=h310"
    ],
    "comments": [
        "Waste of time. App won't scan most of the time. Can't enter bakery owns. It won't accept loyalty cards. This is a complete waste of time, total garbage, a massive fail.",
        "Hasn't worked properly in months. There's always a 'technical difficulty ' when trying to download coupons. I had uninstalled and reinstalled to attempt to fix the preoblem...didn't help.",
        "App sucks. Website sucks.",
        "Great now that it has changed to the app",
        "(Update) - app is still very glitchy-this morning I couldn't check out from the app but it wasn't telling me why, I logged on to the computer and it told me it couldn't calculate the pick up fee, it took 3 tries. You should also be allowed to make changes to your order within the first hour of it being placed. I wanted to remove some items I didn't need about 15 minutes after placing my order and was told it was too late, this is inconvenient since it was 7a.m. and I'm not picking my order up until 7 tonight.    &gt;&gt;&gt;So very slow, it doesn't matter if I use data or wifi. Please fix it. I have to do the click list on the computer because the app is so painfully slow. Unresponsive all morning. I give up. Every time I try to search for an item it takes so long to load, and then I receive an \"unresponsive script\" *notice. Nothing else on my phone is having this problem, this is my first time using the app for grocery(pick up) service and I can't even complete the list.",
        "Constant bugs. Almost always has problems when trying to load coupons. Struggles to load images every time I swipe the screen. Click list charges you and it doesn't deliver. Worthless app."
    ],
    "recentChanges": [
        "Great news! 13.5 of the app is now available for download. We’ve added new features and enhancements to make your mobile experience even better!",
        "• View your pending ClickList® orders",
        "• Cancel your pending ClickList® orders",
        "• Receive push notifications for your ClickList® orders",
        "• Improved search functionality",
        "• Nutritional info added to products",
        "• Product descriptions",
        "• Print your Cart or Shopping Lists directly from the app",
        "Plus some minor bug fixes and other great enhancements!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.smithsfoodanddrug.mobile&hl=en&gl=us",
    "appId": "com.smithsfoodanddrug.mobile"
}