{
    "title": "Bankinter Móvil",
    "summary": "New Mobile Banking Bankinter",
    "icon": "//lh3.googleusercontent.com/ZmVe85gFubRvflGcqPY6SToOuuNbL-b_TW1lgPeW6jV0h6FbnPaoKgeVeC28z9YdA18=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.6,
    "reviews": 5160,
    "developer": "Bankinter",
    "developerId": "Bankinter",
    "developerEmail": "appmovil@bankinter.com",
    "developerWebsite": "https://www.bankinter.com/bancamovil",
    "updated": "January 29, 2018",
    "version": "6.0.7",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Bienvenido a la Banca Móvil Bankinter. Nuevo diseño más fácil e intuitivo. Como novedad, a partir de ahora podrás conectarte fácilmente utilizando tu huella digital en tu dispositivo Android, sin necesidad de usuarios ni claves. Descárgala de forma gratuita y realiza todas las gestiones de tu banco 24h al día. Además, podrás disfrutar de Bizum para enviar o solicitar dinero de forma inmediata a tus familiares o amigos.Estas son algunas funcionalidades que disfrutarás con nuestra App:NAVEGACIÓN INTUITIVANuevo botón central para tus operaciones más frecuentes como el traspaso de dinero de móvil a móvil con Bizum y transferencias. Nueva barra de navegación para acceder a las principales secciones de forma directa: posición global, avisos, personal y productos que contratar.Consulta y opera con tus cuentas y tarjetas de manera ágil y sencilla. SALDOS Y MOVIMIENTOSConsulta los saldos y movimientos de todas tus cuentas y tarjetas.TRANSFERENCIASPodrás realizar transferencias nacionales e internacionales, así como planificar aquellas que sean periódicas.  Además, podrás consultar tu histórico de movimientos, repetir aquellos que desees de forma más y guardar tu justificante. Aprovéchate y disfruta de las transferencias a cajeros mediante Hal Cash. BIZUMEnvía o solicita dinero a quienes desees de forma inmediata, tan solo tienes que asociar tu número de teléfono móvil a tu cuenta corriente en la App. Podrás realizar hasta 10 transferencias gratuitas al mes. TARJETASFinancia tus compras con tu tarjeta de crédito. Activa y bloquea tu tarjeta o modifica la forma de pago. Si lo necesitas, recupera tu PIN en cualquier momento.CONTRATACIÓN DE PRODUCTOSCon la App también podrás contratar todo tipo de productos como cuentas y tarjetas, depósitos, fondos de inversión y jubilación, así como diversos seguros de salud y hogar. También podrás realizar simulaciones de préstamos, depósitos e hipotecas y planificar cómo quedarían tus cuotas de forma muy visual.OPERATIVATraspaso de fondos y planes de pensiones desde otra entidad.Amortización anticipada de préstamos.Consulta y baja de domiciliaciones.Devolución de recibos.Además, también podrás realizar otras gestiones desde la App del banco.Activar y recibir notificaciones gratuitas de avisos por cargos con tu tarjeta, descubiertos en cuenta, cargos de recibos, movimientos, saldos de cuentas y vencimientos de depósitos.Solicitar moneda extranjera y acceder a tu gestor personal.Descarga la App Bankinter y realiza todas tus operaciones sin moverte de casa.Si tienes alguna sugerencia o alguna incidencia dentro de la App, escríbenos a  Appmovil@bankinter.comMás información de los servicios de Bankinter en www.bankinter.es",
    "descriptionHTML": "Bienvenido a la Banca M&#xF3;vil Bankinter. <br><br>Nuevo dise&#xF1;o m&#xE1;s f&#xE1;cil e intuitivo. <br><br>Como novedad, a partir de ahora podr&#xE1;s conectarte f&#xE1;cilmente utilizando tu huella digital en tu dispositivo Android, sin necesidad de usuarios ni claves. Desc&#xE1;rgala de forma gratuita y realiza todas las gestiones de tu banco 24h al d&#xED;a. Adem&#xE1;s, podr&#xE1;s disfrutar de Bizum para enviar o solicitar dinero de forma inmediata a tus familiares o amigos.<br><br>Estas son algunas funcionalidades que disfrutar&#xE1;s con nuestra App:<br><br>NAVEGACI&#xD3;N INTUITIVA<br>Nuevo bot&#xF3;n central para tus operaciones m&#xE1;s frecuentes como el traspaso de dinero de m&#xF3;vil a m&#xF3;vil con Bizum y transferencias. <br>Nueva barra de navegaci&#xF3;n para acceder a las principales secciones de forma directa: posici&#xF3;n global, avisos, personal y productos que contratar.<br>Consulta y opera con tus cuentas y tarjetas de manera &#xE1;gil y sencilla. <br><br>SALDOS Y MOVIMIENTOS<br>Consulta los saldos y movimientos de todas tus cuentas y tarjetas.<br><br>TRANSFERENCIAS<br>Podr&#xE1;s realizar transferencias nacionales e internacionales, as&#xED; como planificar aquellas que sean peri&#xF3;dicas.  Adem&#xE1;s, podr&#xE1;s consultar tu hist&#xF3;rico de movimientos, repetir aquellos que desees de forma m&#xE1;s y guardar tu justificante. Aprov&#xE9;chate y disfruta de las transferencias a cajeros mediante Hal Cash. <br><br>BIZUM<br>Env&#xED;a o solicita dinero a quienes desees de forma inmediata, tan solo tienes que asociar tu n&#xFA;mero de tel&#xE9;fono m&#xF3;vil a tu cuenta corriente en la App. Podr&#xE1;s realizar hasta 10 transferencias gratuitas al mes. <br><br>TARJETAS<br>Financia tus compras con tu tarjeta de cr&#xE9;dito. Activa y bloquea tu tarjeta o modifica la forma de pago. Si lo necesitas, recupera tu PIN en cualquier momento.<br><br>CONTRATACI&#xD3;N DE PRODUCTOS<br>Con la App tambi&#xE9;n podr&#xE1;s contratar todo tipo de productos como cuentas y tarjetas, dep&#xF3;sitos, fondos de inversi&#xF3;n y jubilaci&#xF3;n, as&#xED; como diversos seguros de salud y hogar. Tambi&#xE9;n podr&#xE1;s realizar simulaciones de pr&#xE9;stamos, dep&#xF3;sitos e hipotecas y planificar c&#xF3;mo quedar&#xED;an tus cuotas de forma muy visual.<br><br>OPERATIVA<br>Traspaso de fondos y planes de pensiones desde otra entidad.<br>Amortizaci&#xF3;n anticipada de pr&#xE9;stamos.<br>Consulta y baja de domiciliaciones.<br>Devoluci&#xF3;n de recibos.<br>Adem&#xE1;s, tambi&#xE9;n podr&#xE1;s realizar otras gestiones desde la App del banco.<br>Activar y recibir notificaciones gratuitas de avisos por cargos con tu tarjeta, descubiertos en cuenta, cargos de recibos, movimientos, saldos de cuentas y vencimientos de dep&#xF3;sitos.<br>Solicitar moneda extranjera y acceder a tu gestor personal.<br><br>Descarga la App Bankinter y realiza todas tus operaciones sin moverte de casa.<br><br>Si tienes alguna sugerencia o alguna incidencia dentro de la App, escr&#xED;benos a  Appmovil@bankinter.com<br>M&#xE1;s informaci&#xF3;n de los servicios de Bankinter en www.bankinter.es",
    "histogram": {
        "1": 867,
        "2": 391,
        "3": 549,
        "4": 1371,
        "5": 1982
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/1mMQ5IbKxxFHTL_MTTXl4SEnpLChjLnJz-W220yRBVpjTE7waeSp-XejvSipbeuytNc=h310",
        "//lh3.googleusercontent.com/J0GbEfjS5aCWQg61Bpq3pNc92Vla3XktJTMvyRKw83qvWsm3zZ4hj6Ru-YTvcXDjGrI=h310",
        "//lh3.googleusercontent.com/-r0GVFxhCP_UTyFDFDASrKne1DvQI9oQDNINmiEysx-OmcKIBFl1u-p7yRbHZAxmeHFA=h310",
        "//lh3.googleusercontent.com/z-D-Y7Kym_rAyOFcivf2KClPXOL0q5u8bzI16vnck2jK-Fh1Z87dWVCkdyhkfQpxpIMg=h310",
        "//lh3.googleusercontent.com/xW03oDSKLV6h54ci7u8pUfVYY5JmoirGUer85qxjFC2Z2byzMvmZF4L5nD1ak07BUC8=h310",
        "//lh3.googleusercontent.com/Hkrb29Upr76zokFmWEPFcr74qXZXrcKDrn-ebEu_6tzZMdCNRNPwouII1e2yIwVoD14=h310",
        "//lh3.googleusercontent.com/q1a16M-6XHe4MsN5shB7bTgSezen52kazoKrcFtIYkHbozMkcs3iYss_vc0R3tEfhDo=h310",
        "//lh3.googleusercontent.com/4bcEX8orGJjqrht7QTZuOW8J3xzLOrdUlk20Tb0sRcOLCht1XkltKFMskp4GVQxaQzQ=h310",
        "//lh3.googleusercontent.com/kO7eAb1tpiwiaOeILJjjcGpfmlSy5ZyahbRfLF46m5hbb9KAJBwq5kjRTQ94mWbBK2cf=h310",
        "//lh3.googleusercontent.com/7pA7joD9ZWeNkbCxkdY5usqz_zXuq-ttgoh1hRV5bUvkAVnc0r3eIVw-x9pyNSderjKK=h310",
        "//lh3.googleusercontent.com/IFM71H0TfIXaCXAA_Wji17hbpLlqnwOYH0i32No71mHIRuTt6PEHPCZ9jUiFc3F-BsyN=h310"
    ],
    "video": "https://www.youtube.com/embed/aftONeep0Ek",
    "comments": [
        "Va de mal en peor. Es una aplicación que sólo se puede utilizar en casa, sólo sirve para ver números. Es muy incómoda y pide las coordenadas para todo, incluso para activar de nuevo la tarjeta? Qué tal si la he encontrado en mi bolso después de desactivarla, pues sigo sin poder pagar.",
        "Ha mejorado mucho en los últimos meses. Funciona bien y muestra la información de forma clara.",
        "I can not find or get English version!!  So can only find out what money i have got in our account!!",
        "Muy completa y sencilla de utilizar",
        "Genial para controlar la cuenta.",
        "Does the work, You see what you need."
    ],
    "recentChanges": [
        "- Mejoras en rendimiento y solución de bugs"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bankinter.launcher&hl=en&gl=us",
    "appId": "com.bankinter.launcher"
}