{
    "title": "Pinterest",
    "summary": "The one app for everything you&#39;re interested in",
    "icon": "//lh3.googleusercontent.com/SrULGsyndXJk6Gs4Lmv34sOlMDAroy1bzPPr9X1U5oVdv5TAAJX4JkYPO_wQAdP7TBA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.6,
    "reviews": 3891597,
    "developer": "Pinterest",
    "developerId": "Pinterest",
    "developerEmail": "help@pinterest.com",
    "developerWebsite": "https://support.pinterest.com/home",
    "updated": "February 27, 2018",
    "version": "Varies with device",
    "genre": "Social",
    "genreId": "SOCIAL",
    "size": "Varies with device",
    "description": "Pinterest is full of possibilities to design your life. Discover recipes, style inspiration, projects for your home and other ideas to try.Just some of the things you can do with Pinterest:• Find everyday ideas you love—what to make for dinner, what to put on your walls, what to wear and more ideas for every part of your life.• Save ideas for later—organize ideas by topic, so they’re always easy to find.• Search by keyword or with your camera—discover ideas inspired by anything you point the Pinterest camera at.• Collaborate with friends—save ideas together for your next group trip, party or project. • Save ideas you find around the web—just use the Pinterest’s Save button on your mobile browser.",
    "descriptionHTML": "Pinterest is full of possibilities to design your life. Discover recipes, style inspiration, projects for your home and other ideas to try.<br><br>Just some of the things you can do with Pinterest:<br><br>&#x2022; Find everyday ideas you love&#x2014;what to make for dinner, what to put on your walls, what to wear and more ideas for every part of your life.<br><br>&#x2022; Save ideas for later&#x2014;organize ideas by topic, so they&#x2019;re always easy to find.<br><br>&#x2022; Search by keyword or with your camera&#x2014;discover ideas inspired by anything you point the Pinterest camera at.<br><br>&#x2022; Collaborate with friends&#x2014;save ideas together for your next group trip, party or project. <br><br>&#x2022; Save ideas you find around the web&#x2014;just use the Pinterest&#x2019;s Save button on your mobile browser.",
    "histogram": {
        "1": 101473,
        "2": 54467,
        "3": 154031,
        "4": 640880,
        "5": 2940746
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/N-1CdosyI6aAU-6tbxgvoDnt_AqncwrsC5yVT7jGRgFC8YITu5MYJoNYrSb7pRrwV0c=h310",
        "//lh3.googleusercontent.com/v1lcEzNfn36lMuVJLzCJeX5CEbzNmM8zfAAdZGdjCPThtuo18gat-pJPhC3e1NE6hg=h310",
        "//lh3.googleusercontent.com/tSh0GeYOVxZb4Q5wTYp4WaaG3Zie9laCIXuf_Wwxa9qYUMq7SRReHk2K_YTxiKzE7rw=h310",
        "//lh3.googleusercontent.com/0zz4cnY_LnYUVzmzWk7tTyL3ShLazq73oApTzV0kZJlCMs_HTPShJFnRz0z0czdwYM41=h310",
        "//lh3.googleusercontent.com/fL7SxhAQ2yeW6YOGiqZ381GMYhpNDBRs5UDVGQ8pYeRik1idwp4pK3ASTFzIvIfXvds=h310",
        "//lh3.googleusercontent.com/WqoB2O5Eg5ru4Bwik9-xPusvq5hm8-JVxAR8FOEUowB2QgPWv6TaBrDqHaOHmu3-GQE=h310",
        "//lh3.googleusercontent.com/KhAoa2hKVq5PGEd7kV9Qdc6N1AxIM-axJglA2M5y-L62uLeqMBi3WNCodIdngNrICew=h310"
    ],
    "comments": [
        "I have a Pinterest addiction for real!! Lol I go on Pinterest probably 3-4 times a day either looking for new hair and makeup ideas, or looking for new products to go buy! I can always find what I'm looking for and I'm so happy that something like Pinterest exists because every other app that is similar isn't anywhere near as good as this app!!!!! If I could give it a million stars I would!!! ❤️💙💚💛💜",
        "Short review huh? It would be impossible for me to sum up every thing I LUV about Pinterest in a short review!!! Ask anyone that uses Pinterest and you're bound to get one word...ADDICTIVE!!! I'm on my 5th phone and Pinterest is always one of the first 2 apps that I reinstall,it's that awesome! When doing a Google search you get a specific result or a zillion results but they are all about what you searched. With Pinterest,you may search shoes and before you know it,you end up on abandoned mansions..because of this,I've gained so much knowledge.",
        "I rate Pinterest a actual 0 because when you go through the trouble of cleaning certain items out of boards. They still send people messages when item have been removed. And when you attempt to address the issue. Their help center definitely not helping the matter. And appearently Pinterest doesn't get rid of all of the copyright stamped photos that account holders post.",
        "The new update for the app is absolutely terrible. Particularly when I get messages/shared pins that are nowhere to be found in my inbox, then I have to start a new message to a particular person just so that it opens their message window and I can see what they've sent. My friends are experiencing the same issues when I send them something. Well done for ruining it guys.",
        "Freezes from trying to load. I don't like not knowing the number of pins on a board anymore. Crashes and kicks me out. And this is all since I updated 20mins ago. The last update was fine. I had no issue with that but now u ruined.it. please go back one update. And please take the ads and the picked for u out. I choose my boards for a reason I don't need extra suggestions. Thanks.                        Today is 10/20/16 I'm tired of pinterest kicking me off so I officially installed the app.  Thanks today is 3/3/18 they went back to the old way were I can see how many pins are in the board. N I love it. Now if u can minimize the suggestions and adds. I will be so happy thanks.",
        "Pinterest honey what is with the new update. Commenting on anything is really frustrating and impossible now. Please fix commenting and stop updating random things like the icon of the explore page. Thank you I love the app but please stop."
    ],
    "recentChanges": [
        "Every week we polish up the Pinterest app to make it faster and better than ever. Tell us if you like this newest version at http://help.pinterest.com/contact"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pinterest&hl=en&gl=us",
    "appId": "com.pinterest"
}