{
    "title": "StayLit Wear: Longer Backlight",
    "summary": "Adjust the display light timeout of your watch",
    "icon": "//lh3.ggpht.com/n_l_HMSRV-ckXUtE1uxSl18iXWxvKSywyUFD7UE7kojlHyPbGPVxH9FMe5gC7hwNI7eY=w300",
    "price": "$1.48",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.6,
    "reviews": 674,
    "developer": "PhonePhreak Software",
    "developerId": "PhonePhreak+Software",
    "developerEmail": "support@phonephreaksoftware.com",
    "developerWebsite": "http://phonephreaksoftware.com",
    "developerAddress": "PhonePhreak Software e.K.\nNeckarstraße 10\n12053 Berlin\nDeutschland",
    "updated": "February 14, 2018",
    "version": "Varies with device",
    "genre": "Tools",
    "genreId": "TOOLS",
    "size": "Varies with device",
    "description": "Do you find your smartwatch's built-in backlight timeout period actually quite short? Wouldn’t it be nice if you could adjust the backlight timeout to have the screen stay on a little longer? (So that not only you, but also your friends can marvel at that new watchface you just installed...)StayLit Wear lets you adjust the time that the light stays on after the watch has been waked. You can select a value for how much time will elapse from the moment that the watch has been waked from dim mode (i.e. by having tapped the screen, moved the watch, or pressed the button) to it being allowed to revert to dim mode again. Choose from a range of values of up to 5 minutes, or until you switch the screen off again.NEW: “indefinitely+” mode: the light stays on until you switch it off, but is also switched off when you lower your arm or turn the watch away from you. That way, the light will be on exactly when you need it. (Note that also in this mode, StayLit respects the individual light timeout of apps like Google Fit, Maps, or Runtastic.)USAGE: In order to adjust the backlight timeout, open the StayLit Wear app on your watch. This will bring up the Longer Backlight settings. Select a setting in the list by tapping on it. Deactivate StayLit Wear by selecting \"off“ in this list.PLEASE NOTE: If you are using the Odyssey watchface, you need to set its \"Ambient Mode\" to \"Off\" for StayLit to work properly.INSTALLATION TROUBLESHOOTING:Wear 2.0: If you are not finding the StayLit Wear app on your watch after installation, please open the Play Store on the watch, do a search for \"StayLit Wear\", and install it directly from there.Wear 1.x: After having been installed on the phone, StayLit should show up in the phone's app drawer. On the watch, the app should show up in the app menu (accessible through long pressing the watch's power button) after approx. 30 seconds after installation. If it still isn't showing on the watch after several minutes, try the \"resync apps\" option in the Android Wear app on the phone (Settings > Device settings > Resync apps). Also, make sure that you have the latest version of the Android Wear app installed on your phone. If you are having problems installing or running the app, please contact me - I will be happy to help!NOTE: Setting a significantly longer screen timeout will reduce battery life. We recommend setting a value of 10 - 30 seconds...",
    "descriptionHTML": "Do you find your smartwatch&apos;s built-in backlight timeout period actually quite short? Wouldn&#x2019;t it be nice if you could adjust the backlight timeout to have the screen stay on a little longer? (So that not only you, but also your friends can marvel at that new watchface you just installed...)<br><br>StayLit Wear lets you adjust the time that the light stays on after the watch has been waked. You can select a value for how much time will elapse from the moment that the watch has been waked from dim mode (i.e. by having tapped the screen, moved the watch, or pressed the button) to it being allowed to revert to dim mode again. Choose from a range of values of up to 5 minutes, or until you switch the screen off again.<br>NEW: &#x201C;indefinitely+&#x201D; mode: the light stays on until you switch it off, but is also switched off when you lower your arm or turn the watch away from you. That way, the light will be on exactly when you need it. (Note that also in this mode, StayLit respects the individual light timeout of apps like Google Fit, Maps, or Runtastic.)<br><br>USAGE: In order to adjust the backlight timeout, open the StayLit Wear app on your watch. This will bring up the Longer Backlight settings. Select a setting in the list by tapping on it. Deactivate StayLit Wear by selecting &quot;off&#x201C; in this list.<br><br>PLEASE NOTE: If you are using the Odyssey watchface, you need to set its &quot;Ambient Mode&quot; to &quot;Off&quot; for StayLit to work properly.<br><br>INSTALLATION TROUBLESHOOTING:<br>Wear 2.0: If you are not finding the StayLit Wear app on your watch after installation, please open the Play Store on the watch, do a search for &quot;StayLit Wear&quot;, and install it directly from there.<br>Wear 1.x: After having been installed on the phone, StayLit should show up in the phone&apos;s app drawer. On the watch, the app should show up in the app menu (accessible through long pressing the watch&apos;s power button) after approx. 30 seconds after installation. If it still isn&apos;t showing on the watch after several minutes, try the &quot;resync apps&quot; option in the Android Wear app on the phone (Settings &gt; Device settings &gt; Resync apps). Also, make sure that you have the latest version of the Android Wear app installed on your phone. If you are having problems installing or running the app, please contact me - I will be happy to help!<br><br>NOTE: Setting a significantly longer screen timeout will reduce battery life. We recommend setting a value of 10 - 30 seconds...",
    "histogram": {
        "1": 27,
        "2": 15,
        "3": 27,
        "4": 88,
        "5": 517
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/KEvZwjYiMjj4lYkCnj3oi0I27nnfzjGuNtYLGe0LDvca2LvdUZ3GBIFgJRx18_OoEKM=h310",
        "//lh3.googleusercontent.com/XP_6BiKpP4gxD-j6fQQooZ2hl1WO-czxPqyBK0HQFu9PavjqnwcXOBa_T73xgHk2JT0G=h310",
        "//lh3.googleusercontent.com/E4W_k8Da2K0_CuYBRVJ413rojgY3WEaR09uzToFmrzAybLCZnjh5OVYV2NxlqDMc688=h310"
    ],
    "comments": [
        "Some watch faces have so many things to look at that by the time my eyes focused, picked out what I needed, 5 seconds had passed and goodby display. This app saved the experience of having a smart watch. Nice job.",
        "This is the one app I couldn't do without. No more lights out after 5 seconds!",
        "Sometimes it works right.. Sometimes it dims too fast... Sometimes my watch just randomly lights up (didn't do that before this app)  For an app I spent money on, it sure would have been nice to have it work.  Maybe I'm doing something wrong?",
        "I recently purchased a Fossil Q Explorist. I loved everything about the watch except that the beautifully designed watchface would so quickly disappear. Then I did a Google search and found this app. It's everything and more that I wanted! I absolutely love the Indefinite and Indefinite+ options. I haven't thoroughly tested the watch for battery life with the app (it will obviously not be too great if always on), but it will serve exactly what I need. Well worth the money. Thank you for this brilliant app!",
        "moto 360 2gen installed at the phone, but did not show up on the watch even after 1 hour and two restart both of the devices.",
        "Brilliant must have App for all Android Wear watches. Works exactly as it should."
    ],
    "recentChanges": [
        "Minor bugfixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.phonephreak.extendedlight&hl=en&gl=us",
    "appId": "com.phonephreak.extendedlight"
}