{
    "title": "Counter",
    "summary": "Counter allows you to count everything, inventories, books read or calories.",
    "icon": "//lh3.googleusercontent.com/Sqtp38Uz9nFFiu3BXh4FHEojY0dN63vLomacaWOKpRLnRID-RyfwaYMoLLNMGSTQjoA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 3588,
    "developer": "Keep It Simple",
    "developerId": "Keep+It+Simple",
    "developerEmail": "andregpslourenco@gmail.com",
    "developerWebsite": "http://counter.keep-it-simple.pt/",
    "developerAddress": "Urbanização Quinta de S. Luís, Lote 54, 2º Esq, lugar de Pereira\n3140-348 Pereira - Portugal",
    "updated": "March 14, 2017",
    "version": "2.1.1",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Counter is a simple tally counter app that you can use to count everything. Count your diet portions eaten, count inventory items, count drinks sold, count calories ingested, etc.! Counter is available for free! Counter is available for Android Wear! Keep track of your counts using your favourite counting app, now on your watch! Counter is a multi counter that allows you to keep track of all the important events of your life. Never forget again how many ping pong matches you have won. Counter is the only Counter that supports decimal numbers!! ★ Counter features:  ✓ Create multiple tally counters  ✓ Customize the color of each counter   ✓ Set goals that you want to reach   ✓ Group items by category   ✓ Check your statistics for each counter   ✓ Export your counters statistics using a Excel file https://www.youtube.com/watch?v=Z11BL-2xsC4   ✓ Export statistics for a specific counter https://www.youtube.com/watch?v=g-5nF3B05e8   ✓ Configure count increment value, even to decimals!   ✓ Support for negative values, like how many time you end the night sober :D   ✓ Use our awesome widget   ✓ Keep track of thing on your Android Wear!   ✓ Generate funny random counters! ★ Use tally counter to:   • Quit bad habits, like smoke or procrastination   • Count won ping pong matches   • Count drinks sold and cars that passed by you   • Count the number of nights you went to the restaurant   • Keep track of the score on card and board games.   • Keep track of your diet ★ A very special thanks to the translators:   • Patrick Studniarz, German  • Leonel Gomes, French   • Leave us an email if you want to help translate Counter to your language ;) If you have any suggestions please do not hesitate to email us at andregpslourenco@gmail.comWe appreciate your feedback, please rate us! With love, KISS",
    "descriptionHTML": "Counter is a simple tally counter app that you can use to count everything. <br><br>Count your diet portions eaten, count inventory items, count drinks sold, count calories ingested, etc.! <br><br>Counter is available for free! Counter is available for Android Wear! Keep track of your counts using your favourite counting app, now on your watch! Counter is a multi counter that allows you to keep track of all the important events of your life. <br>Never forget again how many ping pong matches you have won. Counter is the only Counter that supports decimal numbers!! <br><br>&#x2605; Counter features:<br>  &#x2713; Create multiple tally counters<br>  &#x2713; Customize the color of each counter <br>  &#x2713; Set goals that you want to reach <br>  &#x2713; Group items by category <br>  &#x2713; Check your statistics for each counter <br>  &#x2713; Export your counters statistics using a Excel file https://www.youtube.com/watch?v=Z11BL-2xsC4 <br>  &#x2713; Export statistics for a specific counter https://www.youtube.com/watch?v=g-5nF3B05e8 <br>  &#x2713; Configure count increment value, even to decimals! <br>  &#x2713; Support for negative values, like how many time you end the night sober :D <br>  &#x2713; Use our awesome widget <br>  &#x2713; Keep track of thing on your Android Wear! <br>  &#x2713; Generate funny random counters! <br><br>&#x2605; Use tally counter to: <br>  &#x2022; Quit bad habits, like smoke or procrastination <br>  &#x2022; Count won ping pong matches <br>  &#x2022; Count drinks sold and cars that passed by you <br>  &#x2022; Count the number of nights you went to the restaurant <br>  &#x2022; Keep track of the score on card and board games. <br>  &#x2022; Keep track of your diet <br><br>&#x2605; A very special thanks to the translators: <br>  &#x2022; Patrick Studniarz, German<br>  &#x2022; Leonel Gomes, French <br>  &#x2022; Leave us an email if you want to help translate Counter to your language ;) <br><br>If you have any suggestions please do not hesitate to email us at andregpslourenco@gmail.com<br>We appreciate your feedback, please rate us! <br>With love, KISS",
    "histogram": {
        "1": 130,
        "2": 74,
        "3": 239,
        "4": 971,
        "5": 2174
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/jpurpHk_3y_if7wp1KdcoADHkUTP4LO6q0J29UhaX0Hk7h73HDGBNVeskkDQ1PoKjdHM=h310",
        "//lh3.googleusercontent.com/UOlr0JYPI4wa5Rp2mmNkRTsIKX7hbK4LDTnOpJ0ixGqBHaqEB7WaWyhtEfj0Wxfze6c=h310",
        "//lh3.googleusercontent.com/uIT6fhNkn7DRZKTjYdfgHMCTg6SLNFOZPyR18SXiTwyWxg7cwttc0sjunCG9S0Tmmg=h310",
        "//lh3.googleusercontent.com/-CZxDtwS8HLlLhfJ1GkDsFV1H9acMrForLZ88z1qdjE8M63wDK_00whSddjsnczV2NDv=h310",
        "//lh3.googleusercontent.com/DK4LRR6uD1RDi46QWgxrXIT9reb_4EIrfjXfeQFwH58IKwlzQTNrv6b-uS5iIq22iqA=h310",
        "//lh3.googleusercontent.com/PJLtdNdmOsncyikm2mocW0BZTP3-mt8qMxk1ZAuMBp_cmMw7Apms6TNFXP70TFVHY-Q=h310",
        "//lh3.googleusercontent.com/iNxQKSZpd1rjxPB6x1xOsvhEnvyvz71i4OgGEHGO3kXUnOhUenbNefgEGz1Ov_BHFlY=h310",
        "//lh3.googleusercontent.com/0xuTWAENJQpxN2sd0035FUoJPMcdN0Ivt0_BUCPMiWghZXVBka5-vALXPUNmWTB-zFo6=h310",
        "//lh3.googleusercontent.com/hvCyxtKv8ZM2FClIUlMuWryXYt1y7CrK3OJEXsKSUnYJ1RU4SfCGDtlJc1aB5-P5azI=h310"
    ],
    "video": "https://www.youtube.com/embed/mFwM7kH22ew",
    "comments": [
        "Good. Only counter which not only counts but also logs when was counted. Use it to keep track of hay and straw bales used in our stables. End of the month I can see when and how many were used. 4 stars because there is no automatic backup function. And I would like a default month summary view. Again, this is the only counter which does more than count. I tried loads. Good work",
        "Paywall makes custom lists impossible, so unless you want to count the default 4 things this isn't very useful",
        "If you're using this app professionally, it's the way to go. Quick exports with .csv, only wished I could export with excel. Great app though.",
        "Works great! Just wish I could retroactively add data...",
        "Easy to use, but no calendar.",
        "Hi, I love this app. LOVE IT LOVE IT LOVE IT."
    ],
    "recentChanges": [
        "Fixed issue importing backup files from different language devices",
        "Link .count files to the app"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.kiss.countit&hl=en&gl=us",
    "appId": "com.kiss.countit"
}