{
    "title": "Field Trip",
    "summary": "Field Trip is your guide to the cool, hidden, and unique things around you.",
    "icon": "//lh5.ggpht.com/tRV11yolXdw8M16zX5Nm3hSDEgQMWF0h5tNWi3xEdu2r6Abfq8QParLlDS5AFhqzmw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.7,
    "reviews": 13732,
    "developer": "Niantic, Inc.",
    "developerId": "Niantic,+Inc.",
    "developerEmail": "fieldtrip-support@nianticlabs.com",
    "developerWebsite": "http://www.fieldtripper.com",
    "developerAddress": "One Ferry Building, Suite 200\nSan Francisco, CA 94111",
    "updated": "May 13, 2015",
    "version": "2.0.9",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "\"Oh, the Places Your Phone Will Find\" - Wall Street Journal\"Field Trip can help guide the way...\" - AllThingsD\"The future of Augmented Reality\" - The AtlanticField Trip is your guide to the cool, hidden, and unique things in the world around you. Field Trip runs in the background on your phone. When you get close to something interesting, it pops up a card with details about the location. No click is required. If you have a headset or bluetooth connected, it can even read the info to you.Field Trip can help you learn about everything from local history to the latest and best places to shop, eat, and have fun. You select the local feeds you like and the information pops up on your phone automatically, as you walk next to those places.The hyperlocal history experts of Arcadia and Historvius will unveil local lore in places you never expected. Trend-setting publications like TimeOut, Thrillist, Spotted by Locals, Zagat, and Eater will point out the best places to eat and drink. Experts at Sunset, Cool Hunting, WeHeart, Inhabitat, and Remodelista will guide you to the latest unique stores and products. Atlas Obscura, Dezeen and Spotted by Locals help you uncover hidden gems no matter where you are. Songkick and Flavorpill guide you to local music.What did you discover today? Enrich yourself with a Field trip during your commute. Live like a local when you travel to new places. Eat and shop off the beaten path. Or simply discover the obscure history about your neighborhood during your next walk to the park.Get ready to see this world with new eyes!NOTE: This app is optimized for smartphones, not tablets.Highlights:★ Discover thousands of interesting places/experiences that fall under the following categories: Architecture, Historic Places & Events, Lifestyle, Offers & Deals, Food Drinks & Fun, Movie Locations, Outdoor Art and Obscure Places of Interest around you.★ Choose from three different modes to set frequency of Field Trip notifications. See “Field Trip” worthy places around you on a map, by tapping on cards in map view to pull up enthralling points of interest around you.★ Go on a Field Trip while you drive. Field Trip can detect when you’re driving and automatically “talk” about interesting places and experience around you. ★ Came across an amazing story or restaurant?  Mark it as a favorite to easily come back to it at any point.★ Capture the memory of a special place, by sharing a wondrous discovery through email and social networks such as Google+, Twitter and Facebook.★ Wondering where the gem that you recently discovered is? Find your discovered field trip cards in the “recent’ section.For more information about how to use Field Trip, visit our help center at https://fieldtrip.zendesk.comFollow us on:http://www.facebook.com/FieldTripApphttp://www.google.com/+FieldTripApphttp://www.twitter.com/FieldTripApp",
    "descriptionHTML": "&quot;Oh, the Places Your Phone Will Find&quot; - Wall Street Journal<br>&quot;Field Trip can help guide the way...&quot; - AllThingsD<br>&quot;The future of Augmented Reality&quot; - The Atlantic<br><br>Field Trip is your guide to the cool, hidden, and unique things in the world around you. Field Trip runs in the background on your phone. When you get close to something interesting, it pops up a card with details about the location. No click is required. If you have a headset or bluetooth connected, it can even read the info to you.<br><br>Field Trip can help you learn about everything from local history to the latest and best places to shop, eat, and have fun. You select the local feeds you like and the information pops up on your phone automatically, as you walk next to those places.<br><br>The hyperlocal history experts of Arcadia and Historvius will unveil local lore in places you never expected. Trend-setting publications like TimeOut, Thrillist, Spotted by Locals, Zagat, and Eater will point out the best places to eat and drink. Experts at Sunset, Cool Hunting, WeHeart, Inhabitat, and Remodelista will guide you to the latest unique stores and products. Atlas Obscura, Dezeen and Spotted by Locals help you uncover hidden gems no matter where you are. Songkick and Flavorpill guide you to local music.<br><br>What did you discover today? Enrich yourself with a Field trip during your commute. Live like a local when you travel to new places. Eat and shop off the beaten path. Or simply discover the obscure history about your neighborhood during your next walk to the park.<br><br>Get ready to see this world with new eyes!<br><br>NOTE: This app is optimized for smartphones, not tablets.<br><br>Highlights:<br><br>&#x2605; Discover thousands of interesting places/experiences that fall under the following categories: Architecture, Historic Places &amp; Events, Lifestyle, Offers &amp; Deals, Food Drinks &amp; Fun, Movie Locations, Outdoor Art and Obscure Places of Interest around you.<br><br>&#x2605; Choose from three different modes to set frequency of Field Trip notifications. See &#x201C;Field Trip&#x201D; worthy places around you on a map, by tapping on cards in map view to pull up enthralling points of interest around you.<br><br>&#x2605; Go on a Field Trip while you drive. Field Trip can detect when you&#x2019;re driving and automatically &#x201C;talk&#x201D; about interesting places and experience around you. <br><br>&#x2605; Came across an amazing story or restaurant?  Mark it as a favorite to easily come back to it at any point.<br><br>&#x2605; Capture the memory of a special place, by sharing a wondrous discovery through email and social networks such as Google+, Twitter and Facebook.<br><br>&#x2605; Wondering where the gem that you recently discovered is? Find your discovered field trip cards in the &#x201C;recent&#x2019; section.<br><br>For more information about how to use Field Trip, visit our help center at https://fieldtrip.zendesk.com<br><br>Follow us on:<br>http://www.facebook.com/FieldTripApp<br>http://www.google.com/+FieldTripApp<br>http://www.twitter.com/FieldTripApp",
    "histogram": {
        "1": 1755,
        "2": 1035,
        "3": 1988,
        "4": 3239,
        "5": 5715
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/lC9pxwO9ihBbGzhr6DJqFq5oRq0FV6ShvobMtBuobK6XdUIi4NNYPquyRN62Rareeq0=h310",
        "//lh5.ggpht.com/rViJGcsFr3dPPivaw9vDjG2NtaxXppLLIYrm6Tp4zOcioanJkEsAx6AiQT1qgsr0147a=h310",
        "//lh6.ggpht.com/1qkGDx70Dujq73yPIZfp460DHVaR_6o1mpzWCY_HNYPRj1CfI2ZczCTTUkN_5hWSfFce=h310",
        "//lh3.ggpht.com/-hP-d1w70N4dlt6LmWz6tzB1nmFL5LiRWtPlxO9y136kZvnkcTUxLwQiFqUb9KGQYAOm=h310",
        "//lh5.ggpht.com/jbxczq5APaniFjCOwdp0RDKmJEKJ8G32ec20gtil9XEflcONAeiFmxLxbYoFVa0Q3wk=h310",
        "//lh3.ggpht.com/wnyYucMHkJL8LbzMaBg0dQSeo4fH0wpUCKRLTj3KnKcSaw5E1xDjVbVMTzVx7AWZ7nk=h310",
        "//lh5.ggpht.com/G5ey9GnUhHUYPn1yzrFsTUtD7P674bXAls5TUYb8h4yIr6merCZR-GEMODsgrlC0Sg=h310",
        "//lh3.googleusercontent.com/GDXJ30Gz9ULipRt-oF8LhckF6fNXFxkV_fcjozHUUFzCo_kTfm9dhYXvfjwYFty69Q=h310"
    ],
    "video": "https://www.youtube.com/embed/zusjUjaiWJQ",
    "comments": [
        "Not enough in my area I am going to be moving to Hervey Bay soon, and I checked the area I am moving to,  however there is apparently only one thing to do in the area, and that is whale watching.  Surely there must be more than just that, as the area is a major tourist destination which I agree is famous for whale watching,  however it is also the gateway to Fraser Island and the southernmost point of the Great Barrier Reef Marine Park, which is renowned across the world as a major tourist attraction.",
        "Loved it with one fatal flaw I really really love this app and I had it on my old phone perfect ten. But after installing on my new phone it is worthless. I understand the need to make money but I don't want notifications saying business are near by. I know i can select another category but I want all the categories except shopping. Make them tic boxes instead of all or nothing choices and this app is an eleven out of ten. Thanks for all your hard work nitanic labs. I love all that you do.",
        "Okay App is a great idea, but doesn't seem to actually do much. Despite there being dozens of interesting food places in my town, the closest one it shows is almost 50 miles away. There are dozens of interesting historical places and sites with neat architecture in my city, none of which are listed. Not sure if this is something that's being worked on, but for right now I don't see a point in using this app.",
        "Must Have Location Turned On This didn't show anything but museums if I used the manually entered location. Once I turned on location finder on my phone, it started working. It seems to be missing a few restaurants and drinking establishments or places for fun in Plano and the Dallas Metroplex. But, I think the app is just passing what it gets from the Internet from Google and other places it uses. This would be useful as a general locator of these places for a new visitor to the area. I will start using it and update my review.",
        "I love to learn history, but I live in a big city and was a little overwhelmed with so much information.  It would help if it could stop the repeats.  Also, I think it's important to add the ability to zoom in on those very small photos and increase the size of the font a little.  I really enjoyed the app.  It's a wonderful learning tool.  Unfortunately, I just don't have the time.",
        "So fun! What a great idea! I am learning any tons of new things about my city. I don't live in my hometown (or state) so this gives me the interesting back story I was missing and makes it feel like home. One thing I am not sure how to prevent is tips I've already read being suggested."
    ],
    "recentChanges": [
        "V2.0.8",
        "* Explore the world with your Android Wear watch!",
        "* Receive and view Field Trip notifications directly on your watch.",
        "* Start Field Trip searches for nearby cards directly on your watch.",
        "* Minor bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.nianticproject.scout&hl=en&gl=us",
    "appId": "com.nianticproject.scout"
}