{
    "title": "Messenger – Text and Video Chat for Free",
    "summary": "Reach anyone 1:1 or in groups by text message, video chat, or voice call",
    "icon": "//lh5.ggpht.com/0VYAvZLR9YhosF-thqm8xl8EWsCfrEY_uk2og2f59K8IOx5TfPsXjFVwxaHVnUbuEjc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000000,
    "maxInstalls": 5000000000,
    "score": 4,
    "reviews": 52833404,
    "developer": "Facebook",
    "developerId": "Facebook",
    "developerEmail": "android-support@fb.com",
    "developerWebsite": "http://www.facebook.com/apps/application.php?id=256002347743983",
    "developerAddress": "1 Hacker Way\nMenlo Park, CA 94025",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Instantly connect with the people in your life. Messenger is free, fast, and secure. - Reach anyone. You can use names or phone numbers to find friends. - Use everywhere. Messenger works across all mobile and desktop devices. You can even connect with people internationally!   - Connect however you want. Send a text message, share a photo, or start a video chat — all in Messenger. - Communicate better with groups. Catch up in real time with high quality group video chat or customize your messaging experience with colors, nicknames, and group photos. - Call and video chat your friends 1:1 or in groups. It's free over Wi-Fi (otherwise standard data charges apply), so talk as long as you want, even with people in other countries. - Express yourself. Send emojis, stickers, and GIFs to conversations or add new masks and effects to your video chats. - Capture photos and videos with fun art and effects. You can save these to camera roll, send to conversations, or post to your Day, a place where people can see what you're up to.  - Play games and compete with your friends. You can compare scores and see how you rank against other people. - Chat with businesses. You can make reservations, check on orders, and get real-time customer service.",
    "descriptionHTML": "Instantly connect with the people in your life. Messenger is free, fast, and secure. <br><br>- Reach anyone. You can use names or phone numbers to find friends. <br>- Use everywhere. Messenger works across all mobile and desktop devices. You can even connect with people internationally!   <br>- Connect however you want. Send a text message, share a photo, or start a video chat &#x2014; all in Messenger. <br>- Communicate better with groups. Catch up in real time with high quality group video chat or customize your messaging experience with colors, nicknames, and group photos. <br>- Call and video chat your friends 1:1 or in groups. It&apos;s free over Wi-Fi (otherwise standard data charges apply), so talk as long as you want, even with people in other countries. <br>- Express yourself. Send emojis, stickers, and GIFs to conversations or add new masks and effects to your video chats. <br>- Capture photos and videos with fun art and effects. You can save these to camera roll, send to conversations, or post to your Day, a place where people can see what you&apos;re up to.  <br>- Play games and compete with your friends. You can compare scores and see how you rank against other people. <br>- Chat with businesses. You can make reservations, check on orders, and get real-time customer service.",
    "histogram": {
        "1": 6923493,
        "2": 2205012,
        "3": 5028563,
        "4": 7780102,
        "5": 30896234
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Akz7U1QW4I1KKNiig-uum5an_P4JBnKyVPXda5LozfcZUgnG3g2amnLn2Oili42b0wM=h310",
        "//lh3.googleusercontent.com/mD90pAw4RL6tv5gFmarSsUuPtTqO2WEBagbFGXEw-5qdBzA-giCd5f_wwjQvNF2V0g=h310",
        "//lh3.googleusercontent.com/ThIwGgGqT-cMX_8nICixYSwN8NRruUr0io4HsUQkOqwjRSw0rcSJdapE-WAomPjaJ34=h310",
        "//lh3.googleusercontent.com/idgO2Vxw3e107SRc3YM5CE2p0a7B1vaKNnCHx6IIqrTUa_08fXp2Tu8OdHOQmG_KVjB_=h310",
        "//lh3.googleusercontent.com/L0MHXxoPUJqLY3ANVTATSv26EKDiyN_ZlXLaHWtIo5zKgIySJ7u34BIpEfK9emVpXQ=h310"
    ],
    "comments": [
        "You really need to calm down with the updates. Even if I'm a beta tester, 50 megabytes of update data daily is a lot. I know you want to improve your app but right now the best way for you to do that is to reduce data usage. Otherwise your consumers will go to other platforms that uses less data.",
        "It is great to keep in contact with friends and family",
        "I like Messenger but there is only 2 problems: during video calling, I can't make my camera bigger whenever I like, it's way too small to see! It's not like Whatsapp video calling where you can make your camera bigger to see your own face big if you want. Also, please add better & realistic filters with better color quality like on instagram. 😆 Please fix this feature & make it like Whatsapp! Thanks!",
        "I highly appreciate it because of i can send free messages esp in times of emergency! Keep it up! My concern is that there are times that it deletes the messages by itself! Please my messages are very important to me. And how can i back up the messages? Thanks and God bless! :)  Pls. Some of my messages from my contacts have been deleted by its own. I already changed my password and put some app locks still the messages are being deleted by its own.",
        "Good application, but the latest updates have taken the option to sign out away. The application constantly wants to take over the default SMS . Not sure how workable all the options are on a Australia network. As most applications are created and tested in other countries. Sadly we find that the local network can not accommodate these new options or updates due to network types.",
        "I run FB on my chrome browser and I was forced to download this app just so i could see the messages people had sent me. I do not use the facebook app because I do not agree with Mark zuckerberg and his downright authoritarian censorship. I was banned for 30 says for stating a opinion, a mild one at that, and there is absolutely no way to appeal. I do not recommend this app at all. Find alternatives if you can, such as discord or Skype."
    ],
    "recentChanges": [
        "Now you can see your call history and missed calls—all in one place."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.facebook.orca&hl=en&gl=us",
    "appId": "com.facebook.orca"
}