{
    "title": "Singapore Airlines",
    "summary": "The all-new SingaporeAir app—seamless travel made easy.",
    "icon": "//lh3.googleusercontent.com/K8g3ib0WNxIJHQSwbcEboeNBcx-LCjuD106NsNHq3BpAY9UnpP3neTpgjShUSQfPHs9o=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.4,
    "reviews": 13275,
    "developer": "Singapore Airlines Limited",
    "developerId": "Singapore+Airlines+Limited",
    "developerEmail": "sq_mobile@singaporeair.com.sg",
    "developerWebsite": "http://www.singaporeair.com",
    "updated": "February 28, 2018",
    "version": "21.5.0",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "The SingaporeAir app offers you greater travel convenience from booking to boarding and beyond. From the user experience to the personalised features, everything has been designed to be fast, intuitive and delightful to use. More features will be progressively added in future updates of the SingaporeAir app, but here are some of the key functions you can enjoy now:1. EXPLORE, BE INSPIRED AND GET THE LATEST DEALS ON THE GOGet inspired to travel with our new city guides to the destinations we fly to. Browse fare deals to your favourite destinations, and share them with friends and family. Planning your next getaway has never been easier. 2. SEARCH, BOOK AND MANAGE YOUR FLIGHTSWith a faster and more full-featured interface, it’s much easier to book your next adventure or view details on your upcoming and past trips. You can now also use your miles, AliPay, or PayPal to reserve your flight, preferred seats, insurance and much more. After a few taps and swipes, you’ll be ready to sit back and relax. 3. SKIP THE CHECK-IN QUEUESBreeze through the airport by checking in on your mobile for yourself and anyone else on the same booking. And to make it even simpler, you can download your mobile boarding pass to your device and view it anytime.4. MANAGE YOUR KRISFLYER ACCOUNTKeep your important information close to you. Just log in once, and you’ll be able to track your KrisFlyer miles balance, transactions and PPS Value easily. PPS Club members can also connect to customer service representatives via PPS Connect*.5. EXPERIENCE THE FUTURE OF FLYINGFind out what's playing on our award-winning KrisWorld inflight entertainment system, and create your personal play list on your phone or tablet. Lean back and launch your favourite movies, directly from your own phone/tablet, or view your flight’s path and progress.***This service is currently only applicable to registered PPS Club members with valid Singapore mobile numbers. **This feature is available on A350 and selected Boeing 777-300ER aircraft.Please also note that by downloading the SingaporeAir app, you agree to the terms and conditions, including the privacy policy, which can be found at http://www.singaporeair.com/en_UK/terms-conditions/ and http://www.singaporeair.com/en_UK/privacy-policy/",
    "descriptionHTML": "The SingaporeAir app offers you greater travel convenience from booking to boarding and beyond. <br><br>From the user experience to the personalised features, everything has been designed to be fast, intuitive and delightful to use. <br><br>More features will be progressively added in future updates of the SingaporeAir app, but here are some of the key functions you can enjoy now:<br><br>1. EXPLORE, BE INSPIRED AND GET THE LATEST DEALS ON THE GO<br>Get inspired to travel with our new city guides to the destinations we fly to. Browse fare deals to your favourite destinations, and share them with friends and family. Planning your next getaway has never been easier. <br><br>2. SEARCH, BOOK AND MANAGE YOUR FLIGHTS<br>With a faster and more full-featured interface, it&#x2019;s much easier to book your next adventure or view details on your upcoming and past trips. You can now also use your miles, AliPay, or PayPal to reserve your flight, preferred seats, insurance and much more. After a few taps and swipes, you&#x2019;ll be ready to sit back and relax. <br><br>3. SKIP THE CHECK-IN QUEUES<br>Breeze through the airport by checking in on your mobile for yourself and anyone else on the same booking. And to make it even simpler, you can download your mobile boarding pass to your device and view it anytime.<br><br>4. MANAGE YOUR KRISFLYER ACCOUNT<br>Keep your important information close to you. Just log in once, and you&#x2019;ll be able to track your KrisFlyer miles balance, transactions and PPS Value easily. PPS Club members can also connect to customer service representatives via PPS Connect*.<br><br>5. EXPERIENCE THE FUTURE OF FLYING<br>Find out what&apos;s playing on our award-winning KrisWorld inflight entertainment system, and create your personal play list on your phone or tablet. Lean back and launch your favourite movies, directly from your own phone/tablet, or view your flight&#x2019;s path and progress.**<br><br>*This service is currently only applicable to registered PPS Club members with valid Singapore mobile numbers. <br><br>**This feature is available on A350 and selected Boeing 777-300ER aircraft.<br><br>Please also note that by downloading the SingaporeAir app, you agree to the terms and conditions, including the privacy policy, which can be found at http://www.singaporeair.com/en_UK/terms-conditions/ and http://www.singaporeair.com/en_UK/privacy-policy/",
    "histogram": {
        "1": 634,
        "2": 295,
        "3": 567,
        "4": 3029,
        "5": 8750
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/CFJOczlGDHmQRGxjzkUK8MwQo7YPJQ780-fYhf9rfm9LSiXvQoJA7gVT0uXFHb_g5xIo=h310",
        "//lh3.googleusercontent.com/2lQYDtVfYQCnLUWWf7MHDi46WBXBX3uXq3h962NSJZ0epA90gnVyQDtHsmbQzbNIIhpm=h310",
        "//lh3.googleusercontent.com/eERHAYvZo3xjU9k3JHPfabd-04NxOC5U5Bufyg5eOg59vXuPk1VzLjqQ-7uaNkKTTQ=h310",
        "//lh3.googleusercontent.com/jlkP41tVmPnnMv7BkYmNYTs2SgGtt6CqynvB1W4_NsEskFk7tI7H-eizFi7A3fo6nAc=h310",
        "//lh3.googleusercontent.com/8rz5WwvQerTnGgSfKNLfZ4rjnzg1aB7NLgeuh4nGGoZhBI0tj54_bJqxLAo5kfZ-6Q=h310",
        "//lh3.googleusercontent.com/6eLpqShwlPqFQIYu0r4AG93gXi0k70QmsVp5Ql9jL9PGqD-9NDbMqnZ2cbTU4mLhlOk=h310",
        "//lh3.googleusercontent.com/heZ3tDmkUrLS7XHQkdR0w2M76gCr32k0DcL144BL_xdZ6pWON3LO-sJXWvll3d8vLHA=h310",
        "//lh3.googleusercontent.com/ia9J8i0YJsJJXAZTURMMhFQ4-i-AA32elwOLHjYU5uryjUDkSYxEKC_ot1JdCrwM12ao=h310",
        "//lh3.googleusercontent.com/2zOZ33Q1-NMPRzYGVohc3btm_5CMoHu_cuUDQC_bkq8lUjBGWCHI1YEO3RujI-RA6g0=h310",
        "//lh3.googleusercontent.com/V82t9ANXIAQGxNBleKJCQ6YLmrDwomtREGWbNn4E9JUtMqyNZOR39mmapFnWWIbyP0Y=h310",
        "//lh3.googleusercontent.com/Q7CuP7Sa22kcNe4GMHz1AsOaG0qkrM6iGFT1O4_AC86UZWMAJX144lBcJ7yn2uUA5_Y=h310",
        "//lh3.googleusercontent.com/uu54qWWyLxO9pDrT86t8mY7qrm4iVSGBHVlPSFSiZGajwLiy_3OjbnmU-UC8Gb5SQc8=h310",
        "//lh3.googleusercontent.com/QolP5pXcplgo90fElSqW6VkvoEQmUN7g2FHjIuRyCSwH7_OBrhT6lVkYxxzaPOKe2M0=h310",
        "//lh3.googleusercontent.com/WqXblqBOU9GFMELGG-EwRqJau8OiLlMF6emOEAeTpOp7Dlfeo67GkNA8-pYapE0Y2w=h310",
        "//lh3.googleusercontent.com/bucBE2jGeW-cpTcfuxy8IO-2_3GhovX8zaYhEGuOQY9tzmmTagC95hPW3VzNdNMEUl0=h310"
    ],
    "video": "https://www.youtube.com/embed/vonBZ6TU1kM",
    "comments": [
        "Getting poorer as keep unable to use the app to login my krisflyer account",
        "This app is so lag when linked to the seat! Almost unusable!",
        "After updated the apps not working",
        "Very useful and easy to use",
        "Easy to use. Excellent app",
        "Excellent"
    ],
    "recentChanges": [
        "The SingaporeAir Mobile App now offers:",
        "- Krisflyer – You can now edit your KrisFlyer profile and save to update it with your latest personal details",
        "- Follow a Flight – Receive push notifications to get the latest updates on your family or friends’ flight. Simply search for the flight in Flight Status, and use the toggle to follow the flight.",
        "- Android Pay – American Express cards are now accepted for Android Pay payments",
        "Others:",
        "- Miscellaneous bug fixes, updates and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.amadeus.merci.client.ui&hl=en&gl=us",
    "appId": "com.amadeus.merci.client.ui"
}