{
    "title": "Smoking Log",
    "summary": "Quit smoking with Smoking Log. Set goals and track your smoking habits easily.",
    "icon": "//lh3.googleusercontent.com/8KwWsaq4Wzf0hNyiTjlIXOCVd3a_4YqGRByjQpQ-Z1sduLZcQrNTux7YEZQRNUFoRA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.3,
    "reviews": 740,
    "developer": "Cory Charlton",
    "developerId": "8651193632568356628",
    "developerEmail": "smokinglog@ccswe.com",
    "developerWebsite": "http://www.ccswe.com",
    "developerAddress": "PO BOX 643\nSan Marcos, CA 92079-0643",
    "updated": "January 8, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Quit smoking with Smoking Log by gradually reducing the number of cigarettes you smoke daily. Set goals and track your smoking habits easily. View history to track your smoking habits and progress over time.★★ Features ★★Summary View:★ Displays a list of all recorded cigarettes★ Warns you if you try to smoke before you have met your goal★ Provides a summary for the day that tracks the number of cigarettes, time from last smoke, average time between cigarettesHistory View:★ Allows easy comparisons of statistics between days★ Provides an average of your smoking habits★ Drill down into the summary view for previous daysChart View:★ Visualize your progress across timeMiscellaneous:★ [Plus] A widget to display today's summary★ [Plus] Tasker / Locale plugins★ Easily configure/see your goals and how well you are meeting them★ Export your data to share with others ★ Insert cigarettes that you missed recording when you smoked them (ie: because you were driving)★ Optional notification icon that displays last smoke status to quickly determine if you should wait to smoke or not★ Frequent updates as neededFeatures marked with a [Plus] are only enabled if you have purchased Smoking Log Plus License. There are (and will continue to be) features that are only available if you have purchased a license.We are looking for help translating Smoking Log into more languages. Contact us at smokinglog@ccswe.com if you would be willing to helpWe want to have the best application we can so please rate us. If you have any suggestions for improvements or encounter any issues send us feedback in the application or by emailing smokinglog@ccswe.comIf you find this application useful or it helps you quit smoking (or you just hate the ads) please consider purchasing Smoking Log Plus License to provide extra functionality and remove ads, https://play.google.com/store/apps/details?id=com.ccswe.SmokingLogPlus",
    "descriptionHTML": "Quit smoking with <b>Smoking Log</b> by gradually reducing the number of cigarettes you smoke daily. Set goals and track your smoking habits easily. View history to track your smoking habits and progress over time.<br><br><b>&#x2605;&#x2605; Features &#x2605;&#x2605;</b><br><br><b>Summary View:</b><br><br>&#x2605; Displays a list of all recorded cigarettes<br>&#x2605; Warns you if you try to smoke before you have met your goal<br>&#x2605; Provides a summary for the day that tracks the number of cigarettes, time from last smoke, average time between cigarettes<br><br><b>History View:</b><br><br>&#x2605; Allows easy comparisons of statistics between days<br>&#x2605; Provides an average of your smoking habits<br>&#x2605; Drill down into the summary view for previous days<br><br><b>Chart View:</b><br><br>&#x2605; Visualize your progress across time<br><br><b>Miscellaneous:</b><br><br>&#x2605; <b>[Plus]</b> A widget to display today&apos;s summary<br>&#x2605; <b>[Plus]</b> Tasker / Locale plugins<br>&#x2605; Easily configure/see your goals and how well you are meeting them<br>&#x2605; Export your data to share with others <br>&#x2605; Insert cigarettes that you missed recording when you smoked them (ie: because you were driving)<br>&#x2605; Optional notification icon that displays last smoke status to quickly determine if you should wait to smoke or not<br>&#x2605; Frequent updates as needed<br><br>Features marked with a <b>[Plus]</b> are only enabled if you have purchased <b>Smoking Log Plus License</b>. There are (and will continue to be) features that are only available if you have purchased a license.<br><br>We are looking for help translating <b>Smoking Log</b> into more languages. Contact us at smokinglog@ccswe.com if you would be willing to help<br><br>We want to have the best application we can so please rate us. If you have any suggestions for improvements or encounter any issues send us feedback in the application or by emailing smokinglog@ccswe.com<br><br>If you find this application useful or it helps you quit smoking (or you just hate the ads) please consider purchasing <b>Smoking Log Plus License</b> to provide extra functionality and remove ads, https://play.google.com/store/apps/details?id=com.ccswe.SmokingLogPlus",
    "histogram": {
        "1": 37,
        "2": 21,
        "3": 57,
        "4": 187,
        "5": 438
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Xrr6sF0VLD8dZT9lP-BPdLf0M-8_lJmhw7kYJZ44PztTGvg_2QMR6QszezEEMrfDpg=h310",
        "//lh3.googleusercontent.com/-w7Vjmn72nOwnQ0oVKx32pFClzyJC_3X7BVD_eBnJ-9BRJjcJo0gw2Duxf5CreCw7Q=h310",
        "//lh3.googleusercontent.com/w9bPEqIPGQa5c92fkYPyKQD4tA6xcsdNdqbZU_76g9cNLjkgOWxzWLSxBK0MCxsAdsY=h310",
        "//lh3.googleusercontent.com/hoRQj8jGmsKVMGwByjEMc6HydbP5MqFcqjwI_v824HscIVtPfWB8VxBxJ8-eHVbYKI8=h310",
        "//lh3.googleusercontent.com/GnBeR_CnIKpkQBGKVoskFxIHmC0ZiUXIowYrm9paYhxEQFyAU902dBALGMBRnHmLmsk=h310",
        "//lh3.googleusercontent.com/aNSiB6QiLIxfljyPfdvxT_yn41EuMz2gTZJGXkLa_iAg7VKIPfJWIhej-Zrrbp8hwrLl=h310",
        "//lh3.googleusercontent.com/AVfljzFT7sDNZcj0Hw98b4NeEo3u1SsJb-521U4Y-YEpJH9vMRz_haTGPoPhkpIXq0c=h310",
        "//lh3.googleusercontent.com/NdQvb36E5oSuI0ntvNfWV6wKRe9gqXf6Twr18uWD5m5etoS2cBIZMkhEtYTIF808jAy9=h310",
        "//lh3.googleusercontent.com/iMD8ywJUBhOt73w-MD-64vX1X_1NTkUNqxJ2MEklp1GDw018pZiTxOv8lxpnlAZR5Mg=h310",
        "//lh3.googleusercontent.com/zZulex3G7P6UJ3DkB_I22KdOJLGlOkA-66RWYvwhFkkFSKq7DQ7dJPPEZ-F01FYjqzc=h310",
        "//lh3.googleusercontent.com/Gz5HuqGMebZm-awuw6sXJ7ZHgNXXpaZxJlh6aE65j-qI4wf6eG2l_j24aLgrQ473fDc=h310"
    ],
    "comments": [
        "love this app really easy to use and makes you more conscious of how many u are smoking a day. only a few things would make this an even better app and they are 1) being able to rate what kind of day i was having as a whole and being able to add a note for the whole day not just for each cigarette. ie having a stressful day at work. 2) the graph showing time between cigarettes and amount had not that clear to understand. other than these things i think it is a great app. would definitely recommend",
        "Update: Cannot praise developer highly enough. Immediately responded to a query and a suggestion. Excellent!  The best assistant to giving up smoking that I have found. Easy to use but comprehensive history, targeting and incentives make it a no brainer to rate 5 Stars.  One feature request - the option to remember the last used time scale when using Chart History facility. Currently always defaults to 90 days and I ALWAYS change to 30. No major chore but it would be great if it remembered.  Paid for this app within hours of installing. Excellent.  Significant reduction in my smoking by the way. Thanks.  Amendment: Add to the words above that the developer is incredibly responsive. Superb.",
        "I already cut my smoking in half on day one. I've been looking for a tracker for a long time. It makes me conscious of when, why and triggers by recording details before I light up. I think I will quit successfully this time. It's also helpful discerning my emotions throughout the day. The developer may want to make a sepearate app for once you quit to simply record how you're feeling at a given moment, it's helpful to access your triggers and calms me down a bit just to record it and see patterns. Thank you",
        "This app would be really good if, after each smoke per day, it recalculated the time to the next one by using the target number, less the number smoked, across the number of hours left on that particular day, rather than retaining the originally calculated time at the start of the day. Is that something that could be considered?",
        "Does what it says. Very easy to use. I wish that it had hourly charting for the day so that I could see visually the times of day that are Peak and Valley times. Using the widget makes it very easy to become a habit tracking each smoke.",
        "Great app, I really like how on my android phone it is always on notifications and the text is red if my goal between smokes is not met yet."
    ],
    "recentChanges": [
        "- Improved Android Wear layout for round devices",
        "- Chart options are now remembered",
        "- Exported data contains the feeling description"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ccswe.SmokingLog&hl=en&gl=us",
    "appId": "com.ccswe.SmokingLog"
}