{
    "title": "HotelTonight: Book amazing deals at great hotels",
    "summary": "No endless lists – we only show you the best deals at amazing hotels.",
    "icon": "//lh3.googleusercontent.com/S9OjloXq6cHRtthVAhMrhM-A0zSYyYYwdjJXG77TXLpUjJJ8Qk7sbIkkad2bgGdUfZA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.4,
    "reviews": 56306,
    "developer": "HotelTonight",
    "developerId": "HotelTonight",
    "developerEmail": "sleeptight@hoteltonight.com",
    "developerWebsite": "http://hoteltonight.com",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "size": "Varies with device",
    "description": "Amazing hotel deals for tonight, tomorrow and beyond! Hotels give us discounts on their empty rooms. You get the best rates and deals, whether last minute or in advance. HotelTonight makes it incredibly easy to find and reserve a sweet deal at a great hotel. Three taps, one swipe, you’re booked! Google Play Store Editor’s Choice!  •  From top rated luxury hotels to tried-and-true favorite rooms to cool, revamped former motels, we work with great hotels across the globe to get you the best deals (and only partner with hotels where we’d wanna stay, too)•  Book a room for tonight, tomorrow, next week, next month and beyond – up to 100 days in advance in our most popular locations•  Great for spontaneous vacations or planning a trip in advance. We’ve got the hookup for discounted last minute hotel bookings wherever you want to be around the world: North America, Europe, Australia and more!•  Search by city, attraction or map location •  See ratings, reviews and photos from fellow bookers•  Score extra Geo Rate savings off our already-discounted rates, based on your current location (find these deals marked in green in the app)•  HT Perks program - the more you book, the better our deals get! Level up to score even bigger discounts•  Hotel descriptions that boil down the top 3 reasons why we like the hotels we work with – and why you will, too•  Simple categories (like Basic, Hip and Luxe) to make it easy to find the perfect hotel, inn, bed and breakfast, motel, resort or other lodging for you •  24/7 customer support (from real, live, nice people) for every booking•  Access to HT Pros, our in-app concierge (a real-live person at the ready to make your stay great, from grabbing you an extra toothbrush to making a dinner reservation at a hot restaurant or bar near your hotel)•  Supports paying with Google PaySome ways you can use us:•  Surprise your BFF with a weekend in Vegas (leaving tonight!), or take your mom on a last minute vacation•  Lock down that business trip in 10 seconds, at your soon-to-be-favorite hotel (or add a vacation day for play before or after)•  Summer weekend road trips - hop in the car and reserve a room wherever the road takes you!•  A mid-week booking or staycation at that retro motel you’ve always wanted to check out… just because•  Score a luxury holiday in Paris on the cheap•  Book a last minute birthday or anniversary trip (we won’t tell anyone you forgot)•  Book a spontaneous summer weekend getaway on the flyIn the Press:“The app made its name with last-minute deals, but you can plan as far as 100 days out and even score baller rooms for way less” - Conde Naste Traveler“HotelTonight what did I do without you?” - Kelly Osbourne“You can get great, cut-rate deals on hotels… including luxury hotels.“ - Jeff Rossen, Today Show“My fav travel app.” - Samantha Brown, Travel Channel Host“I love saving on last minute bookings using the HotelTonight app.” - The Points GuyLet’s connect:•  Facebook: facebook.com/HotelTonight•  Twitter: @HotelTonight•  Instagram: @HotelTonightGot feedback? We’re all ears. Hit us up at: feedback@hoteltonight.comHotels we love. Deals you’ll love. Tonight, tomorrow and beyond. We are the excuse to travel as much as you’ve always wanted. Travel doesn’t have to be out of reach... we help you reserve discounted last minute or advance rates at awesome hotels. Weekend holidays, summer vacations, last-minute trips… open up the HotelTonight app and you’ll be on your way to a great stay. Whether you’re looking to find a last minute holiday on the cheap, take a road trip and see where you end up, hit the town and see where the night takes you, or just plan less and live more, we’ve got your back. Download now to get in on these sweet deals at great hotels!",
    "descriptionHTML": "Amazing hotel deals for tonight, tomorrow and beyond! Hotels give us discounts on their empty rooms. You get the best rates and deals, whether last minute or in advance. HotelTonight makes it incredibly easy to find and reserve a sweet deal at a great hotel. Three taps, one swipe, you&#x2019;re booked! <br><br><b>Google Play Store Editor&#x2019;s Choice!</b>  <br><br>&#x2022;  From top rated luxury hotels to tried-and-true favorite rooms to cool, revamped former motels, we work with great hotels across the globe to get you the best deals (and only partner with hotels where we&#x2019;d wanna stay, too)<br>&#x2022;  Book a room for tonight, tomorrow, next week, next month and beyond &#x2013; up to 100 days in advance in our most popular locations<br>&#x2022;  Great for spontaneous vacations or planning a trip in advance. We&#x2019;ve got the hookup for discounted last minute hotel bookings wherever you want to be around the world: North America, Europe, Australia and more!<br>&#x2022;  Search by city, attraction or map location <br>&#x2022;  See ratings, reviews and photos from fellow bookers<br>&#x2022;  Score extra Geo Rate savings off our already-discounted rates, based on your current location (find these deals marked in green in the app)<br>&#x2022;  HT Perks program - the more you book, the better our deals get! Level up to score even bigger discounts<br>&#x2022;  Hotel descriptions that boil down the top 3 reasons why we like the hotels we work with &#x2013; and why you will, too<br>&#x2022;  Simple categories (like Basic, Hip and Luxe) to make it easy to find the perfect hotel, inn, bed and breakfast, motel, resort or other lodging for you <br>&#x2022;  24/7 customer support (from real, live, nice people) for every booking<br>&#x2022;  Access to HT Pros, our in-app concierge (a real-live person at the ready to make your stay great, from grabbing you an extra toothbrush to making a dinner reservation at a hot restaurant or bar near your hotel)<br>&#x2022;  Supports paying with Google Pay<br><br><br>Some ways you can use us:<br>&#x2022;  Surprise your BFF with a weekend in Vegas (leaving tonight!), or take your mom on a last minute vacation<br>&#x2022;  Lock down that business trip in 10 seconds, at your soon-to-be-favorite hotel (or add a vacation day for play before or after)<br>&#x2022;  Summer weekend road trips - hop in the car and reserve a room wherever the road takes you!<br>&#x2022;  A mid-week booking or staycation at that retro motel you&#x2019;ve always wanted to check out&#x2026; just because<br>&#x2022;  Score a luxury holiday in Paris on the cheap<br>&#x2022;  Book a last minute birthday or anniversary trip (we won&#x2019;t tell anyone you forgot)<br>&#x2022;  Book a spontaneous summer weekend getaway on the fly<br><br>In the Press:<br>&#x201C;The app made its name with last-minute deals, but you can plan as far as 100 days out and even score baller rooms for way less&#x201D; - Conde Naste Traveler<br>&#x201C;HotelTonight what did I do without you?&#x201D; - Kelly Osbourne<br>&#x201C;You can get great, cut-rate deals on hotels&#x2026; including luxury hotels.&#x201C; - Jeff Rossen, Today Show<br>&#x201C;My fav travel app.&#x201D; - Samantha Brown, Travel Channel Host<br>&#x201C;I love saving on last minute bookings using the HotelTonight app.&#x201D; - The Points Guy<br><br>Let&#x2019;s connect:<br>&#x2022;  Facebook: facebook.com/HotelTonight<br>&#x2022;  Twitter: @HotelTonight<br>&#x2022;  Instagram: @HotelTonight<br>Got feedback? We&#x2019;re all ears. Hit us up at: feedback@hoteltonight.com<br><br>Hotels we love. Deals you&#x2019;ll love. Tonight, tomorrow and beyond. We are the excuse to travel as much as you&#x2019;ve always wanted. Travel doesn&#x2019;t have to be out of reach... we help you reserve discounted last minute or advance rates at awesome hotels. Weekend holidays, summer vacations, last-minute trips&#x2026; open up the HotelTonight app and you&#x2019;ll be on your way to a great stay. Whether you&#x2019;re looking to find a last minute holiday on the cheap, take a road trip and see where you end up, hit the town and see where the night takes you, or just plan less and live more, we&#x2019;ve got your back. Download now to get in on these sweet deals at great hotels!",
    "histogram": {
        "1": 3479,
        "2": 1511,
        "3": 3328,
        "4": 10989,
        "5": 36999
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/5V7o4pj55-L8m_KtEXu9Qt82T5ZCMJzko7vI38zTCG2EQ_tTCwNbn4k_C_5lrivV8NU=h310",
        "//lh3.googleusercontent.com/jsQwrApTii03MONx2g8WCATCKwem5aOuGYKjFDE0CMpYH7o5rY7Xi-NPzLr-BImyZQ=h310",
        "//lh3.googleusercontent.com/B8M-0ItLQKnQruJFVwXosWzcsgP4_92_WrmrdhC1f0YhP7b3641lz_Mu0yMmySoaIIc=h310",
        "//lh3.googleusercontent.com/NxZFIg-bL-_B5tPDZ9Wk0RK_Dg0HuiVTjiqqBdDEeaXR4jqoxZFqPeitD5pFD-LodhQ=h310",
        "//lh3.googleusercontent.com/7vcqogdS-MWRhG47y5GgE4Qhoyj3xFc-RWZAYEK8Tyg-wYOuX6VR-zoy1SI35i7EYQ=h310",
        "//lh3.googleusercontent.com/COA__5GJ6TqPrHvVrMCCqvWvm204u3iKPwG5Yjzj8bVVN6yMtVtx-YKtPLXyGWvtWcES=h310",
        "//lh3.googleusercontent.com/2Py2nT_m8dhOnAAQj9uDB75LUrxNs7S4mSUEr9ZffqoOT4v-jRaj_QPrAtXQnAAjUg=h310",
        "//lh3.googleusercontent.com/Kz8E-xyMWIvXa4vvWONa0JCpRMZ0EKZ0JVSKNByo9ul2UOqgvOKUSP7cfUB0PhI-Eg=h310",
        "//lh3.googleusercontent.com/-TSCT-gJBYlzMurtB2pBhzlXi0KIZE2ACQSZJym_BLXde0wBcXvtT2PxQhxBVklZ30w=h310",
        "//lh3.googleusercontent.com/X79lim74B7xGjZhkGBeQuJtUIla249zwCsEomY1RiuMYj6CH25UAoiv-yAILZ79hHA=h310",
        "//lh3.googleusercontent.com/47P-3N5zDe9PLdsQI790PLsWEYdK7flPKp9mnydbi2zpYqiF9tUd1wEGY9Wbl0nsGTY=h310"
    ],
    "comments": [
        "I just looked at it, I didn't get a chance to use it yet, although what I did see, I didn't see too many rooms available.",
        "Disingenuous price listing, hiding additional fees during the booking process.",
        "Great perks, great deals, the customer service is on point and always available. I love this application .",
        "Non refundable policy",
        "Love it always great deals!!!",
        "Nice app"
    ],
    "recentChanges": [
        "We update the app pretty regularly to keep things running smoothly. Occasionally we'll update with something really exciting. We promise to tell you when that happens."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.hoteltonight.android.prod&hl=en&gl=us",
    "appId": "com.hoteltonight.android.prod"
}