{
    "title": "Once - Quality Matches Every day",
    "summary": "Once - the only dating app that brings you quality matches everyday",
    "icon": "//lh3.googleusercontent.com/epJw-VIvHwumTY73TUGTnwy1hSaWXmxCnQ_0x28_lXjWrcPj9Qv-Xu7YYJbbryfO5Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.4,
    "reviews": 188334,
    "developer": "Once Dating AG",
    "developerId": "Once+Dating+AG",
    "developerEmail": "hello@getonce.com",
    "developerWebsite": "http://getonce.com",
    "developerAddress": "Once Dating AG, Schindellegistrasse 3\n8808 Pfäffikon, Switzerland",
    "updated": "March 2, 2018",
    "version": "2.35",
    "genre": "Dating",
    "genreId": "DATING",
    "description": "Once – the only dating app that brings you quality matches everyday.Tired of swiping endlessly without finding that special someone? Once brings back some magic to the online dating world as it is all about quality over quantity. How? Everyday at noon you get matches that are specifically selected for you based on your criteria and you have 24 hours to decide if you want to give it a go – 24 hours of full attention, yes my friend.Registration is free, hurry up, try it out!- Selected matches for you -Once is the only dating app that brings you quality matches everyday based on tastes and the information provided. You can also pick your own rendez-vous for the next day. How cool is that?- Get their full attention for a day -With Once, you get 24 hours of attention from matches chosen specifically for you. Because you do not have to swipe through thousands of profiles, you can focus on only the high quality matches we send you everyday - giving you the time to find the one right for you. We said this is serious dating....believe us now?- No waste of time -Want to meet someone, flirt, love, but don’t have time for it? Don’t worry, checking your match of the day will only take few minutes. We believe it's more efficient that way.It's up to you now!",
    "descriptionHTML": "Once &#x2013; the only dating app that brings you quality matches everyday.<br><br>Tired of swiping endlessly without finding that special someone? Once brings back some magic to the online dating world as it is all about quality over quantity. How? Everyday at noon you get matches that are specifically selected for you based on your criteria and you have 24 hours to decide if you want to give it a go &#x2013; 24 hours of full attention, yes my friend.<br><br>Registration is free, hurry up, try it out!<br><br>- Selected matches for you -<br><br>Once is the only dating app that brings you quality matches everyday based on tastes and the information provided. You can also pick your own rendez-vous for the next day. How cool is that?<br><br>- Get their full attention for a day -<br><br>With Once, you get 24 hours of attention from matches chosen specifically for you. Because you do not have to swipe through thousands of profiles, you can focus on only the high quality matches we send you everyday - giving you the time to find the one right for you. We said this is serious dating....believe us now?<br><br>- No waste of time -<br><br>Want to meet someone, flirt, love, but don&#x2019;t have time for it? Don&#x2019;t worry, checking your match of the day will only take few minutes. We believe it&apos;s more efficient that way.<br><br>It&apos;s up to you now!",
    "histogram": {
        "1": 10862,
        "2": 4489,
        "3": 13425,
        "4": 19882,
        "5": 139676
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/V3O9UinA6buV134fs5aTe3REIgPCnOgfq9gCt7xagqJJ3Un-oNbLs9BzMxveJ3EZDw=h310",
        "//lh3.googleusercontent.com/Z2pOuEQxbNCnSGjnf_jXHL20YOCa80e85MFIdULpu4rN_uiaMlRLygfn0V4YM35ATg=h310",
        "//lh3.googleusercontent.com/Bmn40QX6l7iZ02D7pA1UL0oezOtGYCu8_2IfX03995DG-tkKqOpw6AfSVpaVNZLaIL3_=h310",
        "//lh3.googleusercontent.com/XmkVrgqyZVX_-XeGUThQXoA9rgEYhj8W8JhdCW9XIv7wpsyILtwAdGspOa4Ll-nafIc=h310",
        "//lh3.googleusercontent.com/1lTru1HFDHMMkiDKlV_jZLAL7cjd5iO0yTnGsSKppKrLpTC7IT4Q-79_N4JWAwz_EvCd=h310",
        "//lh3.googleusercontent.com/eiUQB3aRLNtIXS3dl3D1fuNSgHPTVx5May54Dha67MVs__AInHDipAvsrhz__qPPcwE=h310",
        "//lh3.googleusercontent.com/kf3i9jNMVcWqmIcT5_PGLZJnCAWhIuyxiSBaTdQFhlXHdHIqB50IAvTVlGWMu6c6lX0=h310"
    ],
    "comments": [
        "Be prepared to spend money at every turn. I didn't even fully set my profile up and was being told to buy coins to chat... yeah, negative.",
        "Great idea and easy to use but when they are unable to find a match for you every day for over a week now, it starts to like a useless app. They need to make sure they are more consistent with have a match more often, preferably everyday.",
        "You literally have to pay for almost the most basic of functions you'd expect out of a free app to meet people with. Like messaging. Or communicating at all. I literally have people wanting to message me and i can't even ACCEPT the invitation to communicate without using credits. And when you actually DO use the micro transaction method to do so with the little bit of free credits you start with, there is no way to get more without paying. For instance. \"Like the app on Facebook\" and get access to more \"credits\" to stockpile so you can talk to people, only to really never get them lol. It's a waste. I'm going back to tinder. I won't say the concept is nice, but it's different.....That's really it. So I'll give it 3 stars when it prolly deserves 1 for functionality.  Update: this app is terrible. You have to literally pay to talk to people before you even get a chance to see them or their profile when sent chat requests. And you still have to pay to initiate conversations too. So even if you do decide to pay to talk to somebody you can almost forget it that they'll pay to accept your invite to talk. Especially if they refuse to keep spending $10 every 2-3 people when's there's TONS of other apps that let you do that for free. I'm deleting this right after this review in hopes it helps somebody else.",
        "It's nice until you want to message someone... It's 9.99 for 2 messages and they have to pay 9.99 to message you back, good luck.",
        "This app is only here to make someone rich, not find you love.  Steer clear of this money grab. You'll NEVER be matched with someone you actually rate highly. Actually they match you with guys who are the exact OPPOSITE of your type. Guys who I would give 1 star to (much like this app) Then they tell you to buy overpriced \"crowns\" to talk to someone who possibly rated you as high as you rated them. But they'll never put them in your matches to talk. This app is preying on lonely singles. They want your money, NOT your happiness. That's why it costs to do everything.",
        "You have to pay for \"matches\" to talk to them before you even see who they are. And most of those are dozens if not 100s of miles away. And they don't optimize who you match w/ based on rating other profiles, that's just there to make it look like matches are more than random."
    ],
    "recentChanges": [
        "Hey froggies,",
        "Every update brings fixes and improvements to help you find the one!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.once.android&hl=en&gl=us",
    "appId": "com.once.android"
}