{
    "title": "Swipify - Wear Launcher",
    "summary": "Swipify - Wear Recent App Switcher &amp; Launcher.",
    "icon": "//lh4.ggpht.com/d1w-Io3g5gOEDXXioLVxkbP19t3CUbWCkaASydCuuZGpNs9oT45uOkqFnUSiWTfYEDcx=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.4,
    "reviews": 332,
    "developer": "Sweet Pixel Studio",
    "developerId": "6019671491520019459",
    "developerEmail": "ushersyoutube@yahoo.com",
    "developerWebsite": "http://www.wingoku.com",
    "developerAddress": "F-3, University Road,\nPeshawar, KP,\nPakistan",
    "updated": "November 1, 2014",
    "version": "2.1.9",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Note: We did not own an Android phone running 4.3 and an Android Wear Watch at the time of development of this app. The app is developed solely based on community testing. If you find any bugs, please let us know before leaving a bad rating.Swipify is a performance driven, highly customizable app launcher & recent apps switcher for Android Wear. Android wear is cool but opening apps using voice isn't always convenient. Swipify helps you easily launch your apps. Swipify is designed to revolutionize multitasking, app switching, app launching & controlling your phone via Android Wear.Moto360 / Round Watch users Make sure you select Round Watch Shape  from phone side app.FeaturesSwipify enhances Android Wear experience by providing:•  3 different style app launchers      • Floating Launcher - Open the launcher with a single tap on the floating icon. Move around the floating icon at your will.      • Radial Launcher - Moto 360 Style launcher      • Swipe Launcher  - Traditional phone style launcher• Multitasker / Recent App switcher - Switch between running apps any where on the Android wear system (Multitasking)• Phone Finder - Get notified on your watch, when you are away from your phone.• Wifi Tethering• Music Controller - Control your Google Play Music Player on your phone right from your watch.• Wifi & Phone Profile Toggles  on watch• Screen Always On• RAM monitor • Changing Phone volume from watch • Phone & watch battery levels• Quick Settings - Easily change brightness, volume profile & view smart watch battery level.How to use it• To switch between recent apps, swipe from the right edge of the screen from any where on the system • To open the launcher, swipe from the left edge of the screen from any where on the system.• Radial launcher : Each ring shows 6 apps, to get the ring of next 6 apps move your finger back to the left edge of the display.Featured On  \"This is the application I can't live without!\" - Kevin The Tech NinjaAndroid Community - http://goo.gl/XBKwBuAndroid Guys - http://goo.gl/jeYueBAndroid Police - http://goo.gl/s3o2tnABC.es - http://goo.gl/oSJH5dUbergizmo - http://goo.gl/MgqU1iFrAndroid - http://goo.gl/XDHGJYFeatures SuggestionsIf you want to see more features on Swipify, you can email them to me.Notes:• To use this app, you must have an Android wear smart watch.• When you install this app on your phone, it automatically installs Swipify on the smart watch connected to your phone.A huge thanks to Joe Katon & Jiří Mrázek for testing the appDeveloper's website: http://www.wingoku.com'Google+ Community: Join to get latest updates and tipshttps://plus.google.com/u/0/communities/108631589222149481600",
    "descriptionHTML": "<b><i>Note: We did not own an Android phone running 4.3 and an Android Wear Watch at the time of development of this app. The app is developed solely based on community testing. If you find any bugs, please let us know before leaving a bad rating.</i></b><br><br><b>Swipify is a performance driven, highly customizable app launcher &amp; recent apps switcher for Android Wear. </b><br><br><br><br>Android wear is cool but opening apps using voice isn&apos;t always convenient. Swipify helps you easily launch your apps. Swipify is designed to revolutionize multitasking, app switching, app launching &amp; controlling your phone via Android Wear.<br><br><br><br><br><b>Moto360 / Round Watch users </b><br><br>Make sure you select <i>Round Watch Shape </i> from phone side app.<br><br><br><br><br><b>Features</b><br><br>Swipify enhances Android Wear experience by providing:<br><br><br>&#x2022; <b> 3 different style app launchers</b><br>&#x2003;&#x2003;&#x2003;&#x2003;&#x2003;&#x2003;&#x2022; <b>Floating Launcher</b> - Open the launcher with a single tap on the floating icon. Move around the floating icon at your will.<br>&#x2003;&#x2003;&#x2003;&#x2003;&#x2003;&#x2003;&#x2022; <b>Radial Launcher</b> - Moto 360 Style launcher<br>&#x2003;&#x2003;&#x2003;&#x2003;&#x2003;&#x2003;&#x2022; <b>Swipe Launcher</b>  - Traditional phone style launcher<br><br><br>&#x2022; <b>Multitasker / Recent App switcher</b> - Switch between running apps any where on the Android wear system <i><b>(Multitasking)</b></i><br><br>&#x2022; <b>Phone Finder</b> - Get notified on your watch, when you are away from your phone.<br>&#x2022; <b>Wifi Tethering</b><br>&#x2022; <b>Music Controller</b> - Control your Google Play Music Player on your phone right from your watch.<br>&#x2022; <b>Wifi &amp; Phone Profile Toggles </b> on watch<br>&#x2022; <b>Screen Always On</b><br>&#x2022; <b>RAM monitor</b> <br>&#x2022; <b>Changing Phone volume from watch</b> <br>&#x2022; Phone &amp; watch battery levels<br>&#x2022; Quick Settings - Easily change brightness, volume profile &amp; view smart watch battery level.<br><br><br><br><b>How to use it</b><br><br>&#x2022; To switch between recent apps, <i>swipe from the right edge of the screen from any where on the system</i> <br>&#x2022; To open the launcher, <i>swipe from the left edge of the screen from any where on the system.</i><br>&#x2022; Radial launcher : Each ring shows 6 apps, to get the ring of next 6 apps move your finger back to the left edge of the display.<br><br><br><br><b>Featured On</b><br><br><i> <b> &quot;This is the application I can&apos;t live without!&quot; - Kevin The Tech Ninja<br><br><i>Android Community</i> - http://goo.gl/XBKwBu<br><i>Android Guys</i> - http://goo.gl/jeYueB<br><i>Android Police</i> - http://goo.gl/s3o2tn<br><i>ABC.es</i> - http://goo.gl/oSJH5d<br><i>Ubergizmo</i> - http://goo.gl/MgqU1i<br><i>FrAndroid</i> - http://goo.gl/XDHGJY<br><br><br><br><br><br><b>Features Suggestions</b><br><br>If you want to see more features on Swipify, you can email them to me.<br><br><br><br><br><b>Notes:</b><br><br>&#x2022; To use this app, you must have an Android wear smart watch.<br><br>&#x2022; When you install this app on your phone, it automatically installs Swipify on the smart watch connected to your phone.<br><br><br><br>A huge thanks to <b>Joe Katon</b> &amp; <b>Ji&#x159;&#xED; Mr&#xE1;zek</b> for testing the app<br><br><br><b>Developer&apos;s website:</b> http://www.wingoku.com&apos;<br><br><br>Google+ Community: Join to get latest updates and tips<br><br><br>https://plus.google.com/u/0/communities/108631589222149481600</b></i>",
    "histogram": {
        "1": 60,
        "2": 30,
        "3": 68,
        "4": 68,
        "5": 106
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "3.2 and up",
    "androidVersion": "3.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/VNK5qsINGOzusEov_8x_sUEGKT5oFNbvteEkhCVjbF5jomSW3Ai26oC49Xbynw7drkdE=h310",
        "//lh6.ggpht.com/bu8rMfv_Deu7b4cwkN7Irs8qYSvW43GO5Uf7SLylouRfb6xvbEnp-XyW2mSKl9v847Y=h310",
        "//lh5.ggpht.com/JOJMaN5fxHKh5k5jV96A1qYneNXocoiLRQvPEpWF1te54izwkceDCIL-QehsxOMvBKk=h310",
        "//lh6.ggpht.com/qC97_6CoEHvFv2tgnz_11Tl5dZFarZoRGuOLKcRMvcpzZ1Z3aLypsB3k0VTieqsgJtA=h310",
        "//lh4.ggpht.com/pnBD-ZvlPXVdaYQmel6Cww3t66NdoDLDHFZtYuCYCx2QEWi9KTIHiEl_GRUIHcyqFg=h310",
        "//lh5.ggpht.com/-xSbBU6hU2XyWQwm1MNxh1Pdk8MPCrpeZ-G_FDU5_MfiZM6lfxnyKL5NCgIgsHAK4eU=h310",
        "//lh4.ggpht.com/K6tkBzGBE5mIJBvJaIx_QB0_np3cZ_kJgpoXNrnC8qCNVNw3vQxkJ4U8OHwW_Xm1ZLZn=h310",
        "//lh3.ggpht.com/W6P1jpzfly1OPfR-b2PVjGPiWsiI-HXorVYJYYSKv9mPGccgfqyai7zrfzhSyZPoOHY=h310"
    ],
    "video": "https://www.youtube.com/embed/jmDPwy1fyn8",
    "comments": [
        "Great but needs improvement I really like this launcher, as I use it with my moto 360. However, I've had a bug where the watch gets stuck on the multi-tasker. Also despite me having it off in the settings, the multi-tasker is still there. Lastly, the quick setting toggles do not work on my Nexus 6; this is a fantastic feature but I hope the Dev can fix this and the other bugs with this app. Very convenient app and highly recommend it, despite the bugs.",
        "Still needs some work There is no option to alphabetize or hide apps in the menu. There is no option to change the size of the icons or the font. App switcher shows 6 apps, but does not let you close any of them. I like the direction it is going though, and with these changes I'd improve my rating",
        "Dont know how to open always on mode Hey there... your app is one of the best app i have ever seen but the main thing is that i am not getting the option for always on mode... kindly help me through it so that i will give u 5 stars for it",
        "Super light weight almost pefect.! Only thing this launcher needs is multiple icon sizes, and why does the background color gradient? Other than that and (alot of) misc bugs in the app setting this is the perfect launcher for android wear!!",
        "It's okay... It works the way I want it to except for one thing, on my lg g watch the background glitches out when the transperancy is at 0 (or anything that isn't 100%), it shows 4 very glitched screens of the launcher in the background instead of my clock. This could be a problem with my watch because I was also having trouble with wear mini launcher (but this is different altogether) but could you please try and fix this because I love this launcher. Other than that when the background is solid this is a great launch",
        "Galaxy S4 Moto 360 Issues appear resolved Have tried multiple times with my 360 and GS4, failed miserably. Tried with new updates, best functionality yet. 3 stars for now, more with time."
    ],
    "recentChanges": [
        "2.1.9",
        "--------",
        "* Enhancements",
        "* Bug Fixes",
        "* Easter Eggs",
        "2.1.8",
        "----------",
        "* Bug fixes",
        "2.1.7",
        "--------",
        "* Full Moto 360 & Round shape watches compatibility",
        "* Numerous new customization options",
        "* Performance Tweaks",
        "* Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.wingoku.swipify.phone&hl=en&gl=us",
    "appId": "com.wingoku.swipify.phone"
}