{
    "title": "Moven - Smart Finances",
    "summary": "A free app &amp; debit card that makes saving money as easy as spending it.",
    "icon": "//lh3.googleusercontent.com/LlkmiExz8gmV6CV00HfvKgR8BXx_iPWDfuCPXtuoDOZdmqg3CPv7AhWe_ccazh3yqM2K=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.8,
    "reviews": 847,
    "developer": "Movencorp Inc.",
    "developerId": "Movencorp+Inc.",
    "developerEmail": "support@moven.com",
    "developerWebsite": "http://moven.com",
    "updated": "February 26, 2018",
    "version": "3.3.8",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Get Moven with Smart Banking and take control of your finances.Whether you’re buying groceries, dining out, or saving for something on your wishlist, Moven automatically analyzes your spending and gives you instant receipts and insights so you can spend, save & live smarter. Want a summary? Moven provides a Daily Digest recap of your spending yesterday.How Does it Work?The Moven® Smart Banking card and app work together to help you track, understand and manage your spending and saving.1 - Download the free Moven app2 - Apply for Moven smart banking. It’s FDIC Insured, and you can use the Moven debit card wherever MasterCard® is accepted. Or, try Moven with your existing debit, checking, and credit card accounts.3 - Add Money into your account. Direct deposit, checks and cash, Moven accepts them all. 4 - Pay with Moven. Swipe your Moven debit card or tap it with Samsung Pay or Android Pay on your phone. Receive spending insights instantly after every purchase to help you control your spending.5 - Track with the App. The Moven app instantly categorizes each purchase, and shows you how much you’ve spent for the month. 6 - Control your spending. When you’re aware of how much you’re spending, it’s easier to keep your spending under control.7 - Stash those gains into savings. See your personalized savings path, and afford your wish list faster.Other Cool Features:- Link your accounts. Use Moven to track your spending across all of your bank accounts and credit cards.- Pay your friends. Send money to another Moven user instantly, for free, or pay a friend using email or text - even if they don’t have a Moven account. Search your phone's Contacts for speed and reliability.- Forget about fees. Access your money at over 42,000 ATMs with no surcharges. And Moven charges absolutely no monthly fees or overdraft charges!- Use your Moven debit card with Samsung Pay or Android Pay to shop in stores or in apps.- Widgets show your Moven balance, Spending Meter™, and recent transactions at a glance.- Android Wear users see their Instant Receipts and Spending Meter on the go.Download Moven today!DisclosuresThe Moven debit card is issued by CBW Bank, member FDIC, so your money is safely held in a federally-insured account.",
    "descriptionHTML": "Get Moven with Smart Banking and take control of your finances.<br><br>Whether you&#x2019;re buying groceries, dining out, or saving for something on your wishlist, Moven automatically analyzes your spending and gives you instant receipts and insights so you can spend, save &amp; live smarter. Want a summary? Moven provides a Daily Digest recap of your spending yesterday.<br><br>How Does it Work?<br>The Moven&#xAE; Smart Banking card and app work together to help you track, understand and manage your spending and saving.<br>1 - Download the free Moven app<br>2 - Apply for Moven smart banking. It&#x2019;s FDIC Insured, and you can use the Moven debit card wherever MasterCard&#xAE; is accepted. Or, try Moven with your existing debit, checking, and credit card accounts.<br>3 - Add Money into your account. Direct deposit, checks and cash, Moven accepts them all. <br>4 - Pay with Moven. Swipe your Moven debit card or tap it with Samsung Pay or Android Pay on your phone. Receive spending insights instantly after every purchase to help you control your spending.<br>5 - Track with the App. The Moven app instantly categorizes each purchase, and shows you how much you&#x2019;ve spent for the month. <br>6 - Control your spending. When you&#x2019;re aware of how much you&#x2019;re spending, it&#x2019;s easier to keep your spending under control.<br>7 - Stash those gains into savings. See your personalized savings path, and afford your wish list faster.<br><br>Other Cool Features:<br>- Link your accounts. Use Moven to track your spending across all of your bank accounts and credit cards.<br>- Pay your friends. Send money to another Moven user instantly, for free, or pay a friend using email or text - even if they don&#x2019;t have a Moven account. Search your phone&apos;s Contacts for speed and reliability.<br>- Forget about fees. Access your money at over 42,000 ATMs with no surcharges. And Moven charges absolutely no monthly fees or overdraft charges!<br>- Use your Moven debit card with Samsung Pay or Android Pay to shop in stores or in apps.<br>- Widgets show your Moven balance, Spending Meter&#x2122;, and recent transactions at a glance.<br>- Android Wear users see their Instant Receipts and Spending Meter on the go.<br><br>Download Moven today!<br><br>Disclosures<br>The Moven debit card is issued by CBW Bank, member FDIC, so your money is safely held in a federally-insured account.",
    "histogram": {
        "1": 149,
        "2": 49,
        "3": 79,
        "4": 105,
        "5": 465
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/1XcgRKRElh-qPsEITXA-CGCFJm9dBu8uAWQfoEcKWevbsEWf1yH7ghw0jAGpF3af3QE=h310",
        "//lh3.googleusercontent.com/4PA_G_EVsLsGwPGsWYMkQFhA5VspaYM767OOCrQrsl3xqQxCrzeoSo8Rr3O1PnNadg=h310",
        "//lh3.googleusercontent.com/Z8pouZYckL760C8uCFCl1yoHavbD8FV2ykK396_7cFJKSLlLNLLXkgiaZ7DMTWp6TA=h310",
        "//lh3.googleusercontent.com/4XTbsQHRscc9mlIFsxjFAMhKtkjKzIv1iVm2J8U6MqDeMtu9XY9xfhyCKG2m8X9oKT4f=h310",
        "//lh3.googleusercontent.com/6HlHmdi2f7NXEAxT7Y_HZXfhE3cTxCGu5z_qk325iseavmPc3c7_C0m5Rjth0INCkg=h310",
        "//lh3.googleusercontent.com/oZ6LiaUWg11UelgVKSUFXkpizqg6Ij1subVYh388_2HHIPoi-503LH1uUW3TAaP2qac=h310",
        "//lh3.googleusercontent.com/NUvu3YWdd8ivBYBsXdD8iMigEz1s6RchU8t4HYcdfjQUaKe8ubjvFrYafJ1cuPDv9w=h310",
        "//lh3.googleusercontent.com/m62U_YBVzaJ8syJPwnCAK2JWTXkssVf5yCFaMPPl1LgqifaBUssg0NgnLr9ZMZ4vyr0=h310",
        "//lh3.googleusercontent.com/X_iw50A0Ch99ka1uzT9qtkfAjyJtTPRfrEXutRCkNtLhsrEEh5NsPblPRMdgrohj-5w=h310",
        "//lh3.googleusercontent.com/ZDTXBKIABbWHeYM3mhPDAC_cBCCcZRYdxd-ycCcynFwdr1UBmWmKJ3ucB5wG4T6hCPk=h310"
    ],
    "video": "https://www.youtube.com/embed/ZLwvTZGMhRE",
    "comments": [
        "THEY STOLE MY MONEY!   I been using moven for 2 yrs and so far its been great. But this following week i started to use the moven stash to keep money to the side for new years. Unfortunately everything on the app work expect for the moven stash section. I cant touch my money. I have to email them to even transfer my money back into my account and still i dont know how long that going to take. I can use the app but not moven stash. Its funny how it was working fine before i put money it. Now im stuck on new years with no money because i have to wait......i dropping them! Dont do it only thing that is good is no fees...other then that...not good customer service...and cant talk to anyone!",
        "I like the card, but sometimes Moven charges me 5 dollars more for transactions over 20$. Customer service has not been helpful about answering my questions on how to load it. No stores on their site has even heard of Moven and I can never add cash to my card!   Updated: to Moven support. Nope. No ones heard of repower. That's what Ive been trying",
        "Love moven there are no over daft fees ever and the the customer support is awesome! Any problem I've had they solved it quicky.",
        "I refuse to get a \"regular\" bank account until they can match the service and communication moven offers always incredibly easy and helpful and I've never checked my account and said whered my money go like a \"regular\" account nor any overdraft fees",
        "Moven is amazing and their personalised customer service is even better! I have used them for years, and can't imagine going back to a large banking institution ever again! Five-star rating from me!",
        "I can't login to the app. It no longer accepts my password which is correct. and it won't let me create a new password. Customer support won't answer or return my calls."
    ],
    "recentChanges": [
        "- Bug fixes and other improvements",
        "If you are enjoying using Moven, please let us know right here in the Play Store."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.movencorp.moven&hl=en&gl=us",
    "appId": "com.movencorp.moven"
}