{
    "title": "Trainline EU: Train Tickets",
    "summary": "Book your train tickets for France, Germany, Italy and many nearby countries.",
    "icon": "//lh3.googleusercontent.com/teVsWqkq8oL-ALgDSJwoidBjkJD6Vaf948QagC9zQ3ePnkDpdk_ozwzY5yJ8eOIvnKc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.4,
    "reviews": 8333,
    "developer": "Capitaine Train SAS",
    "developerId": "8541871960400151849",
    "developerEmail": "android@trainline.eu",
    "developerWebsite": "https://www.trainline.eu",
    "updated": "December 28, 2017",
    "version": "Varies with device",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "size": "Varies with device",
    "description": "Trainline, previously Captain Train, is the quickest and easiest solution for booking train tickets online in Europe. Since 2011, more than 1.8 million users trust us to book their tickets in France (SNCF, iDTGV, OUIGO, OUIBUS), Germany (Deutsche Bahn, HKX), Italy (Trenitalia, Italo, Thello), Spain (Renfe), the U.K. (Eurostar), Switzerland (Lyria), and Belgium and the Netherlands (Thalys).Trainline: the new name for Captain TrainBack in March 2016, we said hello to Captain Train—our French equivalent—and teamed up with them to build the best online train ticket platform in Europe. Captain Train is now part of the Trainline Group and our team and our mission remain the same: we’re here to make train travel easier and smarter for people in the UK, France and the whole of Europe.What the media says about us“It’s already built up a fanbase by being more user-friendly” — The Guardian“This looks good. The whole site is clean, fast and zippy. If only all travel booking was like this!”— Business Insider“In most cases, I now recommend using www.trainline.eu” — Mark from Seat61.comBuy train tickets at the best price• Pay no booking fees or hidden costs. We have the lowest prices.• Select your preferred seats for the train.• Find and book tickets for all trains in France, Germany, Italy, Spain and nearby countries: TGV, ICE, Eurostar, Thalys, Lyria, Renfe, etc.• Find the best prices amongst the most comprehensive offers: Prem’s, Loisir, iDTGV, etc.• Take advantage of your discount and loyalty cards: Eurostar Frequent Traveller, Thalys TheCard, etc.• Pay whenever you want, thanks to our pre-booking feature.• Pay however you want: Visa, MasterCard, AMEX or PayPal.• Exchange or cancel your tickets within the app.Book your trip in seconds• Register your loyalty and discount cards along with your personal information.• Save time by creating a passenger profile for any fellow travellers.• Select your favourite destinations instantly.• Review your upcoming or previous journeys.• Receive your e-tickets in PDF format or store them on your loyalty card.• Add your journeys to your calendar and Passbook in only one click.Too good to be true?Like many users you may ask yourself how we make money.It is quite simple. Like any other official travel agent (certified by the SNCF or the Deutsche Bahn) we earn a commission for each ticket sold. There is no additional fee for our clients because our prices are aligned with the rail operator’s fares.App permissionsIf you’re curious to know what permissions we ask for upon installation, you can find a detailed explanation here: http://faq.trainline.eu/article/292-android-app-required-information-permissionsYou’ve read this far?You rock! Tweet “the wagon is mobile”, and mention @trainline_eu. We will answer you with some emoji hearts and a train picture.Help: http://faq.trainline.euBlog : https://blog.trainline.euTwitter : https://twitter.com/trainline_euFacebook : https://www.facebook.com/trainline.euInstagram : https://www.instagram.com/trainline",
    "descriptionHTML": "Trainline, previously Captain Train, is the quickest and easiest solution for booking train tickets online in Europe. Since 2011, more than 1.8 million users trust us to book their tickets in France (SNCF, iDTGV, OUIGO, OUIBUS), Germany (Deutsche Bahn, HKX), Italy (Trenitalia, Italo, Thello), Spain (Renfe), the U.K. (Eurostar), Switzerland (Lyria), and Belgium and the Netherlands (Thalys).<br><br><br><b>Trainline: the new name for Captain Train</b><br><br>Back in March 2016, we said hello to Captain Train&#x2014;our French equivalent&#x2014;and teamed up with them to build the best online train ticket platform in Europe. Captain Train is now part of the Trainline Group and our team and our mission remain the same: we&#x2019;re here to make train travel easier and smarter for people in the UK, France and the whole of Europe.<br><br><b>What the media says about us</b><br><br>&#x201C;It&#x2019;s already built up a fanbase by being more user-friendly&#x201D; &#x2014; The Guardian<br><br>&#x201C;This looks good. The whole site is clean, fast and zippy. If only all travel booking was like this!&#x201D;&#x2014; Business Insider<br><br>&#x201C;In most cases, I now recommend using www.trainline.eu&#x201D; &#x2014; Mark from Seat61.com<br><br><b>Buy train tickets at the best price</b><br><br>&#x2022; Pay no booking fees or hidden costs. We have the lowest prices.<br>&#x2022; Select your preferred seats for the train.<br>&#x2022; Find and book tickets for all trains in France, Germany, Italy, Spain and nearby countries: TGV, ICE, Eurostar, Thalys, Lyria, Renfe, etc.<br>&#x2022; Find the best prices amongst the most comprehensive offers: Prem&#x2019;s, Loisir, iDTGV, etc.<br>&#x2022; Take advantage of your discount and loyalty cards: Eurostar Frequent Traveller, Thalys TheCard, etc.<br>&#x2022; Pay whenever you want, thanks to our pre-booking feature.<br>&#x2022; Pay however you want: Visa, MasterCard, AMEX or PayPal.<br>&#x2022; Exchange or cancel your tickets within the app.<br><br><b>Book your trip in seconds</b><br><br>&#x2022; Register your loyalty and discount cards along with your personal information.<br>&#x2022; Save time by creating a passenger profile for any fellow travellers.<br>&#x2022; Select your favourite destinations instantly.<br>&#x2022; Review your upcoming or previous journeys.<br>&#x2022; Receive your e-tickets in PDF format or store them on your loyalty card.<br>&#x2022; Add your journeys to your calendar and Passbook in only one click.<br><br><b>Too good to be true?</b><br><br>Like many users you may ask yourself how we make money.<br><br>It is quite simple. Like any other official travel agent (certified by the SNCF or the Deutsche Bahn) we earn a commission for each ticket sold. There is no additional fee for our clients because our prices are aligned with the rail operator&#x2019;s fares.<br><br><b>App permissions</b><br><br>If you&#x2019;re curious to know what permissions we ask for upon installation, you can find a detailed explanation here: http://faq.trainline.eu/article/292-android-app-required-information-permissions<br><br><b>You&#x2019;ve read this far?</b><br><br>You rock! Tweet &#x201C;the wagon is mobile&#x201D;, and mention @trainline_eu. We will answer you with some emoji hearts and a train picture.<br><br>Help: http://faq.trainline.eu<br>Blog : https://blog.trainline.eu<br>Twitter : https://twitter.com/trainline_eu<br>Facebook : https://www.facebook.com/trainline.eu<br>Instagram : https://www.instagram.com/trainline",
    "histogram": {
        "1": 564,
        "2": 227,
        "3": 464,
        "4": 1257,
        "5": 5821
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Z8OJEYKitED2M3GPYAnzukz0-RwTKSQIlZ-SH3z2pvSeUGfEN66OO_XyDfA2BT4Ypw=h310",
        "//lh3.googleusercontent.com/dhIKAdhgo21p0LWred0Q6P3uohXV0GXHiXuM7YqMN6SWNKyT-ClTcs0BB2tPvoqjyg0=h310",
        "//lh3.googleusercontent.com/MUGiIALbaCGSppoJP-mOyITNy172BL-OymamUOux6SFM-DDKkZwdjHoMqM9YpTnpZA=h310",
        "//lh3.googleusercontent.com/TeKIFWBVFtuHIuRDLTRik9OrTRz9bi6caK_OhsF2JGF-DueLMZjaeIlzTjCiOyKyElAl=h310",
        "//lh3.googleusercontent.com/B-Y35nyjda1OOD_Qk1nNgr6F_A7Ytjgc4QAtnky-y6_skR12IhSXe9Z53Ko398WMyc4=h310",
        "//lh3.googleusercontent.com/XAs6uajOX_oKDAPqef2F_6xGrM_EDdxcXK5yvABG05cp0PDGGb1ZsCH1TbW0pRJdN5E=h310",
        "//lh3.googleusercontent.com/9RmS68SaieCw10i4Ud1DvGuZol4HnGQyq9OsA7vQaGK0kUYiTpMmcsO-MlFePpb_Z0I=h310",
        "//lh3.googleusercontent.com/8TeByckZFjBVWzbk3VsegKY8qT6-l-4l4JXUnWS0AaO21YJrXCjk9YgvhHAWz6GlRA=h310",
        "//lh3.googleusercontent.com/-8bwYKPobHouLh8X-IrmLCYs_aK73BzT3-yX7SxmqzAftmJAyGYkf5-rXmsOs9Sf2hk=h310",
        "//lh3.googleusercontent.com/i9she4Zgd0UKQ3RiaKC5PXGqBYzefycqam2F2bE-W4JTo390P5ohFNXm-ELjXrp9eA=h310",
        "//lh3.googleusercontent.com/XMs7SS2XD9l7fJnrleguNKW9FtxoW_h2ooDc-NWkdYMZv9kNj8CqyzuhbOcil4Hpaq_f=h310",
        "//lh3.googleusercontent.com/IJgks1Rr53FjjW0LCSbDuunMz9AXKXGu5MOjfIA0HZksG-AHzGjPiybV8ADwLqjt-A=h310",
        "//lh3.googleusercontent.com/6rvpmc7Y7ZZU_PRnTkrwl0g5P0cWxXCpYzoqNIC9qGddzS5xQJnb3JCIkv4niwjX71lK=h310",
        "//lh3.googleusercontent.com/mYLMdaJJmicAeP0QuLOZ1IWUIacwbVd210Ys_xRBK21ZZLiWNgxxma02TSJc-WK3kxg=h310",
        "//lh3.googleusercontent.com/PSic4hE_oiKqH_u-yR6u10mO9mrZHxtlO7vMr4q6YzYFQAq6WtPnZNOi5r6DxM5hqpk=h310"
    ],
    "comments": [
        "It's a useless app. You have to specify everything and it only says \"not found\", doesnt give any alternatives or closest stations. It also doesn't let you browse without specifying the exact date and time.",
        "The website is pretty useful for booking train tickets but that's about it. This app is terrible though. I understand that train stations show information about trains, but when you're transferring and you've got 5 minutes to get on, a heads up on the platform would be great. The DB app does this, you should too (and not this dash to make it look like you'll show it, because you never do).  Also, actually update when a train is late. I'm currently on a train delayed 20 minutes but your app is telling me I'm fine, I'm not going to mess up my next 2 transfers, except I am, and this app can't even tell me when any alternative trains will be.  So yeah, thanks for a terrible app.",
        "Mostly love it, but cancellation system/policy not great when you make a mistake and correct within 15 minutes.  Should be less rigid for frequent users.  Tried to correct via email, no luck.",
        "Used to be better than that: searching for a journey offers a predefined list of common train stations, but it never learns the ones you often search for. The keyboard is not brought up when searching for a station, another tap is always needed to bring it up. Now, there are no ways to look for a journey, and save it without having an account or buying that ticket.",
        "Great app for getting train tickets in the EU. I had a situation where a train ticket was cheaper in SNCF than here... Many times search gets \"server errors\"",
        "Tried to plan a trip from Saltburg to Lesce Bled. No results, at all. \"An error occured\"."
    ],
    "recentChanges": [
        "We put some new gifts under the tree! You can unwrap them now, we can’t wait to present them.",
        "Sprucing up the sleigh",
        "Connect to WiFi on SNCF TGVs with the tap of a finger on your screen. Time flies like reindeer when you’re having fun.",
        "Pining for more",
        "There are new coaches and trains in the search results. We’ve added a flurry of shuttles to get you between stations and airports, notably in Paris and Rome. Our gift of forgiveness for those who are flying for the holidays this year."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.capitainetrain.android&hl=en&gl=us",
    "appId": "com.capitainetrain.android"
}