{
    "title": "Weight Watchers Mobile",
    "summary": "Stay in control and make smart and satisfying food choices anytime &amp; anywhere.",
    "icon": "//lh3.googleusercontent.com/ntqX5Pbz-fSYomkxEXtD0Mda-3BBsByKtplRBbK_YHfdtgRICxT-YXMl08EgAPzvNQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.1,
    "reviews": 225233,
    "developer": "Weight Watchers International, Inc.",
    "developerId": "Weight+Watchers+International,+Inc.",
    "developerEmail": "mobile@weightwatchers.com",
    "developerWebsite": "http://www.weightwatchers.com",
    "developerAddress": "Weight Watchers International\n675 Avenue of the Americas, 6th Floor\nNew York, NY 10010",
    "updated": "February 26, 2018",
    "version": "6.4.0",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "With our easy-to-use Weight Watchers app, you’ll always have access to the amazing features we offer including thousands of delicious recipes, tools to help monitor and meet your weight-loss goals, and the support you need each step of the way.With your Weight Watchers subscription, you can: • Post pics or videos sharing your victories, and get your daily dose of inspiration and positivity on our exclusive social community, Connect• Discover recipes, browse restaurants, and see how many days you were in the Healthy Eating Zone on our updated My Day screen• Easily track your weight and earn badges for your progress• Quickly track multiple items from Search, Frequents, and My Foods• Sync with fitness trackers to convert your daily steps into FitPoints, our measurement for activityDownload the app today so you can start focusing on what truly matters—enjoying satisfying, delicious food and living the life you love!",
    "descriptionHTML": "With our easy-to-use Weight Watchers app, you&#x2019;ll always have access to the amazing features we offer including thousands of delicious recipes, tools to help monitor and meet your weight-loss goals, and the support you need each step of the way.<br><br>With your Weight Watchers subscription, you can: <br><br>&#x2022; Post pics or videos sharing your victories, and get your daily dose of inspiration and positivity on our exclusive social community, Connect<br>&#x2022; Discover recipes, browse restaurants, and see how many days you were in the Healthy Eating Zone on our updated My Day screen<br>&#x2022; Easily track your weight and earn badges for your progress<br>&#x2022; Quickly track multiple items from Search, Frequents, and My Foods<br>&#x2022; Sync with fitness trackers to convert your daily steps into FitPoints, our measurement for activity<br><br>Download the app today so you can start focusing on what truly matters&#x2014;enjoying satisfying, delicious food and living the life you love!",
    "histogram": {
        "1": 17576,
        "2": 8447,
        "3": 16145,
        "4": 64857,
        "5": 118208
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/jaNAQuzT7ofshok_uvVGakH36mB5t76yjFJnPa8ey4ltDfO3nwj7A9m8MwNIy-EqHJY=h310",
        "//lh3.googleusercontent.com/jxY1yV_pVI2kqolLw9dudZJVolyF9-p0cVLe61Da7Iht_8YUSUq5fZLMJ_k14Hkt7Q=h310",
        "//lh3.googleusercontent.com/FNzM9yHNhch3fspdT9yMHqSU0BfxbaMTV_D5XwXl2BfS1ZK0ry2LaLmWQiIqNsM5gII=h310",
        "//lh3.googleusercontent.com/t0XGjcL1bZJpvFlPrAHqE9krofBAxP101I0gyuTKpTEIEaBeXpJBMVaSJNae9NGDnQ=h310",
        "//lh3.googleusercontent.com/_LHA7HJ5dlWSwZGg4j18UoITDeu7IIOWx2cTwjM-K2XjToQdIeIQ57Bn90sHo7BOFC-_=h310"
    ],
    "comments": [
        "I think there is lots of room to make this app even better. It would be nice to reshare photos from other Connect Users. Also there are several bugs that need worked out. For instance I cannot scroll to the bottom of long threads without the page refreshing and taking me back to the top of the page. There are other little bugs also. Fix these things and i will change my review to 5 stars. It could easily be a 5 star app if you would make it more user friendly. There are lots of great things about the app. It just needs to be better.",
        "Edit.... would live if WW came up with a way to remind busy Moms to track their food!      Joining Weight Watchers was the best decision I've ever made. The app makes meal planning super easy, and going out to eat easy too. I love WW connect where I can find people that are going through the same things I am. Everyone is super encouraging. Love Weight Watchers!",
        "Update on 2/26/18. All the bugs that drove me crazy in 2015 are gone. After being away for a time, I returned last month. This app is great. Syncs flawlessly with fitbit. Connect is fun. Best thing for me. All my data going back in time is all still here. I now rate you 5 stars!   Update 12/9 this was my switch day. Nice surprise. It works. But ... All the foods I created myself need to be done again..Update 12/8: the mobile app is back for now. My switch over day is Thursday. I do like the exercise tracking. Much better. Sunday, 12/6: The mobile app is offline again. Since this is the big switchover day, about what I expected. I wish there had been more transparency and communication during this change over.",
        "Great app so far. Love the zero smart point options for added freedom. My only problem is that I accidentally set me profile up in metric and now cannot change it into imperial. So now I have to convert my weight into kilograms every time I weigh in. There should be an option to switch after setting. If there is can someone please tell me how!",
        "I am fed up with WW for this insanely frustrating app. I have attempted to use it since Dec 2012. It works intermittently and this last update is the worst. As others have reported, it does not detect my internet connection, therefore I am unable to edit my entries. I am about to quit WW and move to a more reliable tracking method.",
        "I love how easy it is to track what I eat, whether by scanning a food, searching the database, building my own recipe, or inserting the data from the food label.  It's quick, takes no thought, and you can mark your favorites to make it even easier in the future. The info is straight forward and helps me stay on track.  And I especially love the Connect forum because it is uplifting and really helps motivate me by seeing the before and after stories and pictures.   Only thing I would change is the addition of being able to scan a food when building a recipe."
    ],
    "recentChanges": [
        "Bug fixes and ongoing improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.weightwatchers.mobile&hl=en&gl=us",
    "appId": "com.weightwatchers.mobile"
}