{
    "title": "Jigsaw puzzles, coloring book",
    "summary": "Game pack for kids, memory, puzzle, jigsaw puzzles, all in one app. Play it!",
    "icon": "//lh3.googleusercontent.com/ELLi_dpzWCJ2g9mPNKctVv37WFf4MSnx7nSTJ_KCRu2YwkcGeDIXGWA9N4aorD_WH2E0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 1301,
    "developer": "GoodSoftTech",
    "developerId": "7462972767592454430",
    "developerEmail": "goodsofttech@gmail.com",
    "developerWebsite": "http://www.goodsofttech.com",
    "developerAddress": "Sikorskiego 30/43\n40-282 Katowice\nPolska",
    "updated": "November 10, 2017",
    "version": "2017.11.07",
    "genre": "Educational",
    "genreId": "GAME_EDUCATIONAL",
    "familyGenre": "Brain Games",
    "familyGenreId": "FAMILY_BRAINGAMES",
    "description": "Free kids' game that actually has five games in one app! Your kids can play the following:- Jigsaw puzzles- Connect the dots- Coloring pages- Memory- Connect pairsAre you looking for a great free coloring book game for kids? Maybe your kids love jigsaw puzzles? Or maybe you are interested in a free memory game for kids? You can finally stop looking, because jigsaw puzzles, memory, coloring book is a free game for kids that has all of the above! Embark on a journey with our sweet Clownfish Bob, who will help your kids develop many different skills in a fun and creative way! Bob invites kids to his underwater world, where each player can play a variety of mini-games that amuse and teach new skills to both toddlers and school kids! Try, for example, free coloring books, during which the child must remember the colors of the original image, and then carefully paint it as it was. Or try playing free Memory game with two levels of difficulty - for younger and older children? We also recommend interesting jigsaw puzzles that will help your kids develop hand-eye coordination!Our free kids game is one of the best free educational apps for kids of all ages! Puzzles, memory or coloring are just some mini-games included in this kids' game. They are ideal for toddlers, preschoolers and school-age children.The variety of game modes make that your child will have enjoyed for a long time!Best educational features:- Colorful, detailed pictures- Easier start in school thanks to this app- Chance to learn English- Interesting tasks- Challenging difficulty levels- Fully interactive background- The chance to develop many skills at onceWith multiple game modes, the kids will be able to practice their manual skills and creativity. Moreover, thanks to a multi-colored drawings, they can develop their imagination. All the mini-games aim at developing the skills of logical thinking, perception and eye-hand coordination, which is an ideal introduction to learning  how to write! Jigsaw puzzles, memory, coloring book is an application that helps kids develop concentration and imagination, as well as a great topic to talk with your child about shapes, colors and animals! At the same time, children can work on and develop language skills. And most importantly, it gives your kids confidence in their own strengths and skills!https://www.facebook.com/pages/Kids-Coloring/1489911931226963?ref=bookmarkshttps://plus.google.com/114293037815350905016/postswww.goodsofttech.com",
    "descriptionHTML": "Free kids&apos; game that actually has five games in one app! Your kids can play the following:<br>- Jigsaw puzzles<br>- Connect the dots<br>- Coloring pages<br>- Memory<br>- Connect pairs<br><br>Are you looking for a great free coloring book game for kids? Maybe your kids love jigsaw puzzles? Or maybe you are interested in a free memory game for kids? You can finally stop looking, because jigsaw puzzles, memory, coloring book is a free game for kids that has all of the above! <br>Embark on a journey with our sweet Clownfish Bob, who will help your kids develop many different skills in a fun and creative way! Bob invites kids to his underwater world, where each player can play a variety of mini-games that amuse and teach new skills to both toddlers and school kids! Try, for example, free coloring books, during which the child must remember the colors of the original image, and then carefully paint it as it was. Or try playing free Memory game with two levels of difficulty - for younger and older children? We also recommend interesting jigsaw puzzles that will help your kids develop hand-eye coordination!<br><br>Our free kids game is one of the best free educational apps for kids of all ages! Puzzles, memory or coloring are just some mini-games included in this kids&apos; game. They are ideal for toddlers, preschoolers and school-age children.The variety of game modes make that your child will have enjoyed for a long time!<br><br>Best educational features:<br>- Colorful, detailed pictures<br>- Easier start in school thanks to this app<br>- Chance to learn English<br>- Interesting tasks<br>- Challenging difficulty levels<br>- Fully interactive background<br>- The chance to develop many skills at once<br><br>With multiple game modes, the kids will be able to practice their manual skills and creativity. Moreover, thanks to a multi-colored drawings, they can develop their imagination. All the mini-games aim at developing the skills of logical thinking, perception and eye-hand coordination, which is an ideal introduction to learning  how to write! Jigsaw puzzles, memory, coloring book is an application that helps kids develop concentration and imagination, as well as a great topic to talk with your child about shapes, colors and animals! At the same time, children can work on and develop language skills. And most importantly, it gives your kids confidence in their own strengths and skills!<br>https://www.facebook.com/pages/Kids-Coloring/1489911931226963?ref=bookmarks<br>https://plus.google.com/114293037815350905016/posts<br>www.goodsofttech.com",
    "histogram": {
        "1": 39,
        "2": 12,
        "3": 133,
        "4": 431,
        "5": 686
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/V5wqqiCH6XzVWfufSPw-rZxXA3JkkVstXiYFxXVXKxXOqpUS8wSqyRzNWB1maxdPaWtY=h310",
        "//lh3.googleusercontent.com/U3CrYbGfGkQfbSOqb11G0GwOUA_cc4QSKQXF-IBHUnqRL_mQzlwzd1aulYgB4SaPXQ=h310",
        "//lh3.googleusercontent.com/_2SsiPqx53nxwsAk-2C4EqQGn_4YKAfF7r__0Zs2krQ42VNvzf056JpsTnWuX6aoGRc=h310",
        "//lh3.googleusercontent.com/LlzqAgE2PMIgwTS17XMmrMfQtwV-BftfozxAmqw-a4ORP11RRLv2r8_Z7g-XthEQUWs=h310",
        "//lh3.googleusercontent.com/Mg-AbiMjBMJa63ZPARKTfKKfEU1BGIyk5aIJyUho3cUdDRows7XI7PFuIIpP6qNh9EWP=h310",
        "//lh3.googleusercontent.com/dsIP9jc22TDZan6lGGEg8c3zb7gvpvMDw6zOVdhzA98Q6P20HElVzyCCqQPlHVERMA=h310",
        "//lh3.googleusercontent.com/HirpnF2WvGhYzQbPQ7v27Eyuf9rR0HC3dNhrfzQvo3Gi9ExofEUqhZfy1Gtlp_1Mug=h310",
        "//lh3.googleusercontent.com/N1HKfKwzlCuIN_eaH1_I0In2MBuLa2emqDDtHdsQKzgjSnFkj88dQidE-6OqEjXNOF8=h310",
        "//lh3.googleusercontent.com/zj42UdhZgU7ow_zEKbg891nkjUpn8e_70_oaod9DSxXIyNyKOA-n81YWOm36X1bKuw=h310",
        "//lh3.googleusercontent.com/ioXuA3lYQOQabcvUsQSXbaGU3LOFt8t2ZuA218ypuLbqFeRIxXrotHfoMDRcT9iJ5rsV=h310",
        "//lh3.googleusercontent.com/QxCATwLnb07x8VqdJ0ThqrXuG7pVygpGO_DVMVcVCUvI7cy0dXrua8j8NHt0VmwlJsI1=h310",
        "//lh3.googleusercontent.com/TBzydnCC-IPTy840NlRYj91umNQKXN2t1sgBpopzFR6Hg-0RVUnyosQZamh1YW8RFRZV=h310",
        "//lh3.googleusercontent.com/yr4E4oXvxAyQm3xl1s8cp4T2-9B4o-EIp1liI1g97ANiqZ744l71cdA8QI2-C5wF77Qx=h310",
        "//lh3.googleusercontent.com/LoJzHugSX0SawGRPnIM48Xpl1Y_AJGwMn6uovF8ecXqnOgnfqzs4j_3LRuvICL0tv8I=h310",
        "//lh3.googleusercontent.com/oRCJRUKYSD3ojmG0x9K-1WBxiCup3LlkXHDoc4KaGEu0hPFi27ELHQCcJY0zRyxpANlH=h310"
    ],
    "comments": [
        "My 2 year old likes to play this",
        "My 4 year old and my 2 year old grandsons like it.",
        "My son is always on this game especially jigsaws",
        "Really nice theme. Good fun.",
        "Great fun for the little one",
        "Fun formthe kids"
    ],
    "recentChanges": [
        "- upgraded engine to never version",
        "- fixed random defects"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.goodsofttech.puzzles&hl=en&gl=us",
    "appId": "com.goodsofttech.puzzles"
}