{
    "title": "Android Wear - Smartwatch",
    "summary": "Android Wear - Smartwatch",
    "icon": "//lh3.googleusercontent.com/b9A4Jrdrt85T8sQBpjUqJLVkj3pWyN7Si22H0rEYE0DDjmVyB3AVce1DMHBnWjLi4hQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 3.6,
    "reviews": 102802,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "apps-help@google.com",
    "developerWebsite": "http://support.google.com/androidwear",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "February 26, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Download this app to connect your Android Wear smartwatch with your Android phone. Android Wear watches let you:       • Choose from thousands of watch faces to express your style. Personalize your watch face with what matters to you: your steps, schedule, stock, or more.       • Check important info like who’s calling, SMS and messages, and alerts from your favorite apps. You can even speak, handwrite, type, use Smart Reply, or draw a quick response right from your watch.       • Get built-in fitness monitoring and coaching from your favorite running and fitness apps: Google Fit, Runkeeper, Runtastic, Strava, and more. Track your walks, runs, or rides, get coaching for strength training, listen to music, and even measure your heart rate (on supported watches).       • Android Wear watches have the Google Assistant* built-in. Ask it questions. Tell it to do things. It's your own personal Google. Just hold the power button or say \"Ok Google\" to get help from your Assistant.       • Download and use Android Wear apps like Google Maps, Uber, Foursquare, Google Play Music, WhatsApp, and thousands more of your favorite apps right on your watch.       • Express your style with watches like ASUS ZenWatch, Fossil Q Wander, Huawei Watch, LG Watch Style and Sport, Michael Kors Access, Moto 360, Nixon Mission, Polar M600, TAG Heuer Connected and more.       Learn more about Android Wear: https://www.android.com/wear       Buy an Android Wear watch: https://amazon.com/androidwear       For support: https://productforums.google.com/forum/#!forum/android-wear       *Google Assistant is not available in all languages.",
    "descriptionHTML": "Download this app to connect your Android Wear smartwatch with your Android phone. Android Wear watches let you:<br><br>       &#x2022; Choose from thousands of watch faces to express your style. Personalize your watch face with what matters to you: your steps, schedule, stock, or more.<br>       &#x2022; Check important info like who&#x2019;s calling, SMS and messages, and alerts from your favorite apps. You can even speak, handwrite, type, use Smart Reply, or draw a quick response right from your watch.<br>       &#x2022; Get built-in fitness monitoring and coaching from your favorite running and fitness apps: Google Fit, Runkeeper, Runtastic, Strava, and more. Track your walks, runs, or rides, get coaching for strength training, listen to music, and even measure your heart rate (on supported watches).<br>       &#x2022; Android Wear watches have the Google Assistant* built-in. Ask it questions. Tell it to do things. It&apos;s your own personal Google. Just hold the power button or say &quot;Ok Google&quot; to get help from your Assistant.<br>       &#x2022; Download and use Android Wear apps like Google Maps, Uber, Foursquare, Google Play Music, WhatsApp, and thousands more of your favorite apps right on your watch.<br>       &#x2022; Express your style with watches like ASUS ZenWatch, Fossil Q Wander, Huawei Watch, LG Watch Style and Sport, Michael Kors Access, Moto 360, Nixon Mission, Polar M600, TAG Heuer Connected and more.<br><br>       Learn more about Android Wear: https://www.android.com/wear<br>       Buy an Android Wear watch: https://amazon.com/androidwear<br>       For support: https://productforums.google.com/forum/#!forum/android-wear<br>       *Google Assistant is not available in all languages.",
    "histogram": {
        "1": 21344,
        "2": 6216,
        "3": 8835,
        "4": 17987,
        "5": 48420
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/WoAOOeD-DrpPfZ4U9yBEf7AO08wazN5Z3jaiLOKmVDtDxVisYCm-1Yja8gF69vNCxqg=h310",
        "//lh3.googleusercontent.com/DA4MhVHgVmf_2iKpyw6sln8uG6TX2VVpd-5dDSIFhB6PPUE9qnmEM1AmWmaJdbnprg=h310",
        "//lh3.googleusercontent.com/TH5HrTP9v2cjTTWzbdrKFU0qUjul2p0dA8ypDmbatJ_MktMkBNVZEXO0ofU9yIcYAQ=h310",
        "//lh3.googleusercontent.com/kVKrSv8vdVhHx_VMmq0FvnQ2cfVCrw8NqvvBNr0iTHPl34v2mXdmRSSCaUN7gRS-YbQ=h310",
        "//lh3.googleusercontent.com/aZjK7Qu0FlALNKRWitgUICRf1pJl8ar9ENyTuaLPthX0M4I8cON1dM1DOlfvOs1b55w=h310",
        "//lh3.googleusercontent.com/bMJo6H-XKkZfYWDR4oxzrshd64myNg0Ya35NDLvgblI5pAfSg-L5zHaWdp0wxcPrtSk=h310",
        "//lh3.googleusercontent.com/O-2MWQHU5lehkOLE6BMTsUoMthyXS-GUydhnky5Jh-htNXcU_oxN6va1znMC4ghpLFk=h310",
        "//lh3.googleusercontent.com/KgAlM3AmTOcrq9tMThgS9cRXTwkcG5nDCiCs8EeC0JF0qEfsCsLKx8VlsCKUccfOzlY=h310",
        "//lh3.googleusercontent.com/elokPQeA3eJv5I2FLbNydM9fAj-KtmKgzX5fnL0zgeFtz6C9IJT6nRRrqrFOSWBcrhA=h310",
        "//lh3.googleusercontent.com/I8eUivtw5CXg_U97dPs9X67PIQxB9QgEyw3gyT46Qqyc7HGh4dt6MIAesXm2FXxv1rUG=h310",
        "//lh3.googleusercontent.com/_ryhSTRv_M9o_u9ywINyuWiGb1YKTwnRfbUa0jNS6DVW-eb9qQySQYRrIO4YXXZ_F3w=h310",
        "//lh3.googleusercontent.com/GnhBPU12b-XpAJBnAkhV_0v-4hxRrl_HJWJ_laMNMi0pm18piaDfmZ1xHTPPcmYA1w=h310",
        "//lh3.googleusercontent.com/2KFFn2AWt-Tqv-q_SXVYBt5T5kU7vYZeS38YXkJ2wwZO1_e7NVtgdoEfGpXlF46Ohh4=h310",
        "//lh3.googleusercontent.com/engsIT3XNvvd3Iq0Gi5KVpcqfb95MxEQtRPkJiJf6y47xnlJpl8o4q7DEeytQoFEV-Q=h310"
    ],
    "video": "https://www.youtube.com/embed/qlTGwPIOz0Y",
    "comments": [
        "STILL NO FIX for the messaging bug, when I have this app installed notifications pop for half a second then disappear. So then I have no idea that I've received messages. This has been an issue for several updates, and this review gets buried as old. This is still an issue, I have to delete this app every time I plan to go without my watch. Making me use my watch less than I'd like.",
        "98% happy with this app, except for the \"always on\" media notifications on the watch.    When I'm playing music on my phone (which is most of the time) my watch lights up and displays media controls and stays on until I notice it and dismiss it.  This really eats through my precious battery life.",
        "It has been more than 3 years I had this watch. Today it dies out. Good times. Will I buy another android wear? No. Got too much devices to charge. Back to old reliable edifice. 3 years and still running out of the box. My 2015 moto 360 had a good run 👍",
        "My phone recognizes and connects to my watch after this app updated. This app doesn't do either. Phone bluetooth says smartwatch connected- this app doesn't even see it. Their resolution? Reset the phone to factory settings! *insert swearword here* NOT HAPPY",
        "The most important feature of android wear for me is the ability to receive text notifications on my watch, and that is the one thing it can not do. After each update the problem gets worse, I no longer receive any text messages on my watch. Phone calls, calendar events, and email notifications all work fine, but no texts. If you are considering an android wearable, and receiving text notifications is an imoortant feature to you, I suggest holding off on your putchase to see if google can straighten out this issue. I have 3 android wear watches and this issue is consistent for all 3. Very disappointed google can't fix this.",
        "Connectivity is a serious issue. As thousands of other people, I have a problem with bluetooth internet sharing (for Android Wear smartwatch) disconnecting without reason. It's a shame that Google's app should underperform like this and that no reaction or suggestion how to solve this problem has been given by Google."
    ],
    "recentChanges": [
        "Improved notification glanceability",
        "• New layout shows more of your message at a glance",
        "• Darker background means better readability"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.wearable.app&hl=en&gl=us",
    "appId": "com.google.android.wearable.app"
}