{
    "title": "FitIt Wear Pro for FitBit®",
    "summary": "Ultimate Android Widget for Fitbit SURGE, CHARGE HR, CHARGE, FLEX and more.",
    "icon": "//lh3.ggpht.com/OF2QfOgQBP_NkRliw5Xgjn4JMKeKknA4bLV4K_f6VO_4lvEImAtLHVhUNX2LYX7Ipg=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 2.5,
    "reviews": 16,
    "developer": "Mountain Edge Inc",
    "developerId": "Mountain+Edge+Inc",
    "developerEmail": "mountainedgeinc@gmail.com",
    "developerWebsite": "http://www.mountainedge.com",
    "developerAddress": "820 Saddleback PL NE\nLeesburg, VA USA  20176",
    "updated": "November 25, 2014",
    "version": "1.0.1",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "FitIt Wear Pro widget is built on top of our popular FitIt Pro widget.  You have all the widgets on your Home screen plus now you can have notifications on your Android Wear smartwatch to display your progress. The ultimate widget for FitBit android users to keep track of progress in the Home screen.   You can place 12 different resizable widgets (between 4x1, 3x1 and 2x1) in the Home screen.   Tap on a widget; then it will launch the FitBit application to easily access your activities and calories. (Tapping the main \"FitIt Pro\" widget  still displays the Settings for options and colors.)  You can also personalize the widgets with your favorite color.  You have 20 color themes to choose from (Default, Antique, Cadet Blue, Coral, Corn Silk, Dark Olive, Fire Brick, Golden Rod, Hot Pink, Indian Red, Ivory, Maroon, Orange, Orchid, Plum, Purple, Spring Green, Steel Blue, Turquoise and Tan).  On Android device: 1) FitIt Pro widget (Automatically rotates every 20 sec; tap this widget opens Settings) 2) Device widget (Displays the last sync, alarm & battery status for tracker)   3) Steps widget 4) Distance widget 5) Calories burned widget 6) Sleep widget 7) Food Calories intake widget 8) Water consumption widget 9) Active Minutes widget10) Weight widget11) Floors widget12) Scale widget (Displays the last sync, & battery status for scale)  On Android Wear:Data- Device and battery- Steps- Distance- Calories burned- Active minutes- Water consumption- FloorsInstallation setup: FitIt-Pro is a set of Widgets.  You will find 11 widgets under App/Widget tray after purchasing from Google Play.  (tap on \"App\" button from Home screen and select 'WIDGETS' tab).   Drag & drop one of FitIt Pro widgets on Home screen will initiate the installation process.   Please follow the instruction.Once linked, then your Fitbit data will be shown as notifications in your Android Wear smartwatch. Recommendation:- We recommend to have a good internet data connection at initial setup.  FitIt-Pro Widget may experience timeout due to poor connection and results to an incomplete setup.  If happens, then uninstall the FitIt-Pro Widget from Settings->Apps and wait few minutes before download the widget from Google Play.Note:  Some Android device manufactures modify the Home Screen so the widget tray may be hidden and hard to find.  Please consult your device's user guide for widgets.Note: If you don't see the FitIt Pro widget after installation, please uninstall and reinstall again.  Some devices, most notably Samsung devices, fail to register the FitIt widget at the first time.  It needs to be reinstalled to recognize the widgets.Disclaimer:No warranty is expressed or implied that the application or its author is liable in any manner for any direct, incidental, indirect or punitive damages arising out of your access, use or inability to use this application, or any errors or omissions in this information on this application.  Author shall not be liable to you or to any other third party for any additional, modification, suspension or discontinuance of the application.",
    "descriptionHTML": "FitIt Wear Pro widget is built on top of our popular FitIt Pro widget.  You have all the widgets on your Home screen plus now you can have notifications on your Android Wear smartwatch to display your progress.<br> <br>The ultimate widget for FitBit android users to keep track of progress in the Home screen.   You can place 12 different resizable widgets (between 4x1, 3x1 and 2x1) in the Home screen.   Tap on a widget; then it will launch the FitBit application to easily access your activities and calories. (Tapping the main &quot;FitIt Pro&quot; widget  still displays the Settings for options and colors.)  You can also personalize the widgets with your favorite color.  You have 20 color themes to choose from (Default, Antique, Cadet Blue, Coral, Corn Silk, Dark Olive, Fire Brick, Golden Rod, Hot Pink, Indian Red, Ivory, Maroon, Orange, Orchid, Plum, Purple, Spring Green, Steel Blue, Turquoise and Tan).  <br><br>On Android device:<br> 1) FitIt Pro widget (Automatically rotates every 20 sec; tap this widget opens Settings)<br> 2) Device widget (Displays the last sync, alarm &amp; battery status for tracker)  <br> 3) Steps widget<br> 4) Distance widget<br> 5) Calories burned widget<br> 6) Sleep widget<br> 7) Food Calories intake widget<br> 8) Water consumption widget<br> 9) Active Minutes widget<br>10) Weight widget<br>11) Floors widget<br>12) Scale widget (Displays the last sync, &amp; battery status for scale)  <br><br>On Android Wear:<br>Data<br>- Device and battery<br>- Steps<br>- Distance<br>- Calories burned<br>- Active minutes<br>- Water consumption<br>- Floors<br><br>Installation setup: <br>FitIt-Pro is a set of Widgets.  You will find 11 widgets under App/Widget tray after purchasing from Google Play.  (tap on &quot;App&quot; button from Home screen and select &apos;WIDGETS&apos; tab).   Drag &amp; drop one of FitIt Pro widgets on Home screen will initiate the installation process.   Please follow the instruction.<br><br>Once linked, then your Fitbit data will be shown as notifications in your Android Wear smartwatch. <br><br>Recommendation:<br>- We recommend to have a good internet data connection at initial setup.  FitIt-Pro Widget may experience timeout due to poor connection and results to an incomplete setup.  If happens, then uninstall the FitIt-Pro Widget from Settings-&gt;Apps and wait few minutes before download the widget from Google Play.<br><br>Note:  Some Android device manufactures modify the Home Screen so the widget tray may be hidden and hard to find.  Please consult your device&apos;s user guide for widgets.<br><br>Note: If you don&apos;t see the FitIt Pro widget after installation, please uninstall and reinstall again.  Some devices, most notably Samsung devices, fail to register the FitIt widget at the first time.  It needs to be reinstalled to recognize the widgets.<br><br>Disclaimer:<br>No warranty is expressed or implied that the application or its author is liable in any manner for any direct, incidental, indirect or punitive damages arising out of your access, use or inability to use this application, or any errors or omissions in this information on this application.  Author shall not be liable to you or to any other third party for any additional, modification, suspension or discontinuance of the application.",
    "histogram": {
        "1": 7,
        "2": 1,
        "3": 3,
        "4": 3,
        "5": 2
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/qWCLUNRMN1a5lVr2LtMNq7YnkltJ5_mN-Xb8HNG_QCPPGTLEFklY2Bcoy_-_DnDu4mLA=h310",
        "//lh4.ggpht.com/CKx3GuuOnBmXu4vZbbHyMjGOamkgDpjsdsdXEPnpnBEU4iIUBa-fCkL7wCbvjWUftfY=h310",
        "//lh6.ggpht.com/AaR54j1iIJrhFhDk_13ToddoMWoaKaxFdcT4CpNaymT4QtygtlYx9jdRnzuHdLsvFJQ=h310",
        "//lh3.ggpht.com/1_Z5Q23VobKwvE-gCc0Mzc0wouOhacjXs4Y0D-VDsYO9hRdsTGNksMtDbmaN4yy4WWk=h310",
        "//lh4.ggpht.com/rRvV2ABy1ur8EQQ0bhqbPCsrYsny53scwKQ41f8p6_0KulWc5tIcLq6y9540OMS9cg=h310",
        "//lh3.ggpht.com/oXz3e6Yz7d3Klg79MJpCdGlzaUCdyXlXQ8MTLajSCXWRJVfyZiBoIIUc4fR1mbJjAKzI=h310",
        "//lh3.ggpht.com/u_o9LjFSFg8hJGSHP6sb_B88AYaFwkZI1U9CzHbmSXN55OiQRAaD7i7v23qznzKtVyA=h310",
        "//lh3.ggpht.com/CKwlFuMkndRTZGbpjWY7Zyc-NiV2PnUGHSMO0hwkKydnW2sHDDkq_YiWbORfqjskSQ=h310"
    ],
    "comments": [
        "Widget bars cut off on bottom. Nice to have more Fitbit notification options on my Zenwatch but all of the single bar widgets are missing the bottom 25% of the bar on my Note 3 so I can't see all of the info being tracked. May have to uninstall... when I run I need to be able to simply raise my Zenwatch & see my steps.  All I can see is \"FitIt\"... not convenient to use other hand. Also it's a bit of a kludge to only be able to reach the Settings window by tapping the main, rotating, multi-bar widget. Why not from the main \"Install\" icon?",
        "Crashing This app worked flawlessly for some months. Since last week it crashes permanently, every few seconds, leaving Android to state: \"Unfortunately, FitIt Wear Pro for FitBit® has stopped.\" It's updated. So is the FitBit app, which shouldn't really matter anyway. I reconnected it to the FitBit webapp, giving the proper pin. It then actually displays correct data in the 4x2 widget. But it still keeps crashing. Using Samsung Galaxy S5 Android 4.4 and LG G watch Android 5.1.1.",
        "Crashes constantly I was interested in the ability of syncing my Flex to my watch but this software does not work. It crashes ever time it updates. Please rework.",
        "So in order to see my current step count on my watch I have to open the app on my phone which then opens the official fitbit app which shows me my steps which updates the app which shows me my steps which then allows me to see my steps on my watch?????",
        "Bad on Moto 360 Doesn't communicate with my watch and has a lot of \"pop up\" messages on my watch and phone.",
        "Force Close It used to work great.  Now it just force closes every time it opens"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mountainedge.fititprowear&hl=en&gl=us",
    "appId": "com.mountainedge.fititprowear"
}