{
    "title": "Text Me - Free Texting & Calls",
    "summary": "Free texting (SMS) to US, Canada &amp; more. Free new number. Call free &amp; Text free.",
    "icon": "//lh3.googleusercontent.com/b2iCTI8USYqSmy_W6cCnXlo40nsXQqn7zKssV9AhMJqT7Fnq2wdRAlTQQ2O81QwN2_s=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.2,
    "reviews": 331032,
    "developer": "TextMe, Inc.",
    "developerId": "7744106960263623416",
    "developerEmail": "feedback@go-text.me",
    "developerWebsite": "http://www.go-text.me",
    "developerAddress": "275 Post St #500\nSan Francisco, CA 94108",
    "updated": "February 14, 2018",
    "version": "Varies with device",
    "genre": "Social",
    "genreId": "SOCIAL",
    "size": "Varies with device",
    "description": "Free Texting (real SMS) to ANY number in the US, Canada and 40 countries.Free HD Voice & Video Calls between Android and all other platforms.Enjoy your Own New phone number for Free Calling and Messaging!Turn your Android Tablet into a Phone! TextMe is a cross-platform messaging application that allows you to send unlimited texts (SMS) messages and pictures to any phone number in United States, Canada, Mexico and 40 countries in the World for FREE.   Messaging and calling your friends has never been easier! Join your friends on TextMe and enjoy free Calls, free Text Messaging, free Video Calling and Group Chatting across Android and all other platforms.  Sign up today and share TextMe with your friends to start a call, a text or a video chat for free. This free messaging & calling app is a must for any social networking guru.    WITH TEXTME YOU CAN:Send Texts (real SMS messages) to any number FOR FREE from your Android Phone or Android Tablet- Free texting in the United States, Canada, Mexico and 40 other countries worldwide- Send SMS text messages to 200 countries using your credits!Phone Calls (Voice calls) around the world- Call ANY number in the US, Canada, the UK & 200 countries in the world- Receiving calls on your Textme number is free - Wifi calling: connect to wifi to talk for free, anywhere Free Among TextMe users- Free Phone Number: Get your own free TextMe phone number- Free HD Voice & Video Calling to other TextMe users- Sending texts or calls to your TextMe friends is free. No credits needed!Delete private texts and messages- Private messages: delete any text after it was sent or received- Burner Phone: Private second number to text & callGroup chat & text- Find your friends on TextMe and Text, Call & Video Chat for free - Share GPS coordinates with friends Send & Receive pictures, videos, voice messages & files with MMS- Share photos or files to any device via MMS- Send video from YouTube - Dropbox connectivity: Large document? Share it using your Dropbox accountEmoji & Sticker - Share stickers, emoticons, smileys! Express yourself with an emoji!- Earn credits by watching videos to access emoticons on your emoji keyboard Watch videos & earn credits for free calling or texting to any telephone number in:US, Canada, Europe, India & More! More TextMe goodies:- Enhanced speed & performance for Android- Simple sign up via Facebook & Google- Push Notifications: never miss an important text!- Free Voice messaging & texting- Full Android Wear support; get messages & reply directly from your wrist Find your friends on TextMe! Chat, Call & Video Chat for free! Unlock UNLIMITED Calls & Texts to the US & Canada for ONLY $2.99 per month! Details:- Monthly subscription for unlimited calling and texting (SMS) to US & Canada phone numbers for $2.99- Payment will be charged to your Google Play account at confirmation of purchase- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of your current period- Account will be charged for renewal within 24-hours prior to the end of the current period, at the purchase price listed above- You may manage your subscriptions and cancel by visiting \"Subscriptions\" page on Google Wallet- No cancellation of the current subscription is allowed during active subscription- Also see Terms & Conditions and Privacy Policy Thanks & please give us your feedback!  * Limitations apply:• Free SMS offer limited to US and Canada based users• Free Texting to Latin America subject to balanced inbound/outbound traffic fair usage policy• Calls and SMS to some carriers or some territories within the 200 countries may not be included in this offer• We do not Support 911• Subject to TextMe's Terms and Conditions Web: http://go-text.meTwitter: @textmeappHelp us improve TextMe & get support: http://support.go-text.me",
    "descriptionHTML": "Free Texting (real SMS) to ANY number in the US, Canada and 40 countries.<br>Free HD Voice &amp; Video Calls between Android and all other platforms.<br>Enjoy your Own New phone number for Free Calling and Messaging!<br>Turn your Android Tablet into a Phone!<br> <br>TextMe is a cross-platform messaging application that allows you to send unlimited texts (SMS) messages and pictures to any phone number in United States, Canada, Mexico and 40 countries in the World for FREE.  <br> <br>Messaging and calling your friends has never been easier! Join your friends on TextMe and enjoy free Calls, free Text Messaging, free Video Calling and Group Chatting across Android and all other platforms. <br> <br>Sign up today and share TextMe with your friends to start a call, a text or a video chat for free. This free messaging &amp; calling app is a must for any social networking guru.   <br> <br>WITH TEXTME YOU CAN:<br>Send Texts (real SMS messages) to any number FOR FREE from your Android Phone or Android Tablet<br>- Free texting in the United States, Canada, Mexico and 40 other countries worldwide<br>- Send SMS text messages to 200 countries using your credits!<br><br>Phone Calls (Voice calls) around the world<br>- Call ANY number in the US, Canada, the UK &amp; 200 countries in the world<br>- Receiving calls on your Textme number is free <br>- Wifi calling: connect to wifi to talk for free, anywhere <br><br>Free Among TextMe users<br>- Free Phone Number: Get your own free TextMe phone number<br>- Free HD Voice &amp; Video Calling to other TextMe users<br>- Sending texts or calls to your TextMe friends is free. No credits needed!<br><br>Delete private texts and messages<br>- Private messages: delete any text after it was sent or received<br>- Burner Phone: Private second number to text &amp; call<br><br>Group chat &amp; text<br>- Find your friends on TextMe and Text, Call &amp; Video Chat for free <br>- Share GPS coordinates with friends <br><br>Send &amp; Receive pictures, videos, voice messages &amp; files with MMS<br>- Share photos or files to any device via MMS<br>- Send video from YouTube <br>- Dropbox connectivity: Large document? Share it using your Dropbox account<br><br>Emoji &amp; Sticker <br>- Share stickers, emoticons, smileys! Express yourself with an emoji!<br>- Earn credits by watching videos to access emoticons on your emoji keyboard<br> <br>Watch videos &amp; earn credits for free calling or texting to any telephone number in:<br>US, Canada, Europe, India &amp; More!<br> <br>More TextMe goodies:<br>- Enhanced speed &amp; performance for Android<br>- Simple sign up via Facebook &amp; Google<br>- Push Notifications: never miss an important text!<br>- Free Voice messaging &amp; texting<br>- Full Android Wear support; get messages &amp; reply directly from your wrist<br> <br>Find your friends on TextMe! Chat, Call &amp; Video Chat for free!<br> <br>Unlock UNLIMITED Calls &amp; Texts to the US &amp; Canada for ONLY $2.99 per month! Details:<br>- Monthly subscription for unlimited calling and texting (SMS) to US &amp; Canada phone numbers for $2.99<br>- Payment will be charged to your Google Play account at confirmation of purchase<br>- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of your current period<br>- Account will be charged for renewal within 24-hours prior to the end of the current period, at the purchase price listed above<br>- You may manage your subscriptions and cancel by visiting &quot;Subscriptions&quot; page on Google Wallet<br>- No cancellation of the current subscription is allowed during active subscription<br>- Also see Terms &amp; Conditions and Privacy Policy<br> <br>Thanks &amp; please give us your feedback! <br> <br>* Limitations apply:<br>&#x2022; Free SMS offer limited to US and Canada based users<br>&#x2022; Free Texting to Latin America subject to balanced inbound/outbound traffic fair usage policy<br>&#x2022; Calls and SMS to some carriers or some territories within the 200 countries may not be included in this offer<br>&#x2022; We do not Support 911<br>&#x2022; Subject to TextMe&apos;s Terms and Conditions<br> <br>Web: http://go-text.me<br>Twitter: @textmeapp<br>Help us improve TextMe &amp; get support: http://support.go-text.me",
    "histogram": {
        "1": 23787,
        "2": 10524,
        "3": 30433,
        "4": 60766,
        "5": 205522
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/26KhOUXS7ggejb01NjLuXzd79FB-rV18V00LAaGfroJQbxgDhgk7SFKaFCH72IDehVz-=h310",
        "//lh3.googleusercontent.com/wcF4My4R3S-chLS8PTlGRrvRo4zgTDszjV0WyNwsp6vkvun3p2hh-zGQHk3tUAgFhGp6=h310",
        "//lh3.googleusercontent.com/JRz9DAtyEAjb9U_zE5CbbVigs0kNEnkocWoCVdl5aZ_AA_fz1lZ_ElEqRx_nU_askPg=h310",
        "//lh3.googleusercontent.com/O0Evv1U_aHM82nk_HWM8BQYm6Ore3WJFDX3nUMNKm5cHEvN3DwbYNPKzwAvaVg_P4w=h310",
        "//lh3.googleusercontent.com/afZU1cM5YeIybKdO_fy0lQCHjis10DcoVblmvt93uP78t1Agx8Sdpnxvv8WU73G81A07=h310",
        "//lh3.googleusercontent.com/3oQYK5XURR8SrHTo6CLXo8d-XCuw57YrNLvhzR1zDw8By0nExx0pMcQXCE0cMY5MC_o=h310",
        "//lh3.googleusercontent.com/k1-DY5L64GNiWWwfoGBHBbGcJHQu81OQUnzQbwOIDhKcDrgesiUgJ7FJ5DO9gmd58Q=h310",
        "//lh3.googleusercontent.com/fl-mfsbtN85T1Ou9YODYuQxN4tgwahTjtWq5jeOMLd65bsq_F-NBiCU6LkgJER8Tsg=h310"
    ],
    "comments": [
        "I like this app. Works very well if you need to receive a text from a service you're not sure about or have exceeded the usage limit with your own phone number. Take Outlook for example. I also hear you can use this to make calls and texts while only connected via the Internet so handy if you don't have cellular signal. Highly recommended.",
        "Really great app. I use it when I have no cell service but have Wi-Fi. Really really love it. It has problems opening up from time to time though, I'm not sure why. It's not a connection problem I would like to have this fixed, but it's no big deal most of the time. Still a really great app!",
        "Good app.  I use when overseas to have US number local #  I can be reached at. Doesn't cost anyone to call me.  Cost for me to call is cheap, pennies per minute.  This is one of the few VoIP that  do calls, texts, text  pictures, and is fast. AND works over cellular or wifi.    When in a foreign country I get cheap local sim card,  and the text me VoIP works over cellular 3/4g. Most don't.   I purchase my # and keep it as long as need .  If interface and ads were cleaner and totally removeable, id give it 5 stars. It still has offers showing, and isn't real clean.   For some reason, notifications don't always work when receive call or msg.  Also, it doesn't do group messages well at all. It sends out separate messages to each recipient.  On incoming, you can't see who else was on it and respond to them too. It will hang sending to multiple people if photo attached too, only first recipient goes out.      Fix these things and it would be awesome",
        "The app is decent but what blew me away was the customer service. I had to factory reset my phone (OS upgrade gone bad!) and couldn't remember my login info. I contacted them, explained the situation, and Apolline was super helpful in getting me re-connected. Thanks!!",
        "This app is awesome.   If you ever needed to make a phone call and have nothing but WiFi.  Here's an app that will call anyone with a number of your c hosing that's an area code of your choice including local.  I was in awe when I seen that it can make phone calls with my local area code as my area default.  That's pretty rare until now.",
        "With every update this gets buggier and worse to use but it's better than nothing.  Update: as this app develops they are trying to force you into paid features and the damn thing crashes 50% of the time that I send a text and sometimes I won't receive texts for a day or more."
    ],
    "recentChanges": [
        "📞 Easier access to the keypad, right from the bottom of the screen",
        "🐛 Fixes bugs and 🏎 Improves the performance of the app.",
        "🖋 Easily configure the signature attached to your SMS from the app settings screen.",
        "Let us know what you think!",
        "Our team works hard every day to improve your experience.",
        "📣 Have feedback? Shoot us an email at feedback@go-text.me",
        "🐞 If you have any issues, write us at support@go-text.me"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.textmeinc.textme&hl=en&gl=us",
    "appId": "com.textmeinc.textme"
}