{
    "title": "Smart IR Remote - AnyMote",
    "summary": "Remote Control for TVs and Home Electronics! #1 remote in 2013 to 2016!",
    "icon": "//lh3.googleusercontent.com/64lFP9fgp7JUH_3s8axYB5iz6v7OftqBhFsvcdqbpCF4MvJGQQRXDQn_8oWmakZp8A=w300",
    "price": "$6.99",
    "free": false,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.6,
    "reviews": 20821,
    "developer": "Color Tiger",
    "developerId": "7723403455955044226",
    "developerEmail": "colortigerapps@gmail.com",
    "developerWebsite": "https://www.anymote.io/?ref=google_play&extra=com.remotefairy",
    "developerAddress": "Color Tiger Limited\n31/F., Chinachem Century Tower,\n178 Gloucester Road,\nWanchai, Hong Kong",
    "updated": "January 13, 2018",
    "version": "4.6.8",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "World's best Galaxy S6 Remote, S5 Remote, HTC One Remote, or any Android remote overall!The only Universal Smart Remote Control for TVs and Home Electronics you'll ever need! Smart IR Remote is the only IR remote universal app for Android that you'll ever need: it's smart, the best device coverage of all android remotes (900000 devices, with more added daily), and it's the only one that makes use of features only your phone/tablet has, that a plastic remote (like the Logitech Harmony) never will. As IR remote controls go, especially android remote controls, you'll never find one better!Not compatible with Huawei, Vizio or Sony phones. Of all phones/tablets by LG, only compatible with the G3 & G4 (still in Beta, no recording. Not compatible with LG G3 A or LG G3 S)Don't have a supported phone or tablet? Check out AnyMote Home: http://anymote.ioSmart Remote works with any Samsung, HTC and Medion devices with an InfraRed Blaster, and most other brand phone/tablet with an IR Blaster that runs Android 4.4 or above provided by the manufacturer. Smart IR Remote also works on most custom ROMs like CyanogenMod. Smart IR Remote is an universal smart remote control that can simulate anything that sends InfraRed remote commands, like a TV remote, Set Top Box remote, DVD remote, BluRay remote, VCR remote, Amplifier remote, Air Conditioner remote, AV Receiver remote, DSLR camera remote, etc. Better yet, combine your remotes into a smart remote (activity) so that on your custom remote you'll have the volume buttons to your surround system, the channel buttons to control your set top box and the display buttons to control your TV. It's the only Android universal tv remote that can do that, while controlling any other device too!Don't have an IR-enabled phone? Don't worry, Smart IR Remote - AnyMote can also work over wifi to act as a Sonos remote, Samsung Smart TV remote, Sharp Smart TV remote, Philips Smart TV remote, LIFX and Philips Hue remote, Kodi / XBMC remote, VLC remote, Roku remote, Boxee remote, Amazon Fire TV remote, Yamaha & Denon AVR remote, or Amiko A3 remote. You'll no longer need separate apps for each of these! Is your wifi device not in the list ? Email us and we'll do our best to add it.Have any questions? Visit our FAQ:  https://www.anymote.io/faq/If your remote is missing, please email us and we'll do our best to help!On top of all that, since you're holding a phone, why not use some of its unique features?GESTURESSwipe, tap & hold to change channels, volume, etc. - it's all configurable!MUTE/PAUSE ON PHONE CALLSmart Remote can now mute your TV, pause your media player, or even switch them off, all of that when your phone ringsMACROSGroup commands in batches, and then execute them automatically one after the other. Imagine being able to turn your TV, Xbox and surround system on, switch TV to HDMI 1 all with a single tap!AUTOMATED TASKSAutomatically execute commands or macros when certain conditions occur: your phone rings, at a time chosen by you, when you use your phone's Volume Buttons. It also has Tasker plugins!WIDGETSWith widgets, you'll have your favorite commands just a tap away when you grab your phone. Need something even better? read onFLOATING REMOTE (CHATHEAD)The floating remote is a remote that stays above other apps which can be shown with just a single tap and lets you send commands even while you're playing a game on your phoneBACKUP / RESTOREMake a backup once and then restore on all your other devicesRECORD REMOTES Exclusive to the HTC One due to hardware limitations in other devicesFor details about permissions, visit http://www.colortiger.com/#permissions on your computer",
    "descriptionHTML": "World&apos;s best Galaxy S6 Remote, S5 Remote, HTC One Remote, or any Android remote overall!<br><br>The only <b>Universal Smart Remote Control for TVs and Home Electronics</b> you&apos;ll ever need! <br><br>Smart IR Remote is the only IR remote universal app for Android that you&apos;ll ever need: it&apos;s smart, the best device coverage of all android remotes (900000 devices, with more added daily), and it&apos;s the only one that makes use of features only your phone/tablet has, that a plastic remote (like the Logitech Harmony) never will. As IR remote controls go, especially android remote controls, you&apos;ll never find one better!<br><br><b>Not compatible with Huawei, Vizio or Sony phones. Of all phones/tablets by LG, only compatible with the G3 &amp; G4 (still in Beta, no recording. Not compatible with LG G3 A or LG G3 S)</b><br><br>Don&apos;t have a supported phone or tablet? Check out AnyMote Home: http://anymote.io<br><br>Smart Remote works with any Samsung, HTC and Medion devices with an InfraRed Blaster, and most other brand phone/tablet with an IR Blaster that runs Android 4.4 or above provided by the manufacturer. Smart IR Remote also works on most custom ROMs like CyanogenMod. <br><br><br>Smart IR Remote is an universal smart remote control that can simulate anything that sends InfraRed remote commands, like a TV remote, Set Top Box remote, DVD remote, BluRay remote, VCR remote, Amplifier remote, Air Conditioner remote, AV Receiver remote, DSLR camera remote, etc. Better yet, combine your remotes into a smart remote (activity) so that on your custom remote you&apos;ll have the volume buttons to your surround system, the channel buttons to control your set top box and the display buttons to control your TV. It&apos;s the only Android universal tv remote that can do that, while controlling any other device too!<br><br><br>Don&apos;t have an IR-enabled phone? Don&apos;t worry, Smart IR Remote - AnyMote can also work over wifi to act as a Sonos remote, Samsung Smart TV remote, Sharp Smart TV remote, Philips Smart TV remote, LIFX and Philips Hue remote, Kodi / XBMC remote, VLC remote, Roku remote, Boxee remote, Amazon Fire TV remote, Yamaha &amp; Denon AVR remote, or Amiko A3 remote. You&apos;ll no longer need separate apps for each of these! Is your wifi device not in the list ? Email us and we&apos;ll do our best to add it.<br><br><br>Have any questions? Visit our FAQ:  https://www.anymote.io/faq/<br><br><br><b>If your remote is missing, please email us and we&apos;ll do our best to help!</b><br><br>On top of all that, since you&apos;re holding a phone, why not use some of its unique features?<br><b>GESTURES</b><br>Swipe, tap &amp; hold to change channels, volume, etc. - it&apos;s all configurable!<br><b>MUTE/PAUSE ON PHONE CALL</b><br>Smart Remote can now mute your TV, pause your media player, or even switch them off, all of that when your phone rings<br><b>MACROS</b><br>Group commands in batches, and then execute them automatically one after the other. Imagine being able to turn your TV, Xbox and surround system on, switch TV to HDMI 1 all with a single tap!<br><b>AUTOMATED TASKS</b><br>Automatically execute commands or macros when certain conditions occur: your phone rings, at a time chosen by you, when you use your phone&apos;s Volume Buttons. It also has Tasker plugins!<br><b>WIDGETS</b><br>With widgets, you&apos;ll have your favorite commands just a tap away when you grab your phone. Need something even better? read on<br><b>FLOATING REMOTE (CHATHEAD)</b><br>The floating remote is a remote that stays above other apps which can be shown with just a single tap and lets you send commands even while you&apos;re playing a game on your phone<br><b>BACKUP / RESTORE</b><br>Make a backup once and then restore on all your other devices<br><b>RECORD REMOTES</b> <br>Exclusive to the HTC One due to hardware limitations in other devices<br><br>For details about permissions, visit http://www.colortiger.com/#permissions on your computer",
    "histogram": {
        "1": 772,
        "2": 353,
        "3": 819,
        "4": 3297,
        "5": 15580
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/vkl2Ea25fLSTp3cg_fGMyvTZipR0oUmrgwUOyccmFiczAaSrfxbLPjpmrXlKo0c5ADWB=h310",
        "//lh3.googleusercontent.com/QTxob9GE3NCzOn2G3LuDTyh_4VLJRX2eLIkqrKNE0NfeLHbunF2O4nMpWvjHXTCGBldE=h310",
        "//lh3.googleusercontent.com/SomrOB-vOpCmfSQY69qOoBMLB-0uAk6QkTQ0pOJxZY2J0Ov0fz2S9a8gdYZoJ64bdAQ=h310",
        "//lh3.googleusercontent.com/xJNeIpAMEUTSOKOQs2C1o3YZUzggTcxtdTr2MWCx-M2sVWCEDy7na7i7YNoDovtlig8=h310",
        "//lh3.googleusercontent.com/nvWoR7pjBIZo28W67VFLIegFOgDCW0NWYAxQWoml7Ml365RoqfRLFjcyjbVqyfO7WQ=h310",
        "//lh3.googleusercontent.com/EP1s6hLayV16Bj-zjPzlZ6x4M0mCk47wIApNuF6xRVAhE_p01IKXKt8f6d_aRz10vPE=h310",
        "//lh3.googleusercontent.com/LIOXzLfxWlwZtdwA9InqVjoBL9DsC0o5ztU0anK6x-NJ2w3_lmDiogdLmDQSh-RzWQ=h310"
    ],
    "comments": [
        "Can NOT add a custom remote despite purchasing the app.  I've attempted to contact the developer twice over the past two weeks and have not heard a thing from them! Very disappointed...",
        "For as long as I shall have a phone with an IR blaster, this app shall not be missing from it. The ammount of things you can do with it is amazing. Among those things, for me personally, a very noteworthy feature is Tasker integration. The only limit then becomes your imagination and creativity.",
        "I use this in my classroom for the air conditioner and the projector. Comes in handy to always have those remotes on me. I've also used it several times to mute annoying TVs in waiting rooms.",
        "After Huawei mate 9 android 8 update, program stopped working. Other ir programs work. Please solve the issue",
        "I had misplaced the remote to my LG smart TV and was looking for a quick replacement that would substitute and function the same. Sounds simple enough, doesn't it? Well after trying several different remote apps I was exasperated, as they either relied on a completely unworkable wifi connection to the TV or lacked basic functionality needed to launch and control TV apps. Finally I found this app, and to my relief it performed the simple functions that I wanted and was very easy to use with great options for customization. I especially love the notification mini-remote!",
        "It seams very confusing at first but after you get familiar with the app you can control about anything. Everything's customizable, the colour, text, and layout can all be changed. Works like a charm."
    ],
    "recentChanges": [
        "Improved privacy controls."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.remotefairy&hl=en&gl=us",
    "appId": "com.remotefairy"
}