{
    "title": "Podcast Republic - Podcast & Audiobook App",
    "summary": "All you need in one app for your podcast, radio, music and audio books!",
    "icon": "//lh3.googleusercontent.com/nsTjSoou0vYtTS8e7Jy1wW4dWTuG7SdimHVxAxCnw9bYRemtoX2zgAFK1qM0wUJWZzE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 62539,
    "developer": "Podcast Republic",
    "developerId": "5005652231415362258",
    "developerEmail": "tech@podcastrepublic.net",
    "developerWebsite": "http://www.podcastrepublic.net/",
    "developerAddress": "14271 Jeffery Rd #294, Irvine, CA 92620",
    "updated": "February 22, 2018",
    "version": "Varies with device",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "size": "Varies with device",
    "description": "Podcast Republic app is a top quality podcast & radio app for Android from a Google Top Developer! With over 2 million downloads and 60,000 reviews, an app you can trust!Podcast Republic is all your need to manage and play your Podcasts, Audio books, and YouTube channels/playlists. Even better, we've added the live radio streaming support! Feature completed and highly customizable. Just download it and enjoy your podcasts on your Android devices. Having multiple devices? No problem, you can sync your podcast subscriptions and episode states! You can start playing an episode in one device and pick up from where you left in another device. All changes will be synced in real time. Isn't that what you are asking for a podcast app? :)You can also join our Beta Tester program to get the latest cool features and bug fixes earlier:Please use the link https://goo.gl/By2Htd to get the beta testing version on your device. Thank you!We can reach us on social media. Please follow us on Twitter @castrepublic.This is ads supported app. Ads can be removed through in-app purchase.www.lifehacker.com: The Best Podcast Manager for Androidwww.lifehack.org: Top 5 Podcast Apps For Androidwww.makeuseof.com: The 8 Best Podcast Players for Androidwww.androidcentral.com: The best podcast apps for Androidwww.androidheadlines.com: Featured: Top 10 Podcast Apps for AndroidHighlights- Audio and video podcast support. Subscribe, browse, and listen to any podcast. Your favorite podcast is just at the tip of your fingers.- Streaming and downloading. Streaming podcasts without the need for a download. Or download them for offline play.- Fully automated download. Just enable the auto download, your new episodes will be downloaded and ready for you.- Offline playback of audio and video, save your data consumption- Multiple playlist support for better organizing your podcast playing- Live radio streaming support- Syncing podcast subscriptions and episode playback states between devices.- Import and export podcast subscription using OPML format. You can import from iTunes or Google Play.- Save download to SD card, free your internal storage.* Alarm feature to schedule a time to play podcast. Wake up with your favorite podcast or radio.- Built-in Tablet layout. One app for all screen sizes.- Chromecast support- Android wear support- Android Auto supportBuilt-in Media Player- Plays audio and video podcasts- Support variable playback speed- Stream or play offline- Remembers playback position- Bluetooth support- Sleep timer to stop audio player after you sleep- Features a car mode for easy and quick playback controlDownload Management- Automatically fetch feeds on a configurable interval- Automatically download new episode- Automatically deletes downloaded podcast that has been listened toPlaylist- Multiple playlist support for better organizing your podcast playing. Create as much playlists as you like.- Support audio/video playlist for continuous play- Sortable playlist plus manual drag and sort ability for easy playlist managementCustomization- Fully configurable. A lot configuration options to meet your specific needs.- Customize skip intervals in the mid of the playback or even skip the beginning of the podcast- Two level settings, global settings and individual podcast settings, to fine tune the settings.- Configurable home screen widget to fit your beautiful wallpaper- Sixteen color themes to selectFor Mashmallow users: please grant the storage accessing permission. This app need to access the storage to be able to download podcast and cache artworks used.",
    "descriptionHTML": "<b>Podcast Republic app is a top quality podcast &amp; radio app for Android from a Google Top Developer! With over 2 million downloads and 60,000 reviews, an app you can trust!</b><br><br>Podcast Republic is all your need to manage and play your Podcasts, Audio books, and YouTube channels/playlists. Even better, we&apos;ve added the live radio streaming support! Feature completed and highly customizable. Just download it and enjoy your podcasts on your Android devices. <br><br>Having multiple devices? No problem, you can sync your podcast subscriptions and episode states! You can start playing an episode in one device and pick up from where you left in another device. All changes will be synced in real time. Isn&apos;t that what you are asking for a podcast app? :)<br><br>You can also join our Beta Tester program to get the latest cool features and bug fixes earlier:<br>Please use the link https://goo.gl/By2Htd to get the beta testing version on your device. Thank you!<br><br>We can reach us on social media. Please follow us on Twitter @castrepublic.<br><br>This is ads supported app. Ads can be removed through in-app purchase.<br><br><b>www.lifehacker.com</b>: <a href=\"https://www.google.com/url?q=http://goo.gl/rnVvZO&amp;sa=D&amp;usg=AFQjCNFXfods-JcKVp0rxpV5xjIMLaZ9dw\" target=\"_blank\">The Best Podcast Manager for Android</a><br><b>www.lifehack.org</b>: <a href=\"https://www.google.com/url?q=http://goo.gl/r4xkV0&amp;sa=D&amp;usg=AFQjCNG3NwzMH6fHY8O2LUrGvrZtX2EBvg\" target=\"_blank\">Top 5 Podcast Apps For Android</a><br><b>www.makeuseof.com</b>: <a href=\"https://www.google.com/url?q=http://goo.gl/UivbpP&amp;sa=D&amp;usg=AFQjCNHijMNMuGqFX_SL7UkThKf9i3S_9g\" target=\"_blank\">The 8 Best Podcast Players for Android</a><br><b>www.androidcentral.com</b>: <a href=\"https://www.google.com/url?q=http://goo.gl/Sg0Ryp&amp;sa=D&amp;usg=AFQjCNFO0xN7u_ZiQ4zGg8M96IcHq8DPPQ\" target=\"_blank\">The best podcast apps for Android</a><br><b>www.androidheadlines.com</b>: <a href=\"https://www.google.com/url?q=http://goo.gl/gQGBx7&amp;sa=D&amp;usg=AFQjCNFWRa-TefD2gsBeOqDuraffaoOmzA\" target=\"_blank\">Featured: Top 10 Podcast Apps for Android</a><br><br><b>Highlights</b><br>- Audio and video podcast support. Subscribe, browse, and listen to any podcast. Your favorite podcast is just at the tip of your fingers.<br>- Streaming and downloading. Streaming podcasts without the need for a download. Or download them for offline play.<br>- Fully automated download. Just enable the auto download, your new episodes will be downloaded and ready for you.<br>- Offline playback of audio and video, save your data consumption<br>- Multiple playlist support for better organizing your podcast playing<br>- Live radio streaming support<br>- Syncing podcast subscriptions and episode playback states between devices.<br>- Import and export podcast subscription using OPML format. You can import from iTunes or Google Play.<br>- Save download to SD card, free your internal storage.<br>* Alarm feature to schedule a time to play podcast. Wake up with your favorite podcast or radio.<br>- Built-in Tablet layout. One app for all screen sizes.<br>- Chromecast support<br>- Android wear support<br>- Android Auto support<br><br><b>Built-in Media Player</b><br>- Plays audio and video podcasts<br>- Support variable playback speed<br>- Stream or play offline<br>- Remembers playback position<br>- Bluetooth support<br>- Sleep timer to stop audio player after you sleep<br>- Features a car mode for easy and quick playback control<br><br><b>Download Management</b><br>- Automatically fetch feeds on a configurable interval<br>- Automatically download new episode<br>- Automatically deletes downloaded podcast that has been listened to<br><br><b>Playlist</b><br>- Multiple playlist support for better organizing your podcast playing. Create as much playlists as you like.<br>- Support audio/video playlist for continuous play<br>- Sortable playlist plus manual drag and sort ability for easy playlist management<br><br><b>Customization</b><br>- Fully configurable. A lot configuration options to meet your specific needs.<br>- Customize skip intervals in the mid of the playback or even skip the beginning of the podcast<br>- Two level settings, global settings and individual podcast settings, to fine tune the settings.<br>- Configurable home screen widget to fit your beautiful wallpaper<br>- Sixteen color themes to select<br><br>For Mashmallow users: <br>please grant the storage accessing permission. This app need to access the storage to be able to download podcast and cache artworks used.",
    "histogram": {
        "1": 1841,
        "2": 1470,
        "3": 3478,
        "4": 14555,
        "5": 41195
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/dcOEmCPhRPp_mKDt-XJz5bHPswTXrQA0droV_10IUvItMOdlohDaqKXgBnDbJIrjRA=h310",
        "//lh3.googleusercontent.com/GPLn2Nvw0zZeXCLbIyQyiQpHIFBVhij0JrRe23ID96z5bkFWBm2LJlATO_2Gmqh21xg=h310",
        "//lh3.googleusercontent.com/F02raatyqyA5eEXAi3Y3nHP0_xRYEyub0gfSjM4Tj0AVBEQV8X5M0K6G7AZftEaYFQ=h310",
        "//lh3.googleusercontent.com/bjwakl-J_lJ_iO5Vn3RVdiKZZNXIkw3YCmMqi2L4j8lnqUTHTXjUnMCU1el6SkZoVg=h310",
        "//lh3.googleusercontent.com/oXdlAKvEMNWtny6A6IpkJDcKkjZJf7mr0tKqJVtIMGJ0yTIUmKc6ny3QEd-bwU_drg=h310",
        "//lh3.googleusercontent.com/uywfRsSAqsDMV4GgLr_k0of43CCSzTL6EpLyoyH8wxcsKe_8InlAI2MG3po_sfdw6Q=h310",
        "//lh3.googleusercontent.com/Or8LtU68sJ8P24pWerUhKGtvQFGFTR49LVyYB0tL8y30R59FzomoNAN9R5tr-P5lTA=h310",
        "//lh3.googleusercontent.com/Du2ANlRKrkXWSeoCLO32l38UQqoN8OFIAgqqwsFZIH242yNF5Y_PvBnesgzWt9S612E=h310",
        "//lh3.googleusercontent.com/v7vzwn0-EvhXaAHJhSpOAqv9hcRpFmFiJHZpY6Ae_Jf6g5xb1Fraz6iZEKqf-V1rRw=h310",
        "//lh3.googleusercontent.com/O6a8SuyBSaXMLLSsT12QAGuc2A68825Hve6z_DipKnfucNa__1yH8OuGMF0U5iCGWr0=h310",
        "//lh3.googleusercontent.com/apsMcaakTaX-sAAdxnC_1C-7bxzYSwTRZ2QFlVumCZoeZ7-zAXMzlMs4ZIUjQtvX9w=h310",
        "//lh3.googleusercontent.com/7LNv_jNitej3a6sSLFyBWK1yEbck0ACOpTqKonMiOZTsvHmShDQvaWW-BQfqkQWN9ls=h310",
        "//lh3.googleusercontent.com/TsOyrWQPsB8eYUiDrWbFTOPzzJLQ22vKv4pBNjkqDaD_IDzEwCj_r610HP0IJOHFDBk=h310",
        "//lh3.googleusercontent.com/AbLfVPiPDnnRHPUJfWzDZUXLjhCeHD1ds9z3Pm6y3D6KOHVDL1W0dMnN-aTUnNU9rDbe=h310"
    ],
    "comments": [
        "I have tried a lot of podcast apps, the ease of use and flexibility is better than many I have tried. I have just become a supporter, even though I am still unemployed. Although I still have some memory issues on my older phone (sometimes the cast list don't display or update as they should) but my main issue is that it is a little too easy to accidentally change what is playing if I am listening while scrolling and managing my lists.",
        "I really enjoy this app a lot and find it easy to use while I'm driving, but I wish the search was better since you must get the name of the podcast completely right before actually being able to find it. They need more of a google search engine where it doesn't have to be perfect and where it gives suggestions on what you wanted to search up.",
        "Podcast apps are a glaring weakness of the Android platform and this is the best of the worst. It's the least clunky, but there's still some very unnecessary steps in using the app. The most frustrating part is the large episode window that takes up 20% of the screen even when an episode isn't playing and/or has been deleted.",
        "i like most everything but very buggy, lately the app will become completely unresponsive and will not let me play anything. i cant even play the podcasts i have downloaded. if these issues get fixed itll be 5 stars",
        "Great app that is the only one I found that allows me to play iTunes podcasts! I like the layout, as other have said it's not completely intuitive but not difficult to navigate, and it's worth it for what it does. Only problem is, and I don't know if it's the app, or this particular podcast, but sometimes skipping forward doesn't work and it just restarts the cast..",
        "Generally good. Problems with getting app to play from oldest newest from a position chosen by user.  When I start listening from NOT the oldest the app doesn't 'follow my lead' and go to the \"logical\" next in sequence. It jumps back to the oldest in the list. So I can't let it stream episode to episode from my chosen point. I have to end each podcast and then manually select the next one I want to listen to.   The series I am listening to currently is The Infinite Monkey Cage, BBC 4."
    ],
    "recentChanges": [
        "18.01.16R",
        "Jan 16, 2018",
        "* Fix a chapter reading bug for MP4 format",
        "* Fix a battery drain bug from stopped playback",
        "* Add option to set allowed download time",
        "* Add two new shaking actions: play previous & add 10 more minutes to sleep timer",
        "* By default display unplayed episodes on top when viewing all episodes of a podcast",
        "* Handle insufficient storage space properly when downloading",
        "* Bug fixes and performance enhancements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.itunestoppodcastplayer.app&hl=en&gl=us",
    "appId": "com.itunestoppodcastplayer.app"
}