{
    "title": "Lucid Dream Inducer",
    "summary": "Enter the dream.",
    "icon": "//lh3.googleusercontent.com/XlTpKl1RmEHMfUJl03u0AWlzaHSyDNclqMenf2fIbnQhh8RJW-k_RWtv3-N8ijx3HqQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.8,
    "reviews": 115,
    "developer": "Tomasz Paś",
    "developerId": "Tomasz+Pa%C5%9B",
    "developerEmail": "kierek93@gmail.com",
    "developerAddress": "Bydgoszcz, Polska",
    "updated": "April 22, 2017",
    "version": "2.0.1",
    "genre": "Education",
    "genreId": "EDUCATION",
    "description": "The combination of one of the most popular techniques: WILD (Wake Induced Lucid Dreams), with modern technology gave surprisingly good results. This is the application written by a lucid dreamer for lucid dreamers. In this app there are instructions not only for WILD, but WBTB(Wake Back To Bed) and Reverse Blinking as well. New techniques coming soon!Are you tired of the lack of results at the earnest attempts to achieve a lucid dream? This is the app for you. Or maybe you are an experienced lucid dreamer, and feel like to try a new method to learn more about lucid dreaming? This is also the app for you. Lucid Dream Inducer is a modern extension of one of the most popular and most respected techniques. Entering into the dream has never been so easy. Set the application, comfortably lie down in your bed and start dreaming, and the Lucid Dream Inducer will remind you that you are falling asleep. Your body will drift away, but your mind will stay awake and lucid. Remember! Even the best technique won't be of any use if you can't remember your dreams. Try my other app, Supreme Dream Journal, and train your memory. The average person has three to five dreams per night!And it's not all! Lucid Dream Inducer also has a feature known as Constant Lucidity. Set it to receive random notifications that will remind you to do a Reality Test. First step to achieve Lucidity in your dream is to stay Lucid throughout the day.If you have an Android Wear device, it will be the perfect fit for Lucid Dream Inducer. If you don't, don't worry, it works great with bigger devices as well.",
    "descriptionHTML": "The combination of one of the most popular techniques: WILD (Wake Induced Lucid Dreams), with modern technology gave surprisingly good results. This is the application written by a lucid dreamer for lucid dreamers. <br><br>In this app there are instructions not only for WILD, but WBTB(Wake Back To Bed) and Reverse Blinking as well. New techniques coming soon!<br><br>Are you tired of the lack of results at the earnest attempts to achieve a lucid dream? This is the app for you. Or maybe you are an experienced lucid dreamer, and feel like to try a new method to learn more about lucid dreaming? This is also the app for you. <br><br>Lucid Dream Inducer is a modern extension of one of the most popular and most respected techniques. Entering into the dream has never been so easy. Set the application, comfortably lie down in your bed and start dreaming, and the Lucid Dream Inducer will remind you that you are falling asleep. Your body will drift away, but your mind will stay awake and lucid. <br><br>Remember! Even the best technique won&apos;t be of any use if you can&apos;t remember your dreams. Try my other app, Supreme Dream Journal, and train your memory. The average person has three to five dreams per night!<br><br>And it&apos;s not all! Lucid Dream Inducer also has a feature known as Constant Lucidity. Set it to receive random notifications that will remind you to do a Reality Test. First step to achieve Lucidity in your dream is to stay Lucid throughout the day.<br><br>If you have an Android Wear device, it will be the perfect fit for Lucid Dream Inducer. If you don&apos;t, don&apos;t worry, it works great with bigger devices as well.",
    "histogram": {
        "1": 18,
        "2": 8,
        "3": 10,
        "4": 23,
        "5": 56
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/XJJk-toQO3_vL9RcN97taouIDz9_gNK1ngw9Pm7KsprHBHd7A6sCxH7aEf6omgtQtkI=h310",
        "//lh3.googleusercontent.com/HNNgOkgXLQc10ituTl8Atvx0SLczf-xDSXlt4YhXrDGBW4Xe7xnfEL2OATRwH2DE-yg=h310",
        "//lh3.googleusercontent.com/fFGHDYYBb6jiXpNeAJpxxH9uQmu1qs_Sho4QThckmwGCJjTMd47Mqkrp7QOq32xhq9I=h310",
        "//lh3.googleusercontent.com/seetDFlj6kXBXBwnU2F5TGSHuv5Fgn3780OjH61e1WX3Gf0SU91knlYpqdQy0VP3-g=h310"
    ],
    "comments": [
        "Is not working for me . It works only on short periods of time like 5-15 min , but for a period like 4-5 hours it's not .pls fix this, I need this app. I'm having this problem on my galaxy s5. I'll try to reinstall the app maybe that will do something.",
        "The vibration didn't work at all for me s7 Oh well",
        "Can somewon help me with this app have been trying for over 2 mounths every day to lucid dream and I got the today and don't Kno how to use it",
        "Gonna have to leave this on 1 until the locked phone part works. Says I can lock my phone and do it but nope. S8+.",
        "Please give a more detailed tutorial on how to do it. I've got no idea on how to start. A video would really help",
        "I does't work."
    ],
    "recentChanges": [
        "- greatly improved layout, now much cleaner and more intuitive",
        "- default theme changed to the dark one",
        "- stability and performance fixes",
        "- Constant Lucidity fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.k560.luciddreaminducer&hl=en&gl=us",
    "appId": "com.k560.luciddreaminducer"
}