{
    "title": "Rukkus Event Tickets",
    "summary": "Rukkus helps you buy the best tickets to any sporting event, concert, or show",
    "icon": "//lh3.ggpht.com/aAvm4ky5W57D_j8P-UilKioOFItxdg4tgX2cK0YFBMgKayu1ULu6vuI3Yjm75amskA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.1,
    "reviews": 227,
    "developer": "Rukkus",
    "developerId": "Rukkus",
    "developerEmail": "concierge@rukkus.com",
    "developerWebsite": "http://www.rukkus.com",
    "updated": "April 11, 2016",
    "version": "2.7.0",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "description": "Looking for the best deal on concert tickets for your favorite band? Trying to find cheap sports tickets to MLB and NFL games this season? Rukkus has you covered, searching tickets from hundreds of vendors to help you grab great seats for the cheapest ticket prices available. Browse upcoming events and buy tickets for concerts, sporting events (MLB, NFL, NHL, NBA), and broadway shows and reserve your tickets in two taps.FEATURES:✔ Want to checkout in just two clicks? Rukkus supports Android Pay at checkout! Get to your events faster than ever.✔ Search over 1,000 ticket vendors at once.✔ Beautiful interactive seating charts with first-person seat views. ✔ Recommended events based on your music tastes and favorite artists.✔ Checkout in just 2 taps. Save even more time by using our card scanner. ✔ Mobile ticket entry for venues accepting e-tickets. No printed tickets required.✔ Find the best prices for regular season and playoff tickets for your favorite teams.✔ Use your Android Wear to view/scan tickets for eligible games.✔ Best prices 100% guaranteed.CONNECT:Website - rukkus.com Facebook - facebook.com/jointherukkus Twitter - twitter.com/jointherukkus Email – hi@rukkus.comMORE INFO:Rukkus is a ticket search engine that scans the entire web and puts all the available tickets in one place. Our interactive seat maps and 1st-person seat views make it easy and fun to select your seats. The Rukkus Android app is free with no additional fees. Use Rukkus to find the best deals on concert tickets, sports tickets, theater tickets, and more!",
    "descriptionHTML": "Looking for the best deal on concert tickets for your favorite band? Trying to find cheap sports tickets to MLB and NFL games this season? Rukkus has you covered, searching tickets from hundreds of vendors to help you grab great seats for the cheapest ticket prices available. Browse upcoming events and buy tickets for concerts, sporting events (MLB, NFL, NHL, NBA), and broadway shows and reserve your tickets in two taps.<br><br>FEATURES:<br>&#x2714; Want to checkout in just two clicks? Rukkus supports Android Pay at checkout! Get to your events faster than ever.<br>&#x2714; Search over 1,000 ticket vendors at once.<br>&#x2714; Beautiful interactive seating charts with first-person seat views. <br>&#x2714; Recommended events based on your music tastes and favorite artists.<br>&#x2714; Checkout in just 2 taps. Save even more time by using our card scanner. <br>&#x2714; Mobile ticket entry for venues accepting e-tickets. No printed tickets required.<br>&#x2714; Find the best prices for regular season and playoff tickets for your favorite teams.<br>&#x2714; Use your Android Wear to view/scan tickets for eligible games.<br>&#x2714; Best prices 100% guaranteed.<br><br>CONNECT:<br>Website - rukkus.com <br>Facebook - facebook.com/jointherukkus <br>Twitter - twitter.com/jointherukkus <br>Email &#x2013; hi@rukkus.com<br><br>MORE INFO:<br>Rukkus is a ticket search engine that scans the entire web and puts all the available tickets in one place. Our interactive seat maps and 1st-person seat views make it easy and fun to select your seats. The Rukkus Android app is free with no additional fees. Use Rukkus to find the best deals on concert tickets, sports tickets, theater tickets, and more!",
    "histogram": {
        "1": 30,
        "2": 12,
        "3": 13,
        "4": 17,
        "5": 155
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/v_r8-z-wTjH6hvQ1ZnpoIOnnLQik6OcFI8HA3CK4P5nOCYRUZo6idcIqHTB7BYZTDw=h310",
        "//lh3.ggpht.com/HB0jJrCNWjyFf9_3wd8A5aljhXhjYsfNbtKbNDvIKFmqo_AjrwFaWyzpC2kJGUjYaFPh=h310",
        "//lh4.ggpht.com/VbWC2iPi_evEp-pHShVvWmTP10V1L50_gV3T8LWXVzFciyuu-BcybgmERmJMJK6EPw=h310",
        "//lh3.ggpht.com/XMTQYGFrfOjyrCQsREXT-gfQHxdpMBXsZ8rvdigJR74orUTeO_2PpfYS8TwDShbz17xo=h310",
        "//lh4.ggpht.com/1pwxVT3djjbIdckDq3lwUkTDicyJOvetwenFq4voDYun5bOq1WPragXXOxyOnTGOSg=h310",
        "//lh6.ggpht.com/LHPPuW_ldp1VafZcqa7HYXqAhKDscoU5ikP-87dUQuFlGBwvyUm-sC_7KDoYpMCrZFg=h310",
        "//lh3.ggpht.com/kzCySH9H2hrRj4xLMPKIen1GHpyHH62XDpwIfjGbtTfT-bnGv6nnjjiAW1tbxr_-eEE=h310",
        "//lh3.googleusercontent.com/xbXKUWBgeqwIxMMYGJuuZDcnZlyGwWcJgGZ3nImW00s49KhDAjXzPEUiKOjDKKICiVQ=h310",
        "//lh3.googleusercontent.com/gpENoIX4Xwxci83ggS0r0ioUXeZJ5spkr_0IaHCaQJfHB540xoA9umcIsJ6I5ERRhoQ=h310"
    ],
    "comments": [
        "HORRIBLE REVIEWS LOL!!! TOO SOON TO TELL FOR ME BUT MY FIRST TICKET PURCHASE HERE WAS SUPER FAST,  SLICK AND ALMOST  INSTANT!  NOTHING  COMPARED TO  THE  NIGHTMARISH EXPERIENCE I HAD WHEN I USED VIVIDSEATS....THE FEES  WERE A LITTLE HIGH THOUGH.  I'LL HAVE TO SEE HOW IT WORKS OUT AT THE FRONT  GATE AND FUTURE PURCHASES BUT SO FAR I'M SUPER IMPRESSED!",
        "WORST WASTE OF TIME & MONEY I bought 2 great End Zone tickets for the Copa America USA vs Argentina for $600. yesterday. And like StubHub the tickets were advertised as E-tix... BUT Unlike StubHub I was not able to automatically download the tickets, instead it said I was going to receive an email to print. Waited 2 hours with no email, I called to only get a voice mail & leave a message. This afternoon I get an email saying I was getting a refund because the tix were no longer available. BUT they are still 4 sale w/a higher price.",
        "App literally doesn't work. Searching for Raptors tickets...says lots are available. When you click on the event listing that brings up the map there is literally NOTHING showing on the map. Cannot access any tickets to purchase.",
        "Expensive Tickets Hefty taxes and fees make tickets almost double what I could have gotten them for at the teams official website. Had trouble finding a way to contact them regarding an issue with my tickets. I would never recommend this service or use it again.",
        "They sold me tickets for a hockey game, center ice.  After they collected my money those tickets magically weren't available and they tried to replace with seats no where near center ice but told me those seats cost more, like they're doing me a favor. When I realized that it's not what I ordered. I called then out on it. Terrible customer service. Lied about calling me back. I had to contact them to get a response.  Surprise, surprise. Nothing they could do. So I emailed them like I was suggested by their employee. I had their so call manager Patricia yell at me over the phone because I kept emailing them for a response. She was very aggressive. She would not let me talk or talk to her manager when I didn't want to speak to her because she kept yelling at me. She kept cutting me off. She called me a child. Very unprofessional. Super aggressive! After I got off the phone with her, I got a very aggressive email. So that's how they do their business. Sell you something that's not available, then stick you with something you don't want. Never once did anyone give me the option to cancel. But it's my fault, cause I made the mistake purchasing with them.",
        "Made a purchase checkout looks fine but can't seem to find it afterwards, checked with Credit card company and found out they charged me but I didn't get my tickets."
    ],
    "recentChanges": [
        "New in 2.7:",
        "- Major Seating Chart Display + Usability updates",
        "- Permission fixes for Android Marshmallow",
        "Quote of the Release:",
        "“Boop.”",
        "- Archer"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.rukkus.app&hl=en&gl=us",
    "appId": "com.rukkus.app"
}