{
    "title": "Microsoft Translator",
    "summary": "Translate text, voice, and images into 60+ languages with Microsoft Translator.",
    "icon": "//lh3.googleusercontent.com/sdsa9PabfOhhhfvDymuuvCxVO9Dpf7tSnREb9mJ4bai4w6AaUnpP49vps1GWs2QaK3c=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.6,
    "reviews": 158576,
    "developer": "Microsoft Corporation",
    "developerId": "6720847872553662727",
    "developerEmail": "appfeedback@microsofttranslator.uservoice.com",
    "developerWebsite": "https://translator.microsoft.com/",
    "developerAddress": "One Microsoft Way",
    "updated": "February 13, 2018",
    "version": "3.2.253b",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Microsoft Translator is a free, personal translation app for 60+ languages, to translate text, voice, conversations, camera photos and screenshots. You can even download languages for offline translation for free to use when you travel!•\tText translation into over 60 languages*, for online and offline use•\tCamera translation to translate text within photos and screenshots•\tVoice translation to translate speech, and a split-screen mode for two participants having a bilingual conversation•\tMulti-person conversation translation - connect your devices and have in-person conversations with up to 100 people across multiple languages•\tPhrasebooks for verified translations and pronunciation guides to help you learn important phrases in foreign languages when you travel•\tLook up alternate translations and meanings of a word to find the best translation to express yourself•\tDownload languages for offline use for when you travel without an internet connection•\tHear your translated phrase out loud to help you learn how to say the translation•\tView transliterations (pronunciation guides) to help you pronounce the translation (includes Pinyin support for Chinese)•\tShare your translations with other apps  •\tPin and save your most frequent translations for later•\tTranslate text in other apps through context menu translation•\tSpeak to your Android Wear smart watch to get an instant translation•\tAutomatically sync translations between your phone and Android Wear smart watch   Translator supports the following languages:  Afrikaans, Arabic, Bangla, Bosnian (Latin), Bulgarian, Cantonese (Traditional), Catalan, Chinese (Simplified), Chinese (Traditional), Croatian, Czech, Danish, Dutch, English, Estonian, Fijian, Filipino, Finnish, French, German, Greek, Haitian Creole, Hebrew, Hindi, Hmong Daw, Hungarian, Indonesian, Italian, Japanese, Kiswahili, Korean, Latvian, Lithuanian, Malagasy, Malay, Maltese, Norwegian, Persian, Polish, Portuguese, Quer'etaro Otomi, Romanian, Russian, Serbian (Cyrillic), Serbian (Latin), Slovak, Slovenian, Spanish, Swedish, Tahitian, Thai, Turkish, Ukrainian, Urdu, Vietnamese, Welsh, and Yucatec Maya.  Microsoft Translator is powered by cutting-edge technology used by Office, Bing, Skype, Internet Explorer as well as by partners such as Twitter, Yelp, eBay, WeChat and more.   Location Permission: Microsoft only uses your location to show you where conversation occurred. We display this location in your conversation history. *Some features are not available in all languages.",
    "descriptionHTML": "Microsoft Translator is a free, personal translation app for 60+ languages, to translate text, voice, conversations, camera photos and screenshots. You can even download languages for offline translation for free to use when you travel!<br><br>&#x2022;\tText translation into over 60 languages*, for online and offline use<br>&#x2022;\tCamera translation to translate text within photos and screenshots<br>&#x2022;\tVoice translation to translate speech, and a split-screen mode for two participants having a bilingual conversation<br>&#x2022;\tMulti-person conversation translation - connect your devices and have in-person conversations with up to 100 people across multiple languages<br>&#x2022;\tPhrasebooks for verified translations and pronunciation guides to help you learn important phrases in foreign languages when you travel<br>&#x2022;\tLook up alternate translations and meanings of a word to find the best translation to express yourself<br>&#x2022;\tDownload languages for offline use for when you travel without an internet connection<br>&#x2022;\tHear your translated phrase out loud to help you learn how to say the translation<br>&#x2022;\tView transliterations (pronunciation guides) to help you pronounce the translation (includes Pinyin support for Chinese)<br>&#x2022;\tShare your translations with other apps  <br>&#x2022;\tPin and save your most frequent translations for later<br>&#x2022;\tTranslate text in other apps through context menu translation<br>&#x2022;\tSpeak to your Android Wear smart watch to get an instant translation<br>&#x2022;\tAutomatically sync translations between your phone and Android Wear smart watch <br>  <br>Translator supports the following languages:&#x202F; Afrikaans, Arabic, Bangla, Bosnian (Latin), Bulgarian, Cantonese (Traditional), Catalan, Chinese (Simplified), Chinese (Traditional), Croatian, Czech, Danish, Dutch, English, Estonian, Fijian, Filipino, Finnish, French, German, Greek, Haitian Creole, Hebrew, Hindi, Hmong Daw, Hungarian, Indonesian, Italian, Japanese, Kiswahili, Korean, Latvian, Lithuanian, Malagasy, Malay, Maltese, Norwegian, Persian, Polish, Portuguese, Quer&apos;etaro Otomi, Romanian, Russian, Serbian (Cyrillic), Serbian (Latin), Slovak, Slovenian, Spanish, Swedish, Tahitian, Thai, Turkish, Ukrainian, Urdu, Vietnamese, Welsh, and Yucatec Maya. <br> <br>Microsoft Translator is powered by cutting-edge technology used by Office, Bing, Skype, Internet Explorer as well as by partners such as Twitter, Yelp, eBay, WeChat and more.&#x202F; <br> <br>Location Permission: Microsoft only uses your location to show you where conversation occurred. We display this location in your conversation history.<br> <br>*Some features are not available in all languages.",
    "histogram": {
        "1": 3963,
        "2": 1840,
        "3": 6745,
        "4": 32187,
        "5": 113841
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/gpopPFggyyl9GeCWWkh-sF_jQ3VKUcKbrlue-8y2h_Y5ACID_QjURbuOwIxil2LibQ=h310",
        "//lh3.googleusercontent.com/ZfhrV4SNTatBIjNG-IzlPF9jKtgHKt416ahwISupADwF8MpucU5nshYEO1h25uNgJ91V=h310",
        "//lh3.googleusercontent.com/GtQ0n_k_zwBfSeu-fG9wuGNcKKcfNmIowEBh7a1-_gyDxwHkaG03p3z-Mc9CR6lBWoQ=h310",
        "//lh3.googleusercontent.com/WvIQomBrSlgGRjVSQFvlgFVSW2-6DYrtieZ3_Cq50Y1uKAQ680pkI3OX6BP0ICwfQxbK=h310",
        "//lh3.googleusercontent.com/SnFoD8hrjSwniW9hrgaPvG5jS2DPnlK_u8Kmwuea_uQQqP2_fIv7HEibKdPBmJVVvg=h310",
        "//lh3.googleusercontent.com/CcmaF18rcgJjNJqPq8kZTxONsBUYHkMxAg2-gsg2r455Rqh5pOmkHmfYc4oRe23tsA=h310",
        "//lh3.googleusercontent.com/eOHnrQkQeIaIq88I1qJZriyTNgoxPx07gEKaCEPkEFEZnvd11LqtJmeV8e4X1mNNZwE=h310",
        "//lh3.googleusercontent.com/LnEEvuptnUAfmtP-L56k-xq98XuGKn_sveJiDoRXZR45ZSGBV7gAiP9b8NBL-7w-HJc=h310",
        "//lh3.googleusercontent.com/f2ZFhD41UhsKJQx5outz7fDjlyD3m6Pea8CawIoInEGFGNL8kFvK8BymKgQfd2SYEFdR=h310",
        "//lh3.googleusercontent.com/VUYnnf-GMoBkl4HeRNQgaHF1RruN8Qxbxzn_RvJkzkjOrlO9uaiUypszoJLPMj1krkT7=h310",
        "//lh3.googleusercontent.com/UUgu4KJSTcDu5E1BtXX2HD-yKw7exld_H9wUVnyTouB-XLIFJvVOuh1CBGLXLRSOMRHU=h310",
        "//lh3.googleusercontent.com/6mgz5k4I2KpFP2RkpHFD_djRf_f9QiZti_PFM6F9114g18XjWfxfXrE_ksfYgRPSp_U=h310",
        "//lh3.googleusercontent.com/jZbmYjVX5P4_UeLYsIq4X2VW10XE6d6sL3IP-o_EGyN7ru2c7hD6thMzSZYoD9Y27EEU=h310",
        "//lh3.googleusercontent.com/5LdMg8SvrVEygWNSgq_L_XVUJ64b9yJguIZ-0B5YaW_OYT8kAdYPchvKF3UIOGsQeA=h310",
        "//lh3.googleusercontent.com/k7BA28s6lA8cH9lq4c_Uvds-zSVx3rggo7v0O6y7AopIUNOJUDWJ4sh68176mVq1rwY=h310",
        "//lh3.googleusercontent.com/4_YO0Aa6yB8SNKkYMupE84xOCKZGHg_bfqsUSThSM9TUavEKgdWd3-IKSPLwjCDupCk=h310",
        "//lh3.googleusercontent.com/RRh90AENLaNxOiw_tk28yiMsQldR5zuY9cojj0xbNnXaBTGbDYNDhpkaJVB_eqIjGrY=h310",
        "//lh3.googleusercontent.com/j7aFgi0uDF98zz9dm8R2j03qjQScFCxnoUIu00mY9OJFDZ1a5rJiUL6LWyawgFVMigI=h310",
        "//lh3.googleusercontent.com/FwUC1Yol8umqjOobQszCiCGfmP1EFYUlWsZg0OXHOoJ0CLMdLCPCAIOoIes4oPd5nYE=h310"
    ],
    "comments": [
        "Great app, just wish when I copy text a bubble would pop up to use the app, instead of having to bounce back and forth opening and closing programs. Other than that, its awesome。Also, highlight option please! Dont need the whole picture or page translated。",
        "This app seems to perform quite well.  It has text, voice, and lens translation capabilities.  You can even use it for a specific language offline.  The only limitation we have seen is the offline lens function (for Japanese characters) does not work very well.  Otherwise, we are pleased with this app",
        "Nice app! Love how the way it translate some word or even a whole paragraph. It's understandable, nice translation! Also the UI is pretty nice, simple and elegant. I wonder can we change the background? I'm not trying it yet but it would be nice if we can. Overall, i love it. Five stars for this lit app!",
        "I hate this app because TELUGU is not included. Telugu is widely spoken in india, next to Hindi language . Microsoft CEO, Satya Nadendla's mother is Telugu.  More than 10 billions speaks enti world.",
        "I updated the newest version and the automatic voice pronunciation part doesn't work anymore. I tried other languages and the same problem that it won't pronounce the word for me as before",
        "I like it because it translates exactly what i say unlike the other apps i tried. It edits my words and turned out to be scrambled. This apps is bravo!"
    ],
    "recentChanges": [
        "Bug fixes and general improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.microsoft.translator&hl=en&gl=us",
    "appId": "com.microsoft.translator"
}