{
    "title": "Light Flow Pro - LED Control",
    "summary": "Total notification control. LEDs, vibrations, sounds, sleep times and much more.",
    "icon": "https://lh5.ggpht.com/8aMl4Pwl8P54JerypXTxAMersKS0UI9RGBLkHyxHkuy_QC4U-9Tz_UkNt5C0YBmpLf8=w300",
    "price": "$2.49",
    "free": false,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4,
    "reviews": 17956,
    "developer": "Reactle",
    "developerId": "5785799054713621518",
    "developerEmail": "support@reactle.com",
    "developerWebsite": "http://www.reactle.com/p/home_25.html",
    "developerAddress": "First Floor,\nTelecom House,\n125-135 Preston Road,\nBrighton,\nEngland,\nBN1 6AF",
    "updated": "February 28, 2018",
    "version": "3.75.00",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Light flow allows you to take control of the notifications on your device.It's main features are: - Controlling the notification LED for phones that have them (cycling colors through outstanding notifications) - Sound control, including repeating sounds - Vibration control, including custom vibration patterns and repeating vibrations - Android wear vibration support - Sleep times - Lock screen based notifications (on phones that support live wallpapers on lock screens) - Contact specific notifications for certain notification typesIf you've come from a Blackberry device and miss the features of BeBuzz / BerryBuzz then give LightFlow a try!This app will allow you to control the notification color for the over 600 applications and system events such as:   * Missed calls   * Voice mail   * Calendar reminders    * gmail   * email   * SMS messages   * MMS messages   * Low battery   * No signal   * Google talk   * Facebook   * Twitter   ...and many many moreSee our website for a full list of applications supported:http://www.reactle.com/p/features.html It allows the colors to flash in succession, so if you have a new SMS and a missed call it can alternate between the two colors. You can also set which notification type has the highest priority and let it flash in just that one color.It'll even push notifications out to your pebble smart watch, Sony smart Watch and the DashClock lock screen extension.For a full changelog see here: For a full changelog see here:http://www.reactle.com/p/change-log.htmlFor a full list of permissions required and why see here:http://www.reactle.com/2014/06/app-permissions.htmlKnown issues/Limitations-------------------------Samsung phones when accessibility is enabled may cause the phone to start talking, warnings about air view and a few other issues. These are confirmed samsung bugs (see here: http://developer.samsung.com/forum/board/thread/view.do?boardName=GeneralB&messageId=204387) but the app can be run without the accessibility service and still work (but with a reduced notification list)Not all phones support all colors. For example: Most HTC phones only support 3 colors and require \"Rooting\" and running the app in \"direct mode\"Some phones can only light up the notification while the screen is off.Some phones cannot have their notification light always onSome phones cannot have their notification blink and it will always be onNote that it will take over control of your notifications and you will therefore only get notifications for categories that the app allows.★ We recommend you try the \"lite\" version first before purchasing to avoid any disappointment if it doesn't work for you. Some phones require root privileges to access the LEDs. ★ ★ For the differences between this version and the lite version see here: http://www.reactle.com/p/features.html ★★ If after updating you have problems we recommend you reboot your phone ★** Most HTC phones require \"direct mode\" setting. Most gingerbread builds for HTC phones require root access due to HTC changing the permissions on the LED control files. **** If upgrading from the \"lite\" version, please uninstall the lite version first but you can backup and restore settings between versions **===================================Smart Connect extension for SmartWatch 2LiveWare™ extension for SmartWatch",
    "descriptionHTML": "Light flow allows you to take control of the notifications on your device.<br><br>It&apos;s main features are:<br> - Controlling the notification LED for phones that have them (cycling colors through outstanding notifications)<br> - Sound control, including repeating sounds<br> - Vibration control, including custom vibration patterns and repeating vibrations<br> - Android wear vibration support<br> - Sleep times<br> - Lock screen based notifications (on phones that support live wallpapers on lock screens)<br> - Contact specific notifications for certain notification types<br><br>If you&apos;ve come from a Blackberry device and miss the features of BeBuzz / BerryBuzz then give LightFlow a try!<br><br>This app will allow you to control the notification color for the over 600 applications and system events such as:<br>   * Missed calls<br>   * Voice mail<br>   * Calendar reminders <br>   * gmail<br>   * email<br>   * SMS messages<br>   * MMS messages<br>   * Low battery<br>   * No signal<br>   * Google talk<br>   * Facebook<br>   * Twitter<br>   ...and many many more<br><br>See our website for a full list of applications supported:<br>http://www.reactle.com/p/features.html<br> <br>It allows the colors to flash in succession, so if you have a new SMS and a missed call it can alternate between the two colors. You can also set which notification type has the highest priority and let it flash in just that one color.<br><br>It&apos;ll even push notifications out to your pebble smart watch, Sony smart Watch and the DashClock lock screen extension.<br><br><br>For a full changelog see here: For a full changelog see here:<br>http://www.reactle.com/p/change-log.html<br><br>For a full list of permissions required and why see here:<br>http://www.reactle.com/2014/06/app-permissions.html<br><br>Known issues/Limitations<br>-------------------------<br>Samsung phones when accessibility is enabled may cause the phone to start talking, warnings about air view and a few other issues. These are confirmed samsung bugs (see here: http://developer.samsung.com/forum/board/thread/view.do?boardName=GeneralB&amp;messageId=204387) but the app can be run without the accessibility service and still work (but with a reduced notification list)<br><br><br>Not all phones support all colors. <br>For example: Most HTC phones only support 3 colors and require &quot;Rooting&quot; and running the app in &quot;direct mode&quot;<br><br>Some phones can only light up the notification while the screen is off.<br><br>Some phones cannot have their notification light always on<br><br>Some phones cannot have their notification blink and it will always be on<br><br>Note that it will take over control of your notifications and you will therefore only get notifications for categories that the app allows.<br><br><br>&#x2605; We recommend you try the &quot;lite&quot; version first before purchasing to avoid any disappointment if it doesn&apos;t work for you. Some phones require root privileges to access the LEDs. &#x2605; <br><br>&#x2605; For the differences between this version and the lite version see here: http://www.reactle.com/p/features.html &#x2605;<br><br>&#x2605; If after updating you have problems we recommend you reboot your phone &#x2605;<br><br>** Most HTC phones require &quot;direct mode&quot; setting. Most gingerbread builds for HTC phones require root access due to HTC changing the permissions on the LED control files. **<br><br>** If upgrading from the &quot;lite&quot; version, please uninstall the lite version first but you can backup and restore settings between versions **<br><br>===================================<br><br><br>Smart Connect extension for SmartWatch 2<br>LiveWare&#x2122; extension for SmartWatch",
    "histogram": {
        "1": 2017,
        "2": 1084,
        "3": 1462,
        "4": 3467,
        "5": 9926
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/lZnqKHcPTaFSP0eYOY3kOr921x9gJkGbElG0X8d8LAjolipKUatNwARUsq0qEpCGd5lf=h310",
        "//lh6.ggpht.com/RDicoHbOsDul2KR3N8_SGjuahsdHUYg8JJYMROBKVEV4s0GSs2Gp0YRYF318uMTb9JM=h310",
        "//lh5.ggpht.com/HXD3W9u5QcPRTWe5Y0C_9i8U63ZPns0xz3mhjXpQSqj8WJjdi3CwWPYkc6calF1jmOc=h310",
        "//lh3.ggpht.com/IPwminlbQuGbtKRZFp5LXTi2TuZI_ir6X79krtp5T5K_8YBDw4Kv0wwMLGD0IHfB-0S8=h310",
        "//lh6.ggpht.com/hd9ND2YVs4oJ7uE5NswPsgeHtNmzu9rAGgBiihScFBS6sKdffB1FCJkt7pptMzIvU0E=h310",
        "//lh4.ggpht.com/k2oiTJ4TH2nxm6UDTRFBlduYNpxnPi2bkabVBZ5TruUZIZ5Vua1SuMJ-mF8WxT1beJzr=h310",
        "//lh3.ggpht.com/gwD_3kTxzM5UztI6RsdsUmEK3_NeX2mhwyMha-Yt8kfLUYsWUrQQV39Dg2Lb4ORX8g=h310",
        "//lh5.ggpht.com/eXddaXCmxZTpEpcV8hcC3Dpzl-KFFTG4c4MVYJ_WEwZuHX8-Gt0_UAEK-csB6GE6FQ=h310",
        "//lh5.ggpht.com/0hQFBmwfUcX2NJ27z-v7TrdmheV9GSecqpk6nuBRRT5zBHxFbf9gRsQ5ZfXul5vL4Kg=h310",
        "//lh5.ggpht.com/X9qNULb-WiiqsaTlvRGRunEg60tjwtG5JIOmUeP8T6r8J2YzLI19MLsDl2bOzHl4Yw=h310",
        "//lh3.ggpht.com/XzHnN7w1WIRusAb52aqASGGl-n8UBY0U8sxbzNEefDhtGDdGuFSDBTvHVwmB8HcM1A8=h310",
        "//lh4.ggpht.com/Nhm8hpRsiG_GT5vBntRXOKBJEvyio48ppxBvGRuDYmyKVSHbY2zsVMimmTD7tpTZjBk=h310",
        "//lh6.ggpht.com/2BIZ_bj67W-NGOuzZutMVBDVjOTn_xtNKqpgX73iFNIsLjqXQkkd_0T2RY2jlY1Eb9I=h310",
        "//lh4.ggpht.com/pc4SUafYfSDzyJQ6cX12vRBJ7EqLeRPtTzEer8H6G3pLs5_1Oag5SKu2SzwV9ylWDC8=h310",
        "//lh4.ggpht.com/29_9yfDi9BuzreAtMD8Ao0BC7Xv6iSXSzlDfCXCivdlhFkh4yWlLCY_H0VbCPhWa9Bpu=h310",
        "//lh5.ggpht.com/-JzbX6yfI3uDULmgfdxKDop7EHsUPbLTEWgLC8EqrKEA2K4y0H06JipvMQqpQXF0IC4=h310"
    ],
    "comments": [
        "I've been using this app for years, across several phones.  It's one of the first apps I install on a new phone, and I'm not sure what I'd do without it.  The author has always corrected any issues that have come up.  Thank you!",
        "the notification light stopped functioning after the most recent update...",
        "This has been a favorite app of mine for years. Works great. The only frustrating thing with the Android O update is that it now shows up in 2 persistent notifications in the drop down panel. Not the app's fault but it's starting to take up a lot of notification real estate. Hopefully Android O or the app allows a workaround.",
        "The app is great, and infinitely customizable. I do notice an issue on my nexus 5X where the app plays the default notification sound under the customized notification sound. You simply turn off the default notification in settings to correct, but I didn't know if this was a bug or not.    Running Android 8, 10/05 security update",
        "The latest update seems to have broken the LED on Android O.  I only ever get a white, quick fishing light now.  Was working perfectly for the prior several years!",
        "I've looked a long time for this level of control and customization for notifications. With the new interface updates, even the settings are impressive. Thanks for your hard work, this is easily worth the purchase.  In case google is targeting this app over any use of the accessibility API, you can tell them this: I have significant hearing loss so the ability to customize ringtones, vibration patterns, LED patterns and screen wake behavior and all the other things Light Flow does is absolutely critical to my ability to use my Android devices effectively. Until Android has native abilities that match Light Flow, I need it to make it possible for me to see, hear or feel when my phone needs my attention. The normal features of Android are not enough."
    ],
    "recentChanges": [
        "* Added new wifi notification type",
        "* Fixed issue with sounds sometimes cutting off or stopping after a while",
        "* Fixed issue where in the notification picker a sound wouldn't stop",
        "* Other bug fixes",
        "http://www.reactle.com/p/change-log.html"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.rageconsulting.android.lightflow&hl=en&gl=us",
    "appId": "com.rageconsulting.android.lightflow"
}