{
    "title": "FragRadio",
    "summary": "FragRadio is a radio streaming service based in Europe",
    "icon": "//lh5.ggpht.com/sXCKAe4w8lcIW_79c4kMoz6-T58vSGx8PB2WbJLcm5pjZjoTABwNBFMwugWghsZjbeE=w300",
    "price": "$1.04",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.2,
    "reviews": 146,
    "developer": "FragRadio",
    "developerId": "FragRadio",
    "developerEmail": "alex@fragradio.com",
    "developerWebsite": "http://www.fragradio.co.uk",
    "developerAddress": "PO BOX 63299,\nLONDON,\nN2 2DH",
    "updated": "September 16, 2015",
    "version": "3.1.1",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Features:- Take Fragradio with you wherever you go- Listen to live radio from one of the UK's Top Gaming Radio's over Wi-Fi and mobile networks- See the currently playing track on the radio- Listen in the background or in standby, with quick access to what’s playing via the notifications panel- Share what's playing with your friends via the share buttonPlease note:Streaming radio is a data intensive service. While FragRadio charges for the application, this does not  include your network operator’s charges for using the internet over mobile networks and costs may be significantly higher when roaming outside of the UK. Connecting via WiFi is recommended where possible.Known Issues:- On slower networks, audio may not be able to stream smoothlyWe are hoping to bring out regular content and coding fixes in due course, thank you for support our station!All funds generated from the sale of our mobile apps go straight back into the running of the station!",
    "descriptionHTML": "Features:<br><br>- Take Fragradio with you wherever you go<br>- Listen to live radio from one of the UK&apos;s Top Gaming Radio&apos;s over Wi-Fi and mobile networks<br>- See the currently playing track on the radio<br>- Listen in the background or in standby, with quick access to what&#x2019;s playing via the notifications panel<br>- Share what&apos;s playing with your friends via the share button<br><br><br>Please note:<br><br>Streaming radio is a data intensive service. While FragRadio charges for the application, this does not  include your network operator&#x2019;s charges for using the internet over mobile networks and costs may be significantly higher when roaming outside of the UK. Connecting via WiFi is recommended where possible.<br><br><br>Known Issues:<br><br>- On slower networks, audio may not be able to stream smoothly<br><br>We are hoping to bring out regular content and coding fixes in due course, thank you for support our station!<br>All funds generated from the sale of our mobile apps go straight back into the running of the station!",
    "histogram": {
        "1": 5,
        "2": 13,
        "3": 15,
        "4": 29,
        "5": 84
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh4.ggpht.com/bfyts6EyGKyIiP9Qodjk59ZcfijaT3jkDTTDBtqZ9VouqWOfunYemFk31GKwvCEM-fts=h310",
        "//lh6.ggpht.com/EoivhqZ5dNrqRkNyK5j2b7tn9GhCPNzYmJ6JMzP2FjKt-2AAGh_L7Hi3mb1P6xNZBtk=h310",
        "//lh6.ggpht.com/TqqlH_ypi07NjJAMntv082_DuirUBTSbecC5nXoeCM4P0974ahIqHrvaH5EOoxeBQ0w=h310",
        "//lh3.ggpht.com/OW1RUZmDPmqB4QJ9suCZEeXJscftEM2i1NiyET4zhXZBhVHPSS9X5KxpCa8xq5F1Q5di=h310",
        "//lh3.ggpht.com/-yCHSL_SNpQwQrQO7nE2gj5aE5oTg3rhKI_hWLgJIhYgxz1DG8M_ENjTooDZsZ8G10I=h310",
        "//lh6.ggpht.com/Mr_OhygBJbHzu8G1gn0cOs8qzjf5e-jBamvT6zLbCjNnx3L36TeePW-CCBZK2i96UQ=h310",
        "//lh4.ggpht.com/tIN3oNSl8ogNrK7UnAZHVd1_5ynEISCvS1kbGQqklqmnJR2F6eB9ckgzWVr3aBmY0iG3=h310",
        "//lh3.ggpht.com/vDzpD5ZUbL_r-5glYcDXfvhEaU7eT6FRTnMi8SRAkw9r3FBdVNvPKUfVkyeRvWVF1YU=h310",
        "//lh3.ggpht.com/cYTTDHxVQCxkUngIKpNWWi6mwm0JnQV0jXC2fjaiHtkx6YKrpX2qS3xTOgX6HPIN7fw=h310",
        "//lh3.ggpht.com/pvMJ83w3h2D5T_uVdP7s02dA6K2Dk6grszeJygP_tHYekyOR_2d_iaU8ERDnl87JnVZn=h310",
        "//lh5.ggpht.com/G4lK8Gpod8HOz--zQurdCgKkzEvPK1gMtYJ_yVVwCOvntKeBYhb0qUdxE5ghl7gxgpUn=h310",
        "//lh3.ggpht.com/5-mX9KhmtqxOQXV7Vz2y-sQ6nk8fEogqpgU3LtZgK3gSWdcpQli5GEyKrrEvaPgTxH0=h310",
        "//lh3.ggpht.com/ltJFv25BAQy_46Kl5zKx_yQNWWuA0tATwz8QOjmtbCHv-Yy3UfVe3gHuoyfaUTK4vQ=h310"
    ],
    "comments": [
        "Music is great but The music and the different genre is very nice but if my phone is not actually on the app it only plays 2 songs ish and then no sound I would have to close the app and re open to listen to again, anyone else experiencing something like this?",
        "Okay but... I can't request or make shoutouts like shown in the pictures. If you add requests (and link it to the list of available songs if possible) I'd be eternally grateful and give you 5 stars :D",
        "Few bugs, but great music. When someone is calling and I answer, music doesn't stop playing. I have to hang up, turn off the radio and call back. Some songs are louder then others.",
        "Glitchy at times The length of music vs the glitches makes it still better than the I heart app",
        "Playback is unreliable, unable to tune in to the station at times and is known to cut-off often, requiring app restart.",
        "How do I request/shoutout? I want to know how to request/shoutout, as I have no idea where the buttons are, and for paying real money instead of just joining a tf2 server with a !radio plugin, I demand satisfaction and the functionality of the server plugin version."
    ],
    "recentChanges": [
        "*2.0",
        "All new look!",
        "Added landscape mode by request",
        "App will now pause music when you're called, or make a call",
        "App pauses music if you lose data connection.",
        "Added backend code to prepare for Chromecast support.",
        "Notifications should be smoother.",
        "Add transparent Notification icon for launchers that support that.",
        "Fixed various crashes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.frag.radio&hl=en&gl=us",
    "appId": "com.frag.radio"
}