{
    "title": "NextTransit Translink",
    "summary": "Fast, intuitive, and smart realtime and offline transit app for Metro Vancouver.",
    "icon": "//lh6.ggpht.com/f9NQbDztUyTb9ygEGgcJkmqOl9ZaBDkZhomwoA7fDd97yk8kB8UigE_CLJMJagWoUrI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.9,
    "reviews": 89,
    "developer": "Kinetiqa Labs",
    "developerId": "Kinetiqa+Labs",
    "developerEmail": "nexttransit@outlook.com",
    "developerWebsite": "https://www.facebook.com/KinetiqaLabs",
    "updated": "September 3, 2014",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "description": "Meet Next Transit Vancouver - an app designed to help you navigate Translink and Metro Vancouver faster and easier. Access REALTIME next bus times for any stop and view the exact locations of all buses serving a given stop. Next Transit Vancouver offers complete offline access to Translink schedules for Bus, Seabus, and Skytrain when Wi-Fi or data is not available.☆ Realtime search: Search stops by stop code or street name. Instantly fetches the upcoming buses and their times from Translink. Offline schedules is used if real time/live search is not available.☆ Bus locations: Tired of not knowing where your buses are? Search up a stop and press to the map button to see where your buses are in realtime☆ Maps: Quickly view all the bus stops on a map and find the one you're looking for. Tap the map icon under the routes view to view the route on a map.☆ Notifications: Want to know when your buses arrive before you even ask? Set a recurring notification for a stop to get realtime arrival times automatically popup on your phone or Android Wear device. ☆ Departure times: Navigate between Weekday, Saturday, or Sunday/Holiday schedules or pick the time you want to leave a given stop by tapping on the clock icon after you've looked up a stop.☆ Route search: What buses go to UBC? Search up a route number or destination to bring up a list of stops for that particular route.☆ Favorites: Tap the star icon to gain quick access to a stop or route from the home screen. Because less work is cool.☆ Nearby stops: Lost? Find nearby stops without using wifi or data! NextTransit calculates the distance to and orientation you should point your phone to get to each stop!☆ Complete Translink Schedules: Search a stop and tap the '19' routes icon to access the full schedule of that stop. Take NoteOnce unpacked, NextTransit will require approx. 75 MB of space on your phone memory. NextTransit may take up to a few minutes (depending on the device) on first launch to build the database on your phone. Fine PrintThis app is ad-supported. We are not affiliated with Translink. Coded with care at the UBC Vancouver campus.",
    "descriptionHTML": "Meet Next Transit Vancouver - an app designed to help you navigate Translink and Metro Vancouver faster and easier. <br><br>Access REALTIME next bus times for any stop and view the exact locations of all buses serving a given stop. Next Transit Vancouver offers complete offline access to Translink schedules for Bus, Seabus, and Skytrain when Wi-Fi or data is not available.<br><br>&#x2606; Realtime search: Search stops by stop code or street name. Instantly fetches the upcoming buses and their times from Translink. Offline schedules is used if real time/live search is not available.<br><br>&#x2606; Bus locations: Tired of not knowing where your buses are? Search up a stop and press to the map button to see where your buses are in realtime<br><br>&#x2606; Maps: Quickly view all the bus stops on a map and find the one you&apos;re looking for. Tap the map icon under the routes view to view the route on a map.<br><br>&#x2606; Notifications: Want to know when your buses arrive before you even ask? Set a recurring notification for a stop to get realtime arrival times automatically popup on your phone or Android Wear device. <br><br>&#x2606; Departure times: Navigate between Weekday, Saturday, or Sunday/Holiday schedules or pick the time you want to leave a given stop by tapping on the clock icon after you&apos;ve looked up a stop.<br><br>&#x2606; Route search: What buses go to UBC? Search up a route number or destination to bring up a list of stops for that particular route.<br><br>&#x2606; Favorites: Tap the star icon to gain quick access to a stop or route from the home screen. Because less work is cool.<br><br>&#x2606; Nearby stops: Lost? Find nearby stops without using wifi or data! NextTransit calculates the distance to and orientation you should point your phone to get to each stop!<br><br>&#x2606; Complete Translink Schedules: Search a stop and tap the &apos;19&apos; routes icon to access the full schedule of that stop. <br><br><br>Take Note<br>Once unpacked, NextTransit will require approx. 75 MB of space on your phone memory. NextTransit may take up to a few minutes (depending on the device) on first launch to build the database on your phone. <br><br>Fine Print<br>This app is ad-supported. We are not affiliated with Translink. Coded with care at the UBC Vancouver campus.",
    "histogram": {
        "1": 8,
        "2": 12,
        "3": 11,
        "4": 9,
        "5": 49
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "2.3.3 and up",
    "androidVersion": "2.3.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/_Ke9yps_vUki18dX6jVN3hp3PWcZkxUsB8apoLN38NlqfKrkVSRfQhbuNCMR-hDKo7U=h310",
        "//lh5.ggpht.com/33AWqk8EvQ2jVYQhrH2uO1uuqoztCvWACZD_zQbFKkvYvhbb48rKjPahSfy2g6wwaQ=h310",
        "//lh5.ggpht.com/pMRoJu3xxWo2gK0DfUdj0yQm3oaKqX8POaq8IEqc6fPbm7vVZLBMINDbFFv9HhtFTK0=h310",
        "//lh5.ggpht.com/jXZil1LTr_E1yPEex9Njm9CVbSqTlkzjIa9QlQqgrC96CFTrOPRdWxVwBPrf8_zdmOOr=h310",
        "//lh5.ggpht.com/DLxYUllnxvLRs8i3zY2U9OG28FqZFTYrI4Tjx_8ctDZbrf6xm5SqXhlV0QuVV8a8PaJd=h310",
        "//lh6.ggpht.com/vk-Jen1tiE2GUAPi5g5YN6-fjXnlMu9yjYCgc2cD-lTLlespGm1KokKDVp5Nqe3Akeg=h310",
        "//lh4.ggpht.com/Ahy6B8zNwlsqlCunRV4qWZO0VfvHicso8GbZCzFmAQ3IsAtJ7-ifz5TtiuQx3sbO6-FH=h310",
        "//lh4.ggpht.com/3ojJnJltLbKdDe6sIDiErlaxmw6Y1jrc7Hvu2XDNN8hZ72BlcZhlBgxfXXTGO9dX1H4=h310",
        "//lh3.ggpht.com/8KQRsUkuTd9knmKBCQ0qDh8gj_TWv_nSqBBEmnhgao4SvctYmjttCvbpynvisuXJVvTr=h310",
        "//lh5.ggpht.com/7IYC7dxrZzAKC9vFc-kkj4_ikRXePySSll9rW2oc8JGoi9T_7PQrpmNU2lvF1GjyhLLu=h310",
        "//lh3.ggpht.com/RkARwWQcjKC49RzvglAd1F3T3HQI_sNa2s37kUA_e4Yyh2QdOIsrbwiEn9Z9syaCzA=h310",
        "//lh5.ggpht.com/uwOAwEiM8gO1CldTQyS49vrl6BRlkMVSLJc1jU3-GnvXA1EsV6bzsWI23IGQJTLO3qD8=h310",
        "//lh3.ggpht.com/IORXDCucPmKxgES-Ndv6LlfM0La-NFO-7oEIGoBS8LbVtGoOxQJUlxum8meG0eiIx9g=h310",
        "//lh4.ggpht.com/Vgou3lf-YkI0H1_aUCcPPL-xlwKc-EfPlWZu7I1S82m1lzx_rjLwG3wbiqd3HRnd27xL=h310",
        "//lh4.ggpht.com/Uuf0J5KT8aYZUrslTB9d7SO-9D8EYv9GRuktf4T3i2H8-C3nuPUqfcnXcOi0NHm79aI=h310",
        "//lh6.ggpht.com/KNomKYIHfer-gwXM_4m5BJdNb71IK8PcMOgWk2jN689cuxHTbtN0ukfOc37bakG14Yc=h310",
        "//lh4.ggpht.com/h7xLlpXYpXMsM2mR3Qc60kWNvsGvFus3GIVriC2OBOwJB1N0cI5YvV3-YTO_84gO8r8=h310"
    ],
    "comments": [
        "Wrong listings, wrong times, existing bus stops don't appear to exist on the app, stops that haven't existed in years, however, do. How old are the maps you are using? Completely useless. Can't exit the app via back button either. Poorly coded, long outdated tosh. Unsurprising, seeing how the latest update was like three years ago. This app should be pulled from the store.",
        "Stupid spelling of name and more Poor GUI. can't determine where bus is.  Use BusLink instead (also stupid spelling but works)",
        "It is helpful.  I love it.",
        "Live it",
        "Nice app. Timetable times are accurate. But the main functionality missing - you can't close it. It sits open until you go to task manager and force close it.",
        "Best transit tool Handy tool to have if you're dependent on the transit system here like me. Check it out."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.kinetiqa.nexttransitvancouver&hl=en&gl=us",
    "appId": "com.kinetiqa.nexttransitvancouver"
}