{
    "title": "Volume Butler",
    "summary": "Automate your volumes",
    "icon": "//lh3.googleusercontent.com/feTbIUEKRfSI0BbBS0aYoWWyGnq_4wSWLyJOuxO2XffCHLfETIkzWxw8iFK9bHxx2c4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.9,
    "reviews": 1037,
    "developer": "TUOGOL",
    "developerId": "TUOGOL",
    "developerEmail": "tuogol.inc@gmail.com",
    "developerWebsite": "http://www.tuogol.com/volumebutler",
    "developerAddress": "None of your business way 1234",
    "updated": "December 8, 2017",
    "version": "2.4.5",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Volume Butler makes volume management simple. In fact after you are setup Volume Butler makes changing your volume a thing of the past.The idea is  that you can take a snap shot of all your volumes at one time and put them into a group. These groups are called “Profiles” and these profiles can then be used in numerous ways to make managing volumes effortless.Some of the many features found in Volume Butler include:• Schedule sound profiles when you’re at home, work, anywhere!• Automatically apply a profile when driving• Apply audio profiles based on your location• Use Quick Schedules to silence your device for naps or meetings• Separate Ringer and Notification volumes for devices with merged volumes• Apply a profile when you charge your phone• Use Notifications to customize your notification sounds and vibrate pattern• Customize 4 widgets to your hearts intent• Make use of 4 types of shortcuts for Profiles and Quick Schedules• Automate how your phone sounds with Tasker• Change how your device sounds with as little as one click• Simplify your life with different volume for the Speakerphone• Apply profiles right from your notification bar• DashClock Extension support• Volume Lock - Lock your volumes so they do not change• Apply Profiles from Google Now Voice Commands!• App Control - Adjust your volumes based on application start and exit events. The purpose of Volume Butler is to provide an exceptional way to manage your volumes and audio profiles is how this is accomplished. An audio profile is a group of volume related settings that is saved and can be applied at a later time. Once you have a few profiles you can then automatically have your device apply a profile based on things like location, when you are driving, from your notification bar, and dozens of other ways.Want to add Volume Butler to your app? Checkout http://www.tuogol.com/volumebutler/code/ for details.A complete feature-by-feature breakdown of Volume Butler can be found by visiting http://www.tuogol.com/volumebutlerThis application could also be know as a sound manager, audio manager, volume manager, or volume management app, as well as app volume control.",
    "descriptionHTML": "Volume Butler makes volume management simple. In fact after you are setup Volume Butler makes changing your volume a thing of the past.<br><br>The idea is  that you can take a snap shot of all your volumes at one time and put them into a group. These groups are called &#x201C;Profiles&#x201D; and these profiles can then be used in numerous ways to make managing volumes effortless.<br><br><br>Some of the many features found in Volume Butler include:<br><br>&#x2022; Schedule sound profiles when you&#x2019;re at home, work, anywhere!<br>&#x2022; Automatically apply a profile when driving<br>&#x2022; Apply audio profiles based on your location<br>&#x2022; Use Quick Schedules to silence your device for naps or meetings<br>&#x2022; Separate Ringer and Notification volumes for devices with merged volumes<br>&#x2022; Apply a profile when you charge your phone<br>&#x2022; Use Notifications to customize your notification sounds and vibrate pattern<br>&#x2022; Customize 4 widgets to your hearts intent<br>&#x2022; Make use of 4 types of shortcuts for Profiles and Quick Schedules<br>&#x2022; Automate how your phone sounds with Tasker<br>&#x2022; Change how your device sounds with as little as one click<br>&#x2022; Simplify your life with different volume for the Speakerphone<br>&#x2022; Apply profiles right from your notification bar<br>&#x2022; DashClock Extension support<br>&#x2022; Volume Lock - Lock your volumes so they do not change<br>&#x2022; Apply Profiles from Google Now Voice Commands!<br>&#x2022; App Control - Adjust your volumes based on application start and exit events. <br><br>The purpose of Volume Butler is to provide an exceptional way to manage your volumes and audio profiles is how this is accomplished. An audio profile is a group of volume related settings that is saved and can be applied at a later time. Once you have a few profiles you can then automatically have your device apply a profile based on things like location, when you are driving, from your notification bar, and dozens of other ways.<br><br>Want to add Volume Butler to your app? Checkout http://www.tuogol.com/volumebutler/code/ for details.<br><br>A complete feature-by-feature breakdown of Volume Butler can be found by visiting http://www.tuogol.com/volumebutler<br><br>This application could also be know as a sound manager, audio manager, volume manager, or volume management app, as well as app volume control.",
    "histogram": {
        "1": 134,
        "2": 68,
        "3": 114,
        "4": 224,
        "5": 497
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Ww9LubpzV7HM-JhEXbx7k4_wlYHIO_017CVIGoT-8Dd_TgHZxFR7EVivk9BY7aj6J6og=h310",
        "//lh3.googleusercontent.com/hiKjf1jusqugI2R-rmC2fMLkxuVPD45J1hsdUyZexUJlSARP543r6kFluOujP2Ewq_E=h310",
        "//lh3.googleusercontent.com/f-A9okJd9cy2pu4u0uWVBpSLKgeOZrXCd2tBO0mLvR2lO-mX7A4CKrG6swKqfYOt8g=h310",
        "//lh3.googleusercontent.com/KWk4UaAZhC9hOcUyjAJxzjRT98LLR5OpxrxyiX2HZ3e1nml6mBMxptxTwK34SxM-vg=h310",
        "//lh3.googleusercontent.com/M4qKuwpGzkx6btWtarwyvc_MMspPnH_UpKjnajrFd0n38a0bsnzGvgTKC49nCZKIvGKW=h310",
        "//lh3.googleusercontent.com/4migmXw82tCgYzJiDeO5MuYL_ORoIW9lVYtc4ZgWLz4zF6t143g0fTjqVyP2JuM6vw=h310",
        "//lh3.googleusercontent.com/d7MOKFIoZwM5XKu4ElwEVC34zaJw7KkyncxxG8eCNKflz0bAGE-80OAyumKJeH8vzv0=h310",
        "//lh3.googleusercontent.com/lXvnzV9SsHJVWByJfiO_QATaDbiwKOkVyAS5kymWg7eV5Bq1oA3Gl5eugQbks8eop46r=h310",
        "//lh3.googleusercontent.com/IRPsRVf7yRGm1dBf0RCArNdALlk6_Ubx97hPsy9L-Gqt-UC-xUdoF9CavQJK1klb7A=h310",
        "//lh3.googleusercontent.com/8ptfuQSqHv-Zs37JPnelx3ahRNk6DcDPPetV_FOB_TNZbIuQ-S8RbCQ7mSG4tzJ-WJyR=h310",
        "//lh3.googleusercontent.com/9y9hEMtvti7JwKawl3otGpQBKVTdZjLVsDQ4_X9EANgkBPyx1GOFwMDiPHpfKLk0fEZO=h310",
        "//lh3.googleusercontent.com/RQu65ChuxMWIdnSSLWG8YPn-h2eZ26q3lGl4bFoUvQUd2T5MUJejnWh3MGmIV7NUY2s=h310",
        "//lh3.googleusercontent.com/aItRcc8yRNXgZjlUTWQ5_t464YOMJvajEAN9GNDdmgE_IRLN-9gNocy0LsuuLGv5hg=h310",
        "//lh3.googleusercontent.com/khGlXs1WCx6OZjkosJhvqXu0nUTbKxZbGHyo5Plr68vShNsFywTEizvfJ--rfNmANA=h310",
        "//lh3.googleusercontent.com/dQ-3djAnWGsugXbVa5PvKpYl-Ckled_L1fuoc65_ylMD3OPfdb7paqytO_kw54yU0BQm=h310",
        "//lh3.googleusercontent.com/qThCnpHZ1rCHMEqg56L0LmJ_43cyZfiD_-W4IMRzw0QWEjdOdg4IoSKgo8atTiIcwA=h310",
        "//lh3.googleusercontent.com/zXwvuyeAjDWqhbDfAXlOxXEHphSo62uRk0eOAn5Pe6j0UI9V5pv0eAv-MNAZlkQWKFI=h310"
    ],
    "comments": [
        "So I was reading the help site and it mentioned a WiFi trigger. I didn't see it in the app but thought paying for the Unlock Features would enable it. Not only did the IAP not enable that feature, it didn't seem to enable anything. I tried asking for a refund but never got a response.  The Profiles are also a little clunky. I wish they had the option of only setting specific categories. I never really want my Media volume set to something specific. I just want it what I have it set to last.   I do like that it allows me to separate my Ringer and Notification volumes on my Pixel XL without root.",
        "I purchased this app to separate the notification and ringer volumes. Free version doesn't have this. Paid the $3.99 and it didn't appear to have added this feature. After hacking through the options, it seems that it may have added it.  Very confusing layout and not sure how to set it up.  I would choose another app for addressing something as important as ensuring that you don't miss phone calls. ... After further use I figured out how it works.  My I comments were due to Operator Error (me).  It's a pretty good app.  A few small enhancements, however,I would it much easier to configure and view current settings.",
        "Would only show Permissions screen.  No way to get passed that.  Probably need to give it more permissions then it needs.  If that's the case, what's the point of letting me choose in the first place?",
        "One of my schedules triggers a Profile at random times of the day. How do i fix this.",
        "Couldn't get past the first window telling me it needs permissions, but doesn't say what.",
        "The Wear app is back!"
    ],
    "recentChanges": [
        "Fixes History showing inaccurate months. Reintroduces the Wear app."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mobiletrialware.volumebutler&hl=en&gl=us",
    "appId": "com.mobiletrialware.volumebutler"
}