{
    "title": "Heart Trace",
    "summary": "Use your Android Wear smartwatch to automatically monitor your heart rate.",
    "icon": "//lh3.googleusercontent.com/A8-G7X2F8aQaKUDmwZ1tUBfj5N83F8Jh1d8y-45Yq7tI9WD96uFLz3_etfuF-TPWintT=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 350,
    "developer": "magic09 applications",
    "developerId": "magic09+applications",
    "developerEmail": "magic09.apps@gmail.com",
    "developerWebsite": "https://plus.google.com/communities/101781392757311833259",
    "developerAddress": "magic09 applications,\nOffice 11694,\nPO Box 15113,\nBirmingham,\nB2 2NJ",
    "updated": "September 26, 2017",
    "version": "1.5.1",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Heart Trace automatically checks your heart rate at regular intervals via your Android Wear smartwatch and then syncs this data with Google Fit.  You can view your heart rate by the day, hour or minute or as a daily summary.Android Wear smartwatch with heart rate sensorThis app requires an Android Wear smartwatch with a heart rate sensor.  You will also need to connect to your Google Fit account to enable syncing of heart rate readings.  Heart rate reading frequency and accuracy can be configured but are ultimately dependant on your Android Wear smartwatch heart rate sensor.Features• Automatically monitor your heart rate.• Full control over monitoring settings.• View all your data by the day, hour or minute.• Regularly sync your heart rate readings to Google Fit.• Export your readings to a CSV file.• Sports mode - continuously monitor your heart rate.In-app purchasesHeart Trace is free.  No ads.  No paid features.  But if you would like to support Heart Trace development you can do so in the app by clicking donate and selecting an option - thank you.Coming soon• Sync all readings to and from Google Fit.• Remove readings from Google Fit.• Android Wear 2.0 standalone app.App usageThis app is for personal health information and is not a substitute for proper medical assessment or diagnosis.  If you have any concerns about your heart rate please contact a medical professional.Permissions required by this application• Body sensors - enables heart rate detection.• Storage - enables export data to CSV.Help and supportIf you have any questions please get in touch either on email (magic09.apps@gmail.com) or through the Heart Trace Google+ community:https://plus.google.com/communities/101781392757311833259Community and beta testingWant to test out new features of Heart Trace before anyone else?  Just become a beta tester - option at the bottom of the app listing. Have you got a good idea for a feature? Are you interested in what new features are planned? You can find out more at the Heart Trace Google+ community:https://plus.google.com/communities/101781392757311833259",
    "descriptionHTML": "Heart Trace automatically checks your heart rate at regular intervals via your Android Wear smartwatch and then syncs this data with Google Fit.  You can view your heart rate by the day, hour or minute or as a daily summary.<br><br><b>Android Wear smartwatch with heart rate sensor</b><br>This app requires an Android Wear smartwatch with a heart rate sensor.  You will also need to connect to your Google Fit account to enable syncing of heart rate readings.  Heart rate reading frequency and accuracy can be configured but are ultimately dependant on your Android Wear smartwatch heart rate sensor.<br><br><b>Features</b><br>&#x2022; Automatically monitor your heart rate.<br>&#x2022; Full control over monitoring settings.<br>&#x2022; View all your data by the day, hour or minute.<br>&#x2022; Regularly sync your heart rate readings to Google Fit.<br>&#x2022; Export your readings to a CSV file.<br>&#x2022; Sports mode - continuously monitor your heart rate.<br><br><b>In-app purchases</b><br>Heart Trace is free.  No ads.  No paid features.  But if you would like to support Heart Trace development you can do so in the app by clicking donate and selecting an option - thank you.<br><br><b>Coming soon</b><br>&#x2022; Sync all readings to and from Google Fit.<br>&#x2022; Remove readings from Google Fit.<br>&#x2022; Android Wear 2.0 standalone app.<br><br><b>App usage</b><br>This app is for personal health information and is not a substitute for proper medical assessment or diagnosis.  If you have any concerns about your heart rate please contact a medical professional.<br><br><b>Permissions required by this application</b><br>&#x2022; Body sensors - enables heart rate detection.<br>&#x2022; Storage - enables export data to CSV.<br><br><b>Help and support</b><br>If you have any questions please get in touch either on email (magic09.apps@gmail.com) or through the Heart Trace Google+ community:<br>https://plus.google.com/communities/101781392757311833259<br><br><b>Community and beta testing</b><br>Want to test out new features of Heart Trace before anyone else?  Just become a beta tester - option at the bottom of the app listing. Have you got a good idea for a feature? Are you interested in what new features are planned? You can find out more at the Heart Trace Google+ community:<br>https://plus.google.com/communities/101781392757311833259",
    "histogram": {
        "1": 23,
        "2": 13,
        "3": 9,
        "4": 45,
        "5": 260
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Dy-jTQY09G6G8eNuvl3kWwqHohoPzCoh__7RFlZhI05t7_4CInO6JiowyKXMOlKmfQ=h310",
        "//lh3.googleusercontent.com/V0noEnoL172QSTxFwVp01gr7FRij7RC_hSIe9Ppj6KiUmztaObYT2wkOZNpxh5N-Vmo=h310",
        "//lh3.googleusercontent.com/1aIBDqCcqS9WhWc9l2tBETOgIgNsGJwnvlpkF7NzRZdo6zOdHLts_u9d8dNIcfe_xkg=h310",
        "//lh3.googleusercontent.com/GPkBEVP15sjuyxnUAy8Te9QclXk31bjx9VVnTCBY39bFrPf291tSqyqhw_RKpNaTArcb=h310",
        "//lh3.googleusercontent.com/-fgNcbAJy-MDf9I2gY8I6hG3atTOt1Z3UmuMab0Hrc3HW722lJTYRVFzyoBdNPcLxQ=h310",
        "//lh3.googleusercontent.com/Id3h8z8i26X2Mbc6T6m-P0I2iUXhxD4f9yE6umNlrIgJdH56O2bexaTPg7cqbNrXoZk=h310",
        "//lh3.googleusercontent.com/j53nmW6Jv1mNf2K1teaQVC4WqRB7mjsiwW-tzFW9W5QE1MqDSjAumowTTQi4WK6ta89F=h310",
        "//lh3.googleusercontent.com/eokzvUZQmbJIfhnth7E5-jl4JI-ma0RHb-SeDxfNq4hbTxqG84A0axNza6K2w74ujQ=h310",
        "//lh3.googleusercontent.com/DFqOTw42Qt9NBs2lH_uK2OBnT7n3UxSbI68spTomOa61204FUjfC23sk2mH4bEIoZA=h310",
        "//lh3.googleusercontent.com/pP0sKWwDwc_71u0_al4xpqni8WbpZL6DU5J_e-FTArx3KO8F01mwWBybwBPmP9tuHA=h310",
        "//lh3.googleusercontent.com/rYwagE1OajVEI9l7ZYBO6zP2IV3vF9FMfYojUu52Qi5DF9O8vcvskS5sSVG1p6K_2CE=h310",
        "//lh3.googleusercontent.com/wVkvboRfhowHsm5vr6vRio-Ru7YZrt2me5guqThmPBw7HjcGfwn4guXXvtoZSVqctQ=h310"
    ],
    "comments": [
        "How about adding a new features like 1) smart sleep alarm, 2) adding a watch face for moto 360, where in user can get the data right on their watch face,  no need to access the app everytime 3) automatically understanding workout mode in the background, 4) sleep hours detection, ability to access heart rate data on website. 5) move your body triggering through smart watch vibration, which will make alert to a user to switch their body position or have a walk after a long time of sitting.",
        "The automatic measure does not work at all. I have now been using it for 5 days. And only stores the data when I go into the app and press measure.. I have seen that it activates the pulse reading due to the green LEDs are blinking, but no data is recorded. What to do? I have a Ticwatch E",
        "Add in an option for 24 hour monitoring. Right now I stop it at 11:59 and Start at 12:00. Also there seems to be huge gaps in time period when this app is inactive. Not sure if its on the watch side or the phone side. Seems to happen an hour after the app was last opened. I'm using the new Tic Watch. Also the exported rows should save to the second, not minute.",
        "This is a pretty phenomenal app!!! Ive purchased 2 other heart rate apps, but this one works so damn well, and look so damn nice! I'm gunna purchase just to support the dev! Nice job, amazing app!",
        "Excellent app, exactly what I was after - simple, clean, nice graphs for scheduled heart rate monitoring. Working great with my Huawei Watch.",
        "This is a very high quality app. By far the best I have used for monitoring heart rate. Great work. Would be great feature to have alerts on high heart rate."
    ],
    "recentChanges": [
        "1.5.1",
        "- New help area (includes settings guide)",
        "- Heart Trace Google+ community link now in nav drawer",
        "- Performance improvements and bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.magic09.magicheartraterecorder&hl=en&gl=us",
    "appId": "com.magic09.magicheartraterecorder"
}