{
    "title": "Anytime Gallery for Wear",
    "summary": "The most complete gallery app for your Android Wear watch",
    "icon": "//lh3.googleusercontent.com/IYWtrU8i-lBIcOgPauf8kkJsbaoIkVHf7EMC3g1Myv2qf-CVTew6-g3Mwex4RlK6eoM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.8,
    "reviews": 848,
    "developer": "Moletag",
    "developerId": "7191353336399169728",
    "developerEmail": "support@moletag.com",
    "developerWebsite": "http://anytime.gallery",
    "developerAddress": "Moletag Ltd\n27 Old Gloucester Street\nLondon, WC1N 3AX\nUnited Kingdom",
    "updated": "November 7, 2017",
    "version": "Varies with device",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "size": "Varies with device",
    "description": "Transfer and sync your photos from your phone or tablet to your Android Wear watch, so that you enjoy your favorite moments on your wrist. Simply, easily, intuitively.✔ Select the albums you wish to transfer and sync✔ Set auto-sync interval period✔ Add a photo directly to your watch face (Android Wear 2.0 complications)✔ All photos on the internal storage and the SD card are supported✔ Zoom feature supported✔ Slideshow✔ Material design look & feelWith the free version of the app you can transfer and sync up to 20 images. For an unlimited number of albums and images on your watch, upgrade to the premium version through a single in-app purchase. If you upgrade and you change your mind later, don't worry. Simply send us an email and we will instantly refund you. We offer a lifetime return policy.Need any help? Please feel free to contact us at support@moletag.com. Our friendly team will be happy to assist you.",
    "descriptionHTML": "Transfer and sync your photos from your phone or tablet to your Android Wear watch, so that you enjoy your favorite moments on your wrist. Simply, easily, intuitively.<br><br>&#x2714; Select the albums you wish to transfer and sync<br>&#x2714; Set auto-sync interval period<br>&#x2714; Add a photo directly to your watch face (Android Wear 2.0 complications)<br>&#x2714; All photos on the internal storage and the SD card are supported<br>&#x2714; Zoom feature supported<br>&#x2714; Slideshow<br>&#x2714; Material design look &amp; feel<br><br>With the free version of the app you can transfer and sync up to 20 images. For an unlimited number of albums and images on your watch, upgrade to the premium version through a single in-app purchase. If you upgrade and you change your mind later, don&apos;t worry. Simply send us an email and we will instantly refund you. We offer a lifetime return policy.<br><br>Need any help? Please feel free to contact us at support@moletag.com. Our friendly team will be happy to assist you.",
    "histogram": {
        "1": 133,
        "2": 54,
        "3": 84,
        "4": 176,
        "5": 401
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/o-2O2KzIjdVqDoRwH8PY1QJ21zwKeJab8cBbuslpMrR7kiYhVbVs9YcC2ZvXu-UC8A=h310",
        "//lh3.googleusercontent.com/mfNbF7jbpH-SSlR6o9HB4kCifBwBtexhp583mwmsRsMUqGiYgd_kCHukPlVaFZXuai4=h310",
        "//lh3.googleusercontent.com/q6LqQewb76iDDW_tIY25ncyxqNYJQWOl_5U1bSXYICqWbLzqBctgv0IopTSVma-vSFoW=h310",
        "//lh3.googleusercontent.com/IzGrLGrO8ZRWLbkdz8-QwciLVpdQ88heoZkvjG8KRteOBl47F6eHkF79YiO_WiuXVw8=h310",
        "//lh3.googleusercontent.com/nWFiSFzSD8UifVbaBB3zrsd5gcl5OrBlxn6sgGSiFF73bGG4bhVZ0ajVyf0nDFzmcqQ=h310",
        "//lh3.googleusercontent.com/snVL2ONFVxoLScjjGKLOBPZoQ2I4vFmvpeijfCgpIiRMEI2XScW6FYzGoMduX_4G1K8=h310",
        "//lh3.googleusercontent.com/-N0LkGBj18gKa6X42gCB1WqVxVaddGpD9UwrJOHAKwbsXflY1FNWCsZ5C4UBdli-Q5Q=h310",
        "//lh3.googleusercontent.com/EIc7IEBGBWfIw20b_erhrEg0NGSTKQN2ZOANNIK-B3t61DSd28znXHYF6WC-b7Y6zSI=h310"
    ],
    "video": "https://www.youtube.com/embed/Lzx2DRFRXZk",
    "comments": [
        "Great app, very useful at times. That said, there are some quite annoying bugs that could use fixing. Many times when I sync an album to the watch it will load and say \"sync successful\" and the album will show up on the watch with no photos in it. I try deleting and syncing again -- doesn't work. I have to delete the app on my phone and watch and reinstall to fix, doing this every time makes the app finicky but still very useful in class :)",
        "This person should have all their apps free but this one. By far still the best after two years using it on wear 1.5 and 2.0. The person would have a mint. So many other similar apps I paid for and this is free and by far the best period. BTW I do not work for these people and rarely if ever write a review unless they're in the gutter or they're very best.",
        "To the developers i need to say something.  It used to work great with my zenwatch 3 buy recently i updated the watch to wear 2.0 and suddenly i ended up getting pixilated images on my watch after sync. This is really a big deal for me because I use this app for many important purpose and a clear photo in the watch is highly required.  If u guys are listening plz do something.",
        "Till now this app is very useful, you can see through ur watch up to 20 photos and i think its enough... usually we dont use our gallery so much.",
        "Very annoying app some times the photos are not being transferred from phone to watch.",
        "There are some sync issues and every time the display goes off the app closes"
    ],
    "recentChanges": [
        "Version 3.2",
        "· Added support for Android O",
        "· Added the option to change the image quality",
        "· Bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.moletag.gallery&hl=en&gl=us",
    "appId": "com.moletag.gallery"
}