{
    "title": "MY ASICS Run Coaching",
    "summary": "MY ASICS is the best adaptive training program for runners.",
    "icon": "//lh6.ggpht.com/161qEeKnNXBTPJFf1pCOvMjV7o5X9D1NzWX6vwvc-xkPM7lttX_uVEylyWQbj9LRlg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.6,
    "reviews": 4801,
    "developer": "ASICS",
    "developerId": "ASICS",
    "developerEmail": "info@myasics.com",
    "developerWebsite": "http://getsatisfaction.com/myasics/",
    "developerAddress": "Asics\nALIVE MITAKE  1-2-5, Shibuya, Shibuya-ku, Tokyo, 150-0002, Japan",
    "updated": "January 17, 2017",
    "version": "3.3",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Start training with MY ASICS. Create personalized running training plans for full marathons, half marathons, 10K, 5K, 10 mile and 5 mile distances. MY ASICS training plans adapt to your goals and abilities as you run, and automatically adjust your schedule if you miss a run day. You can also track your running route, total time, lap times, distance, and average pace in real time. Try it now and see why 2 out of 3 MY ASICS runners beat their goals. DESIGNED FOR ALL RUNNERS Whether you are just starting out on your first 5K, or you are preparing for your tenth full marathon, MY ASICS is designed for you. MY ASICS training plans range in length from 12 to 33 weeks and 2 and 4 day training schedules per week. You can personalize the intensity and frequency of your training plan to match your current running ability and fitness. MY ASICS has all the features you need to maximize your training: * Get your personalized run training plan in seconds* View your position and running route on a real-time GPS-based map* Track your run route, total time, lap times, distance, and average pace * Adjust your pace to maximize performance * Look ahead at your schedule, phases and upcoming runs* Save your routes and sync your runs with online logbook * Log runs manually, if you prefer to run without your phone* Share your runs and achievements with friends* Track the mileage on your shoes and other gearMY ASICS was developed over 7 years of running performance research by the ASICS Institute of Sport Science in Kobe, Japan. MY ASICS uses a proprietary algorithm to build up your anaerobic threshold to improve endurance and maximize performance. MY ASICS WORKS WITH YOUR FAVORITE DEVICES  * Android Wear — control your run and track your progress on your favorite Android Wear device* SONY Smart B-Trainer — get the wearable headset that allows you to playback music at the right tempo to keep you on-pace for your MY ASICS run* Seiko ASICS WATCH AP02 — connects directly to your MY ASICS account* SONY SmartBand Talk SWR30 ― receive pace guidance and see your current pace and distance traveled during your run* Import data from Garmin, Polar, Suunto, TomTom and other wearable devices * Integrate with Runkeeper — sync your account with other health and fitness apps through the web platformINSTRUCTIONSDownload MY ASICS and create a free, personalized plan on the \"plan\" tab— then lace up and start running. If you already have a MY ASICS account, simply log in to sync your current plan and recent runs to the app. Note: Continued use of GPS running in the background can dramatically decrease battery life.FEEDBACK & SUPPORTWe would like to know what you think of the app. To send feedback or get support, click on the Feedback button in the Settings section of the app. Get out there and have a great run!ABOUT ASICSASICS is a trusted and respected world leader in running, and MY ASICS was created to bring our sport science to every runner who wants to achieve their running goals.",
    "descriptionHTML": "Start training with MY ASICS. Create personalized running training plans for full marathons, half marathons, 10K, 5K, 10 mile and 5 mile distances. MY ASICS training plans adapt to your goals and abilities as you run, and automatically adjust your schedule if you miss a run day. You can also track your running route, total time, lap times, distance, and average pace in real time. Try it now and see why 2 out of 3 MY ASICS runners beat their goals. <br><br>DESIGNED FOR ALL RUNNERS <br><br>Whether you are just starting out on your first 5K, or you are preparing for your tenth full marathon, MY ASICS is designed for you. MY ASICS training plans range in length from 12 to 33 weeks and 2 and 4 day training schedules per week. You can personalize the intensity and frequency of your training plan to match your current running ability and fitness. MY ASICS has all the features you need to maximize your training: <br><br>* Get your personalized run training plan in seconds<br>* View your position and running route on a real-time GPS-based map<br>* Track your run route, total time, lap times, distance, and average pace <br>* Adjust your pace to maximize performance <br>* Look ahead at your schedule, phases and upcoming runs<br>* Save your routes and sync your runs with online logbook <br>* Log runs manually, if you prefer to run without your phone<br>* Share your runs and achievements with friends<br>* Track the mileage on your shoes and other gear<br><br>MY ASICS was developed over 7 years of running performance research by the ASICS Institute of Sport Science in Kobe, Japan. MY ASICS uses a proprietary algorithm to build up your anaerobic threshold to improve endurance and maximize performance. <br><br>MY ASICS WORKS WITH YOUR FAVORITE DEVICES  <br><br>* Android Wear &#x2014; control your run and track your progress on your favorite Android Wear device<br>* SONY Smart B-Trainer &#x2014; get the wearable headset that allows you to playback music at the right tempo to keep you on-pace for your MY ASICS run<br>* Seiko ASICS WATCH AP02 &#x2014; connects directly to your MY ASICS account<br>* SONY SmartBand Talk SWR30 &#x2015; receive pace guidance and see your current pace and distance traveled during your run<br>* Import data from Garmin, Polar, Suunto, TomTom and other wearable devices <br>* Integrate with Runkeeper &#x2014; sync your account with other health and fitness apps through the web platform<br><br>INSTRUCTIONS<br><br>Download MY ASICS and create a free, personalized plan on the &quot;plan&quot; tab&#x2014; then lace up and start running. If you already have a MY ASICS account, simply log in to sync your current plan and recent runs to the app. <br><br>Note: Continued use of GPS running in the background can dramatically decrease battery life.<br><br>FEEDBACK &amp; SUPPORT<br><br>We would like to know what you think of the app. To send feedback or get support, click on the Feedback button in the Settings section of the app. Get out there and have a great run!<br><br>ABOUT ASICS<br><br>ASICS is a trusted and respected world leader in running, and MY ASICS was created to bring our sport science to every runner who wants to achieve their running goals.",
    "histogram": {
        "1": 665,
        "2": 495,
        "3": 676,
        "4": 1125,
        "5": 1840
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/i_Fa-EzIxTMewyG1258eWvO3f6LJvHoDZE5XSUYPv4-CJVMMaG8nKX3x2nEaTV7KpQ=h310",
        "//lh3.googleusercontent.com/tGBo5L0Xw7VNzo1iGlhmo18h0mgjGXjUjNBG_Zlj6pRHwpBuMe9FMXDRnfrnqdV9knMi=h310",
        "//lh3.googleusercontent.com/DYoWsD6MJwvrlJOzzeYsepqbNONI1VwkY-n4-a8dtKszxLrqH9Mt-BkHjmegT4n2c18x=h310",
        "//lh3.googleusercontent.com/v96gN77aXbD0wdJW8arnLKdtlyK7H1ev6aYZFCnfkoODmSaBaV6BSWjCIOzGkrq4YA=h310",
        "//lh3.googleusercontent.com/coliTGVr5VCVtLbcaxW2ukVqpy-qHI2jmwwEwr34bytTGBY73vb7gGVpbF7TeChSTDo=h310",
        "//lh3.googleusercontent.com/2HEqRVQDT08XuYhmZsXkj-L3-kPYzRuJv3vRDTTe9-UQGHgKc3d7FJ7YiDQKxcpqWcw=h310",
        "//lh3.googleusercontent.com/1acxaGaV6dqmCi4loREin7JmnHZp1_EOuXUoRjXozDdrw6AtZIvktH87jPL4tTy80g=h310",
        "//lh3.googleusercontent.com/ZlKDaBjaPIWzedhyrvzrnXJbpKi3RT-ZlR7QCXQ7YRjAr9nRam8gZhBpdUY4bwCPjhk=h310",
        "//lh3.googleusercontent.com/r4gsoM3GaAeFHyQIO66sHrsIsiK7v0HBIfl-Li41G5y6CcDdWXFV2mCui2ft30R4KEI=h310",
        "//lh3.googleusercontent.com/Jt-6iyRhRZw9__-ug8I8SKFW7Q-0uUmHHqUTy7iNEJQMGcyz6M_gk8RPEybXAe7oFA=h310"
    ],
    "comments": [
        "I I used this app for a half marathon. I found it very useful. Itseems quite gentle but I said that is not a bad thing. It is true the GPS can be a bit hit and miss but after I I changed it to run in the background it was a lot better. I ran injury free and knocked 13 minutes off my predicted time. I would would highly recommended it. It's a pity that you lose the plans when you create a new plan.",
        "Created a marathon plan based on my target time and my other run data. Unfortunately it doesn't sync my gps watch, i can't sync it to my calendar either (even though it states it can and I've tried and tried!) & when i wanted to share the plan with some running friends, the only option is via Facebook.  The designers need to re-think the whole set up of this app, as in principle, it could be so much better.",
        "For the past few weeks, I've not been able to import my Garmin data. It has happened in the past but somehow got resolved usually within a week but this time it's taken more than that. I emailed to their customer service and they acknowledged it's a known issue and their developer are looking into it and it's still not fixed.",
        "It asks for a goal time, which for me is 5km in 22min30sec, but when I add that I can currently run a marathon, it automatically calculates a goal time of just under 14 minutes for a 5km! Tried various scenarios, but it only jumps between sub 14min and 31min, both highly inaccurate. Why can't it just use the goal time like other programs? I'm an IronMan athlete hoping to improve my 5km run time. Don't see how the two are related. Very disappointed.",
        "Terrible GPS but good training plan. While on a run it tells me I've ran double the distance I actually ran. Checking the recorded route after and it shows me zig zagging all over the place and seemingly running over water. Get the location stuff sorted and you have a great app.",
        "Cant use this app! Tells me it has my email address already in use however when i go to forgotten password it then says not in the database. So you either have my details or not. But at the moment i cannot use it thus the 1 star review. Sort this out and id happily give more."
    ],
    "recentChanges": [
        "* Bug fixes and performance improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.asics.myasics&hl=en&gl=us",
    "appId": "com.asics.myasics"
}