{
    "title": "Tweetings for Twitter",
    "summary": "Powerful &amp; gorgeous ad-free Twitter client with true Push Notifications",
    "icon": "//lh3.googleusercontent.com/boloZXEmlFPjxxhZQpZ2STTmku7ULOzxD-FDTkzGKdaHcymBPP5B0z-A9HzhkUwTLA=w300",
    "price": "$2.49",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4,
    "reviews": 2710,
    "developer": "RBD Solutions Limited",
    "developerId": "6403281814395805505",
    "developerEmail": "apps@tweetings.net",
    "developerWebsite": "http://www.tweetings.net",
    "developerAddress": "2 Coahill Path\nBasildon, Essex\nUnited Kingdom\nSS14 3QX",
    "updated": "March 4, 2018",
    "version": "11.13.1",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "A beautiful Twitter client to immerse yourself in and ad-free Twitter experienceBeautiful themes, including a full Material Design experience, powerful features and highly customizable✓ True Push Notifications - Runs over Cellular or WiFi for mentions, Direct Messages, when you get a new follower, when you are retweeted, quoted or liked, etc. You don't even need the app open! We don't keep connections open to Twitter on your device, our push servers do all the hard work so your battery doesn't suffer. You can even keep track of your interactions in app with graphs and statistics✓ Never miss a thing for your account activities. In addition to push notifications, real time updates provide a great experience✓ 38 Beautiful Material Design themes, 19 light, 19 dark✓ New style Twitter quoted retweet support directly on the timeline. Send quoted Tweets, get notifications when you are quoted and even have them delivered to your mentions timeline.✓ Support for Android Oreo✓ Powerful customisation to the navigation of the app. You are in total control of your experience. Don't want liked tweets, no problem, just remove those sections. With Tweetings you can even have a list timeline as your main timeline rather than home.✓ Stacked timeline. A great new way to view your Tweets. View your home timeline grouped by the user's who posted them.✓ Supports Twitter's new extended Tweet and reply format✓ Post Gifs directly to Twitter using Giphy or Tenor✓ Multiple Twitter photo support✓ Clickable links in your timeline, long press links for more options✓ Long press tweets for quick actions✓ Animated Gif searching, posting and viewing support✓ Twitter video posting & viewing support, including up to 140 second videos✓ Android Wear support! View your timeline and reply directly to a notification. You can also send a new Tweet directly from your watch!✓ Realtime streaming updates, total optional. Can even run in the background✓ Chat Heads for received Direct Messages✓ Beautiful Card UI and Drawer navigation✓ Wonderful, rich, high-quality image previews, including beautiful parallax effect and swipe down to close✓ Powerful theme builder, allowing you to create, download and share custom themes✓ Multiple Twitter accounts✓ Save as many draft tweets as you want✓ Internal Web browser✓ Mute users, hashtags, keywords and clients, with official Twitter mute user syncing and auto-expiry✓ Muffle users, they still show in your timeline, just less prominently✓ Clickable links in the timeline✓ Search your own timelines✓ Twitlonger support✓ Tweetmarker timeline sync for Home, Mentions, Lists and Saved Searches✓ Customizable navigation. Put whatever is important to you at the forefront✓ Dashclock integration✓ Chrome tabs support✓ Timeline and mention widgets✓ Parallax timeline effect✓ And a whole lot more...In app purchase permission is used for a totally optional tip-jar feature. No one is under any obligation to donate and you don't gain or lose any features from doing so or not.Follow us on Twitter https://twitter.com/tweetingsJoin our Google+ community to get the latest news and also help beta test Tweetings:  https://plus.google.com/communities/100591855518757310400Help translate Tweetings into your language at http://ackuna.com/translate-/tweetings-for-android",
    "descriptionHTML": "A beautiful Twitter client to immerse yourself in and ad-free Twitter experience<br><br>Beautiful themes, including a full Material Design experience, powerful features and highly customizable<br><br>&#x2713; True Push Notifications - Runs over Cellular or WiFi for mentions, Direct Messages, when you get a new follower, when you are retweeted, quoted or liked, etc. You don&apos;t even need the app open! We don&apos;t keep connections open to Twitter on your device, our push servers do all the hard work so your battery doesn&apos;t suffer. You can even keep track of your interactions in app with graphs and statistics<br><br>&#x2713; Never miss a thing for your account activities. In addition to push notifications, real time updates provide a great experience<br><br>&#x2713; 38 Beautiful Material Design themes, 19 light, 19 dark<br><br>&#x2713; New style Twitter quoted retweet support directly on the timeline. Send quoted Tweets, get notifications when you are quoted and even have them delivered to your mentions timeline.<br><br>&#x2713; Support for Android Oreo<br><br>&#x2713; Powerful customisation to the navigation of the app. You are in total control of your experience. Don&apos;t want liked tweets, no problem, just remove those sections. With Tweetings you can even have a list timeline as your main timeline rather than home.<br><br>&#x2713; Stacked timeline. A great new way to view your Tweets. View your home timeline grouped by the user&apos;s who posted them.<br><br>&#x2713; Supports Twitter&apos;s new extended Tweet and reply format<br><br>&#x2713; Post Gifs directly to Twitter using Giphy or Tenor<br><br>&#x2713; Multiple Twitter photo support<br>&#x2713; Clickable links in your timeline, long press links for more options<br>&#x2713; Long press tweets for quick actions<br>&#x2713; Animated Gif searching, posting and viewing support<br>&#x2713; Twitter video posting &amp; viewing support, including up to 140 second videos<br>&#x2713; Android Wear support! View your timeline and reply directly to a notification. You can also send a new Tweet directly from your watch!<br>&#x2713; Realtime streaming updates, total optional. Can even run in the background<br>&#x2713; Chat Heads for received Direct Messages<br>&#x2713; Beautiful Card UI and Drawer navigation<br>&#x2713; Wonderful, rich, high-quality image previews, including beautiful parallax effect and swipe down to close<br>&#x2713; Powerful theme builder, allowing you to create, download and share custom themes<br>&#x2713; Multiple Twitter accounts<br>&#x2713; Save as many draft tweets as you want<br>&#x2713; Internal Web browser<br>&#x2713; Mute users, hashtags, keywords and clients, with official Twitter mute user syncing and auto-expiry<br>&#x2713; Muffle users, they still show in your timeline, just less prominently<br>&#x2713; Clickable links in the timeline<br>&#x2713; Search your own timelines<br>&#x2713; Twitlonger support<br>&#x2713; Tweetmarker timeline sync for Home, Mentions, Lists and Saved Searches<br>&#x2713; Customizable navigation. Put whatever is important to you at the forefront<br>&#x2713; Dashclock integration<br>&#x2713; Chrome tabs support<br>&#x2713; Timeline and mention widgets<br>&#x2713; Parallax timeline effect<br><br>&#x2713; And a whole lot more...<br><br>In app purchase permission is used for a totally optional tip-jar feature. No one is under any obligation to donate and you don&apos;t gain or lose any features from doing so or not.<br><br>Follow us on Twitter https://twitter.com/tweetings<br><br>Join our Google+ community to get the latest news and also help beta test Tweetings:  https://plus.google.com/communities/100591855518757310400<br><br>Help translate Tweetings into your language at http://ackuna.com/translate-/tweetings-for-android",
    "histogram": {
        "1": 168,
        "2": 168,
        "3": 351,
        "4": 736,
        "5": 1287
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/BXHKA3WNf_ZiVdDkFtxh2PG_d6Fu-1h7p9srTBwTi-Cr50t1UCFX3eBBaaG1726c5zMr=h310",
        "//lh3.googleusercontent.com/JiMGVgJGwhQ56wEg8JKn4wui0EEpx3EYNryL4QkvoZfXs9Da3r35DD75MJ1pGx25OqE=h310",
        "//lh3.googleusercontent.com/lUNfHC3dTP6gP-7iN-kPp0ko4qqbOp5z-Cbxiei2d3j3WvdejL_noikp2NWKf3JFRz2Q=h310",
        "//lh3.googleusercontent.com/fvAEYF1Jcnu9I9SvaB8S8VaWql4t7htuiMFVOLSoebfGmLgWewvUuVRdLYnCyPCOzOEp=h310",
        "//lh3.googleusercontent.com/EzHiU9Axs2k0yopho7SEqWpB1KRwS_oEsyrIgAreEbMZzYPs4owBPhDO-g8--kq7tAw=h310",
        "//lh3.googleusercontent.com/z1je4LsQtnPNUaTsuB1ocDo80I4MQIzgwkrsAcEXTpdB4hSY7KPilOO9sgBYV0PJ4iP5=h310",
        "//lh3.googleusercontent.com/BghvBgSZj_TB9-Hhiue3uO-DXr2zWAK8RgGD9RLv-E3I2M4PCg7OxvwOlz4RRsydWw=h310",
        "//lh3.googleusercontent.com/zZzvvH7DLUHnquY2GNu1r7nIgvXN6m-j-8YbWG4ndv8uBOjkJSbvd-F5dDNjjpJZVQ=h310",
        "//lh3.googleusercontent.com/kgZfkoq0kZUV1qGtZa1-LMqzKFkZANtJm9V0cz5MwAltagiPS51jjVJop8aVKBicGQA=h310",
        "//lh3.googleusercontent.com/yu9NYPpiZurtno3ZGNAkpSdIKrpSAQtIiu4HTgaZF0VZKXIy0IbUXc8gQQJvEDI3gPs=h310",
        "//lh3.googleusercontent.com/Ld7pqNA_7e0VwuE6aI83bE1TOE-FRE4okJHcZlDw-Xz8ipcScL7f1wGO3SeLqooH4xg=h310",
        "//lh3.googleusercontent.com/GlRgs-6w3fjKr4bSH42kjuEKaZbjXyH_lSY2qlkqX5fCisaafM0BapcqN5jnKGZj7I_3=h310",
        "//lh3.googleusercontent.com/H65gsmwVrlN2cvXamKlpnTdAixekoRZrrCspQhA82SPb-_TlEfbflU-iG8ju1vV-nDY=h310",
        "//lh3.googleusercontent.com/wQCiaPdnLxmcVeqNPducYkJ-pcMuw8LoTsagSC6kOZF87m2nEtCK44rt5F9Q0iOpc1I=h310",
        "//lh3.googleusercontent.com/K36P5BGPYPKTWwB31m1BlxR2d9rsz4nDDEBtXlYOdJvWpxtoELKoJfQSVwQKaHz_g95X=h310",
        "//lh3.googleusercontent.com/3rKuH7ONsFZ_ix-dSUVsv0Fbe1LFrVPBl65_1v6s0bzj_vNOstg1d4XBJJsWAPn-gQ=h310",
        "//lh3.googleusercontent.com/OwNfh82Q3T7Zu-rTm_XpYYejpwPanMEwGy3az2B5IUsnJ9GvNYNdiFRuy4rUo1T9_8c=h310",
        "//lh3.googleusercontent.com/30lu_z-8PywmVv9VXqo5E65j0QLmbmnnvA6C8KOQf-ueWna3NwaIqVCongEb4YCfbPwa=h310",
        "//lh3.googleusercontent.com/mdysVzKFDrDSp-9eGCQrChCl3fv9r_LT4SjD5DE-FMWUOZl6V9wFEyR_RkcJw7p116xq=h310",
        "//lh3.googleusercontent.com/vyUxrPvUwL3H8ELXKMaWsKPPxCUQFzKHhAEXJJUpCTzNYtqFpWshhQqEboiF_ohmJAwf=h310",
        "//lh3.googleusercontent.com/HJgDWuJy9XeUFZj-ivsd-K3g_7Enhh7Ew0gHAH6UGLPNnIKKNbry2YABMsgnT-qs9UA=h310",
        "//lh3.googleusercontent.com/GzqrfT8PJRWRYhIyT0-YfVHzO29vfdWHyl6traQrDR3x5b4hRJdOkStTsuAbSKUeye4=h310",
        "//lh3.googleusercontent.com/VIf8a8mbNJ7mEZmfhaCsPZBaN0p2LhvP2LeOgLTt-c5YNc47SMOCoCwkKtbRlXRgznI=h310",
        "//lh3.googleusercontent.com/IlJMFNOXfNtyp5zTRuVv0OjwnHboFDMOkKtiCZyJcyzJDFcteAOhgDkSj9OJhE-1Mg=h310",
        "//lh3.googleusercontent.com/6gLtxVt_W4IdjSDTKyIwppXmMuerTDNKLJ-EaG1bOMET6spEY3MfftEF-tjuHMYOBt0J=h310"
    ],
    "video": "https://www.youtube.com/embed/hs0oU1ay4Lg",
    "comments": [
        "UPDATE: when I press the RT Button on a tweet that I already RT'd (that's on my user profile), it gives me a 403 Bad  Request for API Twitter Limits. So me pressing the RT Button a second time to \"delete\" that RT from my profile does not work. I'm steaming my tweets via Mobile Data. So I'm not pulling to refresh for Twitter Limits so I'm not sure why it's giving me that Bad Request 403.   Anyway ReTweeted Tweet on my profile? I tap the 3 dots on the tweet that I re-tweeted and there's no way to Delete that tweet on my profile.",
        "Compose issue",
        "I love this app and all its features.  The iOS app didn't work for me but the android version is better than Flamingo or Talon. Live notifications sets it above the rest.",
        "If u could give a half star I would, when you block someone you still see any post they send to you, also deleting tweets not working either, so yeah, is garbage, how's that for constructive criticism?!delete my own tweet?? So you're app doesn't work if you want to block someone unless I delete mine? Bravo! Like I said is just 💩",
        "This is the only podcast manager i use. It is constantly being updated and new features added. I can recommend it for both Android and IOS.",
        "Infuriating bugs.  Update 2/1/2018: Developer asked what the bugs are. When I told him in the past, he has either not responded, or said they don't happen to him."
    ],
    "recentChanges": [
        "BETA",
        "A new way to view conversations on the status view.  Replies will now load below the main status and tweets prior to the current status will not load automatically but if you pull down they'll load above the main status"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.dwdesign.tweetings&hl=en&gl=us",
    "appId": "com.dwdesign.tweetings"
}