{
    "title": "Sportstracklive Pro",
    "summary": "Share, compare, train and compete in your sport on http://sportstracklive.com",
    "icon": "//lh5.ggpht.com/th_aBtf-hI5WH4GIJ6t83EUQ6H4xucl2yptLmuct357J5LLPaQ8YcwWFAuMR-naTOOS9=w300",
    "price": "$5.99",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.5,
    "reviews": 2111,
    "developer": "SPORTSTRACKLIVE",
    "developerId": "SPORTSTRACKLIVE",
    "developerEmail": "support@sportstracklive.com",
    "developerWebsite": "http://sportstracklive.com",
    "developerAddress": "SPORTSTRACKLIVE / TOUCOULEUR\nRoute de Bages, F-66450, Pollestres, FRANCE",
    "updated": "April 3, 2015",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Track your training live and beat your personal bests! Millions of activities recorded since 2008.Superior GPS sports tracking and fitness app. For all outdoor (using GPS) and indoor sports (using sensors). For running, cycling, mountain biking, skiing, snowboarding, sailing, biking and indoor gym workouts and fitness classes. The best featured app to record your GPS track and monitor your performance and cardio fitness. TRACK YOUR WORKOUT★ Live tracking and offline recording of all GPS based activities.★ Live tracking and offline recording of sensor based activities using bluetooth, BLE SMART and ANT+ ★ Track speed, distance, heart rate, time, pace, altitude gain/loss and more★ Enter Manual activities based on workout time or details from another deviceTARGET YOUR TRAINING★ Customize speed, pace and heart rate based training plans in the app★ Race previous tracks ★ Receive highly customizable and detailed audio coaching and voice feedbackTRACK WORKOUT HISTORY & PERFORMANCE★ Track workouts on your calender and see your monthly totals★ Use the Activity Summary charts to compare distance, time, speed, pace and calories with previous months or years★ Measure yourself against your annual personal bests for each sport★ Get notified when you beat personal bestsCOMPATIBLE WITH SENSORS AND WATCHES★ Android wear support★ Bluetooth Zephyr HxM and Polar Wearlink BT and Zephyr BioHarness★ Bluetooth low energy SMART heart rate monitors, bike and running sensors★ Polar Wearlink® + transmitter with Bluetooth®★ Polar H7 and Zephyr Hxm SMART★ ANT+ heart rate monitors, bike and running sensorsEXPORT★ Export workouts in GPX, CSV, KML from the websiteFor bluetooth sensors see http://sportstracklive.com/help/heart-rate for more info.For Bluetooth SMART (Bluetooth low-energy) sensors. See http://sportstracklive.com/help/bluetooth-smartThis app is ANT+ certified and supports ANT+ enabled heart rate sensors, footpods and bicycle speed & cadence sensors. Visit http://www.thisisant.com/directory for compatible devices.Email support@sportstracklive.com if you have any problemUse for running, cycling, mountain biking, skiing, snowboarding, sailing, windsurfing, paddle boarding and all outdoor sports using GPS or use sensor only mode for indoor sports such as fitness classes and gym workouts.Help, Feature requests and forum http://getsatisfaction.com/sportstrackliveBlog http://blog.sportstracklive.com5e2e07956b",
    "descriptionHTML": "Track your training live and beat your personal bests! <br><br>Millions of activities recorded since 2008.<br><br>Superior GPS sports tracking and fitness app. For all outdoor (using GPS) and indoor sports (using sensors). For running, cycling, mountain biking, skiing, snowboarding, sailing, biking and indoor gym workouts and fitness classes. The best featured app to record your GPS track and monitor your performance and cardio fitness. <br><br>TRACK YOUR WORKOUT<br>&#x2605; Live tracking and offline recording of all GPS based activities.<br>&#x2605; Live tracking and offline recording of sensor based activities using bluetooth, BLE SMART and ANT+ <br>&#x2605; Track speed, distance, heart rate, time, pace, altitude gain/loss and more<br>&#x2605; Enter Manual activities based on workout time or details from another device<br><br>TARGET YOUR TRAINING<br>&#x2605; Customize speed, pace and heart rate based training plans in the app<br>&#x2605; Race previous tracks <br>&#x2605; Receive highly customizable and detailed audio coaching and voice feedback<br><br>TRACK WORKOUT HISTORY &amp; PERFORMANCE<br>&#x2605; Track workouts on your calender and see your monthly totals<br>&#x2605; Use the Activity Summary charts to compare distance, time, speed, pace and calories with previous months or years<br>&#x2605; Measure yourself against your annual personal bests for each sport<br>&#x2605; Get notified when you beat personal bests<br><br>COMPATIBLE WITH SENSORS AND WATCHES<br>&#x2605; Android wear support<br>&#x2605; Bluetooth Zephyr HxM and Polar Wearlink BT and Zephyr BioHarness<br>&#x2605; Bluetooth low energy SMART heart rate monitors, bike and running sensors<br>&#x2605; Polar Wearlink&#xAE; + transmitter with Bluetooth&#xAE;<br>&#x2605; Polar H7 and Zephyr Hxm SMART<br>&#x2605; ANT+ heart rate monitors, bike and running sensors<br><br>EXPORT<br>&#x2605; Export workouts in GPX, CSV, KML from the website<br><br>For bluetooth sensors see http://sportstracklive.com/help/heart-rate for more info.<br><br>For Bluetooth SMART (Bluetooth low-energy) sensors. See http://sportstracklive.com/help/bluetooth-smart<br><br>This app is ANT+ certified and supports ANT+ enabled heart rate sensors, footpods and bicycle speed &amp; cadence sensors. Visit http://www.thisisant.com/directory for compatible devices.<br><br>Email support@sportstracklive.com if you have any problem<br><br>Use for running, cycling, mountain biking, skiing, snowboarding, sailing, windsurfing, paddle boarding and all outdoor sports using GPS or use sensor only mode for indoor sports such as fitness classes and gym workouts.<br><br>Help, Feature requests and forum http://getsatisfaction.com/sportstracklive<br><br>Blog http://blog.sportstracklive.com<br><br>5e2e07956b",
    "histogram": {
        "1": 82,
        "2": 45,
        "3": 98,
        "4": 414,
        "5": 1472
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/qKuaImRj-JAhLfshyTS2-nAxvhcY581ACzk3C0d6MGDrYJnbrqKtfTosZFHyTSrG=h310",
        "//lh3.ggpht.com/kQSI17i_Fvms1QJzaNFGt-m7c059AsQZtBIPMORDiPP8SMZ99l6PHkxWXW6iGmQ_sg=h310",
        "//lh6.ggpht.com/i_8_KvftTDjZX9O5iBEi7v62YBcK1TJmP_eQGT94WH_FOUufGq_X2T5AWLG7nMfAxHHD=h310",
        "//lh4.ggpht.com/JlKxAjeWnRHfgDfDu7b3viDHkcKHUb9SSpCoNmiiTBnYL5UNC5Etp206OZ0kIuQG5Sk=h310",
        "//lh4.ggpht.com/aSmU_4kG-alW4F6Lbl56fB3xvYMdGfYaY0O5efudhxd33shu7GSrFlJ4bYt7BjsQ0A=h310",
        "//lh6.ggpht.com/CF2p0qwm6APvVnDH3fedgWTiO41M6Tr8UTvMACEOHr0pQbLFIJBy_NTjbUHw1QCj3pk=h310",
        "//lh3.ggpht.com/8TEirMUJNhK6QOEZ27h4y-VUcv2BNB-Yax2kjPqUJuyuHWesgaYAqkiqPqkTuEjkFpg=h310",
        "//lh5.ggpht.com/7mufVjEmXerPHJ6y0dIqUGfK5ssbmVAAZ05NIbJ-bikjVrdRdw7k6CIZQ_1n0hrIzbY=h310",
        "//lh3.googleusercontent.com/qsa0T5xM-6XrigaMj0yxhDGv6tl-8mGgA1sxTxc-FviVKKqd0gxdJvzZhz6_J9_nPV9f=h310",
        "//lh3.googleusercontent.com/liYvwbsiAy6OG-_anzhCcdlUgVGubXH6Um2-A2VuKb-Y0ldhgZcYG6ltaZ0jgqo2lw=h310",
        "//lh3.googleusercontent.com/F0jEVdrdv5CrS8p0N3rLYvCc87j-7OKJcmClJzdBm2gEYSRyWhQwnqmDQayfB5esNA=h310",
        "//lh3.googleusercontent.com/K-XL5QjKrTqYYkvCE9bCxjgBV0UKqvjFGPD6Qu-CqvpMC3Oz8SWARWSqvGtxWZk21Vc=h310",
        "//lh3.googleusercontent.com/rrGtn-mO0WKvFHV8i6YIqmpZOKVMO47e4QkEJad0gGUXEDsUnWnhGcuRjLXdy9-IHKY=h310"
    ],
    "video": "https://www.youtube.com/embed/EHPXH3fU6Ms",
    "comments": [
        "I've been using this app for a few years now. I must say the pro service is definitely worth it. I have one very minor complaint. i setup my account to only post to FB when I beat a personal best. Prior to 13 March the post would say I beat \"x\" personal best(s). However, it no longer does that. Now, it only posts that I completed an activity.",
        "Love this app! So easy to start up and get moving, especially from my android wear device.  Only have two minor wishes...   My Moto360's inaccurate heart rate sensor is used on the watch display, when i have a Zephyr HXM connected. I'd rather the watches sensor wasn't switched on in this case.  I'd like to be able to send workouts to other apps, like MyFitnessPal for instance.",
        "Best so far Ver good app,  complete. I would give 5 stars if the training plans could be saved in my account, personal data as well. It is a waste of time every time I upgraded android or swap phone I have to create the training plans all over again.",
        "Heart rate doesn't always work. Too bad there's zero support for this app now, it was always my favorite to use. It's like a roll of the dice whether it will connect to the heart rate monitor on a daily basis.",
        "I had problems with this app on lollipop, in particular voice feedback would stop after 5 mins (LP is aggressive in killing background tasks).  It is working fine on marshmallow however.  This is the only app that supports running cadence.  It has very good stats too.",
        "Great app - MUCH more complete than its main competitors (I have tried them), though I have been trying to get an answer from the dev/his support team for over a month, not a single reply to 6 emails :(     Dropping from 5 to 2 starts as a result.  The app itself is excellent, does everything I want from a tracking app: easy start up and completion/uploading.      Well worth it, though I'm concerned about the lack of response from the dev - check it meets your requirements before buying."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sportstracklive.android.ui.activity.pro&hl=en&gl=us",
    "appId": "com.sportstracklive.android.ui.activity.pro"
}