{
    "title": "CheckMyTrip",
    "summary": "CheckMyTrip is the must-have travel app",
    "icon": "//lh3.googleusercontent.com/MWnXhRlDYKzeWTTM6mxSDJHlMZYC2h1wYURnUyoN0LK9L4DEkO5L-8B-KU3Pjxc3HO4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.2,
    "reviews": 16032,
    "developer": "Amadeus IT Group SA",
    "developerId": "Amadeus+IT+Group+SA",
    "developerEmail": "feedback@checkmytrip.com",
    "developerWebsite": "http://www.checkmytrip.com",
    "updated": "February 28, 2018",
    "version": "5.24.0",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "CheckMyTrip brings all of your trip details together in one master view.  Ideal for business travelers and frequent fliers to stay productive and enjoy unique local experiences.  Essential for leisure holiday seekers to navigate unfamiliar destinations and maximize the fun.  It's free, easy to use and loaded with trip alerts, planning tools and more to get you safely from door to door.BEAUTIFUL FEATURES AWAIT YOUSMART TRIP ITINERARIES - Stay Organized• Flight, hotel, car, rail, meeting, dining, tour & activity details organized into one elegant itinerary view• 3 simple methods to add & organize your itinerary details:  forward booking confirmation e-mails to trips@checkmytrip.com; enter booking reference with first and last name; or manually enter the trip information through a formHANDY TRIP TOOLS - Be Prepared• Direct access to many airline check-in systems and seat maps• Real-time notifications via push, in-app and email of flight status, terminal and gate details plus layover times• 5-day weather forecast for each point in your journey• Search and reserve taxi and parking options in 40 countriesAWESOME DESTINATION TRIP PLANNING SERVICES - Feel Like a Local• First-hand local discovery of places nearby through Foursquare• Search and reserve over 50,000 epic tour & activity options worldwide available through Viator• Search and reserve over 41,000 great restaurant options in major cities available through OpenTableREADY TO TRAVEL FEARLESSLY?  Getting started is easy.  Create an account using your Facebook ID or e-mail address.  Like Us on Facebook to access curated travel planning news, inspiration and tips.We respect your privacy - [https://www.checkmytrip.com/cmtweb/web-desktop.html#/privacypolicy]By downloading the app, you accept our Terms & Conditions of use - [https://www.checkmytrip.com/cmtweb/web-desktop.html#/termsandconditions]WHO IS BEHIND CHECKMYTRIP?  CheckMyTrip is brought to you by Amadeus - the technology company powering the travel industry.  We facilitate the entire travel journey, improving the travel experience so millions of people can travel fearlessly every year.  For more information, visit amadeus.com**IMPORTANT REMINDER**CHECKMYTRIP IS NOT A TRAVEL BOOKING AGENCYWe only display information related to the trip details you add to your CheckMyTrip account.  If you need to modify, cancel or source additional information about your air, hotel, car, rail, taxi, parking, dining or tour & activity booking - you must contact the provider directly for assistance.",
    "descriptionHTML": "CheckMyTrip brings all of your trip details together in one master view.  Ideal for business travelers and frequent fliers to stay productive and enjoy unique local experiences.  Essential for leisure holiday seekers to navigate unfamiliar destinations and maximize the fun.  It&apos;s free, easy to use and loaded with trip alerts, planning tools and more to get you safely from door to door.<br><br>BEAUTIFUL FEATURES AWAIT YOU<br><br>SMART TRIP ITINERARIES - Stay Organized<br>&#x2022; Flight, hotel, car, rail, meeting, dining, tour &amp; activity details organized into one elegant itinerary view<br>&#x2022; 3 simple methods to add &amp; organize your itinerary details:  forward booking confirmation e-mails to trips@checkmytrip.com; enter booking reference with first and last name; or manually enter the trip information through a form<br><br>HANDY TRIP TOOLS - Be Prepared<br>&#x2022; Direct access to many airline check-in systems and seat maps<br>&#x2022; Real-time notifications via push, in-app and email of flight status, terminal and gate details plus layover times<br>&#x2022; 5-day weather forecast for each point in your journey<br>&#x2022; Search and reserve taxi and parking options in 40 countries<br><br>AWESOME DESTINATION TRIP PLANNING SERVICES - Feel Like a Local<br>&#x2022; First-hand local discovery of places nearby through Foursquare<br>&#x2022; Search and reserve over 50,000 epic tour &amp; activity options worldwide available through Viator<br>&#x2022; Search and reserve over 41,000 great restaurant options in major cities available through OpenTable<br><br>READY TO TRAVEL FEARLESSLY?  <br>Getting started is easy.  Create an account using your Facebook ID or e-mail address.  Like Us on Facebook to access curated travel planning news, inspiration and tips.<br><br>We respect your privacy - [https://www.checkmytrip.com/cmtweb/web-desktop.html#/privacypolicy]<br><br>By downloading the app, you accept our Terms &amp; Conditions of use - [https://www.checkmytrip.com/cmtweb/web-desktop.html#/termsandconditions]<br><br>WHO IS BEHIND CHECKMYTRIP?  <br>CheckMyTrip is brought to you by Amadeus - the technology company powering the travel industry.  We facilitate the entire travel journey, improving the travel experience so millions of people can travel fearlessly every year.  For more information, visit amadeus.com<br><br>**IMPORTANT REMINDER**<br>CHECKMYTRIP IS NOT A TRAVEL BOOKING AGENCY<br><br>We only display information related to the trip details you add to your CheckMyTrip account.  If you need to modify, cancel or source additional information about your air, hotel, car, rail, taxi, parking, dining or tour &amp; activity booking - you must contact the provider directly for assistance.",
    "histogram": {
        "1": 1373,
        "2": 531,
        "3": 1090,
        "4": 4205,
        "5": 8833
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/OfR1snzunjLo2wFmBPgGeGjtyDifk3VqocCBp8ff9alX0Zjd76Aqa_wbBXWWKVuMLP8M=h310",
        "//lh3.googleusercontent.com/EnVbwKw5kzo4lGOqjhvzNYyehcreo-o9fNmsJAzxAnEtyf7GrrwZl6flpsdGNT-VQEA=h310",
        "//lh3.googleusercontent.com/cPAO515M13uyf81NOg5KNiGcrHcqfBB0CGX_KS-XGNywc9VTa9mzPQ4qHidKk3RaT7A=h310",
        "//lh3.googleusercontent.com/ZWYRVPKfRteqTpabKMGOY-mSbb5y7jAJgbIX9PIi3FYLJIwdyH5x7slVzDz0ImVc8Lc=h310",
        "//lh3.googleusercontent.com/smGtWgytZM_GyvAc0ALVyLrIi1AMpB3HQPQyjOk-MaY8YP43-38e3anZNF9TrbQxCcQ=h310"
    ],
    "comments": [
        "It's a great and very easy way to organize all the trips. Great way to automatically generate an itinerary and also communicate with the calendar and others.  One small bug that I noticed is that a pretty pic of the destination city appears, but if you add a hotel it disappears and only stock images appear.",
        "Nice app but the screen with the better hotel app showing up every single time is annoying to say the least. Not happy with that, you added another ad for the same better hotel in the middle of the upcoming trips. I can understand you are getting something back with the ads in this free app but just showing that up once is not enough?",
        "Great App has saved me a lot of hassle in keeping up with my numerous flights. The airline kept changing flight details...So, the App not only alerted me of the changes but also updated itself. Excellent.",
        "Checking can not be done, because the program doesn't accept my phone number in any format or blanco line. Waste of time ! If this a problem of ailines, somebody should send them a message about this and I am not going to do that.",
        "Today it sent me that my flight time changed 4 times. While in reality it didn't. Caused a lot of panic and stress. Will sue them.",
        "Helped alot in keeping tabs with my flights"
    ],
    "recentChanges": [
        "_Taxi & Transfer recommendation banner",
        "Whenever you are missing a taxi or transfer reservation, the app will notify you about the available booking options based on your itinerary.",
        "_Currency conversion",
        "You can now see currency conversion available at the bottom of the trip details screen.",
        "This addition enables you to know what is the exchange rate between your local currency and the currency of your destination."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.amadeus.cmt.client.android&hl=en&gl=us",
    "appId": "com.amadeus.cmt.client.android"
}