{
    "title": "DisplayFusion Remote",
    "summary": "Remotely control DisplayFusion on your computer!",
    "icon": "//lh4.ggpht.com/23XwBmEnfGCQybYrG2Wnt5fQL2GThLwO_p-5TyGlQG7bkt4hQP0oOvNXqW6VJlCQrKg3=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.8,
    "reviews": 204,
    "developer": "Binary Fortress Software",
    "developerId": "Binary+Fortress+Software",
    "developerEmail": "support@displayfusion.com",
    "developerWebsite": "http://www.displayfusion.com",
    "developerAddress": "120 Terence Matthews Cres, Unit A2\nKanata, Ontario, Canada\nK2M0J1",
    "updated": "November 6, 2015",
    "version": "2.1",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "** This app requires DisplayFusion 7.0 or higher be installed on your computer:http://www.displayfusion.comRemotely control DisplayFusion on your computer! Change your wallpaper, move windows around, enable/disable monitors and hundreds of other abilities, all from your phone or tablet! Includes full Android Wear support to control DisplayFusion from your Android Wear Watch.Includes support for scripted functions, new in DisplayFusion 7! You can script a complete set of actions, save it as a scripted function and run it from your phone or tablet with one-click. It’s easy to setup and even easier to use!- Trigger wallpaper changes- Move and size desktop windows- Enable/disable monitors- Change default audio devices- Toggle DisplayFusion features- Script anything you can imagine using C# and VB.net- Compatible with all Android Wear devices (square and round)- Compatible with Tasker and Locale automation apps- Much, much more!",
    "descriptionHTML": "** This app requires DisplayFusion 7.0 or higher be installed on your computer:<br>http://www.displayfusion.com<br><br>Remotely control DisplayFusion on your computer! Change your wallpaper, move windows around, enable/disable monitors and hundreds of other abilities, all from your phone or tablet! Includes full Android Wear support to control DisplayFusion from your Android Wear Watch.<br><br>Includes support for scripted functions, new in DisplayFusion 7! You can script a complete set of actions, save it as a scripted function and run it from your phone or tablet with one-click. It&#x2019;s easy to setup and even easier to use!<br><br>- Trigger wallpaper changes<br>- Move and size desktop windows<br>- Enable/disable monitors<br>- Change default audio devices<br>- Toggle DisplayFusion features<br>- Script anything you can imagine using C# and VB.net<br>- Compatible with all Android Wear devices (square and round)<br>- Compatible with Tasker and Locale automation apps<br>- Much, much more!",
    "histogram": {
        "1": 25,
        "2": 12,
        "3": 38,
        "4": 40,
        "5": 89
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/7b-FtP7K3m0k57eSPaRL6q1YP6fBJMoLKiW04lHjodpyTDEwUskS6CYUYOIAp7miS58=h310",
        "//lh6.ggpht.com/MgF9QScK9T_ZErGjtD2AyftXCWhT2P92ZItKrp_qE_NeuqkUHg9tNzgzl-ycd1E_IgM=h310",
        "//lh4.ggpht.com/E4gCdwgXGPniQOz8s7zFNDr1UfDOyQXwyv4ZOH2ZdqJIDc4MAfO7W58YDUYR7TD089w=h310",
        "//lh4.ggpht.com/dqxSJhqrO7vZjMsmbGKVAhoQchKY0DG9i4DUFSbN9SM_uQuf5GpKjH6szIjn2d9CXe1-=h310",
        "//lh5.ggpht.com/sAqhjbHiNdZA67WgIT7XuRnCe5RU5WpUAoPfXfq_M5XkNGX_d4ufdV0GFtl4FPUUURU=h310",
        "//lh5.ggpht.com/8p8t1buL9kjVaw9JXTPl6HXrSn9o41eV39bvKQdOWvPYigQUeldAkGuAYyERhEuIJmk=h310",
        "//lh4.ggpht.com/23sMdKukyVrUxdN_MPfj7LL6yO1mOyPt6GMsFnNopTNw5J4lpHo_2v8a7N21n-HaIQ=h310",
        "//lh5.ggpht.com/N3RJrUEdemV3bxApsCUY6bLuZb_7Cw-sYMWsnRIRRfVWYdGkiPDNNp2J5rISb5WcJA=h310",
        "//lh4.ggpht.com/ZLB85Y_yy45wLZ79yt7aLijHXdX7xvPXnYI0U15PKzsXX7sxuikx8isguL1srBrlvIY=h310",
        "//lh6.ggpht.com/Kro69e3_vcQFaFS28KhPazE4RnaIbGyYBc9JaqF_UeyZnKSzN-1W3fCANDa2xtgQSnd0=h310",
        "//lh4.ggpht.com/A_4-RkLIbDheSMsayJMPlFWK8cczFGKRnpBuJsuXH5H3mvX16Xnzqh-9_sXIdEX25Q=h310",
        "//lh5.ggpht.com/wx8-An14gIJR7aa2Fa5E1Vl6OsbcUuEllyHuWq3Di0D7Q1PjuTz7UXFQX322fplXtQ=h310",
        "//lh3.googleusercontent.com/_CSu7f0WUscsKY0M-ZT1hvm6-p9ULgwPNrKqF_W1peE7Qk_29eYwraTgJip2itzf5w=h310",
        "//lh3.googleusercontent.com/bmXgx4HF-flz8yxtZvRVdQjnYcV_ABm_zDlCj8x9_dkYkdFTMwiQlEBZ8_FPnklu9g=h310",
        "//lh3.googleusercontent.com/IMxnIqv7MmHabmWJIcMztHQeLk-D0d-Fz0qcAYLuY8-JezsnQDIOYsQK3AZ8nInJSmE=h310"
    ],
    "comments": [
        "DF on PC is the best fix around for hopelessly broken Nvidia surround, this app is a  companion to that program. In that context it works flawlessly, with plenty of gravy functions on the side. My only thought on how this app could be improved, would be to add a widget where we could place the most used  functions for quick and easy access, but that is certainly not enough to dock a star. :)",
        "Seems more for programmers than end users Only thing that is very useful about this app is the ability to run custom scripts. So if you can program (C# cause VB is trash lol) then you can make great use of this. The only custom scripts that I've used is to shutdown my PC, make it sleep or troll friends with random messages on the screen lol. If i ever need it do something else, i love the ability to add it myself. To the average user, it's not entirely useful. In theory though, this app can virtually do anything so for that I'll give 4 stars.",
        "Love it, I am using it to remotely launch certain programs (TeamViewer if I want to control my PC and I am in work or other place, I just run a custom script and bam, my program is running.) Also using it for locking my windows+ putting my monitors to sleep, really awesome (it's one of the custom scripts that you can download in the desktop DIsplayFusion). Only bad thing is that I am using it on my smartwatch too (Sony Smartwatch 3) and I have one problem. Whenever I open the app from the smartwatch it asks me to open the program on mobile phone first.. Which is kinda redundant because if I am already on my phone, in the DisplayFusion app, I don't need to use my watch anymore. Could you please look into it? I would really love to just touch my smartwatch and be able to sleep monitors quickly. Thanks a lot and keep up the great work!",
        "It provides you access to some basic settings on you're DF Desktop (advanced settings/tweaking not accessible). However it doesn't have anything that stands out. Widgets would be a good idea. Just noticed the compatibility with Tasker. It's a solid start with plenty of room to expand. Keep it up guys :)",
        "Honestly, there's no practical use for this. I love the main program, but this seems like dev money wasted on a pointless product. I can mess with settings, enable/disable stuff, but honestly... why do it from my phone/tablet? I have to be able to see the PC anyway to do any of this, I'll just sit down and do it if I really really need to change any of the settings. Don't waste your time, it's not a view/control the computer remotely type of remote. It's like a TV remote with all the good buttons gouged out by your baby brother. Better to just walk up to your TV or get a different remote.",
        "This has got to be the very best app for controlling your monitors when you have both of the monitors being used with thing that your doing.   When your playing a game and or watching you tube, using a chat program or whatever else you do with your other monitor it's nice to be able to open this app and use the endless options that it has without disturbing the programs your running.  I am giving this app 5 stars because it's nice to have the options that this app has even if I may not ever use one or two of the options. Its still nice to have every option when I want it.   Well done to the person or persons that made this app. Thank you for giving me all the greatness this app has to offer."
    ],
    "recentChanges": [
        "- Fully compatible with Android Marshmallow",
        "- Added an About button in the menu",
        "- Resolved an issue where the software keyboard stayed open after DisplayFusion Remote was closed"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.binaryfortress.displayfusionremote&hl=en&gl=us",
    "appId": "com.binaryfortress.displayfusionremote"
}