{
    "title": "iFit Outside",
    "summary": "Track your outdoor workouts, wherever you are.",
    "icon": "//lh3.googleusercontent.com/f4hRUv5bg6aE16ZXlC9dY8PttTZUW7KS288br-2_-4ROZllhDU1e2D2IA1_bpjbZRio=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.7,
    "reviews": 2923,
    "developer": "iFit",
    "developerId": "iFit",
    "developerEmail": "support@ifit.com",
    "developerWebsite": "http://www.ifit.com",
    "developerAddress": "1500 S 1000 W\nLogan, UT 84321",
    "updated": "April 3, 2015",
    "version": "1.8.0-175",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Reach your workout goals with iFit Outside—the ultimate outdoor workout app, and the first one with standalone GPS. Love to run in the rain? Cycle up steep slopes? Walk out your wanderlust? Take iFit Outside with you everywhere you go. Link it to your smartwatch when you wanna leave your phone at home.Track and measure your distance, pace, speed, time, elevation gain, heart rate, cadence, and calories burned to reach your goals faster. View totals, averages, and maximums at any time to constantly improve.The iFit app provides optimized GPS performance and a more accurate tracking system that tracks your distance, even when there’s no signal. This premium app is an ad-free experience. View your workout schedule and detailed stats from a completed run, walk, or hike.Features:* Compatible with Android Wear* Track your outdoor runs, rides, hikes, or walks directly from your smartwatch* View all workouts with optimized GPS tracking * Convert your outdoor workout to an indoor workout on iFit enabled equipment* Manually log workouts* Record your heart rate wirelessly with Bluetooth 4.0 technology * See advanced analytics of your workout, right on your phone* Stay on pace with Voice Prompts without checking your phone* Create a workout schedule right on your phone* Post your workout summary and stats to a friend via Facebook or Twitter",
    "descriptionHTML": "Reach your workout goals with iFit Outside&#x2014;the ultimate outdoor workout app, and the first one with standalone GPS. Love to run in the rain? Cycle up steep slopes? Walk out your wanderlust? Take iFit Outside with you everywhere you go. Link it to your smartwatch when you wanna leave your phone at home.<br><br>Track and measure your distance, pace, speed, time, elevation gain, heart rate, cadence, and calories burned to reach your goals faster. View totals, averages, and maximums at any time to constantly improve.<br><br>The iFit app provides optimized GPS performance and a more accurate tracking system that tracks your distance, even when there&#x2019;s no signal. This premium app is an ad-free experience. View your workout schedule and detailed stats from a completed run, walk, or hike.<br><br>Features:<br>* Compatible with Android Wear<br>* Track your outdoor runs, rides, hikes, or walks directly from your smartwatch<br>* View all workouts with optimized GPS tracking <br>* Convert your outdoor workout to an indoor workout on iFit enabled equipment<br>* Manually log workouts<br>* Record your heart rate wirelessly with Bluetooth 4.0 technology <br>* See advanced analytics of your workout, right on your phone<br>* Stay on pace with Voice Prompts without checking your phone<br>* Create a workout schedule right on your phone<br>* Post your workout summary and stats to a friend via Facebook or Twitter",
    "histogram": {
        "1": 411,
        "2": 212,
        "3": 390,
        "4": 649,
        "5": 1261
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/SJ4a8KYV-rd4xjx43B2v5c9yuEywr6uBV_ftOwdwHm6Xo9uiD3YRis9jCbiFURZCC1Y=h310",
        "//lh4.ggpht.com/CY0x5WZQx9ToMczWD2bJ8XsBuqeFO_JA2F3L1uu1gR8Ljsx_khdnh55p2yE2KiECVd0=h310",
        "//lh4.ggpht.com/9jNmMBL2bBBFoiPLLa1l_REmpCT7MCf53IJlBjHxWbVZvS2nXbTbee6uf0fiKNOnUqU=h310",
        "//lh4.ggpht.com/VhnXPzZeW2AuSMsg3vkVVYRUqtG3l1OvnD9hbfb4rQ4ZKBmU96ZVHN0VQzpxUP5o1Yur=h310",
        "//lh5.ggpht.com/k05M8hMmfMDvndNEsJG7U5Qs6vRtmXuNx-f6qbL7-QskDMzGjZEWmlVkwNp4Dy1UUg=h310",
        "//lh3.ggpht.com/1DRpelU0EF7HH5DAcAYH-qn85VdSxY2em1GomBS858chMZ7rrAMikHShQVeG_o-n0Wvq=h310",
        "//lh4.ggpht.com/sC7QVYq57D-22YB0Sh_5Y-YDGHOukdXAo6hJNM5kIJb2Fd2naG3ivRmJKfzEEv9vEou7=h310"
    ],
    "comments": [
        "Great to see my workouts I did on my treadmill! Great to see my workouts I did on my treadmill! It's nice to see my progress, incline, times, courses and mileage completed.  However, I'd like to plan routes to run on my treadmill via the app. Why do I have to be logged in to a pc to do this? It's difficult to do on the treadmill, as well.  PC seems to be the only viable option. Overall,  great app. I like it! Also what is the ifit score? How is it computed and does it change based on length, speed or # of days worked out?",
        "Records but does not upload workouts At first it worked OK. Now it won't upload any of my workouts (even of I try them individually). Also does not sync to any history workouts. When I logged out to try again, I lost all of my workouts in the upload queue (30+). Was hoping this would work and sync to my laptop and my iFit treadmill. Nope. Only place I seem to be successful is on the laptop. Lot of good that does me when I'm trying to be mobile and fit. My scheduled workouts do not show on the app. Using this app on my Android phone.",
        "Worked great, then Junk App worked great on Droid Maxx for first month, then the app would not upload any data to ifit. Tried reinstalling, tried sign in/out, no other noteworthy updates to the phone...can't get this to work with my ifit account since those first weeks.",
        "The app, as every other ifit product I've tried, is full of glitches. The concept is ok, but the glitches make it lag far behind the competition. It won't upload any of my workouts. There are way better free apps available.",
        "Perfect to help keep me in line! I have a hard time keeping a workout schedule due to my very slbusy schedule that does not allow a lot of time. Days when I just don't have the juice I look at my fit score and get re-motivated.",
        "Very Nice app and working on m'y smartwatch3 without phone Juste une thing the characters are a little bit toi bog so not everything is readable. It would be good to be able to put the size smaller. Thank you"
    ],
    "recentChanges": [
        "- Various bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ifit.android.app&hl=en&gl=us",
    "appId": "com.ifit.android.app"
}