{
    "title": "Bees Voice Sound Recorder",
    "summary": "Recorder - FREE without limits on the recording time! Support phones &amp; watches!",
    "icon": "//lh6.ggpht.com/RaM3kv1Nklvxh2nGXSz-You26xNDznijsY71b-jsSL5WqoycB1jbibe6FEwym0qnFHk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 263,
    "developer": "Bees Team",
    "developerId": "Bees+Team",
    "developerEmail": "beesteamcontact@gmail.com",
    "developerWebsite": "http://beesapp.net/",
    "updated": "July 22, 2015",
    "version": "1.1.6",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "description": "Recorder can be even smarter with scene-based noise-cancelling algorithm! As the NO.1 rated recorder on play store, it always gives the best sound effect based on where you are. It is FREE and without any limitations on the recording time! Bees Recorder is designed both for android watches and smartphones. Bees Recorder Key Features: ★Best Sound Effect in Different Scenes •General: Noise Cancellation for all scenes to maximize your listening experience •Lecture： Lectures Especially - No matter where you sit, your recordings will take you back to the first row to provide you the best listening experience.•Music： Music Especially - No background noise! Just record & capture your sweet memories with every great performance!More scenes? Please tell us at beesteamcontact@gmail.com. ★Support Android Wear WatchesSupport android watches, you may record with your android watches even when not paired with your phones. Auto sync will happen when paired successfully. ★Add tags anytimeAdd tags anytime anywhere! ★Noise-cancelling algorithm to ensure clear records★Backup your recordings directly to Google Drive★Free App with no Ads★Sound quality customization (Lossless, High, Medium, Low) ★1.5/2/0.5 times speed are supported while reviewing recordings★Share your recordings through Email, Bluetooth, Dropbox, etc. ★Support Spanish，Portuguese，Russian，German, French ★Record and play recordings while app is in the background ★Customizable recording folder★Auto save your recordings even when phones turn off unexpectedly We'd like to hear from you, please feel free to contact us at beesteamcontact@gmail.com Like us on Facebook: https://www.facebook.com/thebeesapp Follow us on Twitter: https://twitter.com/bees_app Join us on Google Plus Community Now: https://plus.google.com/communities/100751429207302969049Use of this app is governed by our Terms of Service: http://beesapp.net/terms-of-service/ and Privacy Policy: http://beesapp.net/privacy-policy/",
    "descriptionHTML": "Recorder can be even smarter with scene-based noise-cancelling algorithm! As the NO.1 rated recorder on play store, it always gives the best sound effect based on where you are. It is <b>FREE</b> and without any limitations on the recording time! <b>Bees Recorder is designed both for android watches and smartphones.</b> <br><br><b>Bees Recorder Key Features:</b> <br><br>&#x2605;Best Sound Effect in Different Scenes <br><br>&#x2022;General: <br>Noise Cancellation for all scenes to maximize your listening experience <br><br>&#x2022;Lecture&#xFF1A; <br>Lectures Especially - No matter where you sit, your recordings will take you back to the first row to provide you the best listening experience.<br><br>&#x2022;Music&#xFF1A; <br>Music Especially - No background noise! Just record &amp; capture your sweet memories with every great performance!<br><br>More scenes? Please tell us at beesteamcontact@gmail.com. <br><br>&#x2605;Support Android Wear Watches<br>Support android watches, you may record with your android watches even when not paired with your phones. Auto sync will happen when paired successfully. <br><br>&#x2605;Add tags anytime<br>Add tags anytime anywhere! <br><br>&#x2605;Noise-cancelling algorithm to ensure clear records<br><br>&#x2605;Backup your recordings directly to Google Drive<br><br>&#x2605;Free App with no Ads<br><br>&#x2605;Sound quality customization (Lossless, High, Medium, Low) <br><br>&#x2605;1.5/2/0.5 times speed are supported while reviewing recordings<br><br>&#x2605;Share your recordings through Email, Bluetooth, Dropbox, etc. <br><br>&#x2605;Support Spanish&#xFF0C;Portuguese&#xFF0C;Russian&#xFF0C;German, French <br><br>&#x2605;Record and play recordings while app is in the background <br><br>&#x2605;Customizable recording folder<br><br>&#x2605;Auto save your recordings even when phones turn off unexpectedly <br><br>We&apos;d like to hear from you, please feel free to contact us at beesteamcontact@gmail.com <br>Like us on Facebook: https://www.facebook.com/thebeesapp <br>Follow us on Twitter: https://twitter.com/bees_app <br>Join us on Google Plus Community Now: https://plus.google.com/communities/100751429207302969049<br><br>Use of this app is governed by our Terms of Service: http://beesapp.net/terms-of-service/ and Privacy Policy: http://beesapp.net/privacy-policy/",
    "histogram": {
        "1": 16,
        "2": 7,
        "3": 21,
        "4": 42,
        "5": 177
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3.3 and up",
    "androidVersion": "2.3.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/VbmmOS0TV58MDMoAMgL2FCuCbII6z6zwf88dWTPSr0eID3eqsOXen3MGfu-0DmOfS8Y=h310",
        "//lh3.googleusercontent.com/8npvzen_QqzPJQpHzBFW_HhwDiPVZPUWWYZb_VFB6SCpgvZNGg96HDdAy-hF5mAN70s=h310",
        "//lh3.googleusercontent.com/YVUZZLlbuzDr3t8nVWwv62b27joC4yYgXgS6ywq24IU8m5OzXSIqwyGKs4870GUfrA=h310",
        "//lh3.googleusercontent.com/89hsF22h07jE7ViKaF-tA3pEXQSQXDcldP9jM9-syhdxITaZ_W9RDQO7Dtt-39kbg_g6=h310",
        "//lh3.googleusercontent.com/iA9hawRF5ieeGw1TxlobphtIIn5_dUzsCwUySusmaCtzJZGXMFbiGmyFVJ71AwD8v9xU=h310",
        "//lh3.googleusercontent.com/3BHEynHf2jSeDJ6o7Hvi1sHn8LZrD1oxeZaslY-ckfd-x3rpvUIOzNnSI0itZ-CVeaSs=h310",
        "//lh3.googleusercontent.com/LUx3Kv7xtSIdJT4ua_1-2X3WvJYAFO1_uc9JELmplxvdGxnWsThL5MoNyQlZY-e-Avg=h310"
    ],
    "comments": [
        "Wow... Not only is this app aesthetically pleasing with material Design. It works perfectly both on my Gs6 edge & LG G Watch R ⌚, it syncs as it records so theirs no waiting for a sync afterwards. This is the best voice recorder so far. Also, The Google Drive ☁ save works seamlessly. I hope you guys never implement advertisements. I'd rather you take my money.",
        "Amazing!! I hope I can rate this app more than 5 stars, everything is great, design, quality of recording, support android wear, backup to Drive, and tags. everything made perfectly, good job guys. Just little thing, sometimes I put tag in wrong place and I want to remove this tag but there is no choice to do that, I hope to see this in next update.",
        "Astonishingly stunning and perfectly functional, this app was the one to finally end my quest of search for a good, Material Design-compliant sound recorder. I have absolutely no complaints whatsoever: this is one of the most beautiful apps I've ever used. It's ad-free, the recordings are produced at excellent qualities, automatic Google Drive backup is an option, support for Android Wear (I don't own one, but it's nice to know this is a feature), and the ability to tag specific points along the duration of the recording is magnificent. Congratulations on this masterpiece.  [EDIT]: as things were just too good to be true, every time I open this app and record something, the songs on my internal storage disappear from my music player; the issue persists until I reboot my device.",
        "Best Wear recorder I have been disappointed and frustrated by the quality and functionality of available voice recorders for Android wear after using the excellent Galaxy Gear recorders. Having tried all available audio apps this one is by far the best and most reliable in my opinion. Nice interface and superb sound quality make this a must have app for Android wear.",
        "(Update: Hi devs! A small issue which i found out just now.. When i try to place the '1 x1 widget' of Bees Recorder on my phone's homescreen, instead of placing the widget, it directly just opens the app. When i get back, the widget won't be placed either. Fix that in next update?)  Functional, clean, precise. Lot of functions with 4 sound quality options and 3 different scenes! All for free?? That's an amazing must have app for Android Wear users and others too ppl.. go ahead and download.. oh.. it's got G.drive backup too!",
        "Great potential, but two big bugs Great potential on both phone and watch, free of charge and ad-free. But two big bugs - everytime I make and listen to a recording, my music player loses all the music on my SD card, and the app freezes and has to be force closed everytime I try to delete a recording."
    ],
    "recentChanges": [
        "1. Support Bluetooth",
        "2. Bug fixed"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.beesteam.beesrecorder&hl=en&gl=us",
    "appId": "com.beesteam.beesrecorder"
}