{
    "title": "Wear Phone",
    "summary": "Start and manage phone calls from your Android Wear smartwatch",
    "icon": "//lh4.ggpht.com/_Q36vt8d0uGjlHcYDG1XC155WeC9ZcopSAvWmBGVpdufxCft5ba0SDJJe8Tz_Kcs0qY=w300",
    "price": "$1.99",
    "free": false,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.8,
    "reviews": 195,
    "developer": "Mohammad Abu-Garbeyyeh",
    "developerId": "Mohammad+Abu-Garbeyyeh",
    "developerEmail": "mohammad7410+playsupport@gmail.com",
    "developerAddress": "Mohammad Abu-Garbeyyeh\nSalah Ed-Din, 12, 12920\nJerusalem, Israel",
    "updated": "December 12, 2014",
    "version": "1.3",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Note: there is no phone app, please allow up to 2 minutes for the app to be installed your connected Android Wear smartwatch.Wear Phone is the missing piece in handling phone calls on your Android Wear smart watch. Without this application, you could only answer or ignore incoming calls (as well as reply with canned replies). With this application, you get the following features:* End ongoing calls.* Enable/disable speakerphone.* Enable/disable microphone.* Start outgoing calls from your recents, favourites, your full contact list, or a keypad!We believe that input on a smart watch needs to be different when it's not by voice, so the keypad is a new experiment we hope you enjoy.This has only been tested on a Moto 360, please report any issues you find with square faces or the different DPI of the G Watch R before leaving a negative review.If the app does not work properly on square watches or the G Watch R, please contact the developer for support. If the issue is not fixed, we will happily refund your purchase.",
    "descriptionHTML": "Note: there is no phone app, please allow up to 2 minutes for the app to be installed your connected Android Wear smartwatch.<br><br>Wear Phone is the missing piece in handling phone calls on your Android Wear smart watch. Without this application, you could only answer or ignore incoming calls (as well as reply with canned replies). With this application, you get the following features:<br><br>* End ongoing calls.<br>* Enable/disable speakerphone.<br>* Enable/disable microphone.<br>* Start outgoing calls from your recents, favourites, your full contact list, or a keypad!<br><br>We believe that input on a smart watch needs to be different when it&apos;s not by voice, so the keypad is a new experiment we hope you enjoy.<br><br>This has only been tested on a Moto 360, please report any issues you find with square faces or the different DPI of the G Watch R before leaving a negative review.<br><br>If the app does not work properly on square watches or the G Watch R, please contact the developer for support. If the issue is not fixed, we will happily refund your purchase.",
    "histogram": {
        "1": 28,
        "2": 8,
        "3": 23,
        "4": 48,
        "5": 88
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/9lRbzVJl0FgVtWY72PWPx56tzLXACw0NdpUAlL63Vdtqcmik6iQMHLDetTJm4ey5dQ=h310",
        "//lh6.ggpht.com/YIGI1CCztqOMQiz2GBCRw954D5FSiDrUzBCmAVz3jb7Ykrfd1b3Q4Nz3BaXEJruX-7w=h310",
        "//lh4.ggpht.com/ofjQIK-aWG9-dAN7x0D0XYiHAWtGGbnsxxcAGoMYrGVbKnsobNJ3VMgpqTNwH-sY4Dk=h310",
        "//lh4.ggpht.com/gXWx02VS_6z747eRCwVdAdgf_aMDharu_S_T06KzqwpQ4cd8h_Igz1pI92kWvyc5iFQ=h310",
        "//lh3.ggpht.com/k05N2-ebZH12lks0j36cDgdX--b0nqvYiVdJLQETVQO-wVSSfyLDgqJEJ_l7SZI3eUA=h310",
        "//lh3.ggpht.com/m18QlDSa8qQpqvZj0dnBsJuAtZd19SPWC7ApTW5DC3cll4zIo0UH8WV7jlMdDmBjxQ4=h310"
    ],
    "comments": [
        "Good app but needs improvement This is the best phone app for wear out there. Hope it improves on the following issues.  Change color or icon of Speaker and Mute buttons when they are enabled. Add contact images for favorites. and sort it in any sensible order. Right now it appears totally random. Add easy navigation option for contact list. I have to scroll to the whole list to get to anyone at the bottom",
        "Some suggestions (Moto gen 2) Overall, it is a good and useful app. But these are some probs that need to be improved or changed: 1. Favourite contacts cannot load (or takes too much time to load). 2. Full phone book need a search function. 3. Round keyboard wont work well because touching the edge of every watch is crazy. A rectangle keyboard will be more easier to type.",
        "Best app so far but needs improvement Thank god for developers willing to attempt a smartwatch phone APP but there is room for improvement. By far this is the best app as of today.  Im using a moto 360 paired with galaxy note edge.  PROS: make calls, recent list, contacts list, opens immediately after answering call, better then having nothing. CONS: You must make/answer calls from the watch or the app doesn't open, once phone call is answered the only button that works is end call. Fix for 5 star rating",
        "This is a very good app, the best phone app available on wear. I have an LG Urbane watch and in comparison to the crappy LG phone app available this is so much better, worth the purchase!  The only additional improvements are firstly the ability to use the watch mic to speak which I know has been mentioned before in other reviews. Secondly, I don't know if i'm asking too much here but since my watch has wifi capability, the ability to connect my headset to the watch directly instead of the phone in case my phone is not in bluetooth range would be the ultimate! Since i can connect my watch to the phone via wifi then could this be possible!? If either of the above two suggestions could be incorporated then definitely 5* plus!",
        "Works fine Works fine on my Gear Live. I agree this should have been a stock app from Google. Its good and usfeful. While it's awesome it enables speakphone on your phone, I think it would be cool if it enabled your watch microphone simultaneously. So you didn't have to worry about speaking to your phone. Still great app and well worth it.",
        "Awesome! By far my most used and liked wear app.  The only problem I have is when I make or take a call from my watch,  LG Urbane,  my bluetooth headset doesn't work,  only can talk on phone"
    ],
    "recentChanges": [
        "* Dark mode, enable it in settings on your phone.",
        "* Slightly updated UI for 5.0.1 update (minor colour tweaks as per the new system ones, ripple animations where it makes sense without killing performance).",
        "* Fixed a crash on the phone side when certain bluetooth devices are disconnected (shows most when Airplane Mode is turned on)."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mohammadag.wearphone&hl=en&gl=us",
    "appId": "com.mohammadag.wearphone"
}