{
    "title": "Snapkeys Smartphone Keyboard",
    "summary": "The Snapkeys keyboard brings speed, accuracy, and comfort to your smartphone",
    "icon": "//lh3.googleusercontent.com/q9DGsfZhv2iRDFLk5F2DEOScZNczVpSqfi8C30e8KS0ivusaFgVeZrTEwnUidB7qknDR=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.8,
    "reviews": 52,
    "developer": "Snapkeys",
    "developerId": "Snapkeys",
    "developerEmail": "info@snapkeys.com",
    "developerWebsite": "http://www.snapkeys.com",
    "developerAddress": "2 Yosef Hackmi Street\nJerusalem, Israel\n96428",
    "updated": "October 20, 2016",
    "version": "8.1.1.9",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "The Snapkeys Smartphone Keyboard is designed for Android Smartphones. The unique QWERTY keyboard layout, combined with a state-of-the-art predictive technology enables users to type extremely fast and very comfortably on a smartphone. Reads your mind! Type sloppily with the Snapkeys Keyboard, and get your words. The most intelligent, and the fastest keyboard, across devices with any screen size: From the smallest (smartwatch) to the midst (smartphone) and the largest (tablet). See what the press says:        \"the most intelligent keyboard\" - The Daily Mail         \"smoking fast and accurate\" - The Discovery Channel        \"...blazes like you wouldn't believe\" - Gizmodo        \"You might want to sit down for this\" - The Verge        \"Furiously peck out messages and emails on your smartwatch\" - CNETJust type, and  Snapkeys' predictive algorithms will take care of the restAmazing swipe technology - Mix short swipes and tapsExtremely fast typingIntelligently learns your way of typing!Powerful next word predictionGo wild with emojisComfortable typing experienceChoose from 1000s of different colors for your background & font on the flyDelete words quickly with a swipeLearn more about the different features-Smartphone keyboard - http://snapkeys.com/smartphone-keyboard/Users can even take it one step further, and type only on the left and right side of the keyboard, regardless of typing near your letter, and Snapkeys' powerful predictive technology will know what you to type.Use quick gestures for shortcuts to enter special characters, and functions. Type on the \" BNM ' \" key for apostrophe. Apostrophe is part of the prediction. Type it: No more IN instead of I’M or vise versa.Languages Available -EnglishMany more on the way...SnapKeys has always been avant-gardist in breakthrough keyboard technologies. We are the first in bringing some of the most innovative features to typing, such as-        Very sloppy typing that works        Invisible keyboard that works        Dressing up your keyboard in colors        Resizing the keyboard        Small split keyboard with sloppy typing that works        Small movable keyboard\tEntering special characters by gesture\tDeleting a word by gesture\tMaking space and backspace by gestures\tAnd many moreHow to enable the Snapkeys Keyboard?- Open Snapkeys app.- Press Enable Snapkeys, then check the Snapkeys box on the Languages & Settings page to enable it. - Press Switch to Snapkeys, then check the Snapkeys box to switch your current keyboard to Snapkeys.- Now you could enjoy typing with the Snapkeys Keyboard!Note: The warning message “Snapkeys may be able to collect all the text you type, including personal data like passwords and credit card numbers\" is a standard Android message when you install any third party keyboard. Website - www.snapkeys.comSupport - info@snapkeys.comPress - pr@snapkeys.com.Follow us on Facebook - https://www.facebook.com/snapkeys/?fref=tsFollow us Twitter - https://twitter.com/SnapkeysFollow us on LinkedIn - https://www.linkedin.com/company/1144114?trk=tyah&trkInfo=clickedVertical%3Acompany%2CclickedEntityId%3A1144114%2Cidx%3A1-1-1%2CtarId%3A1471551083702%2Ctas%3AsnapkeysSubscribe to our Youtube Channel -  https://www.youtube.com/channel/UCI2WwN6PD6oz0sEMEse_T0gEnjoy typing with the best keyboard for your smartphone!",
    "descriptionHTML": "The Snapkeys Smartphone Keyboard is designed for Android Smartphones. The unique QWERTY keyboard layout, combined with a state-of-the-art predictive technology enables users to type extremely fast and very comfortably on a smartphone. <br><br>Reads your mind! Type sloppily with the Snapkeys Keyboard, and get your words. <br><br>The most intelligent, and the fastest keyboard, across devices with any screen size: From the smallest (smartwatch) to the midst (smartphone) and the largest (tablet). See what the press says:<br><br>        &quot;the most intelligent keyboard&quot; - The Daily Mail <br>        &quot;smoking fast and accurate&quot; - The Discovery Channel<br>        &quot;...blazes like you wouldn&apos;t believe&quot; - Gizmodo<br>        &quot;You might want to sit down for this&quot; - The Verge<br>        &quot;Furiously peck out messages and emails on your smartwatch&quot; - CNET<br><br>Just type, and  Snapkeys&apos; predictive algorithms will take care of the rest<br>Amazing swipe technology - Mix short swipes and taps<br>Extremely fast typing<br>Intelligently learns your way of typing!<br>Powerful next word prediction<br>Go wild with emojis<br>Comfortable typing experience<br>Choose from 1000s of different colors for your background &amp; font on the fly<br>Delete words quickly with a swipe<br><br>Learn more about the different features-<br><br>Smartphone keyboard - http://snapkeys.com/smartphone-keyboard/<br><br>Users can even take it one step further, and type only on the left and right side of the keyboard, regardless of typing near your letter, and Snapkeys&apos; powerful predictive technology will know what you to type.<br><br>Use quick gestures for shortcuts to enter special characters, and functions. <br><br>Type on the &quot; BNM &apos; &quot; key for apostrophe. Apostrophe is part of the prediction. Type it: No more IN instead of I&#x2019;M or vise versa.<br><br>Languages Available -<br>English<br>Many more on the way...<br><br>SnapKeys has always been avant-gardist in breakthrough keyboard technologies. We are the first in bringing some of the most innovative features to typing, such as-<br>        Very sloppy typing that works<br>        Invisible keyboard that works<br>        Dressing up your keyboard in colors<br>        Resizing the keyboard<br>        Small split keyboard with sloppy typing that works<br>        Small movable keyboard<br>\tEntering special characters by gesture<br>\tDeleting a word by gesture<br>\tMaking space and backspace by gestures<br>\tAnd many more<br><br>How to enable the Snapkeys Keyboard?<br>- Open Snapkeys app.<br>- Press Enable Snapkeys, then check the Snapkeys box on the Languages &amp; Settings page to enable it. <br>- Press Switch to Snapkeys, then check the Snapkeys box to switch your current keyboard to Snapkeys.<br>- Now you could enjoy typing with the Snapkeys Keyboard!<br><br>Note: The warning message &#x201C;Snapkeys may be able to collect all the text you type, including personal data like passwords and credit card numbers&quot; is a standard Android message when you install any third party keyboard. <br><br>Website - www.snapkeys.com<br><br>Support - info@snapkeys.com<br><br>Press - pr@snapkeys.com.<br><br>Follow us on Facebook - https://www.facebook.com/snapkeys/?fref=ts<br><br>Follow us Twitter - https://twitter.com/Snapkeys<br><br>Follow us on LinkedIn - https://www.linkedin.com/company/1144114?trk=tyah&amp;trkInfo=clickedVertical%3Acompany%2CclickedEntityId%3A1144114%2Cidx%3A1-1-1%2CtarId%3A1471551083702%2Ctas%3Asnapkeys<br><br>Subscribe to our Youtube Channel -  https://www.youtube.com/channel/UCI2WwN6PD6oz0sEMEse_T0g<br><br>Enjoy typing with the best keyboard for your smartphone!",
    "histogram": {
        "1": 9,
        "2": 3,
        "3": 6,
        "4": 6,
        "5": 28
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/uGzEmcb0rPaYg13j3RgdJNSWWFPUTqCGSmZ2t83gMOsvacHQ8kAkrvxmtocLotsDJ7I=h310",
        "//lh3.googleusercontent.com/uY_e757UDdhswlHK0dTlxMbzyyp2mswX-y-RcfkDCphkuIQsceALzlyywB4jEIQ02g=h310",
        "//lh3.googleusercontent.com/8Ux7-rEtzBVMQBivH-TibPfVDXfDHLzvSPgiPm9HKtQnuyM2f02Qob9tk20ZFL_kbug=h310",
        "//lh3.googleusercontent.com/hIi7TFh8kxfOHGVo7oOf9eKBdCbrXB4eiVv4AkFnXV2jtjUSwBrLk0Ehhqncocq6Lq4=h310",
        "//lh3.googleusercontent.com/a0s5SY-18a02CI5EhUE_emyhVs2jzUV7A_U5LxrlIqHSILV3Gn3-NvOaFcA8y85nTgM=h310",
        "//lh3.googleusercontent.com/vF4oPMnkMYS9zb1U0Bbur7zyy8eQioWT1kv6KH5z_GXMXs0xIPMPlRQJZpLc2bSs1w=h310",
        "//lh3.googleusercontent.com/AdU00eRCkS-90kwfxtEU2qa-iYTM66WOxTa3XYS_qnTdmgfW_qqlffsi42Fmu0ADGbQ=h310",
        "//lh3.googleusercontent.com/ofysFt7n1_bXFUF1-0mPmvmde578FN-Ipx6eaJ7nAfuat38KZfg2kGJDJgRI_iKWJVlN=h310",
        "//lh3.googleusercontent.com/KKcUx9KUnqK3DX4aL_LWIIRSFMB6RlZmUB6VkDx2a3ky4PvyO1Pa8s7Qc08epbPMmGKA=h310"
    ],
    "video": "https://www.youtube.com/embed/xlm6xrm_kvI",
    "comments": [
        "The Next Big Thing Love this keyboard. Can't wait for the new Google watch so I can download this keyboard on it.",
        "What a shame this awesome keyboard does not have support for portuguese language. I think this kind of typing is the next step of smartphone keyboards. But I use portuguese too, so I have to discard it.",
        "Love it on my phone.  However does not work on my Sony Smartwatch 3.  UPDATE:  Since it is not there fault that Google has not pushed android wear 2.0 to my smartwatch, I do not feel just in dinging snapkeys for that.  Going to up my rating to show how I feel about it working as a phone keyboard replacement.",
        "That App Icon though Haven't tested it yet, I'll wait until an official Android wear 2 release. Just seeing the video it look promising. However, please reconsider redesigning you app icon.",
        "Doesn't work on Huawei smart watch Installed it and it keeps crashing. Uninstalled and reinstalled... No change. Too bad!",
        "Good but... Why are the O and L keys switched? Makes no sense. Makes any word with those letters in them impossible to type at speed. Besides that very good!"
    ],
    "recentChanges": [
        "We have updated the Snapkeys Keyboard app to accommodate all Android Smartphones.",
        "There were some minor bug fixes in this updated version.",
        "The Snapkeys Keyboard will no longer work on your Android Wear smartwatch in this version. We are building a separate app for the Snapkeys smartwatch keyboard that should be available shortly."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sk.ime.phone_container&hl=en&gl=us",
    "appId": "com.sk.ime.phone_container"
}