{
    "title": "Remote Control Collection Pro",
    "summary": "Remotely control your PC! Mouse, Keyboard, Media Player, Slideshows and more!",
    "icon": "//lh4.ggpht.com/V8WPJqbPXrZA6MIRQXxiL-f3BxomPoD8vfY0ODSWUkQ2cBw_VTOFc10IkhkpMj7zMfQ=w300",
    "price": "$3.49",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.3,
    "reviews": 958,
    "developer": "Steppschuh",
    "developerId": "7874931121514501344",
    "developerEmail": "support@android-remote.com",
    "developerWebsite": "http://remote-control-collection.com",
    "developerAddress": "Stephan Schultz\nGeschwister-Scholl-Str. 80\n14471 Potsdam, Brandenburg\nGermany",
    "updated": "April 21, 2015",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Use your Android device as a remote for your Windows PC - Control the mouse, keyboard, media, presentations and more!The Remote Control Collection is a compilation of remotes, which you can use to wirelessly control your Windows PC. The unified remotes enable you to control the PC beyond mouse and keyboard!What others say:DotTech.org:Very responsive and very convenient to useChip.de:Solid application with brilliant simplicityUnlockPWD.com:There are many remotes out there, this one is on another levelAndroid-User.de:Setting up this app is a no-brainerTomsGuide.com:Top app for controlling your PCIncluded remote controls are:-Mouse-Keyboard-Live Screen (Pro)-Media Player (Pro)-Slideshows (Pro)-Speech RecognitionMouse RemoteImagine your PC’s touchpad right on your Android device. Multitouch gestures like scrolling and zooming are supported. You can toggle the keyboard to send keys at the same time.Keyboard RemoteUse the physical or virtual Android keyboard to type characters and they will appear on your PC. Important keys like Windows, Escape and Control are also available.Live Screen RemoteSee your PC's screen live right on your Android device and control the mouse in real time. Media RemoteControl the media player of your choice! Supported are Windows Media Player, iTunes, VLC, Media Monkey, Songbird and more.Slideshow RemoteControl your slideshows directly from your smartphone! The screen of your PC will be transmitted to your smartphone in real time! That works with Powerpoint, Impress and Adobe Reader, Windows Media Center and more.Speech recognitionSimply say what you want to be typed on your PC. You can also use voice commands to control your PC's media, e.g. \"skip this track\" or \"turn the volume up\".Android Wear SupportYou can now control your PC directly from your wrist! Super handy for presentations or controlling a media player.Much moreThe Remote Control Server is open source and can be used to control any device in your network. You can use this app to control all your internet of things (IOT) ready devices - like Arduino, Raspberry Pi and so on.To receive the commands from the Remote Control App, you will need the Remote Control Server. You can download it for free from:http://server.android-remote.comIf you have trouble setting up a connection, follow this step-by-step guide or watch the video tutorial at: http://setup.android-remote.com/Facebook fans can test the pro version for free:http://facebook.com/RemoteControlAppsPermissions:Network communicationFor creating network sockets and using custom network protocols to connect with the pc.Phone callsIs needed to create a unique device id. Used to verify purchases and register unlock codes.VibrationFor haptic feedback.",
    "descriptionHTML": "<b>Use your Android device as a remote for your Windows PC - Control the mouse, keyboard, media, presentations and more!</b><br>The Remote Control Collection is a compilation of remotes, which you can use to wirelessly control your Windows PC. The unified remotes enable you to control the PC beyond mouse and keyboard!<br><br><br><br><b>What others say:</b><br>DotTech.org:<br><i>Very responsive and very convenient to use</i><br><br>Chip.de:<br><i>Solid application with brilliant simplicity</i><br><br>UnlockPWD.com:<br><i>There are many remotes out there, this one is on another level</i><br><br>Android-User.de:<br><i>Setting up this app is a no-brainer</i><br><br>TomsGuide.com:<br><i>Top app for controlling your PC</i><br><br><br><br><b>Included remote controls are:</b><br>-Mouse<br>-Keyboard<br>-Live Screen (Pro)<br>-Media Player (Pro)<br>-Slideshows (Pro)<br>-Speech Recognition<br><br><br><br><b>Mouse Remote</b><br>Imagine your PC&#x2019;s touchpad right on your Android device. Multitouch gestures like scrolling and zooming are supported. You can toggle the keyboard to send keys at the same time.<br><br><b>Keyboard Remote</b><br>Use the physical or virtual Android keyboard to type characters and they will appear on your PC. Important keys like Windows, Escape and Control are also available.<br><br><b>Live Screen Remote</b><br>See your PC&apos;s screen live right on your Android device and control the mouse in real time. <br><br><b>Media Remote</b><br>Control the media player of your choice! Supported are Windows Media Player, iTunes, VLC, Media Monkey, Songbird and more.<br><br><b>Slideshow Remote</b><br>Control your slideshows directly from your smartphone! The screen of your PC will be transmitted to your smartphone in real time! That works with Powerpoint, Impress and Adobe Reader, Windows Media Center and more.<br><br><b>Speech recognition</b><br>Simply say what you want to be typed on your PC. You can also use voice commands to control your PC&apos;s media, e.g. &quot;skip this track&quot; or &quot;turn the volume up&quot;.<br><br><b>Android Wear Support</b><br>You can now control your PC directly from your wrist! Super handy for presentations or controlling a media player.<br><br><b>Much more</b><br>The Remote Control Server is open source and can be used to control any device in your network. You can use this app to control all your internet of things (IOT) ready devices - like Arduino, Raspberry Pi and so on.<br><br><br>To receive the commands from the Remote Control App, you will need the Remote Control Server. You can download it for free from:<br>http://server.android-remote.com<br><br>If you have trouble setting up a connection, follow this step-by-step guide or watch the video tutorial at: <br>http://setup.android-remote.com/<br><br>Facebook fans can test the pro version for free:<br>http://facebook.com/RemoteControlApps<br><br><br><b>Permissions:</b><br>Network communication<br>For creating network sockets and using custom network protocols to connect with the pc.<br><br>Phone calls<br>Is needed to create a unique device id. Used to verify purchases and register unlock codes.<br><br>Vibration<br>For haptic feedback.",
    "histogram": {
        "1": 65,
        "2": 36,
        "3": 62,
        "4": 217,
        "5": 578
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/LCOF2TMMwEMcCp7X1lMgpjcg8N2HPz0N29iggoJFMtVnZQRavPzvDERHks90J7BSEYw=h310",
        "//lh4.ggpht.com/x_-2SIvm2Tv67uRiqGYYqgzkgCoIfCz6tNOIuYUahJ2Tmr2KVKPBZIIeg33-IR-WsqtP=h310",
        "//lh6.ggpht.com/WfMlE9eDGASeeE-cDXI6ucaUQ-dfAlYTpnoG18S0EbfpsO6GyOBlhp_dE-EBNo6zNZg=h310",
        "//lh4.ggpht.com/hYjDxF0y_UOkfu_Q_Sy1ruxEKIvLtyjz9sqhfDjSOhJgxPnAv3VO3GIUa0AuU3ajsQ=h310",
        "//lh5.ggpht.com/nZ9SNTNNSkg2oWXv303wVxf8cJWTq9uN2_w-7OSr8hZ49chkfGDLIHM9EddS6FKMBw=h310",
        "//lh3.ggpht.com/U8kO9En7T0UWMd6BXtEeFrpA6sZZAB0YVRmTAFYk22_IkiNIVtLVdApu0hjjMhkuNWI=h310",
        "//lh6.ggpht.com/16B9VQh_qfdcIFr6drNnkr_YreuTaZtIqhXyPAoWL6Zeo97vjkdLyR3Ka2D7ctOAUg=h310",
        "//lh6.ggpht.com/r9ec35sBMTU0tmoxJ17CFuA04vXjx6siwKSLCYkCO6xxLMU8npMmaiWr4tCGGntf1p8=h310",
        "//lh3.ggpht.com/Bl8RCgzEdNb0wAMriFWJSm4VJPUFnTxHysS_zaLrfMX7JMjYAQ8yFBiLVhtRJ9LdG2s=h310",
        "//lh5.ggpht.com/x2I4zNosI7v4Y7qtKX5r48LmHj5Re7MO5Wt6viAKljOf0qmdh93MT_eslvM0aJmXxo62=h310",
        "//lh5.ggpht.com/JPjXG24vfh-oEkZ4GAay-57Y_EAKK0MznD2vva4xTYuisy6TolcfS-wFjh4aZDNnSnA=h310",
        "//lh4.ggpht.com/OCE1RUsM91DrDzdKMc36c2mlgtILKwE99Cj2IiHFTkJFrQhRo3lLScz2f7wAu6TA5bEB=h310",
        "//lh5.ggpht.com/smRu64_PH8iUmKnvIWeDQNZkAH7JByhsRQFL7wE_e13h9kljkIAteFejjU6FdDl_c7vK=h310",
        "//lh5.ggpht.com/4MzDae6Eoe1AcljhHV4005VcPDTn6PtFVmdKnBb2tj0wnb_BLfDQgdZLLxBVQtE6phU=h310",
        "//lh6.ggpht.com/9NMwdXeKWoyFpmrK21tuIYdHwNBAYBLQUUqvved9wKcGXna-SUfyjFss-L-3BB1MhA=h310",
        "//lh6.ggpht.com/as-7YPjLO11SelW3fru-9BehDK94VoOdfnOfsq8URw0ruwV_rzSst2xBLbRAEhSgLQ=h310"
    ],
    "video": "https://www.youtube.com/embed/dWq2mW6s-sA",
    "comments": [
        "Works well, a little input lag but to be expected when using a remote. Nice that it works with smartwatch(moto 360 2(2015)) but please add a little more functionality too the smart watch side though(mouse/keyboard/custom buttons) really fun being able to control presentation/media from watch, will definitely use next time I'm presenting something",
        "You wont actually regret paying about $4 on this thing. I know that I could have the apk for free on xda or somewhere. But come on, whats the joy in that. You gotta give credit to the dev as well. Performance wise, does everything as told and expected. It could have been awesome if it could utilize higher network speed to remove the glitches and make the display view more fluid, robust and efficient. Thanks for the awesome utility program.",
        "Would be the best app ever if : 1.you could send more commands p/sec (getting rid of the lag) 2. It had a custom shortcut/command option, making it able to launch apps (firefox,media player,games, etc),with some respective subcommands ( shortcuts to facebook,youtube,etc / diffrent files in difrent drives,etc) 3. Devote time to every comand, like, trying to use youtube has been the single worst experience I have had so far, if you would again use some shortcuts like play,pause, etc and do this for every application this app would actually",
        "Good app, does what's advertised. Happy with the app, but the remote desktop could use a full screen button for lazy people who don't want to turn on their screen rotation. Do that and you get 5 stars",
        "Best remote app Overall it's a great app and so far the best. User interface is beautiful. I would have given it a 5 if media mode worked with players other than Windows media player e.g VLC , and if I could turn the volume up/down by pressing the volume keys while the phone is locked.",
        "General Overall I love this app. Sometimes I find it lagging, can be difficult to truly control what's happening on the pc. I think aside from access to tool bar moving around the pc screen should behave like touch screen, scroll bars not needed."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.steppschuh.remotecontrolcollectionpro&hl=en&gl=us",
    "appId": "com.steppschuh.remotecontrolcollectionpro"
}