{
    "title": "Game Watch Collection",
    "summary": "A collection of games integrated watch faces. Tap your watch and start playing.",
    "icon": "//lh3.googleusercontent.com/WHGfGfqWB2jN4i6WtbLyJa8rvq-J3Zn4UMxaoA_YAk9n5gQNqaJcfwenGWknhz2Z9w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.7,
    "reviews": 39,
    "developer": "White Cat Studios",
    "developerId": "White+Cat+Studios",
    "developerEmail": "info@foxxy.mobi",
    "developerWebsite": "http://www.foxxy.mobi",
    "developerAddress": "10 Trei Asar st.\nKfar Saba\nIsrael",
    "updated": "April 7, 2016",
    "version": "1.2.0",
    "genre": "Casual",
    "genreId": "GAME_CASUAL",
    "description": "Game Watch Collection is a unique watch and mobile app that integrates games seamlessly with an interactive watch face. Discover a great collection of fun and addictive games, and pimp your watch with some great game play.Game Watch Collection is available for free. Download now and start enjoying some great games!Game Watch Collection includes multiple games and watch faces, each with a unique game play and visuals. Compete with other players and your friends and conquer the leader boards! Stay tuned for more games and watch faces that will be available periodically.Note: Use the \"Game Watch Collection\" app installed on your phone to select games and watch faces.\"If you're looking for something fun and not too serious, then you should definitely be checking out this\" (Android Central)All-in-all, Game Watch Collection is a great Android game for Android Wear watches that should happily appeal to a lot of different players out there. (Android Headlines)\"Offers addictive Flappy Bird endless gaming excitement to the batch of watch faces that simply only tell time\" (Androidtapp)When you fill the urge to play, simply tap the screen and start playing immediately! Our first game collection includes some very addictive games.CandyLand One of the most addictive games on mobile arrived to your watch. Millions of players are already playing this very simple game around the world. Your objective is to fire the candies to the rotating wheel without hitting other candies. But don't forget, with each level you complete, it becomes harder!\t\tEuro2016 Dribble Soccer addicts, this game is for you. Can't wait until the European Championship of 2016 starts? Then let's play some football straight on your watch. After you choose your preferred team, your objective is to win your way up and reach the top rank. This one is a must have watch face for soccer fans. Flappy Goat Escape  Help our flappy goat escape the wilderness. Watch out for hungry lions and fences, eat carrots for points and pumpkins for shields. Your objective is to survive as long as possible, and gain as many points as you can.More games coming soon.. stay tuned!",
    "descriptionHTML": "<b>Game Watch Collection</b> is a unique watch and mobile app that integrates games seamlessly with an interactive watch face. Discover a great collection of fun and addictive games, and pimp your watch with some great game play.<br><br><b>Game Watch Collection</b> is available for free. Download now and start enjoying some great games!<br><br><b>Game Watch Collection</b> includes multiple games and watch faces, each with a unique game play and visuals. Compete with other players and your friends and conquer the leader boards! Stay tuned for more games and watch faces that will be available periodically.<br><br><b>Note: Use the &quot;Game Watch Collection&quot; app installed on your phone to select games and watch faces.</b><br><br><i>&quot;If you&apos;re looking for something fun and not too serious, then you should definitely be checking out this&quot;</i> (Android Central)<br><br><i>All-in-all, Game Watch Collection is a great Android game for Android Wear watches that should happily appeal to a lot of different players out there.</i> (Android Headlines)<br><br><i>&quot;Offers addictive Flappy Bird endless gaming excitement to the batch of watch faces that simply only tell time&quot;</i> (Androidtapp)<br><br>When you fill the urge to play, simply tap the screen and start playing immediately! Our first game collection includes some very addictive games.<br><br><b>CandyLand</b> One of the most addictive games on mobile arrived to your watch. Millions of players are already playing this very simple game around the world. Your objective is to fire the candies to the rotating wheel without hitting other candies. But don&apos;t forget, with each level you complete, it becomes harder!<br>\t\t<br><b>Euro2016 Dribble</b> Soccer addicts, this game is for you. Can&apos;t wait until the European Championship of 2016 starts? Then let&apos;s play some football straight on your watch. After you choose your preferred team, your objective is to win your way up and reach the top rank. This one is a must have watch face for soccer fans. <br><br><b>Flappy Goat Escape </b> Help our flappy goat escape the wilderness. Watch out for hungry lions and fences, eat carrots for points and pumpkins for shields. Your objective is to survive as long as possible, and gain as many points as you can.<br><br>More games coming soon.. stay tuned!",
    "histogram": {
        "1": 8,
        "2": 3,
        "3": 3,
        "4": 4,
        "5": 21
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/2LGgiGilo0kdVApNu9Hcjb9QblhH6f4gxli5TuI4jbpq8VocJCzWg3XdvJvFEF75GWg=h310",
        "//lh3.googleusercontent.com/-1KnOwjuKBla_Ot5y0LIwmGf99JWZmVAGJbFH6jLY1FjxCDcjpfaCWN1vodP-ojNg1o=h310",
        "//lh3.googleusercontent.com/zVe1oXBxPcqaIC_W7oWyRXY3FPzWVbb1FvINH9XnGpx41tz-hu3RuAi3wruKhXMbtTU=h310",
        "//lh3.googleusercontent.com/HJLNV0ZVWAleHC9SgoV3uwY8qIgavc90V1o0KAD8cxDrqIoUdjI0H-vLn2MlC0a0TaQ=h310",
        "//lh3.googleusercontent.com/g8StOxWL_GWuuq-fc2gNCHgOCPIRoAAZzTd5UNzfqqrBT22fy1nqDror7nM-KB5EYplP=h310",
        "//lh3.googleusercontent.com/yNzahqVIKG_8NA7_6Uc9k050J_XQlRYGBLCcYaoaG_6UPsWNQc5Tp0tH5w7mqyHiDg=h310",
        "//lh3.googleusercontent.com/ebjellDx-c8HGGMERPuD1zazluq48PMEODFdpM1F96LB82CoJSNxqJC6mOebocjbuP3M=h310",
        "//lh3.googleusercontent.com/r1lz3X6VVtRGZVv1i9K66B4kmY4Wkuce5Np-_lTmvAkM1ztdaROpVX7vaErCj65nL6Y=h310",
        "//lh3.googleusercontent.com/E3JdHmyFtti5Ng2-se3fCjMGk9EUR4f1Tz-QLKU3FovvobdArsKan0e6uVLevQrGc2ov=h310",
        "//lh3.googleusercontent.com/yHJSUPUiLgYmdgINLbgxO-k8SzHoqPVEKCdYfpTUyj_Al4GuwTrAqsuceL2HcsIxbg=h310",
        "//lh3.googleusercontent.com/EAyesUAjJ0s8WeGO5_rQv_xLH4wE15d8cgc2mrdBGxDnTZjKAh4gdmLldV_GVlj8CYE=h310",
        "//lh3.googleusercontent.com/KlV3mxJEVSn-tB7sOl1Q0dimC46dPqSJW-snqRyMc4flhrOTxrhiIgyO78Lxh6Lw4s4a=h310",
        "//lh3.googleusercontent.com/gySZ2g6E0iU63X9sKmEcEBGjjbgYssMQhHbv2SeJPbxB_ONqHE-gLqvmSWh_lFgRAw=h310",
        "//lh3.googleusercontent.com/iqz3bTY9DKanvtJpe33-znWb1RAhqsaov4MtZiBYktibX-ZtK-b24LwDNyqRJklAjg=h310",
        "//lh3.googleusercontent.com/eOt8StPpTCotkCUt3ll6Xc3NSDlmKH-iLlOmx1Uwyhxpjdll5KJDT6kHq2WmtfkL4ro=h310"
    ],
    "comments": [
        "Very bad It's not coming on my Samsung gear live",
        "Not enough Only has 3 games. Need to add more",
        "No work on moto 360 Help not working on moto 360",
        "Can only play one game.. Not bad just wish I could play  the other games advertised",
        "Thank you for wonderful games. My kids love it",
        "Cool"
    ],
    "recentChanges": [
        "* New Watch faces for all the games, making a total of 13 faces to choose from!",
        "* Use the phone app to select your preferred watch face.",
        "* Performance improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.foxxymobile.gamewatches&hl=en&gl=us",
    "appId": "com.foxxymobile.gamewatches"
}