{
    "title": "kicker - Fußball News",
    "summary": "KICKER - SOCCER BUNDESLIGA, CHAMPIONS LEAGUE, DFB CUP, Regional SPORT +",
    "icon": "//lh3.googleusercontent.com/cB5VS4t9F_j_o4M6lFbRauvBQhen1Q3Imh0KiJaXbxzFleXOkXC9M07TePSE4LDn2w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.3,
    "reviews": 55472,
    "developer": "Olympia-Verlag",
    "developerId": "Olympia-Verlag",
    "developerEmail": "app@kicker.de",
    "developerWebsite": "http://www.kicker.de/home/appkontakt.html",
    "developerAddress": "Badstr. 4-6\n90402 Nürnberg",
    "updated": "February 28, 2018",
    "version": "5.1.1",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "Die FUSSBALL App von Deutschlands Sportmagazin Nr.1, top aktuell und mit Podcasts zur Fußball Bundesliga und Champions League, Push-Erweiterungen  und eSport News!Alle Fußballspiele und Tore aus Bundesliga, Champions League, DFB Pokal, Europa League, der 2. und 3. Liga der Amateure sowie Regionalliga. Fußball News, Live Tabelle, Spielberichte, Sport Highlights, Eilmeldungen und Push Infos zu Topmeldungen und jedem Tor in Echtzeit - jetzt auch für Handball, Basketball, Eishockey und Football.Highlights und DAZN Videos zu Bundesliga und Premier League als VOD, Taktik-Analysen und News zu Teams und Spielen. Holen Sie sich jetzt die beliebte kicker Fußball & Sport App auf Ihr Smartphone und verpassen Sie kein Tor!Alle FUSSBALL Spiele, TORE und spannende SPIELBERICHTESie suchen Spielergebnisse von den Profis oder Ihrem lokalen Verein? kicker kennt alle Spielpläne und Ergebnisse! Sport Experten informieren direkt aus den Stadien dieser Welt über 1. Bundesliga, 2. Bundesliga, Premier League, Championsleague und Europa League, Primera Division, Serie A, DFB-Pokal, 3. Liga und Amateur Fußball.Schnellster LIVE TICKERMit dem Fußball Live Ticker alle Infos zum Spiel und Bilder direkt vom Rasen - Ihre mobile Sportschau.MEHR als FUSSBALLTägliche News aus allen nationalen und internationalen Ligen. Spielberichte, DAZN Highlight Videos, Interviews, PKs und detaillierte Transferinformationen & Ablösesummen. Jetzt noch besser informiert mit Push Informationen zu wichtigen Sportnachrichten.kicker Fußball Manager jetzt noch besserGewinnen Sie Preise mit dem kicker Tipp- und Managerspiel und tippen Sie auf mehr als 1.900 Wettbewerbe. Jetzt mit Erinnerungs-Push für das Managerspiel.Immer die neuesten FanartikelAuf allen Teamseiten der 1. und 2. Bundesliga haben Sie direkten Zugriff auf aktuell Fanartikel ihrer Lieblingsmannschaft, wie Trikots, Schals und vielem mehr.Werbefrei Erleben Sie für nur 99 Cent im Monat die kicker App ganz ohne Werbung. Mein kicker, MEIN VEREINIm \"mein kicker\" Bereich können Sie Ihren Verein auf der Startseite platzieren, aktuelle Nachrichten direkt abrufen und Push Nachrichten individualisieren.Viel mehr als nur FUSSBALLkicker zeigt Ihnen alles zur Bundesliga und Champions League. Außerdem alle eSport News, Videos zu Spielen wie FIFA, Pro Evolution Soccer, Starcraft II etc. Jetzt mit vielen neuen Cups und Wettbewerben! Außerdem spannende Berichte, Liveticker und Livescores zu Eishockey (DEL), Basketball (NBA) und Handball (HBL). American Football (NFL) jetzt mit eigener Berichterstattung!Die kicker Fussball News App bietet Nachrichten, Liveergebnisse, Liveticker und Statistiken zu Ballbesitz, Fouls, Elfmetern, Ecken, etc. und das für die 1. und 2. Bundesliga, 3. Liga, DFB-Pokal, und Champions League. Mit der kicker App sind Sie immer über nationale (u.a. Bayern München, Borussia Dortmund, Gladbach, Schalke 04, HSV, Hertha BSC, FC Kaiserslautern, 1. FC Köln oder 1. FC Nürnberg) und internationale Vereine (u.a. Real Madrid, Arsenal, Liverpool, Juventus oder Paris St. Germain) informiert. Statistiken zu allen Top Spielern wie Messi, Ronaldo, Neymar, Suarez, Götze, Ribery, Neuer, Müller, Hummels, Lewandowski, Schweinsteiger, Reus, Ronaldo, Rooney, oder Özil.Sollten Sie Fragen, Kritik oder Anregungen haben, wenden Sie sich bitte einfach an uns!app@kicker.de",
    "descriptionHTML": "Die <b>FUSSBALL App</b> von Deutschlands <b>Sportmagazin Nr.1</b>, top aktuell und mit <b>Podcasts</b> zur Fu&#xDF;ball Bundesliga und Champions League, <b>Push-Erweiterungen</b>  und <b>eSport News</b>!<br>Alle Fu&#xDF;ballspiele und Tore aus Bundesliga, Champions League, DFB Pokal, Europa League, der 2. und 3. Liga der Amateure sowie Regionalliga. Fu&#xDF;ball News, <b>Live Tabelle</b>, Spielberichte, Sport Highlights, <b>Eilmeldungen</b> und Push Infos zu <b>Topmeldungen</b> und jedem <b>Tor in Echtzeit</b> - jetzt auch f&#xFC;r Handball, Basketball, Eishockey und Football.<br><br><b>Highlights und DAZN Videos zu Bundesliga und Premier League als VOD</b>, Taktik-Analysen und News zu Teams und Spielen. Holen Sie sich jetzt die beliebte kicker Fu&#xDF;ball &amp; Sport App auf Ihr Smartphone und <b>verpassen Sie kein Tor!</b><br><br><b>Alle FUSSBALL Spiele, TORE und spannende SPIELBERICHTE</b><br>Sie suchen Spielergebnisse von den Profis oder Ihrem <b>lokalen Verein</b>? kicker kennt alle Spielpl&#xE4;ne und Ergebnisse! Sport Experten informieren direkt aus den Stadien dieser Welt &#xFC;ber 1. Bundesliga, 2. Bundesliga, Premier League, Championsleague und Europa League, Primera Division, Serie A, DFB-Pokal, 3. Liga und Amateur Fu&#xDF;ball.<br><br><b>Schnellster LIVE TICKER</b><br>Mit dem Fu&#xDF;ball Live Ticker alle Infos zum Spiel und Bilder direkt vom Rasen - Ihre mobile Sportschau.<br><br><b>MEHR als FUSSBALL</b><br>T&#xE4;gliche News aus allen nationalen und internationalen Ligen. Spielberichte, DAZN Highlight Videos, Interviews, PKs und detaillierte Transferinformationen &amp; Abl&#xF6;sesummen. Jetzt noch besser informiert mit Push Informationen zu wichtigen Sportnachrichten.<br><br><b>kicker Fu&#xDF;ball Manager jetzt noch besser</b><br>Gewinnen Sie Preise mit dem kicker Tipp- und Managerspiel und tippen Sie auf mehr als 1.900 Wettbewerbe. Jetzt mit Erinnerungs-Push f&#xFC;r das Managerspiel.<br><br><b>Immer die neuesten Fanartikel</b><br>Auf allen Teamseiten der 1. und 2. Bundesliga haben Sie direkten Zugriff auf aktuell Fanartikel ihrer Lieblingsmannschaft, wie Trikots, Schals und vielem mehr.<br><br><b>Werbefrei</b> <br>Erleben Sie f&#xFC;r nur 99 Cent im Monat die kicker App ganz ohne Werbung. <br><br><b>Mein kicker, MEIN VEREIN</b><br>Im &quot;mein kicker&quot; Bereich k&#xF6;nnen Sie Ihren Verein auf der Startseite platzieren, aktuelle Nachrichten direkt abrufen und Push Nachrichten individualisieren.<br><br><b>Viel mehr als nur FUSSBALL</b><br>kicker zeigt Ihnen alles zur Bundesliga und Champions League. Au&#xDF;erdem alle eSport News, Videos zu Spielen wie FIFA, Pro Evolution Soccer, Starcraft II etc. Jetzt mit vielen neuen Cups und Wettbewerben! Au&#xDF;erdem spannende Berichte, Liveticker und Livescores zu Eishockey (DEL), Basketball (NBA) und Handball (HBL). American Football (NFL) jetzt mit eigener Berichterstattung!<br><br>Die kicker Fussball News App bietet Nachrichten, Liveergebnisse, Liveticker und Statistiken zu Ballbesitz, Fouls, Elfmetern, Ecken, etc. und das f&#xFC;r die 1. und 2. Bundesliga, 3. Liga, DFB-Pokal, und Champions League. Mit der kicker App sind Sie immer &#xFC;ber nationale (u.a. Bayern M&#xFC;nchen, Borussia Dortmund, Gladbach, Schalke 04, HSV, Hertha BSC, FC Kaiserslautern, 1. FC K&#xF6;ln oder 1. FC N&#xFC;rnberg) und internationale Vereine (u.a. Real Madrid, Arsenal, Liverpool, Juventus oder Paris St. Germain) informiert. Statistiken zu allen Top Spielern wie Messi, Ronaldo, Neymar, Suarez, G&#xF6;tze, Ribery, Neuer, M&#xFC;ller, Hummels, Lewandowski, Schweinsteiger, Reus, Ronaldo, Rooney, oder &#xD6;zil.<br><br>Sollten Sie Fragen, Kritik oder Anregungen haben, wenden Sie sich bitte einfach an uns!<br>app@kicker.de",
    "histogram": {
        "1": 3445,
        "2": 1937,
        "3": 3529,
        "4": 13956,
        "5": 32605
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/5Xdf2hZYAHu7AGYyZJ3KXUBslEjU21ywArUCg1KCuM-LqeJpdXfta9a_9FvhGFW0=h310",
        "//lh3.googleusercontent.com/LJZq8XJUY7d6Opr7pudUcpUCdnIx-OxGa9R6cjrojZFYvlNG9YpanHv7Ts_pQ35LLA=h310",
        "//lh3.googleusercontent.com/QebPzY66K-v_f79t457_o0dmNHnlGiDjzWH0YxweN9Ne4mhyP1kjEYZEty9cGlfmUJI=h310",
        "//lh3.googleusercontent.com/qhqe20jlUXQHcP3TJ6SzAgQvNZra3klCGgyo2a1ipKOQgGUYDkNnPqgM--KhhQlDzAwd=h310",
        "//lh3.googleusercontent.com/5BZSP3zpgdGRdV8KuOyfD4hOVHKBeDec7D5E9aeoZPn_yY9At34Cb3IfHtq_qsuz_Sw=h310",
        "//lh3.googleusercontent.com/0Bf9bFKlzlCz-KKlp24CDzF_qRUciUu3qlP1RucpIK2qgUCwjAWhcs31gog3nV0WOpE=h310",
        "//lh3.googleusercontent.com/AFqBlS8eoNjkmBfPe9LFis9amO65nPsifdKXXt1_QGBhomYjcNmmbBLI9sw-uDyjsZM=h310",
        "//lh3.googleusercontent.com/YL4z3nQ_Aq0ZYpRVadmN2BHfV8vklxCuOV9-f7HB3R7VF_OwGfY2Kh7gM_Yj5UZ1Cw=h310",
        "//lh3.googleusercontent.com/TqZWUh4vX5DT60QLEiRRQrklviq-1NgiPZFM3SzziAAPQisXPBBMPFhMIY7BVoO3YA=h310",
        "//lh3.googleusercontent.com/tsydX3_CIvL28u9YhIHM5UxxFf9wGU89IWaCxSw4vxZeNLMpA2qO1YlX2nCfMk4Ll-o=h310",
        "//lh3.googleusercontent.com/paoIqo0aYitybyjLUiA_Uf6PWBwaQ1_R4gKQH7j_fu4F5YtDyiD3F_vLpQ3hClCWrTR-=h310",
        "//lh3.googleusercontent.com/oUnNmrC9nzMgHCj3GYvIPTB68BE-cs9HHjtnaVkSU-LZVigCTcGAnKZOE28RQM7leQ=h310",
        "//lh3.googleusercontent.com/DQdqyeAAibcVv9u8cUacIlUwrH-79UEZPCRmXUBoLvgijpaEMwVNEfhiVP6TzMvWnA=h310"
    ],
    "comments": [
        "Great app. Only problem is that it only shows German kick off times. If your in a different country with time zone that can be confusing.",
        "Hallo, ich habe das Problem, dass diese App nicht auf Google Pixel C (Android 8.1) läuft. Es steht lediglich, dass es nicht mit dieser Version 8.1 kompatibel. LG",
        "Nicht kompatibel mit Pixel C (Android 8.1). Play Store zeigt \"Your device isn't compatible with this version\" an.",
        "zu viele Ads",
        "Die App ist super, seit letztem Update sind die Videos aber nicht mehr abspielbar.",
        "App im Grunde super. Nach letztem Update aber nicht länger zu gebrauchen, da nicht mehr ausführbar"
    ],
    "recentChanges": [
        "In diesem Update wurden einige Fehler behoben wie z.B. fehlende Spielminuten in Konferenz-Liveticker, fehlerhaftes Abspielen von eSport-Videos, Deaktivierung des Tippspiels ging nicht, unschöne Darstellung von Zusatzinformationen im Liveticker und der Spielinfo bei z.B. Toren, fehlendes Hin- und Rückrundenergebnis, Videocrashes).",
        "Wir haben darüberhinaus weiter an der Stabilität der App gearbeitet.",
        "Schreibt uns an app@kicker.de, falls etwas in der App nicht geht!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.netbiscuits.kicker&hl=en&gl=us",
    "appId": "com.netbiscuits.kicker"
}