{
    "title": "Dog Monitor",
    "summary": "Turn your two phones or tablets into one single dog monitor.",
    "icon": "//lh3.googleusercontent.com/rSV1FCYQIV2viGkLyFVKVuh9snBTa8NeKRMwfbN9OqgThdnkjM4ekJ8nSsHJlw1wXa_n=w300",
    "price": "$5.99",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.1,
    "reviews": 752,
    "developer": "TappyTaps s.r.o.",
    "developerId": "7865470206882283925",
    "developerEmail": "support@tappytaps.com",
    "developerWebsite": "http://www.dogmonitorapp.com",
    "developerAddress": "TappyTaps s.r.o\nČelakovského 1457\nHořice\n508 01\nCzech Republic",
    "updated": "October 9, 2017",
    "version": "4.2.4",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Check on your dog while you’re at work - know when it’s barking, talk to your dog remotely and see live video.This is the first multi-platform dog monitor with unlimited reach. It is a must-have for any dog owner.EASY TO USEWith the Dog Monitor app, you can easily turn any two devices (phone or tablets) into a full-featured dog monitor in a matter of seconds. No registration or connection adjustments required.KNOW WHEN YOUR DOG BARKSNow you can immediately find out when your dog barks. Wide sensitivity settings assure that you won’t miss any noise.ACTIVITY LOGDog Monitor allows you to check, how often was your dog noisy and replay sounds from current or any previous monitoring.TALK TO YOUR DOGIs your dog barking or chewing up your new shoes? Do you want to talk to him even if you’re not home? No problem. The Dog Monitor app lets you talk to your dog remotely from anywhere.LIVE HD VIDEO STREAMEver wondered what your dog does when you’re away? Watch video of your pet and see what they are up to. Thanks to our adjustable light feature, you can check-in on your dog even when it is dark.UNLIMITED REACHYou’ll always know what your dog is up to because the app works on both WiFi and cellular networks.COMMANDS \"Sit\", \"Stay\", \"Lay down\" record commands in your own voice and keep your dog entertained and well behaved remotely.EVERY NOISESensitizes the sound for you to hear even the tiniest noises.OTHER FEATURESVibrate - be alerted discreetly when your dog is barkingReliability - app let’s you know in case the connection is lost or something goes wrongSecurity - entire connection is encrypted by SSLSee more information at www.dogmonitorapp.comPlease send your feedback to support@tappytaps.com. We love to implement new features based on your ideas!",
    "descriptionHTML": "Check on your dog while you&#x2019;re at work - know when it&#x2019;s barking, talk to your dog remotely and see live video.<br>This is the first multi-platform dog monitor with unlimited reach. It is a must-have for any dog owner.<br><br><b>EASY TO USE</b><br>With the Dog Monitor app, you can easily turn any two devices (phone or tablets) into a full-featured dog monitor in a matter of seconds. No registration or connection adjustments required.<br><br><b>KNOW WHEN YOUR DOG BARKS</b><br>Now you can immediately find out when your dog barks. Wide sensitivity settings assure that you won&#x2019;t miss any noise.<br><br><b>ACTIVITY LOG</b><br>Dog Monitor allows you to check, how often was your dog noisy and replay sounds from current or any previous monitoring.<br><br><b>TALK TO YOUR DOG</b><br>Is your dog barking or chewing up your new shoes? Do you want to talk to him even if you&#x2019;re not home? No problem. The Dog Monitor app lets you talk to your dog remotely from anywhere.<br><br><b>LIVE HD VIDEO STREAM</b><br>Ever wondered what your dog does when you&#x2019;re away? Watch video of your pet and see what they are up to. Thanks to our adjustable light feature, you can check-in on your dog even when it is dark.<br><br><b>UNLIMITED REACH</b><br>You&#x2019;ll always know what your dog is up to because the app works on both WiFi and cellular networks.<br><br><b>COMMANDS</b> <br>&quot;Sit&quot;, &quot;Stay&quot;, &quot;Lay down&quot; record commands in your own voice and keep your dog entertained and well behaved remotely.<br><br><b>EVERY NOISE</b><br>Sensitizes the sound for you to hear even the tiniest noises.<br><br><b>OTHER FEATURES</b><br>Vibrate - be alerted discreetly when your dog is barking<br>Reliability - app let&#x2019;s you know in case the connection is lost or something goes wrong<br>Security - entire connection is encrypted by SSL<br><br>See more information at www.dogmonitorapp.com<br><br>Please send your feedback to support@tappytaps.com. We love to implement new features based on your ideas!",
    "histogram": {
        "1": 74,
        "2": 36,
        "3": 68,
        "4": 159,
        "5": 415
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ltkGnDSQWn_M6xq-55c1nidUSTimy8fgxeOhdj91RwyWqpsK_q6kk7o4xUMsHmksTKw=h310",
        "//lh3.googleusercontent.com/-Kk74nVkFdkyTS8nIvR3vAo0al8oQaMVSQyBjqN9ZL6sAoc13EAYC3N_J3nLWfDw7d4=h310",
        "//lh3.googleusercontent.com/wbVcJ8Acqf_u-1uID-J1b-ZOa4JlHPPiR7UicKU1ztFB5gzyxnquUS9lQXI43T9bHlk=h310",
        "//lh3.googleusercontent.com/n9fKc5KyxTry3Ezsc1ZMZM2ICcn2lrGv0NhHNkaisQs1Vjh_tyN_6Wuqd5G-WO_dcg=h310",
        "//lh3.googleusercontent.com/KDAJXYcTQL9yKUEk0DrV6yNzyK8nDkYoAsxg68UDWAX-UD3leFARjIsuEp9gnNGPYw=h310",
        "//lh3.googleusercontent.com/YoGafgxzrrdfhVUMmC9ZXHpcKGYrJnWfUCrJpPyybcbJLnMIhgtr5igTxPvUA2Etx8s=h310",
        "//lh3.googleusercontent.com/WBRhQXrakSb1sGB0tSclo0H7OPNx1IlsQivnMCvWHYJHxChI44L05iVhBOwRF4xsxzg=h310",
        "//lh3.googleusercontent.com/mftnRqW8VM8tITflppNCcnXPOQyMB5-fn1biZu3So66ImBdYC8fYXv6j3SDh7mm4rQ=h310",
        "//lh3.googleusercontent.com/L0QPcJdeYGEVEvttkH2ItmsRBXjMy0Qm5WV48_TPMyJR8RzQtIrmQSTEgKQze-zO5Qw=h310",
        "//lh3.googleusercontent.com/fYrFNkgsReTrgEygtUt-C-A_zuNqPid051DnH-F6evXt7PzelLQO2jxCrjySvPT73NM=h310",
        "//lh3.googleusercontent.com/PtqXd1WuTgyQdDRICV1-8kFyWltQEhzjc3EsY9EUIzOGjs0LLD67EkGpNt2Ve-9KyNs=h310",
        "//lh3.googleusercontent.com/-7FQG4i3cMIT4N45MZoTeoZtsoAturSbdE7N1yv630PeEpbl7OHidI4FQIhPZopxgRQ=h310",
        "//lh3.googleusercontent.com/_zkt2nbhasQgkAtX2JKH6Q1L--fuUx5BnNhGTfMxp7i-52rU4vBbSzA85_kXiZxvkB0=h310",
        "//lh3.googleusercontent.com/sBwO1LeiaMlu6aLYnTVNNuotPUw9-uTBc5IHhvXYWIfQvZehWBVjwws-ldb7EUkTeg=h310",
        "//lh3.googleusercontent.com/B0F0C3uZfCGaLIShysGIy0NEFlmRwKltiZ3nSONKi_FBWT9sVE2xhBsQV9GRmXs-ag=h310",
        "//lh3.googleusercontent.com/jk0a51WB-6ykSX6tNG2qKHcytUCbf7nnrBQke45XnK7iQnFXlbQvOPnyIWByhtcOm4EE=h310",
        "//lh3.googleusercontent.com/v6d9r-pTzM25rpqoEoxi7P9C0PIx1o037fSoKWQbuxTNxM69t1mY9vuU04CO7V5j7vDI=h310"
    ],
    "video": "https://www.youtube.com/embed/rQ1iBvn45fI",
    "comments": [
        "A waste of money. I had to purchase the app twice to use it on android and iphone. The dog station keeps disconnecting after one min and can't then reconnect without someone clicking on dog station again. Unfortunately my dogs do not know how to useca smart device. Our Internet speed is fantastic. I wish I hadn't wasted my money.",
        "I have been at it for hours now and I am beyond frustrated.  I am absolutely stumped as to how to get it onto a second device without paying again.  I have set up Google Family as instructed however still cannot get this app on a second device.  Surely it shouldn't be so hard??  Sorry but not at all user friendly.",
        "I love this app! I can check on my dog at anytime, watch her, hear her, talk to her, take snapshots, and even listen to her surroundings! The log is pretty neat too! Having a list of her noisy and quiet times are really useful. It's an amazing alternative to the expensive monitoring devices out there. The only feature I wish it had would be a 2 way camera so she could see me too.   The downside, I had to purchase the app from both Google Play and the App Store. My phone is an Android, and I don't have another Android device so I had to use my Mac. And an FYI, this won't work in BlueStacks on Windows because of the cam and mic functionality, and has issues with other Android emulators as well.",
        "My dog trainer suggested using a camera to deter counter surfing. I set it up in front of the food and with the preset command button I can yell at her without screaming into my phone in public. It works perfectly for what I needed.",
        "Some connection issues but easily resolved by exiting the app and opening again. But this is exactly what I needed to help my anxiety leaving my dog inside while at work. .  Turns out she just sleeps all day haha",
        "Very handy if you have older devices to use as the camera. It is a huge battery hog when you have it running in the background. Since my place is rather creaky, the app tends to pick up people in the building as dog noise which is annoying but understandable for such a simple app."
    ],
    "recentChanges": [
        "Version 4.2",
        "- Low volume warning - Will notify you that you might overhear sounds from the app",
        "- Automatic silent mode launch on Dog Station",
        "- Improved quality and stability of the video",
        "If you like the new update, please rate us on the Google Play. ;)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tappytaps.android.dogmonitor&hl=en&gl=us",
    "appId": "com.tappytaps.android.dogmonitor"
}