{
    "title": "Discover Mobile",
    "summary": "Manage your Discover account conveniently from anywhere.",
    "icon": "//lh6.ggpht.com/Tl0ZRw_ulXq3f72QenY4P1CYyn8fu3qCu6VQ1xxNPP1CENUj-9RE6983wdHBhnKfoMI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 72619,
    "developer": "Discover Financial Services",
    "developerId": "Discover+Financial+Services",
    "developerEmail": "mobappqs@service.discovercard.com",
    "developerWebsite": "http://www.discovercard.com/contact-us/",
    "updated": "February 8, 2018",
    "version": "9.2.1",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "You can manage your Discover credit card and bank accounts conveniently and securely from anywhere, using Discover’s Mobile App. Check your account balance, view your account info, make and edit payments, manage your rewards, and more - all from your mobile device.FAST ACCOUNT ACCESS• Log in quickly with a 4-digit Passcode• Enable Quick View to view account information without logging in MANAGE YOUR DISCOVER CREDIT CARD ACCOUNT• Check your balance and available credit, and view or download monthly statements• View and search transaction activity• Make payments and edit or cancel pending payments• Redeem rewards for statement credit or direct deposit in  any amount• Redeem rewards for Partner gift cards and eCertificates starting at $20 Cashback Bonus• View your FICO® Credit Score* for free and learn what it means to lenders*See FICO® Credit Score terms at Discover.com/FICO• Freeze or unfreeze your account to prevent new purchases, cash advances, and balance transfers • Send and receive messages with Discover Customer Service • View and edit your account profile • Activate a new card or report a current card as lost, stolen or misplaced• Use the Travel Notification feature to help ensure uninterrupted use of your card while traveling• Get great offers for being a cardmember with Discover Deals, the one-stop-shop where you can access instant savings at checkout, additional rewards, or statement credits for purchases with popular brands (for eligible Cardmembers)• Sign up to receive alerts about your accountMANAGE YOUR DISCOVER BANK DEPOSIT ACCOUNT AND PERSONAL LOAN ACCOUNT • View account balances, summary and transaction history• Track account activity and schedule transactions• Transfer money• Pay bills • Deposit checks• Find ATMs - Nationwide ATMs available to use your Discover debit card• View statements• View and send secure messages• Make Personal Loan paymentsDo you have questions or comments about Discover’s Mobile App? Email us at: mobappqs@service.discovercard.comMobile Privacy Statement:http://discover.com/privacyMobile Terms of Use:http://discover.com/terms",
    "descriptionHTML": "You can manage your Discover credit card and bank accounts conveniently and securely from anywhere, using Discover&#x2019;s Mobile App. Check your account balance, view your account info, make and edit payments, manage your rewards, and more - all from your mobile device.<br><br>FAST ACCOUNT ACCESS<br>&#x2022; Log in quickly with a 4-digit Passcode<br>&#x2022; Enable Quick View to view account information without logging in <br><br>MANAGE YOUR DISCOVER CREDIT CARD ACCOUNT<br>&#x2022; Check your balance and available credit, and view or download monthly statements<br>&#x2022; View and search transaction activity<br>&#x2022; Make payments and edit or cancel pending payments<br>&#x2022; Redeem rewards for statement credit or direct deposit in  any amount<br>&#x2022; Redeem rewards for Partner gift cards and eCertificates starting at $20 Cashback Bonus<br>&#x2022; View your FICO&#xAE; Credit Score* for free and learn what it means to lenders<br>*See FICO&#xAE; Credit Score terms at Discover.com/FICO<br>&#x2022; Freeze or unfreeze your account to prevent new purchases, cash advances, and balance transfers <br>&#x2022; Send and receive messages with Discover Customer Service <br>&#x2022; View and edit your account profile <br>&#x2022; Activate a new card or report a current card as lost, stolen or misplaced<br>&#x2022; Use the Travel Notification feature to help ensure uninterrupted use of your card while traveling<br>&#x2022; Get great offers for being a cardmember with Discover Deals, the one-stop-shop where you can access instant savings at checkout, additional rewards, or statement credits for purchases with popular brands (for eligible Cardmembers)<br>&#x2022; Sign up to receive alerts about your account<br><br>MANAGE YOUR DISCOVER BANK DEPOSIT ACCOUNT AND PERSONAL LOAN ACCOUNT <br>&#x2022; View account balances, summary and transaction history<br>&#x2022; Track account activity and schedule transactions<br>&#x2022; Transfer money<br>&#x2022; Pay bills <br>&#x2022; Deposit checks<br>&#x2022; Find ATMs - Nationwide ATMs available to use your Discover debit card<br>&#x2022; View statements<br>&#x2022; View and send secure messages<br>&#x2022; Make Personal Loan payments<br><br>Do you have questions or comments about Discover&#x2019;s Mobile App? Email us at: mobappqs@service.discovercard.com<br><br>Mobile Privacy Statement:<br>http://discover.com/privacy<br><br>Mobile Terms of Use:<br>http://discover.com/terms",
    "histogram": {
        "1": 3114,
        "2": 1145,
        "3": 2133,
        "4": 10730,
        "5": 55497
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/kTgmnp1YVE_RS08d-8bN--XUeVc1Vz6-FRPY03lT4EI8fJ5ILzPB9-E7BWABp62lOko=h310",
        "//lh3.googleusercontent.com/c__Bz_t8JnE3OJXkcPbWwfJK6siKAKn1m_jta2RXN4FLDie0cnPax1oucLcIdCgNXR8=h310",
        "//lh3.googleusercontent.com/CfpAfXW6FoCwOq3mBM58_ajNfYICWIfygILrA6FBJo5-l1y4Jod6jZjDelKPxYWlzg=h310",
        "//lh3.googleusercontent.com/Xl0ax1ST1PqlSLOOx69-rC66FNYkfT1QcbKjMYuUcXOLLSu_XXybebCxmlZfCFF2bog=h310",
        "//lh3.googleusercontent.com/cFWsnUcDeDA3jx9CIqFPoaAd2ceEWLXCnOt0HqUjJ7f6IjnFTeusjmTm4m7BJ5dH9A=h310",
        "//lh3.googleusercontent.com/oZOGKrHJD4IOFDy8NJaZykJZLD7Izfmyd6dPH14KmO4qDu4VPGvIMdNUq7VbUgBR6w=h310",
        "//lh3.googleusercontent.com/_90jkN2NrpzZnts9OeJOrXbqjGIjSLt6OW9aaC9HZA0tVH8nGqy4-4ffsGUxd8KDoyw=h310",
        "//lh3.googleusercontent.com/688pIUA8sT0W515MUv1lP-Wg9nXmwo2nyZmcPBucVgI6qBcBfPpIupEQOlt3XT_bFw=h310",
        "//lh3.googleusercontent.com/mGxjPlND4buW1cAJOPF4cA_YIQmxEjXMeTWqE4UyJUyHjPzh3OvYlSpF7z12RcnFCg=h310",
        "//lh3.googleusercontent.com/Bz0o5iSd4QXGYD9XcXDaco1oEiVQhyOBO3uhXrvv4Q3OzgP7LoASbe5sYvbPFhZyXg=h310",
        "//lh3.googleusercontent.com/zQELWo0AFg7VMnjhHl6Bv0plRG8_RnZRzogQKk7tgnc7fq4Kc3BkQHTu1jS_AsjGxQ=h310",
        "//lh3.googleusercontent.com/TTf0y0N_d5sGwxdWoGTxNSQux5SxO3Hgv_95MLDKn9Lt3ZpVVwdeKyB05duEIix389c=h310",
        "//lh3.googleusercontent.com/06n-HcfCOUot5VC1_VGot0tHv2_cAxP0tM6tgwdlRifgw-Xm-pK2fDXBzVQ27Fv66w=h310"
    ],
    "comments": [
        "I would have gave a 5-star review. I love my Discover card. But after 9 to 10 months a very careful, responsible spending and always paying before the due date. I've been turned down for a credit increase from$200. You know what 25% utilization rate is on $200???!! $25!! Why have a cc that I can only charge $25 to a month? Looking into other cc companies.",
        "Love my mobile App! Quick secure way to manage all of your accounts needs. With 24/7 credit monitoring and Risky Websites you never have to worry about Fraudulent activity. Customize your account for alerts and pretty much anything you would like them to help you with. Fast friendly service via live or an online agent there always ready to help! Excellent Card!",
        "Loving the new recent update. The UI appeals to me. Overall great app, easy to use and I haven't run into any problems with it so far. Keep up the good work Discover!  Edit: 3/2/18 It's been a month and I still believe this is a good app, no complaints yet.",
        "It has problem logging on every other time, no matter if Im on wifi or my data, it still just buffers. Its up to date.  An update on review, I uninstalled and logged back in to make a payment, seemed to work but after logging off I tried to log back in and the same buffering problem. Whats the deal Discover , you guys are major players why is your app not regular",
        "The messaging and secure inbox features don't work anymore. On February 2, 2018 I contacted support through the messaging feature and I got a reply quickly. However, when I tried to write back, my message could not be sent. I got an error saying that the conversation was already resolved. I deleted the app's data from my phone, which got rid of the unsent message. The problem isn't resolved though. At the top of the Messaging screen a message says \"Connecting...\" , then \"Still trying to connect...\", but nothing happens. I still can't write back. When I try to send a message, it says I have no internet connection, which is not the case. I tried to submit this error through Secure Inbox, but the Send buttongl would do nothing.",
        "My biggest problem with the app is that I can't ever open it. It will sit on the loading screen and spin for 20 minutes before I give up on it. I have a galaxy s6 and have problems at least every third time I try to use the app. I'm uninstalled and redownloaded, tried on different networks, wifi, mobile, with no luck. Very disappointed."
    ],
    "recentChanges": [
        "Updates for Discover Cardmembers:",
        "- Newly redesigned home screen makes it easy to quickly view and access key account info like balance, FICO® Credit Score, and more."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.discoverfinancial.mobile&hl=en&gl=us",
    "appId": "com.discoverfinancial.mobile"
}