{
    "title": "CityMatchday Wear",
    "summary": "The Official Manchester City FC (MCFC) Wear App",
    "icon": "//lh6.ggpht.com/1CqBWZRcvdPnmWeJABeCXdph0kA2sDOl20OC3HstH3ayzHxdkFb7rviDY51o9_Y6G1E=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.4,
    "reviews": 69,
    "developer": "Manchester City FC Ltd",
    "developerId": "Manchester+City+FC+Ltd",
    "developerEmail": "digitalsupport@mcfc.co.uk",
    "developerWebsite": "http://www.mcfc.co.uk/fans",
    "developerAddress": "Etihad Stadium, Manchester, UK, M11 3FF",
    "updated": "March 5, 2015",
    "version": "1.0.2",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "The CityMatchday Wear app brings the Manchester City matchday experience to your Wear device. With the app you can experience the action on the pitch and get updates during all City’s fixtures.CityMatchday Wear is the ultimate companion for all City fans who are unable to attend home or away fixtures. Enjoy the convenience of hands free notifications wherever you are on a matchday. Subscribe to CityMatchday Wear to enjoy the following alerts: - Team sheets, match details, match results, goals, and substitutions- Match statistics such as fouls, possession, yellow and red cards awarded- Bookings and Man of The Match details- Text commentaries from CityMatchday- The best Tweets from City fans around the world",
    "descriptionHTML": "The CityMatchday Wear app brings the Manchester City matchday experience to your Wear device. With the app you can experience the action on the pitch and get updates during all City&#x2019;s fixtures.<br><br>CityMatchday Wear is the ultimate companion for all City fans who are unable to attend home or away fixtures. Enjoy the convenience of hands free notifications wherever you are on a matchday. <br><br>Subscribe to CityMatchday Wear to enjoy the following alerts: <br>- Team sheets, match details, match results, goals, and substitutions<br>- Match statistics such as fouls, possession, yellow and red cards awarded<br>- Bookings and Man of The Match details<br>- Text commentaries from CityMatchday<br>- The best Tweets from City fans around the world",
    "histogram": {
        "1": 6,
        "2": 1,
        "3": 2,
        "4": 9,
        "5": 51
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/qLYhFjK0-MPRkKv8haXlvNw1pChvGWXM8jy0zRIR4IjjVHe-aHF9j-9gu-cUkMVVaPY=h310",
        "//lh4.ggpht.com/5-94MMRD3CH3HZ2EgdPp8_rq1jSplf4kScezr_Fy294CJCzZ26NTBFOHrWl6MgjAKrU=h310",
        "//lh3.ggpht.com/omAYpTTgLBYHqp8R9Uu381YHzjVN_mS1hrczzyDhpRTrOXvyqnia1RxlGhyIKQ8iCw=h310",
        "//lh6.ggpht.com/W22k-6ONEDDJfo37tv4dQEOZoUGvhvO-0c-4oK0bhVzBgU3xjvBpQgWQKkt763PfIdk=h310",
        "//lh4.ggpht.com/hFrAemdK9-T8j8b5v9KZhJpRKKGuy1XDpHFkbs-SQeREa7nLemMyuojiEWBQON3kQ2FH=h310",
        "//lh4.ggpht.com/kAc9TIISCyUJiOcCxP7ttZx1Nqnm-C31MZQq2mdmO5fuz0H18gVlinPcye77rtKu5U2j=h310",
        "//lh6.ggpht.com/MBsDuXbGDAsk1NcZ71phPHEM0jodGV1Kq9oNNzPfbZ_vENxea038e0Jtfkvg-n0iFhE=h310",
        "//lh5.ggpht.com/90c9GQ6_QDiStcrDwGOcYJkpLpVDuorAkkgRB_S27d41M-Xq9A50IKhhjWCa7SH_LA=h310"
    ],
    "comments": [
        "Stupid Never works",
        "City Wear App Doesnt seem to work? Installed it no problem, but dont get any notifications to the watch?",
        "Seen it before? Doesn't the current Matchday app deliver notifications to Wear devices? Mine has been. Would be keen to know if this differs in any way. Please.",
        "City Wear App What a great plus for City fans, first real test will be tomorrow v Leicester. As a disabled fan who can't get to the match this will be a bonus. Installed no problem.",
        "MCFC Can we get a version for our sister clubs NYCFC & Melbourne City?",
        "Great App Mcfc innovate one more time!"
    ],
    "recentChanges": [
        "Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.droiders.android.mcfcwear&hl=en&gl=us",
    "appId": "com.droiders.android.mcfcwear"
}