{
    "title": "Webank",
    "summary": "L’app più innovativa e user-friendly del 2015.",
    "icon": "//lh5.ggpht.com/lyEuc8ftOuP2Gjj8Ywoqovay9Lvffr5b4J1jP9KPppe0ahNqFfUYyuWkuDuE7USQ1Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.8,
    "reviews": 3954,
    "developer": "WEBANK",
    "developerId": "WEBANK",
    "developerEmail": "mobile@webank.it",
    "developerWebsite": "http://www.webank.it",
    "updated": "March 2, 2018",
    "version": "4.0.7",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "L’app di Webank è sempre più completa: oltre ad essere disponibile per gli smartwatch Android, è la prima applicazione bancaria italiana ad essere compatibile con gli smartwatch Samsung Tizen. Consultare la situazione del proprio conto non è mai stato così semplice!INNOVATIVA e SICURA al 100%•\tPrelevi con il bancomat grazie ad un semplice codice OTP e senza inserire la carta nell’ATM •\tAccedi velocemente alle operazioni più frequenti con un TAP•\tCondividi le coordinate del tuo conto o del tuo pagamento•\tCertifichi il tuo device: in questo modo l’app funzionerà solo dal tuo smartphone•\tGestisci la tua app dall’area privata del sito Webank decidendo quali device disattivareFACILE E VELOCE•\tRinnovi il tuo abbonamento ATM con un tap grazie alla ricarica veloce•\tVisualizzi la timeline dei movimenti effettuati con il bancomat e la carta di credito•\tAccedi a tutte le funzioni da un unico menu•\tRicerchi i movimenti del conto corrente e gestisci le linee vincolateOPERATIVA•\tGestisci al meglio la quotidianità•\tRicevi le notifiche push dei movimenti sul tuo conto per essere sempre aggiornato•\tOperi su tutti i mercati azionari e obbligazionari italiani e sui principali mercati internazionaliDIVERTENTE•\tVisualizzi il saldo con uno “shake”•\tPersonalizzi le tue spese assegnando ad ogni voce un immagine, una categoria oppure un commento•\tAssoci la foto dello scontrino al movimento per tenere traccia di tutte le spese",
    "descriptionHTML": "L&#x2019;app di Webank &#xE8; sempre pi&#xF9; completa: oltre ad essere disponibile per gli smartwatch Android, &#xE8; la prima applicazione bancaria italiana ad essere compatibile con gli smartwatch Samsung Tizen. Consultare la situazione del proprio conto non &#xE8; mai stato cos&#xEC; semplice!<br><br>INNOVATIVA e SICURA al 100%<br>&#x2022;\tPrelevi con il bancomat grazie ad un semplice codice OTP e senza inserire la carta nell&#x2019;ATM <br>&#x2022;\tAccedi velocemente alle operazioni pi&#xF9; frequenti con un TAP<br>&#x2022;\tCondividi le coordinate del tuo conto o del tuo pagamento<br>&#x2022;\tCertifichi il tuo device: in questo modo l&#x2019;app funzioner&#xE0; solo dal tuo smartphone<br>&#x2022;\tGestisci la tua app dall&#x2019;area privata del sito Webank decidendo quali device disattivare<br><br>FACILE E VELOCE<br>&#x2022;\tRinnovi il tuo abbonamento ATM con un tap grazie alla ricarica veloce<br>&#x2022;\tVisualizzi la timeline dei movimenti effettuati con il bancomat e la carta di credito<br>&#x2022;\tAccedi a tutte le funzioni da un unico menu<br>&#x2022;\tRicerchi i movimenti del conto corrente e gestisci le linee vincolate<br><br>OPERATIVA<br>&#x2022;\tGestisci al meglio la quotidianit&#xE0;<br>&#x2022;\tRicevi le notifiche push dei movimenti sul tuo conto per essere sempre aggiornato<br>&#x2022;\tOperi su tutti i mercati azionari e obbligazionari italiani e sui principali mercati internazionali<br><br>DIVERTENTE<br>&#x2022;\tVisualizzi il saldo con uno &#x201C;shake&#x201D;<br>&#x2022;\tPersonalizzi le tue spese assegnando ad ogni voce un immagine, una categoria oppure un commento<br>&#x2022;\tAssoci la foto dello scontrino al movimento per tenere traccia di tutte le spese",
    "histogram": {
        "1": 674,
        "2": 188,
        "3": 284,
        "4": 997,
        "5": 1811
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/seX1M1R_XOSDI9uOgu5QLPaNEJYWyqjFsFwnKTRxKkFfWJWA2c9ndpcKgaQEbMUIZQ=h310",
        "//lh5.ggpht.com/lOjHiuVtCDZqzP_XBR9YtrMddlnDfbjcfgg6abZPqYf1lJZEe0qxyxg2gOvJwItLAcOn=h310",
        "//lh3.googleusercontent.com/NHvY0kvjzkNm7Wsy0O18FMuct70CIV82hOiZMMlZCCmviu71TXA2P3ET_2w_ClGiwi-8=h310",
        "//lh3.googleusercontent.com/4QTuo1ms_ISAgLGfwqVkLbFozlP-p0l-bjUwsyoPID6Q-yzwlt9wUIJqYKz6EEj1Gg=h310",
        "//lh6.ggpht.com/_-OQrELR3AfnsVBlc7BPJPHb7Ttzc1BgYEErCDHkB7QsDeiMe1zIWo3L7UZrf3xipkE=h310",
        "//lh3.googleusercontent.com/wxWlhdMOigjGu6gh7u4dyqbRqAwEErj6e1OdSPSIAdIZnvOmPu_qAu881CEpmlaTGA=h310",
        "//lh3.googleusercontent.com/WOyleq0f4oTUqkNDwI8n1Lav7ULkWN7BukJnfOrR67CM_owo4IYqzvyz-Drbyz3CZM-B=h310",
        "//lh3.googleusercontent.com/awPTthDJlN3PCYxFAnIL3Vajajn8E4uilPH__AxDj6BDEU9i8YNphC4jDRPjWhzRE2Q=h310",
        "//lh3.googleusercontent.com/P6QHA521nYwCcqdtAFXedyEtTw8Vu8LdQE-TfPYQALt9kYeBmzeUuMBUmGGkyYKPFQ=h310"
    ],
    "comments": [
        "Funziona alla perfezione, continua a migliorare ad ogni aggiornamento",
        "Pixel 2: app attivata come token, ma ha funzionato soltanto la prima volta.  Ora ogni volta che avvio l'app si blocca all'avvio, mostra solo il logo Webank. Anche la notifica push non funziona. Risultato: non posso accedere al mio conto in nessun modo.",
        "Avevo alcuni problemi dovuti ad una parziale incompatibilità con i telefoni dual sim. Finalmente ho avuto dal Servizio Clienti tutte le indicazioni del caso. Ora è tutto ok.",
        "Bella e utile, la uso da diversi anni e ha sempre funzionato su tutti i cellulari in mio possesso. Ultimamente è da circa un mese che non riesco più ad inserire un ordine di compravendita titoli, mi dice sempre che, a causa di problemi di manutenzione, non è possibile inserire l'ordine.",
        "È molto stabile e user-friendly. Ha qualche bug sulle note personali come gli indirizzi, ma per il resto è veloce e molto intuitiva. Fin ora non ho avuto problemi con la generazione del token, ma se introducessero anche una modalità alternativa, come per esempio era prima con la tesserina, non sarebbe male. Magari uno potrebbe scegliere se con tesserina o con token per esempio. La fascia oraria del numero verde dovrebbe essere più larga.",
        "Da un anno ormai che l'appartamento con tutti i suoi aggiornamenti non include più il generatore dei token e nn posso accedere dal sito."
    ],
    "recentChanges": [
        "Bug fix"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.opentecheng.android.webank&hl=en&gl=us",
    "appId": "com.opentecheng.android.webank"
}