{
    "title": "CloudPlayer™ by doubleTwist cloud & offline player",
    "summary": "Revolutionary music player with Dropbox/OneDrive/Google Drive &amp; offline support.",
    "icon": "//lh3.googleusercontent.com/Phj3DWTh4UEoutykw3pnePaUklkAXycF9FJzThGAif0gdH3QDPekZKQKZQnLNFiMYQWa=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 6923,
    "developer": "doubleTwist ™",
    "developerId": "5131935316667995009",
    "developerEmail": "android-support@doubletwist.com",
    "developerWebsite": "https://www.doubletwist.com",
    "developerAddress": "doubleTwist\n512 W Martin Luther King Jr Blvd\nSuite 206\nAustin, TX 78701",
    "updated": "January 3, 2018",
    "version": "1.5.3",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "CloudPlayer is a revolutionary music player that puts you in control of your music, no matter where it's stored. Use it as an offline music player or link your Dropbox, OneDrive and Google Drive to create a giant cloud jukebox for all your music. Stream or download from your cloud accounts for offline playback. Enjoy built-in cloud playlist back-up & sync, Chromecast support, hi-fidelity FLAC & ALAC lossless sound, gapless playback, 10-band EQ, Android Wear & Android Auto support and more. The basic app is free and we offer a free 30 day trial for premium features. CloudPlayer features: User Interface:♬ Snappy material design UI♬ High resolution Artist and album images♬ Advanced sorting options for Albums, Artists, Composers, Genres and more♬ Default screen selection Premium Sound:♬ Advanced 10 band equalizer with 17 presets and Preamp (premium)♬ SuperSound™: Customize your sound with headphone enhancement, bass boost and widening effects (premium)♬ Support for Lossless file formats such as FLAC and ALAC, including 24-bit audio files♬ Support for Gapless playback for FLAC, ALAC and MP3/AAC tracks containing gapless metadata (premium)♬ Support for MP3, AAC, OGG, m4a, wav and more♬ Support for importing and streaming WMA files from the cloud Cloud Playlists: (requires optional sign in)♬ Free back-up of your playlists so you never lose your playlists if you change phones. (optional)♬ Free playlist sync across your Android devices. For example, playlist changes you make on your tablet will be automatically reflected on your phone and vice versa. (optional) Cloud music for Dropbox, OneDrive and Google Drive: (premium feature)♬ Download or stream music directly from your Dropbox, OneDrive and Google Drive without arbitrary restrictions♬ DOWNLOADED ONLY switch to filter out cloud songs or MP3s and only show locally stored music♬ Cellular Data switch disables the app from using cellular data so you can stream on WiFi without worrying about data caps Cast to wireless speakers and devices: (premium feature)♬ Chromecast support♬ AllPlay support♬ Cast music to supported devices & wireless speakers from your phone or your Dropbox, OneDrive and Google Drive Other: ♬ Android Wear support♬ Android Auto support♬ Scrobble to Last.fm♬ Beautiful small and large widgets The basic version of CloudPlayer is free and you can start a 30 day free trial that unlocks CloudPlayer's premium features:  SuperSound™, EQ, gapless playback, Chromecast and cloud support. If you like the premium features, please upgrade and help support future development from our Austin, Texas based team. Use of this app is subject to the doubleTwist Terms of Use and Privacy Policy available at: http://www.doubletwist.com/legal/",
    "descriptionHTML": "CloudPlayer is a revolutionary music player that puts you in control of your music, no matter where it&apos;s stored. Use it as an offline music player or link your Dropbox, OneDrive and Google Drive to create a giant cloud jukebox for all your music. Stream or download from your cloud accounts for offline playback. Enjoy built-in cloud playlist back-up &amp; sync, <b>Chromecast</b> support, hi-fidelity <b>FLAC &amp; ALAC lossless</b> sound, <b>gapless playback</b>, <b>10-band EQ</b>, Android Wear &amp; Android Auto support and more. The basic app is free and we offer a free 30 day trial for premium features.<br> <br>CloudPlayer features:<br> <br><b>User Interface:</b><br>&#x266C; Snappy material design UI<br>&#x266C; High resolution Artist and album images<br>&#x266C; Advanced sorting options for Albums, Artists, Composers, Genres and more<br>&#x266C; Default screen selection<br> <br><b>Premium Sound:</b><br>&#x266C; Advanced 10 band equalizer with 17 presets and Preamp (premium)<br>&#x266C; SuperSound&#x2122;: Customize your sound with headphone enhancement, bass boost and widening effects (premium)<br>&#x266C; Support for Lossless file formats such as FLAC and ALAC, including 24-bit audio files<br>&#x266C; Support for Gapless playback for FLAC, ALAC and MP3/AAC tracks containing gapless metadata (premium)<br>&#x266C; Support for MP3, AAC, OGG, m4a, wav and more<br>&#x266C; Support for importing and streaming WMA files from the cloud<br> <br><b>Cloud Playlists:</b> (requires optional sign in)<br>&#x266C; Free back-up of your playlists so you never lose your playlists if you change phones. (optional)<br>&#x266C; Free playlist sync across your Android devices. For example, playlist changes you make on your tablet will be automatically reflected on your phone and vice versa. (optional)<br> <br><b>Cloud music for Dropbox, OneDrive and Google Drive:</b> (premium feature)<br>&#x266C; Download or stream music directly from your Dropbox, OneDrive and Google Drive without arbitrary restrictions<br>&#x266C; DOWNLOADED ONLY switch to filter out cloud songs or MP3s and only show locally stored music<br>&#x266C; Cellular Data switch disables the app from using cellular data so you can stream on WiFi without worrying about data caps<br> <br><b>Cast to wireless speakers and devices:</b> (premium feature)<br>&#x266C; Chromecast support<br>&#x266C; AllPlay support<br>&#x266C; Cast music to supported devices &amp; wireless speakers from your phone or your Dropbox, OneDrive and Google Drive<br> <br>Other:<br> <br>&#x266C; Android Wear support<br>&#x266C; Android Auto support<br>&#x266C; Scrobble to Last.fm<br>&#x266C; Beautiful small and large widgets<br> <br>The basic version of CloudPlayer is free and you can start a 30 day free trial that unlocks CloudPlayer&apos;s premium features:  SuperSound&#x2122;, EQ, gapless playback, Chromecast and cloud support. If you like the premium features, please upgrade and help support future development from our Austin, Texas based team.<br> <br>Use of this app is subject to the doubleTwist Terms of Use and Privacy Policy available at: http://www.doubletwist.com/legal/",
    "histogram": {
        "1": 535,
        "2": 303,
        "3": 599,
        "4": 1385,
        "5": 4101
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/WPmINgKztWyv5K-PsXEIRmUKrpkhIvmdpYGV1YLVfyQO5Nc2l6RSrZ6klFE9FmcIon64=h310",
        "//lh3.googleusercontent.com/BbN1mlwgiALUVDTWR4NFsBgTONOQwYBlo7SAnP1QXW7tijerCJ-Gc1SAUpc_E4JWQrY=h310",
        "//lh3.googleusercontent.com/rI5Rc3aIRu8pHNA1GnAhbrgo6eabPltiZV3T0O8yK9U_mtaEaz6Dm9pvl_a1S_lPsA=h310",
        "//lh3.googleusercontent.com/8tXfEVrVX2J2zMMfIPdQe1KiqDoFdzE3XrQzSoPZNFPd90EcIsoZuUvGj1_CGQSwrYo=h310",
        "//lh3.googleusercontent.com/WzG9hp1-dmvT5J5opB73XZmmgjWKrgoW7i3uzFO9tBATcFlFEyNrnqRnd5i7SN3YJlQ=h310",
        "//lh3.googleusercontent.com/C9HqUM6hRCdsflHv0x_pmVtcOkyxR-6aTl1eBGshJqM8GQF9rMe6WtGxwQVrR8dUeQ=h310",
        "//lh3.googleusercontent.com/CAkxBsUjkqlVO0u-ldLZBZbyotp0a_4-hlJrwdhASmGRcfjsR_bBZO_AljC6Jn22JiM=h310",
        "//lh3.googleusercontent.com/RqKJ5Y_sVDuJew9B97Z_Y7UtEbBU67QLJGPl7xXsgp-jRbNzoLxYX6WT0v7P653bzkw=h310",
        "//lh3.googleusercontent.com/gKmQCyONquUJJOtsRaJ4_uZ73stCfC8mp9lL_j3e6yRcXqrL3DXpmqP44Z3VnFexSwk=h310",
        "//lh3.googleusercontent.com/juDkyFdJ0bGuTlsXd-r8UKaKulusASTjZ7bjDHC8dyNWv0Z55Gwvm7KU4qkQ_GDu7fw=h310",
        "//lh3.googleusercontent.com/KJkXT_fx8PzPc5v2pmJaG-epxubGwNcl4h4ptfkyzb4tGkVdM6sUBWONnwOQCyXAMg=h310",
        "//lh3.googleusercontent.com/wbrthdkhOxXZaCXm5NdkkHoZKHAWyFFPBcyDBeQKwp5DU_e5JclOG-vFv4Qt5Y21z_OQ=h310",
        "//lh3.googleusercontent.com/HidoYQiIiuqHK1iWa_5ku9R2fqHVWgDKK5zONnEMzKcds8Oh3FrAaVi9cGIyA58NAD8=h310",
        "//lh3.googleusercontent.com/0agS2V2_acdK7uvR5R0U9IjD5ygb9RK8kEJvynFzqqTEEnnQ8Ts7Az3BQi2rRHmKUQ=h310"
    ],
    "video": "https://www.youtube.com/embed/1LGeZox5uS0",
    "comments": [
        "I like it for Android Auto  better than Google Play Music. Only con is you can't delete stuff from the player without deleting it feom your phone. For instance my ringtones are in the player and I want to remove them but I can't because it deletes it from my phone. Basically a really good app.    Update: Still having problems with Android Auto. Of course no one wants to admit they're at fault. Time to find a new app.",
        "Great, easy app to leverage all those years of downloading mp3s!   Curious if anyone else has issues with delays between tracks? Maybe it's just buffering, but there's usually a sizable wait between each file.  EDIT: Didn't find that cache setting until developer mentioned it. This seems to have solved the issue. Great app! Thanks for the quick response!",
        "This app is the solution to a significant problem in my life. I store all of my digital music on OneDrive, and it's a lot. Much more than even a robust SD card could handle, especially if I want that SD card for other types of storage. After searching many, many apps, this one did what I needed it to do. It streams from my OneDrive perfectly, and when I need music on my device for faster access, I can do that as needed. As a professional musician and music educator, I need this app. It makes my life happy!",
        "Haven't purchased (yet) but so far so good! This not only plays all the music stored on my Google drive account, but it also found album art and band photos I didn't even have saved in the folders. Music quality is great too! Will probably be purchasing!",
        "Everything is there so i bought it. But now i see it is draining the battery. Probably because it scans my OneDrive automagically? Tips: 1) streaming over 3g is ok, but please do the house keeping over Wi-Fi only (during night?), and 2) please do something about the battery drain. I give you 5 stars if you do !",
        "Very well done player! Saved my playlists when in thought they were lost forever! I esp like that it shows how many songs & how many minutes/hours a playlist has. I need an amazing, super professional, advanced, dependable player for my job as a therapist. Will buy pro version soon. Thank you, doubleTwist!!"
    ],
    "recentChanges": [
        "New in v1.5.3:",
        "♬ Added Turkish translation. Thanks Tolga!",
        "♬ Improvements to import process.",
        "♬ Fixed an issue with artwork generation on certain Android 8 devices.",
        "Previously:",
        "♬ Fixed artwork extraction for large libraries (>15000 songs).",
        "♬ Added Loudness Normalization. It's off by default in Settings.",
        "♬ Added gapless playback 🎉  If your tracks have the correct gapless metadata, they will now be played gaplessly on your Android device."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.doubleTwist.cloudPlayer&hl=en&gl=us",
    "appId": "com.doubleTwist.cloudPlayer"
}