{
    "title": "AMP Your Workout",
    "summary": "AMP Your Workout",
    "icon": "//lh3.googleusercontent.com/RbH4tRwiOkpiAecVVIZ0o49zGp08DCdJ4-Z1AH5L2P6QPOJnd07VYicJHKotlv9cCBk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.6,
    "reviews": 60,
    "developer": "Titanec Pty Ltd",
    "developerId": "Titanec+Pty+Ltd",
    "developerEmail": "support@ampyourworkout.com",
    "developerWebsite": "http://www.ampyourworkout.com",
    "developerAddress": "Unit 4, 2 Portrush Rd\nPayneham,\nSouth Australia, Australia 5070",
    "updated": "February 12, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "AMP Your Workout introduces the world's most significant advancement in weight training for over 50 years via its AMMP system, a patented training guidance system that monitors ALL training data relevant for physique development and guides you to reach your peak and maximise muscle stimulus for each exercise.The more you train, the more the system is able to analyze your performance characteristics and predict your optimum workout target. You get fast results because you train the way your body is meant to trainMake the most of your time in the gym.AMP Your Workout is an easy to use app that, via complex technology, measures every aspect of your training and learns how your body works with each workout you perform. AMP Your Workout tracks ALL the parameters important for results, including your rest periods between sets and even HOW you perform each exercise. It then computes the benefit of each exercise and will predict and prepare your next training session according to the targeted improvement that you set. With each workout the system gains more knowledge of your optimum training and you will know you are training to your full potential to speed up progress towards your goals.AMP Your Workout, via your training data, identifies your strengths and weaknesses and can then better guide you for fast results. Training experts continually stress the importance of not training like your friends or favourite sports star, but instead training in a way to suit your genetics. However, up till now, there has never been a system to gather and analyse all the relevant data and importantly, to then guide you for continual improvement.AMP Your Workout uses smart phones and watches to gather data about your training.Whilst a compatible smart-watch (see website) is the best solution, AMP Your Workout offers other options - Use the accelerometer in your phone (requires a means of “wearing” the phone on your arm)train without an accelerometer provided you train in strict 1010 fashion (see the video for more details)Using wearable technology, you can train in any one of hundreds of tempo combinations – and AMP Your Workout will monitor every part of every rep and compute the benefit of each rep on the muscles you are targeting – combined with your “Lifting” style the system will compute the true “value” of the set.The heart of the AMP Your Workout system is our array of sophisticated algorithms and predictive analysis algorithms that use your existing database to “understand” your ability with each exercise, and precisely predict your capabilities in order to optimise the loads you place on your muscles to create the results you want.The system uses “Black-Box methodology” to understand and model a complex system - you!Our Black Box methodology, will compute the many variables that go to make up your muscle performance, overload, and recovery, will ensure that you can optimise all aspects of your training for fast results.Try it - you will be amazed at how it can predict your ultimate workout and push you to your goals more effectively and in ways you never dreamed of!Suitable for beginner trainers right through to elite and professional athletes.Thanks for helping us out!",
    "descriptionHTML": "AMP Your Workout introduces the world&apos;s most significant advancement in weight training for over 50 years via its AMMP system, a patented training guidance system that monitors ALL training data relevant for physique development and guides you to reach your peak and maximise muscle stimulus for each exercise.<br><br>The more you train, the more the system is able to analyze your performance characteristics and predict your optimum workout target. You get fast results because you train the way your body is meant to train<br><br>Make the most of your time in the gym.<br><br>AMP Your Workout is an easy to use app that, via complex technology, measures every aspect of your training and learns how your body works with each workout you perform. AMP Your Workout tracks ALL the parameters important for results, including your rest periods between sets and even HOW you perform each exercise. It then computes the benefit of each exercise and will predict and prepare your next training session according to the targeted improvement that you set. With each workout the system gains more knowledge of your optimum training and you will know you are training to your full potential to speed up progress towards your goals.<br><br>AMP Your Workout, via your training data, identifies your strengths and weaknesses and can then better guide you for fast results. Training experts continually stress the importance of not training like your friends or favourite sports star, but instead training in a way to suit your genetics. However, up till now, there has never been a system to gather and analyse all the relevant data and importantly, to then guide you for continual improvement.<br><br>AMP Your Workout uses smart phones and watches to gather data about your training.<br><br>Whilst a compatible smart-watch (see website) is the best solution, AMP Your Workout offers other options - <br>Use the accelerometer in your phone (requires a means of &#x201C;wearing&#x201D; the phone on your arm)<br>train without an accelerometer provided you train in strict 1010 fashion (see the video for more details)<br><br>Using wearable technology, you can train in any one of hundreds of tempo combinations &#x2013; and AMP Your Workout will monitor every part of every rep and compute the benefit of each rep on the muscles you are targeting &#x2013; combined with your &#x201C;Lifting&#x201D; style the system will compute the true &#x201C;value&#x201D; of the set.<br><br>The heart of the AMP Your Workout system is our array of sophisticated algorithms and predictive analysis algorithms that use your existing database to &#x201C;understand&#x201D; your ability with each exercise, and precisely predict your capabilities in order to optimise the loads you place on your muscles to create the results you want.<br><br>The system uses &#x201C;Black-Box methodology&#x201D; to understand and model a complex system - you!<br><br>Our Black Box methodology, will compute the many variables that go to make up your muscle performance, overload, and recovery, will ensure that you can optimise all aspects of your training for fast results.<br><br>Try it - you will be amazed at how it can predict your ultimate workout and push you to your goals more effectively and in ways you never dreamed of!<br><br>Suitable for beginner trainers right through to elite and professional athletes.<br><br>Thanks for helping us out!",
    "histogram": {
        "1": 6,
        "2": 9,
        "3": 12,
        "4": 10,
        "5": 23
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/LeSUHinvUepRKi6w_y44cmr6PQi5vcKEahl0JO-QI7yeYaBn6bqiIZ5nm3rlB_37Uq0=h310",
        "//lh6.ggpht.com/U6XRVhylqDs8kaknI5BydmRVr2F73jQsYV9yICmPiRiHyoVpUAfIHKrn5UgM20lac-4=h310",
        "//lh5.ggpht.com/uclEiBz1FEF6QSi6YMxXrXiq8za4J7Bl-GOkw65_U9UV3KfXPnUSwzumw9hJagfkjv8=h310",
        "//lh4.ggpht.com/MPRChlU2ln9YSsBK7b4XAX6QfjJ9k-Mpovrl23Z2McVNsJ24wTFYmVtbzOehD5_v7Xs=h310",
        "//lh4.ggpht.com/97v1i6c1eagMey800n7SD96cwnFU9ELy_AM87RRBdHkT_xEWWWx6aPhMZ2oQ53L_KA=h310",
        "//lh5.ggpht.com/DNbHcNG6h3wAQTu9mkh9fbMKo6ETTSgitkFqpeP5ElkgUPU17UryfrTQrmGTGqejlaE=h310",
        "//lh6.ggpht.com/z0OURtA_xhA3WmgWW5YAb-Vgv2dviAN-iIroMlQqWtlc1d1F4RxplpuwRS64lrja7eZa=h310",
        "//lh4.ggpht.com/jQhlGIoX0pOOF1cWr6LAik-J1CRbFGaOEI8LqqL2IleUzqLfCeLcioS_sq5GdsRbaig=h310",
        "//lh3.googleusercontent.com/DyJ_j_iPZoCLXg86bZiQwn4bkRdu-R0FU57Yq_QxxPW0qbzHGlgDIVqmDNA3NtcT-x8=h310",
        "//lh3.googleusercontent.com/4PwLqeiiKCMN8foW8suO_uRTr4Bor8NwFLtF5YWiL164bz2TBoZ9GUwekgRGI6uuQBY=h310",
        "//lh3.googleusercontent.com/aI_HeeEc0m6K2UJMw8hYpGEkAqwN_SrJtIbt7zfQ-arry7Bwy2ukjoOO-tXkJO21YPs=h310",
        "//lh3.googleusercontent.com/gjJk3q9uuq0aF8M4E7hga-PmyBeM9LnNFjD6OW8uFFgb7Hqsb8ZfJiASdzZ9PRRhIIk=h310"
    ],
    "video": "https://www.youtube.com/embed/qR5Yiy9_0dY",
    "comments": [
        "I've downloaded it with high expectations.  At 1st glance not impressed. Not very user friendly, several exercises missing (hammer curles, barbell shrugs, Arnold shoulder press, seated dumbbell calf raises, etc) and no way to add unsupported exercises. Anyway, I've created a workout program and will test it later today.  Update and feedback to follow.",
        "PLEASE fix this for S3 guys! I was SO excited when I found this app only to download it and find the workouts unreadable on my watch. Can't wait to try it when it actually does support the newer devices out. Im giving it 4 stars for now due to the quick response and because I think the more people that get it the faster theyll add device support. Don't wanna scare anyone away with low ratings. The idea fantastic",
        "I suggest adding a picture demonstration of every workout, Also you can implement a workout bundle which could make customer to pay to have a different workout like the total fitness app  Edit 5 star for their prompt reply!",
        "Love this app Paul! The fact it actually learns about you and does all of the hard work by itself is incredible! DO use a smart watch with this though to utilise its full potential. A few key additions to next update I would suggest (which might have not been mentioned yet): - Categorise exercises in muscle groups (to simplify navigation)/add in pre-made weekly split routines - Ignore rest periods of large length (eg. if distracted between sets) so it doesn't affect future predictions, ability to ignore first few weeks of inaccurate results when learning to use app so future predictions aren't affected - Add more touch-friendly navigation (eg. Swipe right from screen to open navigation panel, swipe right to remove sets etc) - Include milestones for accumulated points earned, have rankings based off current points/stats? (Beginner, amateur etc) - Provide more detail on microcycle type effects on future predictions, what each favours what area more  Am keen to see what is included in the next update :)",
        "Finally a visual representation of work on my muscles. I have seen significant gains since using this - Highly Recommend!",
        "Update app for gear s2 and s3 The app for gear is not very accurate in counting reps and it's outdated . update it for the gear s2 and s3 and this is easily a 5 star app."
    ],
    "recentChanges": [
        "Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.getammped.mobile&hl=en&gl=us",
    "appId": "com.getammped.mobile"
}