{
    "title": "Dreamdays Countdown Free",
    "summary": "Count down to the days that matter with style, reminders, and voice.",
    "icon": "//lh3.ggpht.com/a2wMSXNPXpaxp4GcjqPJx7jcvjD7lF3azpQgIl9q2J1kabr4aa-UitSdVKD5qhexk2g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.7,
    "reviews": 219804,
    "developer": "Guxiu Design",
    "developerId": "Guxiu+Design",
    "developerEmail": "hi@guxiu.ca",
    "developerWebsite": "http://guxiu.ca",
    "developerAddress": "1-122 No.1 Shanyuan Street, Haidian District, Beijing, China",
    "updated": "November 17, 2016",
    "version": "Varies with device",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "size": "Varies with device",
    "description": "Count down to the occasions that matter to you with style, reminders, and voices with more than 5 million users worldwide! In Dreamdays, you can sort through your countdown events through categories and degrees of importance. You will be able to customize each countdown event with your personal background, record voice memos that reflect your feelings, and share your delight with friends on Facebook, Twitter, and Instagram. Main Functions & Highlights: - Supports countdown to events and counting up once they arrive - Six default categories (Anniversary, Birthday, Holiday, Life, School, Trip) and the ability to add new ones - Voice memos to record your thoughts for each event - Set your favorite event as cover with ease and style - Push notifications to remind you of an arriving event - Customizable background for each event - Customizable order of events - PIN protection to keep your privacy- Widgets to keep track of your events directly from the home screen- Share your delight with friends on Facebook, Twitter, and Instagram- Working on Android Wear!- Calendar availableWe are looking forward to your feedback so that we can keep on building on a product that matters to you :)",
    "descriptionHTML": "Count down to the occasions that matter to you with style, reminders, and voices with more than 5 million users worldwide! In Dreamdays, you can sort through your countdown events through categories and degrees of importance. You will be able to customize each countdown event with your personal background, record voice memos that reflect your feelings, and share your delight with friends on Facebook, Twitter, and Instagram. <br><br>Main Functions &amp; Highlights: <br>- Supports countdown to events and counting up once they arrive <br>- Six default categories (Anniversary, Birthday, Holiday, Life, School, Trip) and the ability to add new ones <br>- Voice memos to record your thoughts for each event <br>- Set your favorite event as cover with ease and style <br>- Push notifications to remind you of an arriving event <br>- Customizable background for each event <br>- Customizable order of events <br>- PIN protection to keep your privacy<br>- Widgets to keep track of your events directly from the home screen<br>- Share your delight with friends on Facebook, Twitter, and Instagram<br>- Working on Android Wear!<br>- Calendar available<br><br>We are looking forward to your feedback so that we can keep on building on a product that matters to you :)",
    "histogram": {
        "1": 9651,
        "2": 2000,
        "3": 5107,
        "4": 11187,
        "5": 191859
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/LRc8O5-_VYsG3V1gAsQznfXYrYIWQ2JgYjOeIU94AwlRHGPIMWLrVOCnnrrIcDo8LA=h310",
        "//lh6.ggpht.com/-Yz2E7sj4uf0psCYjyBfc3WqvBkuI9htZf211DUzV8p0vwK2ftn0ib7WCWDfFA-LwQ=h310",
        "//lh3.ggpht.com/9JSccXuBcKIyFc_BLI4IX17iXChsru0NfyBGTzdDB5kls1LzCRamqkEUrIZa8NbmTeM=h310",
        "//lh5.ggpht.com/-FoIJvU47Bt7OxudHH7b1IeiVITaIH2i07Y0snLsQ5mNUyCWHQyFlRdF2p3d6Im5QvTK=h310",
        "//lh3.ggpht.com/qEKx__BbyPA4jOYeHDwYsMAOKOorqgc5VeYl_de_uRNs8CYSEWJQ0ccN5vUT0xARyQ=h310",
        "//lh4.ggpht.com/BHyUwOM6OfdBGvH-TJiTFy9xtgEqnuf9bmt5tmi3zUi-ZAKbXtlzFlB5w9Y0m_I3lTQ=h310",
        "//lh6.ggpht.com/5NUA7r05PBa1GC8QlPuXjHZk-8h7u9EjYBOPMknYbyWnPFmfq8IDSQmD-Gc_7LSXr18=h310",
        "//lh4.ggpht.com/N4gJxhzkUPFpuIW65pFEr8KaXDmOfzVdWB2vYj5IFRQ8xb4NJjSgsiOkd6UWvphGnVkX=h310",
        "//lh5.ggpht.com/7wB2LP0WvpkaEG_R_Kg7hXTu1Soz1x56ibg4TUf1Nc3bLtA5jCrHn-DiG87gZkWeuWOE=h310",
        "//lh6.ggpht.com/C9C7tt2DeFk4_60fo14yVZUjrRaLqIh01jbaA2qIWowe8EAYoyNeRWKvEl946YuZsQk=h310",
        "//lh4.ggpht.com/zw2d7iIVgN48XHYQmj74qiFw4lEmxQuq9e7AYuu9Uct5zhu3OZmqce_xjeDm2StzncM=h310",
        "//lh5.ggpht.com/cfpxwlDWbY49f3ps-b4OSg9IHBWBgJt-pky8K9Dg5E3UmIDi1qgfD9Ys2W3jUldrVoBk=h310",
        "//lh3.ggpht.com/Qa32Pi0uPJFG-RkmFPqkGF88r1uRA6nKhWs50Y1iZPlx9ZvSDo0GNHW0UaorMYM-GTs=h310",
        "//lh3.ggpht.com/6H-1xFKYBk2y89z6ponWlJyL1FfLQoNT-6E59KxJsGK0CDd9vaBjpn3IPeCLLECnwUs=h310",
        "//lh5.ggpht.com/ZaORNNda6x4Bm_ET5PiWDrASGrZAqz9jA4P690DUiPKvoKev-nVdQcbuoIFuhq48aG2c=h310",
        "//lh3.googleusercontent.com/xu7llCRhBuB8WwhOkWVgLOJ72A3LF48pfL1yX8h-uYPlC0x5ChLE6cmK2hkwk_UzHtI=h310",
        "//lh3.googleusercontent.com/iK5oOuG01K7reGxML8C1T9AsqLXjLdYhDXjTKWkFBsRPknh4HYtDkFI3j8QFsHp2Cvk=h310",
        "//lh3.googleusercontent.com/8WJjd7mGpDMHwk4TC2Bw5U6KF4sgUDXjR6NND_oSVGs-iv4wMu6yt9UYk175lTQp6UY=h310"
    ],
    "video": "https://www.youtube.com/embed/1HJgMqqRSYQ",
    "comments": [
        "Don't get me wrong, I love the app. I used it on my iPod a couple years back. But when I tried to download it again on my Nexus 6p, it won't open. No matter how many times I try reopen or send feedback, nothing has worked. Quite disappointed because i don't like any other countdown app as much as I like this one",
        "It wont open on the Galaxy S7. Worked fine on my iPhone SE, but absolutely refuses to open on my Galaxy & theres nothing I've been able to do to fix it. Based on reviews, its seems as though most newer phone models have this issue. I loved this app on older phones, especially the widget feature, so I really hope they fix it for new phones.",
        "Love this app!  ...BUT since I upgraded to a newer phone, it won't open. It says it stopped and sends a crash report. Worked on S5 and S6, but doesn't on S8. The app info says it hasn't been udated since Nov 2016, which is likely why this is happening for everyone with newer versions of phones. Please fix this! I really liked this app.",
        "I don't actually hate this app, the only reason I am giving it one star is because it will not open on my Pixel. I can't review the app until this is fixed. I would like to try it out if this issue gets resolved. My hope is to give it a better review in the near future. In the meantime, sadly I will have to download a different app.",
        "I actually love this app, and I think the design is perfect and simple. However, I can't open it anymore. It keeps crashing. This has been the case for weeks. I've tried uninstalling, reinstalling, updating my phone, restarting my phone, opening the app from the widget... nothing works. I can't seem to find support contact info, so sadly I have to uninstall.",
        "Too plain and boring. It does not run smoothly. The broken English makes this experience feel sloppy or apathetic. I love that it counts both up and down; I love that versatility, although I don't have need of it. Also, this app crashes too often. I have had it for five minutes and have managed to crash it about eight times."
    ],
    "recentChanges": [
        "- Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.guxiu.dreamdays_l&hl=en&gl=us",
    "appId": "com.guxiu.dreamdays_l"
}