{
    "title": "Trulia Real Estate & Rentals",
    "summary": "Real estate app to find homes for sale or rent in the right neighborhood for you",
    "icon": "//lh3.googleusercontent.com/3NbmSpzeGWDZswG-BOagaGVQVYl7_BcTfU16zFLzuGT6SJNzZuqnnGsO4up-HGdjLA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.5,
    "reviews": 167571,
    "developer": "Trulia",
    "developerId": "7989523405042027763",
    "developerEmail": "android@trulia.com",
    "developerWebsite": "http://www.trulia.com",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "House & Home",
    "genreId": "HOUSE_AND_HOME",
    "size": "Varies with device",
    "description": "Trulia helps you find your home and your neighborhood. Because when it comes to finding a place live, the house is only half of it. Trulia real estate listings include immersive photos and video tours that bring houses to life. Interactive maps provide crime reports, school ratings, and the scoop on local places—like restaurants and shops—to give you a feel for the neighborhood, wherever you are or wherever you’re looking. You can search for a home for sale or apartment for rent by location, feature, size, price, keyword, and much, much more. Save and share your favorite homes, or contact the listing agent directly. Plus get instant alerts when new homes hit the market that match your preferences. Whether you’re looking to buy or rent or you just like to keep on top of what’s new, interesting, and inspiring in the world of real estate, Trulia is the fastest, smartest, simplest way to get the real estate info you want. Key features: • Flexible Search: See nearby homes for sale, apartments for rent, and open houses. Or, search by price, neighborhood, number of bedrooms and bathrooms, and more. • Full-Screen Photos: Scroll through vivid, full-screen photos of homes. • Interactive Maps: See neighborhood maps with crime stats, school ratings, traffic info, average prices, and more. View maps in normal, satellite or terrain mode.• Local Info: Get to know nearby restaurants, bars, shops, playgrounds, and entertainment venues. • Instant Updates: Get notified when homes near you hit the market, when new properties are listed that meet your search criteria, or when the status of homes you are following changes—including a drop in price, when homes are sold, or open houses are scheduled.• Video Tours: Step inside select properties right from your phone.• Collections: Browse collections of homes and discover new properties in a beautiful, intuitive way.• Boards: Save and organize all of your favorite homes and share them easily.• Housing Type: Find whatever type of property you’re looking for, including single-family homes, apartments, condos, and townhouses.• Affordability Breakdown: Calculate the full cost of owning your dream home, including mortgage, homeowner’s insurance, and property taxes.•  Mortgage Calculator: Get personalized rates and calculate your potential mortgage.• Open Houses: Find open houses for sale near you, and easily add them to your calendar.• Directions: Take the stress out of your home search, get directions to open houses, homes for sale, or apartments for rent.• Anytime Access: Log in to see your saved searches and homes across all your devices. • Connect With Realtors: Quickly contact local realtors seamlessly to get more information on your favorite listings.• Browse Together: Connect with nearby devices to share your favorite homes instantly.• Voice Access: Ask Google to search for homes on Trulia using your voice.• Android Wear Optimized: Get home alerts, view property details and photos, or contact the realtor from your watch. • Trulia Widget: See new homes for sale, right on your home screen.We love feedback! Send us yours anytime at android@trulia.com.",
    "descriptionHTML": "Trulia helps you find your home and your neighborhood. Because when it comes to finding a place live, the house is only half of it. Trulia real estate listings include immersive photos and video tours that bring houses to life. Interactive maps provide crime reports, school ratings, and the scoop on local places&#x2014;like restaurants and shops&#x2014;to give you a feel for the neighborhood, wherever you are or wherever you&#x2019;re looking. <br><br>You can search for a home for sale or apartment for rent by location, feature, size, price, keyword, and much, much more. Save and share your favorite homes, or contact the listing agent directly. Plus get instant alerts when new homes hit the market that match your preferences. <br><br>Whether you&#x2019;re looking to buy or rent or you just like to keep on top of what&#x2019;s new, interesting, and inspiring in the world of real estate, Trulia is the fastest, smartest, simplest way to get the real estate info you want. <br><br><br>Key features: <br><br>&#x2022; Flexible Search: See nearby homes for sale, apartments for rent, and open houses. Or, search by price, neighborhood, number of bedrooms and bathrooms, and more. <br>&#x2022; Full-Screen Photos: Scroll through vivid, full-screen photos of homes. <br>&#x2022; Interactive Maps: See neighborhood maps with crime stats, school ratings, traffic info, average prices, and more. View maps in normal, satellite or terrain mode.<br>&#x2022; Local Info: Get to know nearby restaurants, bars, shops, playgrounds, and entertainment venues. <br>&#x2022; Instant Updates: Get notified when homes near you hit the market, when new properties are listed that meet your search criteria, or when the status of homes you are following changes&#x2014;including a drop in price, when homes are sold, or open houses are scheduled.<br>&#x2022; Video Tours: Step inside select properties right from your phone.<br>&#x2022; Collections: Browse collections of homes and discover new properties in a beautiful, intuitive way.<br>&#x2022; Boards: Save and organize all of your favorite homes and share them easily.<br>&#x2022; Housing Type: Find whatever type of property you&#x2019;re looking for, including single-family homes, apartments, condos, and townhouses.<br>&#x2022; Affordability Breakdown: Calculate the full cost of owning your dream home, including mortgage, homeowner&#x2019;s insurance, and property taxes.<br>&#x2022;  Mortgage Calculator: Get personalized rates and calculate your potential mortgage.<br>&#x2022; Open Houses: Find open houses for sale near you, and easily add them to your calendar.<br>&#x2022; Directions: Take the stress out of your home search, get directions to open houses, homes for sale, or apartments for rent.<br>&#x2022; Anytime Access: Log in to see your saved searches and homes across all your devices. <br>&#x2022; Connect With Realtors: Quickly contact local realtors seamlessly to get more information on your favorite listings.<br>&#x2022; Browse Together: Connect with nearby devices to share your favorite homes instantly.<br>&#x2022; Voice Access: Ask Google to search for homes on Trulia using your voice.<br>&#x2022; Android Wear Optimized: Get home alerts, view property details and photos, or contact the realtor from your watch. <br>&#x2022; Trulia Widget: See new homes for sale, right on your home screen.<br><br>We love feedback! Send us yours anytime at android@trulia.com.",
    "histogram": {
        "1": 5089,
        "2": 2634,
        "3": 8093,
        "4": 40144,
        "5": 111611
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/wb-fot8dxYlNrWyc7svoik6RbCMzvHAT4Pb3kJv13SY1kx7dH9mAW_Xsb84OZ4CxqoM=h310",
        "//lh3.googleusercontent.com/Itst0WzDjlsCldwfkzb5RPSNfoLH4HvpRjAK2_skpQasrK5vmGayrhGBjWacauWpHA8=h310",
        "//lh3.googleusercontent.com/2bUF72NQDJCeClkGnU-IMfIgSFMnA5nL_B5u47gCoxWR5lPdn9Zx5uJ0-bKlWNLS-g=h310",
        "//lh3.googleusercontent.com/XJmL1P-NkNNLNgvW_Tngo3OO-SgV5VfuUVvbENQ7b-e1OrHlgVAZCaKllPKGIZv2PQ=h310",
        "//lh3.googleusercontent.com/03VP6mbojXkcQAYnpeeXSCdH7npk3rq4MUsNbaWwVW2pGNfRdXBDa0ydacAub56TsOE=h310",
        "//lh3.googleusercontent.com/q0Dj1U-vkYNaIRe04ic12xwVVJ6VQOYRfPMHyWmevBJzAJebN6AecfthrKaZ4L4c4gMJ=h310",
        "//lh3.googleusercontent.com/_Qs3Dkz0mOAwUjVNJe4gGWqO1xjTCNuTLc1H1xemKF_WxJw5l1OKn3kE16uxep69_CMy=h310",
        "//lh3.googleusercontent.com/DMagmvIoa7om20C57NyWDyPQKVqAmhhtG9U6FOVR8lSoN9Tqmw0yn5utPgZdiBYp_4s=h310",
        "//lh3.googleusercontent.com/vbcV5VucITmK2O8jT4uc3_1mCqKmJko2PtWTYRLXCJinL-A4a-PeZRFU3T8RZiv8kZTf=h310",
        "//lh3.googleusercontent.com/3tJhnF3KyX0RKfJ1y3plRXS7PMrM6MSYON8N-Qlicr0nd9cLVI1LDUq_0WJaBGWJSw=h310",
        "//lh3.googleusercontent.com/K3HTNU3DX_VYHlzT9BMzt0WhYI8imOz2ibY2Q9bsfilfvew5UenEnotzNQJULXh7YfI=h310",
        "//lh3.googleusercontent.com/Vrl8o09BJnLXBGcjFmz0kNa5t4Q0EgVRXo9OxmQcDJCGHfJmdCepbAQ6xNgijuYngQ8=h310",
        "//lh3.googleusercontent.com/dyurFPmcQLhixt1aze8O-VnnUJRjlvhTokL-sWfruENIf7g39Nv60W-9ML8FUOFul_cW=h310",
        "//lh3.googleusercontent.com/Mtg_dNnCUW_vOFCmf-3I8I9N1Nx9ojsUaw6y1teQCCpK1zHLW9vAaMdQxPEMakZkoDw=h310"
    ],
    "video": "https://www.youtube.com/embed/sFpDNulBBlA",
    "comments": [
        "Terrible request information button, can't undo. You can easily hit that button by accident. I will change my opinion when they fix this problem",
        "I enjoy all the different maps. However, the app glitches a lot. Shows me places I've looked at over and over again and flags them as new. My \"Suggested for You\" section is always filled with places way over the budget I have set, I havent been able to edit my list of saves in weeks (everytime I do i get a \"Failed to save properly, try again later\" message), and I wish the app gave some sort of confirmation when I contacted places. Overall, it gets the job done, but there are some basic areas where I really falls short. I've started using another app more often.",
        "The app is user friendly and I don't have any issues with it being buggy or crashing. But I don't think it truly lists all rentals available. I set my filters looking for what I need and want in a rental, but can't ever find anything that's in the area I'm looking for or that fits my budget. I saved the search so I can hopefully get first access to the home when it becomes available. I keep getting notifications that houses are just taken off the market. That's funny, because I NEVER saw that house listed to begin with, and I check the app two to three times daily. I like this app better than Zillow, so I'll keep using it. It's probably something I'm doing wrong, but it's still frustrating, especially since I've been looking for a new place to live since late summer.",
        "Easy to navigate and has everything you look for without having to talk with an agent right away. Always has the right places when you apply your filters.",
        "This app is easy and simple to use. This app helped me a lot.",
        "Details are complete From crime,transportation, schools ,malls,groceries etc."
    ],
    "recentChanges": [
        "• New feature! \"What Locals Say\", neighborhood insights straight from locals like \"easy parking\" and \"dog-friendly\" on every property page to help you feel what it's really like to live in a home and neighborhood.",
        "• We've heard you! You now have more control over your location boundaries when you search for new homes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.trulia.android&hl=en&gl=us",
    "appId": "com.trulia.android"
}