{
    "title": "CrickBits",
    "summary": "Your little wrist can WEAR the current cricket updates, anywhere !",
    "icon": "//lh3.googleusercontent.com/2lxxgqKnGcrzvijB7QbkcB9hItVUhEoFeV1i6I0SGpEZLM_Nr3lV391Pw8Ab5wjmtt0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4.2,
    "reviews": 8,
    "developer": "ITINDIA",
    "developerId": "ITINDIA",
    "developerEmail": "pratik@itindia.co.in",
    "developerWebsite": "http://www.itindia.co.in/",
    "developerAddress": "Gujarat India",
    "updated": "April 22, 2015",
    "version": "1.0",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "How Crickbits Will Double Your Excitement For Cricket?With the arrival of 2015, the cricket pitch is all set for ODI, T20 cricket series and other Indian leagues. Great year for cricket lovers. And Crickbits app will double the excitement for you. The app offer amazing features from live score, full scorecard to latest match update. What's unique in this app? This app works smoothly in wearable gadgets, particularly the Android watch.  Isn't it cool?Upcoming matches for tomorrow ? , Next week ? or Next month? Crickbits will provide you with all details of the match series across the globe. Outstanding App Features       Compatible with wearable devices like Android watch.        Watch live scores for ODI, T20, test matches and other local series with this sports app.      Live cricket score with ball by ball commentary and fall of wickets.       View the score-card of recently played matches with this cricket score app.      Get instant and scrutinized news of any particular team across the globe.       News related to upcoming matches with date, time and place.      Recent, past and upcoming match details with full reviews and cricket schedules.       Series stats and overall record of International cricket teams and other Indian leagues.        Information relevant to past, ongoing and upcoming cricket series like ODI, Test Series and Under-19 ODI series.      Player's batting and bowling history in ODI, Test and T20. View informations like matches played, runs scores and even the player's ranking position.       Get update of current series and check live cricket scores.      Get all the buzz from the upcoming T20 cricket series starting from 24th April 2015.        Make an account easily and challenge your friend about the winning and loosing of a particular team. Defeat your friend and earn tokens!    Download this free cricket app and get all the cricket buzz!",
    "descriptionHTML": "How Crickbits Will Double Your Excitement For Cricket?<br><br><br>With the arrival of 2015, the cricket pitch is all set for ODI, T20 cricket series and other Indian leagues. <br><br>Great year for cricket lovers. And Crickbits app will double the excitement for you. The app offer amazing features from live score, full scorecard to latest match update. <br><br>What&apos;s unique in this app? This app works smoothly in wearable gadgets, particularly the Android watch.  Isn&apos;t it cool?<br><br>Upcoming matches for tomorrow ? , Next week ? or Next month? Crickbits will provide you with all details of the match series across the globe. <br><br>Outstanding App Features <br><br>     &#xF0B7; Compatible with wearable devices like Android watch. <br><br>     &#xF0B7;  Watch live scores for ODI, T20, test matches and other local series with this sports app.<br><br>     &#xF0B7; Live cricket score with ball by ball commentary and fall of wickets. <br><br>     &#xF0B7; View the score-card of recently played matches with this cricket score app.<br><br>     &#xF0B7; Get instant and scrutinized news of any particular team across the globe. <br><br>     &#xF0B7; News related to upcoming matches with date, time and place.<br><br>     &#xF0B7; Recent, past and upcoming match details with full reviews and cricket schedules.<br><br>     &#xF0B7;  Series stats and overall record of International cricket teams and other Indian leagues.  <br><br>     &#xF0B7; Information relevant to past, ongoing and upcoming cricket series like ODI, Test Series and Under-19 ODI series.<br><br>     &#xF0B7; Player&apos;s batting and bowling history in ODI, Test and T20. View informations like matches played, runs scores and even the player&apos;s ranking position. <br><br>     &#xF0B7; Get update of current series and check live cricket scores.<br><br>     &#xF0B7; Get all the buzz from the upcoming T20 cricket series starting from 24th April 2015.  <br><br>     &#xF0B7; Make an account easily and challenge your friend about the winning and loosing of a particular team. Defeat your friend and earn tokens!<br><br>    Download this free cricket app and get all the cricket buzz!",
    "histogram": {
        "1": 1,
        "2": 0,
        "3": 1,
        "4": 0,
        "5": 6
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/xWS2bmQTgZoGe1q5ZWD553uDLjtrmPfT2TrqJgl0okEmW1R3y8S7mRuij4kffUiRWQ=h310",
        "//lh3.googleusercontent.com/WkKbdNvhvBrqay4uaWpObwTMe40Cpk1bGhJRGrxtKZ4bCXgvo70gagz2tB1yJ8RTxTq9=h310",
        "//lh3.googleusercontent.com/rtYqkxrZ2JMemE1mVwB2WoqWYwNij_sS2a7XxhzcgVMMsjH5G3zX_SnKGfdkHlyNogjV=h310",
        "//lh3.googleusercontent.com/Pqd9kOBo0CPWmgWmeHZPe2bKE2z7CkZE_eeufUqwD2EU9GlWTeRxXfql6E-YxnZF35s=h310",
        "//lh3.googleusercontent.com/H19Dz9rnut43nc0OWDI3HyLkDaDebp3IadmD6_kRO_Gm0SjjPe-KYdn7Unz1y43z__I=h310",
        "//lh3.googleusercontent.com/KhrD1Je_lIHybYTrQ1OrE7thWFhh2WPh4N6uVXY3CZvv5TnOgozxQbUxcukcFCPY6O4=h310",
        "//lh3.googleusercontent.com/jDJbtvkC5iRoqFIMvzNd5ZOuILYqPclEpNo8wc7Ej7cQVRJ8zZfTl6peE3HnpnrUoDQ=h310",
        "//lh3.googleusercontent.com/MKkYoSgCss4ZoMRx1VdhTWn6_HqBdR9E5xn4QiSyETUe9u2dMJA4GE_MYIh2qTM2ufw8=h310",
        "//lh3.googleusercontent.com/VMZ5XtAV0cydlyYefvPWkaTaDjgWIBWWTop5QAhoS8EcXNLnVkvb8RBO2D2rxYNjJnMi=h310",
        "//lh3.googleusercontent.com/mm5MyLn3I31Te65NVjTrBQ4S81hZlZbh8wG3iuDWC01end2IcgtfQow4fToLq2uDmCFy=h310",
        "//lh3.googleusercontent.com/-8NxvIwF2t7wUirNYe9e7Tu7St6w2F9N-6mnRMlgyUKTU7_qMCAViIcXyQMhcQo00fM=h310"
    ],
    "comments": [
        "Excellent Application",
        "Awesome app",
        "Thanks tho Nikil"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.yudiz.crickbits&hl=en&gl=us",
    "appId": "com.yudiz.crickbits"
}