{
    "title": "Authenticator Plus",
    "summary": "🏆 Top Developer Badge awarded two factor authentication app",
    "icon": "//lh3.googleusercontent.com/79O9qaJp-Djudmdj7QBWTVRfXDjiJE0c-Ts03ewEciR_qe3Qrn-yEvF4fkLgrF7Jko8=w300",
    "price": "$2.99",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.7,
    "reviews": 1878,
    "developer": "Mufri",
    "developerId": "6275236625060571598",
    "developerEmail": "support@authenticatorplus.com",
    "developerWebsite": "https://www.authenticatorplus.com",
    "developerAddress": "G005, RT Nagar, Bangalore",
    "updated": "February 8, 2018",
    "version": "Varies with device",
    "genre": "Tools",
    "genreId": "TOOLS",
    "size": "Varies with device",
    "description": "🏆  Thanks to all, We are awarded with Top Developer Badge  👏Authenticator Plus generates 2-step verification codes to protect your accounts with your password and phone / tablet.With Authenticator Plus you can seamlessly sync and manage all your 2-step enabled accounts in phones / tablet / kindle.• Sync Across Devices - seamlessly access and open accounts from you phone, tablet or Amazon Kindle• Android Wear Support - view all your PINs in Android watch• Automatic backup / restore - accounts are automatically backed up to cloud (Google Drive or Dropbox) and can be restored easily• Secure - 256-bit AES encryption and PIN lock for additional security• Fingerprint support - Unlock the app through fingerprint, only supported in Android Marshmallow with compatible hardware, as of now Nexus 5X and Nexus 6P• Advanced security - hardware backed encryption protects your account even  in rooted devices• Organize - group accounts with categories and re-order frequently used accounts to top• Personalize - change themes and displays account logos for easier lookup• Import from Google Authenticator - accounts can be imported from Google Authenticator in rooted devices• WinAuth support - works with WinAuth (https://winauth.com/)Technical Details - http://design.authenticatorplus.comHelp Docs - http://help.authenticatorplus.comBeta Channel - http://beta.authenticatorplus.com",
    "descriptionHTML": "&#x1F3C6;  Thanks to all, We are awarded with Top Developer Badge  &#x1F44F;<br><br><br>Authenticator Plus generates 2-step verification codes to protect your accounts with your password and phone / tablet.<br><br>With Authenticator Plus you can seamlessly sync and manage all your 2-step enabled accounts in phones / tablet / kindle.<br><br>&#x2022; <b>Sync Across Devices</b> - seamlessly access and open accounts from you phone, tablet or Amazon Kindle<br><br>&#x2022; <b>Android Wear Support</b> - view all your PINs in Android watch<br><br>&#x2022; <b>Automatic backup / restore</b> - accounts are automatically backed up to cloud (Google Drive or Dropbox) and can be restored easily<br><br>&#x2022; <b>Secure</b> - 256-bit AES encryption and PIN lock for additional security<br><br>&#x2022; <b>Fingerprint support</b> - Unlock the app through fingerprint, only supported in Android Marshmallow with compatible hardware, as of now Nexus 5X and Nexus 6P<br><br>&#x2022; <b>Advanced security</b> - hardware backed encryption protects your account even  in rooted devices<br><br>&#x2022; <b>Organize</b> - group accounts with categories and re-order frequently used accounts to top<br><br>&#x2022; <b>Personalize</b> - change themes and displays account logos for easier lookup<br><br>&#x2022; <b>Import from Google Authenticator</b> - accounts can be imported from Google Authenticator in rooted devices<br><br>&#x2022; <b>WinAuth support</b> - works with WinAuth (https://winauth.com/)<br><br><b>Technical Details</b> - http://design.authenticatorplus.com<br><br><b>Help Docs</b> - http://help.authenticatorplus.com<br><br><b>Beta Channel</b> - http://beta.authenticatorplus.com",
    "histogram": {
        "1": 40,
        "2": 24,
        "3": 36,
        "4": 178,
        "5": 1600
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/Q42m9MhJYX6xVirKfTmc6eZvPLsO5FhCTGeOhBvxeJRUclOjanORo_rIcOw07BF6Wak=h310",
        "//lh4.ggpht.com/O7w-lM8M4mlBSWeaKlJfVUEZos60fr8MZxJODrMXa9_XUMw5vaTf25BgOfvmOQ5Rbg=h310",
        "//lh3.ggpht.com/yGXGWGDzdWx900Jwt55FcvMjPtlcuXMUU4bqthRn9wuOClpklPLhixqUl-QTk-ZKeOw=h310",
        "//lh5.ggpht.com/kEIs0j18HKl16keg5jLRaYNjT2YE3SeqrkVdBhP5IfL5TIiqfjxaDB9gm4103KLKdQ=h310",
        "//lh5.ggpht.com/WBvhRAHayitQZ5vGp4cdz4y_9th4DdT1DI0-nFU9AKHY6DUT8Ag51Ge6GoaROtnsGsY=h310",
        "//lh6.ggpht.com/tQlp_TDmRWS1JuBx_Q_ECVdD8zIvF9PwAiB5AYkh16aiUeR0XUESe0h6wS4oBjAKOa4=h310",
        "//lh3.googleusercontent.com/TjxdHdpmGapzDXY3ZmBMS4vGCKVnT2nSyAm26pu7-Lr3-hK5GWLL0_UZlJKScnsUag=h310"
    ],
    "video": "https://www.youtube.com/embed/V6QJFGERlmQ",
    "comments": [
        "Easily the best Authenticator I have used so far. The support for easy export/import with winauth is great and it's one of the stand out features. In addition general support for different backup methods/security is great.   As others have said this is what Google Authenticator should have been!",
        "amazing app thanks for deving this :) makes my life a 100x easier since I've have to setup 2fa on numerous sites/scripts and makes it so much easier to deal with 30sh authenticators for things that are constant and others for sites I'm deving and setting up or managing and sync is great as well since it is synced across my numerous phones depending on what I'm using that day or hour lol thumbs up and 10 stars :) keep up the work although it would be interesting/ gain more users/ customers if you'd open source a non syncable version and have sync for purchase ( not the hardest to implement I'm sure but might entice users to just buy it since most will just do their own if their going to pull / fork yours and add sync lol and maybe go the route of pydio ( ajax explorer if your familiar of it from a min ago)",
        "I'd give more stars if I could. Having all of my 2FA in one place (aside from work O365 accounts) is a dream.",
        "Thank you for this great app.",
        "Works works great.",
        "Good 2FA app, but missing something I would really like - fingerprint security.  This app is great because you can backup all your 2FA info in an encrypted file on the cloud, so if you lose or have to reset your phone, you don't lose.  But I am surprised that this app will not use the fingerprint security that my phone uses - Samsung Galaxy S7.  My phone is one of the most common phones, they should fix this.  When they do, I will give them a better rating."
    ],
    "recentChanges": [
        "- NEW : app can be locked using phone screen lock, no longer need separate pin / fingerprint lock.",
        "- NEW : OpenYOLO integration, you can now save / auto-fill your master password using supported password managers, as of now Google SmartLock and 1password, Settings -> Security -> Advanced",
        "- Standalone wear app, now wear app can installed through play store",
        "- Adaptive icon",
        "- New animation when code changes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mufri.authenticatorplus&hl=en&gl=us",
    "appId": "com.mufri.authenticatorplus"
}