{
    "title": "Phillips Hue for Android Wear",
    "summary": "Control your lights in your home using your Android wear and mobile device!",
    "icon": "//lh3.googleusercontent.com/R7zyu9sVDFFskTB3US4LyQzDUkjpFsDFJjvt-0RSA4wRbAjRoG2Arljw50hRa4M-YCQ=w300",
    "price": "$1.99",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 2.7,
    "reviews": 31,
    "developer": "Nice Watch",
    "developerId": "Nice+Watch",
    "developerEmail": "diplodesigns@gmail.com",
    "developerWebsite": "http://www.diplodesigns.com",
    "developerAddress": "Toronto\nThe Best City In The World",
    "updated": "June 16, 2016",
    "version": "1.1",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "The best Philips Hue lighting option available that allows controlling your bridge from both your Android wear and mobile device. Sleek design and easy functionality will allow you to quickly and easily perform different functions which will give you the most out of your Philips Hue set.WEAR- Quick and easy bridge connecting, simply open the wear app and you will automatically connect to your bridge. No need to have your mobile app on during the process like other apps- Toggle groups on/off with a simple tap on their names- Hold on a group name to access its settings where you can control its brightness and toggle individual lights contained in the group - Instructions: For first time use, make sure you connect to the bridge through the mobile version first and authenticate. Then you will be able to connect through the watch without needing your mobile device ever againMOBILE - Quickly create new groups with whichever lights you want in them and delete the old. Groups are easily editable, allowing you to change their names and the lights contained in the them.- Groups are toggled on/off by simply clicking on them and their settings are accessed on holding down on then.- Easily distinguish between light bulb types so you know which lights support color and which do not.- Dim a group to any brightness you want, and toggle individual lights contained in any group.- Multiple device support, have everyone in your house view the same rooms and perform the same actions- Swipe down to refresh feature that will show you the updated states of your groups- See if groups are reachable, on, or offFor feedback and improvements, leave a comment below and we will get back to you immediately and make any improvements necessary.",
    "descriptionHTML": "The best Philips Hue lighting option available that allows controlling your bridge from both your Android wear and mobile device. Sleek design and easy functionality will allow you to quickly and easily perform different functions which will give you the most out of your Philips Hue set.<br><br>WEAR<br><br>- Quick and easy bridge connecting, simply open the wear app and you will automatically connect to your bridge. No need to have your mobile app on during the process like other apps<br><br>- Toggle groups on/off with a simple tap on their names<br><br>- Hold on a group name to access its settings where you can control its brightness and toggle individual lights contained in the group <br><br>- Instructions: For first time use, make sure you connect to the bridge through the mobile version first and authenticate. Then you will be able to connect through the watch without needing your mobile device ever again<br><br>MOBILE <br><br>- Quickly create new groups with whichever lights you want in them and delete the old. Groups are easily editable, allowing you to change their names and the lights contained in the them.<br><br>- Groups are toggled on/off by simply clicking on them and their settings are accessed on holding down on then.<br><br>- Easily distinguish between light bulb types so you know which lights support color and which do not.<br><br>- Dim a group to any brightness you want, and toggle individual lights contained in any group.<br><br>- Multiple device support, have everyone in your house view the same rooms and perform the same actions<br><br>- Swipe down to refresh feature that will show you the updated states of your groups<br><br>- See if groups are reachable, on, or off<br><br><br><br>For feedback and improvements, leave a comment below and we will get back to you immediately and make any improvements necessary.",
    "histogram": {
        "1": 13,
        "2": 2,
        "3": 4,
        "4": 4,
        "5": 8
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/OU-XzUMBHRzOD9WmhHQbgZbYL153fg9Sb-omJULTnIa1QJD-8lAdTRdCzHLnTFkIZI5W=h310",
        "//lh3.googleusercontent.com/7z7KTlyhcNAVKUKXhHFVhDK-dR1S3g16U9czN8086PEZItye-uMMarE7AgyOQfI5gQ=h310",
        "//lh3.googleusercontent.com/l3FwFJDpBA-rtMOr0d74IEjtlpiu9rQOubwXYjK34VWkXo5bNdgVsn6q8oxGV1fQdrg=h310",
        "//lh3.googleusercontent.com/nx_A8c9TeygAo7CxYubSfNlafdlxLNQTAbEbD2lT4D5u4hhUZTqbiWJ-qKvcgyr3RrH7=h310",
        "//lh3.googleusercontent.com/Q0isyxw2i_-4FNQ_LQNSDZeOcdSDsJhjofF6FIeJ5SZWWGCrIyI9EAocuf2zhNJQKTw=h310",
        "//lh3.googleusercontent.com/9NtoNXLpFLQw_qcLWKYdl76dTATAjmUBZVTLJWpXeXrTITcw7uxHrN8VqWcIGCqm2hDw=h310",
        "//lh3.googleusercontent.com/wMFTd4dzy2DjZMCclvwYMUEuE3D9_X3NT2cclrDMr9fA3tm9KoSny4r2IytDmdCgrQ=h310"
    ],
    "comments": [
        "It works but only for turning lights on and off from their previous color. I haven't figured out how to change the color of the lights using this app or my watch. Also I don't like how it will always stay on the watch and never close out automatically and go back to the watch face. I have to manually clear it or it will stay on forever draining the battery with the bright white setting screen. Anytime I try to open the 'rooms settings activity' from the watch it crashes",
        "Gets the job done, somewhat.. The UI is horrendous. It shows lights and rooms mixed up together which in itself makes it hard to manage. On a Sony SmartWatch 3 the names of lights and rooms are also cut off. \"Living room Left\" turns into \"Living room\" with \"room\" cut horizontally. Impossible to identify lights and rooms without trial. When activating a light it activates with full brightness instead of using previous values like every other app. Still, all in all it gets the job done until Philips hopefully makes their own app.",
        "App works, but display barely shows 1 group if lights.  In response to reply: Thank you for the quick reply, and I appreciate that. Also, at least on my watch, the app often hangs (circle keeps spinning) until I close out of the app and relaunch.",
        "Super Useful The app may have a few rough edges but it works and works well, it's a godsend when you just want to switch a light group on or off which is normally all you want to do.",
        "Will work with Moto 360 1st gen / Nexus 6 with bridge 2.0 Update of 6-24-16 with my new hue bridge 2.0 the app works perfectly now. Perviously some reason it did not work on the hue bridge 1.0 with my Nexus 6 and moto 360 1st gen but it's working now with them on the new hue bridge 2.0",
        "Doesn't work on Huawei Watch /6p Was working before the most recent update. Did give some trouble initially but a reinstall fixed it. With the most recent update it works on my phone, but crashes on my watch. I see the circle loading but then right after it crashes.I tried to uninstalling and reinstalling, to no avail. Update fixed it"
    ],
    "recentChanges": [
        "- Fixes, lots and lots of fixes.",
        "Enjoy :)",
        "Let us know if you need any updated. We got you ;)",
        "Cheers!",
        "p.s. I uploaded this while listening to Louise Goffin - Uptown Boys ... so.... that's that."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.diplodesigns.huewatch&hl=en&gl=us",
    "appId": "com.diplodesigns.huewatch"
}