{
    "title": "Hydro Coach - drink water",
    "summary": "Stay hydrated with Hydro Coach. A drink reminder and water intake tracker.",
    "icon": "//lh4.ggpht.com/80VPa2h2NIhij3wZ2gT4Ru-hrfgPnzDxuLC9P_yq3l4DusgpDtOuluC22TpfjlGfAA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 93750,
    "developer": "Codium App Ideas",
    "developerId": "8190631062502857716",
    "developerEmail": "office@codium.at",
    "developerWebsite": "http://hydrocoach.com/",
    "developerAddress": "Pater Schwartz Gasse 11a\n1150 Wien\nAustria",
    "updated": "October 28, 2016",
    "version": "3.2.4",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Drinking water regularly is a big challenge in day-to-day life. Hands up – who really drinks enough water every day? Hydro Coach will help you by calculating how much water you need, tracking what you drink, and gently reminding you when to drink. It's time to unleash the power of water to improve your health. Because your health is worth it! Benefits of drinking water for your health:* It’s an effective method of combating stress and tiredness* Drinking enough water can clear up your skin* Drinking enough water can improve your health in a few days* It’s beneficial to weight loss and the basis of every professional diet* Drinking more water can relieve headaches Key features:* Improve your health with personal drink notifications* Keep perfect track of your water balance through a simply designed diary* Get a graphical insight into your water drinking habits with week and month statistics* Practical widgets provide clear information about your water intake* Create custom drink volumes easily* Supports imperial (fl. oz.) and Metric (ml) units* Share your water intake with your friends* Direct water input through your android wear* Synchronization with your google account How it works:Our formula calculates your ideal personal water requirement based on multiple factors like age, weight, gender and lifestyle. Select your favorite glass you normally use, and Hydro Coach will remind you to drink and refill it. Join a fantastic communityBlog: http://blog.hydrocoach.comFacebook: http://facebook.com/hydrocoachGoogle+: http://google.com/+HydrocoachAppInstagram: http://instagram.com/hydro_coach",
    "descriptionHTML": "Drinking water regularly is a big challenge in day-to-day life. Hands up &#x2013; who really drinks enough water every day? Hydro Coach will help you by calculating how much water you need, tracking what you drink, and gently reminding you when to drink. It&apos;s time to unleash the power of water to improve your health. Because your health is worth it!<br> <br><b>Benefits of drinking water for your health:</b><br>* It&#x2019;s an effective method of combating stress and tiredness<br>* Drinking enough water can clear up your skin<br>* Drinking enough water can improve your health in a few days<br>* It&#x2019;s beneficial to weight loss and the basis of every professional diet<br>* Drinking more water can relieve headaches<br> <br><b>Key features:</b><br>* Improve your health with personal drink notifications<br>* Keep perfect track of your water balance through a simply designed diary<br>* Get a graphical insight into your water drinking habits with week and month statistics<br>* Practical widgets provide clear information about your water intake<br>* Create custom drink volumes easily<br>* Supports imperial (fl. oz.) and Metric (ml) units<br>* Share your water intake with your friends<br>* Direct water input through your android wear<br>* Synchronization with your google account<br> <br><b>How it works:</b><br>Our formula calculates your ideal personal water requirement based on multiple factors like age, weight, gender and lifestyle. Select your favorite glass you normally use, and Hydro Coach will remind you to drink and refill it.<br> <br><b>Join a fantastic community</b><br>Blog: http://blog.hydrocoach.com<br>Facebook: http://facebook.com/hydrocoach<br>Google+: http://google.com/+HydrocoachApp<br>Instagram: http://instagram.com/hydro_coach",
    "histogram": {
        "1": 830,
        "2": 663,
        "3": 3862,
        "4": 25598,
        "5": 62797
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "3.1 and up",
    "androidVersion": "3.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/BE-Q0cIEQB3UIYy-y9a3QEzmZMOKCNCnx4klhnGZtsFo6o0cQPpWD6PnpF2pspOtOA=h310",
        "//lh3.googleusercontent.com/WO-JvcYKI5Zxx29Y6Snrmo-8DTlSYOS0GRGsFpqpv83oUUWGxiJfiCYWu1drc5jubg=h310",
        "//lh3.googleusercontent.com/wNFZtEkEij-7ELioOiZi63xut5Wa2PHrIjm5Ddh_JwEQWxbV4ANWrqSrSJz8zNjMXHU=h310",
        "//lh3.googleusercontent.com/rwMwu6VIP8prsoXRcDQl96Y8RsHDKY5hMvHkPLLy8UZdjyyF5WL-9wughkwWkBcT8MU=h310",
        "//lh3.googleusercontent.com/5UZmwmCAwaGLUeVWbHDF9Xl4nSfmaQg0msLsJF7Z_Jsjv5i-ed9Li1Y-apiwhooZbG8=h310",
        "//lh3.googleusercontent.com/k9TYlzREjqwDAeM3oqyXz8111ltYoMe990BpViCabcaslRT3tI5TSoUMM55rkQ1bEwU=h310",
        "//lh3.googleusercontent.com/J8959totvyG92SVOt3ZgJKxkzEYvPXXMaWoELHtQEaa_JTOsrYOt6nUt-3wnh7BJaFw=h310",
        "//lh3.googleusercontent.com/3Yo5uT1FYdyHZ-gv5jpF7nUhCjVvcEpm7P9HOD4PZfvBChjVro9ec0HXnqrIeP6Up2A=h310",
        "//lh3.googleusercontent.com/UNbVUGtKSC90IRTYErSJpI9zTFP_yuctAlDA4m6h-jFciLPXKMwTQhq_IndwANTa1g=h310",
        "//lh3.googleusercontent.com/_FTTgwOXatH7ySaGHLkaxzwJ0jDI9Lx4Jmo8rvacfnmYg9let_9x1JSOLPfrUlgnTv4=h310",
        "//lh3.googleusercontent.com/TTH0m7eN4CExvdXMKFn_T3iWIZJWJcc3Hyy2lJP2pM64UXELRyBR1YI3JZ279S5TA4s=h310"
    ],
    "comments": [
        "Needs smartwatch alert reminder Like that it syncs with fitbit--and fast, but the lack of a smartwatch alarm is a deal breaker.  Didn't remind me via my LG watch to drink like a competitors app does.  Also, adding reminder times didn't work. And no option for coffee.Fix those things I'd pay for pro. Nice you can change reminder sound.",
        "This app was great for the longest time, but they must have updated it and it is full of bugs.  The app shuts down on me a lot when I am using wifi or data. When I am not using wifi or data my water data amounts flash like a strobe light and it takes forever to submit more water data after I touch the add button. PLEASE FIX THE BUGS!!!",
        "I love this app it's so super easy too use and makes me realize how much water I need and how much I was lacking.. I've drank so so much water since I started this app. Some days are hard cause with my height and weight they recommend 97oz a day but I'm getting much closer every day. I try so hard to achieve that goal it's got me back on my coffee,tea,and soda so YES I RECOMMEND THIS APP TO EVERYONE!",
        "Amazing and surprisingly helpful I didn't know how this app was going to work out for me, but once I set it up a bit better and all I love it!!!! The reminders actually help to remind me to drink more water rather than me just ignoring them. I really do like it. Like any other app I wish there wasn't a pro option and I would like to be able to add my water through the notification without having to go pro. I work with children so I can't always sit and load up the app but all in all I really love it!!!!",
        "Love it! It's been a great help with staying hydrated. As an aircraft mechanic I'm in the elements alot as well as on the go with changing shifts and schedules. With that being said I often forget to eat and most importantly, stay properly hydrated. With this app it helps me maintain a healthier lifestyle by keeping me mindful of how much or how little I'm getting in the way of daily water intake. I give this app 5++ stars.",
        "Can be personalized to your schedule! I appreciate the scheduling component. The ability to accommodate my schedule is very useful as I don't want to constantly be interacting with the app unless I'm tracking water. Additionally, it would be nice to have the ability to automatically set water mounts for certain days of the week when activities occur like workouts, cleanses, massage, or with certain meds when increased water is important. Possibly a manual option to increase by percentage in the daily diary. B+ bc the ads are over the top."
    ],
    "recentChanges": [
        "NEW: Use the latest weather data to adapt your daily target",
        "v3.0:",
        "* Sync weight and drinks with Fitbit",
        "* Android Wear App",
        "* Choose from over 80 different glasses",
        "* Assign a title to your drinks",
        "* Define how well drinks are hydrating or dehydrating (PRO)",
        "* Fast intakes with 1x1 widgets (PRO)",
        "* Choose a color for your notification light",
        "* Bulk delete your drinks",
        "Recently:",
        "* Google Fit support",
        "* S Health support (min. version: 4.0)",
        "* Individual target setup for hot or active days"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.codium.hydrocoach&hl=en&gl=us",
    "appId": "com.codium.hydrocoach"
}