{
    "title": "CNN Breaking US & World News",
    "summary": "When you want to know what’s happening, tap into the global news power of CNN.",
    "icon": "//lh4.ggpht.com/m05SBF4omSJbBy-EnPClGH_yAVvgAn6wr6KQwdtXhn6ATylzMYYJb6WaW-pNbtmqg5I=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4,
    "reviews": 279463,
    "developer": "CNN",
    "developerId": "CNN",
    "developerEmail": "android@cnn.com",
    "developerWebsite": "http://www.cnn.com",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "size": "Varies with device",
    "description": "When you want to know what’s happening, tap into the global news gathering power of CNN. With correspondents and bureaus reporting from across the world, no other news source even comes close.• Custom alert settings - stay informed without getting overwhelmed• Watch live CNN, CNNi or HLN television anywhere, anytime* • Experience the world of breaking news through in-depth stories, photo galleries and news clips.• Watch CNN Original Series like “Anthony Bourdain: Parts Unknown”, CNN news programs like “Anderson Cooper 360” and award-winning CNN Films.Video on Demand and Live TV limited to US consumers.*first 10 minutes free each day, log in with your US satellite or cable provider credentials for unlimited viewing.",
    "descriptionHTML": "When you want to know what&#x2019;s happening, tap into the global news gathering power of CNN. With correspondents and bureaus reporting from across the world, no other news source even comes close.<br><br>&#x2022; Custom alert settings - stay informed without getting overwhelmed<br>&#x2022; Watch live CNN, CNNi or HLN television anywhere, anytime* <br>&#x2022; Experience the world of breaking news through in-depth stories, photo galleries and news clips.<br>&#x2022; Watch CNN Original Series like &#x201C;Anthony Bourdain: Parts Unknown&#x201D;, CNN news programs like &#x201C;Anderson Cooper 360&#x201D; and award-winning CNN Films.<br><br>Video on Demand and Live TV limited to US consumers.<br><br>*first 10 minutes free each day, log in with your US satellite or cable provider credentials for unlimited viewing.",
    "histogram": {
        "1": 32218,
        "2": 13413,
        "3": 21832,
        "4": 63736,
        "5": 148264
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone 10+",
    "screenshots": [
        "//lh3.googleusercontent.com/InUvZg1TLTufh2E4amtEdRKxQ0WVEyT69gXY6WRwdhAUktgBACD7E9tnh6ABJL1fXg=h310",
        "//lh3.googleusercontent.com/TEBGPNi27KRg5mYUI9tY7vcAfOwqjc6uFOyJcddi28sRERsO8UrCKpKZQsJ6C5sUAtA=h310",
        "//lh3.googleusercontent.com/HCdO-pDzs5hGfUAnSreVtMEiFjKWZVofP9E9aqap8Bc5pPZHfO8qPp0iz8m-H-Takw=h310",
        "//lh3.googleusercontent.com/Ptd0wnCw1XCVyYdpHfGoEwwUAAT2GSWzNKTKcTBa3mkKOmxFr-HCdliL4FGbQ09SAH4=h310",
        "//lh3.googleusercontent.com/KArHvm8gynxsa7gUP2kAUcXUsD1lRlcFYxiaCWe11w808TcU1rdwRm3WIUlL5spC0r0M=h310",
        "//lh3.googleusercontent.com/6Q7DXb4ZaAPBH4n2jopUCt2nWXwM3ODhNQMwDUxAV8fi70Mi2LHBjf4FFztvKARPug=h310",
        "//lh3.googleusercontent.com/pW1_AX5fvySjeSyfpxw1WBZN6TdejYN49IReKvvWyWWTDAfRXysTdfeVS92QxwvyhQJg=h310",
        "//lh3.googleusercontent.com/ZQQwEM0pgiSRg9--EB4ZrUkkxlGC1OWMJCYmVpy_uM07WammzCOpkgj-2Fc5buqZkJA=h310",
        "//lh3.googleusercontent.com/SytwrMtbm7lJw_2A_uW_387PZ5do2zktm6xN9um6jVl6x_CDu1PEKNeCE-vXaXpN3Ro=h310",
        "//lh3.googleusercontent.com/djDbmwVnoi0Ll9t6holnkUBB88eGul21P48Ta1mGKT1WjhqZi6exsa_s5DmCK74oZCdo=h310",
        "//lh3.googleusercontent.com/I7TbMzDRIzkUvAzSiuxSHacAxKR-M2nKhHxPDRJgg8AdgkiybTVajxz6dVrEw2ZaNw8=h310",
        "//lh3.googleusercontent.com/TE-n_Lc4HtetLJwkztvEvwAqi9IoOgDTSEtp0nJwk5vg8APIaRoVO5xTu0qANzIIlA=h310",
        "//lh3.googleusercontent.com/nu2ctgBaetEl0Z5THfGY4-Gk2lrAYQgBbTGraN-bEkhghX3viWqfmjWQcbZ-ZjJVWTs=h310",
        "//lh3.googleusercontent.com/6vT03hSdvvQAMSEwpLYDvhm5B0Ixsb03dDj2G5CZywoFTI8BF_zH2xm7F59MDFNtnAA=h310",
        "//lh3.googleusercontent.com/Fhd5GWbY70IrWw7UFEWr5xugcriej2SzmU2Id_Yp1PiqpYanNwzEzmEWDJm9or3GaT_T=h310"
    ],
    "comments": [
        "I continue to be astounded by the atrocious grammar and lack of proofreading. I love reading the news and the CNN content is great but NPR and the BBC manage to produce the same product without all the annoying autocorrect and grammatical errors.",
        "I enjoyed getting notifications of breaking news events, but the articles in this app are clearly opinions.  If you are looking for news that is not biased and opinionated, you may want to try something like the NPR app.",
        "Way way too many ads. Every video has a 15 sec commercial.",
        "What the heck is this app why is it on my phone I am  a kid this is terrible appp",
        "Don't bother downloading this app. The CNN coverage and articles in the app are nothing like the coverage you will see on TV. This is a long review but I will try to explain clearly why I think this. Mostly it's just a bunch of articles offering opinions and biased reports under the guise of \"analysis.\" It's a bit infuriating to see such blatant disregard for objective reporting of fact.  I guarantee you can't open a single article without having some random know it all journalist inserting their own views or opinions into the mix and framing it as a correct attitude. As an example, when you open up the app you see \"Top News\" as the first category alongside \"Politics,\" \"Money,\" etc. However, most recently under Top News I saw:  \"GOP Senator Ben Sasse's Sassy week Criticising Donald Trump\" \"Donald Trump's Just Say Stuff Strategy\" and  \"Trumps White House Chaos is Rocking the World\"  Why is it that these supposed Top News Headlines sound more like some teenage blog post than a professional accounting of world events? You open up the articles and, after reading closely, can see that these articles try to subtly influence opinions of current events by reporting facts in a frame of narrative designed to lead people to believe in their opinions.   To which some might say, \"Yeah, no duh, it's an Opinion.\" But ask yourself this, \"Why in the WORLD should we care about their opinions??\" Who are they?? What qualifies them to force their opinion on me? Their opinions DO NOT belong on a Top News category for one of the largest news sources the common American accesses on a daily basis! I'm interested in the facts, NOT YOUR OPINION! Quit treating world news like your personal blog!  While the examples I gave specifically pertain to Trump, these \"Analysis\" articles are written about everything under the sun. If you want actual objective reporting don't waste your time on this app, it's better to watch the actual news segments on TV.",
        "Wish I had cable tv (too expensive) so I could watch!!"
    ],
    "recentChanges": [
        "Bug fixes & performance enhancements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.cnn.mobile.android.phone&hl=en&gl=us",
    "appId": "com.cnn.mobile.android.phone"
}