{
    "title": "Directed SmartStart",
    "summary": "Start your car from virtually anywhere with your Android phone or smart watch!",
    "icon": "//lh3.googleusercontent.com/6489cTUOf5xSkEKXXeMsdVwT5KyAMUoAWB0-oeqCsYeWMNciDlaQkizTLJsqgL80Au2a=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.6,
    "reviews": 2098,
    "developer": "Directed Electronics",
    "developerId": "Directed+Electronics",
    "developerEmail": "support@mysmartstart.com",
    "developerWebsite": "http://mysmartstart.com/?b=d",
    "developerAddress": "1 Viper Way\nVista, CA  92081",
    "updated": "November 29, 2017",
    "version": "4.3.4",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Start, locate and control your car from virtually anywhere with your Android phone or Android Wear device!“Making the cloud-connected car a reality” - Edmunds.com\"Without a doubt, one of the coolest apps I've ever seen\"- GIZMODOWith the release of its all-new 4th generation Directed SmartStart app, connecting with and controlling your vehicle is easier than ever – including control via your Android Wear smart watch! - Add a Directed SmartStart module to the remote start or security system in your car so you can start, lock and unlock your car from virtually anywhere.- Add a Directed SmartStart GPS module instead, and you can also locate your car, share activity on Facebook (because your car needs friends, too), and set safety notifications if your car is speeding or goes where it's not supposed to go. - For the ultimate connected car experience, install a complete Directed SmartStart Digital System and you’ll also get notified if your vehicle sets a diagnostic code, along with direct feedback from the car databus for feature status. Check out the 60 Day Free Trial GPS Premium service that’s included at no extra cost with these systems!- For even more convenience, add a Directed SmartKey module for hands-free lock/unlock operation. Now you can securely remote start, lock/unlock, or find your car using your Android device, with the exciting new 4.0 SmartStart app from Directed.The sleek, modern dashboard of Directed SmartStart 4.0 gives you fingertip control over the following features of your installed remote start or security/remote start system: - Lock/arm - Unlock/disarm - Remote car starter - Trunk release - Panic - Aux channelsFollow these three simple steps to get Directed SmartStart: 1) Download the free Directed SmartStart app 2) Get a SmartStart system installed in your vehicle 3) Set up your account, and start using your SmartStart systemDirected SmartStart also includes membership in Motor Club, providing convenient flat rate 24/7 access to our nationwide roadside assistance network. Just press a button in the app to get connected for towing due to breakdown or accidents, or assistance with a dead battery or flat tire. No hardware or service purchase required. Latest features:- Convenient widget added for one-touch command execution from your home screen- Two new dashboards added that allow you to pick the layout and features most important to you- Enhanced remote start feedback: Ever started your car from your smartphone, but weren’t sure afterwards if the car was actually running? No problem with v4.2, the app confirms the command and then follows it up a few moments later to let you know if the engine is running, or stopped (digital systems only). The details are providedright on the dashboard too, no need to check the status page.- Enhanced command feedback: Now when you send a command to your SmartStart system, the app provides the details for the command right on the dashboard and keeps them there in case you forget and want to check back later to confirm what happened. Doors locked at 8:30AM? Check! (all systems)- Last command sent: Tired of having to refresh the Status page and wait for it to update just so you could check on whether you remembered to lock the doors? Now you can simply open the Status page and your last command sent is displayed at the top.- Push Notification: All of your important vehicle alerts will now be delivered through push notification.4.0 features:- New swipe to start feature eliminates accidental remote start commands (modern dashboard)- Four user-selectable dashboards and launch page settings – now you can customize the app for the way you use it- Map page now integrates GPS and SmartPark features seamlessly- Start, lock or unlock your car using your Android Wear smart watch, or send other commands. - Receive alert notifications on your phone and Android Wear smart watch",
    "descriptionHTML": "Start, locate and control your car from virtually anywhere with your Android phone or Android Wear device!<br><br>&#x201C;Making the cloud-connected car a reality&#x201D; <br>- Edmunds.com<br><br>&quot;Without a doubt, one of the coolest apps I&apos;ve ever seen&quot;<br>- GIZMODO<br><br>With the release of its all-new 4th generation Directed SmartStart app, connecting with and controlling your vehicle is easier than ever &#x2013; including control via your Android Wear smart watch! <br><br>- Add a Directed SmartStart module to the remote start or security system in your car so you can start, lock and unlock your car from virtually anywhere.<br><br>- Add a Directed SmartStart GPS module instead, and you can also locate your car, share activity on Facebook (because your car needs friends, too), and set safety notifications if your car is speeding or goes where it&apos;s not supposed to go. <br><br>- For the ultimate connected car experience, install a complete Directed SmartStart Digital System and you&#x2019;ll also get notified if your vehicle sets a diagnostic code, along with direct feedback from the car databus for feature status. Check out the 60 Day Free Trial GPS Premium service that&#x2019;s included at no extra cost with these systems!<br><br>- For even more convenience, add a Directed SmartKey module for hands-free lock/unlock operation. <br><br>Now you can securely remote start, lock/unlock, or find your car using your Android device, with the exciting new 4.0 SmartStart app from Directed.<br><br>The sleek, modern dashboard of Directed SmartStart 4.0 gives you fingertip control over the following features of your installed remote start or security/remote start system:<br> - Lock/arm<br> - Unlock/disarm<br> - Remote car starter<br> - Trunk release<br> - Panic<br> - Aux channels<br><br>Follow these three simple steps to get Directed SmartStart:<br> 1) Download the free Directed SmartStart app<br> 2) Get a SmartStart system installed in your vehicle<br> 3) Set up your account, and start using your SmartStart system<br><br>Directed SmartStart also includes membership in Motor Club, providing convenient flat rate 24/7 access to our nationwide roadside assistance network. Just press a button in the app to get connected for towing due to breakdown or accidents, or assistance with a dead battery or flat tire. No hardware or service purchase required. <br><br>Latest features:<br><br>- Convenient widget added for one-touch command execution from your home screen<br><br>- Two new dashboards added that allow you to pick the layout and features most important to you<br><br>- Enhanced remote start feedback: Ever started your car from your smartphone, but weren&#x2019;t sure afterwards if the car was actually running? No problem with v4.2, the app confirms the command and then follows it up a few moments later to let you know if the engine is running, or stopped (digital systems only). The details are provided<br>right on the dashboard too, no need to check the status page.<br><br>- Enhanced command feedback: Now when you send a command to your SmartStart system, the app provides the details for the command right on the dashboard and keeps them there in case you forget and want to check back later to confirm what happened. Doors locked at 8:30AM? Check! (all systems)<br><br>- Last command sent: Tired of having to refresh the Status page and wait for it to update just so you could check on whether you remembered to lock the doors? Now you can simply open the Status page and your last command sent is displayed at the top.<br><br>- Push Notification: All of your important vehicle alerts will now be delivered through push notification.<br><br>4.0 features:<br><br>- New swipe to start feature eliminates accidental remote start commands (modern dashboard)<br><br>- Four user-selectable dashboards and launch page settings &#x2013; now you can customize the app for the way you use it<br><br>- Map page now integrates GPS and SmartPark features seamlessly<br><br>- Start, lock or unlock your car using your Android Wear smart watch, or send other commands. <br><br>- Receive alert notifications on your phone and Android Wear smart watch",
    "histogram": {
        "1": 434,
        "2": 138,
        "3": 205,
        "4": 335,
        "5": 986
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/aoJBxrglChzeAfQ1e4ywRx_2PsQbW4sRO2I1mG-lwNymE_lo3DOzSlYjW_FER0QM57KN=h310",
        "//lh3.googleusercontent.com/kc3fLgUzKEAzrpkQtnlte9xr_JttxTfzrYsb17t4yhbPg_CgnFZ5gaSoST9tsSq7JQ=h310",
        "//lh3.googleusercontent.com/VmvLbDp9E1NwVQRiic3DR6WpRpIK0X46uGoh8PN4sgTVH1XIU_FPuL9HMsVAwfWQ8vo=h310",
        "//lh3.googleusercontent.com/SkDAhjduQyNXntxUAFLvx53nBwO7l9xDY60L7UltbcEmYlMBiHRezAXMD1aMtvgG77NK=h310",
        "//lh3.googleusercontent.com/lOCT2MbLh3RKgmNjU-3p4lRaC3PDiQH602qIUuxpOXi7h0l9jL6VuzH0YKqPWELZag=h310",
        "//lh3.googleusercontent.com/Nu7nEFWPa6Ld_A1iagCd32HhQ-Awfx_SiDOx9ilHiA5z2QQ6ZCkcUuS-0kKSOBeTcA=h310",
        "//lh3.googleusercontent.com/_Dm0kqNq6HxvlLMnMKSe9fIwo2nnh60yX2ZB_gMMSmbbSDMsYAiezyGUlfgqxXkTi3Y=h310",
        "//lh3.googleusercontent.com/59Rhxf3i_HZSMbpyTYeJZQbjeWeYuxZs8UQvOaaC_EEZpeH69pPndbSm-n6emyPU6zB7=h310",
        "//lh3.googleusercontent.com/9uMCwWD-WYtsmjxd0-0QnfdwkDsYn0rxGRqmlbRo4j4jWHK_XihGGdKsQq_zEFTp9Mg=h310",
        "//lh3.googleusercontent.com/iJfLt7Cs4whOkkLxOE1CBkThsX2-g71L_doGYdmjZaDTX30xyDR05l98hSnjGJrSHA=h310",
        "//lh3.googleusercontent.com/OfVXLmjuZLtUoaGj00AsrWmCRj3c4lVEIIkI94tUMd1p4--VfJp5I3l1_-XFZazt4Vs=h310",
        "//lh3.googleusercontent.com/hTC0debUI4yTYtCF_NmpdXrLVxAZkHd7sYjVecfpU0NxD-n0sKhymyDgAhiaZdtfL44=h310",
        "//lh3.googleusercontent.com/l-l5aJJzHa85A01JNmtKsyb0qnnoWzGAwYVcW8c1hIrppyIDr4bQBH_7FPyG5LPdmpSy=h310"
    ],
    "video": "https://www.youtube.com/embed/H0ZH1HLN5WE",
    "comments": [
        "Best way to control your car with this is restart your phone before it. Dislike about it: Need to restart phone before use it for best effection, phone low battery won't work, press start for second time won't say start the car or shut off the car, won't lock the car while engine is running, map take forever to load car location.  I hope the company can see my review, and fix all the problems to let us have the best experience.",
        "Used 1 week now, zero issue! Can't believe the bad ratings. Live pretty excluded too and it starts every time within 5-7 seconds. Expect a little delay as it comes from cell signal versus rf off the remote.",
        "It works occasionally,I can lock the doors and unlock,always ,but to start it rarely  works buy using   my Samsung 8+,I will get it uninstalled  and go with a command start asap,using the fob,is hit and miss,if you hold the button too long it won't start ,if not long enough,it won't start,and I try using 2 fobs same thing 😡😡😡",
        "It works fine ,  I'm very happy with it special now winter and the snow is coming back I'm seating in a nice clean and  warm car",
        "Love this app I've been using it well over a year have not had one issue it's a pleasure getting to my car and it's already warmed up because I was able to start it from my desk",
        "Called them to find out why my app would show my car and the Guy on the other end act like I didn't know how to use a phone hello I have a Samsung Galaxy S8+ and use it to it full use don't talk down to people I rather go back to another company"
    ],
    "recentChanges": [
        "- Improved SmartFence and Speed Alert Scheduling feature",
        "- Support for 48 hour grace period",
        "- Various bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.directed.android.smartstart&hl=en&gl=us",
    "appId": "com.directed.android.smartstart"
}