{
    "title": "Skype - free IM & video calls",
    "summary": "Skype video and voice calls, instant messaging and cheap international calls.",
    "icon": "//lh3.googleusercontent.com/0O-79hEWydGkM_-QJnQIicQ0qfIfChtm9BFrURV8cLetDQwYt42o-r2jZrC_OuFgmpk4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000000,
    "maxInstalls": 5000000000,
    "score": 4.1,
    "reviews": 10338583,
    "developer": "Skype",
    "developerId": "Skype",
    "developerEmail": "skypeuploader@googlemail.com",
    "developerWebsite": "http://www.skype.com",
    "developerAddress": "Skype Software S.à.r.l, 23 – 29 Rives de Clausen, L-2165 Luxembourg",
    "updated": "February 23, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "The Skype you know and love has an all-new design, supercharged with a ton of new features and new ways to stay connected with the people you care about most.What can I do with Skype?• Messaging made awesome: More than just text. Send photos, videos, voice messages, emoticons, Mojis and more. You can also respond to any message from your contacts with reactions.• Supercharge your chats with Add-Ins**: No more switching back and forth between apps. Easily share content using Add-Ins without leaving Skype.• Great for groups: Add your favorite people and start chatting. Use groups to plan together, play together, for staying in touch or just for hanging out.• Call everyone - Skype, mobiles and landlines: Free* video and voice calls make it easier to stay connected with friends and family. You’ll also enjoy low calling rates to mobiles and landlines worldwide with Skype. • Never miss a moment with quick capture: Quickly swipe to capture photos and videos. Make them your own by adding emoticons, stickers and annotations.• Share Highlights: Keep others updated with Highlights from your day. React to any highlights with awesome emoticons or send a private message about that highlight. Your highlights only stay visible for 7 days to your followers.*Skype to Skype calls are free. Operator data charges may apply. We recommend using an unlimited data plan or WiFi connection.** Add-In availability will vary by country.We’re gradually bringing the next generation of Skype to everyone. If you don’t see the update yet, don’t worry, it’ll be coming very soon. Learn more about the new design and features in the Skype Blog: https://blogs.skype.com/news/2017/06/01/introducing-the-next-generation-of-skypeUpgrading to the new Skype may result in the deletion of content from older conversations.To save photos and videos that were previously sent or received in an older version of Skype, save that content to your camera roll/photo gallery before upgrading to the new Skype.",
    "descriptionHTML": "The Skype you know and love has an all-new design, supercharged with a ton of new features and new ways to stay connected with the people you care about most.<br><br>What can I do with Skype?<br><br>&#x2022; Messaging made awesome: More than just text. Send photos, videos, voice messages, emoticons,&#xA0;Mojis&#xA0;and more.&#xA0;You can also respond to any message from your contacts with&#xA0;reactions.<br>&#x2022; Supercharge your chats with Add-Ins**: No more switching back and forth between apps. Easily share content using Add-Ins without leaving Skype.<br>&#x2022; Great for groups:&#xA0;Add your&#xA0;favorite&#xA0;people and start chatting. Use groups to plan together, play together, for staying in touch or just for hanging out.<br>&#x2022; Call everyone - Skype, mobiles and landlines:&#xA0;Free*&#xA0;video and voice calls make it easier to stay connected with friends and family. You&#x2019;ll also enjoy&#xA0;low calling rates to mobiles and landlines worldwide with Skype.&#xA0;<br>&#x2022; Never miss a moment with quick capture:&#xA0;Quickly swipe to capture photos and videos. Make them your own by adding emoticons, stickers and annotations.<br>&#x2022; Share Highlights:&#xA0;Keep others updated with Highlights from your day. React to any highlights with awesome emoticons or send a private message about that highlight. Your highlights only stay visible for 7 days to your followers.<br><br>*Skype to Skype calls are free. Operator data charges may apply. We recommend using an unlimited data plan or&#xA0;WiFi&#xA0;connection.<br>** Add-In availability will vary by country.<br><br>We&#x2019;re gradually bringing the next generation of Skype to everyone. <br>If you don&#x2019;t see the update yet, don&#x2019;t worry, it&#x2019;ll be coming very soon. <br>Learn more about the new design and features in the Skype Blog: https://blogs.skype.com/news/2017/06/01/introducing-the-next-generation-of-skype<br><br>Upgrading to the new Skype may result in the deletion of content from older conversations.<br>To save photos and videos that were previously sent or received in an older version of Skype, save that content to your camera roll/photo gallery before upgrading to the new Skype.",
    "histogram": {
        "1": 1064458,
        "2": 442159,
        "3": 898524,
        "4": 1673803,
        "5": 6259639
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/4JAQKZvRJYjCao6q5mggCJl1EUzcROTxbi8h1y1p83-zABAXX1YkI0AKudCY8jlit80=h310",
        "//lh3.googleusercontent.com/hDs96FUcqr5y9ndr3lbEDega3QN1GJ3nj6NjZ-pgVW4wB_hYZdrcGMpss5cHcpjPG7U=h310",
        "//lh3.googleusercontent.com/N9yXYwBQIf9TKukxvftC8X4wFr2ambaa15nrIKRnxG3vehC8LUppog--YmgW_JEnmKCP=h310",
        "//lh3.googleusercontent.com/uKZ0NrLlLfd82Zm1ZFOp0oj1Bk3ZgNl2-SRoK9_SMuY_eJbhJ4c-tERm-8-9mjrB5Ko=h310",
        "//lh3.googleusercontent.com/JLY1LOoFI3BYcUSCXScYnQ_vbPM9tHPxtDp79vc7jhby3SWtS-sTtK9BEW6HKEPmfFc=h310"
    ],
    "comments": [
        "I can't tell anyone more clearly.  Family far away?  LOVE YOUR FAMILY TIME? LOVE THIS APP! It's the next best thing to being there. My two grown daughters, 1 & 3 year old grandkids. They live 2500 miles from me, yet I know my grandkids will recognize and connect with me when I do get to go there. All because of the hour or more every Sunday we get to Skype. Thank You❣ Really 🤗",
        "It's a nice ad-free app which would normally make me go right to giving a 5 star rating. But when I sometimes hit the video button, the video feed won't turn off. Other times I'll try to flip to my front camera and it won't respond there either. If the connection isn't lightning fast, the connection can drop completely. The phone heats up BIG time during video chat (which I know may not be something they can fix). To say the least, they've got a lot to improve on.",
        "It is a great app, better than any other apps I know for video calling. One of the greatest feature of this app is it shows the text of another person while we are having a video call. This makes people can do another task simultaneously. But another problem I have, my phone gets really slow when I have a video call while texting. However, it is still a great app!",
        "Great app for video and audio calls. A little hard to figure out at first, too many motions for some basic features, hang up for instance is tap screen first then press hang up button but it does use all the real estate your phone offers for video. Call quality has improved to where it should be: equal or better than actual calling if you have high speed (5mbps both directions) so it's great for when you're roaming the world.",
        "Core functionality (communication) works well, however the UX is very poor. The icons (mute, etc.) disappear during the call and its not intuitive at all to have to touch the screen to make them appear first before choosing the icon I need  (and that is not that responsive any way) - very annoying",
        "I've been using Skype for years but the mobile app had always been unstable and unreliable. Since most people now use mobile apps it makes me wonder when Skype will start paying attention to users' needs.  Update 2018: how difficult is it too design an app? Still slow and buggy."
    ],
    "recentChanges": [
        "We're listening to your feedback and working hard to improve Skype. Here's what's new:",
        "- Take call snapshots - instantly capture the best moments from any call and share them to the chat.",
        "- View photos together - share your favorite photos and view them together with friends during a Skype call.",
        "- General stability and reliability improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.skype.raider&hl=en&gl=us",
    "appId": "com.skype.raider"
}