{
    "title": "Lua HIPAA Compliant Messaging",
    "summary": "HIPAA Compliant Secure Text Messaging",
    "icon": "//lh3.googleusercontent.com/ywMdo_3xo0Q-obyFjhPzamaSsSS-qlP5lyafP3DXFhgZE0upH0xQcnwKnPut92agvTI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.6,
    "reviews": 116,
    "developer": "Lua Technologies, Inc.",
    "developerId": "Lua+Technologies,+Inc.",
    "developerEmail": "hello@getlua.com",
    "developerWebsite": "https://www.getlua.com/",
    "updated": "March 2, 2018",
    "version": "3.15.1.0-release",
    "genre": "Business",
    "genreId": "BUSINESS",
    "description": "Care coordination in real time! Lua is the simple and easy to use HIPAA compliant messaging solution. INTERNAL AND EXTERNAL MESSAGINGSafely and securely message colleagues, patients and their families. Quickly send a message to anyone inside or outside your organization.SIMPLE TO USE VIDEO CHATSTelehealth is an essential tool for all healthcare professionals, making it seamless to move between a message and face-to-face live conversations.PROVIDE PATIENTS WITH A BETTER EXPERIENCEAllow your patients to stay securely touch with their care team and family with Lua.QUICKLY ESCALATE TO A CALLPhone calls with colleagues have never been so easy. Initiate calls (cellular or VOIP) from anywhere in Lua: no dial-ins or passcodes necessary. With one tap you can instantly call individuals or a selected group.SHARE FILES AND PHOTOS WITH EASESecurely attach photos, videos, voice notes and more, even right from your approved cloud storage apps like Box, Sharefile and more.EASILY DEPLOY AND MANAGE YOUR COMMUNICATIONLua administrators have full control to set policies to maintain HIPAA compliance, while still allowing caregivers to share patient info, test results, or even photos and videos. This allows for better and faster care, without sacrificing security.OTHER KEY FEATURES- Simple audit reporting for compliance- Read reports on every message and file - Powerful search for conversations, people, files and more- Expiring messages allow for more control of your data- Do Not Disturb mode for when you’re not available- Dedicated Client Success team when you need it- Comprehensive analytics dashboard highlighting communication patternsQuestions?Contact Us:  hello@getlua.comSupport:  support@getlua.comLinkedIn:  http://www.linkedin.com/company/getluaGoogle+: http://plus.google.com/+GetLuaTwitter:  https://twitter.com/getLua",
    "descriptionHTML": "Care coordination in real time! Lua is the simple and easy to use HIPAA compliant messaging solution. <br><br><b>INTERNAL AND EXTERNAL MESSAGING</b><br>Safely and securely message colleagues, patients and their families. Quickly send a message to anyone inside or outside your organization.<br><br><b>SIMPLE TO USE VIDEO CHATS</b><br>Telehealth is an essential tool for all healthcare professionals, making it seamless to move between a message and face-to-face live conversations.<br><br><b>PROVIDE PATIENTS WITH A BETTER EXPERIENCE</b><br>Allow your patients to stay securely touch with their care team and family with Lua.<br><br><b>QUICKLY ESCALATE TO A CALL</b><br>Phone calls with colleagues have never been so easy. Initiate calls (cellular or VOIP) from anywhere in Lua: no dial-ins or passcodes necessary. With one tap you can instantly call individuals or a selected group.<br><br><b>SHARE FILES AND PHOTOS WITH EASE</b><br>Securely attach photos, videos, voice notes and more, even right from your approved cloud storage apps like Box, Sharefile and more.<br><br><b>EASILY DEPLOY AND MANAGE YOUR COMMUNICATION</b><br>Lua administrators have full control to set policies to maintain HIPAA compliance, while still allowing caregivers to share patient info, test results, or even photos and videos. This allows for better and faster care, without sacrificing security.<br><br><b>OTHER KEY FEATURES</b><br>- Simple audit reporting for compliance<br>- Read reports on every message and file <br>- Powerful search for conversations, people, files and more<br>- Expiring messages allow for more control of your data<br>- Do Not Disturb mode for when you&#x2019;re not available<br>- Dedicated Client Success team when you need it<br>- Comprehensive analytics dashboard highlighting communication patterns<br><br><br><b>Questions?</b><br>Contact Us:  hello@getlua.com<br>Support:  support@getlua.com<br>LinkedIn:  http://www.linkedin.com/company/getlua<br>Google+: http://plus.google.com/+GetLua<br>Twitter:  https://twitter.com/getLua",
    "histogram": {
        "1": 5,
        "2": 0,
        "3": 4,
        "4": 24,
        "5": 83
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/N5Nz36cqVxFG0g8WKnhcrtLVZ9Sk61um3dVc5_b3fTJH2kZ8-fO-4I62yDqHlHkEgw=h310",
        "//lh3.googleusercontent.com/SNZxnMd-msVAaFSnff6vT0Z6P1Y0dmR1LOHNaNkzjEvGRm8VQaGy1pPU4tmqH3byMuk=h310",
        "//lh3.googleusercontent.com/W10aHf7xSVx1hl9KPTpzfOolesFG4hnFD298IZjmf4w9suHliUuC8_FtUFZuANHDCQ=h310",
        "//lh3.googleusercontent.com/e3LC_7-SQ58ohO14YAaUwLYI5lWivNtOsSQ3cEm8-Y8jtAb8brRH_dA4644JWier5Q=h310",
        "//lh3.googleusercontent.com/6nQvmKsr6-YaiWT8BNxWgUeXZLO3nbuKCgHc7_P4yOzjNxjKIP9x_dtb4j9ghCTDgMI=h310"
    ],
    "video": "https://www.youtube.com/embed/55UfqSJUzUU",
    "comments": [
        "Constantly resyncing and stops working.  Have to restart my phone to get it to respond.  Does not allow connection with automobile to have hands off replies by text.  Do not like it.",
        "Best out there by a country mile.",
        "Lua is an easy way to communicate with tram members in a HIPPA compliant manner. I love it!",
        "It great. I highly recommend!",
        "This works great for constant healthcare communication. I especially like the search option so you can view previous conversations.",
        "Love it!!!"
    ],
    "recentChanges": [
        "* New Do-Not-Disturb Interface",
        "* Better handling of User and Network Organizations",
        "* Improved Network Listing",
        "* Show Self Activity when in Do Not Disturb",
        "* Fixed Inbox-Style Notification"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.getlua.lua&hl=en&gl=us",
    "appId": "com.getlua.lua"
}