{
    "title": "Glympse - Share GPS location",
    "summary": "Fast &amp; safe way to share your location using GPS tracking with friends &amp; family!",
    "icon": "//lh3.ggpht.com/iKNjSbuP2Cclnc7o90bIXLW3z6oKtV_DgDa5__PAvRAHv3p2DrGCUvLvGAVp5U-OCEk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 99571,
    "developer": "Glympse",
    "developerId": "Glympse",
    "developerEmail": "support@glympse.com",
    "developerWebsite": "http://glympse.com",
    "updated": "January 12, 2018",
    "version": "Varies with device",
    "genre": "Social",
    "genreId": "SOCIAL",
    "size": "Varies with device",
    "description": "Glympse is a fast, free and simple way to share your real-time location using GPS tracking, with any of your family, friends or co-workers! Send a Glympse to let friends and family know you are on your way. Request a Glympse from a colleague who is always running late. Set up a Glympse group for your family reunion. Those you share with can view your Glympse from any web-enabled device, no sign-up required!   Download Glympse today!App Features:+ Easy: no sign-up required+ Safe: your Glympse automatically expires+ Live: share location in real time with dynamic map+ Open: share with anyone – no app required to view+ Passive: runs in the background+ Global: works anywhere you have GPS and a data connectionUse Glympse to:+ coordinate a social night out with friends+ let your spouse know your ETA when you’ll be home from work+ let your family know you are safe while running or cycling+ find friends at a concert festival+ provide a courtesy notice with ETA to a client when stuck in traffic+ share a charity run route with followers on Facebook or Twitter+ direct emergency or roadside personnel to you quickly~~~ AWARDS & PRESS ~~~+ 2014 Webby Award Winner+ \"[Glympse] is one of those apps that’s ingenious in its simplicity, insanely handy to have around, and just a little bit fun to boot.\" – CNET Reviews+ \"Glympse: The Coolest Thing Your Smartphone Can Do\" – Fast Company+ Named one of \"15 Best Mobile Apps of 2011\" – Mashable• We LOVE TO HEAR FROM CUSTOMERS. If you have an issue or suggestion, please send us a note using the \"Send us Feedback\" feature in the app under Settings.",
    "descriptionHTML": "Glympse is a fast, free and simple way to share your real-time location using GPS tracking, with any of your family, friends or co-workers! <br><br>Send a Glympse to let friends and family know you are on your way. Request a Glympse from a colleague who is always running late. Set up a Glympse group for your family reunion. <br><br>Those you share with can view your Glympse from any web-enabled device, no sign-up required!   <br><br>Download Glympse today!<br><br>App Features:<br><br>+ Easy: no sign-up required<br>+ Safe: your Glympse automatically expires<br>+ Live: share location in real time with dynamic map<br>+ Open: share with anyone &#x2013; no app required to view<br>+ Passive: runs in the background<br>+ Global: works anywhere you have GPS and a data connection<br><br>Use Glympse to:<br>+ coordinate a social night out with friends<br>+ let your spouse know your ETA when you&#x2019;ll be home from work<br>+ let your family know you are safe while running or cycling<br>+ find friends at a concert festival<br>+ provide a courtesy notice with ETA to a client when stuck in traffic<br>+ share a charity run route with followers on Facebook or Twitter<br>+ direct emergency or roadside personnel to you quickly<br><br>~~~ AWARDS &amp; PRESS ~~~<br>+ 2014 Webby Award Winner<br>+ &quot;[Glympse] is one of those apps that&#x2019;s ingenious in its simplicity, insanely handy to have around, and just a little bit fun to boot.&quot; &#x2013; CNET Reviews<br>+ &quot;Glympse: The Coolest Thing Your Smartphone Can Do&quot; &#x2013; Fast Company<br>+ Named one of &quot;15 Best Mobile Apps of 2011&quot; &#x2013; Mashable<br><br>&#x2022; We LOVE TO HEAR FROM CUSTOMERS. If you have an issue or suggestion, please send us a note using the &quot;Send us Feedback&quot; feature in the app under Settings.",
    "histogram": {
        "1": 3241,
        "2": 2116,
        "3": 5836,
        "4": 21151,
        "5": 67227
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Xev1iEkh29C7KZugPTcxlsYdbT4pcA2aaeJOwX7OVUOLvclhERnciCdbnfKKl2HrkLA=h310",
        "//lh3.googleusercontent.com/dKm2mSjUlq1n9xlr3CSgLuqdiu2o-yBO8J_mZsL8WDQl9zjaLYkk_mDnak_juU7_jpU9=h310",
        "//lh3.googleusercontent.com/cyiNHl7FqOPk6wIdrxutbRvOPD8LZyoz93fdr4mxt6PKERRedg2oxbkTtJu7QOl0NazZ=h310",
        "//lh6.ggpht.com/jMyo7SL8N3dYDnHPItKntKatDya7BH3UYxIUmz4l_LU6l4fvJxLwctCMbFNMyNvHNw=h310",
        "//lh3.googleusercontent.com/S5IUAOubczKu58IFb0ov8xyExlLgtkvMeRfltnDhWiIbTooQYvKvAxTfuRLs50j831Y=h310",
        "//lh3.googleusercontent.com/3wtJzEPbya5xCBha9bKvdq2ZIV1WJ99deKoOmPLdxvKhR4tBeV1Sz9eyTOy_Qs_qhQ=h310",
        "//lh3.googleusercontent.com/BMqbZXvVxcKhN18x_WWClp0XAFEp-VzI0gVfuqtsxxkUwAoGWV2lQFF_yJpjzZPskDw=h310",
        "//lh3.googleusercontent.com/ZZ4PisLskJfexEv7sb8h1kKt2KLfzLtIdKjdyUH-gdkH4lo-Oo6VCrOmitNWIbUlnxo=h310",
        "//lh3.googleusercontent.com/1EW2C1TaEmoXA-iu-yB2vLwAc62TBkgta6sxEG6U4tHK9LRuQgvl80fOXhMHWk6cWw=h310",
        "//lh3.googleusercontent.com/tdfHTlVX9I00EH27RJ2rV80xxNNrLYTVzgfr9zk2GbtmfrUuqBdp-Uxn7VrTHLcimA=h310",
        "//lh3.googleusercontent.com/BfnbNqNWOrBAe-vHshrSuhsiHsH21-IeXC_JqFQNc2s9REW-QXjQbDeQfOKFs_w3dQ=h310"
    ],
    "comments": [
        "This helps allot because I have to take a cab an hour away from my house, especially with all these horror story's about cab/Lyft/Uber ect.,  drivers/passengers raping and killing. So it puts us at ease a bit. And it's shows where your exact location. This is also perfect if you have kids who have their own phone and you want to keep track of where they are are going.",
        "Swipe up control at bottom of screen doesn't drag up while tracking a Glympse. Or it eventually does but it takes a while trying -- Notification of a location share comes hours late, or usually just after I've stopped watching a user. -- And that has to be the ugliest widget in the Android universe.",
        "This app needs a HISTORY of the entire traveled route.  It leaves a icon to \"tap to view Glympse  history\" that shows nothing but the user's last location when the Glympse expired (ex. parked in the drive way).  It needs to leave the user's full PATH during the course of the Glympse session.  A 'history' showing where they finally stopped after hours of traveling is useless.",
        "I used this app when I drove home to visit from San Francisco to Omaha. Mostly so it wouldn't be hard to find my body when we crashed over a cliff. Thankfully it never came to that. But I was able to keep a live feed almost the whole time. Great app 👍👍",
        "Almost perfect - my wife and I use it frequently to track our separate journeys home.  The only downside is that it appears to keep running when the journey has finished, eating up resources.  I haven't found any way to exit cleanly and stop, so I have to force close the app in settings.",
        "Using this app while driving to send location and location provided was not accurate. Showed coming from tree line then sharp turn onto roadway while maintaining vehicle on roadway the entire time. Disappointed that while trying to confirm location, the app gave inaccurate information."
    ],
    "recentChanges": [
        "Smart Device Link update"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.glympse.android.glympse&hl=en&gl=us",
    "appId": "com.glympse.android.glympse"
}