{
    "title": "Craze - personalized event app",
    "summary": "Filter out the noise - your taste, your party!",
    "icon": "//lh3.googleusercontent.com/L3IaBaE3CXRGuzTl60q-jvBIytksyKsx1EcrSmAAjlkIg3XBw6WXe3a-Fy0IF0hZQho=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.2,
    "reviews": 157,
    "developer": "Clusterize",
    "developerId": "Clusterize",
    "developerEmail": "developer@getcraze.co",
    "developerWebsite": "http://www.getcraze.co",
    "updated": "November 9, 2015",
    "version": "2.08.3",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Filter out the noise – your taste, your party! Craze is your personalized event discovery app that brings you closer to the events you truly care about.Why Craze?• Discover events which match your interests• Be the first one to know what your favorite venues, event organizers and closest friends are up to• Score a ticket to the hottest events in town via our on-demand ticket systemCraze cuts the fluff and drops the nonsense. We enable you to create your own event agenda and show you only what’s relevant for you. Browse through our 19 event categories and see what makes you tick – parties, concerts, classes, tech meetups or perhaps something else?Need a ticket? When you see an awesome event you want to visit don’t go around on an exhausting ticket quest. Request a ticket via Craze and we’ll go find it for you! Let us do the work – the only thing left for you is to have fun!*********We’d love to hear your feedback! Feel free to send us your ideas for improving Craze by dropping us a line at support@getcraze.coFind us on:Facebook: https://www.facebook.com/GetCrazeAppTwitter: https://twitter.com/getcrazeapp*PLEASE NOTE: Facebook login is required to be able to use the app. This helps you discover more relevant events and guarantees a better user experience.",
    "descriptionHTML": "Filter out the noise &#x2013; your taste, your party! Craze is your personalized event discovery app that brings you closer to the events you truly care about.<br><br>Why Craze?<br><br>&#x2022; Discover events which match your interests<br>&#x2022; Be the first one to know what your favorite venues, event organizers and closest friends are up to<br>&#x2022; Score a ticket to the hottest events in town via our on-demand ticket system<br><br>Craze cuts the fluff and drops the nonsense. We enable you to create your own event agenda and show you only what&#x2019;s relevant for you. Browse through our 19 event categories and see what makes you tick &#x2013; parties, concerts, classes, tech meetups or perhaps something else?<br><br>Need a ticket? When you see an awesome event you want to visit don&#x2019;t go around on an exhausting ticket quest. Request a ticket via Craze and we&#x2019;ll go find it for you! Let us do the work &#x2013; the only thing left for you is to have fun!<br><br>*********<br><br>We&#x2019;d love to hear your feedback! Feel free to send us your ideas for improving Craze by dropping us a line at support@getcraze.co<br><br>Find us on:<br>Facebook: https://www.facebook.com/GetCrazeApp<br>Twitter: https://twitter.com/getcrazeapp<br><br>*PLEASE NOTE: Facebook login is required to be able to use the app. This helps you discover more relevant events and guarantees a better user experience.",
    "histogram": {
        "1": 18,
        "2": 3,
        "3": 15,
        "4": 13,
        "5": 108
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/T_J_giyqNG1RClD1MBFGOrdtwsWT49kDvYxtjshWPN-QgplMBEBuiLnsrV8YEnIj0w85=h310",
        "//lh3.googleusercontent.com/niapigvIL50tVlEM4d5n_iM5SNkVlYa4IcJB9Fg8R3UQN1XnuI5BRJDIzEkJpRkEgL8=h310",
        "//lh3.googleusercontent.com/S-sC5OuY_d9ze1UqgLM6FIdTBGZy5Wol7HLP-5KA_2RsEBD8jhA9JO51iSMJHZt1RKcu=h310",
        "//lh3.googleusercontent.com/ScnTy66MZrSsf7515HSCFB64kRNZT91mJqP9_lyhyazolKmuN3Q9lIoBnn55BVOs2g=h310",
        "//lh3.googleusercontent.com/iZ7MJc-bkDkquDnDMOjVDQ9TS-xI-Sn780DeMNgikkOH7o5i0qPRZbG3rgj0j449Hmo=h310",
        "//lh3.googleusercontent.com/8_LCLezmn4nCKdSNl9vOCbOOetrJmjBG-1rvVgYyS5PFMrnB0M9rh067qChJbvOfAovh=h310",
        "//lh3.googleusercontent.com/mNxFuW1FuLk3-EVX-DYjBL17sDgsuQu4yBsgApYSO0GwQGFIh8WR1aBqgLLUL_MeA4ko=h310",
        "//lh3.googleusercontent.com/930d8O-G2LBiZvFfAoaEVSnPSIhTlpRax9kEhcWZuZTH1GktisCMJySWuBxad0JU2e4=h310"
    ],
    "video": "https://www.youtube.com/embed/bKUf4FJdCo8",
    "comments": [
        "Removed All Events in a recent update Hey,  guys, in one of the recent events the app lost its functionality to show me ALL events for a given day. I don't want to be presented with only selected events, I want to check them all. The only way to do is to use the Explore and click on every single little icon on the map.. Am I missing something or is this functionality gone from the app? :/",
        "Can't login anymore Since recently i am asked to login with facebook. When I do that, a blank pop-up screen titled \"Confirm\" is the only thing presented.",
        "This stupid app rang at 2am, imagine?!",
        "This app is just what I need. I use it mainly to search for all events in given period. It works great!",
        "Login not possible Hi. Since recently I cannot login through facebook anymore.",
        "Много много полезна апликация"
    ],
    "recentChanges": [
        "- We have made it easier for you to discover high-quality events in Sofia and Amsterdam. You'll be able to see our lists of preselected events quite soon ;)",
        "- REWARDS! Get $$ that you can spend in the app by inviting your friends. They'll get money on joining and so will you once they purchase their first ticket ;)",
        "- You can now see the local trendsetters - follow them to discover the best events around you",
        "- We have prettified few small things.",
        "- Fixed: Multiple bugs and crashes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.clusterize.craze&hl=en&gl=us",
    "appId": "com.clusterize.craze"
}