{
    "title": "Google Play Music",
    "summary": "Discover and play millions of songs with the Google Play Music app",
    "icon": "//lh3.googleusercontent.com/gdBHEk-u3YRDtuCU3iDTQ52nZd1t4GPmldYaT26Jh6EhXgp1mlhQiuLFl4eXDAXzDig5=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000000,
    "maxInstalls": 5000000000,
    "score": 3.9,
    "reviews": 3266350,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "apps-help@google.com",
    "developerWebsite": "http://play.google.com/music/",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "size": "Varies with device",
    "description": "Google Play Music provides free, ad-supported radio for what you’re doing, how you’re feeling, or what you want to hear. Instantly start radio stations based on songs, artists, or albums, or browse by genre, mood, activity, decade, and more. Bring your own music collection with you by uploading 50,000 of your own songs; then listen to them across Android, iOS, and the web, for free.Subscribe to get on-demand access to millions of songs and download anything to listen even when you’re not connected - or sign up for the family plan on Android to provide access for up to six family members for one low price. Plus, subscriptions come with membership to YouTube Red, so you can enjoy YouTube ad-free, in the background, and offline.Free features:*Radio curated by experts for anything you want to hear*Store up to 50,000 songs from your personal music collection*Discover and subscribe to podcasts*Smart recommendations based on your taste*Listen on Android, iOS, and the webSubscription-only features:*New! The family plan, where up to six family members can enjoy Google Play Music for one low price.*On-demand access to over 35 million songs*YouTube Red membership (see www.youtube.com/red for details)*Download music to your device and listen when you’re not connected*Ad-free, uninterrupted listeningLearn where Google Play Music is available at https://support.google.com/googleplay/?p=availabilityLearn more about Google Play Music at https://play.google.com/music",
    "descriptionHTML": "Google Play Music provides free, ad-supported radio for what you&#x2019;re doing, how you&#x2019;re feeling, or what you want to hear. Instantly start radio stations based on songs, artists, or albums, or browse by genre, mood, activity, decade, and more. Bring your own music collection with you by uploading 50,000 of your own songs; then listen to them across Android, iOS, and the web, for free.<br><br>Subscribe to get on-demand access to millions of songs and download anything to listen even when you&#x2019;re not connected - or sign up for the family plan on Android to provide access for up to six family members for one low price. Plus, subscriptions come with membership to YouTube Red, so you can enjoy YouTube ad-free, in the background, and offline.<br><br>Free features:<br>*Radio curated by experts for anything you want to hear<br>*Store up to 50,000 songs from your personal music collection<br>*Discover and subscribe to podcasts<br>*Smart recommendations based on your taste<br>*Listen on Android, iOS, and the web<br><br>Subscription-only features:<br>*New! The family plan, where up to six family members can enjoy Google Play Music for one low price.<br>*On-demand access to over 35 million songs<br>*YouTube Red membership (see www.youtube.com/red for details)<br>*Download music to your device and listen when you&#x2019;re not connected<br>*Ad-free, uninterrupted listening<br><br>Learn where Google Play Music is available at https://support.google.com/googleplay/?p=availability<br><br>Learn more about Google Play Music at https://play.google.com/music",
    "histogram": {
        "1": 449208,
        "2": 168801,
        "3": 340133,
        "4": 517085,
        "5": 1791123
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/tgvPXMEuPouUzt3GvvmTgXVEM1JnRBgpPLCtmK55vW2z5ejFHKdb5jbWc5NoFSU-J_nD=h310",
        "//lh3.googleusercontent.com/YGiDQBLg2cQ8yQg_0mo66JKzZW0tEf0TB9pNGHYgI8phT8nw1oCCMEOFej-I3f5AcXs=h310",
        "//lh3.googleusercontent.com/rN_7UvXpGynIbtFZd74vnJb_ZCM3S9Phqy6IPWZupnoGI-Rl04C1Wtqkvjf0pmDv2xo=h310",
        "//lh3.googleusercontent.com/ynKh6yC3z-ye5xlsUPVAwcWpJlpG27AZLSrJQQgoB1WdKv54SzJMmbpYuS_h2Ysr2n8=h310",
        "//lh3.googleusercontent.com/ntrTaI5_8docI_1e8yMA0ia4-jlYhUvLr0cm56EHC_uRaD9h4TWFnR-qzkqH_0Gpdg=h310",
        "//lh3.googleusercontent.com/XfTAYc9SGmPc1y3fpxmTBfBCRHd16WIg4r0q1euAyU7EEPqHu6oEU3SZQs2Kko03zbI=h310",
        "//lh3.googleusercontent.com/Hkqfap3VGyk00Em7bPZLmghsCU8mck6NmpNi2LNhcattY_EYo9exbxF2sQffadbnMto=h310",
        "//lh3.googleusercontent.com/AJe1jTM3V5Rx8tTDAsTSBV5RR2PIzzqxZL7m8ixlsx0fQIWlFZ2lDurF6_N8hhDEC7SL=h310",
        "//lh3.googleusercontent.com/PH_SeSGrF_Sk9vU0RfKCsQNng-57ySB1LJw9zvMNGL-BKnsdWEaxRtA20f---93vRO4=h310",
        "//lh3.googleusercontent.com/I_DbZRIiChVBxXLBPH9GU77ZDgfqqJL5RLdPrTV2-5KFrxD9WivtmjMs9qH5LFC04KRP=h310",
        "//lh3.googleusercontent.com/_4IGfSba8Db5aM93c7B7O5psTklXWuaxwIvIGo9HB4V34d_wALMyrqBbQ8tgBt8ydMM=h310",
        "//lh3.googleusercontent.com/uUrL9HXDEmLdugqi2dEpp8mHlA3kC7zie9ejH7cpDBqBAqMRaGHUJ_VMUHWRnAKTYFk=h310"
    ],
    "comments": [
        "Long time Play Music subscriber strongly considering leaving. The Android Auto app is so bare bones that it isn't even funny. The contextually aware playlist suggestions , genre, activity, mood stations aren't available within the Android Auto version of the app. It's so bare bones that you wind up listening to the same music over and over again. Play Music offers great curated playlists. Please make them accessible to me in Android Auto and I'll be super happy and content. Thank you for your consideration!",
        "The whole Google Play Music environment needs more robust and reliable syncing and better handling of metadata. This app needs clear differentiation between uploads, purchases and subscription music in My Library, and filtering for searches. There have been many quirks with casting. Most get fixed eventually but it would be better if they didn’t keep appearing.",
        "It's pretty good but it loses my downloads all the time. This means a large portion of my monthly data allowance is used to constantly download the same songs when they should not have disappeared in the first place. This has been ongoing so long now that I believe they must have an arrangement with the phone company to make people have to buy more data than they should need to.",
        "No dark/black theme,  white always glaring me in the face,  especially at night.  No easy way to add music you like to library without navigating through menus.  No crossfading between tracks.   Uses a lot more data than Spotify,  so you'll burn through your plan in days,  what takes Spotify weeks.  And I'm not a fan of the thumbs up on the left.  Make it like Spotify with thumbs up on the right/thumbs down on the left.  Don't change things just to be different. Now even three stars is a stretch.",
        "1. Please include the option to add lyrics to the song, so that lyrics show up on screen when song plays.   2. make the sleep timer more accessible than being hidden in settings.   Besides that, this app is amazing ! I loved the experience. Please make these changes and I'll update my rating to 5",
        "I only use this to play music on sd card. But with recent update while music is playing (player on center of screen) and i try to drag down screen from top to adjust volume slider, player auto closes. This didnt happen with previous version. Fix this or just add volume slider in-app?"
    ],
    "recentChanges": [
        "v8.7.6773-1.A",
        "* Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.music&hl=en&gl=us",
    "appId": "com.google.android.music"
}