{
    "title": "ADAC Wanderführer 2017",
    "summary": "The new ADAC hiking 2017 shows you the most beautiful hiking trails",
    "icon": "//lh3.googleusercontent.com/YBBP5Eg0HMgDbx7MQal70XTVHygGDYQG8_DCmLwjPmlgcrj7EIMFENtIZbocAynj1g=w300",
    "price": "$6.14",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.5,
    "reviews": 29,
    "developer": "Outdooractive GmbH & Co. KG",
    "developerId": "7683034597171359137",
    "developerEmail": "verlag@adac.de",
    "developerWebsite": "http://www.adac.de/produkte/buecher_magazine/wander-app-iphone-android/default.aspx",
    "developerAddress": "Missener Straße 18, D-87509 Immenstadt",
    "updated": "January 12, 2018",
    "version": "1.9.13",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "ADAC Wanderführer Deutschland 2017Mit dem ADAC Wanderführer Deutschland 2017 haben Sie über 18.500 Wandertouren jederzeit parat: Ausführlich beschriebene, mit topographischen Karten und Navigation entlang der Strecke. Dazu kommt der integrierte Gipfelfinder und die Möglichkeit, auch individuelle Touren zu planen und aufzuzeichnen.Jede Tour ist mit einer ausführlichen Beschreibung wie z.B. aktuellen Wetterinfos vor Ort, Höhenprofil, Bildern sowie dem exakten Streckenverlauf auf der topographischen Karte im Maßstab 1:25.000 umfassend dargestellt. Sämtliche Toureninformationen inkl. Karte können Sie jederzeit downloaden und schon kann es komplett offline, also ohne Internetverbindung unterwegs, losgehen.Mit der Navigations-Funktion am Bildschirm oder auch sprachgeführt sind Sie dann unter freiem Himmel immer auf dem richtigen Weg, auf Wunsch auch mit Ihrer Smartwatch (Voraussetzung: Android Wear). Mit der Sortierung in verschiedene Kategorien wie allgemeine Wanderungen, Bergtouren, Themenwanderung etc. finden Sie garantiert eine Vielzahl von Anregungen für Ihren nächsten Wanderausflug. Ein Highlight für die Outdoor-Individualisten: Die freie Tourenplanung. Einfach auf der Karte Start- und Zielpunkte angeben und schon schlägt Ihnen der ADAC Wanderführer Deutschland 2017 eine zum Wandern geeignete Route vor. Weitere Optionen wie z.B. die Rundtourplanung bieten Ihnen immer wieder neue Möglichkeiten für Ihren nächsten Ausflug. Dazu kommt der integrierte Gipfelfinder (eine Augmented-Reality Anwendung zur Bestimmung der Berggipfel die vor Ihnen liegen), Favoritenfunktionen und die Möglichkeit, auch Ihre eigenen Touren aufzuzeichnen.Diese mehr als 18.500 Touren sind in der App enthalten:--------------------------------------------------------------------------------- ca. 14.800 Wandertouren- ca. 1.300 Fernwanderwege- ca. 1.600 Themenwege- ca. 800 BergtourenEin wichtiger Hinweis:Bei Nutzung der App im Hintergrund mit aktiviertem GPS-Empfang kann sich die Akkulaufzeit drastisch verkürzen.",
    "descriptionHTML": "ADAC Wanderf&#xFC;hrer Deutschland 2017<br><br>Mit dem ADAC Wanderf&#xFC;hrer Deutschland 2017 haben Sie &#xFC;ber 18.500 Wandertouren jederzeit parat: Ausf&#xFC;hrlich beschriebene, mit topographischen Karten und Navigation entlang der Strecke. Dazu kommt der integrierte Gipfelfinder und die M&#xF6;glichkeit, auch individuelle Touren zu planen und aufzuzeichnen.<br><br>Jede Tour ist mit einer ausf&#xFC;hrlichen Beschreibung wie z.B. aktuellen Wetterinfos vor Ort, H&#xF6;henprofil, Bildern sowie dem exakten Streckenverlauf auf der topographischen Karte im Ma&#xDF;stab 1:25.000 umfassend dargestellt. S&#xE4;mtliche Toureninformationen inkl. Karte k&#xF6;nnen Sie jederzeit downloaden und schon kann es komplett offline, also ohne Internetverbindung unterwegs, losgehen.<br><br>Mit der Navigations-Funktion am Bildschirm oder auch sprachgef&#xFC;hrt sind Sie dann unter freiem Himmel immer auf dem richtigen Weg, auf Wunsch auch mit Ihrer Smartwatch (Voraussetzung: Android Wear). Mit der Sortierung in verschiedene Kategorien wie allgemeine Wanderungen, Bergtouren, Themenwanderung etc. finden Sie garantiert eine Vielzahl von Anregungen f&#xFC;r Ihren n&#xE4;chsten Wanderausflug. <br><br>Ein Highlight f&#xFC;r die Outdoor-Individualisten: Die freie Tourenplanung. Einfach auf der Karte Start- und Zielpunkte angeben und schon schl&#xE4;gt Ihnen der ADAC Wanderf&#xFC;hrer Deutschland 2017 eine zum Wandern geeignete Route vor. Weitere Optionen wie z.B. die Rundtourplanung bieten Ihnen immer wieder neue M&#xF6;glichkeiten f&#xFC;r Ihren n&#xE4;chsten Ausflug. Dazu kommt der integrierte Gipfelfinder (eine Augmented-Reality Anwendung zur Bestimmung der Berggipfel die vor Ihnen liegen), Favoritenfunktionen und die M&#xF6;glichkeit, auch Ihre eigenen Touren aufzuzeichnen.<br><br>Diese mehr als 18.500 Touren sind in der App enthalten:<br>--------------------------------------------------------------------------------<br>- ca. 14.800 Wandertouren<br>- ca. 1.300 Fernwanderwege<br>- ca. 1.600 Themenwege<br>- ca. 800 Bergtouren<br><br>Ein wichtiger Hinweis:<br>Bei Nutzung der App im Hintergrund mit aktiviertem GPS-Empfang kann sich die Akkulaufzeit drastisch verk&#xFC;rzen.",
    "histogram": {
        "1": 0,
        "2": 2,
        "3": 1,
        "4": 7,
        "5": 19
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/K3IxqisIaPJj62qmrjfylXO9WvKf9eooLhjvc9N7kbnBD45_lNxMw_SnXy52CkOkNf9K=h310",
        "//lh3.googleusercontent.com/My_YS6cljjnz3HFKAnOmqzIHMMQbVgbLSB8ZaSKMe3Q81AQhvOyEqZ6YO9lefRNhX90=h310",
        "//lh3.googleusercontent.com/BbCUI4zfIq3OzR07Qay1CnRq--184MLDauLFyovv1exP0SmyjVPDYCQXkVqcL9T2msg=h310",
        "//lh3.googleusercontent.com/V1G2qJYyDIVy4wXNUvVbpz3INPt-kz0nIw5MTF8MyzQWxkxsmbcprA3ycUlOZDPlHH8=h310",
        "//lh3.googleusercontent.com/gzorYO8kF9iO-zPUJ9f0xLpDAyJb1dEtFUXvqtZM92Okd2TSsofUttASoIOyn0VOJ2hC=h310",
        "//lh3.googleusercontent.com/C6U37F9p-ZQ_3P5q1ia4BgMfhdtO2AvXpMI5ftGCZ00iVx6-biiL6JZCVGEol3kl-mRQ=h310"
    ],
    "comments": [
        "Maps are ok but the app does'nt allow you to switch from navi mode to route description mode and back again, without restarting the tour navigation.  This means that every time you switch modes, the trip odometer is reset to 0 and time remaining is set to total time estimate as if you are starting the trip from where ever you are on the route at that  time. If it's just down to me then ok, why not write a detailed user manual for this app so that we can use the app correctly?"
    ],
    "recentChanges": [
        "Wir haben einen Bug gefixed, der bei älteren Android Versionen zum Absturz führte."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.outdooractive.ADACWandern2016&hl=en&gl=us",
    "appId": "com.outdooractive.ADACWandern2016"
}