{
    "title": "Centrallo – Notes Lists Share",
    "summary": "Organize your life. Stay on track. Add checklists, notes, lists, photos &amp; share",
    "icon": "//lh3.googleusercontent.com/TSisUpSgJYPZcnuVtuywAoI33Atuxelg-6qgoYF2ns1KOGNt_rg7CLb_QiNeSM4upttZ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.9,
    "reviews": 497,
    "developer": "Centrallo",
    "developerId": "Centrallo",
    "developerEmail": "marketing@centrallo.com",
    "developerWebsite": "http://centrallo.com",
    "developerAddress": "54 W 40th St, New York, NY 10018",
    "updated": "July 4, 2017",
    "version": "2.18",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Centrallo –  Share Notes, Lists and more...Catch everything life throws at you with Centrallo. Perfect for organizing all of life’s little details, Centrallo is an elegantly simple organization tool perfect for anyone juggling life's details around work deadlines, family life, and everything in between. Create checklists, notes and lists, share them privately or post publicly, and create lists within lists to achieve ultimate productivity. Capture the buzz of a single day, keeping your brain open for thinking, not remembering.With Centrallo, you can:— Add notes, lists, photos, links and checklists into one, central location to organize and prioritize at your convenience — Prioritize what’s most important and set due dates to stay on track— Collaborate on projects with anyone, anywehre, across any device— Create list hierarchies to keep everything in order— Store photos, videos, voice notes and links— Quickly forward items to your free Centrallo email address— Centralize everything in one place— Drag and drop for simple navigationWhether you’re planning a business trip, a family getaway, a wedding or simply making a grocery list, Centrallo’s got you covered. Check out these other features Centrallo users love:— Synchronizes in real-time across devices, ensuring no detail falls through the cracks— Password protection keeps life’s most sensitive information secure— Free to download and available on all devices— A streamlined, user-friendly interface makes navigation effortless— Easily delete, check, star or share with a quick swipe — Anyone that receives a shared list can add and edit, taking collaboration to new heights— Quickly retrieve notes and lists with the search feature— Stay focused and productive by moving tasks to the “Priorities” tab— Create to-do lists— Keep voice notes handy and organized CENTRALLO PREMIUMCentrallo is free to download and use. With Centrallo Premium, achieve optimum organization with additional cloud storage and unlimited notes.  Centrallo offers two convenient auto-renew options:Monthly — $4.99 USD per month;Annual — $49.99 USD per year.Your subscription will be renewed automatically every month or year (depending on subscription) unless it’s cancelled 24 hours before the end of the subscription period. You may not cancel an active subscription.Catch everything life throws at you with Centrallo. Try it for free today!",
    "descriptionHTML": "Centrallo &#x2013;  Share Notes, Lists and more...<br><br>Catch everything life throws at you with Centrallo. Perfect for organizing all of life&#x2019;s little details, Centrallo is an elegantly simple organization tool perfect for anyone juggling life&apos;s details around work deadlines, family life, and everything in between. Create checklists, notes and lists, share them privately or post publicly, and create lists within lists to achieve ultimate productivity. Capture the buzz of a single day, keeping your brain open for thinking, not remembering.<br><br>With Centrallo, you can:<br><br>&#x2014; Add notes, lists, photos, links and checklists into one, central location to organize and prioritize at your convenience <br>&#x2014; Prioritize what&#x2019;s most important and set due dates to stay on track<br>&#x2014; Collaborate on projects with anyone, anywehre, across any device<br>&#x2014; Create list hierarchies to keep everything in order<br>&#x2014; Store photos, videos, voice notes and links<br>&#x2014; Quickly forward items to your free Centrallo email address<br>&#x2014; Centralize everything in one place<br>&#x2014; Drag and drop for simple navigation<br><br>Whether you&#x2019;re planning a business trip, a family getaway, a wedding or simply making a grocery list, Centrallo&#x2019;s got you covered. Check out these other features Centrallo users love:<br><br>&#x2014; Synchronizes in real-time across devices, ensuring no detail falls through the cracks<br>&#x2014; Password protection keeps life&#x2019;s most sensitive information secure<br>&#x2014; Free to download and available on all devices<br>&#x2014; A streamlined, user-friendly interface makes navigation effortless<br>&#x2014; Easily delete, check, star or share with a quick swipe <br>&#x2014; Anyone that receives a shared list can add and edit, taking collaboration to new heights<br>&#x2014; Quickly retrieve notes and lists with the search feature<br>&#x2014; Stay focused and productive by moving tasks to the &#x201C;Priorities&#x201D; tab<br>&#x2014; Create to-do lists<br>&#x2014; Keep voice notes handy and organized <br><br>CENTRALLO PREMIUM<br><br>Centrallo is free to download and use. With Centrallo Premium, achieve optimum organization with <br>additional cloud storage and unlimited notes.  Centrallo offers two convenient auto-renew options:<br><br>Monthly &#x2014; $4.99 USD per month;<br>Annual &#x2014; $49.99 USD per year.<br><br>Your subscription will be renewed automatically every month or year (depending on subscription) unless it&#x2019;s cancelled 24 hours before the end of the subscription period. You may not cancel an active subscription.<br><br>Catch everything life throws at you with Centrallo. Try it for free today!",
    "histogram": {
        "1": 59,
        "2": 30,
        "3": 51,
        "4": 101,
        "5": 256
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/eWyoVPJYG6bXJMT6mJUJvl4Z24R0Q9TuyjvE66J5PXdaoOWTm0BLnt2B4dQUGDJGsWM=h310",
        "//lh3.googleusercontent.com/qqgRhbYas8F18XtrIeK-fnlynJ89DpfoVB_n26YMkjwtF8M5YUqofjlP78-jI8EkSs4=h310",
        "//lh3.googleusercontent.com/1vFEuTJO7ic7cQbxVUeUWHiTxnAMmWkv3pYBkUWJ5oFG_SeharLHKOR_fsYACeC8Yg=h310",
        "//lh3.googleusercontent.com/0Tm_nmbRvkRWGn83OVz7vcxcb2o3rjvUTYFN4M3t9z0CTMm5gAzgKAn8Fex8PsX_mA=h310",
        "//lh3.googleusercontent.com/Q7uS1zXMe-_ljweRNcnFHVNr67KKN2jMs16VN9BsUiLwKUECR3BtRP2W2DdSgPCMrEM=h310",
        "//lh3.googleusercontent.com/x_eSmSkgmuKh8_cTk8OwTLCkYDzHnL6pJRi__DuXQWmrmkFiHwVcCf0gJJAyY1uwAXQ=h310",
        "//lh3.googleusercontent.com/uUCU2fzlAOSkZ_Wv_8pIRBeI1gC_Tt7FzgzrxmIwW5CY74Wu6rvm7so-frglAR0oyyZr=h310",
        "//lh3.googleusercontent.com/L168Bw4x3qpwONYRjh25BgQf2PfJ43rQ92wv0zCqXnhVwTZcHDsLGnQPJKFH-QQxFFwZ=h310",
        "//lh3.googleusercontent.com/PR9ime-wIyZzgEdKzj1xa0Vwg_w5dHCCtetvX-WmWwr8cdgtIZa2c5GQiDQYmdDa3BOP=h310",
        "//lh3.googleusercontent.com/dNgtTkyh7R1BLJOTP8sdfJqza86in6STF2YgDcBz4R31uAlIaK6PEVT_nSSNpi81NZo=h310",
        "//lh3.googleusercontent.com/F9qnKJKGexROXKAkyNlUaRVve-6oBILzqiI8mys44OGwXO0vGk3puT0TLGP91vT2ED9e=h310",
        "//lh3.googleusercontent.com/k__dM9N1I0D5N9oKFQRl-mHTxlLRQUXWmHzZKBhX3-wqHIcS-pG58LPdIYw4LKavYcM=h310",
        "//lh3.googleusercontent.com/aIsLQ2EmjoET4yNp5xz3NcAhlqSnYr_v69agb9fCkj-9NSY801jkpMDR6BsRBFxUFBc=h310",
        "//lh3.googleusercontent.com/BZ0V6eSydWHXBitM2GKwE5RCU0tE-7kaUH3eaeeAsJNYDaytsvDSVrCxGovlG-MHdP0=h310",
        "//lh3.googleusercontent.com/NezQY61LARiXsIKxEcWKsiVIXTNUkBxTOM1P75gvO9Doi0EWTF2x3TMPOz2fkaXzXb8=h310",
        "//lh3.googleusercontent.com/M50YFFI3_y8rziIiHacV_Jq6vva0m-ffZSdVOZD8ogtPvgXIOfmNDoPWIIkx3cq6AOw=h310",
        "//lh3.googleusercontent.com/9Cth7Mb9JoXtda4k89HlwcEd6mtVwD1uoiMN9pNpUdxx4qgdJ8LPEVTRBYCNe2T4_Xos=h310",
        "//lh3.googleusercontent.com/_-5ieWhS1K-WFlHFL9TO-FA6FJhnYidtJTdHNWtyjRYTsXchVDF6juF7v6kt_XMWzQ=h310",
        "//lh3.googleusercontent.com/Z_kxDrJzer4CGdZa36xoWkKsGfg5Hr3DDae6dT4guquethGN8Pq7Eyz00U_7bKm2_AE=h310",
        "//lh3.googleusercontent.com/74uphWO-b6ppFM2XTSchvv_q6X0VCxMBjAPubDX5yWxtxoCacCU8xC9S8dSQKFTjO0k=h310",
        "//lh3.googleusercontent.com/9UEybDeGW_Fso2XXAOT4Iwl-IiWioVOv2m8WYNx4XECxoXjNO8tn8QMikrl8HFml8A=h310",
        "//lh3.googleusercontent.com/vJrK1vr0GO9s4elLLRFnqbB9lqqiqkGJW4RPS7eRIj5E26XLpCgYEWEcyUcZmYxMrshP=h310"
    ],
    "comments": [
        "I think it should undergo real development.  I shared with my contact and it shares the word 'false' to everyone. Damn",
        "Can't create an account due to a server error :/",
        "Want to use this but the UI Incomplete &lt;/3",
        "Installed. Met a bug. Deleted.",
        "Can not save anything ... discard changes and quit? ... and now has \"stopped\" ... ZERO not one star ... ZERO confirmed ... DOESN'T save ... still can NOT save ... top bar does NOT work ... still MINUS not zero",
        "Glitches Why did you change the status bar drawing method?? Now it's always black with a weird overlayed black thingy over the colored header when scrolling."
    ],
    "recentChanges": [
        "— Bug fixes",
        "We listen to our users so please make suggestions at feedback@centrallo.com."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.centrallo.android&hl=en&gl=us",
    "appId": "com.centrallo.android"
}