{
    "title": "Call Auto Answer & ReadItToMe",
    "summary": "Auto answer calls from your auto answer list, true hands free call control.",
    "icon": "//lh3.googleusercontent.com/3dgqSmpkW453IWxoyovzSQUuzaSnhq9ESoIp89Wzs--w8GZ819HUTGEzMos1la9FfBU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.2,
    "reviews": 945,
    "developer": "GreyThinker",
    "developerId": "GreyThinker",
    "developerEmail": "support@a0softus.com",
    "developerWebsite": "http://www.a0softus.com",
    "developerAddress": "Chicago, Illinois",
    "updated": "June 3, 2016",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Help us to translate the app to your language: http://goo.gl/SBSNI8 , thank you.New Feature:  Read incoming phone number or caller ID and incoming SMS.! Please do NOT forget to build your auto answer list, only numbers on the list will be auto answered.Ever want to let the phone answers the call automatically when you are driving, or riding a bicycle, or busy doing something with both hands, or simply don't want to press that little button because your hands are dirty, then this app is for you.This App does only one thing and it does it well, it auto answers your calls for you so now it can truly be called \"hands-free\".  Even more, it can also detect that a Bluetooth hands-free device is connected and automatically enable the auto answer, then disable auto answer when the Bluetooth device is disconnected.This App is specifically designed for Kitkat (Android 4.4),  Lollipop (Android 5.0) and above versions, auto answer will work just fine on your phones running Kitkat , Lollipop or above Android versions. But it won't just automatically answer all calls, you have full control of it by building a trusted list of numbers , and the app will only auto answer calls from those trusted numbers. Building the list is simple and easy, you can pull numbers directly from your phone's contact or call log or type it manually.It also has a set of options that you can configure to better  manage your calls: Wired headset control:  Automatically turn on the auto answer when a wired headset is connected, and turn off the auto answer when it is disconnected. Delay before answer:  set a delay timer before calls are auto answered so you have a chance to look at the number. Turn On Speakerphone:  Automatically turn on the speakerphone when answering the call. Check Bluetooth:  Automatically route the audio to your Bluetooth headset if there is one connected. Check Wired Headset:  Automatically route the audio to your wired headset if there is one connected.It also provides three different ways for you to turn on or off the auto answer quickly and easily: On/Off Switch:  there is an on/off switch in the app.  Widget:  add the auto answer widget to your phone's home screen and use that to turn on or off the auto answer. Smart Watch:  This app also supports smart watch and will install an on/off button on your smart watch so you can turn on or off the auto answer from it.  Notification: A notification can be displayed on the notification bar to let your know auto answer is on.You can also change the App theme and set your favorite color in the settings.This version of the app is free for you to use, but you can only add up to 5 numbers in the auto answer list. If the app works well, please consider upgrading to include advanced features. We appreciate your support to our development effort. By upgrading you'll be able to :Add unlimited numbers in the auto answer listAdd Google contact groups to the auto answer listAutomatically turn on/off auto answer when a Bluetooth headset is connected/disconnectedOption to auto answer all contacts on your phone Option to auto answer all callsNo Ad",
    "descriptionHTML": "Help us to translate the app to your language: http://goo.gl/SBSNI8 , thank you.<br><b>New Feature: </b> Read incoming phone number or caller ID and incoming SMS.<br><br>! Please do NOT forget to build your auto answer list, only numbers on the list will be auto answered.<br><br>Ever want to let the phone answers the call automatically when you are driving, or riding a bicycle, or busy doing something with both hands, or simply don&apos;t want to press that little button because your hands are dirty, then this app is for you.<br><br>This App does only one thing and it does it well, it auto answers your calls for you so now it can truly be called &quot;hands-free&quot;.  <br><br>Even more, it can also detect that a Bluetooth hands-free device is connected and automatically enable the auto answer, then disable auto answer when the Bluetooth device is disconnected.<br><br>This App is specifically designed for Kitkat (Android 4.4),  Lollipop (Android 5.0) and above versions, auto answer will work just fine on your phones running Kitkat , Lollipop or above Android versions.<br> <br>But it won&apos;t just automatically answer all calls, you have full control of it by building a trusted list of numbers , and the app will only auto answer calls from those trusted numbers. Building the list is simple and easy, you can pull numbers directly from your phone&apos;s contact or call log or type it manually.<br><br>It also has a set of options that you can configure to better  manage your calls:<br><b> Wired headset control: </b> Automatically turn on the auto answer when a wired headset is connected, and turn off the auto answer when it is disconnected.<br><b> Delay before answer: </b> set a delay timer before calls are auto answered so you have a chance to look at the number.<br><b> Turn On Speakerphone: </b> Automatically turn on the speakerphone when answering the call.<br><b> Check Bluetooth: </b> Automatically route the audio to your Bluetooth headset if there is one connected.<br><b> Check Wired Headset: </b> Automatically route the audio to your wired headset if there is one connected.<br><br>It also provides three different ways for you to turn on or off the auto answer quickly and easily:<br><b> On/Off Switch: </b> there is an on/off switch in the app. <br><b> Widget: </b> add the auto answer widget to your phone&apos;s home screen and use that to turn on or off the auto answer.<br><b> Smart Watch: </b> This app also supports smart watch and will install an on/off button on your smart watch so you can turn on or off the auto answer from it. <br><b> Notification: </b>A notification can be displayed on the notification bar to let your know auto answer is on.<br><br>You can also change the App theme and set your favorite color in the settings.<br><br>This version of the app is free for you to use, but you can only add up to 5 numbers in the auto answer list. If the app works well, please consider upgrading to include advanced features. We appreciate your support to our development effort. <br>By upgrading you&apos;ll be able to :<br><b>Add unlimited numbers in the auto answer list</b><br><b>Add Google contact groups to the auto answer list</b><br><b>Automatically turn on/off auto answer when a Bluetooth headset is connected/disconnected</b><br><b>Option to auto answer all contacts on your phone </b><br><b>Option to auto answer all calls</b><br><b>No Ad</b>",
    "histogram": {
        "1": 345,
        "2": 50,
        "3": 67,
        "4": 76,
        "5": 407
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/AnPknJR-TnWSla9caAZxtgtB6NI3rKaE_ITnfKBajDBG_08LBGFJ-TkOWh3jEt6Ix_g=h310",
        "//lh3.googleusercontent.com/8SvDq-ycuIfl-gjR2q5xTkqLuJ8EYH8uU3Z9b5gO16h6dd_vwPXkfQKKlfqwjtTFKhJc=h310",
        "//lh3.googleusercontent.com/A-J9IINZnimDNAbNvXeLpby9wPpq0BsRkUgoHX9SRwL5G8DwegshUCxvDQNOTtIhNQ=h310",
        "//lh3.googleusercontent.com/upd9lidqukRG8FIWTbrUBcl0TwIpIQit6rzI1U1dwimo2CkzjvfyL4FwNLqZRnMJAA=h310",
        "//lh3.googleusercontent.com/qr9eAJ2J5FAdZOGQlEpxICTpUxbU_3VwD2PdqwIK1EoYPLhHVnyMk61CtzrwlnDw6A=h310",
        "//lh3.googleusercontent.com/xqv_ivTUbZzkNa5gDuKYWoUcgpIBSZd1XpdW-Bt4NnofrsnKzfMcu9qg43x4_soZ1XA=h310",
        "//lh3.googleusercontent.com/nx-pc4wdFzhA7pvbMbD6Zcwq-IiV6PrjRmIQ3EaFWBzEx9YJhOgRbGXrSIATtgqFr-4=h310",
        "//lh3.googleusercontent.com/gpWiknEpv_QU5I91wpHkEC_JSxW6wLMXbcAzishYVvzl9iMJ_D9ThVgFrDO4y_TpRFY=h310",
        "//lh3.googleusercontent.com/5Cs6gFuQVsASp7DiopYLtVYy9RQFbADUv7UK7wl-WYVfsvcnQ24XixQahGmR-l28uA=h310",
        "//lh3.googleusercontent.com/HLdIt0N2A8mSgruLUHKy9IdcHMGmzw-DvQ33VVHOrLVTDv4VgMSi5BmB2Nh61FGRTpA=h310",
        "//lh3.googleusercontent.com/JN1cy_8aW5KizGm8BRSqbXYQcAXiO-9wV3NPrILSmCz3ohnKDtura2Z8U3Cr6Qy6yA=h310",
        "//lh3.googleusercontent.com/0_jZWcC4hXz4d_7ditdjXpXf1qFUx34LOX_2NGEe71aQNwytcZxDbiG_crHXSmLaiw=h310"
    ],
    "comments": [
        "Sometimes works, sometimes doesn't. The widget is not working. Or rarely working. Too bad when I want to change the \"on & off\" status on the fly. There are other apps that do the same thing and they do work. This one here is not even available for galaxy S4. I do switch phones. So I would prefer the same app for all my devices",
        "This app doesn't work. Doesn't work . I had added just 2 numbers. Failed to answer both. Those were company calls which have to be picked without delay. Doesn't work you suck. Developers you suck. App creators you suck. What's use of this even being here. It dint work after filtering and using all features.  This app doesn't work . This app doesn't work. This app doesn't work.",
        "Pay first then try? Attention!! You have to pay $1 for every single function you want to add.  Never saw a bigger rip off on play store than this one. You want to me to pay first before I even can try if it works? If it doesn't I probably won't see the $1 again. If you have a trial version come back again. In the meantime I uninstall.",
        "Completely useless app. It didn't answer the call on my lg spirit h442, lenovo k3 note, Sony T2 Ultra dual sim and now on my oppo f3. God knows which phone it will work. keeps ringing and then shows a missed call. Money wasted. Better to find a phone with built-in auto answer like Xiaomi, Samsung etc.",
        "Great app! Have tried many auto answer calling apps in play store.. none of them is working properly since lollipop version....This app doing the job... Great work developers....Keep going😃... Purchase version is also fine....",
        "Was a great app but no longer functioning and no response from support. Probably taken out by android security updates. Giving up on this one and can't find a similar one.   Best app on my phone. Absolutely essential and every phone should come out of the box with these features. My old Galaxy S2 did but not the new Sony Xperia5. So glad I found this app. Best couple of dollars I've ever spent to get my phone usable hands free on car Bluetooth or with headset."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.a0softus.autoanswer&hl=en&gl=us",
    "appId": "com.a0softus.autoanswer"
}