{
    "title": "Google Fit - Fitness Tracking",
    "summary": "Step up your fitness. Stay aware and motivated with Google Fit.",
    "icon": "//lh4.ggpht.com/2PnWIlqNE5ZHwTpNdRBhViSOVBzRIeR4ezAisGyjrqWPiyRcSkm9RCpRBYg7lLvrMA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 3.9,
    "reviews": 238001,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "apps-help@google.com",
    "developerWebsite": "http://www.android.com/",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "February 14, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "• Effortlessly track any activity. As you walk, run, or cycle throughout the day, your phone or Android Wear watch automatically logs them with Google Fit. • Get instant insights. See real-time stats for your runs, walks, and rides. Google Fit will record your speed, pace, route, elevation, and more so you can stay motivated and on track. • Reach your fitness goals. Set goals based on steps, time, distance, calories burned. Receive personalized recommendations and coaching for activity goals. • Measure your wellness. Aggregates info from other apps to track fitness, nutrition, sleep, and weight: Android Wear, Nike+, Runkeeper, Strava, MyFitnessPal, Lifesum, Basis, Sleep as Android, Withings, and Xiaomi Mi bands. • Check in from anywhere. Track your progress from your phone, tablet, the web (fit.google.com) and even your Android Wear watch.",
    "descriptionHTML": "&#x2022; Effortlessly track any activity. As you walk, run, or cycle throughout the day, your phone or Android Wear watch automatically logs them with Google Fit.<br> &#x2022; Get instant insights. See real-time stats for your runs, walks, and rides. Google Fit will record your speed, pace, route, elevation, and more so you can stay motivated and on track.<br> &#x2022; Reach your fitness goals. Set goals based on steps, time, distance, calories burned. Receive personalized recommendations and coaching for activity goals.<br> &#x2022; Measure your wellness. Aggregates info from other apps to track fitness, nutrition, sleep, and weight: Android Wear, Nike+, Runkeeper, Strava, MyFitnessPal, Lifesum, Basis, Sleep as Android, Withings, and Xiaomi Mi bands.<br> &#x2022; Check in from anywhere. Track your progress from your phone, tablet, the web (<a href=\"https://www.google.com/url?q=https://fit.google.com&amp;sa=D&amp;usg=AFQjCNHeY8V04ZqlV3T_sgZU2PhaRnnb_g\" target=\"_blank\">fit.google.com</a>) and even your Android Wear watch.",
    "histogram": {
        "1": 23043,
        "2": 16067,
        "3": 29989,
        "4": 57353,
        "5": 111549
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/TOjTikSLd0oYxzmcfpORtpbA_hWjrvfLsdQuKN9rfDm-SmB1y3V1V3QYhVfu18HJ=h310",
        "//lh3.googleusercontent.com/Us3812RyCazWf0jPpBCuXvvfXKCYOxMkCnVaW00mroSXGZ3Si4myw00TqsPNL3m-TxI=h310",
        "//lh3.googleusercontent.com/vKu6WsV1fZxkP1OXEdC-u6724urcNn6npQ19eyUooVBk1m21W8tPmmrlWmZn5imsZNg-=h310",
        "//lh3.googleusercontent.com/2bnezWWJZIOSngQuKgQqtuzwh-jCIy_vjz4JWKfMqdC5U2VeP8l1k2Nfbl3sFBb7XbY=h310",
        "//lh3.googleusercontent.com/jI3jYiBCaflugXZDo5NRy2Q4rJ0ccT8XVdQBqDaHUMiwsXsNmLsjPWFrQnVvLvmuqw=h310",
        "//lh3.googleusercontent.com/_h8rbULQ3oQt4hahmdg80G-30EBlwMkZPtnqyOvb01fk7SXCgUaRpHdzQE1Pn6B_yj4=h310",
        "//lh3.googleusercontent.com/2_VTBvaTdkpAmqH6E9DAjrXYWnjMhPlByTQgNTZaiI9VwTNi56RgwqxIvndJKsdX_Wc=h310",
        "//lh3.googleusercontent.com/LJuDyfiFgdRPY-JRr2Ni9LCysZWZk4021iHj5t2uTzTDX6ZdezMIzktqE9LkszYMTpCa=h310",
        "//lh3.googleusercontent.com/pX2UV2awgSrAVMmFNb4XBFpIV1sd1AAoeVUObhl6VsDcnfUonZF_2yr808k7LMja92I=h310",
        "//lh3.googleusercontent.com/WbYl1zFYAXrK-clD95OHqSviiL2zeU3MAxGgg9ZgDUBH7jCrBvjL5wqbNFLvD41loTI=h310",
        "//lh3.googleusercontent.com/EQvHytWcnyBHED3BooJG3dRlCe7_E42ZBzXjFMWthadtp__tpDVEKox3xASYkt7I-A=h310",
        "//lh3.googleusercontent.com/EZzeIHlKM6hFsOMo8sUboKJ4xNgnTlPoSKmg_98oaUl7GY2ieSwfUDWSuUlxrUWYUKA=h310",
        "//lh3.googleusercontent.com/IFuNDOYhJpmXExZSVhvn3IS5PNMSgeB9OHdJ18mRvYVwO_VFsR2kh4RqenIXQhye3lc=h310"
    ],
    "comments": [
        "App does not sync steps and other health data from android wear to phone app but instead records data separately on the app and on the watch (ticwatch e). There is no way to force a manual sync for real time data either. Wanting to pair with my fitness pal like I did with my fitbit charge but doesn't work anywhere near as good. Expect much better from Google's own apps and software working together.",
        "I have this app on my an Android Wear watch and my phone.  I was under the impression it would work some what like Fitbit. Wrong. This app does not sync properly between multiple devices. It is like the app on my watch and the app on my phone operate independently even though it is the same account on both. And don't even bother with customer service/support. There is a lot of potential, but unfortunately it needs a lot of work. Overall I'm very disappointed.",
        "This app is hideously inaccurate. It is danger for your health. Different numbers on watch, different on fit site, different on phone. It syncs random numbers. A lot of crashes on watch and incossisent battery consumption. It is now 2 years with zero fixes only changes to aesthetics of UI.",
        "After writing my initial review, I've done some pondering, and my opinion of Google Fit has kinda done a 180. The point of this app is to be a central hub with really really good activity logging built in. Nutrition logging and pre-made workouts isn't the point - the point is to bring all those services that other developers do better and to put a central focus on goals. I love how I can connect all the services I love to one app, and look and have a quick glance of my day. Despite this, there are some things I would like. A health coach would be nice, especially with Google's Machine learning, some mild sleep tracking would be nice, but not important. What I'd really like is a deeper dive into my Fit-created data such as the ability to tab on my goals and get a more comprehensive breakdown, but it still does its job as a data hub really well.",
        "What a joke this app is. Data on phone doesn't match on watch or online, according to online and watch i've done 0 steps, yet on phone it shows 16K, if I check different app on watch it shows 16K, but not GF it says 0 - online it shows done x amount of walking, while on my phone it shows only 1/4 of the figure and on watch 0. this app can't be relied on as the data is so incorrect. if it wasn't for runtastic or huawei health I wouldn't be able to see my data correctly. JUST A TOTAL JOKE THIS APP",
        "Love the app but would be cool if you could add friends and compete against them or other Google Fit users in your area. I find myself being more motivated when I can compete against someone else. Hopefully you add this soon."
    ],
    "recentChanges": [
        "• Heart rate chart in workout summaries on Android Wear",
        "• Enhanced workout list for Android Wear with easier access to your favorites and support for more workout types",
        "• New settings menu lets you set up audio announcements and display density before you start your workout on Android Wear",
        "• Minor UI improvements and bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.apps.fitness&hl=en&gl=us",
    "appId": "com.google.android.apps.fitness"
}