{
    "title": "V1 Pro",
    "summary": "The V1 Pro app is for instructors that have an active Branded Academy.",
    "icon": "//lh3.googleusercontent.com/FsvjBKKwJW1UwCmBvneEtOOvONGPFYeoCdGrRSgRrA4ZH6nPcVISMW5XWcBD4QePt3g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.3,
    "reviews": 174,
    "developer": "V1 Sports",
    "developerId": "V1+Sports",
    "developerEmail": "support@ifrontiers.com",
    "developerWebsite": "https://v1sports.com/",
    "developerAddress": "V1 Sports\n201 S. Main St., Ste 400\nAttn: Android Apps\nAnn Arbor, Michigan 48104\nUSA",
    "updated": "January 18, 2018",
    "version": "1.2.24",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "Deliver better lessons. The V1 Pro App is a flexible solution for Golf Instructors looking to capture, analyze, and deliver video lessons anywhere, anytime. Join the 6,000+ instructors around the world who teach with V1 Pro.  IMPORTANT: To use the V1 Pro app you must have an active Branded or Mobile Academy login. If you are a Branded Academy Instructor and are having trouble logging in, please contact us.   VIDEO LESSONS: Create recorded video lessons with voice-over analysis, telestration, and dual video comparisonAccess complete HD model swing library (New models added monthly)Send recorded video lessons directly to students via text or emailReceive videos from students who use the V1 Golf App Store student contact information and swing videos to track progress and communication VIDEO CAPTURE & ANALYSIS TOOLS: Import video from Gallery Accelerate, trim, & edit videosPlayback in slow motion and frame-by-frameDrawing tools to measure and highlight formAngle measurement toolZoom in to see detailCompare two videos in slow motion and frame-by-frameOverlay two videos for more precise comparisonUnlimited cloud storage for videos and lessonsFlip videos to show right or left handed viewShare videos on social media and via email TESTIMONIALS: “V1 has been the key tool to what we do day in and day out for our lessons.” - John Webster, PGA Teaching Professional“It is a relationship builder.” - Jimmy Tirone, PGA Teaching Professional",
    "descriptionHTML": "Deliver better lessons. The V1 Pro App is a flexible solution for Golf Instructors looking to capture, analyze, and deliver video lessons anywhere, anytime. Join the 6,000+ instructors around the world who teach with V1 Pro. <br> <br>IMPORTANT: To use the V1 Pro app you must have an active Branded or Mobile Academy login. If you are a Branded Academy Instructor and are having trouble logging in, please contact us. <br> <br> <br>VIDEO LESSONS: <br>Create recorded video lessons with voice-over analysis, telestration, and dual video comparison<br>Access complete HD model swing library (New models added monthly)<br>Send recorded video lessons directly to students via text or email<br>Receive videos from students who use the V1 Golf App <br>Store student contact information and swing videos to track progress and communication<br> <br>VIDEO CAPTURE &amp; ANALYSIS TOOLS: <br>Import video from Gallery <br>Accelerate, trim, &amp; edit videos<br>Playback in slow motion and frame-by-frame<br>Drawing tools to measure and highlight form<br>Angle measurement tool<br>Zoom in to see detail<br>Compare two videos in slow motion and frame-by-frame<br>Overlay two videos for more precise comparison<br>Unlimited cloud storage for videos and lessons<br>Flip videos to show right or left handed view<br>Share videos on social media and via email<br> <br>TESTIMONIALS: <br>&#x201C;V1 has been the key tool to what we do day in and day out for our lessons.&#x201D; - John Webster, PGA Teaching Professional<br><br>&#x201C;It is a relationship builder.&#x201D; - Jimmy Tirone, PGA Teaching Professional",
    "histogram": {
        "1": 16,
        "2": 5,
        "3": 7,
        "4": 35,
        "5": 111
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/k8lPhk1yf_W8pgoh5nlc_g0ZZXgO1MZd5y34hnojTnd41ZmALX9kx1OyyT4ftvZd0jE=h310",
        "//lh3.googleusercontent.com/WSvR8w8u_7y6-WVSNGyLyqeS1wo-LlQjefq4-8dwlaJW7F0nB23OOKiI2m9CHsITtQ=h310",
        "//lh3.googleusercontent.com/bQzysAwcqKkW5S5vFGFRh_0SFyenuJhRWp8Te9pgtngdQ1d-M2mV-BWtEFs3Qd_uEEYX=h310",
        "//lh3.googleusercontent.com/788RsgMwOwoO-uA_VqL7o9M3AUcQgQZ4bpzyTTLKTnmucLg_Lk3Zu2FA63LwX9gPeMU=h310",
        "//lh3.googleusercontent.com/4x8j7a3JM5t4edVQ4rzlqkOcc9H0pgGJikddEpnduIomi0T5nuxtrwvXgwr9P3XTKJK7=h310"
    ],
    "comments": [
        "It doesn't let me create an account. It gets into a loop",
        "Bait and switch. Lame",
        "PGA Certified Professional",
        "Too much I was really excited to download this app..once I did, I found out that I would need to create an account that costs $100mo just to use the app...disappointment",
        "Nice app",
        "Great job! I've been waiting for the Android version of the pro app. Looks great and working well on my phone and Nexus 7!"
    ],
    "recentChanges": [
        "Description Lengths Limited",
        "Minor Bug Fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.v1.v1pro&hl=en&gl=us",
    "appId": "com.v1.v1pro"
}