{
    "title": "Todoist: To-do lists for task management & errands",
    "summary": "Stress less about getting things done. Create your task list &amp; accomplish more.",
    "icon": "//lh3.googleusercontent.com/qW5UpOFYLQRJ7jz_kUkHv6XXHQe_bldMLKD7dlXrwqgWD_H89KXMsCgng_9pcrTqaA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.5,
    "reviews": 147187,
    "developer": "Doist",
    "developerId": "6748661820728732000",
    "developerEmail": "support@todoist.com",
    "developerWebsite": "http://todoist.com/android",
    "developerAddress": "Doist\n201 Mission Street, Suite 1200\nSan Francisco, CA 94105\nUSA",
    "updated": "February 8, 2018",
    "version": "12.6",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Life can feel overwhelming. But it doesn’t have to. With Todoist, you can keep track of everything – from simple errands like grocery shopping, to your most ambitious projects – so you can start getting things done and enjoy more peace-of-mind along the way.When you don’t have to worry about forgetting to-dos, you’ll feel more calm, in control and motivated to accomplish your goals. Todoist helps get all your tasks and thoughts out of your head and onto your to-do list anytime, anywhere, with real-time sync on all of your favorite devices – including your Android phone, tablet, desktop and web browser. Even when you’re offline. ❝Todoist is the best to-do list app right now. It’s available on virtually any platform you can think of. It’s clean, fast, easy to use and makes accomplishing tasks on your to-do list lightning-fast.❞ - The VergeWith Todoist, you can: ▸ Capture and organize tasks into your to-do list the moment they pop into your head. For example, simply write a task like “water the plants every Thursday at 9AM #errands” and Todoist will automatically set a task and reminder for every Thursday at 9:00AM in your “errands” project. ▸ Remember important deadlines and build lasting habits with powerful recurring due dates like \"every second Monday.\"▸ Free up mental space by delegating tasks and errands to people in your shared projects.▸ Highlight your day’s most important activities with color-coded priority levels.▸ See an overview of your daily and weekly accomplishments with beautifully customized productivity graphs.You can make Todoist your central, organized task management hub for getting things done with access to 60+ popular app integrations like Dropbox, Amazon Alexa, Zapier, IFTTT, and Slack. Even teams and small businesses can get more out of task management with Todoist. From stand-alone tasks to multi-phase projects, Todoist’s Business version gives your team a clear overview of everything that needs to get done on every platform, with real-time sync.Todoist is free forever with the option to upgrade to Todoist Premium. With Todoist Premium, you’ll enjoy unlimited access to powerful task management features that’ll help you accomplish your goals faster while feeling confident and in control. ❝Todoist is a powerful to-do list app that can do pretty much whatever you need it to do.❞ - Android Authority At the end of the day, you can rest, relax and recharge for tomorrow with the peace-of-mind of knowing that your task management is 100% organized and accounted for. Join over 10 million people who rely on Todoist for getting things done and who feel more calm and in control of their lives.",
    "descriptionHTML": "Life can feel overwhelming. But it doesn&#x2019;t have to. <br><br>With Todoist, you can keep track of everything &#x2013; from simple errands like grocery shopping, to your most ambitious projects &#x2013; so you can start getting things done and enjoy more peace-of-mind along the way.<br><br>When you don&#x2019;t have to worry about forgetting to-dos, you&#x2019;ll feel more calm, in control and motivated to accomplish your goals. <br><br>Todoist helps get all your tasks and thoughts out of your head and onto your to-do list anytime, anywhere, with real-time sync on all of your favorite devices &#x2013; including your Android phone, tablet, desktop and web browser. Even when you&#x2019;re offline. <br><br>&#x275D;Todoist is the best to-do list app right now. It&#x2019;s available on virtually any platform you can think of. It&#x2019;s clean, fast, easy to use and makes accomplishing tasks on your to-do list lightning-fast.&#x275E; - The Verge<br><br>With Todoist, you can: <br>&#x25B8; Capture and organize tasks into your to-do list the moment they pop into your head. For example, simply write a task like &#x201C;water the plants every Thursday at 9AM #errands&#x201D; and Todoist will automatically set a task and reminder for every Thursday at 9:00AM in your &#x201C;errands&#x201D; project. <br>&#x25B8; Remember important deadlines and build lasting habits with powerful recurring due dates like &quot;every second Monday.&quot;<br>&#x25B8; Free up mental space by delegating tasks and errands to people in your shared projects.<br>&#x25B8; Highlight your day&#x2019;s most important activities with color-coded priority levels.<br>&#x25B8; See an overview of your daily and weekly accomplishments with beautifully customized productivity graphs.<br><br>You can make Todoist your central, organized task management hub for getting things done with access to 60+ popular app integrations like Dropbox, Amazon Alexa, Zapier, IFTTT, and Slack. <br><br>Even teams and small businesses can get more out of task management with Todoist. From stand-alone tasks to multi-phase projects, Todoist&#x2019;s Business version gives your team a clear overview of everything that needs to get done on every platform, with real-time sync.<br><br><br>Todoist is free forever with the option to upgrade to Todoist Premium. With Todoist Premium, you&#x2019;ll enjoy unlimited access to powerful task management features that&#x2019;ll help you accomplish your goals faster while feeling confident and in control. <br><br>&#x275D;Todoist is a powerful to-do list app that can do pretty much whatever you need it to do.&#x275E; - Android Authority <br><br>At the end of the day, you can rest, relax and recharge for tomorrow with the peace-of-mind of knowing that your task management is 100% organized and accounted for. <br><br>Join over 10 million people who rely on Todoist for getting things done and who feel more calm and in control of their lives.",
    "histogram": {
        "1": 4366,
        "2": 2831,
        "3": 7198,
        "4": 38221,
        "5": 94571
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/OQNZcANY8YLT0YaBtj4BbBWvZbCBvSJSMFjuQMoIDM1SmukmqAnvTI_oeeSFqWVMZzBB=h310",
        "//lh3.googleusercontent.com/wB9VK0dIpkEEwZzZa5a-YnUuxlUs5ID56LmITHYYuNIr8JBpMrAuJbeEHak4Q_OdkmU=h310",
        "//lh3.googleusercontent.com/hcDCc07k9SbyogiOgJCbQV4dgs2s18bjNN46i0fLGjZGe0T0KpE7x_3mzSS9GM0u6g=h310",
        "//lh3.googleusercontent.com/KelumyYDOnjsVBJymhRp7NSKIiY4lW5Wat7yaDNU0TKSbYNISYxbWHHCwLPT55Sg_g=h310",
        "//lh3.googleusercontent.com/Y_Rrd0ZsFBqRews9WPzi72ym33fUzpjlYHjlInBOCk5AwBIzCXvZjAxBEnnab3X3Iw=h310",
        "//lh3.googleusercontent.com/13hkgWupuxMzq40ADdybC25PBj7qjOuSqrfQ11nfTjubwiyuTGRKZWO-qfaGit7LEG8=h310",
        "//lh3.googleusercontent.com/bXKrFx7S43N0-Uhhod3HTyTQeFIrNRpmFQbWooBa0OzNAyAX2puUZjp-SHxWvjL0W1oE=h310",
        "//lh3.googleusercontent.com/TwIBaa9avz7fxFN_G67MPO2l8Svf3Tkmcp7o_v45fLvJTrvl3dkwHF-P9IOj3rj96zA=h310",
        "//lh3.googleusercontent.com/sjfE5eR_byrB5kFNeqjIfmA1S-AK-hDONx0jXCKiuIPfJsPtiwmtk26NNL8sXb26Z8g=h310",
        "//lh3.googleusercontent.com/u0ulgqEmktxv67uD-fqomwKKPvQqziGypFUdUI8uI3vQN2O86ctxYR2wa1BP2lux330=h310",
        "//lh3.googleusercontent.com/9RJrRKB2SbtYa1HXX7HGh74ERrCzUgR_J4w70054C1z5lk_8xKeZW-L-H5WoxlUA=h310",
        "//lh3.googleusercontent.com/3VB4svuB4Cvsa_CoeqVLRBnKxs8O0VirkivGnRYkNP_wEltgdYXcA2UHajY7mRZM6w=h310",
        "//lh3.googleusercontent.com/Pfg6hUMx0yGrcOB5A2oLEy4xYmOOdOYRzRT71XaKke4gXABru8-JRJ3Oe3_cF13zoacH=h310",
        "//lh3.googleusercontent.com/wPRDAg0QOZNvBaZEe-6nuV5mxgkHcgd_zVVhjUyJqD7ILL4UtgN5yilG7OXuHEZaEA=h310",
        "//lh3.googleusercontent.com/TLlZSoNQnrxXHj9xYElkl1s8BlOd315bJg1Xmt_2X804kZwq2UTjit9rLdAeoDyHWcA=h310",
        "//lh3.googleusercontent.com/huwwQLg0lth95_h7k5u6JEkFMMNBxI__hGrEXk2Oxk_ttjs_bhPeJgvStDf7xyOw5pY=h310"
    ],
    "video": "https://www.youtube.com/embed/VJo1pPRGUEg",
    "comments": [
        "Great app, simple to use and very intuitive! Helps me keep all my tasks in line & make sure I have done everything I need to do for work. Only issue is occasionally the app does not sync properly with the website & chrome plugin, which can cause some tasks (usually those inputted directly into the app) to be overlooked without intentionally looking at the app. Other than that, it would get the full 5⭐",
        "Was great until updating my phone to Oreo. The widget no longer works which makes the app near useless for me. I paid for premium too so really good this gets fixed. It's not really acceptable for a paid service though.  Edit: The widget still doesn't work on Oreo on Go Launcher. Does anyone care about this? I'm paying for something I can't use anymore.",
        "This tool is fantastic ! I cannot believe that I didn't discover it earlier, had tried so many others, always quickly abandoned. Todoist is extremely simple to use, very user friendly, but nevertheless it has a wide range of possibilities and really helps you get things done. I love how easy it is to create repetitive tasks. It is multi-platforms, synchronisation between devices is automatic and instantaneous. The support section is very helpful and there's a lot of instruction videos on YouTube. I suscribed for the paid version, it's worth the price for me, but you can get very well along with the free version.",
        "I'm using todoist for many years and the premium is well worth the money. I can see constant improvements over time and while the team seems unresponsive in some cases, I think they do a very good job at keeping the product simple and help to get productivity high. The best things for me are the possibility to nest tasks (decomposition helps me beat procrastination), flexible reminders and karma.",
        "Would love a simple way to set a simple reminder. e.g. Remind me to put the bins out at 8pm, and have various beeps etc try to get my attention at this specific time. Perhaps this disagrees with the App's philosophy, but I would certainly love this feature.",
        "Well, I am very frustrated with one and only one thing... slow customer support. I have this issue with reminders where I can't add reminders anymore. Even though I have only few reminders, it keeps giving me an error that I can't have more than 700 reminders. I definitely don't have 700 reminders, it's not even close. My total number of tasks are little more than 100 only. It's been couple weeks since I have contacted them with this issue and they don't have a solution for me yet. I get an email from them every 3-5 days asking for some information and then I here back from them after few days. It's too bad as I like everything else about this app. If they can't fix it for me in time, I will try another app for my needs.  Update: Still no fix after weeks of wait. I am moving on to different todo app \"ticktick\" now."
    ],
    "recentChanges": [
        "New:",
        "• Improved Quick add performance.",
        "• You can now use \"+me\" in shared projects in the Quick add.",
        "• Added a confirmation dialog when logging out with pending unsynced changes.",
        "Fixed:",
        "• Rescheduling a recurring task through task editing wasn't always working.",
        "• Text shared to the Quick add won't be parsed automatically anymore.",
        "• Sorting wasn't working as expected with accented letters.",
        "• Other smaller bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.todoist&hl=en&gl=us",
    "appId": "com.todoist"
}