{
    "title": "Uber",
    "summary": "Ride with Uber for fast, reliable, and affordable rides.",
    "icon": "//lh3.googleusercontent.com/5sinG5_U9rajYjXRZ57nKDQsGTJG0jEG2zByNa9TndlX2Yu1MbfCtyoI2oMdRvQtxBA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.2,
    "reviews": 4381862,
    "developer": "Uber Technologies, Inc.",
    "developerId": "7908612043055486674",
    "developerEmail": "noreply@uber.com",
    "developerWebsite": "http://www.uber.com",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "size": "Varies with device",
    "description": "Uber is a ridesharing app for fast, reliable rides in minutes—day or night. There’s no need to park or wait for a taxi or bus. With Uber, you just tap to request a ride, and it’s easy to pay with credit or cash in select cities.Whether you’re going to the airport or across town, there’s an Uber for every occasion. Uber is available in more than 630+ cities worldwide—download the app and take your first trip today.Requesting your Uber is easy—here’s how it works:- Just open the app and tell us where you’re going.- The app uses your location so your driver knows where to pick you up.- You’ll see your driver’s picture, vehicle details, and can track their arrival on the map.- Payment can be made by credit card, cash in select cities, Android Pay, PayPal, and more.- After the ride, you can rate your driver and provide feedback to help us improve the Uber experience. You’ll also get a receipt by email.Need a simple way to get from A to B quickly? Take uberX, our most affordable individual option.Want to save money on your ride? Take uberPOOL—you’ll travel with other riders headed your way and enjoy a lower fare.Want to elevate your experience? Take a high-end vehicle with UberBLACK. And there’s still more options—whether you’re traveling with a big group, or need a vehicle with accessibility features.See if Uber is available in your city at https://www.uber.com/citiesFollow us on Twitter at https://twitter.com/uberLike us on Facebook at https://www.facebook.com/uberHave a question? Visit uber.com/help",
    "descriptionHTML": "Uber is a ridesharing app for fast, reliable rides in minutes&#x2014;day or night. There&#x2019;s no need to park or wait for a taxi or bus. With Uber, you just tap to request a ride, and it&#x2019;s easy to pay with credit or cash in select cities.<br><br>Whether you&#x2019;re going to the airport or across town, there&#x2019;s an Uber for every occasion. Uber is available in more than 630+ cities worldwide&#x2014;download the app and take your first trip today.<br><br>Requesting your Uber is easy&#x2014;here&#x2019;s how it works:<br>- Just open the app and tell us where you&#x2019;re going.<br>- The app uses your location so your driver knows where to pick you up.<br>- You&#x2019;ll see your driver&#x2019;s picture, vehicle details, and can track their arrival on the map.<br>- Payment can be made by credit card, cash in select cities, Android Pay, PayPal, and more.<br>- After the ride, you can rate your driver and provide feedback to help us improve the Uber experience. You&#x2019;ll also get a receipt by email.<br><br>Need a simple way to get from A to B quickly? Take uberX, our most affordable individual option.<br><br>Want to save money on your ride? Take uberPOOL&#x2014;you&#x2019;ll travel with other riders headed your way and enjoy a lower fare.<br><br>Want to elevate your experience? Take a high-end vehicle with UberBLACK. And there&#x2019;s still more options&#x2014;whether you&#x2019;re traveling with a big group, or need a vehicle with accessibility features.<br><br>See if Uber is available in your city at https://www.uber.com/cities<br>Follow us on Twitter at https://twitter.com/uber<br>Like us on Facebook at https://www.facebook.com/uber<br><br>Have a question? Visit uber.com/help",
    "histogram": {
        "1": 473399,
        "2": 125326,
        "3": 276448,
        "4": 611521,
        "5": 2895168
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/P6d0yLBzGqa1Hj-0AcQFqrt93fs_VTNXDmNzsoPLQRSlb9XvtvC-RzDS9Ebhqj_pxVE=h310",
        "//lh3.googleusercontent.com/LRJuTUrLMoZz2vmmWMPQksj6oufrHQXf7H2646o9f4BNI98TbykVGAfB68YWGWRKkg=h310",
        "//lh3.googleusercontent.com/IJdshPkV4D743vPMhMP1N5W9fWk1aXHirPToKyBPpiJwm3e45-Jyb_m0wR85Byc8d8Q7=h310",
        "//lh3.googleusercontent.com/bUOPQTa1bxAM-bRaypSzbn_B0R1A_S_3yo55OUy-p-fDsz09T5HgRvrz4KzweY7bmx0=h310",
        "//lh3.googleusercontent.com/vzQg8CbzuL4SL5JByOEeGx4kyWV9a9x9FOP7YrQir-0CQ0eXV7U7hRZ9cz3O_Jy-aSaZ=h310"
    ],
    "comments": [
        "Actually i was comfort with uber till yesterday but today i encounter an issue. That when i plan to visit my relative house i booked the cab and an amount showed, when reach the destination the amount almost dabbled. Its Sunday after noon no pick hour found. But they mention surge pricing, I think the amount showing is nothing but a business tactics. Immediately i tried to report this but no reporting system available.",
        "I am writing this because ur app is not working properly. The issue is, i forgot my password and then tried to reset but it is unsuccessful.Also, weird message are poping up which are programming error.  I am software developer and expect that i will follow instructions properly in resetting the same. Also, few weeks back i tried the same but all in vain and also put a mail in sorting this out but no response.  Thanks any how. ☺☺",
        "Why isn't the uber app working?  It's not allowing me to get a driver from location!  I use uber regularly & today it's saying no drivers available. I thought it was my data but I had enough data.  I use uber all the time to get home from work..  It's saying no connection!..  Please can yourl get it sorted or is then any other way I can get an uber ASAP?",
        "With the new update it takes WAY too long to request a ride. Even making me late to work. And driver's 10 minutes away can accept your ride. This needs to be fixed. When I request a ride I expect someone to be there in 5 minutes like it was before. Also, some drivers will sit in one spot and wait for you to cancel so they get paid for doing nothing. No way to contest the fee they charge.",
        "Since a recent update, the app has been buggy on my huawei mate 9 to the point where its unusable. When I open the app, it just shows a blank screen and sidebar. I can't use the app to call a car or so anything else since half the interface is missing. Reinstalling it sometimes fixes the problem, but it's hit and miss and only a temporary solution.   I'm switching to another app until its fixed. This issue has left me stranded too many times.",
        "Map not updating on drivers location, and not being able to call them to cancel. Being charged £5 for this isnt very fair, and as it's my means to get to work, unreliable. If this continues to happen I will take my time elsewhere, but I do support the drivers, no complaints about them at all"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ubercab&hl=en&gl=us",
    "appId": "com.ubercab"
}