{
    "title": "TripAdvisor Hotels Flights Restaurants Attractions",
    "summary": "Millions of traveler reviews and photos. Plan and book the perfect trip.",
    "icon": "//lh3.googleusercontent.com/A-7zwErId9EPywlNv8TVAV9gY9KAUrn-eMit08qRpRSSUHSZFk0XN8imQxgMdC2adA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.4,
    "reviews": 1123869,
    "developer": "TripAdvisor",
    "developerId": "TripAdvisor",
    "developerEmail": "mobilehelp@tripadvisor.com",
    "developerWebsite": "http://www.tripadvisor.com/help",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "size": "Varies with device",
    "description": "Millions of traveler reviews, photos, and maps from TripAdvisor. Know better. Book better. Go better. With over 500 million reviews and opinions by travelers, TripAdvisor makes it easy to find the lowest airfare, best hotels, great restaurants, and fun things to do, wherever you go. And booking options for hotels, restaurants and flights are just a tap away.The TripAdvisor mobile app is free and easy to use.• We compare prices from 200+ hotel booking sites to find the lowest price on the right hotel for you• Browse millions of reviews, opinions, videos and candid photos by travelers• Find the best hotel for you, including Travelers' Choice award winners• Explore restaurants by food type, price range, and rating• Discover cool things to do in any destination• Compare airfares and find great deals • Use Near Me Now to discover options near you• Get answers to your specific travel questions in the forums• Add your own reviews and photos• Download maps, reviews, and your saves for Amsterdam, Bangkok, Barcelona, Berlin, Boston, Hong Kong, Las Vegas, London, New York, Orlando, Paris, Prague, Rome, San Francisco, Singapore, Tokyo and over 300 other cities worldwide onto your phone for free; avoid using expensive data roaming plans while you travelApp Permissions Description:• Storage: TripAdvisor uses Google Maps, which uses external/USB storage for caching downloaded map information.• Your location: These permissions are needed to obtain your location so we can help you discover hotels, restaurants, and attractions around you. Network-based location gets a quick location, but is not usually pinpoint accurate. GPS is a bit slower to initially locate you, but is usually more accurate.• Camera: The TripAdvisor phone app allows you to take a picture using your Android device camera directly.• Network communication: Allows the app to transmit information to and from your phone via the Internet.• Your accounts: We are using the Android Application Account Manager to store your credentials in a TripAdvisor account (you can find it in Settings under the Accounts tab). If you remove the app we also remove the TripAdvisor account on the device. • System tools: This location provider permission provides more detailed location information so that TripAdvisor can pick the best possible location source for your current situation. The “test access” permission allows Android to check if it can use your external/USB storage for caching map information.",
    "descriptionHTML": "Millions of traveler reviews, photos, and maps from TripAdvisor. Know better. Book better. Go better. With over 500 million reviews and opinions by travelers, TripAdvisor makes it easy to find the lowest airfare, best hotels, great restaurants, and fun things to do, wherever you go. And booking options for hotels, restaurants and flights are just a tap away.<br><br>The TripAdvisor mobile app is free and easy to use.<br>&#x2022; We compare prices from 200+ hotel booking sites to find the lowest price on the right hotel for you<br>&#x2022; Browse millions of reviews, opinions, videos and candid photos by travelers<br>&#x2022; Find the best hotel for you, including Travelers&apos; Choice award winners<br>&#x2022; Explore restaurants by food type, price range, and rating<br>&#x2022; Discover cool things to do in any destination<br>&#x2022; Compare airfares and find great deals <br>&#x2022; Use Near Me Now to discover options near you<br>&#x2022; Get answers to your specific travel questions in the forums<br>&#x2022; Add your own reviews and photos<br>&#x2022; Download maps, reviews, and your saves for Amsterdam, Bangkok, Barcelona, Berlin, Boston, Hong Kong, Las Vegas, London, New York, Orlando, Paris, Prague, Rome, San Francisco, Singapore, Tokyo and over 300 other cities worldwide onto your phone for free; avoid using expensive data roaming plans while you travel<br><br>App Permissions Description:<br>&#x2022; Storage: TripAdvisor uses Google Maps, which uses external/USB storage for caching downloaded map information.<br>&#x2022; Your location: These permissions are needed to obtain your location so we can help you discover hotels, restaurants, and attractions around you. Network-based location gets a quick location, but is not usually pinpoint accurate. GPS is a bit slower to initially locate you, but is usually more accurate.<br>&#x2022; Camera: The TripAdvisor phone app allows you to take a picture using your Android device camera directly.<br>&#x2022; Network communication: Allows the app to transmit information to and from your phone via the Internet.<br>&#x2022; Your accounts: We are using the Android Application Account Manager to store your credentials in a TripAdvisor account (you can find it in Settings under the Accounts tab). If you remove the app we also remove the TripAdvisor account on the device. <br>&#x2022; System tools: This location provider permission provides more detailed location information so that TripAdvisor can pick the best possible location source for your current situation. The &#x201C;test access&#x201D; permission allows Android to check if it can use your external/USB storage for caching map information.",
    "histogram": {
        "1": 48492,
        "2": 21256,
        "3": 64150,
        "4": 285403,
        "5": 704568
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/yb2FN3aOWxp_0yikjZMUdMM2rRYDsstiQoJEHeMHLwDst1_IyuJY_65TH-xRkG6fUQ=h310",
        "//lh3.googleusercontent.com/V4J27rPBkpMmmt0H1x9r34_cqIVvC0gfa9DzCmsMofiA7Q7IaYe7ZHv6210TH9ZQaH4M=h310",
        "//lh3.googleusercontent.com/9DgT--3KtdcRq4VDfOf1R6gx_bboEPEJ01NJMZQmDWsPIQVkw_ur5HqV2Kvmab_Ecb0=h310",
        "//lh3.googleusercontent.com/uQWzwYikrHF8-WMhthw6v1bgyZlY6kmg2We8Aahkt5_RRYOK4pBrItZHujgHi9QcBw=h310",
        "//lh3.googleusercontent.com/K0mvzW-qGJUxSO8VpABvYC4qRBfP7pROlCdZT0KmT1vOLFs4Mb6iVc6h_yptosTxEsw=h310",
        "//lh3.googleusercontent.com/LN8cB8_sRaCpU12LgRBX0md-6fxAlg4zI407zmDPmMp-huOGa2FZ7KDeV0lYt0CvMpE=h310",
        "//lh3.googleusercontent.com/69VOfV-YjBoJC0Ya2OHNzlGH2i-ci-lstjoqdHuvUQkhD90qrsiQaq-Qsp4xcLVCWg=h310",
        "//lh3.googleusercontent.com/eaHXaNJftfNL0bf-PJdPvYwTkALL3OuUKri0nIOPnkxa0Q0sdo7QdAHTjBLc49zlNGv_=h310",
        "//lh3.googleusercontent.com/DVbP6o5aba1wYkglBeho6p5L8XpsEV_g8Ui7TGBmcjJKWSlYmhbhSmasDcnfAx6LlGY=h310",
        "//lh3.googleusercontent.com/6fSOMis4iIMdGr-029LrQoBxYUqGYnvjitTbmUJYvzWrR-MW0BuR8MrXdFlx6EZBnKE=h310",
        "//lh3.googleusercontent.com/ed1S864SXSFW3QeabUGbX1BH8JZQqM5VGv8sMiHRobKmoukh9dWZOuoeA6jZz45R7Q=h310",
        "//lh3.googleusercontent.com/S9L1eTOPwlA92NSvXLiO4C2MrEGJ6LKFtzdKatS5JG-CiFR64Q4pITiCfD9gzv4edhs=h310",
        "//lh3.googleusercontent.com/VAthIFU9eoqQnHafe5X2u8lePMZ-0Kpas97zPp_qlohFhttBX2qafPaesqroSgWUaQLN=h310",
        "//lh3.googleusercontent.com/pCoskL0VljcTIcL2Ply0GgTo0UESdTSI2XKtDF_J2Ev-qv0r9P76fKMeJpS2SbZjAlU=h310",
        "//lh3.googleusercontent.com/eOE6C3RJt8jTN2x6U5uXjC6xLEAHtIQ47P8KrvGl9xn0y4ZQjzunaC71X6qYXl7jNQ=h310"
    ],
    "comments": [
        "I love having the TripAdvisor app on my phone. With all the fantastic reviews and photos from other travelers like me, TA makes it a breeze to find the perfect hotel, restaurant, or local attraction. I honestly don't know where I would be without this app. Also, writing my own reviews is a fun and enjoyable way of helping to share my own experiences in the world. 5 stars!!!",
        "Not going to give 5 stars as it doesn't give the right month or year when writing a review. I wrote one recently using the app and it said I wrote it last year! The app is however easy to use so that's why the 3 stars.",
        "This app is very helpful for planning our trips and managing all necessary confirmations in one place.",
        "I'm a youtuber having 100 million subscribers. And I rate u five stars for this wonderful app",
        "Used to love TripAdvisor but the search is just rubbish now",
        "This app is fantastic for hotel booking . Flight booking has some challenges."
    ],
    "recentChanges": [
        "Thanks for using TripAdvisor! We bring updates to the Play Store every 2 weeks.",
        "What’s new:",
        "Bug fixes and stability improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tripadvisor.tripadvisor&hl=en&gl=us",
    "appId": "com.tripadvisor.tripadvisor"
}