{
    "title": "Zumper - Apartment Rental Finder",
    "summary": "Zumper helps you find and apply to rent your dream house or apartment.",
    "icon": "//lh3.googleusercontent.com/TQIDe6L7Jw-QO0vNYnzECvCh3uawOAIDHnJHU8sIsZ9YLvOPsf7yJdYAmIvYeFB9Fpoj=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 8855,
    "developer": "Zumper, Inc",
    "developerId": "4627781897658415798",
    "developerEmail": "hello@zumper.com",
    "developerWebsite": "https://www.zumper.com",
    "developerAddress": "49 Geary st. #350\nSan Francisco, CA\n94107",
    "updated": "March 2, 2018",
    "version": "4.4.33",
    "genre": "House & Home",
    "genreId": "HOUSE_AND_HOME",
    "description": "Zumper makes renting an apartment or house easy! Find and instantly apply to rent your dream house, apartment, or condo across the United States and Canada. You’ll find great rental listings in cities from San Francisco to New York, Boston, Chicago, and LA in the US, and Toronto, Vancouver, and Québec in Canada. Our apartment finder makes sure you see apartments for rent on Zumper before they appear anywhere else!Search over 1 million apartments, houses, and condos each month: Renting a house, apartment, or condo should be easy! Browse our apartment finder’s interactive map by city, neighborhood, or zip code to find nearby apartment rentals. Our inventory—which includes listings from Zumper, PadMapper, and many other networks—is updated in real-time to ensure accuracy and availability, helping you get an edge over everyone else.Filter your search: Renting on a budget? No problem. You can filter Zumper’s inventory of apartments, houses, and condos by price, as well as number of bedrooms, bathrooms, pet policy (including cat and dog friendly rentals), and amenities (like in-unit laundry, assigned parking, a roof deck, or a swimming pool). In addition, you can limit your search to no-fee apartments so you only see relevant listings. You can even find private and shared rooms posted from our sister site, PadMapper! Whether you’re looking for cheap studios or luxurious apartments, our free apartment finder is the easiest way to find apartments or condos to rent in New York, San Francisco, Chicago, Boston, LA, or anywhere else in the United States. And searching for rental properties in Toronto, Vancouver, Québec, or elsewhere in Canada is just as simple!Get alerts: Create map or neighborhood-based alerts so you know when new rentals hit the market. Zumper’s apartment finder processes over 1 million apartments, houses, and condos for rent per month—including listings from PadMapper and other providers—so make sure you’re the first to know about new inventory.Connect with landlords directly: Once you’ve narrowed your search to your favorite apartments or houses, message or call each landlord directly from the app. Save your favorite rentals and keep track of the apartments or condos you’ve contacted. No matter where you want to rent, Zumper’s apartment finder makes it easy to manage your apartment search!Apply with one tap: Forget the paperwork — renting has gone digital! Easily create a rental application and Experian credit report (US only) right from your Android device and then apply for your dream house with the tap of a finger.Android Wear support: If you’re renting in a hot market, you’ll love Zumper’s Android Wear support! Setup real-time alerts to receive new house, apartment, and condo rentals directly on your Android wearable device. Notifications will automatically show up on your wrist, where you'll be able to favorite listings for your ideal living space, view details, or call the broker or landlord with a tap.Stay in the know! Like and follow us to get updates:Facebook: https://www.facebook.com/zumperincGoogle Plus: https://plus.google.com/+Zumper/Twitter: https://twitter.com/zumperUsage of Zumper is bound by the Zumper terms of service: https://www.zumper.com/terms-of-use",
    "descriptionHTML": "Zumper makes renting an apartment or house easy! Find and instantly apply to rent your dream house, apartment, or condo across the United States and Canada. You&#x2019;ll find great rental listings in cities from San Francisco to New York, Boston, Chicago, and LA in the US, and Toronto, Vancouver, and Qu&#xE9;bec in Canada. Our apartment finder makes sure you see apartments for rent on Zumper before they appear anywhere else!<br><br><b>Search over 1 million apartments, houses, and condos each month</b>: Renting a house, apartment, or condo should be easy! Browse our apartment finder&#x2019;s interactive map by city, neighborhood, or zip code to find nearby apartment rentals. Our inventory&#x2014;which includes listings from Zumper, PadMapper, and many other networks&#x2014;is updated in real-time to ensure accuracy and availability, helping you get an edge over everyone else.<br><br><b>Filter your search</b>: Renting on a budget? No problem. You can filter Zumper&#x2019;s inventory of apartments, houses, and condos by price, as well as number of bedrooms, bathrooms, pet policy (including cat and dog friendly rentals), and amenities (like in-unit laundry, assigned parking, a roof deck, or a swimming pool). In addition, you can limit your search to no-fee apartments so you only see relevant listings. You can even find private and shared rooms posted from our sister site, PadMapper! Whether you&#x2019;re looking for cheap studios or luxurious apartments, our free apartment finder is the easiest way to find apartments or condos to rent in New York, San Francisco, Chicago, Boston, LA, or anywhere else in the United States. And searching for rental properties in Toronto, Vancouver, Qu&#xE9;bec, or elsewhere in Canada is just as simple!<br><br><b>Get alerts</b>: Create map or neighborhood-based alerts so you know when new rentals hit the market. Zumper&#x2019;s apartment finder processes over 1 million apartments, houses, and condos for rent per month&#x2014;including listings from PadMapper and other providers&#x2014;so make sure you&#x2019;re the first to know about new inventory.<br><br><b>Connect with landlords directly</b>: Once you&#x2019;ve narrowed your search to your favorite apartments or houses, message or call each landlord directly from the app. Save your favorite rentals and keep track of the apartments or condos you&#x2019;ve contacted. No matter where you want to rent, Zumper&#x2019;s apartment finder makes it easy to manage your apartment search!<br><br><b>Apply with one tap</b>: Forget the paperwork &#x2014; renting has gone digital! Easily create a rental application and Experian credit report (US only) right from your Android device and then apply for your dream house with the tap of a finger.<br><br><b>Android Wear support</b>: If you&#x2019;re renting in a hot market, you&#x2019;ll love Zumper&#x2019;s Android Wear support! Setup real-time alerts to receive new house, apartment, and condo rentals directly on your Android wearable device. Notifications will automatically show up on your wrist, where you&apos;ll be able to favorite listings for your ideal living space, view details, or call the broker or landlord with a tap.<br><br><b>Stay in the know! Like and follow us to get updates</b>:<br><br>Facebook: https://www.facebook.com/zumperinc<br>Google Plus: https://plus.google.com/+Zumper/<br>Twitter: https://twitter.com/zumper<br><br>Usage of Zumper is bound by the Zumper terms of service: https://www.zumper.com/terms-of-use",
    "histogram": {
        "1": 527,
        "2": 243,
        "3": 525,
        "4": 1912,
        "5": 5648
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/-BMlVogh3Hper-UhgPIhIk2UAfnqFdm1ZunHJ655rg1mV371vGVXIfKgGTzH2eJptA=h310",
        "//lh3.googleusercontent.com/OedV15Hztsatz3wiRpYpq7L6vsVeKXbUHKAyzIWbxjGVuopc9Lmyr-mckwzzoppw1ig=h310",
        "//lh3.googleusercontent.com/uCfz-ee2hmFNQDKL0yQaN3WeulPWx2phAc6xbDXniLxCQ3lH2_DrzBL4oFBt1je6vg=h310",
        "//lh3.googleusercontent.com/nfuJdeTnglkYbxGPJAPFWxYszaKFyss6pufIqT6ZMwyDME1-uh51pfTfj5GbVuvlEg=h310",
        "//lh3.googleusercontent.com/jqvwFmccK_t_DGsSucjsMzIS39hamyXBHfs774Qb8BVFfWZpzLn2UQ0d49LYTOiHBXN4=h310",
        "//lh3.googleusercontent.com/XWAy0d125R_63ktel9FmuLiuMnaXEaGHMm25B80rpudEiIcxSwUASqP9AklUhkTsUw=h310",
        "//lh3.googleusercontent.com/DJg3oocopNNkEOYbf6bsF1SP_TRAvVTvs3uTlcYg5Bv7fvqVd31OzR7TouNy9BXEaQ=h310"
    ],
    "comments": [
        "I can't give 5 stars yet. I'm just starting to learn more about running it. From what I can juggle, looks like a useful app.",
        "This App is so great! It makes looking for a new apartment so much easier!",
        "Its a great app i highly suggest it",
        "Great app. Very helpful",
        "Very helpful and great locator",
        "great app!"
    ],
    "recentChanges": [
        "Access our favorite apartments & let Zumper Select handle the work for you for free. Just tap the Select banner in Atlanta, Chicago, Dallas, Denver, Houston, or New York to get started. Our local rental experts are standing by to provide advice on neighborhoods, source listings, and help you find the best fit. When you’re ready, we’ll schedule all of your tours. Whether you’re relocating to a new city or just moving around the corner, Zumper Select reduces the time & hassle of apartment hunting."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.zumper.rentals&hl=en&gl=us",
    "appId": "com.zumper.rentals"
}