{
    "title": "Calm - Meditate, Sleep, Relax",
    "summary": "Join the millions discovering the life-changing benefits of meditation with Calm",
    "icon": "//lh3.googleusercontent.com/NmWh7Jnm_VxC-SOfT3VhqmnGlc4sMWLJh9SDfBL1hRx7PG2WA0yS8VY7Mhi1m7P7UQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.6,
    "reviews": 93554,
    "developer": "Calm.com, Inc.",
    "developerId": "Calm.com,+Inc.",
    "developerEmail": "android@calm.com",
    "developerWebsite": "http://www.calm.com",
    "developerAddress": "140 2nd Street\n3rd Floor\nSan Francisco\nCA 94105",
    "updated": "March 3, 2018",
    "version": "3.12.2",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Calm is the #1 app for mindfulness and meditation to bring more clarity, joy and peace to your daily life. Start your journey to a calmer mind with the app that’s trusted by millions and featured in the New York Times.Calm is the perfect meditation app for beginners, but also includes hundreds of programs for intermediate and advanced meditators and gurus.Guided meditation sessions are available in lengths of 3, 5, 10, 15, 20 or 25 minutes so you can choose the perfect length to fit with your schedule. Topics include:* Calming Anxiety* Managing Stress* Deep Sleep* Focus and Concentration* Happiness* Gratitude* Self-Esteem* Body Scan* Loving-Kindness* Forgiveness* Non-judgement* Commuting to work or school* Walking meditation* Calm Kids* And so much more....Also featuring:* Daily Calm: a new 10-minute program added daily to help ease you into the day or unwind with before bed* Sleep Stories: adult bedtime stories guaranteed to lull you to sleep* 7 day and 21 programs for both beginner and advanced users* Breathing exercises to relax* Unguided timed meditation* Open-ended meditation* 25+ soothing nature sounds and scenes to use during meditation, yoga or to help you sleepTrack your progress with:* Daily streaks* Time spent meditatingCalm is loved by the press:* “I’m generally wary of meditation apps because they sometimes weave in too much mystic talk for my taste. But Calm instead contains guidance like ‘Concentrate on your body’” - New York Times* “In the frenetic, crazy, digital world we live in, sometimes it's necessary to take a step back and smell the roses” - Mashable* “Eliminating distraction...ended up helping me relax and realize that all the stuff I was stressing about wasn't that big a deal” - Tech Republic* “Found myself similarly refreshed afterwards” - TechCrunchCalm is completely free to download and use, and there are no ads. Many of the programs and features are free forever.Some content is only available through an optional paid subscription. If you choose to subscribe, payment will be charged to your Google Account at confirmation of purchase.",
    "descriptionHTML": "Calm is the #1 app for mindfulness and meditation to bring more clarity, joy and peace to your daily life. Start your journey to a calmer mind with the app that&#x2019;s trusted by millions and featured in the New York Times.<br><br>Calm is the perfect meditation app for beginners, but also includes hundreds of programs for intermediate and advanced meditators and gurus.<br><br>Guided meditation sessions are available in lengths of 3, 5, 10, 15, 20 or 25 minutes so you can choose the perfect length to fit with your schedule. Topics include:<br><br>* Calming Anxiety<br>* Managing Stress<br>* Deep Sleep<br>* Focus and Concentration<br>* Happiness<br>* Gratitude<br>* Self-Esteem<br>* Body Scan<br>* Loving-Kindness<br>* Forgiveness<br>* Non-judgement<br>* Commuting to work or school<br>* Walking meditation<br>* Calm Kids<br>* And so much more....<br><br>Also featuring:<br><br>* Daily Calm: a new 10-minute program added daily to help ease you into the day or unwind with before bed<br>* Sleep Stories: adult bedtime stories guaranteed to lull you to sleep<br>* 7 day and 21 programs for both beginner and advanced users<br>* Breathing exercises to relax<br>* Unguided timed meditation<br>* Open-ended meditation<br>* 25+ soothing nature sounds and scenes to use during meditation, yoga or to help you sleep<br><br>Track your progress with:<br><br>* Daily streaks<br>* Time spent meditating<br><br>Calm is loved by the press:<br><br>* &#x201C;I&#x2019;m generally wary of meditation apps because they sometimes weave in too much mystic talk for my taste. But Calm instead contains guidance like &#x2018;Concentrate on your body&#x2019;&#x201D; - New York Times<br><br>* &#x201C;In the frenetic, crazy, digital world we live in, sometimes it&apos;s necessary to take a step back and smell the roses&#x201D; - Mashable<br><br>* &#x201C;Eliminating distraction...ended up helping me relax and realize that all the stuff I was stressing about wasn&apos;t that big a deal&#x201D; - Tech Republic<br><br>* &#x201C;Found myself similarly refreshed afterwards&#x201D; - TechCrunch<br><br>Calm is completely free to download and use, and there are no ads. Many of the programs and features are free forever.<br><br>Some content is only available through an optional paid subscription. If you choose to subscribe, payment will be charged to your Google Account at confirmation of purchase.",
    "histogram": {
        "1": 2581,
        "2": 1397,
        "3": 3182,
        "4": 15913,
        "5": 70481
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/1Q6zO7q0JtHX-u3G6rHAs29pQoLWc4G9L5IBuyZtk9bRey3LCuHQqzZ9bzzReT0_xIA=h310",
        "//lh3.googleusercontent.com/f0n1wHG12Dfpsvf7uwyOg4L41fLU_iS9vgg1gOq_Uwfqz0txH0LaXqjXG9dCwzy_FR0=h310",
        "//lh3.googleusercontent.com/J1DO5E8IEkcNkmU7Eo4LvYYxFfsxoKUVYfcnHjldZlaMj29pfTE3-WLm7Jx02FQd5A=h310",
        "//lh3.googleusercontent.com/9g6VZpFM84UVwF6ivgLxqWL3S2bfx_5djoNTfkSdayUN0f-UW7O64lrIVMzeXuqgQaU=h310",
        "//lh3.googleusercontent.com/b8uuyU8PqO8Yh50rxSnTmbcSRDn0nghHAbbStVoslNdMWvg9_7qYbZey-UQNlyf6JhY=h310",
        "//lh3.googleusercontent.com/ex4j-VONk6HGXqW_2QNZfM183Tj53lzRYbDj0T4Gp9dBUyTxZMF3YXqun48-X-KYOnqZ=h310",
        "//lh3.googleusercontent.com/HxxXavvOYzM00jYzvnktD_ScM4XFWblDE8ekA2QiloLR9phGAxivEHNv0O1Gob95Yw=h310",
        "//lh3.googleusercontent.com/3TeEtmfvNMvVhfc9VoncBQLztzSZNZqJzekUREQzWZDsQgLWcTemfMwzuFDDryecWdk=h310",
        "//lh3.googleusercontent.com/2r-a_kkRNmCcIORuGIT_o3Qxr4cIZcHcRQ4aXlTTvMzlXQNsbPAS-_oKiuhkJ_E_xg=h310",
        "//lh3.googleusercontent.com/fMr0UVBR2Tsib-1pauWTKKicOfbisRNVpSHtccvtsFtp6CarE5DdSQgHd6RTRVau1s4=h310",
        "//lh3.googleusercontent.com/uwRU5Ml7bqgY-K6EdZMBmlHJ4deFkw4uc9VE2eFSpGRBAY365LoXpyXC4YKcCLJLuco=h310",
        "//lh3.googleusercontent.com/BFSqpwXcHdXVPmIOiNwSTsuhmnE_1MPEjM842H8-vqB_XLYkBD9is_fpYaXE-hrXhw=h310",
        "//lh3.googleusercontent.com/eVXqev4YU2fZFddRmSILiulNMUetkw5OuMd9NCDu2qj507xC7qg58IDupyckVjSJvg=h310"
    ],
    "comments": [
        "I think this is a very nice app. Sadly 90% of what's offered , you have to purchase. I tried multiple \"free\" meditations only to come back for day 2 and discover they were now locked and I was redirected to a page that said I now had to pay for it, even though the day before it was free. The fee for the subscription content offered is too high. After listening to the multiple meditations I was actually able to listen to (for a day) they all began to sound the same. Excellent idea for an app but needs more variety.",
        "I am new to both this app and mindfulness. There is so much content I genuinely don't know where to start.  The daily meditations are really useful and calming, giving practical advice and guideance for a calmer more mindful existance for todays busy lives. The  sleep stories are brilliant for someone like me that has trouble sleeping and frequently Im fast asleep before its finished.   I never knew this app when a lot of the content was free.  However I believe this app helps to relax me and has a positive impact on my life and wellbeing. The cost I feel is value for money for everything that you get and believe my wellbeing is worth it.",
        "UPDATE... I've been using this app for over a year and it's just gets better. And it has made a difference in my life normally I use it first thing to start my day but sometimes if I need time out it's what I use. My stress levels are very low now... Thank you for the app   One of the best I have tried cannot decided on the yearly subscription would prefer a one-off payment. I did it yearly subscription unlocks so much more. Life is a lot better for mediation and this app is brilliant at getting me to that every day.",
        "I think this has the potential  To help a lot of people. However I'm not over the moon about their  Pricing. I use this every night with my kiddos to fall asleep to some of our favorite stories have been  \"locked now\" and taken off the free version.  I can did pay for it once but can't get it to work now.  I'm starting to look around for other free apps like this. It helps the kids fall asleep , which helps me get sleep. Their stories are really good but unless you can afford it,  then it is too much.",
        "I was really excited when downloading the app and started a course right away. It was really helpful and helped me calm down for the day and I was looking forward to taking the next session. But the next day I opened the app and found out that I had to pay for the rest of the course, along with many other courses. If you have the money to pay for the contents of the app this should be perfect for you! But if not you might want to look for another meditation app that has more free courses.",
        "I've been using this app pretty much daily for nearly a year. I feel this app has helped me become a calmer person. I love that I can choose different meditations for a surprising number of different moods. The voice is always the same person and is very soothing and the messages imparted are clear and insightful. It's a little more expensive to subscribe than I was expecting, but ultimately worth it."
    ],
    "recentChanges": [
        "We’re delighted to announce Calm Masterclass, life-changing audio programs taught by world-renowned experts exclusive to Calm. Our first Calm Masterclass is called “Breaking Bad Habits”, and it’s taught by Judson Brewer, a psychiatrist and world-renowned addiction expert. We hope you find it incredibly valuable — it’s a great way to kick off 2018. Look out for more Calm Masterclass programs each month."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.calm.android&hl=en&gl=us",
    "appId": "com.calm.android"
}