{
    "title": "FreeTone Free Calls & Texting",
    "summary": "FREE calling and texting (SMS texts + MMS) in US &amp; Canada with FREE phone number",
    "icon": "//lh3.googleusercontent.com/FAMut6F0Rq1xQn813uNt8JUspJAeZofEwQwE_540l06ONxL9Uva_w8y9bvt_uBI3Xw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 45915,
    "developer": "TextMe, Inc.",
    "developerId": "7744106960263623416",
    "developerEmail": "feedback@go-text.me",
    "developerWebsite": "http://www.free-tone.com/",
    "developerAddress": "275 Post St #500\nSan Francisco, CA 94108",
    "updated": "February 13, 2018",
    "version": "Varies with device",
    "genre": "Social",
    "genreId": "SOCIAL",
    "size": "Varies with device",
    "description": "UNLIMITED free calls & texts to ALL phone numbers in the US and Canada. Free new number and voicemail. No trials, no hidden costs - absolutely FREE! - Get your own real phone number with voicemail- Calling the US and Canada is 100% free - no credits- Enjoy free texting (SMS), picture messaging (MMS) THE ONLY TRULY FREE CALLING APPFreeTone offers you the ultimate high quality online calling experience as the best FREE calling and texting app available. Unlike other free phone apps, you do not need to earn or pay for calling credits. Simply dial any US or Canada number and talk for free, landline and mobile. FREE & EASY TO USE NEW PHONE SERVICE- FREE own private number for your Android phone- FREE calls to all phone numbers in US and Canada- FREE texts (real SMS messages) to any number- EASY sign up using email, Facebook or Google - EASY access to your account across all devices- EASY group messaging, free HD calls & video chat- BETTER free calling app with unlimited texts- BETTER call quality and speed among VoIP apps - BETTER reach with free texting to 40 countries SHARE FAVORITE MOMENTS WITH FRIENDSSend and receive MMS, large pictures & videos from your Android smartphone or tablet to any device. Invite your friends to FreeTone to enjoy Free Video Calls with them. Send messages and voice notes, share photos and videos with your contacts easily. Share your texts, photos and videos easily with your group of friends using group messaging. CONNECT FREELY & REFUSE TO PAYContrary to similar apps, you do not have to pay anything or earn credits to call any U.S. or Canadian number, whether they use the same app as you do or not. Watch out for their fine print! FreeTone charges you nothing to make phone calls to US and Canada phones. Simply call free & text free. WITH FREETONE YOU CAN- Pick the area code that you prefer when signing up- Make and receive free phone calls in US & Canada- Save cell minutes with the new number & voicemail- Send free text messages (SMS) and pictures (MMS)- Share photos, stickers, group texts with everyone- Text for free to Mexico, Dominica, Brazil + 40 more- Enjoy free wifi calling & use tablets as real phones- Call and text international numbers easily as well- Invite friends to unlock HD video chat & more! We hope to see you among us soon! Limitations apply:- For outbound calls to the US and Canada, calling is free with FreeTone- Hawaii, Alaska and some other territories are not supported in the free bundle- Free Texting to Latin America subject to balanced inbound/outbound traffic fair usage policy- For inbound calls to your personal number, the first five hundred minutes are complimentary, with the ability to receive calls to your FreeTone number for a minimal extension fee- Free texting and calling to US and Canada numbers are only available to the US and Canada residents- We do not Support 911- Subject to FreeTone’s Terms and Conditions Help us improve FreeTone:http://support.free-tone.com",
    "descriptionHTML": "UNLIMITED free calls &amp; texts to ALL phone numbers in the US and Canada. Free new number and voicemail. No trials, no hidden costs - absolutely FREE!<br> <br>- Get your own real phone number with voicemail<br>- Calling the US and Canada is 100% free - no credits<br>- Enjoy free texting (SMS), picture messaging (MMS)<br> <br>THE ONLY TRULY FREE CALLING APP<br><br>FreeTone offers you the ultimate high quality online calling experience as the best FREE calling and texting app available. Unlike other free phone apps, you do not need to earn or pay for calling credits. Simply dial any US or Canada number and talk for free, landline and mobile.<br> <br>FREE &amp; EASY TO USE NEW PHONE SERVICE<br><br>- FREE own private number for your Android phone<br>- FREE calls to all phone numbers in US and Canada<br>- FREE texts (real SMS messages) to any number<br><br>- EASY sign up using email, Facebook or Google <br>- EASY access to your account across all devices<br>- EASY group messaging, free HD calls &amp; video chat<br><br>- BETTER free calling app with unlimited texts<br>- BETTER call quality and speed among VoIP apps <br>- BETTER reach with free texting to 40 countries<br> <br>SHARE FAVORITE MOMENTS WITH FRIENDS<br><br>Send and receive MMS, large pictures &amp; videos from your Android smartphone or tablet to any device. Invite your friends to FreeTone to enjoy Free Video Calls with them. Send messages and voice notes, share photos and videos with your contacts easily. Share your texts, photos and videos easily with your group of friends using group messaging.<br> <br>CONNECT FREELY &amp; REFUSE TO PAY<br><br>Contrary to similar apps, you do not have to pay anything or earn credits to call any U.S. or Canadian number, whether they use the same app as you do or not. Watch out for their fine print! FreeTone charges you nothing to make phone calls to US and Canada phones. Simply call free &amp; text free.<br> <br>WITH FREETONE YOU CAN<br><br>- Pick the area code that you prefer when signing up<br>- Make and receive free phone calls in US &amp; Canada<br>- Save cell minutes with the new number &amp; voicemail<br><br>- Send free text messages (SMS) and pictures (MMS)<br>- Share photos, stickers, group texts with everyone<br>- Text for free to Mexico, Dominica, Brazil + 40 more<br><br>- Enjoy free wifi calling &amp; use tablets as real phones<br>- Call and text international numbers easily as well<br>- Invite friends to unlock HD video chat &amp; more!<br> <br>We hope to see you among us soon!<br> <br>Limitations apply:<br>- For outbound calls to the US and Canada, calling is free with FreeTone<br>- Hawaii, Alaska and some other territories are not supported in the free bundle<br>- Free Texting to Latin America subject to balanced inbound/outbound traffic fair usage policy<br>- For inbound calls to your personal number, the first five hundred minutes are complimentary, with the ability to receive calls to your FreeTone number for a minimal extension fee<br>- Free texting and calling to US and Canada numbers are only available to the US and Canada residents<br>- We do not Support 911<br>- Subject to FreeTone&#x2019;s Terms and Conditions<br> <br>Help us improve FreeTone:<br>http://support.free-tone.com",
    "histogram": {
        "1": 3636,
        "2": 1028,
        "3": 2700,
        "4": 6897,
        "5": 31654
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/Dr9c5sSeZ9jmHPB7jcn_7bwgsqhK0-AxgjpHVMAKZjqfSCZqHc7bJATPABT7gTXfLc0=h310",
        "//lh3.googleusercontent.com/bmZWpGNNHmSkyZeOZeXqzJ4T7a0igeO_baueziowx9kTBi4y4ovSmsCdgY1YP4Ja7Pw=h310",
        "//lh3.googleusercontent.com/V9J28fiTXZyDtLIw879FbNv-KX9x_8g1Bg_hEAI4e8Hl5YMUk_dbJw2kT0KNxS35Wg=h310",
        "//lh3.googleusercontent.com/jCPZLic6znt3F9-aJdx7g9njNERpzuDWUM_q1iL15ncTH4IWBCY1jMKB_wjUm7oB5nY=h310",
        "//lh3.googleusercontent.com/8QTTFxCGkOX5h27uFM9uC9vnIEche--YX2GzFAgm4UeD0tnXHUu_oo6SJRJ3Bw1AkA=h310",
        "//lh4.ggpht.com/b5yuAh9WtwBEXs_t2b3yye3CPVrwljfwjfFrMCc13tr-uOc74DUV30aeDIWeWjptl-Kj=h310",
        "//lh4.ggpht.com/HfauvYTga1EZqmQpntH9nr0ZX6yCDm7GY_xhupi_aWTAAzXCfONd7S-a_f0jJW2XOM0=h310",
        "//lh3.ggpht.com/wZZaksKWuyuj3LaWnT-nIACBSJgUiGw1lWtlKAYK8CcBUPZViY4SlNYsBMnH3ZT5H1Y=h310",
        "//lh3.ggpht.com/gpgoN_2FRru1T_jJa-Mz9t5iBnfsT24riiqDEQxOUpq0BLpT_e-zL4aNTkOctYIhQIDO=h310",
        "//lh3.ggpht.com/U0NJhdJr5la9QU4fyS9sqKHFdqAl3VPPL69AyVfsGy8ksbonUiGVYPvsxe0bLphBjQk=h310",
        "//lh5.ggpht.com/okAshxOw7B0TKaa1Gw4I6P0EDEXcQgnJPe0nnV8u2ZX6Cnar6_g2WGbdWO2YRJIZ554T=h310"
    ],
    "comments": [
        "Keeps dropping calls due to popping ads mid call. I can hear others clearly but they keep saying I always sound like I am breaking up to them. It isn't performing as hoped. Had to call the power company 6 times just to try and complete a single conversation due to drops. Gave up after the last one.  Update:  still dropping important calls mid call.  Very aggravating and not dependable.  No response from the developer is bad",
        "I am so very disappointed with this app. I've used this for many years as my home phone number. But lately it has worked horribly. Constantly freezing and crashing. Not ringing, or any notification someone has text either. Now, even worse, it won't even open at all. I'm really unhappy, and I truly had such high hopes. Please fix, or lose a loyal customer of any years!!!",
        "Cool app they should really work on the ads the ads are pesky then sometimes the call sometimes and even when using WIFI and having actual service on your phone  still drops. This is not the Migos I don't need drop top service#facts LOL but I fuks with y'all so I don't know fix it",
        "It was fine before it start adding \"--sent from Freetone\" to every text.  I can understand ads as it added revenue to the company. This however is nothing but a bother.  This is an annoying tactic installed to bother you and your friends into purchasing a subscription hiding under the idea that its advertising to your friends, when in fact the lack of the  app telling people it was an app was the biggest draw, most people acted surprised and wanted the app as a cheap alternative line for texting, and calls.        The app working like it was a contract phone plan, but instead of monthly payment you pay with ads, Was an inspired idea. I fear the direction this app is going.",
        "Way to many adds the ahdds slow the texting and talk down and now there's so many adds its slowed the whole phone down and every time you go to text some one the adds get clicked instead of what you want to click on. This once was a great app but now has so many adds its has become almost unusable in my own opinion. I've had this app for over 5 years now and it has never been bad till now when I first got the app it was great but now needs fixed to get all the bugs out",
        "No matter the amount of wifi I have, it won't let me send anything, it says thay it failed, and when I try to resend it, it still wont send. When it actually sends it says sent from freetone, which is just crappy advertisement....."
    ],
    "recentChanges": [
        "📞 Easier access to the keypad, right from the bottom of the screen",
        "🐛 Fixes bugs and 🏎 Improves the performance of the app.",
        "🖋 Easily configure the signature attached to your SMS from the app settings screen.",
        "Let us know what you think!",
        "Our team works hard every day to improve your experience.",
        "📣 Have feedback? Shoot us an email at feedback@go-text.me",
        "🐞 If you have any issues, write us at support@go-text.me"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.textmeinc.freetone&hl=en&gl=us",
    "appId": "com.textmeinc.freetone"
}