{
    "title": "bkper",
    "summary": "The #1 Bookkeeping App for G Suite",
    "icon": "//lh5.ggpht.com/F0czI4wmcrcjghxvkI82pb1_yy6LTRoXBfB6bNmcE2VH7cTmTmFE6nXcY6oabOi6kRE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 137,
    "developer": "bkper Inc.",
    "developerId": "bkper+Inc.",
    "developerEmail": "contact@bkper.com",
    "developerWebsite": "http://bkper.com",
    "updated": "June 15, 2015",
    "version": "1.3.4",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Your books simplified securely on GoogleThis is a companion app for bkper.comEasily collect and keep all financial information centralized in a simple scheme of Accounts and Transactions, collaborating with real-time balance sheet and shared financial statements.It can be used to manage household finances, small business and startups accounting or for expense reports, keeping track of earnings and expenses of your team in a centralized way, offering you a real time snapshot on your equity and net profit. By the App you can:- Easily record financial transactions, as notes, with a single line of text, online or offline.- Take pictures and attach them to your transactions.- Get suggestions based on your previous record's locations or places around you.- Use the widget for two-touch recording.- Integrated with Google Now (\"OK Google Now, take note...\")- Keep your data safe and secure in the Google Cloud.On the WEB you can:- Post, edit and reconcile.- Do advanced searches.- Generate reports.- See transaction's locations on Map.- Share and work together on the same Ledger.- Use Google Docs and Sheets Add-ons to manage your data among spreadsheets and documents.- Create and customize ledgers for yourself, your project, or business.- Integrate Google Apps or other systems, through an easy-to-use Google Apps Script API or a REST API.bkper uses your data history to help organize information. The more you use it, the smarter it gets.",
    "descriptionHTML": "Your books simplified securely on Google<br><br>This is a companion app for bkper.com<br><br>Easily collect and keep all financial information centralized in a simple scheme of Accounts and Transactions, collaborating with real-time balance sheet and shared financial statements.<br><br>It can be used to manage household finances, small business and startups accounting or for expense reports, keeping track of earnings and expenses of your team in a centralized way, offering you a real time snapshot on your equity and net profit.<br><br><br> By the App you can:<br><br>- Easily record financial transactions, as notes, with a single line of text, online or offline.<br><br>- Take pictures and attach them to your transactions.<br><br>- Get suggestions based on your previous record&apos;s locations or places around you.<br><br>- Use the widget for two-touch recording.<br><br>- Integrated with Google Now (&quot;OK Google Now, take note...&quot;)<br><br>- Keep your data safe and secure in the Google Cloud.<br><br><br>On the WEB you can:<br><br>- Post, edit and reconcile.<br><br>- Do advanced searches.<br><br>- Generate reports.<br><br>- See transaction&apos;s locations on Map.<br><br>- Share and work together on the same Ledger.<br><br>- Use Google Docs and Sheets Add-ons to manage your data among spreadsheets and documents.<br><br>- Create and customize ledgers for yourself, your project, or business.<br><br>- Integrate Google Apps or other systems, through an easy-to-use Google Apps Script API or a REST API.<br><br><br><br>bkper uses your data history to help organize information. <br><br>The more you use it, the smarter it gets.",
    "histogram": {
        "1": 5,
        "2": 5,
        "3": 13,
        "4": 26,
        "5": 88
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/qg732bg8nEgqlfNp9QoLjfBfiYg0HbPzg9OBrTRtnBM511JS3A67zR7VtAi8ec1Wpw=h310",
        "//lh5.ggpht.com/9fxJuqyo42wCOd_bD9hrjJwP4YQYRw3Vc3u141JTS9BM-i4FkI9ZnbOxcFQu78s_CrDe=h310",
        "//lh3.ggpht.com/J4iBIREGZIAjlGqDGxtIFDLvoiS6iYqMW_o0a6sn6LiomAPSOULOqMuHWI_vWiT-wGIS=h310",
        "//lh3.ggpht.com/P_wU7hIVMRzu7Ykk9VikJhlB4bgqAf8KovnFagdXHgd5acA8wHdvBIHlmpOhT7XyDw=h310",
        "//lh5.ggpht.com/UhnvddiJKY2nSlrOVjFdv3y9b5r4pky4pJF4D9FZrkNDn7BnK72khl0m43tSaVfhAW4=h310",
        "//lh5.ggpht.com/hfjI7vMbaKHJPsQRBBB7afIVtUV5nA8s9Otk16FV6sDpynGxVmJHV__2TusciHigLQ=h310",
        "//lh6.ggpht.com/i4UtxRLPwvdlIjTZ1hJqUNXZKx7tV9TgOJSpFIw1mVeIMbd6ajK8ZGzWMcNsENnrnQ=h310"
    ],
    "comments": [
        "This is perfect. Simple and easy to setup. There are a couple really minor things that aren't super easy to understand but even with those I'd still give it a 5 star. The reason I'm giving it a 4 star is for one other simple reason and it's because it is missing THE most important function, yet again, quite simple. A way to select which accounts to tally and display to let you know how much cash flow you have. For example. If you have debts and bills and things like that, but you've got an income and some cash from your last paycheck that you can use for your own entertainment, a way to select which accounts are relevant and have a way to display the tally. This way, as you purchase things and add to your ledger, you still have a way to look up what you're at overall in your finances to help decide if the next purchase is something you should spend your money on.   Add that, and it's a 5 star app. GREAT. Hope they add it.",
        "This app is perfect for small business, individuals, personal finance, and freelancers.   It is intuitive flexible enough that you can actually start capturing information immediately.    It is flexible enough that you can build and modify your chart of accounts on the fly.   Unlike the high-end commercial bookkeeping software, it does not require you to learn lots of irrelevant details and settings to conform to a complicated API.  Batch importing and exporting is straightforward and if you take just a few minutes to review the concise tutorials, it will save you even more time, as well.   The pricing and subscription model is perfect for individuals and freelancers.   The tech support is unbelievably responsive. I made a stupid error that caused a major problem, and the software team responded to my email and solved the problem within minutes. I was astounded.     Seriously. I am not given to raving about the software I use. But  this is a fantastic product with fantastic support, that integrates perfectly with Google sheets.   If you just want to get to work and don't want to deal with complex proprietary software and data formats, this is the bookkeeping software you need.",
        "Too Many Design Flaws Too many to list.  If it wasn't free I would ask for a refund.",
        "The Mobile app is too backdated it seems How come its not like the web app that is if we could see the previous transaction it would really help a lot plus the accounts too that is the new accounts open page",
        "I can set mine and all my employees accounts and record transactions on the go. Love it.",
        "Helping my company Bkper has been so useful !"
    ],
    "recentChanges": [
        "- Added support to \"Record Only\" permission"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bkper.mobile.android&hl=en&gl=us",
    "appId": "com.bkper.mobile.android"
}