{
    "title": "Free Antivirus and Security",
    "summary": "The free antivirus that protects your mobile or tablet from viruses and malware.",
    "icon": "//lh3.googleusercontent.com/AWOVixs9HKVoiuqDCA7qpJ3B8eI-ec5RyZbxOrDDcrnqhQ13T3nRfTkqAxBgjEzTvgY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 26257,
    "developer": "Panda Security",
    "developerId": "5566796063216823721",
    "developerEmail": "android@pandasecurity.com",
    "developerWebsite": "http://www.pandasecurity.com",
    "developerAddress": "Santiago de Compostela, 12\n48003 Bilbao",
    "updated": "November 28, 2017",
    "version": "3.2.5",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Panda Mobile Security, the free antivirus for Android™ developed by Panda Security, protects your smartphone and tablet against viruses, malware and spyware. And not only that: it also protects user privacy by blocking those apps that access confidential data without permission. And now, you can use it from your Android Wear™ smartwatch as well! Download your antivirus for free!Panda Security's free antivirus provides complete protection against viruses, spyware and any other type of malware that attempts to access your Android™ device. Today, privacy attacks and phone and tablet theft are increasingly common. Block any malicious apps installed on your device or locate the thief that stole your smartphone thanks to Panda Mobile Security’s Anti-Theft feature.Our free antivirus includes the following:App features:Protection• Real-time antivirus: Panda Mobile Security automatically scans every app that you download before you use it. The antivirus scans all apps that you install as well as their updates.   • You can also run on-demand scans to detect viruses, spyware or malware on files or multimedia content. And now you can scan your smartphone or tablet right from your smartwatch as well!• SD card scanning: Use our antivirus to scan any SD card that you insert into your Android™ device.Privacy AuditorThe Privacy Auditor shows the permissions required by the apps installed on your device (access to contacts, bank account data, photos, your location, etc.). Speed up your devicePanda Mobile Security maximizes the performance and battery life of your smartphone and tablet, analyzing in real time the activity of the apps installed on your device. Improve the speed, performance and memory usage of your device.   Anti-Theft and phone locatorTrack your stolen or lost device with the GPS location system:• Locate your phone remotely and in real time.• Lock your phone remotely: Prevent strangers from using your phone or accessing your personal information. • Remote wipe: Delete all information stored on your lost or stolen smartphone or tablet and prevent anyone from accessing your confidential data on the device or its SD card.Not even the best antivirus solution can prevent phone theft or loss. In these situations, the phone’s Anti-Theft and location features can prevent your device from falling into the wrong hands. You can also locate and lock your phone remotely from your smartwatch. Pro features• Call Blocker: Add phone numbers to your blacklist and stop unwanted calls (new permissions needed: access to the phone and access to contacts).• Theft Alerts: If someone steals your phone or tablet, you will get a photo of the thief after three failed attempts to unlock the device. The photo will be sent to you via email along with the device location.•App Lock: PIN-protect access to your apps (Facebook, Whatsapp, Instagram, etc.), keeping your and your family’s privacy safe from prying eyes. • Motion Alert: An alarm will warn you if someone picks up your device without your permission.• ‘Anchor’ your smartphone or tablet to your smartwatch: An alarm will go off if your device moves too far away from your watch.• Remote Alarm: Trigger an alarm on your lost or stolen device remotely from your smartwatch. • Remote Photo: Take a photo with your device remotely from your Android Wear™ smartwatch.This app uses the Device Administrator permission.",
    "descriptionHTML": "<b>Panda Mobile Security</b>, the <b>free antivirus</b> for Android&#x2122; developed by Panda Security, protects your smartphone and tablet against viruses, malware and spyware. And not only that: it also protects user privacy by blocking those apps that access confidential data without permission. And now, you can use it from your Android Wear&#x2122; smartwatch as well!<br><br> <b>Download your antivirus for free!</b><br>Panda Security&apos;s <b>free antivirus</b> provides complete protection against viruses, spyware and any other type of malware that attempts to access your Android&#x2122; device. <br>Today, privacy attacks and phone and tablet theft are increasingly common. Block any malicious apps installed on your device or locate the thief that stole your smartphone thanks to <b>Panda Mobile Security</b>&#x2019;s Anti-Theft feature.<br><br>Our <b>free antivirus</b> includes the following:<br><u><b>App features:</b></u><br><u>Protection</u><br>&#x2022; Real-time antivirus: Panda Mobile Security automatically scans every app that you download before you use it. The antivirus scans all apps that you install as well as their updates.   <br>&#x2022; You can also run on-demand scans to detect viruses, spyware or malware on files or multimedia content. And now you can scan your smartphone or tablet right from your smartwatch as well!<br>&#x2022; SD card scanning: Use our antivirus to scan any SD card that you insert into your Android&#x2122; device.<br><u>Privacy Auditor</u><br>The Privacy Auditor shows the permissions required by the apps installed on your device (access to contacts, bank account data, photos, your location, etc.). <br><u>Speed up your device</u><br>Panda Mobile Security maximizes the performance and battery life of your smartphone and tablet, analyzing in real time the activity of the apps installed on your device. Improve the speed, performance and memory usage of your device.   <br><br><u>Anti-Theft and phone locator</u><br>Track your stolen or lost device with the GPS location system:<br>&#x2022; Locate your phone remotely and in real time.<br>&#x2022; Lock your phone remotely: Prevent strangers from using your phone or accessing your personal information. <br>&#x2022; Remote wipe: Delete all information stored on your lost or stolen smartphone or tablet and prevent anyone from accessing your confidential data on the device or its SD card.<br>Not even the best antivirus solution can prevent phone theft or loss. In these situations, the phone&#x2019;s Anti-Theft and location features can prevent your device from falling into the wrong hands. <br>You can also locate and lock your phone remotely from your smartwatch. <br><u>Pro features</u><br>&#x2022; Call Blocker: Add phone numbers to your blacklist and stop unwanted calls (new permissions needed: access to the phone and access to contacts).<br>&#x2022; Theft Alerts: If someone steals your phone or tablet, you will get a photo of the thief after three failed attempts to unlock the device. The photo will be sent to you via email along with the device location.<br>&#x2022;App Lock: PIN-protect access to your apps (Facebook, Whatsapp, Instagram, etc.), keeping your and your family&#x2019;s privacy safe from prying eyes. <br>&#x2022; Motion Alert: An alarm will warn you if someone picks up your device without your permission.<br>&#x2022; &#x2018;Anchor&#x2019; your smartphone or tablet to your smartwatch: An alarm will go off if your device moves too far away from your watch.<br>&#x2022; Remote Alarm: Trigger an alarm on your lost or stolen device remotely from your smartwatch. <br>&#x2022; Remote Photo: Take a photo with your device remotely from your Android Wear&#x2122; smartwatch.<br><br>This app uses the Device Administrator permission.",
    "histogram": {
        "1": 1907,
        "2": 928,
        "3": 2004,
        "4": 4637,
        "5": 16781
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/LLYLKjxrlQTghNPfW8ljVqgR_B7vJlNLbk16dSL1K0OIqBd-n0pvoB7bjbgZmIPWArk=h310",
        "//lh3.googleusercontent.com/jVKjvZrvbQwWE_3QAQsr7Mxa4ZjTaqkB5sexN_xhvL7WQwg5i4eDCgUMiCHDdZdThn0=h310",
        "//lh3.googleusercontent.com/Xp6-Un2Xsl1wDNsi54MsmXaoC6H-iI5lA14i2lEiUwa9NlcyH_T32henkDc_xdHSKTM=h310",
        "//lh3.googleusercontent.com/V5-wpxIXUbsuQu7x7DYdcUD5VWzLcFO1WikRm8KfLpXQCEzUazLMv_fZtyFHIR4oV98=h310",
        "//lh3.googleusercontent.com/dq_gf7ZCj9seUC7kyLpQH3sGDOwbtjJ4yl8yulf67ctwbPk_LMOo7IMU2lYf_fMuunM=h310",
        "//lh3.googleusercontent.com/Mc9ybyg5ZaIyZpyWY3BtOI7zG_DGmVMIfi9MAofFAUBjSko4d-lFkIe94OqVJ6XH2g=h310",
        "//lh3.googleusercontent.com/miratSTuM_oew94w_hbvoO8MxlW3rI2VYNLV-ixTInBDey4ty0NIJNER2vlb0HYm4w=h310",
        "//lh3.googleusercontent.com/iYWciULl46leMhE0sJTyXYni32XcT6_w-obE1tib9fH0nVWAS37XOQjZC5YTuOzmjLY=h310",
        "//lh3.googleusercontent.com/RuV3R8R44fItZU1Nd44Kvi7Q18IniLttz2BEUcxKIMUlg5qwfkcYuOYmjFpVCW8gdbw=h310",
        "//lh3.googleusercontent.com/68lfnlcB1UOu9hT-ndleGdlsBBQl7STCtgsXIbm4cXYC94GdNsMWd7I8VCtDpi2YRuqP=h310",
        "//lh3.googleusercontent.com/4BYQwy9Kfm5L6GrarcaL3HInC-4fSBvobNux5u00TCTod72KG_u3WEQQcBY_zByKCXs=h310",
        "//lh3.googleusercontent.com/Sqw0cbHE3RQC0-7Hef8kfeC5aCRFVL_g4CoqjIE6LzGuzcOly27hzD_jmCSYrKj_PXI=h310",
        "//lh3.googleusercontent.com/PxU1sUA8lfNyWhccAgzJrn393WmLUZcol1BtW6ru-8HIXMvlQ6N52j_FENNOW3iSxpY=h310",
        "//lh3.googleusercontent.com/Ko-hyKa-A3QMJ5HSlVJdGza9ce_wm1EEuPobUiv_hzdA3RoXqusqyBKkiyjm-VefFhri=h310",
        "//lh3.googleusercontent.com/pgb18JSzzbyRgzqucPO_kyCGD1veeonm-ZR-og5bR68dPy4JpmYZvi3IK_z61V-_nz8=h310",
        "//lh3.googleusercontent.com/RJg92jkv_uCgdWT2-hdWoL72DSVbIewsWOUmvgGF1bXCmAf7IvutRP3WSwnooMJSlyjJ=h310",
        "//lh3.googleusercontent.com/WZTfDnjuWnuOpi_HCtORz4u8LCYJ2trngMUiXje5P1SeA1pDJGwAR2X6VanLmtT6J0Q=h310",
        "//lh3.googleusercontent.com/7K_ElLzMcwDvoE-6GJBf0AOdgVV8gDM3dHSznJAqWLYxY6o-xxot-9TbKaHCnAOFB_G0=h310",
        "//lh3.googleusercontent.com/liTv2dXnNboEtDx0BZ_nwJur2iKxaCZ1z1Ig6KszneCeSW5AVvJhU3Txn-liFYjFrg=h310",
        "//lh3.googleusercontent.com/XB6YFOOXSLcXXuz1GxBKzGJVMW9wHMLmK007o3o73QrhbANu6IZ3MVGde7CvrbiwIek=h310",
        "//lh3.googleusercontent.com/rozVkQwswi23TF0weE-qtgfQ2bCTpTAvle8yTsgZr4fvlJw5HCtyi_S1kdHFeO7xyNVS=h310",
        "//lh3.googleusercontent.com/weXc_r6FUePURaS_5vPap6ItWwU6MJmm27IKzSZmB2-dlDXDgg765pX1mcBV4mm6V9k=h310",
        "//lh3.googleusercontent.com/VmUe_7O7oMtHECck7-W8nqcXaGlYS1hZoV3oh-RrjnkEnE8s9Nx3omk_NgpIm0Ex6g=h310",
        "//lh3.googleusercontent.com/jIIGLTh1ny92b-saKpDIOhhpEIG87MfYI_fosRHuxFhHRq4sMbzhNsXBLmgXLdiBJw=h310",
        "//lh3.googleusercontent.com/swznJnhj2NgbYTmw87nPP8DE4A9AWFAKAnzqzPnvFhOpe_UeG3RHIiqi_aKUTAqeJsg=h310",
        "//lh3.googleusercontent.com/sqzZVw6Q33_oTj_k4CDtEF8r_-xCvKo1ELpL1BcMwvVX2UJ6ZApgVIdmSYugfKTkATlv=h310",
        "//lh3.googleusercontent.com/Fa-pRJeqKnvv7NaI7jZRWm9E-WMic9Nbq_Yege1H52tfoJU4ACoyMm-GNzSiBTLwo_FD=h310",
        "//lh3.googleusercontent.com/SKWVZMFhh86I23rQ7FWL4K99CRnA2FHVmWzyUif0UfDLR-uYgGHwDw20NstpF-cg1Brs=h310"
    ],
    "comments": [
        "Have to reload it once a month and if you renew you will spend time on the phone with non english speaking folks that are dumb as dirt. When I asked to speak to someone else he claimed to be the only person there and for me to call back tomorrow to talk to an English speaking person. Why do they sell an English version but no English tech support?  The Software work ok when combined with Malwarebytes. Tech support is a 3 ring circus!",
        "I very like this app, but the pictures from anti-thief are so dark, not possible see who handle my cell phone. No have time for camera adjust your brightness sensor, please fix it. No more problems found.",
        "I use Panda across my devices: it's on my tablet, phone, and laptop. I have the paid version on my phone and will probably eventually have it on my other devices, as well. But the free version is really great, too. One of my favorite features that not every antivirus has is the privacy auditor. Sure, you can check app permissions individually, but the privacy auditor tells you with one glance if any are sketchy. Such a light antivirus, too! It's not bogged down with bloatware. The only reason why I remember it's there is because it makes me feel safer. I've had zero problems using Panda. It's a really good brand. Oh! And one more, small thing: I love how it tells you that it's a wonderful day! Such a friendly app, in more ways than one!",
        "This app is awesome! I have it on my tablet. It's free. I only have one free anti virus app on my tablet and that's Panda Mobile Security.😀 It protects me from any harm such as someone from the internet or some app  that may try to steal my money or payment information.",
        "You worry too much about fake license that I have a hard time keying into 5 phones within my family that now the account got mix up. Yes all have paid license. Btw you are to ambitious and greedy in wanting your customers to subcribe for 5 devices and 3years. I had to just change 2phones and swap the email account but your software do not setup to follow according to the google account eventhough say I have paid for my son's account. But after keying the given license I am still stuck to another email eventhough I have paid and extended for both. Boy I cannot wait for product to expires than I moving to another brand. And now I have paid for license that is suppose to work but not even working or able to function properly. When will you help. Till expiration date????",
        "Never completes a scan, just runs endlessly on the last app.  Apparently no way to select the SD card or even an emulated SD card to scan.  So, useless to me..."
    ],
    "recentChanges": [
        "- UI improvements.",
        "- Bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pandasecurity.pandaav&hl=en&gl=us",
    "appId": "com.pandasecurity.pandaav"
}