{
    "title": "NextTransit Seattle",
    "summary": "Fast, intuitive, and smart offline transit app for King County.",
    "icon": "//lh3.ggpht.com/9c7tI8oOeHV4QfoDRDIetzJaqEmevxlBTppO_8TGEPL82uhfbfflyQKSj0UWWj-pVrc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3,
    "reviews": 39,
    "developer": "Kinetiqa Labs",
    "developerId": "Kinetiqa+Labs",
    "developerEmail": "nexttransit@outlook.com",
    "developerWebsite": "http://secondarytask.com/kinetiqalabs",
    "updated": "April 15, 2014",
    "version": "2",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "description": "Fast, intuitive, and smart offline transit app for the King County and Seattle region. Contains complete King County bus and Link light rail schedules including route and stop time info. NextTransit features instant access to stops saving you precious time looking it up online. NextTransit core features requires absolutely no data or WIFI to run!Features:☆ Quick search: Search stops by stop code or street name. Fetches the upcoming buses and their times under a second (literally!)☆ Route search: Search buses by route number or destination. View a list of stops and select on any of them to view upcoming stop times.☆ Maps: Quickly view all the bus stops on a map and find the one you're looking for. Click on the map icon under the routes view to view the route on a map.☆ Reminders: Receive recurring notifications of what upcoming buses there are for a particular stop☆ Flexibility: Navigate between weekday, Saturday, or Sunday/Holiday schedules or pick the time you want to leave a given stop by selecting on the clock icon after you've looked up a stop.☆ Favorites: Store any stop or route for quick access by selecting the 'plus' icon near the bottom at any time.☆ Nearby stops:Find nearby stops without using internet/data! NextTransit calculates the distance to and orientation you should point your phone to get to each stop!Please note: Once unpacked, NextTransit will require approx. 45 MB of space on your phone memory. NextTransit may take up to a few minutes (depending on the device) on first launch to build the database on your phone. Fine PrintThis app is ad-supported. We are not affiliated with King County Metro. Coded with care on the UBC Vancouver campus.",
    "descriptionHTML": "Fast, intuitive, and smart offline transit app for the King County and Seattle region. Contains complete King County bus and Link light rail schedules including route and stop time info. NextTransit features instant access to stops saving you precious time looking it up online. NextTransit core features requires absolutely no data or WIFI to run!<br><br>Features:<br><br>&#x2606; Quick search: Search stops by stop code or street name. Fetches the upcoming buses and their times under a second (literally!)<br><br>&#x2606; Route search: Search buses by route number or destination. View a list of stops and select on any of them to view upcoming stop times.<br><br>&#x2606; Maps: Quickly view all the bus stops on a map and find the one you&apos;re looking for. Click on the map icon under the routes view to view the route on a map.<br><br>&#x2606; Reminders: Receive recurring notifications of what upcoming buses there are for a particular stop<br><br>&#x2606; Flexibility: Navigate between weekday, Saturday, or Sunday/Holiday schedules or pick the time you want to leave a given stop by selecting on the clock icon after you&apos;ve looked up a stop.<br><br>&#x2606; Favorites: Store any stop or route for quick access by selecting the &apos;plus&apos; icon near the bottom at any time.<br><br>&#x2606; Nearby stops:Find nearby stops without using internet/data! NextTransit calculates the distance to and orientation you should point your phone to get to each stop!<br><br><br>Please note: Once unpacked, NextTransit will require approx. 45 MB of space on your phone memory. NextTransit may take up to a few minutes (depending on the device) on first launch to build the database on your phone. <br><br><br>Fine Print<br>This app is ad-supported. We are not affiliated with King County Metro. Coded with care on the UBC Vancouver campus.",
    "histogram": {
        "1": 15,
        "2": 2,
        "3": 3,
        "4": 6,
        "5": 13
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "2.3.3 and up",
    "androidVersion": "2.3.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/IN5rNpFDqPWr5UKrTNEsUzQfc5GkZoDHY4_4_DOXNxxffX861o3iOAFZmTmmskRkkJw=h310",
        "//lh6.ggpht.com/veOdWpFA59h_IcxGKo0CZHuMxlDdNVvH26hT_wpywiOBobomWLLRrfgFuy8nTdbQqg=h310",
        "//lh3.ggpht.com/TtryH7s7C4D4PvNNU04IDDvkkYT-vuykUaJffAVQL94_wSbnfi4SisPwp1obuJuqJcA=h310",
        "//lh3.ggpht.com/qgJjdQVtAKSbbtxa36V50xDoWar0m9ZnSWL1IcXSGePchmz-5kFFWPWfaV1skIA7ZeE=h310",
        "//lh6.ggpht.com/u9kSbRdA2WYdrEbrr8cfIPsXUL72rStUE_nRePX1JLRF4-vbEJwGtg0e9uTvF2O6eQ=h310",
        "//lh6.ggpht.com/HA3LcQlPaZth3m9Q36hR_0Kl6E2jlBMJZbWQwYhwpt1FxBJJXVzrTPUQ03vp_q7MBA=h310",
        "//lh3.ggpht.com/cCLoLb64V1OBTToo4M6oZ1SGNFNeNKUw-L6iRaNksl7bAnDnzjRvFX3_3bH6opKGN3Y=h310",
        "//lh6.ggpht.com/h4J00Gt3mmOVwutkokpc7NC33fYW8meA7Efa-g-hYFz5ISM1Bp6jCGIT2HBbf-zOFJU=h310",
        "//lh5.ggpht.com/QycoyReW73abbl6sEkRH0UwWTZVKMcKpKo3e4StFRrisgS-gBRqb27DE80MMb6mdgQ=h310",
        "//lh5.ggpht.com/8czazoD42P1axECXWHJGydfniTSIwW_0Z95kllBXMWKdvNJECjYXb3KSHDHh7_3neAU=h310"
    ],
    "comments": [
        "Useless Will not let you select stops from list when using planner.",
        "Not user friendly. Tried more than once to use and had the wrong times each attempt.",
        "Poor After update, it said the routes im trying to find do no exist.... Wished it wasnt updated at all!! This sucks",
        "Fails then crashes Zero on this app",
        "Crap Tried to look up a route but nothing popped up. Waste of space and time",
        "Wrong list of buses It didn't show the right buses for stop 843. Unistalled"
    ],
    "recentChanges": [
        "Version 2.0",
        "- New fluid layout and design",
        "- Updated schedules",
        "- Set reminders to get automatic bus schedules notifications"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.kinetiqa.nexttransitseattle&hl=en&gl=us",
    "appId": "com.kinetiqa.nexttransitseattle"
}