{
    "title": "Map My Fitness Workout Trainer",
    "summary": "MapMyFitness tracks the route, distance, pace, and more in real-time using GPS.",
    "icon": "//lh3.googleusercontent.com/LvO76KFrhLUd6Ydz4Fh8kqNi9q5TVHRYS5mjPF3Fr4ibcT2zpCuOCyDNN3BEOLJnsBQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.4,
    "reviews": 36293,
    "developer": "MapMyFitness, Inc.",
    "developerId": "MapMyFitness,+Inc.",
    "developerEmail": "support@mapmyfitness.com",
    "developerWebsite": "http://www.mapmyrun.com",
    "developerAddress": "211 Walter Seaholm Drive\nSuite 200\nAustin, TX 78701",
    "updated": "March 1, 2018",
    "version": "18.2.3",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Track and map every workout with MapMyFitness and get feedback and stats to improve your performance. Discover new workout routes, save and share your favorites, and get inspired to reach new fitness goals with a community of over 40 million athletes. Whether you’re a beginner doing your first workout or a pro, you’ll find the features and tools you need to stay on track and motivated along the way.- Voted Best All-Inclusive Fitness App by Live Science.- Named One of the Best Fitness Apps for Your Wearables by Wareable.TRACK AND MAP YOUR WORKOUTS- Log over 600+ activities with the largest selection of activity types, including: running, cycling, walking, gym workouts, cross training, yoga, and more.- Get audio feedback on every GPS-tracked workout, with customizable voice feedback for stats like pace, route, distance, calories, and elevation.- Connect with 400+ devices to import and analyze all your data in one place.- Add your running shoes and track mileage with Gear Tracker. Get notified when it’s time for a new pair and avoid injuries.- Use Routes to find nearby places to workout, save your favorite paths, add new ones, and share them with others.CONNECT WITH APPS AND WEARABLES- Track your activity with the Android Wear app and view your progress at a glance.- Let your shoes do the tracking with UA Record Equipped connected shoes that automatically track your activity and sync your data with your MapMyFitness app.- Sync your data with the hottest apps and wearables, including Google Fit, Android Wear, Garmin, Fitbit, Jawbone, and more.- Take control of your nutrition by connecting with MyFitnessPal for a comprehensive look at your calorie intake and burn.JOIN THE COMMUNITY- See what your friends are doing on your Activity Feed. Whether just getting into fitness, or competing to win—there’s always someone there to motivate you. - Get social and share your workouts on Facebook and Twitter.- Join Challenges to compete with others, climb the leaderboard, and win awesome prizes.TRAIN LIKE A PRO WITH MVP PREMIUM FEATURES- Become a premium member for an ad-free experience with special features.- Reach your fitness goal with a personal training plan which adapts dynamically to your fitness level as you improve.- Monitor & analyze your Heart Rate zones to adjust your training based on your goal.- Set a target for your fitness and stay on track with audio coach updates, including pace, distance, duration, calories & more.- Use Live Tracking to share your real-time workout location and give loved ones peace of mind.- Access additional premium features on MapMyFitness.com.If you upgrade to a premium MVP subscription, payment will be charged to your Google Play account at confirmation of purchase. The monthly subscription costs USD 5.99 per month, while the yearly subscription costs USD 29.99 per year, or USD 2.50 per month. Your subscription renews automatically unless canceled at least 24 hours prior to the end of the current period. There is no increase in cost when renewing.Subscriptions can be managed and auto-renewal turned off in Account Settings under ‘Subscriptions’ in the Google Play Store after purchase. Once purchased, the current period cannot be canceled. Any unused portion of a free trial period is forfeited if you choose to purchase a premium subscription to MVP.Find the full terms and conditions and our privacy policy at https://account.underarmour.com/privacy_and_terms.Note: Continued use of GPS running in the background can dramatically decrease battery life.MapMyFitness is part of the world’s largest digital health & fitness community, Under Armour Connected Fitness, which includes UA Record, MapMyFitness, Endomondo, & MyFitnessPal. These apps were built to empower healthy and active lifestyles with one mission – to make you better.",
    "descriptionHTML": "Track and map every workout with MapMyFitness and get feedback and stats to improve your performance. Discover new workout routes, save and share your favorites, and get inspired to reach new fitness goals with a community of over 40 million athletes. Whether you&#x2019;re a beginner doing your first workout or a pro, you&#x2019;ll find the features and tools you need to stay on track and motivated along the way.<br><br>- Voted Best All-Inclusive Fitness App by Live Science.<br>- Named One of the Best Fitness Apps for Your Wearables by Wareable.<br><br>TRACK AND MAP YOUR WORKOUTS<br>- Log over 600+ activities with the largest selection of activity types, including: running, cycling, walking, gym workouts, cross training, yoga, and more.<br>- Get audio feedback on every GPS-tracked workout, with customizable voice feedback for stats like pace, route, distance, calories, and elevation.<br>- Connect with 400+ devices to import and analyze all your data in one place.<br>- Add your running shoes and track mileage with Gear Tracker. Get notified when it&#x2019;s time for a new pair and avoid injuries.<br>- Use Routes to find nearby places to workout, save your favorite paths, add new ones, and share them with others.<br><br>CONNECT WITH APPS AND WEARABLES<br>- Track your activity with the Android Wear app and view your progress at a glance.<br>- Let your shoes do the tracking with UA Record Equipped connected shoes that automatically track your activity and sync your data with your MapMyFitness app.<br>- Sync your data with the hottest apps and wearables, including Google Fit, Android Wear, Garmin, Fitbit, Jawbone, and more.<br>- Take control of your nutrition by connecting with MyFitnessPal for a comprehensive look at your calorie intake and burn.<br><br>JOIN THE COMMUNITY<br>- See what your friends are doing on your Activity Feed. Whether just getting into fitness, or competing to win&#x2014;there&#x2019;s always someone there to motivate you. <br>- Get social and share your workouts on Facebook and Twitter.<br>- Join Challenges to compete with others, climb the leaderboard, and win awesome prizes.<br><br>TRAIN LIKE A PRO WITH MVP PREMIUM FEATURES<br>- Become a premium member for an ad-free experience with special features.<br>- Reach your fitness goal with a personal training plan which adapts dynamically to your fitness level as you improve.<br>- Monitor &amp; analyze your Heart Rate zones to adjust your training based on your goal.<br>- Set a target for your fitness and stay on track with audio coach updates, including pace, distance, duration, calories &amp; more.<br>- Use Live Tracking to share your real-time workout location and give loved ones peace of mind.<br>- Access additional premium features on MapMyFitness.com.<br><br>If you upgrade to a premium MVP subscription, payment will be charged to your Google Play account at confirmation of purchase. The monthly subscription costs USD 5.99 per month, while the yearly subscription costs USD 29.99 per year, or USD 2.50 per month. Your subscription renews automatically unless canceled at least 24 hours prior to the end of the current period. There is no increase in cost when renewing.<br><br>Subscriptions can be managed and auto-renewal turned off in Account Settings under &#x2018;Subscriptions&#x2019; in the Google Play Store after purchase. Once purchased, the current period cannot be canceled. Any unused portion of a free trial period is forfeited if you choose to purchase a premium subscription to MVP.<br><br>Find the full terms and conditions and our privacy policy at https://account.underarmour.com/privacy_and_terms.<br><br>Note: Continued use of GPS running in the background can dramatically decrease battery life.<br><br>MapMyFitness is part of the world&#x2019;s largest digital health &amp; fitness community, Under Armour Connected Fitness, which includes UA Record, MapMyFitness, Endomondo, &amp; MyFitnessPal. These apps were built to empower healthy and active lifestyles with one mission &#x2013; to make you better.",
    "histogram": {
        "1": 1180,
        "2": 699,
        "3": 1922,
        "4": 10505,
        "5": 21987
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/9KEn6uKsOHx554IfLzUs9hOtxcEtLAGVFmOj9r1cG6pLtmsXnKTqdcW7RPQtzoVqYa4=h310",
        "//lh3.googleusercontent.com/UB0ImMKrHCi4rRinifhwHrZrU6SV-63hOBHkdctKVYR1DyC10Vu3m7Jvf7xi9mfKhw=h310",
        "//lh3.googleusercontent.com/WsTNQsqPOSZGQCP60rAJWlndnCfdQYi7Tz938RNNNQRWK3RCWm7qwmNlpTkEq5RlMw=h310",
        "//lh3.googleusercontent.com/o0hrh3SiT3z9AZGDKY_GyawHd80IJ_at6naEKMZ2KNAaTBKixS3eyNroT0B5GpnT_A=h310",
        "//lh3.googleusercontent.com/Vo-BGyAimUdNwGFLCIJtT28kHNtFXZzoKN829HudeSpE5CQMLu08R47PZqdWUau5LPY=h310",
        "//lh3.googleusercontent.com/QuA6v_dz7KLht8Mb33N-g6_sEYTRtJSXtRF3B7gJ13nyoxEb4lH7etHbajVIl4ghxH0=h310",
        "//lh3.googleusercontent.com/T9v32WOY4sJj3jRjovXf5BJq1okvEaujDpRxZD42MbRKRZDSNcB978ky0CBSegG9e1Jy=h310",
        "//lh3.googleusercontent.com/nnjqaeKPo5sczx1oiDRATOmFSb9_YAt8JXen0MJVOTLzKsPWjS-KiFYwWT6Kh5f4kWg=h310",
        "//lh3.googleusercontent.com/EzW2AhfebZPR89VSAfVhxNsG6XQ2_nupk3X-hx34PfdFsUPXfC_eYCxnv2eAL7B3QA=h310",
        "//lh3.googleusercontent.com/NmN810mhVpIFLZWm8yrc5D6FozPWJEDsl3-Vcv0ubzW4FNQ7bsLboY52hSBIZpZip2o=h310",
        "//lh3.googleusercontent.com/pUAbr5P8OPCzFve72xWu4ULFOh1lmy7Z1z9TJFFxlDWIbc_Tt3cn5N5NiXGb_jidaaE=h310",
        "//lh3.googleusercontent.com/n9FqNwi04bvN_yFHGgnuPPa1Iu_WY4J1xM5gklWMsgtoKYwAC1v3YiqacAS9kBbEyw=h310",
        "//lh3.googleusercontent.com/qAXlAmLOFBtYekhOK156dUx89e7Z65vy8N4PrMBb4BwuNctQK7tY4J6cV8hNx94hu4g=h310"
    ],
    "comments": [
        "I get very tired of daily fighting with the pop ups to upgrade or buy clothing and gear, and the Auto-Pause feature is horrible. I had to turn it off... But the app keeps track of my time and distance fine, and syncs with my Fitbit, so I'll keep using it.",
        "Free version is amazing! Just maybe stop with the Crying Baby ad that comes on after every log lately....I don't mind ads for free versions but that one is nasty loud when I'm logging in public, annoying total strangers 🤓 ps. Add more yoga other than sport please. Pretty sure my gentle yoga isn't burning 400 Cals in 20 minutes. But great app! Thanks for this one.",
        "This is a work in progress.  It takes a long time require GPS signals.  It isn't very good at switching activities and there doesn't appear to be a way to anti connect to Facebook... you have to manually select it each time.",
        "Great app runs in background as you listen to music and GPS very accurate. Had no issues so far love using it. Pity I can't sync it with my polar device.",
        "Excellent - only extra I would like is to see my kcal count over time as a graph so I can match it with my weight loss.",
        "GPS Signal off after update. Its saying I've done a mile, when I've only done half. Otherwise when this isnt an issue I adore an LOVE THIS APP"
    ],
    "recentChanges": [
        "* You spoke, we listened. The feed now defaults to the last tab you visited (Community, Friends, Me).",
        "* New ordering of items in the More menu.",
        "Under Armour Connected Footwear Users:",
        "* Receive periodic personalized coaching tips on the workout details page of runs completed with the latest Connected Footwear shoes with HOVR.",
        "* Only workouts > 2 minutes sync from your shoes to prevent unintended workouts.",
        "* Workouts synced from your shoes will now use your default workout privacy setting."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mapmyfitness.android2&hl=en&gl=us",
    "appId": "com.mapmyfitness.android2"
}