{
    "title": "Kites",
    "summary": "Discover the world, with messages where they matter.",
    "icon": "//lh4.ggpht.com/p6hGTsdyD6nVLwFXsP0x5s1JUnyMcAti1auAOCdBIxRpb09nV_zWUmngvybLZH531sfR=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.2,
    "reviews": 109,
    "developer": "White Monkey Labs",
    "developerId": "White+Monkey+Labs",
    "developerEmail": "hello@kitesapp.com",
    "developerWebsite": "http://www.kitesapp.com",
    "updated": "March 4, 2015",
    "version": "0.82.1",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "Discover the world through friends with Kites. Follow your friends' experiences so you can enjoy what they did, avoid what they didn't, try what they recommend and so much more. Even if you end up with a couple of hours free in your home town, you'll be surprised what you can discover from the comfort of your palm!    Kites is all about discovering and sharing. Share your thoughts about places you visit; restaurants, parks, bars, tours, plays, whatever! You can even leave kites privately for specific friends - which means you can even share things like personal memories and love notes! The more you share, the more knowledge you give your followers!    And you can do so much more:  • Browse publicly to see kites left by anyone, anywhere in the world  • Group kites into collections and show your friends things like 'The best places in Paris for a romantic stroll' or 'The best places in London to do nothing!'   • Star the kites you enjoy most, and Kites will start to learn what kind of experiences you enjoy, so it can become more relevant to you  • Collect stars to receive commendations and beat your friends!  • Set up alerts, by pinning kites, to remind you about places when you are nearby  And remember, Kites works best with friends, so get them on board to increase your network and unlock great discoveries around the globe!    Download Kites now and start leaving messages where they matter!    Don't forget to rate and +1 Kites above!  We love to hear from you - contact us at hello@kitesapp.com  Like Kites on Facebook - https://facebook.com/kitesapp  Follow Kites on Twitter - https://twitter.com/kitesapp    Here's a quick run down of why Kites needs the permissions it asks for:  • Identity: This lets us see the email addresses on your device so we make creating a new account one step shorter, and also lets you log in with Google Plus  • Contacts / Calendar: To see which of your contacts use Kites (your contact list will NEVER be uploaded to our servers). We don't use your calendar, but Android lumps these together (I know right..)  • Location: Kites wouldn't really work without being able to tell where you are• SMS: To let you tell your friends about Kites (we only send an sms when you ask us to)  • Photos / Media / Files: So you can set your profile picture from an image in your gallery  • Camera / Microphone: So you can take your profile picture directly. Again, we don't use your microphone, Android just puts them together  • Device ID & call information: This lets use see more details about your device, such as its make and model, so we can see which devices use Kites the most and optimise the experience. We don't use your call information    Wow, all the way to the bottom! Now download Kites and spread the message to your friends :)",
    "descriptionHTML": "Discover the world through friends with Kites. Follow your friends&apos; experiences so you can enjoy what they did, avoid what they didn&apos;t, try what they recommend and so much more. Even if you end up with a couple of hours free in your home town, you&apos;ll be surprised what you can discover from the comfort of your palm!  <br>  <br>Kites is all about discovering and sharing. Share your thoughts about places you visit; restaurants, parks, bars, tours, plays, whatever! You can even leave kites privately for specific friends - which means you can even share things like personal memories and love notes! The more you share, the more knowledge you give your followers!  <br>  <br>And you can do so much more:  <br>&#x2022; Browse publicly to see kites left by anyone, anywhere in the world  <br>&#x2022; Group kites into collections and show your friends things like &apos;The best places in Paris for a romantic stroll&apos; or &apos;The best places in London to do nothing!&apos;   <br>&#x2022; Star the kites you enjoy most, and Kites will start to learn what kind of experiences you enjoy, so it can become more relevant to you  <br>&#x2022; Collect stars to receive commendations and beat your friends!  <br>&#x2022; Set up alerts, by pinning kites, to remind you about places when you are nearby  <br>And remember, Kites works best with friends, so get them on board to increase your network and unlock great discoveries around the globe!  <br>  <br>Download Kites now and start leaving messages where they matter!  <br>  <br>Don&apos;t forget to rate and +1 Kites above!  <br>We love to hear from you - contact us at hello@kitesapp.com  <br>Like Kites on Facebook - https://facebook.com/kitesapp  <br>Follow Kites on Twitter - https://twitter.com/kitesapp  <br>  <br>Here&apos;s a quick run down of why Kites needs the permissions it asks for:  <br>&#x2022; Identity: This lets us see the email addresses on your device so we make creating a new account one step shorter, and also lets you log in with Google Plus  <br>&#x2022; Contacts / Calendar: To see which of your contacts use Kites (your contact list will NEVER be uploaded to our servers). We don&apos;t use your calendar, but Android lumps these together (I know right..)  <br>&#x2022; Location: Kites wouldn&apos;t really work without being able to tell where you are<br>&#x2022; SMS: To let you tell your friends about Kites (we only send an sms when you ask us to)  <br>&#x2022; Photos / Media / Files: So you can set your profile picture from an image in your gallery  <br>&#x2022; Camera / Microphone: So you can take your profile picture directly. Again, we don&apos;t use your microphone, Android just puts them together  <br>&#x2022; Device ID &amp; call information: This lets use see more details about your device, such as its make and model, so we can see which devices use Kites the most and optimise the experience. We don&apos;t use your call information  <br>  <br>Wow, all the way to the bottom! Now download Kites and spread the message to your friends :)",
    "histogram": {
        "1": 9,
        "2": 3,
        "3": 13,
        "4": 16,
        "5": 68
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/ky6HeR0MVW9DSEqwZMLkz_rlqRljQ9rPfEj9VDKmJHHJPaNxFmAscRAWbH32VXY0vg=h310",
        "//lh6.ggpht.com/L4wLcYXxYKWYBB3S3wHCMxB2Vxz73iWSSmy9az1J_ThPT-tHrOL80nvw0QCw6jHZEZ8=h310",
        "//lh3.ggpht.com/Y2tXew8j4xvDVFy0wi3jTPPukbHhbj6tWpgK8a_BHMK136FC9FGgZRcT6T9dFOJW-aJ8=h310",
        "//lh5.ggpht.com/ySPXZr-xwtCZcW6DKAFdqyGyp_ZQfXDdrVNsa9-HAx_Vq0K_lC8YV4NHfPH1YOweYQ=h310",
        "//lh4.ggpht.com/czYZOWxynxfG54prU8QosRDIuMglOeLRV2bOG0tcr_vdyIAmnzvsxMGC1tbux3G5oHWi=h310",
        "//lh4.ggpht.com/RqBhx1h4snwu_M_yPXkjVEGlYHoBCt3DZpajRXPz6iq8JfMU5zrCLJGwsLuWuK1wIWs=h310"
    ],
    "video": "https://www.youtube.com/embed/iTuGr7ed8vU",
    "comments": [
        "Very interesting application Very interesting application but it would be better if there is no need for registration.",
        "What a sexy app What a sexy app",
        "Dude you are a genius! ;) Just read about the app and m going nuts over the possibilities. Sure its a WIP and already looks awesome, but as a fellow social media designer, I know it will be all over the news. Way to go and all the very best mate.",
        "It's a work in progress Interesting, and I suspect will be useful when travelling to get upto date feedback on places to visit, eat, drink, etc. Not sure how this app is using Maps (Google I guess) - it should show places of interest nearby, it doesn't. When searching for a local bar, the map zooms out and shows me the whole world!? (data hungry) Surely search starts local first, if I'm in London but looking for a bar in New York I'll add NY into the search bar? Or maybe I'm doing something wrong ;) Anyway this app has potential.",
        "Get it now! Sure to be a must have on all devices. Remember to add the name of the venue your adding the kite for. Otherwise we will see your kite but wont know what its for.",
        "Love it! One of the best concepts I have come across! I use kites daily now and I have discovered so much already! Can't wait to discover more! Keep up the good work!"
    ],
    "recentChanges": [
        "* Added cool shortcuts to the activity screen so you can favourite great kites directly",
        "* LOADS of speed improvements, and we have lots more coming swell",
        "* As per usual, lots of bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.rockolabs.kites&hl=en&gl=us",
    "appId": "com.rockolabs.kites"
}