{
    "title": "iHeartRadio - Free Music, Radio & Podcasts",
    "summary": "All your favorite music. All your favorite stations. All free!",
    "icon": "//lh3.googleusercontent.com/YARR2HEM0sHh8RO8NygmV5CqIZxxDthWTFIG1B3NVJvksfPX0lr8yWr4m9Xekj28zQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000000,
    "maxInstalls": 100000000,
    "score": 4.7,
    "reviews": 1788328,
    "developer": "iHeartMedia, Inc.",
    "developerId": "8821283674927730745",
    "developerEmail": "android@iheartradio.com",
    "developerWebsite": "http://www.iheartradio.com/",
    "developerAddress": "32 Ave of the Americas\n21st Floor\nNew York, NY 10013",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "size": "Varies with device",
    "description": "iHeartRadio has unlimited music and thousands of radio stations all in one app. Download iHeartRadio today and listen to top radio stations, music, news, podcasts, sports, talk and comedy shows. iHeartRadio is easy to use and best of all it’s FREE. \nGet The Best Local Radio Stations and Podcasts• Discover thousands of live AM and FM stations near you and from cities across the globe • Listen to sports radio stations like ESPN Radio, Fox Sports and more• Stream podcasts from famous personalities like Ryan Seacrest, Colin Cowherd, Sean Hannity, Elvis Duran and Bobby Bones\nPlay Free Artist StationsCreate personalized music stations based on today’s top artists using a library of millions of songs covering genres like Country, Top 40, Rap, EDM, Rock, Alternative and more. \nThe Ultimate Station Made Just for YouMy Favorites Radio collects all of the songs you love in one free personalized station. \nPremium FeaturesTake control of your listening experience with millions of songs on demand. Choose the plan that’s right for you with iHeartRadio Plus™ and iHeartRadio All Access™.•\tSave and replay any song from the radio•\tEnjoy unlimited skips•\tListen to music offline•\tCreate unlimited playlists\nJoin our community!• Facebook: http://on.fb.me/1F1TcFX• Instagram: http://bit.ly/1e1AOUS• Twitter: http://bit.ly/1HZk5KQ• Blog: http://bit.ly/1GiT59D\nFor Feedback and HelpTell us how we can improve by sharing your thoughts at http://help.iheartradio.com! \n For additional help and to find answers to common questions for tablet devices, please visit https://help.iheart.com/hc/en-us/sections/204008358-Android \nPlease note: This app features Nielsen’s proprietary measurement software which may allow you to contribute to market research, like Nielsen's TV Ratings. To learn more about our digital measurement products and your choices in regard to them, please visit http://www.nielsen.com/digitalprivacy for more information. \n© 2017 iHeartMedia, Inc.\n",
    "descriptionHTML": "<p>iHeartRadio has unlimited music and thousands of radio stations all in one app. Download iHeartRadio today and listen to top radio stations, music, news, podcasts, sports, talk and comedy shows. iHeartRadio is easy to use and best of all it&#x2019;s FREE. </p><br><br><p><b>Get The Best Local Radio Stations and Podcasts</b><br>&#x2022; Discover thousands of live AM and FM stations near you and from cities across the globe <br>&#x2022; Listen to sports radio stations like ESPN Radio, Fox Sports and more<br>&#x2022; Stream podcasts from famous personalities like Ryan Seacrest, Colin Cowherd, Sean Hannity, Elvis Duran and Bobby Bones</p><br><br><p><b>Play Free Artist Stations</b><br>Create personalized music stations based on today&#x2019;s top artists using a library of millions of songs covering genres like Country, Top 40, Rap, EDM, Rock, Alternative and more. </p><br><br><p>The Ultimate Station Made Just for You<br>My Favorites Radio collects all of the songs you love in one free personalized station. </p><br><br><p><b>Premium Features</b><br>Take control of your listening experience with millions of songs on demand. Choose the plan that&#x2019;s right for you with iHeartRadio Plus&#x2122; and iHeartRadio All Access&#x2122;.<br>&#x2022;\tSave and replay any song from the radio<br>&#x2022;\tEnjoy unlimited skips<br>&#x2022;\tListen to music offline<br>&#x2022;\tCreate unlimited playlists</p><br><br><p>Join our community!<br>&#x2022; Facebook: http://on.fb.me/1F1TcFX<br>&#x2022; Instagram: http://bit.ly/1e1AOUS<br>&#x2022; Twitter: http://bit.ly/1HZk5KQ<br>&#x2022; Blog: http://bit.ly/1GiT59D</p><br><br><p>For Feedback and Help<br>Tell us how we can improve by sharing your thoughts at http://help.iheartradio.com! </p><br><br><p> For additional help and to find answers to common questions for tablet devices, please visit https://help.iheart.com/hc/en-us/sections/204008358-Android </p><br><br><p>Please note: This app features Nielsen&#x2019;s proprietary measurement software which may allow you to contribute to market research, like Nielsen&apos;s TV Ratings. To learn more about our digital measurement products and your choices in regard to them, please visit http://www.nielsen.com/digitalprivacy for more information. </p><br><br><p>&#xA9; 2017 iHeartMedia, Inc.</p>",
    "histogram": {
        "1": 43001,
        "2": 21573,
        "3": 55743,
        "4": 263727,
        "5": 1404284
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/VeTm716Y51Vnq1LxkVdXpwZ8L5dQQ081TacbqFEVQNCUAK6N0zHwHaHLd58wby96MT5x=h310",
        "//lh3.googleusercontent.com/DbtDfgNYERQSC9iWafbqAgj-3l1g8cYrOM_co9zIkWdNN3V3bOs56XysZ6HMjpxqiiay=h310",
        "//lh3.googleusercontent.com/qOiuiJVLzBi3O5LZwApP9Ub_PGM0KM1F5H2DyX86vlWhfu1CSKx2HQwJLjh07xU2kw=h310",
        "//lh3.googleusercontent.com/SEn0kmzv8IFtMHs_Vk105uVJUc5ITC8uPPuATx480aQJZkKTGkTof_-uqvaP9itKuA=h310",
        "//lh3.googleusercontent.com/d_2rmWS_XuY4yO00Nuc3ciVgU07nVpWeN7lzjaIwmuPYNC7g09BS5vDJiMHimXVGJcwd=h310",
        "//lh3.googleusercontent.com/p_aHvjUkgnjBm7ffQfafRZxIXRogbkE7pIfvQF_QMXYfodp_hqcl3py97oYjCCzC3jM=h310",
        "//lh3.googleusercontent.com/G72x9PCqGOrSzxwb--ODRoqHaqbWVqoO8SzgNLF9g3QKisrsKN_TSarxafOq40FcvQ6u=h310",
        "//lh3.googleusercontent.com/vyCXuQM3g-oVLL8gfOCJIGaMgPhzXbxOXQEhIgzwLbUSUPTTbzVRRQrMb2NYXDVNpgQ=h310",
        "//lh3.googleusercontent.com/va8sdCIeYKEqQ_kla26TfLSARpM6L2oFGvQ5huEG9stGWnCXQI64DZoFYy8ueT13uw=h310",
        "//lh3.googleusercontent.com/6CWgVa4zu2_20d3McCCo-MN1UbRoz1UD4OGfGcMgblFyUIojMVPymAuQzg-QOQ-QN0A=h310",
        "//lh3.googleusercontent.com/I1qvaY9A4NWSsmLVfmib6FcRbOdRy_zNZudiku7eGnoZQHKtzdBGL7okJtzSbOdTk5s=h310",
        "//lh3.googleusercontent.com/HFlKkbapkGMt5xHLjGFy11-TTscmlAwCP9DGeixMc3xiQIe0hlbizYW1FhjJOhpqew=h310",
        "//lh3.googleusercontent.com/F8pdZZwQHjRr1nIc8gX6k1b46hG9kvT2r1lGPUYxJbA88AXlSyITwmwrRXORqJ8haQ=h310",
        "//lh3.googleusercontent.com/8CDAtOgS4UYuw8l-ix8q6k8aR2zql-sh20aYVptFAjgLimW7TrIdTX8ZUvEMSUGDQkTZ=h310"
    ],
    "video": "https://www.youtube.com/embed/q-fuZpVrfQg",
    "comments": [
        "Used to LOVE this app - have listened to radio for years via this app. Haven't minded the ads - but now the Spanish language Disney commercial plays over & over!  I know I'm in San Diego, but I can neither afford 2K for a 4-day Disney trip nor comprende Espanol¡  Know your audience iHeart.  I'm a loyal listener to KFI - but less so to apps that don't \"learn\" about daily users.",
        "Fine, except for the constant \"You've been selected by IHeart for a free 30 day trial\" why do I keep getting selected?  I'm never that lucky in other drawings / lottery /slots. IHeart -  go ahead and give someone else a chance -  you don't have to keep congratulating me and selecting me.",
        "Could be a lot better needs a lot of work. For one I can't get any BBC radio stations like I am able to on most other similar apps.  1.Buffer time 2. direct station input 3. better search engine 4. player controls 5. Shoutcast search 6. Less intrusive advertising. (Video taking over is ridiculous)",
        "Regularly repeating songs, ever since the update. Not really complaining, since my stations are full of favorites.  My local radio station is on here, but plays half the songs, then repeats them...because we won't notice our favorite riffs are missing...",
        "I really like it, but the ads can get frequent from time to time which can be sorta sickening sometimes. However; premium is relatively cheap and you get rid of ads plus you can use other features which are really nice to have. Overall I really like this app! I would definitely recommend this app to my friends! 😊",
        "Worst app! After fifteen minutes of trying to get the radio station, and getting no where, I deleted and got another app that works just fine. I gave it five stars."
    ],
    "recentChanges": [
        "- The most wonderful time of the year! Your favorite holiday music is commercial-free on iHeartChristmas Radio and other great seasonal stations",
        "- Feeling generous this holiday season? Share your favorite personal playlists with friends with the new share button!",
        "- Been looking for that perfect album to get cozy beside the fireplace? You can now find albums in the iHeartRadio's search results!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.clearchannel.iheartradio.controller&hl=en&gl=us",
    "appId": "com.clearchannel.iheartradio.controller"
}