{
    "title": "Password Manager SafeInCloud Pro",
    "summary": "The best cross-platform Password Manager with cloud sync and free Desktop app.",
    "icon": "//lh3.googleusercontent.com/6X_h_HYjJSB4kg8bEtKEtRFJYCX07TpMtdXT_pgK1msMp4IbpE-zV-gfpZuVklLMMCg=w300",
    "price": "$4.99",
    "free": false,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.8,
    "reviews": 14014,
    "developer": "SafeInCloud",
    "developerId": "SafeInCloud",
    "developerEmail": "support@safe-in-cloud.com",
    "developerWebsite": "https://www.safe-in-cloud.com",
    "developerAddress": "5th Voykovskiy Proezd 16, Moscow, Russia, 125171",
    "updated": "February 23, 2018",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "SafeInCloud Password Manager allows you to keep your logins, passwords, and other private info safe and secure in an encrypted database. You can synchronize your data with another phone, tablet, Mac or PC via your own cloud account.No subscriptions, no monthly fees! You purchase SafeInCloud once and use it on all your Android devices without any additional fees.KEY FEATURES◆ Easy to Use◆ Material Design◆ Black Theme◆ Strong Encryption (256-bit Advanced Encryption Standard)◆ Cloud Synchronization (Google Drive, Dropbox, OneDrive, Yandex Disk, NAS, ownCloud, WebDAV)◆ Login with Fingerprint (Samsung devices & Android 6.0 devices)◆ Android Wear App◆ Password Strength Analysis◆ Password Generator◆ Browser Integration◆ Free Desktop App (Windows, Mac)◆ Automatic Data Import◆ Cross-PlatformEASY TO USETry it yourself and enjoy an easy-to-use yet powerful user interface.MATERIAL DESIGNSafeInCloud was completely redesigned to match new Material Design user interface language by Google. In addition to the standard Light theme SafeInCloud also has a Dark theme option to help you saving a significant amount of battery life.STRONG ENCRYPTIONYour data is always encrypted on a device and in a cloud with a strong 256-bit Advanced Encryption Standard (AES). This algorithm is used by the U.S. Government for protection of a top secret information. AES is also widely adopted worldwide and became the de facto encryption standard.CLOUD SYNCHRONIZATIONYour database is automatically synchronized with your own cloud account (Google Drive, Dropbox, OneDrive, Yandex Disk, NAS, ownCloud, WebDAV). Thus you can easily restore your entire database from a cloud to a new phone or computer (in case of a loss or an upgrade). Your phone, tablet and computer are also automatically synchronized between each other via a cloud.LOGIN WITH FINGERPRINTYou can instantly unlock SafeInCloud with a fingerprint on devices with a fingerprint sensor. This feature is available on all Samsung devices. Devices from other manufacturers should have Android 6.0 or higher.ANDROID WEAR APPYou can put some selected cards on your wrist to easily access them on the run. These could be your credit card PINs, door and locker codes.PASSWORD STRENGTH ANALYSISSafeInCloud analyses your password strengths and shows a strength indicator next to each password. The strength indicator displays an estimated crack time for a password. All cards with weak passwords are marked with a red sign.PASSWORD GENERATORThe password generator helps you generating random and secure passwords. There is also an option to generate memorable, but still strong passwords.BROWSER INTEGRATIONThe Desktop application integrates with a browser. This allows you to paste passwords directly into web pages. You don't need to manually copy and paste passwords from SafeInCloud into a browser. The mobile application contains a built-in browser with a similar password auto-fill functionality.FREE DESKTOP APPDownload a free Desktop application for Windows or Mac OS from www.safe-in-cloud.com to be able access your database on your computer. The Desktop application also makes data entry and editing fast and easy using a hardware keyboard.AUTOMATIC DATA IMPORTThe Desktop application can automatically import your data from another password manager. You don't need to manually reenter all your passwords.CROSS PLATFORMSafeInCloud is available on the following platforms: Mac (OS X), iOS (iPhone and iPad), Windows, and Android.",
    "descriptionHTML": "SafeInCloud Password Manager allows you to keep your logins, passwords, and other private info safe and secure in an encrypted database. You can synchronize your data with another phone, tablet, Mac or PC via your own cloud account.<br><br>No subscriptions, no monthly fees! You purchase SafeInCloud once and use it on all your Android devices without any additional fees.<br><br><b>KEY FEATURES</b><br>&#x25C6; Easy to Use<br>&#x25C6; Material Design<br>&#x25C6; Black Theme<br>&#x25C6; Strong Encryption (256-bit Advanced Encryption Standard)<br>&#x25C6; Cloud Synchronization (Google Drive, Dropbox, OneDrive, Yandex Disk, NAS, ownCloud, WebDAV)<br>&#x25C6; Login with Fingerprint (Samsung devices &amp; Android 6.0 devices)<br>&#x25C6; Android Wear App<br>&#x25C6; Password Strength Analysis<br>&#x25C6; Password Generator<br>&#x25C6; Browser Integration<br>&#x25C6; Free Desktop App (Windows, Mac)<br>&#x25C6; Automatic Data Import<br>&#x25C6; Cross-Platform<br><br><b>EASY TO USE</b><br>Try it yourself and enjoy an easy-to-use yet powerful user interface.<br><br><b>MATERIAL DESIGN</b><br>SafeInCloud was completely redesigned to match new Material Design user interface language by Google. In addition to the standard Light theme SafeInCloud also has a Dark theme option to help you saving a significant amount of battery life.<br><br><b>STRONG ENCRYPTION</b><br>Your data is always encrypted on a device and in a cloud with a strong 256-bit Advanced Encryption Standard (AES). This algorithm is used by the U.S. Government for protection of a top secret information. AES is also widely adopted worldwide and became the de facto encryption standard.<br><br><b>CLOUD SYNCHRONIZATION</b><br>Your database is automatically synchronized with your own cloud account (Google Drive, Dropbox, OneDrive, Yandex Disk, NAS, ownCloud, WebDAV). Thus you can easily restore your entire database from a cloud to a new phone or computer (in case of a loss or an upgrade). Your phone, tablet and computer are also automatically synchronized between each other via a cloud.<br><br><b>LOGIN WITH FINGERPRINT</b><br>You can instantly unlock SafeInCloud with a fingerprint on devices with a fingerprint sensor. This feature is available on all Samsung devices. Devices from other manufacturers should have Android 6.0 or higher.<br><br><b>ANDROID WEAR APP</b><br>You can put some selected cards on your wrist to easily access them on the run. These could be your credit card PINs, door and locker codes.<br><br><b>PASSWORD STRENGTH ANALYSIS</b><br>SafeInCloud analyses your password strengths and shows a strength indicator next to each password. The strength indicator displays an estimated crack time for a password. All cards with weak passwords are marked with a red sign.<br><br><b>PASSWORD GENERATOR</b><br>The password generator helps you generating random and secure passwords. There is also an option to generate memorable, but still strong passwords.<br><br><b>BROWSER INTEGRATION</b><br>The Desktop application integrates with a browser. This allows you to paste passwords directly into web pages. You don&apos;t need to manually copy and paste passwords from SafeInCloud into a browser. The mobile application contains a built-in browser with a similar password auto-fill functionality.<br><br><b>FREE DESKTOP APP</b><br>Download a free Desktop application for Windows or Mac OS from www.safe-in-cloud.com to be able access your database on your computer. The Desktop application also makes data entry and editing fast and easy using a hardware keyboard.<br><br><b>AUTOMATIC DATA IMPORT</b><br>The Desktop application can automatically import your data from another password manager. You don&apos;t need to manually reenter all your passwords.<br><br><b>CROSS PLATFORM</b><br>SafeInCloud is available on the following platforms: Mac (OS X), iOS (iPhone and iPad), Windows, and Android.",
    "histogram": {
        "1": 173,
        "2": 106,
        "3": 241,
        "4": 1357,
        "5": 12137
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FnbvD0JF6YGvck3DOeERgewLnNnLFDm67YuB77Pyc3Atb6x5vlBowmUKVjiiSHcKKw=h310",
        "//lh3.googleusercontent.com/DtLrdMl88PCbOueXQsE6Hx0LG1YRKZRHrTxYOyimYpwgv9cNO-qzzFwrV-mTLH0v_g=h310",
        "//lh3.googleusercontent.com/4RGI7eK_l3rDV4s7ybrK4cYjtO5Urp_72tzoAFGeO14VCZFSsiJNKSE3u_VZke5e1_0=h310",
        "//lh3.googleusercontent.com/3ujYoF_vQ-GmEHeE0oJnH6nu-6u-F4DMAdzM8mdjIbCuDqyQbxWwC3kUKlcJFNo7ISU=h310",
        "//lh3.googleusercontent.com/zGZiuN5IKx5xi2RQXIwNCGZ4SJXEXGlrMacW43x3ibsnmIEOi4C8jbApTCr0ETLP_WeI=h310",
        "//lh3.googleusercontent.com/7syctYLYtrM38USwsoyhm-7xeLLd7vIK6ELT6o-yLuJwk5hsuyqMX4HMcgk-OEJmg3c=h310",
        "//lh3.googleusercontent.com/wo1UTbI-CvdcjP6ebx-Qz7ppIzAOF_GGbxG9QFCq0OOF56TvHGcZtJBy0rIQDwUSQ38=h310",
        "//lh3.googleusercontent.com/Q38L7C0i1aAKMl5KUyWbNMUwPXTTkwdXsdz8lSJUqr81wz-Jo2ZWvz5KnjdYBb71gw=h310",
        "//lh3.googleusercontent.com/WVIqyJ76WmXmt-CwHLohTEpv4ANNX0K1BZmcAAPkmIFnP9epIqANb4na_5lv02ivB-g=h310",
        "//lh3.googleusercontent.com/StmYlvvXm-1-Zbt2qVv8E-1porNOvxiRBY6BcCYh92WXi-9H9zH2Buq19AJWjulgPg=h310",
        "//lh3.googleusercontent.com/2lqnZ48aqlQt7XU3xZTk7JwdvjLi-YipxlKnfUtd1K_oqeUECTgm4BO2mLV2cQOh9VE-=h310",
        "//lh3.googleusercontent.com/mIWnX_0hZI1rfsBpU3ggX-A1tJpivuHZRxR717COZnH6bisdeVlKQChO1UCWFVlkaWk=h310",
        "//lh3.googleusercontent.com/6kCsPoDx7jvEJulWiN6FSLr_0lNVv5Gr2As_ZLsL0M50lgVuIJiZ0UOYtUD4tvHgpp4=h310"
    ],
    "comments": [
        "I was looking for a solution in the cloud but not managed by third parties. Having the database encrypted in a storage provider is a perfect solution. Sync works wonderful. The application UI is nice, clean and polished (both Android and Windows). Having extensions for Chrome and Firefox is a plus I don't use yet but certainly useful. And it's actively updated.",
        "Really good but icons for websites randomly don't appear even if the website has one. This is even worse and more unreliable in the Windows app. I've reported his by email over 6 months ago but still no fix or improvement.",
        "Excellent app and brilliant import feature. Don't buy the in-app upgrade but buy the pro version. Both do same thing but pro version is supported on Google Family and when moving devices.",
        "Best out there. Really can't complain about anything.  Nice touch with icons pulled from web sites to keep your cards and records visually distinct.",
        "Very good for having all your info in one place. And have it saved in the cloud of your choice.  One thing that could be improved is colored icons for each category and custom cards.",
        "Was happy to see support for Windows and tablets devices especially. Keep up the wonderful work. It's definitely a job well done!"
    ],
    "recentChanges": [
        "◆ Warning of expiring cards",
        "◆ New labels: Expiring, Expired",
        "◆ New field type: Expiry",
        "◆ New symbols: RuPay, rupee",
        "◆ Deprecated sync with Yandex Disk",
        "◆ Bug fixes",
        "If you have questions, suggestions or problems, please contact support@safe-in-cloud.com."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.safeincloud&hl=en&gl=us",
    "appId": "com.safeincloud"
}