{
    "title": "djay FREE - DJ Mix Remix Music",
    "summary": "The free award-winning DJ app to mix music, create and remix songs.",
    "icon": "//lh4.ggpht.com/9qfmQ6GHmem12sEeENZhMjm77WrBnyfMXQDFAA7YPC3o7WofYam4gdzI4caGk0QFCQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.1,
    "reviews": 187074,
    "developer": "Algoriddim",
    "developerId": "5018482428897077144",
    "developerEmail": "support@algoriddim.com",
    "developerWebsite": "http://www.algoriddim.com",
    "developerAddress": "algoriddim GmbH\nKöniginstr. 33\n80333 Munich\nGermany",
    "updated": "February 7, 2018",
    "version": "2.3",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Mix music, remix your favorite songs from Spotify or your own music, make great mixes with this free DJ mixer. Mix hits on the turntables weather you’re a pro DJ or a starter.Introducing djay FREE - the world's best selling DJ app is now free on Android!djay transforms your Android device into a full–featured DJ system. Seamlessly integrated with Spotify and all the tracks on your device, djay gives you direct access to mix and remix your favorite songs and playlists instantly. You can perform live, create loops and apply stunning FX in real-time. Whether you are mixing professionally or a beginner who just loves to create music, djay offers you the most intuitive yet powerful mixing experience on an Android device. FEATURE HIGHLIGHTS • Spotify integration: mix and remix millions of tracks instantly • Music library integration (mix all files and create your own remix, no access to Google Play Music)• Match: intelligent song recommendation engine powered by The Echo Nest. Create a remix of your favorite tracks with intelligent song recommendations. Music selection and mixing has never been easier and more fun. • Audio FX: Flanger, Phaser, Echo, Gate, Bit Crusher (create your own sound)• Mixer, Tempo, Pitch-Bend, Filter and EQ controls • Looping & Cue Points • Single Turntable portrait mode • Advanced time-stretching (requires quad-core Nexus device) • Automatic beat & tempo detection • Auto-Gain (allows seamless mixing at same volume levels between the left turntable and the right turntable)• Support for all major audio formats • Support for Bluetooth devices • Support for MIDI Controllers and audio interfaces (Pioneer DDJ-WeGO3, Reloop Beatpad)Watch DMC Champion DJ Rasp mixing on djay for Android: http://youtu.be/OhBJnDUxMEUSpotify integration requires Spotify Premium and an internet connection, a FREE trial is available.",
    "descriptionHTML": "Mix music, remix your favorite songs from Spotify or your own music, make great mixes with this free DJ mixer. Mix hits on the turntables weather you&#x2019;re a pro DJ or a starter.<br><br>Introducing djay FREE - the world&apos;s best selling DJ app is now free on Android!<br><br>djay transforms your Android device into a full&#x2013;featured DJ system. Seamlessly integrated with Spotify and all the tracks on your device, djay gives you direct access to mix and remix your favorite songs and playlists instantly. You can perform live, create loops and apply stunning FX in real-time. Whether you are mixing professionally or a beginner who just loves to create music, djay offers you the most intuitive yet powerful mixing experience on an Android device. <br><br>FEATURE HIGHLIGHTS <br><br>&#x2022; Spotify integration: mix and remix millions of tracks instantly <br>&#x2022; Music library integration (mix all files and create your own remix, no access to Google Play Music)<br>&#x2022; Match: intelligent song recommendation engine powered by The Echo Nest. Create a remix of your favorite tracks with intelligent song recommendations. Music selection and mixing has never been easier and more fun. <br>&#x2022; Audio FX: Flanger, Phaser, Echo, Gate, Bit Crusher (create your own sound)<br>&#x2022; Mixer, Tempo, Pitch-Bend, Filter and EQ controls <br>&#x2022; Looping &amp; Cue Points <br>&#x2022; Single Turntable portrait mode <br>&#x2022; Advanced time-stretching (requires quad-core Nexus device) <br>&#x2022; Automatic beat &amp; tempo detection <br>&#x2022; Auto-Gain (allows seamless mixing at same volume levels between the left turntable and the right turntable)<br>&#x2022; Support for all major audio formats <br>&#x2022; Support for Bluetooth devices <br>&#x2022; Support for MIDI Controllers and audio interfaces (Pioneer DDJ-WeGO3, Reloop Beatpad)<br><br>Watch DMC Champion DJ Rasp mixing on djay for Android: <br>http://youtu.be/OhBJnDUxMEU<br><br>Spotify integration requires Spotify Premium and an internet connection, a FREE trial is available.",
    "histogram": {
        "1": 22745,
        "2": 7605,
        "3": 15318,
        "4": 24563,
        "5": 116843
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/nABv8lBacXniHdKv11xyWWkOAe77Am-6z_hVisYhlKetKsn6px7Rah83UNuaMkaM-Q=h310",
        "//lh6.ggpht.com/ZUDBP0tZCwNXchOgxaUCEh3K3AKyJv6egC-A70gt6Lq1s7L0cmzmkMWfNkgJdFQdjw=h310",
        "//lh6.ggpht.com/X4tEz4zud8C8t36CNJG7aeaD3zdI9Cd9wyXVFDS8s-FSvNFs2bNyqNb5w5tSnWyTjGA=h310",
        "//lh4.ggpht.com/uLxIQhYxIzopRwdCweMX0-lb5FFcmK2rua_DjPXkU_q-9UIkd-vcN_xK4Wlw8vhS0aA=h310",
        "//lh3.ggpht.com/l-DHcu1MIZgWPA0JIDpVkrygCk3flH3F1OhJC6F0y3aYiUy3PZFvBpBfWcboPjVs7Q=h310",
        "//lh6.ggpht.com/EBNnA1RuXTti3dEVHYk2G1P1UyzboGgFJbc1fhM_KWHXQ0xHsGHstYw4ygFMIKxiEcg=h310",
        "//lh3.ggpht.com/Lj9sCNUidD0zk82-N6oyYKwcc7LRZg2Mivj4y8HJDtm3X5mCuTE7MqzrY9ZfO2ils-9M=h310",
        "//lh3.ggpht.com/hIVhUsQeZ61aFhnqNPFJPlOyvMlwKqCGa5pqgAradmQwWcpApcpjVOK8JELpqmSSb3bO=h310",
        "//lh4.ggpht.com/h61BuotodqbD1nmp6XDRSz_Nq8h1Rcoa87tEfYzgxanv0PE7VATbnRmRU-oCRlgzobE=h310"
    ],
    "video": "https://www.youtube.com/embed/TQJktyOYVB0",
    "comments": [
        "Only had it half an hour. Crashed three times. Wont play tracks when you press play. Automix cuts in late. Paid for automix. Had to restart device to close app. Integrates with spotify but search time means previous track is finished before next one is cued. Would be no use at any party.",
        "Please make time stretch feature available on lenovo yoga book currenly running android lollipop. The pitch sounds awful and i cant mix tracks with those. Plesase include the feature.",
        "Bought all the updates as changed platforms (ios to android). Totally useless on android, music stutters or slows when changing tracks, sometimes crashes the app! Why such a difference between the two operating systems? If I could give less than one star I would. Please fix this and I'll give a good review as I did on ios.  Update: Over eight months later and STILL NOT DONE ANY IMPROVEMENTS! I've bought a new Android tablet and got a new phone, both not cheapos and guess what? Still the same issues on my new devices. If I could get my money back I would.........",
        "This would get 5 stars if the andriod app and the iphone app had the same features. I had an iphone and loved this app simply because of the clef note button feature. Upgraded to the s7 and downloaded the app, paid for upgrade and even bought djay 2 and was highly unsatisfied when i didnt see that feature.  Deleted djay 2, came on my chromebook and saw the feature in the photos and did the whole process again trying to get the iphone verison of this app on andriod and the only difference between the two is that feature, which makes mixing alot more fun. Please, I beg you, upgrade the app and add that feature. i dont want to get an iphone just to mix wen my extensive library of music is on my sd card. (which was the main reason I made the switch)",
        "Loved this when I bought it for my ipod, now the battery wont work so I bought an android. So do I have to pay again?  I technically already did but now i have the demo and miss out on my kick drums, samples etc. Got a transfer system???",
        "Great app... If it ever worked. It's more unstable than Donald Trump. I can play 2 songs before it crashes and I have to restart the app"
    ],
    "recentChanges": [
        "• Improved audio latency",
        "• Added support for arbitrary USB audio interfaces",
        "• Fixed possible audio issue when jumping to cue points"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.algoriddim.djay_free&hl=en&gl=us",
    "appId": "com.algoriddim.djay_free"
}