{
    "title": "Heart Rate Plus - Pulse & Heart Rate Monitor",
    "summary": "The best heart rate monitor app! Measures using your camera or heart rate sensor",
    "icon": "//lh3.googleusercontent.com/IXo6vRr68MzIoNQdwscipqoUhpGUCcyGEG6r-CKW71EX-tU_B6VUnEIwSG-K1KhEQ7Tc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 13027,
    "developer": "PVDApps",
    "developerId": "PVDApps",
    "developerEmail": "pvdapps.com@gmail.com",
    "developerWebsite": "https://www.facebook.com/HeartRatePlusApp",
    "developerAddress": "92 Nguyen Khanh Toan, Cau Giay, Hanoi, Vietnam",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Check your heart rate anytime, anywhere with Heart Rate Plus - at your home or your office - when you wake up, relax, before and after exercise, or before a big meeting. See why we have been appraised as one of the best heart rate monitor and tracker apps for smartphones and heart rate monitor for Android Wear. ❤️⌚️Bet you never thought your phone or tablet could do that?❤️AMAZING ACCURACY📸The Heart Rate Plus app will measure your heartbeat with great accuracy, using your smartphone’s camera sensor and flashlight by processing the images of your pulse on your finger! Our heart rate monitor guarantees accuracy and great heart rate tracker and hr monitor features.❤️FAST RESULTS⌚️Instant, accurate, and excellent for monitoring your health and fitness. Use your smartphone’s camera or the sensor in your smartwatch, this can be your Android Wear heart rate monitor anywhere while being physically active.❤️HEART RATE PLUS – MONITOR APP FEATURES❤️✔ Fast and accurate measurement✔ Save result for access later✔ Real time pulse graph✔ Android Wear support: Measure your pulse using the heart rate sensor in your smartwatch✔ Reminder: Automatic remind you to measure your heartbeat everyday✔ Export history to CSV file (ads free user only)✔ Built-in sensor support with device run Lollipop and later✔ Free heart rate monitor appUSER GUIDE:Please read carefully before using this app.★ Hold the tip of your index finger over the back camera lens and flash of your phone or tablet.Do not press too hard or you will restrict circulation which will result in an inaccurate reading.★ After a second or two, you should see your heart pulse graph. Keep holding your finger still for five more seconds to compute your heart rate and update the number. For best results, hold your finger still for 10 seconds to get an accurate heart rate.-----------------------------------------Follow our official Facebook page: https://www.facebook.com/HeartRatePlusApp*** If you like this app, please support us, you can remove ads from the Menu*** We welcome your ideas and suggestions, please email us at: pvdapps.com@gmail.comWARNING: This app is not a medical product!",
    "descriptionHTML": "Check your <b>heart rate</b> anytime, anywhere with Heart Rate Plus - at your home or your office - when you wake up, relax, before and after exercise, or before a big meeting. See why we have been appraised as one of the <b>best heart rate monitor and tracker apps</b> for smartphones and heart rate monitor for Android Wear. &#x2764;&#xFE0F;&#x231A;&#xFE0F;<br><br>Bet you never thought your phone or tablet could do that?<br><br>&#x2764;&#xFE0F;<b>AMAZING ACCURACY</b>&#x1F4F8;<br>The Heart Rate Plus app will measure your heartbeat with great accuracy, using your smartphone&#x2019;s camera sensor and flashlight by processing the images of your pulse on your finger! Our heart rate monitor guarantees accuracy and great heart rate tracker and hr monitor features.<br><br>&#x2764;&#xFE0F;<b>FAST RESULTS</b>&#x231A;&#xFE0F;<br>Instant, accurate, and excellent for monitoring your health and fitness. Use your smartphone&#x2019;s camera or the sensor in your smartwatch, this can be your Android Wear heart rate monitor anywhere while being physically active.<br><br>&#x2764;&#xFE0F;<b>HEART RATE PLUS &#x2013; MONITOR APP FEATURES</b>&#x2764;&#xFE0F;<br>&#x2714; Fast and accurate measurement<br>&#x2714; Save result for access later<br>&#x2714; Real time pulse graph<br>&#x2714; Android Wear support: Measure your pulse using the heart rate sensor in your smartwatch<br>&#x2714; Reminder: Automatic remind you to measure your heartbeat everyday<br>&#x2714; Export history to CSV file (ads free user only)<br>&#x2714; Built-in sensor support with device run Lollipop and later<br>&#x2714; Free heart rate monitor app<br><br><b>USER GUIDE</b>:<br>Please read carefully before using this app.<br>&#x2605; Hold the tip of your index finger over the back camera lens and flash of your phone or tablet.<br>Do not press too hard or you will restrict circulation which will result in an inaccurate reading.<br>&#x2605; After a second or two, you should see your heart pulse graph. <br>Keep holding your finger still for five more seconds to compute your heart rate and update the number. <br>For best results, hold your finger still for 10 seconds to get an accurate heart rate.<br>-----------------------------------------<br>Follow our official Facebook page: https://www.facebook.com/HeartRatePlusApp<br>*** If you like this app, please support us, you can remove ads from the Menu<br>*** We welcome your ideas and suggestions, please email us at: pvdapps.com@gmail.com<br>WARNING: This app is not a medical product!",
    "histogram": {
        "1": 697,
        "2": 331,
        "3": 1039,
        "4": 3500,
        "5": 7460
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Euf8vM8pOebyQaITWeegL3AJYU1HwDKRGs8B1dDJaIzw2apz1x_DDsNctZ9-6YOPazgz=h310",
        "//lh3.googleusercontent.com/NyjgwdjdQirmZ6awah6vCqhNlvPjSsJXpzE7kFV8OX7Jsl2iUeTnSGwezdR2Ky5l2A=h310",
        "//lh3.googleusercontent.com/OvDzf1V03YVS_PIfjePoiPvNe5J62o_vOCKinLI3DMrge32mTkT6G1lEWTTBoa6MMiU=h310",
        "//lh3.googleusercontent.com/dL9x2v5_oLJyXpZv_3e5RAI-YtJQD_hDUQgAxV69y5N1nKzt0zpCSHg01B0-iHOf5NKl=h310",
        "//lh3.googleusercontent.com/uLDdZJfNE6qgUZxhaehr_2AFePAkH3Iidv0HnESa_0Hv73FJegLCoHpNI3WJVPW_D9Fu=h310",
        "//lh3.googleusercontent.com/RsBZb9uHJebdNU7h5iFq1gSeC2Mu66h5nwilUyQ0uk7dNjQEjH2D1a_OSXWmVIQlRu4=h310"
    ],
    "video": "https://www.youtube.com/embed/cbD7EvB7rVg",
    "comments": [
        "Accuracy looks to be high but it does take a long time to read fully, over 2 minutes average. Not sure if this is because I have arterial fibulation or inherent in the app. Using Samsung S8 running 8.0",
        "Works great for galaxy s8 plus!  I did it 3 times to be sure I get a close number which 3 times the numbers were one percent off each time now my fingers are small so takes a while for me to position it perfectly over the scanner and plus I am fidgety so hard for me to stay still but so far so good!",
        "Great app.  Tried others but this one gives out best rhythm and accurate heartbeat.  It's nice to document certain readings throughout the day to help see consistency or abnormalities",
        "Better hope you have all week to do a reading... Takes forever and isn't accurate.. Said my heart rate was 130 sitting still when it was barely 60",
        "Not sure if it's because of my phone (Galaxy Prime Plus) or what but finger burns when getting HR. Probably the phone's flash but app may be utilizing flash on its brightest.",
        "This has so far been the most reliable HR monitor I have used with my wear watch. However, there are a few things that prevent me from giving it more stars. 1:  It places an alarm status in the status bar. This drove me nuts!  I couldn't figure out why I had an alarm when I hadn't set one in the clock app. I finally figured out that it was HRP because I had it set to read automatically from my watch every 15 mins. 2:  Since I'm using my wearable to take readings, I don't require the use of the camera for them. But, when I launch the app (to look at the history) it want to take a reading with the camera. Thus the LED lights up. It would be nice to have a toggle.  EDIT:  There IS an option in the latest version to open the app in history. 3:  Finally, I'd like to see more history than the last 7 readings. Perhaps daily, weekly, monthly charts. Other than these slight personal issues, this has been by far the most reliable heart rate monitor I've used with my wearable. Hoping to.see.some improvements with future releases.  EDIT 3/2/18:  Appears ALL my concerns have been addressed. 5 stars and thank you!"
    ],
    "recentChanges": [
        "- Bug fixes and performance improvements.",
        "- Android Wear: support standalone mode for automatically heart rate monitor (turn on in Settings), new History tab swipe left to view. Now you can leave your phone at home, do exercise with your watch and then sync it back later (by open watch History tab).",
        "- Built-in heart rate sensor support with device run Lollipop or later. If you have any problem with HR sensor, you can turn it off in Settings."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.dungelin.heartrate&hl=en&gl=us",
    "appId": "com.dungelin.heartrate"
}