{
    "title": "Endomondo - Running & Walking",
    "summary": "Make fitness fun with this personal trainer and social fitness partner.",
    "icon": "//lh3.googleusercontent.com/YpaxxOI4FCcMGLNOmDallw2jy9crQCANOJsbJJt_iMycpdiG0YSsWx7VSvQfautR4u8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.5,
    "reviews": 505519,
    "developer": "Endomondo.com",
    "developerId": "Endomondo.com",
    "developerEmail": "support@endomondo.zendesk.com",
    "developerWebsite": "http://www.endomondo.com",
    "developerAddress": "Kanonbådsvej 12B\n1437 Copenhagen K\nDenmark",
    "updated": "February 22, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Get the most out of your runs, walks, rides, and more with our top rated fitness tracker and personal training app. With Endomondo, you can track all of your workouts using GPS, check your stats, and reach your fitness goals. Download the app now and get motivated to get active!Here’s what you get free of charge:TRACK YOUR FITNESS- Track your running, walking, cycling, and 40+ other sports using GPS- See duration, speed, distance, calories, and more on your workout summary- Get audio feedback on distance and pace for every mile/km- Log your indoor workouts manually- Track your heart rate (works with Bluetooth heart rate monitors)ANALYZE YOUR PERFORMANCE- Keep a full training log- See how much you train each day- Analyze performance such as split times for each workoutSYNC WITH APPS AND WEARABLES- Get your calorie and nutrition information from MyFitnessPal right in the app- Connect with Google Fit to add workout data to your dashboard- Use your favorite wearable devices to track, including Garmin, Gear, Pebble, and Android WearSET GOALS AND TAKE ON CHALLENGES- Set a time, distance or calorie goal, and let our audio coach guide you towards it- Commit to fitness goals and let your friends motivate you- Up the stakes on your workouts and win prizes with challengesGET SOCIAL- Send and receive real-time audio pep talks from friends- Check the news feed to comment on friends’ workouts- Race against a friend’s personal best time- Share results and workouts on your favorite social networks: Facebook, Twitter, and Google+AND MORE- Add pictures, tag your friends, enable automatic pause function, customize your home screen, use countdown, and much moreAll your data is automatically sent to your profile on www.endomondo.com. Here, you can analyze your data, dive into your stats, track your progress, as well as interact and compete with a global community of fitness enthusiasts.So, whether you’re into running, cycling, walking, kayaking, mountain biking, or any one of our 40+ sports...get up, get active, and free your endorphins!Want to take your fitness even further?GO PREMIUMWith Endomondo Premium, you’ll gain access to exclusive training features from just 2.50 USD a month.Get Premium and: - Reach your running goal with a personal training plan - whether it’s a 5K, 10K, or marathon- View statistics, including calories burned per month, running distance by year, etc.- Analyze heart rate zones for every workout (requires a compatible heart rate monitor)- View weather information on each workout summary- Enjoy an ad-free experience- Get access to 10+ additional motivating featuresThe fine print:Should you choose to upgrade to Endomondo Premium, payment will be charged to your Google Play account upon confirmation of purchase. The monthly subscription costs USD 5.99 while the annual subscription costs USD 29.99 per year or USD 2.50 per month.Your subscription renews automatically unless cancelled at least 24 hours before the end of the current period. Auto-renewal may be turned off in your Account Settings in Google Play after purchase. For our full terms and conditions and our privacy policy, please visit: http://www.endomondo.com/terms and http://www.endomondo.com/privacyEndomondo is powered by Under Armour Connected Fitness – the world’s largest health and fitness community. The complete suite of Under Armour apps, built to empower healthy and active lifestyles, includes Endomondo, UA Record, MapMyFitness and MyFitnessPal.NOTE: We ask for the permission ACCESS_FINE_LOCATION to enable GPS tracking of your workouts.We ask for permission to access your personal information and read contacts. This enables you to connect with your friends, challenge them, and follow them directly on your phone. We will read names and email addresses from your contacts ONLY if you actively choose to do so within the app.",
    "descriptionHTML": "Get the most out of your runs, walks, rides, and more with our top rated fitness tracker and personal training app. With Endomondo, you can track all of your workouts using GPS, check your stats, and reach your fitness goals. Download the app now and get motivated to get active!<br><br>Here&#x2019;s what you get free of charge:<br><br>TRACK YOUR FITNESS<br>- Track your running, walking, cycling, and 40+ other sports using GPS<br>- See duration, speed, distance, calories, and more on your workout summary<br>- Get audio feedback on distance and pace for every mile/km<br>- Log your indoor workouts manually<br>- Track your heart rate (works with Bluetooth heart rate monitors)<br><br>ANALYZE YOUR PERFORMANCE<br>- Keep a full training log<br>- See how much you train each day<br>- Analyze performance such as split times for each workout<br><br>SYNC WITH APPS AND WEARABLES<br>- Get your calorie and nutrition information from MyFitnessPal right in the app<br>- Connect with Google Fit to add workout data to your dashboard<br>- Use your favorite wearable devices to track, including Garmin, Gear, Pebble, and Android Wear<br><br>SET GOALS AND TAKE ON CHALLENGES<br>- Set a time, distance or calorie goal, and let our audio coach guide you towards it<br>- Commit to fitness goals and let your friends motivate you<br>- Up the stakes on your workouts and win prizes with challenges<br><br>GET SOCIAL<br>- Send and receive real-time audio pep talks from friends<br>- Check the news feed to comment on friends&#x2019; workouts<br>- Race against a friend&#x2019;s personal best time<br>- Share results and workouts on your favorite social networks: Facebook, Twitter, and Google+<br><br>AND MORE<br>- Add pictures, tag your friends, enable automatic pause function, customize your home screen, use countdown, and much more<br><br>All your data is automatically sent to your profile on www.endomondo.com. Here, you can analyze your data, dive into your stats, track your progress, as well as interact and compete with a global community of fitness enthusiasts.<br><br>So, whether you&#x2019;re into running, cycling, walking, kayaking, mountain biking, or any one of our 40+ sports...get up, get active, and free your endorphins!<br><br>Want to take your fitness even further?<br><br>GO PREMIUM<br><br>With Endomondo Premium, you&#x2019;ll gain access to exclusive training features from just 2.50 USD a month.<br><br>Get Premium and: <br>- Reach your running goal with a personal training plan - whether it&#x2019;s a 5K, 10K, or marathon<br>- View statistics, including calories burned per month, running distance by year, etc.<br>- Analyze heart rate zones for every workout (requires a compatible heart rate monitor)<br>- View weather information on each workout summary<br>- Enjoy an ad-free experience<br>- Get access to 10+ additional motivating features<br><br>The fine print:<br>Should you choose to upgrade to Endomondo Premium, payment will be charged to your Google Play account upon confirmation of purchase. The monthly subscription costs USD 5.99 while the annual subscription costs USD 29.99 per year or USD 2.50 per month.<br><br>Your subscription renews automatically unless cancelled at least 24 hours before the end of the current period. Auto-renewal may be turned off in your Account Settings in Google Play after purchase. For our full terms and conditions and our privacy policy, please visit: http://www.endomondo.com/terms and http://www.endomondo.com/privacy<br><br>Endomondo is powered by Under Armour Connected Fitness &#x2013; the world&#x2019;s largest health and fitness community. The complete suite of Under Armour apps, built to empower healthy and active lifestyles, includes Endomondo, UA Record, MapMyFitness and MyFitnessPal.<br><br>NOTE: <br>We ask for the permission ACCESS_FINE_LOCATION to enable GPS tracking of your workouts.<br>We ask for permission to access your personal information and read contacts. This enables you to connect with your friends, challenge them, and follow them directly on your phone. We will read names and email addresses from your contacts ONLY if you actively choose to do so within the app.",
    "histogram": {
        "1": 16299,
        "2": 9848,
        "3": 22238,
        "4": 117036,
        "5": 340098
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/kug0l1Q2qUANMrzZTNFv55G4s1ArE-Mulj51mhzfT5qxsj4Bn7Ushu6_j3eLPs2-cA=h310",
        "//lh3.googleusercontent.com/So4ZhioEXvQt1eHvCdISEB3S2uxcVhG-Hhfxwz6GXVIb8vLiJ_bMUXBLHQWujspJflQ=h310",
        "//lh3.googleusercontent.com/7fyyeUN1906nVMa3ClnKw56koWorSvi0nna2X9y11BlZ340psCNOvLEGBkz-VrenIHoO=h310",
        "//lh3.googleusercontent.com/SYwKw09AZ0u9Kv98fiOZC7pBmTWrAe7VT13xNUyTbLoCT6rmyYpaFxMDRuV__s7YBWs=h310",
        "//lh3.googleusercontent.com/EsrUh3Jlons-wnTSBFLl1iOesCVPhewQirhbScZU2PJ0DsflXiLN8yKodj-FgjWmsAU=h310",
        "//lh3.googleusercontent.com/qaszbF8aS_lNvTjmCCL0KFIMmFyC89PN2zlG_l2myBhtDkm1hgJeRSxu-CR_OPOzwJHo=h310",
        "//lh3.googleusercontent.com/gvs98_vPhD-paIptNjSkSjXRpm_8NEESgIBsqPabnY-jwZYRIlXvzR_VUvfSHoJHew=h310",
        "//lh3.googleusercontent.com/yVFEkpiU-LEQcx86nk8SroGx0_cg9oidH2XTEC-4_aY8uftpP3Xsbx0ewudgNpX7mw=h310"
    ],
    "comments": [
        "Had to download this version because I was locked out and could not log on to the app, even though I could online.  First two attempts the GPS located me, but didn't measure the distance! If revenue is so important, why can't previous versions be offered for a price?",
        "This is a down grade. It tells me I have 10 miles left on a 6 mile plan. It also doesnt show remaining miles like the last version so I cant see if I have 0.2 miles left, it just says 0. Shocking upgrade. Can I have the old version back please.  Might try strava.",
        "Love this app for running, cycling etc and is especially good for interval training. The pep talks are really fun with a group and I've used the app for years. Shame that it no longer works with Pebble, but I can see why people would end support",
        "I have been paid user for five years. The new UI is huge disappointment. The old UI was much better, good enough for me to pay throughout the give years. Now, I won't be renewing my subscription.",
        "No more full map screen? Are u serious??? Enjoy 1 star till you give back d full map screen.",
        "miCoach HRM connection fails every time. It worked before the update."
    ],
    "recentChanges": [
        "Endomondo is the best way to track your runs, rides, walks, and other workouts.",
        "Get better with us, reach your fitness goals, and be part of our strong community.",
        "Just like you, we’re improving every day, squashing bugs, and fixing issues. So don’t miss a thing and keep your auto-updates turned on."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.endomondo.android&hl=en&gl=us",
    "appId": "com.endomondo.android"
}