{
    "title": "EatLess for Android Wear",
    "summary": "EatLess turns your Smart Watch into a Personal Weight Watching Coach!",
    "icon": "//lh5.ggpht.com/bSF63NA3Zfskur6PDw15mzuxIGoi0CmYGpmOxijneFvmBVh5btIfHMOCNop7zdGB9w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 3.8,
    "reviews": 9,
    "developer": "Kanda Software",
    "developerId": "Kanda+Software",
    "developerEmail": "support@kandasoft.com",
    "developerWebsite": "http://www.kandasoft.com",
    "updated": "February 9, 2015",
    "version": "1.1.26",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Based on dozen of years of motivational research EatLess turns your Smart Watch into a Personal Weight Watching Coach! EatLess motivates you to eat healthy by sending inspirational advice to your Android Wear smartwatch.  You get to decide the time- frame you want to be coached during the day – say from 9am to 10pm or from 8am to midnight.  You also choose how often to get the advice – anywhere from once to a dozen times per day.Getongoing support with messages designed by professionals to make you thinner and keep you fit.One of the most common causes of overeating is “forgetting” your resolution just long enough to eat something unhealthy or too big.  With EatLess on your side you will be guided with short, powerful messages to keep your word to yourself – making it THAT much easier to accomplish your dieting and weight reduction goals.  Make yourself thin with one reminder at a time from Eat Less for Android Wear!Features:● Get inspirational messagescustom-designed to help you be thin;● Advice delivered to your smart watch at random intervals to keep you motivated at all times;● Control Frequency - Receive 1 to 12 reminders per day;● Choose start time and end time for coaching during the day (or during the night if you are working the late shift);● Addyour own message to customize EatLess to your taste.",
    "descriptionHTML": "Based on dozen of years of motivational research EatLess turns your Smart Watch into a Personal Weight Watching Coach! <br><br>EatLess motivates you to eat healthy by sending inspirational advice to your Android Wear smartwatch.  You get to decide the time- frame you want to be coached during the day &#x2013; say from 9am to 10pm or from 8am to midnight.  You also choose how often to get the advice &#x2013; anywhere from once to a dozen times per day.<br><br>Getongoing support with messages designed by professionals to make you thinner and keep you fit.<br><br>One of the most common causes of overeating is &#x201C;forgetting&#x201D; your resolution just long enough to eat something unhealthy or too big.  With EatLess on your side you will be guided with short, powerful messages to keep your word to yourself &#x2013; making it THAT much easier to accomplish your dieting and weight reduction goals.  <br><br>Make yourself thin with one reminder at a time from Eat Less for Android Wear!<br><br>Features:<br>&#x25CF; Get inspirational messagescustom-designed to help you be thin;<br>&#x25CF; Advice delivered to your smart watch at random intervals to keep you motivated at all times;<br>&#x25CF; Control Frequency - Receive 1 to 12 reminders per day;<br>&#x25CF; Choose start time and end time for coaching during the day (or during the night if you are working the late shift);<br>&#x25CF; Addyour own message to customize EatLess to your taste.",
    "histogram": {
        "1": 0,
        "2": 1,
        "3": 4,
        "4": 0,
        "5": 4
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/w5rgc5TzPAZJ9Qq3b03XET2HY4nPS32-iqqQp_jb6cuEeKz78rgriVPghxFDcGR_cg=h310",
        "//lh6.ggpht.com/9N7KVLX1gVwIZva99jqPNkNlFI2fxEHmeV9BmfGdoSYC16rpsZ3Kw5A_z6TKs7RuZlQ=h310",
        "//lh3.ggpht.com/GPlPxzdgXvXSfUzRy7soyggfMgXeQucOlHGHyXlWUL78xOJ5pEroKpNhPk3L2Pp4_Hk=h310",
        "//lh5.ggpht.com/3AmAQyAvObdT68St6lD1ej5NcTsBAoxOMe0uXwrnqNqHvibfZLof1MQMhK5wTrh2tAo=h310"
    ],
    "comments": [
        "It not letting me save my message",
        "Ok...Not sure yet It has potential. ..but when I create my own message. There is no 'clear' way to save the personal message. When I return to the app. The personal message is not there."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.kandasoft.eatless&hl=en&gl=us",
    "appId": "com.kandasoft.eatless"
}