{
    "title": "365Scores - Live Sports Score, News & Highlights",
    "summary": "Live the Game with the Complete Sports Experience - NBA, EPL, LaLiga, MLS &amp; More",
    "icon": "//lh3.googleusercontent.com/yR1Gct7G6ErKwikRuOlUX5RchNY4LcIgE_TeeHJyoXc5pPgrGECD-dH1ZDSYjdjdDscV=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.6,
    "reviews": 632475,
    "developer": "365Scores LTD",
    "developerId": "365Scores+LTD",
    "developerEmail": "contact@365scores.com",
    "developerWebsite": "http://www.365scores.com",
    "developerAddress": "69 Jervois St.\nSheung wan\nHong Kong",
    "updated": "February 24, 2018",
    "version": "Varies with device",
    "genre": "Sports",
    "genreId": "SPORTS",
    "size": "Varies with device",
    "description": "Join over 30 million other fans and enjoy 24/7 insta live coverage of 10 different sports. Including the fastest scores updates on earth, Live Stats, Breaking News, In-Game Insights, Highlights, Lineups, Live Tables and much more.NBA, NFL, Champions League, Premier League, La Liga, MLS, Serie A, Liga MX, MLB and over 2,000 leagues of Soccer, Football, Tennis, Basketball, Rugby and other sports.  Fully personalized content and notification services.● Choose what teams and leagues you want to follow or pick your games in that moment.● Warning! Our live match notifications may be faster than your game stream. It also allows you to select exactly which events to follow, get breaking news alerts and activate our night mode so you can have a life while doing so.● Watch the best moments of the match (And the day) with the BUZZ stream right after they happen● Own the transfer market with our special transfer feed.● Follow the sports TV schedule so you can always catch your game on the bigger screen.● Pre-game and live insights for all the major football & tennis competitions● Live Match Tracker, the best way to be in the game when you can't see the game!SUPPORTS 10 DIFFERENT SPORTS:Soccer, Football, Rugby, Tennis, Basketball, Cricket, Ice Hockey, Baseball, Volleyball, American football and Handball.MORE THAN 2,000 COMPETITIONS:● English Premier League, FA Cup, UEFA Champions League, The Football League, Spanish La Liga, Bundesliga, Serie A, French Ligue 1, Wide coverage of South American, African and Asian leagues. Wimbledon, Roland Garros, US Open, Davis Cup, NFL, NBA, MLB, NHL, MLS, NCAA and much more!YOUR TEAMS:Real Madrid, Barcelona, Atletico, Manchester United, Manchester City, Liverpool, Chelsea, Arsenal, Tottenham, PSG, Juventus, AC Milan, Bayern Munich, Dortmund and also Flamengo, Corinthians, Al Hilal Riyadh, Al Ahly, River Plate, Boca Juniors, or any international and local team you wish to follow. We’re always happy for any feedback! For any question or inquiry email us at: contact@365scores.com or visit us on: Facebook:  http://www.facebook.com/365scoresTwitter:  http://www.twitter.com/365scoresInstagram:  http://www.instagram.com/365scores",
    "descriptionHTML": "Join over 30 million other fans and enjoy 24/7 insta live coverage of 10 different sports. Including the fastest scores updates on earth, Live Stats, Breaking News, In-Game Insights, Highlights, Lineups, Live Tables and much more.<br><br>NBA, NFL, Champions League, Premier League, La Liga, MLS, Serie A, Liga MX, MLB and over 2,000 leagues of Soccer, Football, Tennis, Basketball, Rugby and other sports.  <br><br>Fully personalized content and notification services.<br><br>&#x25CF; Choose what teams and leagues you want to follow or pick your games in that moment.<br>&#x25CF; Warning! Our live match notifications may be faster than your game stream. It also allows you to select exactly which events to follow, get breaking news alerts and activate our night mode so you can have a life while doing so.<br>&#x25CF; Watch the best moments of the match (And the day) with the BUZZ stream right after they happen<br>&#x25CF; Own the transfer market with our special transfer feed.<br>&#x25CF; Follow the sports TV schedule so you can always catch your game on the bigger screen.<br>&#x25CF; Pre-game and live insights for all the major football &amp; tennis competitions<br>&#x25CF; Live Match Tracker, the best way to be in the game when you can&apos;t see the game!<br><br><b>SUPPORTS 10 DIFFERENT SPORTS:</b><br>Soccer, Football, Rugby, Tennis, Basketball, Cricket, Ice Hockey, Baseball, Volleyball, American football and Handball.<br><br><b>MORE THAN 2,000 COMPETITIONS:</b><br>&#x25CF; English Premier League, FA Cup, UEFA Champions League, The Football League, Spanish La Liga, Bundesliga, Serie A, French Ligue 1, Wide coverage of South American, African and Asian leagues. Wimbledon, Roland Garros, US Open, Davis Cup, NFL, NBA, MLB, NHL, MLS, NCAA and much more!<br><br><b>YOUR TEAMS:<b><br>Real Madrid, Barcelona, Atletico, Manchester United, Manchester City, Liverpool, Chelsea, Arsenal, Tottenham, PSG, Juventus, AC Milan, Bayern Munich, Dortmund and also Flamengo, Corinthians, Al Hilal Riyadh, Al Ahly, River Plate, Boca Juniors, or any international and local team you wish to follow. <br><br>We&#x2019;re always happy for any feedback! For any question or inquiry email us at: contact@365scores.com or visit us on: <br>Facebook:  http://www.facebook.com/365scores<br>Twitter:  http://www.twitter.com/365scores<br>Instagram:  http://www.instagram.com/365scores</b></b>",
    "histogram": {
        "1": 19843,
        "2": 11231,
        "3": 27980,
        "4": 93894,
        "5": 479527
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Et0MIjIHuDr9M9BXl5o21IUlMg_kZwMNEx12eTKILDCSdvfUl5lygc1GCORLrcEjHmA=h310",
        "//lh3.googleusercontent.com/DOEHupMPc_GUdLnSL9lGPPtYfmB3r-Vc3Xc7aeLowBHAjvCShs9icTfB0yPGNU029Kk=h310",
        "//lh3.googleusercontent.com/Pwgb9uLGBgkqZF1rObF3SU_ewRBKI43Nl7pshqjeIJEwm5UmOJPVS_xItHdTo45ppLs=h310",
        "//lh3.googleusercontent.com/lMuZtgkA5BwcfIKr1vSw7wEie47ctb568_LYXGH98Bc28kYqYo8a94LZ5Ox58XAVNw=h310",
        "//lh3.googleusercontent.com/wiYT7pwgrpQ2WdAfoOT0qNfooYX8TxhoMOnetVW_6mac4fH16PmyWQgNi25tt8QteLo=h310",
        "//lh3.googleusercontent.com/KIyj6EgJ9qL22e9bstgCQFQ12Pl62RTfUlv3CL5tHukQuXddKq5x9PsCzAhfoHOrB4s=h310",
        "//lh3.googleusercontent.com/1xZJ-Edv7mJpRWhaaJ2GBrs2JGqf6fyiMxecuF1UDpEudmEr1sfqwglj2Gh1yxvaVEo=h310",
        "//lh3.googleusercontent.com/K2zlsqKXroD_CnWO__JvfJQjHw7TxMDUPXsWofNsIgnMrztqjukKMSE8oMnRHNfMnGcN=h310",
        "//lh3.googleusercontent.com/vL_3zOtkWO5Sq3RWyS_ztr1S2djUb8UZZy08pYTYPW-MPF3VsSpJuAL7rQrzI8IYkV4=h310",
        "//lh3.googleusercontent.com/EIPwkXAykBdxiXDD3qPEHlcGawZeBIIJ7qbMDas8NLl7uDNjqMpPEa2IH7Xn3Z8Zmg8=h310",
        "//lh3.googleusercontent.com/bHhPA-IsKuB14RTooP3A_evclPoRlXe1tgUv1crTPoBkKHeK9fbLuj7mXTJpxIP9_Qo=h310",
        "//lh3.googleusercontent.com/0-CSN6i-NIzWuufI5h4bZGfF-GcirfLNAUutZ1RY5ePesjpy5jy67tajyGSBQDyDLEI=h310",
        "//lh3.googleusercontent.com/N3Wabi8gqgLF3dTIK6YTG6dy7PXfvTLHFcgSWQLcwfQ57zeW4ctrD9UbZ_jYP-Zu9V4=h310"
    ],
    "video": "https://www.youtube.com/embed/Vl1LaPmLi90",
    "comments": [
        "The overall app is good, like the rest of the apps for sports (such as sofascores and livescores). Tho 365scores prices for tips are laughable, I wouldn't recommend anyone using that feature.",
        "Overall, i like this app. I am habituated with this app and i don't think i need to download other apps to see scores and highlights. But, in this app highlights are not well managed which i would rate 9 if it was out of 10. So Please, make the highlights able to be viewed directly from the app. Then, it will make my life easier. ☺️",
        "is it soooo difficult to fix this time problem? since more than a year you cant fix this issue, its annoying and thats why many of users uninstalling your soft...fix it guyssss",
        "Why u removed the leagues statistics including top goal scorers, Whats wrong with this app",
        "Android Wear notifications sometimes come up blank unless I swipe my display a bit. Those that do display don't even fit the round watch screen.",
        "Have been using for couple of years now. But now the highlights video in streamable doesn't works. That's so irritating. Desperately looking for alternative app now"
    ],
    "recentChanges": [
        "* Odds comparison - Allows you to see live odds (Updated within seconds) Vs pre-game odds and find Inplay opportunities",
        "* Pre-Match lineups info now includes players doubtful for the match and players who have been ruled out",
        "* Some things haven't changed though. Content is fully personalized, Game Center keeps getting richer and the live updates are still the fastest around.",
        "Have fun!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.scores365&hl=en&gl=us",
    "appId": "com.scores365"
}