{
    "title": "EZ Score for Wear",
    "summary": "The easiest and best way to keep score on your Android Wear device",
    "icon": "//lh3.googleusercontent.com/1eXFpv2z8HwZln5VP3By9lhGpM5il65eNejU-fwVtvRKpN5kwKPJ2zmMwTFXgWcIga0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.7,
    "reviews": 6,
    "developer": "JEB APPS",
    "developerId": "JEB+APPS",
    "developerEmail": "jebsears@gmail.com",
    "developerWebsite": "http://www.swvoffroad.com",
    "updated": "March 20, 2016",
    "version": "2.50",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "THE WORLD NUMBER 1 SCORE TRACKING WITH WIN BY TWO FUNCTIONALITY APP DESIGNED FOR ANDROID WEAR***FREE FOR A LIMITED TIME, DOWNLOAD NOW***How many times have you been playing a competitive game of cornhole only to realize that no one knows what the score is? NOT ANY MORE! EZ Score for Wear was specifically designed to allow you to keep score on your sweet new Wear device. Use this app to show off your awesome smart watch in front of your friends and make them all super jealous. Features:*Option to set a play to score*Easy score keeping*Win by Two optionWorks with:*Bocce Ball*Cornhole*Basketball*Shuffleboard*Ping Pong*Hot Dog Eating Contests*Any head to head competitionReviews:\"This app changed my life! It totally impressed the hot chick at the bar and now we are getting married\" - Dale\"Great App! I used this to catch my brother in law cheating and it was awesome to see him cry. Someone buy this developer a beer!” - Ronnie\"Without this app I never would have gotten second place in the State Bocceball tournament. I wish I had 10 watches so I could install it on them all\" - HH Team Member\"I'm so proud of you\" - Mom",
    "descriptionHTML": "THE WORLD NUMBER 1 SCORE TRACKING WITH WIN BY TWO FUNCTIONALITY APP DESIGNED FOR ANDROID WEAR<br><br>***FREE FOR A LIMITED TIME, DOWNLOAD NOW***<br><br><br>How many times have you been playing a competitive game of cornhole only to realize that no one knows what the score is? NOT ANY MORE! EZ Score for Wear was specifically designed to allow you to keep score on your sweet new Wear device. Use this app to show off your awesome smart watch in front of your friends and make them all super jealous. <br><br>Features:<br>*Option to set a play to score<br>*Easy score keeping<br>*Win by Two option<br><br>Works with:<br>*Bocce Ball<br>*Cornhole<br>*Basketball<br>*Shuffleboard<br>*Ping Pong<br>*Hot Dog Eating Contests<br>*Any head to head competition<br><br>Reviews:<br>&quot;This app changed my life! It totally impressed the hot chick at the bar and now we are getting married&quot; - Dale<br><br>&quot;Great App! I used this to catch my brother in law cheating and it was awesome to see him cry. Someone buy this developer a beer!&#x201D; - Ronnie<br><br>&quot;Without this app I never would have gotten second place in the State Bocceball tournament. I wish I had 10 watches so I could install it on them all&quot; - HH Team Member<br><br>&quot;I&apos;m so proud of you&quot; - Mom",
    "histogram": {
        "1": 1,
        "2": 0,
        "3": 2,
        "4": 0,
        "5": 3
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/6Mwc3bW8NRLA19kZFwra6BVq2QyzrGUSwpl1ZZS26a43ngsyTpkfPzdSGxJyZ3fshg=h310",
        "//lh3.googleusercontent.com/IlWNdwNuwlqsRfrCO7bVQbJKcPxFm6xkAkJDpDVLtiVE2g6fpCGPi1DFtBjDslO1kQ=h310"
    ],
    "comments": [
        "I love this app... helps with my ping pong tournaments",
        "Has potential. Does not keep screen locked so I constantly lose my score when my watch goes \"home\". Exactly what I needed if it didn't have that issue. Oh well.",
        "Great stuff ... But.. Easy to use. Tap to score. Clear display.   But...(only thing but big thing) ..doesn't stay active.... If you don't touch it for a minute or so the watch goes to sleep .... Should prevent sleep when in progress...  And once sleeps, if you open app the score has reset ( on my SW3).  Hope you can fix for more stars!",
        "Great app!"
    ],
    "recentChanges": [
        "*Resume game button added to pick back up your game if you close the application",
        "==============================",
        "*Screen stays locked on during game play",
        "==============================",
        "*Added support for round watch faces",
        "*Now can play games without a score limit"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.swvoffroad.jebsears.simplescoretracker&hl=en&gl=us",
    "appId": "com.swvoffroad.jebsears.simplescoretracker"
}