{
    "title": "Foursquare Swarm: Check In",
    "summary": "Remember everywhere.",
    "icon": "//lh3.googleusercontent.com/Vm8PfIKIENrm_8vZNAUldp0seiOk4crusyrbs4GMfuhDFcBhaiTAHY1kE-NIHC1sWNI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 3.9,
    "reviews": 419466,
    "developer": "Foursquare",
    "developerId": "7953007503920441591",
    "developerEmail": "swarmfeedback@foursquare.com",
    "developerWebsite": "http://swarmapp.com",
    "updated": "February 15, 2018",
    "version": "Varies with device",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "size": "Varies with device",
    "description": "Swarm is the best way to keep track of the places you go. From the new café downtown to that killer ramen spot in Tokyo, you’ll never ask “what was the name of that place?” again. Whether you love to be a local, or are trying to travel the globe, check-in so you can remember everywhere with Swarm.• This is lifelogging made easy. Each time you check-in we’ll add a pin your personal map so you can look back on the places you visit. Help out your future self by adding a photo or a note to your check-ins to make the memories all the better.• Indian Restaurant? Check. Karaoke bar? Check. Haven’t been to an Art Museum yet? Now’s your chance to go somewhere new! Explore more and collect different types of places so you can keep track and remember your history. You’ll earn fun Stickers along the way.• Whether it’s your 10th week in a row at the gym, first time to Canada, or the 25th time you’ve gotten ice cream with your BFF, the more you check-in, the more helpful insights you’ll get as you track your habits and explorations. •Keep up and meet up with friends. Share your location with a checkin and see friends nearby. A serendipitous checkin can help you find friends when you’re out and about and see who’s here.•Don’t have any friends nearby? Not a problem! Not only is this app a great way to lifelog and remember for yourself, but to keep track of your friends’ adventures as well, no matter how far far away they are. •Lifelog your adventures so your history is less questions, more remembering the good times.*A note on battery. We’ve spent *years* developing the location technology that powers Foursquare Swarm, making it extremely power efficient. But, as with all apps of this type, continued use of GPS running in the background can dramatically decrease battery life.",
    "descriptionHTML": "<b>Swarm is the best way to keep track of the places you go.</b> From the new caf&#xE9; downtown to that killer ramen spot in Tokyo, you&#x2019;ll never ask <i>&#x201C;what was the name of that place?&#x201D;</i> again. Whether you love to be a local, or are trying to travel the globe, check-in so you can <b>remember everywhere with Swarm.</b><br><br>&#x2022; <b>This is lifelogging made easy.</b> Each time you check-in we&#x2019;ll add a pin your personal map so you can look back on the places you visit. Help out your future self by adding a photo or a note to your check-ins to make the memories all the better.<br><br>&#x2022; Indian Restaurant? Check. Karaoke bar? Check. Haven&#x2019;t been to an Art Museum yet? <b>Now&#x2019;s your chance to go somewhere new!</b> Explore more and collect different types of places so you can keep track and remember your history. You&#x2019;ll earn fun Stickers along the way.<br><br>&#x2022; Whether it&#x2019;s your 10th week in a row at the gym, first time to Canada, or the 25th time you&#x2019;ve gotten ice cream with your BFF, <b>the more you check-in, the more helpful insights you&#x2019;ll get</b> as you track your habits and explorations. <br><br>&#x2022;<b>Keep up and meet up with friends.</b> Share your location with a checkin and see friends nearby. A serendipitous checkin can help you find friends when you&#x2019;re out and about and see who&#x2019;s here.<br><br>&#x2022;Don&#x2019;t have any friends nearby? Not a problem! Not only is this app a great way to lifelog and remember for yourself, but to keep track of your friends&#x2019; adventures as well, no matter how far far away they are. <br><br>&#x2022;Lifelog your adventures so your history is less questions, more remembering the good times.<br><br>*<i>A note on battery. We&#x2019;ve spent *years* developing the location technology that powers Foursquare Swarm, making it extremely power efficient. But, as with all apps of this type, continued use of GPS running in the background can dramatically decrease battery life.</i>",
    "histogram": {
        "1": 64319,
        "2": 20285,
        "3": 42973,
        "4": 77183,
        "5": 214706
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/bZwods4st8FcoIh9Usf14SvbasHNTHmci2jnzN-VNn117tWL_TgOEMkPQ8EqiQz3Aes=h310",
        "//lh3.googleusercontent.com/WYMFsrxAc9ju68foaOjoeBe64si0bRd4fOnFZmI-Js2cI7TChe4uJp4C9tc1_ul19bs=h310",
        "//lh3.googleusercontent.com/8z2FSVA9w_c7gv202u6-p8J_LPQPv0Cax3HfXqdOXJ_MW6RZYXy5svdwEDzNv-tDNQN-=h310",
        "//lh3.googleusercontent.com/iYj0LPShwkdMBSKH_P54MxG2kDpdXSGK7bB1PbbqL7PFBe17VwahPb5apqD94HWeQ7Q=h310",
        "//lh3.googleusercontent.com/wF_CQ_qVJfsf3maGL4qDukVl18x2Gy8ejlLpfA1RY6UcX6cfBOBwBtrG3ajhhz8ACk0=h310"
    ],
    "video": "https://www.youtube.com/embed/2kX5Pr9OE6Y",
    "comments": [
        "Used to be a much better app until a big change last year. Now I check in far less often because it's clunkier or it just cannot find my location.",
        "This app has literally saved my butt on a huge road trip. I'd feel lost without it honestly. It also makes me feel safer knowing if something happened to me people could see the last place I was",
        "Send friend requests is a big issue in this app. What is this privacy you put in such a social application? Why cant we send infinite friend requests as we do in instagram??!!! I alreafy had uninstalled this app because of this issue but some friend told me issue has resolved and they delete your outstanding requests and you can add new frinds in new version, but when i want to delete old requests i face the message \" something went wrong while trying to delete old requests\"...and im going to uninstall it forever",
        "Is it broke AGAIN??? NOT posting pics to social media AGAIN. Seems like this happens every couple of months. Hope it gets fixed AGAIN.",
        "Not happy because it keep giving me one point for places I submitted pictures as proof of being there.",
        "Used to love it, thousands of check-ins and now after one of the latest updates doesn't work for me anymore - doesn't let me check in"
    ],
    "recentChanges": [
        "Some bees got stuck in our keyboards. The bees are free now."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.foursquare.robin&hl=en&gl=us",
    "appId": "com.foursquare.robin"
}