{
    "title": "Go There Now",
    "summary": "Frustrated with starting navigation in Google Maps? GO THERE NOW makes it easy!",
    "icon": "//lh3.googleusercontent.com/r3dPg29G842McliCIYyjh56jsmewl7vpuoWcE76y9aDD11HClQAXazBP56jZxMFP5mvY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.7,
    "reviews": 40,
    "developer": "Huh X0015",
    "developerId": "Huh+X0015",
    "developerEmail": "ycorner0015@gmail.com",
    "updated": "September 21, 2015",
    "version": "2.01",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "GO THERE NOW allows users to manage many favorite locations in a single app, as well as offering a simplified approach to starting Navigation Mode in Google Maps. With GO THERE NOW, you can start Navigation Mode immediately, without having to go through several steps in Google Maps to get Navigation Mode going. You can also create customized homescreen shortcuts that you can interact with to start Navigation Mode directly from your homescreen! GO THERE NOW also supports Android Wear devices! All location shortcuts that are created on your Android smartphone or tablet are automatically synchronized with any paired Android Wear smartwatch! You can launch Google Maps in Navigation Mode on your smartphone or tablet by tapping on the location shortcuts that appear on your Android Wear smartwatch!Start saving your time now!FEATURES• Start Google Maps in Navigation Mode immediately.• Bypasses the several steps required in Google Maps to initiate Navigation Mode, saving users precious time. • Manage favorite location shortcuts in a single application.• Create customized homescreen shortcuts to start Google Maps in Navigation mode immediately.• Launch Navigation Mode directly from any paired Android Wear smartwatch.• All saved location shortcuts are automatically synchronized with any paired Android Wear smartwatch.• Supports several language interfaces, including: English, Chinese (Traditional & Simplified), French, German, Hindi, Italian, Japanese, Korean, Portuguese, Russian, Spanish, and Vietnamese.REQUIREMENTS• ANDROID VERSION: Android 2.3 (Gingerbread) and above is supported.• SOFTWARE: GOOGLE MAPS is required to use navigation mode.• WEARABLES: All ANDROID WEAR devices are supported.",
    "descriptionHTML": "GO THERE NOW allows users to manage many favorite locations in a single app, as well as offering a simplified approach to starting Navigation Mode in Google Maps. With GO THERE NOW, you can start Navigation Mode immediately, without having to go through several steps in Google Maps to get Navigation Mode going. You can also create customized homescreen shortcuts that you can interact with to start Navigation Mode directly from your homescreen! <br><br>GO THERE NOW also supports Android Wear devices! All location shortcuts that are created on your Android smartphone or tablet are automatically synchronized with any paired Android Wear smartwatch! You can launch Google Maps in Navigation Mode on your smartphone or tablet by tapping on the location shortcuts that appear on your Android Wear smartwatch!<br><br>Start saving your time now!<br><br>FEATURES<br>&#x2022; Start Google Maps in Navigation Mode immediately.<br>&#x2022; Bypasses the several steps required in Google Maps to initiate Navigation Mode, saving users precious time. <br>&#x2022; Manage favorite location shortcuts in a single application.<br>&#x2022; Create customized homescreen shortcuts to start Google Maps in Navigation mode immediately.<br>&#x2022; Launch Navigation Mode directly from any paired Android Wear smartwatch.<br>&#x2022; All saved location shortcuts are automatically synchronized with any paired Android Wear smartwatch.<br>&#x2022; Supports several language interfaces, including: English, Chinese (Traditional &amp; Simplified), French, German, Hindi, Italian, Japanese, Korean, Portuguese, Russian, Spanish, and Vietnamese.<br><br>REQUIREMENTS<br>&#x2022; ANDROID VERSION: Android 2.3 (Gingerbread) and above is supported.<br>&#x2022; SOFTWARE: GOOGLE MAPS is required to use navigation mode.<br>&#x2022; WEARABLES: All ANDROID WEAR devices are supported.",
    "histogram": {
        "1": 5,
        "2": 4,
        "3": 7,
        "4": 6,
        "5": 18
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/CPO_rEHkfoXBX-kGmUJ3hSzbRhNqCd1mXcY5c9pzDX26OIUI6Rzj44lOIc_0JdUtTxk=h310",
        "//lh3.googleusercontent.com/lz0n34Wr5MY5GOfwAEx8eOlGE1vN2y-NuPYbCGu5JqrtxsqWs5XL0_WgqtM1Hroan4o=h310",
        "//lh3.googleusercontent.com/NFsXBDtCJT3DOKoCbL6otBzgg8_UFETqwLHNBZmoP0vdJrZYnySrSgm2ZYLXEuTeTA=h310",
        "//lh3.googleusercontent.com/paVttNGRWbA-_lpv-Zsa0trVzMDsYLeQKOCxiTok3vMjyLuRmWCzVsL-zSg28zAXEoY=h310",
        "//lh3.googleusercontent.com/x4xAVgSdzzlZKjWFlrt3wbkGoE5JyhAnyYc6F9qJnjbzH8k4rL_DYNT0o0VDRbIe9w=h310",
        "//lh3.googleusercontent.com/mkj07gkyy0jE10v0P4eHSSXwlhU0qPBx1SiSS-F87ctSIVCrig7AbGdtDiIc2lpkteRK=h310",
        "//lh3.googleusercontent.com/NvtCeFAD0jS8h4nlh3Wkw-9tfCrW9RwnVZH8wGYQN2kc80NZLiZGhhYqNRZNACT4_tX3=h310",
        "//lh3.googleusercontent.com/IViDRMCemMI4FLa2nkRcNjCtTDVJyvE8PNWNVqL0_i39-MJNxvL31TUe7335x0WPKA=h310",
        "//lh3.googleusercontent.com/mo9GGlRMiFUX1QXOsRm_nTI-Ndp3BRruhiOBSJ5UgKEfaC0eMuvSgEfIfHYTrtU6EhM=h310",
        "//lh3.googleusercontent.com/yGPjI7xu6ZLe2O2lclN6th0TPqhJbuBk_snLM0mHziOUzzAGHUTNdMnW9hr6CdE6UDY=h310",
        "//lh3.googleusercontent.com/CQCEH0GM0fWrL9NN2iUv2sxPW7DsTvxaaTdhpLiG2Z6N1KlFD8vMotAs_K6syFYyjt8=h310",
        "//lh3.googleusercontent.com/zMU0Utv4qOZKuirOvB3NFGz6faRP2r_9qvNhXe7OnbNE86h06Y43GvB6DsfklLmJ7R8=h310",
        "//lh3.googleusercontent.com/eJedWN2YpAHwsLyyR50BgsEV-JRdJ6t9nLe2t4gc0pZz8KYrY7fp3GKl7htsequDKQ=h310",
        "//lh3.googleusercontent.com/S6lFn9ajSxh7z9CBklWg_zU5OW1FNiRHP5vj2DmP8GbHFFlyFmT26AHeSSa-CNzfYe0=h310",
        "//lh3.googleusercontent.com/yo22o_DG5j2fcLvfLH-j5ksLIiI4ke9ZF7RoHLCzvc4kIwqluCBlJg8JTMmP8ZpSUAI=h310",
        "//lh3.googleusercontent.com/h3L4axsk4h_a2uFt_OHH82h6PvTRzzprX4VILqNNQfMHInfOxR9l9DR9PRovL2mjQ90=h310",
        "//lh3.googleusercontent.com/JVYy5-L_6Jbv61VtTmllSI818os-DE1eQbpmnpQHLnADSWu-Wy_-U_gd5CBOTcxJeg=h310",
        "//lh3.googleusercontent.com/OUharLRZMkP-lHHrGzVRiJH6WF62w9x8Kt62fWJSdsJxM1YICpCCtQarQeZ2Lv_fNg=h310",
        "//lh3.googleusercontent.com/ENf9A-Fl531XMrkZOAjIgLUsySRn1eEb4ziDk8OqTOtdHayKcbRwGMoz_Mm0s7lx8g=h310",
        "//lh3.googleusercontent.com/_0SmrgBTXNA7_1iA4Q9KvbaEZIhZ3inypnqtod-9uNJ4uN7z8avwtDzB4QYNMihpoT3k=h310",
        "//lh3.googleusercontent.com/BrhtWesaxu3JauTYCNo2ZV8hIcgLztxOxbL5_o30Uxa002biPtleqguZn8YJtRqCvUs=h310",
        "//lh3.googleusercontent.com/rScknitsun0acME90N9WtFRDhCFSnMnGYiPE5pcu71hyOKviprjNIT_CuK17WFtgPiiJ=h310",
        "//lh3.googleusercontent.com/nhI1k2HsoYmgBJjX19VZLY59oZ7DfcTH8thmYCbODHPDQRcRuEBibTC_ZxsJk_-aRg=h310",
        "//lh3.googleusercontent.com/uduv6QyeBYtmqmxgFkmR4d9zlLDCjutaJAx5pt7xb504MMrRvEbCCp8e-z6yOyaenQ=h310"
    ],
    "comments": [
        "Works perfectly on my Galaxy S3, S4 & S7 Edge!  I love being able to create a shortcut right on my homescreen. So no matter where I'm at when driving, I just hit my 'HOME' button & it automatically figures out fastest way back. I can also create homescreen icons for other places I frequent.",
        "Fail! Can't create shortcuts from my saved contacts Or if it can, it's not obvious how to do it.",
        "Doesn't work. If I type any addresses, the app stops working.",
        "Awful User interface makes it impossible to use",
        "Update:  I can't leave home without it.",
        "For me it is way more convinient to silently tap on my wrist on a favorite shortcut I created \"Home by car\" than to have to say out loud \"OK Google, navigate home\"."
    ],
    "recentChanges": [
        "* 2.01:",
        "- NEW FEATURE: Can launch Google Maps in Navigation Mode on Android Wear with voice.",
        "- Made visual enhancements to the shortcuts layout for the Android version.",
        "- Can now skip the tutorial for first time users."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.huhx0015.gotherenow&hl=en&gl=us",
    "appId": "com.huhx0015.gotherenow"
}