{
    "title": "Find My Phone (Android Wear)",
    "summary": "Find your wear from phone or phone from wear using this app.",
    "icon": "//lh4.ggpht.com/k3VqiUb6yzHP70BnNBuO2f51t5ssERUlpxkcZRVnU3ZNh-NfiP-400Ec6rhMrrgqhg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4,
    "reviews": 1206,
    "developer": "Mentisco",
    "developerId": "Mentisco",
    "developerEmail": "mentisco.mobile@gmail.com",
    "developerWebsite": "http://mentisco.com/privacy-policy",
    "updated": "February 18, 2015",
    "version": "2.0",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Please note that this app is only for people who use Android Phone and Android Wear both. Stand alone this app won't be of any use to you. This app helps you finding your phone from gear or vice versa. Days of misplacing phone and android wear under sofa, pillow etc are over. This app allows any android smartphone user with android wear (watch) to easily find its phone by calling,vibrating and turning screen on if android wear is connected to phone.You can also find you android wear(watch) by calling,vibrating and turning screen light on of wear from your mobile. It will also show status if connection status of wear and mobile.",
    "descriptionHTML": "Please note that this app is only for people who use Android Phone and Android Wear both. Stand alone this app won&apos;t be of any use to you. This app helps you finding your phone from gear or vice versa. <br><br>Days of misplacing phone and android wear under sofa, pillow etc are over. This app allows any android smartphone user with android wear (watch) to easily find its phone by calling,vibrating and turning screen on if android wear is connected to phone.You can also find you android wear(watch) by calling,vibrating and turning screen light on of wear from your mobile. It will also show status if connection status of wear and mobile.",
    "histogram": {
        "1": 176,
        "2": 50,
        "3": 100,
        "4": 173,
        "5": 707
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/sP6xt6sbUKx6M-opMEYnlDqa1SkLSKvor1XiwhLgZBhzzb9fa0TQrjHNIGqCF8NQZg=h310",
        "//lh3.ggpht.com/etrF8wEegZvT0qfdfyqfzvbeWiuDe0r0VYS3ItbOaG9l-C77hUctSRbkU99j9YpLZw0=h310",
        "//lh6.ggpht.com/eVW4dMjx_zZHofx80QngVEIRBKoUKNCg2XoM1jv6E1CogAo7KMA2FMlOIgm7SrijCGP5=h310",
        "//lh5.ggpht.com/S8COijry6X3iWIAQircBaaNFcBbmjsKUZN_4DYcGKK1pqApxQap0VmXesbHv0ieWw2g=h310",
        "//lh5.ggpht.com/VnNUTRR-ETKpXrld-s_zg3KpkWyjFbEP-XsoZLNqrYw1lGb64U37JzHCpNwHbcQXPw=h310"
    ],
    "comments": [
        "Doesn't work at all I literally just got the app and all its done for more is put a picture of a girl on my screen whenever I open the application! This app is horrible and I recommend you not to waste your time downloading it",
        "I think it was so horrible I reccomend you to not dowload this app because there is just a girl on a screen and its so useless",
        "It is a useless app it just a photo of a girl and it can't do anything Aaaaaaaaaaaaaaaaaaah",
        "Used to work I used to be able to connect to the network and add my devices and stuff. Now it just stays on a picture of some girl forever.",
        "When i got the app i thaugt it was cool then it did not work it just showed a pic of a girl dont download it",
        "Like so far today and time will tell. Lol. So far loving it.  Take care and. And thank you all"
    ],
    "recentChanges": [
        "Chaged complete UI"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mentisco.findmymobile&hl=en&gl=us",
    "appId": "com.mentisco.findmymobile"
}