{
    "title": "myShopi – shopping & promo",
    "summary": "myShopi is the #1 free &amp; easy to use shopping list app with a 4.5 app rating",
    "icon": "//lh5.ggpht.com/a9dnnRr2_EGq1DSxj5lcS2Ngna7cDYJkhAOgw-LFFuEoPw3poHl2xBHMT2mxeLNpvzeY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.2,
    "reviews": 23071,
    "developer": "myShopi",
    "developerId": "myShopi",
    "developerEmail": "info@myshopi.com",
    "developerWebsite": "http://www.myshopi.com",
    "developerAddress": "De Kleetlaan 12B\n1831 Diegem\nBelgium",
    "updated": "February 27, 2018",
    "version": "7.1.6",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "THE ULTIMATE PROMO & SHOPPING APP!---myShopi is the Belgian promo and shopping app, with exclusive promotions, retailer leaflets, digital loyalty cards and many other features. It’s the perfect shopping assistant for your grocery shopping and to benefit from exclusive discounts and promotions.MYSHOPI INCLUDES----\tRetailer leaflets-\tExclusive cashback promotions-\tDigital loyalty cards-\tShopping list for your daily groceriesThe international version of the app (in English) consists of the shopping list only, while the Belgian version (in Dutch and French) includes all other features as well.ABOUT MYSHOPI----\tThe app was downloaded more than 1.000.000 times in Belgium and more than 7 million times worldwide.-\tIn only 2 years time, myShopi reimbursed more than 3 million euros to consumers. -\tHeavy cashback users have saved over 400 euros on their groceries.-\tEvery second, 2,5 people launch the myShopi promo & shopping app somewhere in the world.ABOUT OUR FEATURES---Combine all myShopi features into one comprehensive and smart shopping experience!-\tSHOPPING LISTCompose your list on your smartphone or tablet by selecting products in the app and tick them off while shopping. You can also just scan the barcode of the products you want to add.  Share your shopping list on different devices and with the members of your family. Start now by composing your shopping list for Carrefour, Delhaize, Colruyt and many other shops.-\tCASHBACK PROMOTIONS (only in Belgium)The cashback promotions on myShopi are valid in every store, even the ones near you. Add the promotions to your digital shopping list to save on your groceries, week after week.  You can even save up to 100% on your favorite brands and you’ll be reimbursed in only 7 days. Thanks to cashback promotions for Coca-Cola, Nestlé, l’Oréal, Garnier and many other brands, together, Belgian families have saved over millions of euros.   -\tDIGITAL LOYALTY CARDS (only in Belgium)Include your loyalty cards in your app by simply scanning them with your smartphone. That way, you never miss out on bonus points at the cash register and you’ll never have to take that pile of plastic cards with you. Start now by adding loyalty cards of Carrefour, Decathlon, Delhaize, AS Adventure, Veritas, Hubo and many more. -\tDIGITALE RETAILER LEAFLETS (only in Belgium)Swipe through folders from your favorite shops on your smartphone or tablet and cut out products with the digital scissors to add them to your shopping list. myShopi offers most Belgian retailer leaflets of Lidl, Aldi, Colruyt, Carrefour, Delhaize, Kruidvat, Gamma, Brico, Blokker, Media Markt and many more.-\tSHOP INFO (only in Belgium)Consult the opening hours and addresses of more than 12.000 supermarkets and shops. -\tSYNCHRONISATIONSynchronise your  shopping list on different devices and with the whole family.1) Compose your shopping list.2) Share your list on different devices or with members of your family.-\tCASHBACK PROMOTIONS (only in Belgium)Enjoy cashback promotions in the shop near you and the money will be reimbursed within 7 days on your bank account.1) Discover all promotions in the myShopi app, which are valid in every shop.2) Scan the product in the shop with your myShopi app to make sure it’s the right product.3) Pay the product at the cash register and don’t forget to keep the ticket.4) Take a picture of the ticket with your myShopi app and make sure it’s completely visible.5) Complete your data, send your cashback request and you’ll be reimbursed on your bank account in only 7 days. FOLLOW US---Website: www.myShopi.beFacebook: www.facebook.com/myShopiTwitter: www.twitter.com/myShopi",
    "descriptionHTML": "<b>THE ULTIMATE PROMO &amp; SHOPPING APP!</b><br>---<br><br>myShopi is the Belgian promo and shopping app, with exclusive promotions, retailer leaflets, digital loyalty cards and many other features. It&#x2019;s the perfect shopping assistant for your grocery shopping and to benefit from exclusive discounts and promotions.<br><br><b>MYSHOPI INCLUDES</b><br>---<br><br>-\tRetailer leaflets<br>-\tExclusive cashback promotions<br>-\tDigital loyalty cards<br>-\tShopping list for your daily groceries<br><br>The international version of the app (in English) consists of the shopping list only, while the Belgian version (in Dutch and French) includes all other features as well.<br><br><b>ABOUT MYSHOPI</b><br>---<br><br>-\tThe app was downloaded more than 1.000.000 times in Belgium and more than 7 million times worldwide.<br>-\tIn only 2 years time, myShopi reimbursed more than 3 million euros to consumers. <br>-\tHeavy cashback users have saved over 400 euros on their groceries.<br>-\tEvery second, 2,5 people launch the myShopi promo &amp; shopping app somewhere in the world.<br><br><b>ABOUT OUR FEATURES</b><br>---<br><br>Combine all myShopi features into one comprehensive and smart shopping experience!<br><br><b>-\tSHOPPING LIST</b><br>Compose your list on your smartphone or tablet by selecting products in the app and tick them off while shopping. You can also just scan the barcode of the products you want to add.  Share your shopping list on different devices and with the members of your family. Start now by composing your shopping list for Carrefour, Delhaize, Colruyt and many other shops.<br><br><b>-\tCASHBACK PROMOTIONS (only in Belgium)</b><br>The cashback promotions on myShopi are valid in every store, even the ones near you. Add the promotions to your digital shopping list to save on your groceries, week after week.  You can even save up to 100% on your favorite brands and you&#x2019;ll be reimbursed in only 7 days. Thanks to cashback promotions for Coca-Cola, Nestl&#xE9;, l&#x2019;Or&#xE9;al, Garnier and many other brands, together, Belgian families have saved over millions of euros.   <br><br><b>-\tDIGITAL LOYALTY CARDS (only in Belgium)</b><br>Include your loyalty cards in your app by simply scanning them with your smartphone. That way, you never miss out on bonus points at the cash register and you&#x2019;ll never have to take that pile of plastic cards with you. Start now by adding loyalty cards of Carrefour, Decathlon, Delhaize, AS Adventure, Veritas, Hubo and many more. <br><br><b>-\tDIGITALE RETAILER LEAFLETS (only in Belgium)</b><br>Swipe through folders from your favorite shops on your smartphone or tablet and cut out products with the digital scissors to add them to your shopping list. myShopi offers most Belgian retailer leaflets of Lidl, Aldi, Colruyt, Carrefour, Delhaize, Kruidvat, Gamma, Brico, Blokker, Media Markt and many more.<br><br><b>-\tSHOP INFO (only in Belgium)</b><br>Consult the opening hours and addresses of more than 12.000 supermarkets and shops. <br><br><b>-\tSYNCHRONISATION</b><br>Synchronise your  shopping list on different devices and with the whole family.<br><br>1) Compose your shopping list.<br>2) Share your list on different devices or with members of your family.<br><br><b>-\tCASHBACK PROMOTIONS (only in Belgium)</b><br>Enjoy cashback promotions in the shop near you and the money will be reimbursed within 7 days on your bank account.<br><br>1) Discover all promotions in the myShopi app, which are valid in every shop.<br>2) Scan the product in the shop with your myShopi app to make sure it&#x2019;s the right product.<br>3) Pay the product at the cash register and don&#x2019;t forget to keep the ticket.<br>4) Take a picture of the ticket with your myShopi app and make sure it&#x2019;s completely visible.<br>5) Complete your data, send your cashback request and you&#x2019;ll be reimbursed on your bank account in only 7 days. <br><br><b>FOLLOW US</b><br>---<br><br>Website: www.myShopi.be<br>Facebook: www.facebook.com/myShopi<br>Twitter: www.twitter.com/myShopi",
    "histogram": {
        "1": 1293,
        "2": 962,
        "3": 2110,
        "4": 6171,
        "5": 12535
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/-_dSKgASxpcLxeQYTYXVBHhvf_HnCOKu6ToeppDnYj7CRNEq8KvV1yzJtKVf_sEfscE=h310",
        "//lh3.googleusercontent.com/YArtrSAdHLxygbypCPvwnA0S01u56t-VXu5fiGkayzNnJGpOTMZkh2YjzHmDbFqSggYm=h310",
        "//lh3.googleusercontent.com/xZbMzGiTonV4onV8YMTJvMItLR8aeIpjP8uUPpLLBd7llgT-y0iZbG1ewQNkLWsJ1x61=h310",
        "//lh3.googleusercontent.com/B_prNQI7NX19qcgQDNUTERxcQpxLfqd-myyZ7_m3Zx0ju3Ab3GdmR-5u0biqWYNsFss=h310",
        "//lh3.googleusercontent.com/8d3gNDBonk-WV8BMJu_x2dbb6E4rBIjLpXSxs6KHTaf9JK3a1zsXlV_fXRTyTnebSQ=h310",
        "//lh3.googleusercontent.com/q980GkJX7Uah-kQEjHOfybW38YfWC_K7w6upM2WlfwHRZtLTcgmpQjjHX6bn3FEzLuKA=h310",
        "//lh3.googleusercontent.com/q_5CyzvE2uXnm-lzPOqqhB9XUT4bknGUqi04A64JFvWvlMVDyUf2aIGH4A0aLa2L3hM=h310",
        "//lh3.googleusercontent.com/gtU30OblEprV5cThsmMAFG-KIJKIfQV3f9nU1F2vlfVp4zD31GWeCm-IIU7xRwbkrZXz=h310",
        "//lh3.googleusercontent.com/iKjs_VSMFtXJs0EXp-rxIaHsHm_5M_2jNTFxfC5uyuVihB47QIabKO3j6EuKUT0C9FU=h310",
        "//lh3.googleusercontent.com/kv1tikwy5Z0tuk1uVZej4pcKbUoJg5biePRcbT4a8U0KXVAaaRr5Dd8daC4yqLCW0i8=h310",
        "//lh3.googleusercontent.com/ryC7srwQNXxAhaFLvLQ1iYxPBDB76RAd2jr_Sor2vBQp48crde1y73eLinaz4VFJJdI=h310",
        "//lh3.googleusercontent.com/9hy42hAbcQzCOgOYXQrvc-SNb6QKyJVQYOanoq5GU-40EzUfkYLLT7Vp7R4hobfdUdzn=h310",
        "//lh3.googleusercontent.com/HA3Jf_6z6RE2cPmqufJxrLQwlRyrcduj-zK69u3e90LVMbTTy6OEhrXnivXPDXA-eY4=h310",
        "//lh3.googleusercontent.com/xEgVNU9kJt4UfjykwylIs41ROdXmJnD7JhrGyGju-sQIx9HXHIwg3dR52Br21mOf_Q=h310"
    ],
    "comments": [
        "New phone loaded latest version. Belgium only now.",
        "App was in French as if Belgium is French-speaking. What a turn-down.",
        "Very good  deals",
        "Rate this app as 5 stars back in 2012. I have been using it for over 5 years. It was a great app. I loved the function that allows adding/hiding category and adding new item with picture. Now, you have to download another app for “International Region”. The original app is only available for “Belgium Region”. It does not support English and you still have to reset everything. I'm so regretted that I updated to the latest version. If I have to reset everything, why do I have to stick with this app?",
        "Your app now stinks. It used to be the best on the market I have redone 3 times to where I have everything I need to buy. Then you change everything and don't support United States anymore. I cannot get on your International so I guess I'll check back every year to see if you fixed it thanks for a once-great app not So Much Anymore",
        "4 years using this app and now everything I had added and categorized has once again been removed. This used to be my favorite shopping list app but this is the second complete wipe-out of information. And the permissions required to download this app are unreasonable. It would take me weeks to try to add back everything that was deleted. Very disappointing."
    ],
    "recentChanges": [
        "Improvements of the Promo Search."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.agilys.myshopi&hl=en&gl=us",
    "appId": "com.agilys.myshopi"
}