{
    "title": "Robinhood - Investing, No Fees",
    "summary": "Invest in cryptocurrencies, stocks, ETFs and options commission-free.",
    "icon": "//lh3.googleusercontent.com/LvWOyUYOe8xovqUdbIoMCIUnqoW2gInudnwzczSFsCAvP20BqKTFZHWBdTl_j9WdPBPW=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 47894,
    "developer": "Robinhood",
    "developerId": "6660669299832938042",
    "developerEmail": "support@robinhood.com",
    "developerWebsite": "https://robinhood.com/",
    "developerAddress": "3200 Ash St\nPalo Alto, CA 94306",
    "updated": "February 27, 2018",
    "version": "Varies with device",
    "genre": "Finance",
    "genreId": "FINANCE",
    "size": "Varies with device",
    "description": "Invest for Free- Invest in cryptocurrencies, stocks, ETFs and options side by side, all commission-free and easily accessible in one app.  - No account minimum needed to get started. (Please see Robinhood’s Fee Schedule to learn more)Instant Access-Use funds immediately for stocks and crypto with Robinhood Instant Deposits, instead of waiting the standard 3-day period.-Instantly sell your stocks to buy cryptocurrency or sell your cryptocurrency to buy stocks. Investing at Your Fingertips- Sign up in minutes, trade stocks, options, ETFs, and cryptocurrencies in seconds.- Stay on top of your investments with personalized price movement, earnings, dividends, and splits notifications.- Access real time market data for stocks, options and cryptocurrencies.- Place market, limit, stop loss, stop limit, and good-til-canceled orders.Designed for You- Approachable design, built from the ground up with newcomers and experts in mind.- View beautiful, intuitively designed charts and historical market data for stocks and cryptocurrencies.- Material Design Award WinnerGet More Buying Power With Robinhood Gold- Invest more in the companies you love with up to double the buying power. - Capture investment opportunities right away with larger instant deposits.- Get access to extended market hours as early as 9am EST and as late as 6pm EST.Get Free Stock- Refer a friend and you’ll both get a free stock like Apple, Ford or Sprint. - Earn up to $500 of free stocks that include some of the most popular stocks on the market.Secure & Trusted Platform- We use cutting-edge security measures to protect your assets and your personal information.- Robinhood Financial is also a member of FINRA and SIPC, which protects securities in your account up to $500,000. For details, please see www.sipc.org.  Robinhood Crypto is not a member of FINRA or SIPC and cryptocurrencies are not protected by FDIC or SIPC insurance.What Experts Have to Say“The public markets have long been intertwined with the American Dream and Robinhood offers a new generation the promise of owning a piece of it.” - Fast Company\"As their zero commission business model expands it could disrupt the traditional brokerage industry.\" - Jim Cramer, Mad Money\"It's sleek. It's easy to use. It's designed to give first time, small-scale investors a leg up on Wall Street hotshots.\" - Business Insider\"Stock trading was expensive and ugly. Robinhood makes it free and pretty.\" - Tech CrunchDisclosureRobinhood Financial LLC and Robinhood Crypto, LLC are subsidiaries of Robinhood Markets, Inc. Equities and options are offered to self-directed customers by Robinhood Financial, member of FINRA and SIPC. Cryptocurrency trading is offered through Robinhood Crypto. Cryptocurrencies are not stocks. Any information about Robinhood Crypto on any Robinhood website, platform, emails or other communications, are for informational purposes only and not intended as a solicitation or advertisement for Robinhood Crypto.All investments involve risk and the past performance of a security, other financial product or cryptocurrency does not guarantee future results or returns. While diversification may help spread risk, it does not assure a profit or protect against loss. You can always lose money when you invest in securities, cryptocurrencies, or other financial products. Investors should consider their investment objectives and risks carefully before investing.Margin trading in securities involves interest charges and risks, including the risk of losing more than deposited or the need to deposit additional collateral in a falling market. Before using margin, customers must determine whether this type of trading strategy is right for them given their specific investment objectives, experience, risk tolerance and financial situation.",
    "descriptionHTML": "Invest for Free<br>- Invest in cryptocurrencies, stocks, ETFs and options side by side, all commission-free and easily accessible in one app.  <br>- No account minimum needed to get started. <br>(Please see Robinhood&#x2019;s Fee Schedule to learn more)<br><br>Instant Access<br>-Use funds immediately for stocks and crypto with Robinhood Instant Deposits, instead of waiting the standard 3-day period.<br>-Instantly sell your stocks to buy cryptocurrency or sell your cryptocurrency to buy stocks. <br><br>Investing at Your Fingertips<br>- Sign up in minutes, trade stocks, options, ETFs, and cryptocurrencies in seconds.<br>- Stay on top of your investments with personalized price movement, earnings, dividends, and splits notifications.<br>- Access real time market data for stocks, options and cryptocurrencies.<br>- Place market, limit, stop loss, stop limit, and good-til-canceled orders.<br><br>Designed for You<br>- Approachable design, built from the ground up with newcomers and experts in mind.<br>- View beautiful, intuitively designed charts and historical market data for stocks and cryptocurrencies.<br>- Material Design Award Winner<br><br>Get More Buying Power With Robinhood Gold<br>- Invest more in the companies you love with up to double the buying power. <br>- Capture investment opportunities right away with larger instant deposits.<br>- Get access to extended market hours as early as 9am EST and as late as 6pm EST.<br><br>Get Free Stock<br>- Refer a friend and you&#x2019;ll both get a free stock like Apple, Ford or Sprint. <br>- Earn up to $500 of free stocks that include some of the most popular stocks on the market.<br><br>Secure &amp; Trusted Platform<br>- We use cutting-edge security measures to protect your assets and your personal information.<br>- Robinhood Financial is also a member of FINRA and SIPC, which protects securities in your account up to $500,000. For details, please see www.sipc.org.  Robinhood Crypto is not a member of FINRA or SIPC and cryptocurrencies are not protected by FDIC or SIPC insurance.<br><br>What Experts Have to Say<br>&#x201C;The public markets have long been intertwined with the American Dream and Robinhood offers a new generation the promise of owning a piece of it.&#x201D; - Fast Company<br><br>&quot;As their zero commission business model expands it could disrupt the traditional brokerage industry.&quot; - Jim Cramer, Mad Money<br><br>&quot;It&apos;s sleek. It&apos;s easy to use. It&apos;s designed to give first time, small-scale investors a leg up on Wall Street hotshots.&quot; - Business Insider<br><br>&quot;Stock trading was expensive and ugly. Robinhood makes it free and pretty.&quot; - Tech Crunch<br><br>Disclosure<br>Robinhood Financial LLC and Robinhood Crypto, LLC are subsidiaries of Robinhood Markets, Inc. Equities and options are offered to self-directed customers by Robinhood Financial, member of FINRA and SIPC. Cryptocurrency trading is offered through Robinhood Crypto. Cryptocurrencies are not stocks. Any information about Robinhood Crypto on any Robinhood website, platform, emails or other communications, are for informational purposes only and not intended as a solicitation or advertisement for Robinhood Crypto.<br><br>All investments involve risk and the past performance of a security, other financial product or cryptocurrency does not guarantee future results or returns. While diversification may help spread risk, it does not assure a profit or protect against loss. You can always lose money when you invest in securities, cryptocurrencies, or other financial products. Investors should consider their investment objectives and risks carefully before investing.<br><br>Margin trading in securities involves interest charges and risks, including the risk of losing more than deposited or the need to deposit additional collateral in a falling market. Before using margin, customers must determine whether this type of trading strategy is right for them given their specific investment objectives, experience, risk tolerance and financial situation.",
    "histogram": {
        "1": 1733,
        "2": 490,
        "3": 1045,
        "4": 6772,
        "5": 37854
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/o631hX6sgPcjDGU2xmBClLdTX2Kl189N5Oie_qB2UkanIhTb-AvKiDp0FWWtzdypS9dI=h310",
        "//lh3.googleusercontent.com/ur2ohhwbOp2HW_RAyLxHO8dhlODS8oZQFZ-v9RYNB1PFcY9tLEm6XiLuKpDAsY69nQar=h310",
        "//lh3.googleusercontent.com/pOV7A2HM_W7dA7qlvjxGaUZOlatTrKtXc170s2poIykdPmNhXNGU2uXgGt8eUlHofw=h310",
        "//lh3.googleusercontent.com/-LI9WI1gyeymc_wJ7JmEFnWSHSg2512VyW_Fu2U615er0h9iIloSvJC8mUHsYFOGRXY=h310",
        "//lh3.googleusercontent.com/XMwzKTlsD3LOs-2twF85PKZUSehjysAw5Z8ECNemROkypJsBy4EG7ecJAy5qdOmigQ=h310",
        "//lh3.googleusercontent.com/uKFqNZ23UaMNwlxvCOnIo3GwrL6oa3H4fecjfu7iww8dmB_9Vva_1sWAjtIohtof1vA=h310"
    ],
    "comments": [
        "Great app love how it's free to make trades. I wish they participated in drips, maybe in the future. Any how if you want to get your feet wet in trading stock use this app. Start with 50 bucks and try to maximize your trade for profits. This app makes it easy to sell and buy stocks. Waiting for the free version of the website but until then will use Robinhood for sure.",
        "Some serious issues including  2fa customer support, customer support bots kept asking for same questions and it took 3 weeks to reset 2fa. Plus funds were withdrawn for the account and showing up in history but are not available. It's been 3 days and support has not come back. Very disappointing.",
        "Not a bad app but I would like like to see more with the interface. Maybe being able to look at a bunch of different stocks that you aren't following instead of having to use a third party to find stocks. Also, the notifications are pretty annoying. I don't need a notification every time a stock moves.",
        "The UI is amazing, smooth, and looks great. I use it frequently to check various stocks. The flipside to the streamlined look is less information - I find myself switching to other accounts on other apps to get more information. Also, free trades are definitely a bonus.  It would be amazing to be able to categorize things in the watchlist. Stay strong on the streamlined UI approach, but also find a way to get some detailed information in there.",
        "Can't approve my application and blames it on their clearing partner. Says it is a purely technological issue and claims there is no foreseeable solution. Glad they told me that AFTER I referred the app to five people. I'm owed 6 free stocks. Literally took money out of my pocket.",
        "So far I think this app is awesome. I bought my first stocks and have used the app to watch my tiny first investments rise, plummet and rise again. Will I get super rich? Well I hope so but either way, I think this app might help."
    ],
    "recentChanges": [
        "Don’t sleep. Introducing Robinhood Crypto.",
        "Invest in Bitcoin & other cryptocurrencies, 24/7 & commission-free.",
        "Get on the list by visiting crypto.robinhood.com",
        "Once you sign up for early access, you can move up the list by inviting a friend to open a Robinhood Financial account. You’ll both also get a free stock like Apple, Ford or Sprint."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.robinhood.android&hl=en&gl=us",
    "appId": "com.robinhood.android"
}