{
    "title": "Shazam Encore",
    "summary": "Shazam Encore - the best of Shazam without the ads!",
    "icon": "//lh3.googleusercontent.com/or1134wYt5K2119mGRBDnslIoca9pIeGASGiksqUvx4oaC8lNgSUC9aOl78Y-FP2LRM=w300",
    "price": "$2.99",
    "free": false,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.4,
    "reviews": 36987,
    "developer": "Shazam Entertainment Limited",
    "developerId": "Shazam+Entertainment+Limited",
    "developerEmail": "android.support@shazamteam.com",
    "developerWebsite": "http://www.shazam.com",
    "developerAddress": "Shazam Entertainment Limited\n26-28 Hammersmith Grove\nLondon W6 7HA",
    "updated": "February 13, 2018",
    "version": "Varies with device",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "size": "Varies with device",
    "description": "Shazam is one of the world’s most popular apps, used by hundreds of millions of people each month to instantly identify music that’s playing and see what others are discovering. All for free.And that’s just the beginning: One-tap access to video clips, song lyrics, related tracks and streaming services, where you can listen to your Shazams in full or buy them. Top artists like Adele, Kendrick Lamar, Demi Lovato, are using Shazam to find new music, and you can follow them to share in the thrill of discovery. MUSIC DISCOVERY• Identify music with one tap• Turn on Auto Shazam to automatically identify music that’s playing• Simply log in to sync all your Shazams across all devices• Shazam Offline: Identify music even when you’re not connected!*• Sing along to songs with real-time music lyrics, or watch their YouTube videos• Follow your favorite artists to see what they’re Shazaming• Preview songs and add them to Spotify playlists**• Launch Pandora radio based on artists you Shazam**IN-APP FEATURES• Buy your Shazamed songs in Google Play Music with just one tap• Stay in the loop with Shazam’s real-time charts• Check out recommended tracks to find new music• Find out what’s popular locally and around the world in the Explore tap• Quick links to Google Play and Amazon storesCONNECT & SHARE • See what your friends are Shazaming when you connect your Facebook account• Share your discoveries through Facebook, Twitter, WhatsApp, Pinterest, Google+ and more…MORE THAN MEETS THE EAR• Shazam visual recognition: Tap the camera icon to Shazam posters, magazines, books and so much more! Use it anywhere where you see the Shazam camera logo• Visual recognition also works as a QR code reader• Launch Shazam on your Android Wear smartwatch to see the artist and song appearOTHER INFO• Previewing and buying music requires the Google Play music store in your country• MIPS devices are not supported• Why does Shazam need these app permissions? https://support.shazam.com/hc/en-us/articles/205139787-App-Permissions• Don’t want the advertising? Upgrade to Shazam Encore: https://play.google.com/store/apps/details?id=com.shazam.encore.android *Song names will appear in your My Shazam tab once connection is restored**Some features are dependent on location, device and app versionAny questions or feedback? Check out: https://support.shazam.com/hc/en-us/categories/200239877-Android",
    "descriptionHTML": "Shazam is one of the world&#x2019;s most popular apps, used by hundreds of millions of people each month to instantly identify music that&#x2019;s playing and see what others are discovering. All for free.<br><br>And that&#x2019;s just the beginning: One-tap access to video clips, song lyrics, related tracks and streaming services, where you can listen to your Shazams in full or buy them. <br><br>Top artists like Adele, Kendrick Lamar, Demi Lovato, are using Shazam to find new music, and you can follow them to share in the thrill of discovery. <br><br>MUSIC DISCOVERY<br><br>&#x2022; Identify music with one tap<br>&#x2022; Turn on Auto Shazam to automatically identify music that&#x2019;s playing<br>&#x2022; Simply log in to sync all your Shazams across all devices<br>&#x2022; Shazam Offline: Identify music even when you&#x2019;re not connected!*<br>&#x2022; Sing along to songs with real-time music lyrics, or watch their YouTube videos<br>&#x2022; Follow your favorite artists to see what they&#x2019;re Shazaming<br>&#x2022; Preview songs and add them to Spotify playlists**<br>&#x2022; Launch Pandora radio based on artists you Shazam**<br><br>IN-APP FEATURES<br><br>&#x2022; Buy your Shazamed songs in Google Play Music with just one tap<br>&#x2022; Stay in the loop with Shazam&#x2019;s real-time charts<br>&#x2022; Check out recommended tracks to find new music<br>&#x2022; Find out what&#x2019;s popular locally and around the world in the Explore tap<br>&#x2022; Quick links to Google Play and Amazon stores<br><br>CONNECT &amp; SHARE <br><br>&#x2022; See what your friends are Shazaming when you connect your Facebook account<br>&#x2022; Share your discoveries through Facebook, Twitter, WhatsApp, Pinterest, Google+ and more&#x2026;<br><br>MORE THAN MEETS THE EAR<br><br>&#x2022; Shazam visual recognition: Tap the camera icon to Shazam posters, magazines, books and so much more! Use it anywhere where you see the Shazam camera logo<br>&#x2022; Visual recognition also works as a QR code reader<br>&#x2022; Launch Shazam on your Android Wear smartwatch to see the artist and song appear<br><br>OTHER INFO<br><br>&#x2022; Previewing and buying music requires the Google Play music store in your country<br>&#x2022; MIPS devices are not supported<br>&#x2022; Why does Shazam need these app permissions? https://support.shazam.com/hc/en-us/articles/205139787-App-Permissions<br>&#x2022; Don&#x2019;t want the advertising? Upgrade to Shazam Encore: https://play.google.com/store/apps/details?id=com.shazam.encore.android <br><br>*Song names will appear in your My Shazam tab once connection is restored<br>**Some features are dependent on location, device and app version<br><br>Any questions or feedback? Check out: https://support.shazam.com/hc/en-us/categories/200239877-Android",
    "histogram": {
        "1": 2745,
        "2": 1010,
        "3": 1855,
        "4": 5869,
        "5": 25508
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/Qru7tbUF-b_OpIRnnRYlHqE3lpRwE5-pwnVZPDtzol0kpz3PU2vpRWZd0kex9VA5bA=h310",
        "//lh3.googleusercontent.com/lNrqQvFLG47mC14hjleGHnl1loWPbsY-55ufXLJH6PIlReE9AA_OMf4FTbNh3Joh_tw=h310",
        "//lh3.googleusercontent.com/4R7u4MqOCwQuP9i-S_VjljQPcGNtr4uZyy9xMflKQz6Va2I_0qhy3xMwlYe6s39btg=h310",
        "//lh3.googleusercontent.com/7fSXNsPUmOGxiaXTx3hEd2EeOuCbvdeXj6NIN1tRB7no8T57-jTvQscSsk-LIH-2BaEU=h310",
        "//lh3.googleusercontent.com/4oNHJ4uOQ11fP-m-YXMGfg3rse4aARYuHzQtZ8HjcCmfDAvRyYuxUqYLca4pQEr3Xw=h310",
        "//lh3.googleusercontent.com/ZWgvb-KSGg4VCYi8KLYXTvrBIKSUZ9d27mztAhr5lTEWvcVfSKqS9szfsIAHT4lT5aU=h310",
        "//lh3.googleusercontent.com/nwQZ3zJtbPiYkOl6nRoQwZEdyu_3hfBBQMsRQfrAi8Sppcka8jYWohfomiC4RhCWNAw=h310",
        "//lh3.googleusercontent.com/5m03A0YURZzmt7jGlQb2bRarEar8k85XUWPpedbNMzBshesithfIJFLc7mtA2MkFANU=h310",
        "//lh3.googleusercontent.com/gsj8b8DrUCZlJuhfl31y_rltfYuA0Xak26qtI7eweioxjCeXRo4Fyb9aA543nqXCZY21=h310",
        "//lh3.googleusercontent.com/kORiE41N1tT4w7cFWNlZO_v-WLIQ3ZJGQ17yWczHQ8HNJnDbEIgJovNz1EotsVMlNarT=h310"
    ],
    "comments": [
        "[Edit: They apparently did a soft update without actually updating the app itself, which enables opening a song on Google Play Music. I changed my rating from a 1 star to a 5 star based on this alone.] I hate the new interface. It highly prioritizes people use use Spotify. I use Google Play music. If I wanted to add an identified song on Google Play Music, I'd need to back out and go to my song history on Shazam and then add the song to Google Play Music from there. Needless to say, I will be looking for a different music identification app now.",
        "If you have a older version which works for you DONT UPDATE the new layout is completely illogical and offers no valid reason to update.   Once you are finished looking for your music, which all get deleted eventually, why hide the delete into a 2 click menu instead of a 1 click icon on the same page? The GUI is now flawed, please fix. This is unable to identify music which has been around for 50 yrs, eg Jimmy Rodgers - Today, SoundHound was able to essily identify it so you really need both apps. Update Feb 18. Now the delete is renamed and moved again, as if to make deleting your Shazams even more painful. Just bring back the delete icon ffs?!?!",
        "Another UPDATE Feb 2018.  * This app has become a bad joke now.  Asking a dead slug would yield better results.  Jan 2018: *** I've been using this for years.  Nice and quick but struggles with rarer house and techno records.  It's still a solid app and I like the auto-Shazam feature that'll automatically tag the songs from your evening.  :)    UPDATE Dec 2017 It's appallingly bad at identifying remixes.  There should be an option to tell the app it's tagged the wrong song and to try a longer snippet.  With all music now being digital with its own unique signature there's simply no excuse for Shazam to be this bad at remixes.  I'm still glad to have it but it's nearly useless at catching things I listen to a lot of the time.",
        "Love the new updated interface with the ability to swipe to see top songs, video and a related play list! Awesome. Need to have a paid version where we can listen to the while song under related playlists!",
        "I no longer can buy my identified song on Amazon or Google Play store through the app making it almost worthless .... Searching for another music ID app ....",
        "This latest update (Feb '18) really sets it apart providing real time lyrics and all of the track info. and videos. I use it directly with Spotify so it is really easy to create a Shazam playlist. As usual it identifies v quickly."
    ],
    "recentChanges": [
        "Your Shazams have a new look!",
        "Once you’ve named that tune, you’ll see a brand new song page with...",
        "- No more clutter! Just a big, beautiful photo of the artist you’ve Shazamed. Looking for the artwork? Tap the artist’s pic for more info about the song.",
        "- A new menu, meaning you can get to the lyrics, videos & artist updates in one tap.",
        "- Quick links to play, buy or open-in your favourite streaming service."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.shazam.encore.android&hl=en&gl=us",
    "appId": "com.shazam.encore.android"
}