{
    "title": "Netflix",
    "summary": "Netflix is the leading subscription service for watching TV episodes and movies.",
    "icon": "//lh3.googleusercontent.com/jcbqFma-5e91cY9MlEasA-fvCRJK493MxphrqbBd8oS74FtYg00IXeOAn0ahsLprxIA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.4,
    "reviews": 4963158,
    "developer": "Netflix, Inc.",
    "developerId": "Netflix,+Inc.",
    "developerEmail": "playstore@netflix.com",
    "developerWebsite": "http://www.netflix.com",
    "developerAddress": "100 Winchester Circle\nLos Gatos, CA 95032-1815\nUSA",
    "updated": "March 2, 2018",
    "version": "Varies with device",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "size": "Varies with device",
    "description": "Netflix is the world’s leading subscription service for watching TV episodes and movies on your phone. This Netflix mobile application delivers the best experience anywhere, anytime. Get the free app as a part of your Netflix membership and you can instantly watch thousands of TV episodes & movies on your phone.   If you are not a Netflix member sign up for Netflix and start enjoying immediately on your phone with our one-month free trial. How does Netflix work?• Netflix membership gives you access to unlimited TV shows and movies for one low monthly price.  • With the Netflix app you can instantly watch as many TV episodes & movies as you want, as often as you want, anytime you want.• You can Browse a growing selection of thousands of titles, and new episodes that are added regularly. • Search for titles and watch immediately on your phone or on an ever expanding list of supported devices.• Rate your favorite shows and movies and tell us what you like so Netflix can help suggest the best titles for you.• Start watching on one device, and resume watching on another. Check out netflix.com for all the TVs, game consoles, tablets, phones, Blu-ray players and set top boxes on which you can watch Netflix.By clicking INSTALL, you consent to the installation of the Netflix application and any updates or upgrades thereto.───────────────────────────────── License Agreement By downloading this application you agree to the Netflix Terms of Use and Privacy Statement, located at http://www.netflix.com 1-month free Netflix membership offer is available to first time and certain former members and cannot be combined with any other offer. Internet access and valid payment method are required to redeem offer.  Netflix will begin to bill your payment method for the Netflix membership fee at the end of the free month unless you cancel prior to the end of the first month. Your Netflix membership is a month-to-month subscription that you can cancel at any time. Go to \"Your Account\" on the Netflix website for cancellation instructions. No refund or credit for partial monthly subscription periods. A device that streams from Netflix (manufactured and sold separately) and broadband Internet connection are required to watch instantly.For complete terms and conditions, please visit http://www.netflix.com/termsofuseFor privacy statement, please visit http://www.netflix.com/privacy",
    "descriptionHTML": "Netflix is the world&#x2019;s leading subscription service for watching TV episodes and movies on your phone. This Netflix mobile application delivers the best experience anywhere, anytime.<br> <br>Get the free app as a part of your Netflix membership and you can instantly watch thousands of TV episodes &amp; movies on your phone.  <br> <br>If you are not a Netflix member sign up for Netflix and start enjoying immediately on your phone with our one-month free trial.<br> <br>How does Netflix work?<br>&#x2022; Netflix membership gives you access to unlimited TV shows and movies for one low monthly price.  <br>&#x2022; With the Netflix app you can instantly watch as many TV episodes &amp; movies as you want, as often as you want, anytime you want.<br>&#x2022; You can Browse a growing selection of thousands of titles, and new episodes that are added regularly. <br>&#x2022; Search for titles and watch immediately on your phone or on an ever expanding list of supported devices.<br>&#x2022; Rate your favorite shows and movies and tell us what you like so Netflix can help suggest the best titles for you.<br>&#x2022; Start watching on one device, and resume watching on another. Check out netflix.com for all the TVs, game consoles, tablets, phones, Blu-ray players and set top boxes on which you can watch Netflix.<br><br>By clicking INSTALL, you consent to the installation of the Netflix application and any updates or upgrades thereto.<br><br>&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;<br><br>&#xA0;<br>License Agreement<br>&#xA0;<br>By downloading this application you agree to the Netflix <a href=\"https://www.google.com/url?q=http://www.google.com/url?q%3Dhttp%253A%252F%252Fwww.netflix.com%252Ftermsofuse%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNEy_dzfikLlvCKDdDlfFqQwBoSCCg&amp;sa=D&amp;usg=AFQjCNFq3_HFT2gtUMQX63ZDZ4tUnQ7gmw\" target=\"_blank\">Terms of Use</a> and <a href=\"https://www.google.com/url?q=http://www.google.com/url?q%3Dhttp%253A%252F%252Fwww.netflix.com%252Fprivacy%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNHvMVqH2AQZ95KFg9OBw8gQlTacaA&amp;sa=D&amp;usg=AFQjCNEolPnKDQFahUdNmOloA4vWyMnG_g\" target=\"_blank\">Privacy Statement</a>, located at&#xA0;http://www.netflix.com<br>&#xA0;<br>1-month free Netflix membership offer is available to first time and certain former members and cannot be combined with any other offer. Internet access and valid payment method are required to redeem offer.&#xA0; <b>Netflix will begin to bill your payment method for the Netflix membership fee at the end of the free month unless you cancel prior to the end of the first month</b>. Your Netflix membership is a month-to-month subscription that you can cancel at any time. Go to &quot;Your Account&quot; on the Netflix website for cancellation instructions. No refund or credit for partial monthly subscription periods. A device that streams from Netflix (manufactured and sold separately) and broadband Internet connection are required to watch instantly.<br><br>For complete terms and conditions, please visit http://www.netflix.com/termsofuse<br>For privacy statement, please visit http://www.netflix.com/privacy",
    "histogram": {
        "1": 314991,
        "2": 117791,
        "3": 246724,
        "4": 640278,
        "5": 3643374
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/qJEqftz-pCdJMEaJ95ezNN-NAx9tEbsM3xaklyTMr8MkVqYCQD_Ps6Van8AHraRWCdM=h310",
        "//lh3.googleusercontent.com/j9gGmDi4KCKl67W7xZqTVZOsEOg2JU0dCpZ6AhsIIQLvqsPRqUxpKMJPnl1a29pNUw=h310",
        "//lh3.googleusercontent.com/_ydtxHp3aSP0nQ25W5BWtGMxyaIX30V1f4sSETYPzm20EXIF4OaNcTiIjycO3h5lxA=h310",
        "//lh3.googleusercontent.com/38_8yP5MiIipxyKoSXm0IwGeAlGgx0biZSgiaUavA30TIkqEcPEoY5U5LSMCJ87E0Q=h310",
        "//lh3.googleusercontent.com/FlqCWUUltAeyrwJRoLXYrWXbC_TlcTpfjepPlb3p4ol0hyB3iZyO4-w_F5oGoqlMom0=h310",
        "//lh3.googleusercontent.com/Uz9SMjjraP_DyGIUkHMMDVgXqY8WyVNYhyt0mu5WaatZ8yen1n3z7RxUIBEOde67mhI=h310",
        "//lh3.googleusercontent.com/3q3jMwlp3SWC_OXeRqmmO3THI1qLYmx2qP4kKKHDedNtBb0G0FcUnIRkdhMdzn5v35Ly=h310",
        "//lh3.googleusercontent.com/QSr4LrblZ0rGr_7nh_VSP9Nc_Mb_aLxAkJ_ZvwgnGs6j9Q7rsWWNnBaCeZb3TzSlupk=h310",
        "//lh3.googleusercontent.com/OpdJL984b_EV26RoDiNPy2ZreDwXvL9j8C_eUVbNBiqTX1BbP1yCUiCsCKObyRYW-bc=h310",
        "//lh3.googleusercontent.com/x_b7lBM9RD8pkDMx62677Z2fg2UQj6Mpg0Qxx65wPqKAEMdLZEO_cWZHFWwA51vRgA=h310",
        "//lh3.googleusercontent.com/ObWP0ww5Fe6qRaHOIYENWgWvwcBkvenxdErDeoRpGrg4MKvHKIv0A8I_8RwbSNFxIiM=h310",
        "//lh3.googleusercontent.com/b6EfyKTm-jFrxB3nGzYqPuZx8Y_MXSVvWhFY1WzuP5ln-FvGJvcrRTrIjyMD2eyS3g=h310",
        "//lh3.googleusercontent.com/-eqUow054ZS2LoADaMghq5h5Cv-oJhFbnC_RoaPioEqiIf15h5mCo5rwdyscxiTd9AU=h310",
        "//lh3.googleusercontent.com/tz38PpsFinJYc0y4zHFuu17cQ4vXxXl1lxv6YPF6J09T2ImDFQe5VRAxW_g9v1Q5y4s=h310",
        "//lh3.googleusercontent.com/nDD_OXWf_IlNIxva51962wlzQxmN57Q63sSTxe-F4AVXsbz7sf1R1O9CXj4klGMpPrM=h310"
    ],
    "comments": [
        "Previous versions were great. Bring back the fast forward / rewind 10s buttons and I will increase my rating... so annoying to use without these buttons.  Further suggestions: 1) Provide option to remove a program from the continue watching list. 2) Improve the suggestion system based off of previous reviews. This doesn't seem to work well at present. 3) Make programs more easily findable. Takes forever to find something to watch. Some good movies / series are on here but usually hard to find them.",
        "I really like the app and Netflix in general. But I can't give it a higher score until they accept their app has a problem and fix it. Right now it's completely draining my battery in a few hours, rendering my phone unusable. Support just cleaned their hands of this problem even though there are several identical reports!",
        "Very easy to use, great contents and more than what you expect. But I have one problem. Although my phone is supported HD graphics to use, I can't watch HD (btw my phone is Samsung Galaxy J7 Prime). Also, I'm using 4K Ultra HD package. I don't why but I hope you update this problem as soon as possible.",
        "New update is horrible. Without the 10s forward/rewind feature it's super annoying to skip scenes/intros. And without the \"next episode\" button, i have to scroll through the long list of episodes to watch the new one. Don't know why it was removed shortly after it was implemented... Moreover the home buttons are stuck and won't go away. It's uncomfortable to immerse ourselves in what we're watching when there's a centimeter of buttons blocking a part of the screen.",
        "It didn't even give a notification before free trail ends. And automatically 800 RS got debited without my permission and without any prior notification. How can they access my bank account!!! Too ridiculous 😏😏",
        "It was working great until recently on my chromebook. I'm unable to pause the show I'm watching and teh back arrow is unresponsive. The only way to exit the play screen is hitting the escape button. I even uninstalled and reinstalled the app just in case to see if that would fix it, but nothing has changed."
    ],
    "recentChanges": [
        "- Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.netflix.mediaclient&hl=en&gl=us",
    "appId": "com.netflix.mediaclient"
}