{
    "title": "InstaB for Baby, Mom Favourite",
    "summary": "Social Network for new Parents.",
    "icon": "//lh3.ggpht.com/wF7t76cii0uiHjLpramTQ_CbT8nVh_b2lqcjOvIiQucwOVhTUi6CXwGrepWHc5-xXA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.8,
    "reviews": 481,
    "developer": "StrongByte Studio",
    "developerId": "7352403974411024983",
    "developerEmail": "instab@iconmobi.my",
    "developerWebsite": "http://www.instabapp.com",
    "developerAddress": "StrongByte Studio Sdn Bhd\nD-3-56, IOI Boulevard, Jalan Kenari 5, Bandar Puchong Jaya,\n47170 Selangor, Malaysia",
    "updated": "March 1, 2016",
    "version": "2.2.3",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "\"One-click solution for parents to customise their baby photos\" - Digital News Asia \"It helps parents make the ultimate child photo album\"- Tech In Asia\"Great overlaying app for Instagram\" - BabyTalk Magazine \"Get queries about your little one answered by other parents on InstaB\"- e27\"InstaB adds excitement to baby photos\" - AppPicker \"Share your baby's picture, growth and mood all in a single image\" - Lowyat.Net \"The app for the baby paparazzi\" - NewStraitsTimes Paper \"Instagram untuk bayi / Instagram for baby\" - Amanz.my \"Sharing of baby photos made easy\" -TheStar Paper “InstaB for Baby”- As seen on Gadget Nation, Astro.InstaB is the perfect baby app for parents to personalize their baby photos with extra information such as age, gender, zodiac, photo taken date, current date, custom baby mood and specially crafted stickers for baby.Now you can share your baby photos every day with customized skin overlays to highlight special moments, memorable occasions and epochal milestones in your baby’s life. Users can also decorate and spice up their baby photos with our specially designed stickers. There are more than 10 sticker categories currently which include baby toys, party pack, stylish glasses, oriental, achievement badges, cute animal mask and more. In this version 2.0.0, we introduced a new feature called “Baby Q&A” for parents to ask question or seek opinion from other parents. Parents can include a photo in their question, following a question, provide answer or having discussion answers.These personalized baby photos can be easily shared with their friends on InstaB as well as other social platform such as Facebook, Instagram and etc.With InstaB For Baby, your baby photos will never be the same as you can easily chart your baby growth, insert his/her mood then, and record everyday moments. All you have to do is to choose your favourite baby pictures from your phone gallery or take a picture using your camera phone’s direct capture, and InstaB will do the rest for you by personalizing your baby photos accordingly.Key features of InstaB:- 100+ custom minimalist overlay skins.- Auto caption on age, gender, zodiac and moments date.- Custom daily mood of your baby- Specially crafted stickers for your baby.- Mini achievement badges for your baby.- Thoughtful design of your baby timeline.- Easy sharing on InstaB where you can choose to share with your friends and family only.- Engage with other parents with the same baby age or zodiac with like or comments.- Baby Q&A where parents can share tips or ask for help from other parents.@ More than 100,000 awesome baby photos/videos generated to date! #Support# If you have any questions or problem, please kindly send us an email at instab@iconmobi.my. Note that if you leave a support question in the comments we won't be able to write you back, so just send us an email instead. Thanks #Special Thanks# Thanks to Taylor Ling , top notch UI/UX designer for Android app ( http://androiduiux.com/ ) for designing our new lovely app icon.Copyright 2014 STRONGBYTE STUDIO",
    "descriptionHTML": "&quot;One-click solution for parents to customise their baby photos&quot; <br>- Digital News Asia <br><br>&quot;It helps parents make the ultimate child photo album&quot;<br>- Tech In Asia<br><br>&quot;Great overlaying app for Instagram&quot; <br>- BabyTalk Magazine <br><br>&quot;Get queries about your little one answered by other parents on InstaB&quot;<br>- e27<br><br>&quot;InstaB adds excitement to baby photos&quot; <br>- AppPicker <br><br>&quot;Share your baby&apos;s picture, growth and mood all in a single image&quot; <br>- Lowyat.Net <br><br>&quot;The app for the baby paparazzi&quot; <br>- NewStraitsTimes Paper <br><br>&quot;Instagram untuk bayi / Instagram for baby&quot; <br>- Amanz.my <br><br>&quot;Sharing of baby photos made easy&quot; <br>-TheStar Paper <br><br>&#x201C;InstaB for Baby&#x201D;<br>- As seen on Gadget Nation, Astro.<br><br>InstaB is the perfect baby app for parents to personalize their baby photos with extra information such as age, gender, zodiac, photo taken date, current date, custom baby mood and specially crafted stickers for baby.<br><br>Now you can share your baby photos every day with customized skin overlays to highlight special moments, memorable occasions and epochal milestones in your baby&#x2019;s life. Users can also decorate and spice up their baby photos with our specially designed stickers. There are more than 10 sticker categories currently which include baby toys, party pack, stylish glasses, oriental, achievement badges, cute animal mask and more. <br><br>In this version 2.0.0, we introduced a new feature called &#x201C;Baby Q&amp;A&#x201D; for parents to ask question or seek opinion from other parents. Parents can include a photo in their question, following a question, provide answer or having discussion answers.<br><br>These personalized baby photos can be easily shared with their friends on InstaB as well as other social platform such as Facebook, Instagram and etc.<br><br>With InstaB For Baby, your baby photos will never be the same as you can easily chart your baby growth, insert his/her mood then, and record everyday moments. All you have to do is to choose your favourite baby pictures from your phone gallery or take a picture using your camera phone&#x2019;s direct capture, and InstaB will do the rest for you by personalizing your baby photos accordingly.<br><br>Key features of InstaB:<br>- 100+ custom minimalist overlay skins.<br>- Auto caption on age, gender, zodiac and moments date.<br>- Custom daily mood of your baby<br>- Specially crafted stickers for your baby.<br>- Mini achievement badges for your baby.<br>- Thoughtful design of your baby timeline.<br>- Easy sharing on InstaB where you can choose to share with your friends and family only.<br>- Engage with other parents with the same baby age or zodiac with like or comments.<br>- Baby Q&amp;A where parents can share tips or ask for help from other parents.<br><br>@ More than 100,000 awesome baby photos/videos generated to date! <br><br>#Support# <br>If you have any questions or problem, please kindly send us an email at instab@iconmobi.my. Note that if you leave a support question in the comments we won&apos;t be able to write you back, so just send us an email instead. Thanks <br><br>#Special Thanks# <br>Thanks to Taylor Ling , top notch UI/UX designer for Android app ( http://androiduiux.com/ ) for designing our new lovely app icon.<br><br>Copyright 2014 STRONGBYTE STUDIO",
    "histogram": {
        "1": 73,
        "2": 25,
        "3": 63,
        "4": 102,
        "5": 218
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/1XTLGY-8_-W74XDr_VJ480at08bmba8PhIE9mR0KwA98pKtQLmNEy7c0ktkFyAifkOXL=h310",
        "//lh5.ggpht.com/M05firqXY0lthUO-0_3Q0wKOeyjy7GWu8eh5Pdn51GDtjPGWb1-eGxzhgZU1svB4UrNF=h310",
        "//lh4.ggpht.com/FS1LG4l1PKzH8f7RgafQ38LCBkoy_47YBpVmTHSWXxNx2Ox8I45e8UF-B7xNQ3F4mS0N=h310",
        "//lh3.ggpht.com/K2QkX3uDD2N6nqxaExLpEcaJxozeya1B2x084Hgee9rBVTcfrDTl4o0DnMr_6EMe8fQ=h310",
        "//lh5.ggpht.com/jm3wWww5zBDyw4Cx74pWDDhbhLVi-2oUc9CQQzDwC1kwDwBB43MW6-1CIYWsNz5gNVI=h310",
        "//lh4.ggpht.com/znSHdLKyKHQ0cMsvYpHzjEtldwfuzyxTlGV9f7G5QFuPuJb9Cm7s9mDT4wUGgy58UZw=h310",
        "//lh5.ggpht.com/bppfSRzYgQTrHblOtjpUJ_Q9CWuSoCd4kBSX7Iw4oOmf43sWdKP-2K0dOYxco6n-fHE=h310",
        "//lh6.ggpht.com/Wb_ws33LUvLrq9AhocqTn97qT-jbB6hAHTD9FPguevQQ9kP5xdLPmdJPihht8Fq3AnQ=h310"
    ],
    "comments": [
        "I downloaded this, it wasn't quite what I was expecting/wanted and now want my info/photos/email deleted. I've tried contacting thru the app and thru the developer email but no one has contacted back. I also think, since I signed up, that my email has been sold, as I'm suddenly getting spam emails that are not nice in nature. Please contact me to resolve. Thanks.",
        "So bad, the picture won't out. This app really really bad.. So sory to instal in my phone",
        "Can't use. It keep popping out, unfortunately instaB had stopped.",
        "Not working? It's use to work well but for the past few months it's been stop working!?  Tell me why",
        "Cute How to rotate the picture?",
        "Couldn't upload the photos I can't seem to upload the pictures from the gallery files. It always states that \"google+ has stopped working.\" Hope that you guys will fix this issue, since iPhone seems to get the good and updated stuff."
    ],
    "recentChanges": [
        "Update in Version 2.2.3",
        "★ Update for SSL Error Handling",
        "Update in Version 2.2.2",
        "★ Fix import photo failed on some devices.",
        "Update in Version 2.1.5",
        "★ Introduce Pre-Loved Item section, check it out!",
        "★ As requested, now you can send personal message to your friends on InstaB",
        "Update in Version 2.1.2",
        "★ Support notificaiton on Android Wear.",
        "★ New companion app to view latest feed and promotion on your LG G Watch and Samsung Gear Live."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.iconmobi.instab&hl=en&gl=us",
    "appId": "com.iconmobi.instab"
}