{
    "title": "RTA Dubai Drive",
    "summary": "Roads and Transport Authority&#39;s official app for Drivers and Vehicles",
    "icon": "//lh3.googleusercontent.com/_NNJjL4bLa8LNd-h-jM4hgmCR4J2S7akCjOFba5YxbtY7V1sxoF6eJaDgoL40uWD_Xk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 909,
    "developer": "Roads and Transport Authority",
    "developerId": "Roads+and+Transport+Authority",
    "developerEmail": "ask@rta.ae",
    "developerWebsite": "http://www.rta.ae",
    "updated": "March 1, 2018",
    "version": "5.2.2",
    "genre": "Auto & Vehicles",
    "genreId": "AUTO_AND_VEHICLES",
    "description": "The RTA Dubai Drive application is designed by the public, for the public, to help meet your needs and desires. We're always listening to your feedback and working hard to improve all aspects of the application.Our commitment to you is: to make ‘Dubai Drive’ the best companion for all road users ensuring Safe and Smooth Transport for all.We would like thank our users, tester and all of you, who have given up valuable time and efforts to help us create the new app. App Features:•\tOne-time registration on any app or through the RTA web portal and access RTA apps with the same credentials•\tLogin to the app using DubaiID (single sign on for all government entities in Dubai)•\tCapability to personalise the app, add your picture and organize the app to your needs showcasing the service that you use the most•\tUse secure government payment gateway (DubaiPay and ePay) to pay for all RTA services online and through the app•\t “My Docs” providing a digital version of your valid driver’s license, vehicle registration cards & purchased special car  plate number certificates, you can use this as an official document with other entities such as Dubai Police•\tLive chat allows you to contact the RTA customer service agents instantly •\tView recent transactional activity such as any payment, parking tickets and Salik recharges•\tGreen Points – offers the ability to earn green points with every mobile transaction you perform via the app, points make prizes!•\tInquire and pay for all your fines (Traffic, Parking & Salik) in one app•\tFind the latest fuel pump prices per liter at your finger tips•\tPurchase a Dubai plate number for your vehicle•\tApply for a lost or damaged driver’s license replacement•\tRenew your vehicle registration through the app•\tApply for a multitude of certificates such as Vehicle Ownership Certificate•\tSave time & money by using the the app for your Driver’s vehicle license renewal•\tApply for a distinguished number plate or for the replacement of a lost or damaged distinguished plates•\tLocate the closest RTA center using GPS functionality, where you can use the maps to navigate or call a center or RTA partners for vehicle testing•\tSend us feedback at any time with anything you desire, we are here to listen and learn",
    "descriptionHTML": "The RTA Dubai Drive application is designed by the public, for the public, to help meet your needs and desires. We&apos;re always listening to your feedback and working hard to improve all aspects of the application.<br><br>Our commitment to you is: to make &#x2018;Dubai Drive&#x2019; the best companion for all road users ensuring Safe and Smooth Transport for all.<br><br>We would like thank our users, tester and all of you, who have given up valuable time and efforts to help us create the new app. <br><br>App Features:<br>&#x2022;\tOne-time registration on any app or through the RTA web portal and access RTA apps with the same credentials<br>&#x2022;\tLogin to the app using DubaiID (single sign on for all government entities in Dubai)<br>&#x2022;\tCapability to personalise the app, add your picture and organize the app to your needs showcasing the service that you use the most<br>&#x2022;\tUse secure government payment gateway (DubaiPay and ePay) to pay for all RTA services online and through the app<br>&#x2022;\t &#x201C;My Docs&#x201D; providing a digital version of your valid driver&#x2019;s license, vehicle registration cards &amp; purchased special car  plate number certificates, you can use this as an official document with other entities such as Dubai Police<br>&#x2022;\tLive chat allows you to contact the RTA customer service agents instantly <br>&#x2022;\tView recent transactional activity such as any payment, parking tickets and Salik recharges<br>&#x2022;\tGreen Points &#x2013; offers the ability to earn green points with every mobile transaction you perform via the app, points make prizes!<br>&#x2022;\tInquire and pay for all your fines (Traffic, Parking &amp; Salik) in one app<br>&#x2022;\tFind the latest fuel pump prices per liter at your finger tips<br>&#x2022;\tPurchase a Dubai plate number for your vehicle<br>&#x2022;\tApply for a lost or damaged driver&#x2019;s license replacement<br>&#x2022;\tRenew your vehicle registration through the app<br>&#x2022;\tApply for a multitude of certificates such as Vehicle Ownership Certificate<br>&#x2022;\tSave time &amp; money by using the the app for your Driver&#x2019;s vehicle license renewal<br>&#x2022;\tApply for a distinguished number plate or for the replacement of a lost or damaged distinguished plates<br>&#x2022;\tLocate the closest RTA center using GPS functionality, where you can use the maps to navigate or call a center or RTA partners for vehicle testing<br>&#x2022;\tSend us feedback at any time with anything you desire, we are here to listen and learn",
    "histogram": {
        "1": 148,
        "2": 48,
        "3": 71,
        "4": 111,
        "5": 531
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/YPcpxcv_CYaXiyWWa796Al8y-_QUjjFltnaT6mPBp9REmFUK_SU5aGuLN5S2LOjgKSc=h310",
        "//lh3.googleusercontent.com/ii3niMtMyCaIucAt__SXossZ65lzfEEFzHkvzRNxSoDSe5s5WCO99rpsj4WjfhuI8HI=h310",
        "//lh3.googleusercontent.com/JYB6pZjk1pYa6WMcTaO5ZSHlpI09cFAr32AHyjsR93dZ5CXBNsan2-qHCGzzyzejYYw=h310"
    ],
    "video": "https://www.youtube.com/embed/Noch3w9BCp0",
    "comments": [
        "Not connecting to server. Waste of time.",
        "Would have given it 5 stars but for the amount of time it takes to open up and load. Really really slow and not sure if its because of the size of the app or due to the number of services it has to refer to.   Needs to be much much faster..",
        "It takes a long time to load each modules especially the parking. Nearby zones are not completely showing even though the location services are on. The click n park is not really doing its job as the name implies. Please improve the overall performance of the app.",
        "Very bad. I'd take a fine before managing to log it.. it takes forever then it shows an error. The older versions were better",
        "I cannot log in there is a server problem every 24 hours",
        "Verey use full"
    ],
    "recentChanges": [
        "Bug fixes and improvements!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.rta.driversandvehicles&hl=en&gl=us",
    "appId": "com.rta.driversandvehicles"
}