{
    "title": "Baby Monitor 3G",
    "summary": "Turn your two phones or tablets into one single baby monitor.",
    "icon": "//lh3.googleusercontent.com/x3h3AXe4SKLl9EuDOfqK7rbufZcYsBCfCoyf_w387YMAm-V8D3j_-_GfKZxgPVZgmSqt=w300",
    "price": "$3.99",
    "free": false,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 2333,
    "developer": "TappyTaps s.r.o.",
    "developerId": "7865470206882283925",
    "developerEmail": "support@tappytaps.com",
    "developerWebsite": "http://www.babymonitor3g.com",
    "developerAddress": "TappyTaps s.r.o\nČelakovského 1457\nHořice\n508 01\nCzech Republic",
    "updated": "October 9, 2017",
    "version": "4.8.4",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Baby Monitor 3G is a universal video and audio baby monitor for your phone, tablet, or computer. Hear every noise, stream live video and soothe your child remotely. Works with an unlimited reach (WIFI, 3G, LTE) and trusted by more than half a million moms and dads. EASY TO USEThe app requires two devices. One stays in the child’s room while the other one stays with you. No registration or connection adjustments are required and initial setup takes less than 30 seconds. UNLIMITED REACHBaby Monitor 3G is the only app of its kind working on WiFi and 3G. Use it anywhere without worrying about a weak WiFi signal.LIVE HD VIDEOBaby Monitor 3G transfers live video from the child´s room to you. The light feature makes it possible to view your baby when it is dark.EVERY NOISEAre you not sure what the little sound you barely hear is? Sensitize the sound for a moment so you can hear every tiny sound from your baby’s room. ACTIVITY LOGBaby Monitor 3G allows you to check, how often was your baby awake, discover its sleeping patterns and replay sounds from current or any previous monitoring.TALK TO YOUR BABYSimply press a button and speak. Your child will be always one tap away from you.VIBRATION ALERTAssures that you will find out when your baby is awake even in a loud environment.RELIABLEBaby Monitor 3G alerts you in case something goes wrong (network connection problem, etc.). To see how video works and find more information, go to http://www.babymonitor3g.com/Please send us your feedback to support@tappytaps.com. We love to implement new features based on your ideas!Keywords: Baby Monitor, Baby Sitter, Baby Alarm, Baby watch, Babyphone",
    "descriptionHTML": "Baby Monitor 3G is a universal video and audio baby monitor for your phone, tablet, or computer. Hear every noise, stream live video and soothe your child remotely. Works with an unlimited reach (WIFI, 3G, LTE) and trusted by more than half a million moms and dads. <br><br><b>EASY TO USE</b><br>The app requires two devices. One stays in the child&#x2019;s room while the other one stays with you. No registration or connection adjustments are required and initial setup takes less than 30 seconds. <br><br><b>UNLIMITED REACH</b><br>Baby Monitor 3G is the only app of its kind working on WiFi and 3G. Use it anywhere without worrying about a weak WiFi signal.<br><br><b>LIVE HD VIDEO</b><br>Baby Monitor 3G transfers live video from the child&#xB4;s room to you. The light feature makes it possible to view your baby when it is dark.<br><br><b>EVERY NOISE</b><br>Are you not sure what the little sound you barely hear is? Sensitize the sound for a moment so you can hear every tiny sound from your baby&#x2019;s room. <br><br><b>ACTIVITY LOG</b><br>Baby Monitor 3G allows you to check, how often was your baby awake, discover its sleeping patterns and replay sounds from current or any previous monitoring.<br><br><b>TALK TO YOUR BABY</b><br>Simply press a button and speak. Your child will be always one tap away from you.<br><br><b>VIBRATION ALERT</b><br>Assures that you will find out when your baby is awake even in a loud environment.<br><br><b>RELIABLE</b><br>Baby Monitor 3G alerts you in case something goes wrong (network connection problem, etc.). <br><br>To see how video works and find more information, go to http://www.babymonitor3g.com/<br><br>Please send us your feedback to support@tappytaps.com. We love to implement new features based on your ideas!<br><br>Keywords: Baby Monitor, Baby Sitter, Baby Alarm, Baby watch, Babyphone",
    "histogram": {
        "1": 162,
        "2": 94,
        "3": 154,
        "4": 529,
        "5": 1394
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/9ThPtrwacecZx5aDgG_CpFidDt18bc2Os_2g5ipdoow3Zhbu8W45MHbPrBcdOFZS6dKl=h310",
        "//lh3.googleusercontent.com/8eJQSb271hMGnIkMSYrFUNm4FZgjuHABAVY7QqTri5mJwo5_vxU4uNbJaVohbcFZDozq=h310",
        "//lh3.googleusercontent.com/AmfVki0YByobOODWTUoAaO3JeEf855nJoAqmgnSDbJZJ2LilxUymF6HknUPek5kpEV4=h310",
        "//lh3.googleusercontent.com/Efr1Gawfhhn_nNGnk2neavJwzh2wGGaowCGseZoBTPsGoBxBwzsSRDVUsDMwuFr8AB5J=h310",
        "//lh3.googleusercontent.com/XFXClvAC7bZ9HGT6Y57Wc8-OQ8gyaiMhstX5BYBMxZrvrmWugEfPCc_f4wnvS9md0Eo=h310",
        "//lh3.googleusercontent.com/vMegO-aeXQFAdShXsTeJnLMpQeUiuZUCleMGUFMyabocnPfbKiUe1yfGu62VbPJakr8=h310",
        "//lh3.googleusercontent.com/1ybhLZdDNx5D8hjrjIb8UI0RcVSAe6FnOdhad7Dz6lDNYEMR5rb4J4DVJ1HlW3A5ZpA=h310",
        "//lh3.googleusercontent.com/KSLOf__5ZXgM27ohwNiyi2mlsEGbQHqX8TAMqcrz1qb6iWjv9rY9J-_-yIBcmIYOMg=h310",
        "//lh3.googleusercontent.com/OHyZwoinNt5XnCztjsOWFwmflKBIhI5UZ4uXKvIZkY8adza98dftJwsR8R-zEZ__IFo0=h310",
        "//lh3.googleusercontent.com/taeZ83-kHYUz4H2NMjfm0dAPIclXLYWq4E6KI52oahxEFAYISfyz7GN6gmg3FJ4I9A=h310",
        "//lh3.googleusercontent.com/QRqdVaPnJ_wVVWMqM758VT5zl2hJb3HWE8gkGziOy4Q0hK0nl-leuevAytWy9_OGig=h310",
        "//lh3.googleusercontent.com/I1ETZX9mR7CwtO-29B3h6BcP8hfKu_eRp3sYq-_pTM7nsM9JVLU1LFGq3FYtcWqTuFHC=h310",
        "//lh3.googleusercontent.com/0rQbNCzNtL067bW_GjRo8FXETDOVqBHGpizAb8MiZQqemxi3UxR0zUrmGNPef8AJsCk=h310",
        "//lh3.googleusercontent.com/VuodHBaYby4QpmaCrCkNj7OAf28XskotRXG90ctNQORqzMo46gE7OsegkbZSNWyUzDI=h310",
        "//lh3.googleusercontent.com/YWeQxMSZZz2OMPgTAR3zsPX6lcBKPZBjfhH7T1G0IJ8obJKC8ZNQCBjzK5rpWvdHWA=h310",
        "//lh3.googleusercontent.com/I5R32tWX3xIWXNzKAXNj3Bz06zBgO9cVUi0P7xSkeIfm8b9xfEYoZlgsL_NZqFmCXFI=h310",
        "//lh3.googleusercontent.com/-uRHZrzpqWDwkwkck9faAsjQfJxw2inKLz5TPG9bh-6eybG3YknmnPGSIiEIrDkndY8=h310",
        "//lh3.googleusercontent.com/lk0XSH3bRhv8OahiYQVf73_cvDR7oZk64TQTBhHXcD3OJLewSpieZMGR7f0SJH46lA=h310",
        "//lh3.googleusercontent.com/Fp7JvkdPYfhd36Ud9dVYmgJn5gwwsV-sFuZxNg1-LjN1nORypS0R4a2MnRp27BkogmlF=h310"
    ],
    "comments": [
        "Okay, in short it's great. But a few things. Even though it has family buying available, my own tablet seems to need to purchase it, even though I've bought the full version? Furthermore, the Android TV app is buggy. It can't access video first time round, but if you leave the app, and go back in, it reverts back to a phone mode and it works, but the whole UI is screwy as it's the phone version,  I've lost the nice looking TV UI. As well as that, the picture  I in picture mode doesn't work. Ionly bring this up because you seem to respond to reviewers, which I think is awesome, so maybe you could fix these things? Even if you didn't, still a solid app! If you did fix these, it'd be a five star from me as it really is nice",
        "Excellent baby monitor, I particularly love the lullaby-option! Unfortunately there is no way to play the lullaby without connecting to the server, and sometimes the volume on the baby station gets turned way up without warning (or the option to adjust the volume from the parent station). With these things fixed it would be 5 stars.",
        "It's great, but would love an extra safeguard to preventing torch turn on accidentally. One bad tap is all that's needed to wake baby. Would be best to had a slider switch to enable all transmittable sounds/light etc",
        "It works; however, the device on the parent side gets hot and loses battery really quick even after I close the app. After I uninstalled the app, no more issue on my phone. Edit: Reinstalling the app fixed the issue.",
        "Return your expensive monitors to BabiesRUs!   This is a purchase you won't regret. Used it for years across many different devices and iOS/android combinations.",
        "Definitely worth the buy. I use it between my iPad and Android phone. The connection works well, I love that you can download your own lullabies and control them from the parent station. One thing I will say that holds me back from 5 stars is when I turn on the video from the parent station, the volume of the lullaby playing on the baby station BLASTS out loud usually waking the little one. Both apps are up to date on both devices. But other than that definitely worth it! I love that you can have multiple parent stations too! Even from work my husband can tap in to see the little one schnoozing."
    ],
    "recentChanges": [
        "Version 4.8.0",
        "- Baby skin tone adjustment - Allows you to personalize the baby in the app",
        "- Low volume warning - Will notify you that you might overhear sounds from the app",
        "- Improved video quality and stability - Makes the monitoring experience more comfortable",
        "- Automatic silent mode launch on Baby Station for undisturbed sleep",
        "If you like the Baby Monitor 3G, please write us a review on Google Play ;)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tappytaps.android.babymonitor3g&hl=en&gl=us",
    "appId": "com.tappytaps.android.babymonitor3g"
}