{
    "title": "Wink - Smart Home",
    "summary": "The app that connects you and the products you rely on every day in your home.",
    "icon": "//lh3.ggpht.com/cFGBLtsmWJGXcc6Nc_saGVz4d8bzxgA_VsCF1EoLYA_tlAcKOoPZD-RBABC8qho4j54=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.7,
    "reviews": 7651,
    "developer": "Wink App",
    "developerId": "Wink+App",
    "developerEmail": "support@winkapp.com",
    "developerWebsite": "http://www.wink.com",
    "developerAddress": "606 W 28st Floor 6\nNew York NY 10001",
    "updated": "February 7, 2018",
    "version": "6.7.0.22",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Wink is the quick and simple way to connect you and your home. The Wink app brings together hundreds of smart products — lights, locks, sensors, thermostats, and more — across dozens of the best brands, so you can control them from anywhere. • Receive alerts that keep you informed of what’s happening at home.• Trigger your alarm and lights to turn on automatically if fire or smoke is detected.• See who’s at the front door and use your phone to unlock it from anywhere.Use Wink’s security services to make your home even smarter and safer:• Lookout: Get instant security alerts about doors, windows, locks, garage doors, motion, and more, giving you control over your home so you can quickly decide how to respond if something unexpected occurs.• Home Sitter: Have your lights turn on and off in a natural, human pattern to make it look like you’re home when you’re away. Relax when you’re out of town, knowing your home looks lived in.• Moonlight: Always return to a well-lit home by syncing your lights to turn on and off with local sunset and sunrise times. It’s a convenient way to light your way home after work, so you don’t have to search for keys in the dark. Explore other features in the Wink app, such as Shortcuts, Schedules, and Robots, to customize your smart products.Questions? Talk to a real human at 844-WINK-APP or questions@wink.com.",
    "descriptionHTML": "Wink is the quick and simple way to connect you and your home. The Wink app brings together hundreds of smart products &#x2014; lights, locks, sensors, thermostats, and more &#x2014; across dozens of the best brands, so you can control them from anywhere. <br>&#x2022; Receive alerts that keep you informed of what&#x2019;s happening at home.<br>&#x2022; Trigger your alarm and lights to turn on automatically if fire or smoke is detected.<br>&#x2022; See who&#x2019;s at the front door and use your phone to unlock it from anywhere.<br><br>Use Wink&#x2019;s security services to make your home even smarter and safer:<br>&#x2022; Lookout: Get instant security alerts about doors, windows, locks, garage doors, motion, and more, giving you control over your home so you can quickly decide how to respond if something unexpected occurs.<br>&#x2022; Home Sitter: Have your lights turn on and off in a natural, human pattern to make it look like you&#x2019;re home when you&#x2019;re away. Relax when you&#x2019;re out of town, knowing your home looks lived in.<br>&#x2022; Moonlight: Always return to a well-lit home by syncing your lights to turn on and off with local sunset and sunrise times. It&#x2019;s a convenient way to light your way home after work, so you don&#x2019;t have to search for keys in the dark. <br><br>Explore other features in the Wink app, such as Shortcuts, Schedules, and Robots, to customize your smart products.<br><br>Questions? Talk to a real human at 844-WINK-APP or questions@wink.com.",
    "histogram": {
        "1": 1121,
        "2": 636,
        "3": 999,
        "4": 1826,
        "5": 3069
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/LDOkPhHRvAP9F1VfpXLWUSRygKrbMCbCzf5TkLhJTd95kJxht5OLcl5YWpjRBiHVYg=h310",
        "//lh3.googleusercontent.com/ZcBnZAg0ftk6-jlVY16yQwltSxi1La1f1xFSlSo4Z4ZWiXnJCr0xeVy-VM9O71TQGhpS=h310",
        "//lh3.googleusercontent.com/22jLJZS3Y8cLienEQrcNx9m_lz6i_e5cw2x-VWpmV0kIs0LbwwabRDHpm4mbbKVDNQ=h310",
        "//lh3.googleusercontent.com/_78fHyE1_hgQ25NNn6xMCFGdHgmHnSAk_w3wlk0eHKnrFpP6_RwDP-dF-RSEvg91cSg=h310",
        "//lh3.googleusercontent.com/-7fOa9xTxzeU9BT5Q2KLPI6SSsSrwIzZ1GGwqwpUfrSdlh669ywLg2wB9STLzjnQpkw=h310",
        "//lh3.googleusercontent.com/_CDj7QQN1h8XCaRk49MOQWpQMCCRhMBS0355RSDWsH04lQzjkGPXuMnNKONtCArB2DU=h310",
        "//lh3.googleusercontent.com/MeXlZMMtOVQx5-9XQa5JqwqZU8nKU6UdzGG4BposYxcgzH-MxhgFICzlB4hVD-uYSPo=h310"
    ],
    "video": "https://www.youtube.com/embed/VbL-mNG_xvI",
    "comments": [
        "Always minor bug fixes and improvements but never really any new features.  I've personally submitted multiple ideas for product improvement and I can only assume others have as well.  So they are either not capable of growing the platform or not willing.  Very disappointing.",
        "What's with the clocking and sluggishness to control devices when on WiFi?  If I disconnect from my WiFi, I get no clocking in the app and great responsiveness of my devices.  On WiFi?  Spinning circle, up to a minute for devices to respond to commands.  This is new behavior for me, what gives?  Update: another update, another no fix for the clocking and poor device response on WiFi.    ***If you're considering Wink, I recommend you look at their competition until the very poor device response issue I and many others have is fixed.",
        "What the hell did you do to the widget? You don't have enough distinct symbols to be able to get rid of the labels. I have no idea what each button does since they all look their same. Ridiculous.",
        "Another update, still no fix for major android wifi bug.  It's sad when the Alexa app operates switches more reliably than the manufacturer's own app.  Persistent bug causes devices to lag substantially, sometimes for a minute or more after toggling in Android app.  This occurs only when switching with the app on wifi connection, not mobile/lte connection.  This bug has been acknowledged by Wink team multiple times over the past year but for some reason they have not fixed it.",
        "Wow. Been using it for 30 mins. This thing is completely useless. I try to link a Hue account through Google sign in and get 403 disallowed user agent. Linked my Arlo cams but can't actually live stream? Two integrations a compete failure. This will have to go back.",
        "Still no fix for location bots not working on Android Oreo Pixel 2 (same bots work on iPhone) - Having issues with location robots not working once upgrading to a Pixel 2 running Oreo. Have deleted and recreated the location bots but they still do not work. App needs to better support multiple users."
    ],
    "recentChanges": [
        "- Minor bug fixes and improvements to further enhance stability and reliability."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.quirky.android.wink.wink&hl=en&gl=us",
    "appId": "com.quirky.android.wink.wink"
}