{
    "title": "Free Roku Remote - RoByte",
    "summary": "The #1 Roku remote available. No setup required.",
    "icon": "//lh3.googleusercontent.com/52B1UaoMiX-xWl4kEgPuLOU9CqlCwJ5Iy07azx9RSlW44IGYE1I4oOqI0Yoz2wVcYXmv=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.4,
    "reviews": 5727,
    "developer": "TinyByte Apps",
    "developerId": "5102417434663962205",
    "developerEmail": "tinybyteapps@gmail.com",
    "developerAddress": "San Francisco, CA",
    "updated": "December 28, 2017",
    "version": "2.0.4",
    "genre": "Video Players & Editors",
    "genreId": "VIDEO_PLAYERS",
    "description": "RoByte turns your phone or tablet into a Roku Remote!With RoByte we wanted everyone to have the best Roku remote app so we made the remote control functionality free!Features:• No Setup required, RoByte automatically scans for your device• Easy channel switcher• Use your keyboard for super fast text & voice entry on channels like Netflix or Hulu.• View all your TV channels and jump directly to the one you like.• Adjust your Roku TV's volume and toggle the input.• Tablet support• Android Wear support, quick access to play/pause from your wrist• Navigate using D-pad or Swipe-Pad• Pair with multiple Roku devices• Customizable Widgets turn your Android homescreen into a Roku remote• Option to keep the wifi from sleeping• Built with material design for Android LollipopRoByte Free features:• Roku remote control• Play/pause, fast forward, rewind• Pair with multiple Roku devicesRoByte Premium features:• Channel switcher• TV Channels & Volume• Keyboard & Voice Search• Homescreen widgets• Android Wear supportQuick tips:• Most problems connecting to your Roku can be resolved by simply reinstalling RoByte.• RoByte can only connect if you are on the same wifi network as your Roku device. Support: tinybyteapps@gmail.comTwitter: http://twitter.com/TinyByteAppsFacebook: http://www.facebook.com/TinyByteAppsThis Roku remote is not designed to control Roku SoundBridgeHandcrafted by two brothers in San Francisco & Illinois. We call ourselves TinyByte Apps.",
    "descriptionHTML": "RoByte turns your phone or tablet into a Roku Remote!<br><br>With RoByte we wanted everyone to have the best Roku remote app so we made the remote control functionality free!<br><br><b>Features:</b><br>&#x2022; No Setup required, RoByte automatically scans for your device<br>&#x2022; Easy channel switcher<br>&#x2022; Use your keyboard for super fast text &amp; voice entry on channels like Netflix or Hulu.<br>&#x2022; View all your TV channels and jump directly to the one you like.<br>&#x2022; Adjust your Roku TV&apos;s volume and toggle the input.<br>&#x2022; Tablet support<br>&#x2022; Android Wear support, quick access to play/pause from your wrist<br>&#x2022; Navigate using D-pad or Swipe-Pad<br>&#x2022; Pair with multiple Roku devices<br>&#x2022; Customizable Widgets turn your Android homescreen into a Roku remote<br>&#x2022; Option to keep the wifi from sleeping<br>&#x2022; Built with material design for Android Lollipop<br><br><b>RoByte Free features:</b><br>&#x2022; Roku remote control<br>&#x2022; Play/pause, fast forward, rewind<br>&#x2022; Pair with multiple Roku devices<br><br><b>RoByte Premium features:</b><br>&#x2022; Channel switcher<br>&#x2022; TV Channels &amp; Volume<br>&#x2022; Keyboard &amp; Voice Search<br>&#x2022; Homescreen widgets<br>&#x2022; Android Wear support<br><br><b>Quick tips:</b><br>&#x2022; Most problems connecting to your Roku can be resolved by simply reinstalling RoByte.<br>&#x2022; RoByte can only connect if you are on the same wifi network as your Roku device. <br><br>Support: tinybyteapps@gmail.com<br>Twitter: http://twitter.com/TinyByteApps<br>Facebook: http://www.facebook.com/TinyByteApps<br><br>This Roku remote is not designed to control Roku SoundBridge<br><br>Handcrafted by two brothers in San Francisco &amp; Illinois. We call ourselves TinyByte Apps.",
    "histogram": {
        "1": 437,
        "2": 111,
        "3": 230,
        "4": 930,
        "5": 4019
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/YI19JpCqbd-AeglLV6r0uYkqoUnMeryhZ0luDS4uv5J0il0mM0i7fzIhOxuaBwHmE_w=h310",
        "//lh3.googleusercontent.com/N55Ja3GcZGFJyRVtknRpPRuVG5vilMCsBp7xvoBR0Msc1b1aN6VQvdcoO1gqN_06cXKV=h310",
        "//lh3.googleusercontent.com/9nzcMi-DzvMMYR1hYLIhEQErUGBdbo3ZqL_tnsUk1zMuSC17UWnUIyKluHEGscWojfE=h310",
        "//lh3.googleusercontent.com/BOt66VCWTWQI3AghAnipCT1BB84LbCn9pXifUU94AVz-1ZgZp2slhVy0oBRgpv35Lg=h310",
        "//lh3.googleusercontent.com/_mQQsU4ZB0hsbVR6tr8M6jSW4_kVXJ8CwEZ7SXKoWRG4UCYIAjiOpxSWDrsfX4Jpvg=h310",
        "//lh3.googleusercontent.com/CABB_ePtNoxhdR_O9hCuc0hiFhZezQJpFeQVhK8JwDjM1CTFHaPu8bIwG3qj63p-qiU=h310",
        "//lh3.googleusercontent.com/0VCe3QumSe851qH0QyMXavm3TQFG8eQPnu0o7k_IrUUQFnvJU4FEeQzeUMjfjVung2o=h310",
        "//lh3.googleusercontent.com/qKMLaZFN44g7sKFa1gR5iGgs7MF_kxNx021HtJP0rrVph5zaAcP-ZEIuPakgJLOzpKqc=h310",
        "//lh3.googleusercontent.com/gAqjG1YCS8nzHpUppdGXm-78eERgE-9YIvSHIlnP36xsMp_6dN-bD2CX2DFTxOlSKyc=h310",
        "//lh3.googleusercontent.com/KXsONc_A6gTa8GanohpG0tnAK8DhmXWN6DXP-kWhAGaT0UFL6MoGAUXZQSWRk5Pf_w=h310"
    ],
    "comments": [
        "For whatever reason... Roku decided to put the shortest cord ever on the remote receiver. Therefore it doesn't reach long enough from the outlet to the top or aide of my t.v.. It barely pokes around the side and sits inbyhe floor....To use the standard remote, one must awkwardly position themselves directly in the path of the remote receiver and point the remote right at it. Such a pain when I am comfy and don't wanna move from my side of the bed, reach across hubby and point the remote. With the app, I can be in another room and click away and the signal is perfect every time... No more awkward reaching of remotes.",
        "Had the free app which was fine. Paid extra to get all the premium features and it doesn't work. No tv tab (as per screenshots) at all. I've tried reinstalling, refreshing etc as per troubleshooting faq. Still doesn't work. I'd like refund or better than that - a fix. UPDATE Victor - I saw you'd mentioned this option to someone else so tried that and it still doesn't work. Makes a beeping nose and a volume - and + appears on the screen but doesn't actually change the volume :( UPDATE 2 - Ok. Thank you. I've already submitted a refund request via google and they confirmed a refund is on the way. Will amend my rating as the free app works well. Cheers for trying to fix for me.",
        "Super easy to use. Literally downloaded the app and started using. I thought it was gna be shper complicated to set up and that id end up deletinf the app after 30vseconds but within 30 seconds it just worked. Idk how it works or how it knows but it works and thats all i care about. Dope!",
        "I downloaded the free app. I was kind of forced to pay for the pro version. I don't mind paying but I am unable to do one thing for which I paid - search with the keyboard entry on YouTube. Very disappointing. Now I want my money back.",
        "I received a Roku Stick for Christmas over 2 years ago. The remote never worked right. It usually took at least 10 minutes to turn the Roku on with the remote and I often spent 20-30 minutes of frustration without luck. I finally gave up the other day after 45 minutes of failure and threw the remote out. In desparation I searched for another way to turn the Roku on and I found this RoByte app. Let's just say that I am ecstatic. It works PERFECTLY. I read the problems that other people were having with volume. I am able to adjust the volume with the tv remote. There is no problem. This RoByte app is wonderful! Thank you!",
        "I purchased the full version to have the additional features however none of them work - the volume doesn't work, there is no additional TV tab as per the screenshots. The free version worked fine, but this doesn't. Very disappointing. I would like a refund."
    ],
    "recentChanges": [
        "We've got an adaptive icon for Oreo users!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tinybyteapps.robyte&hl=en&gl=us",
    "appId": "com.tinybyteapps.robyte"
}