{
    "title": "Evernote for Android Wear",
    "summary": "Use Evernote to make notes, remember everything and collaborate on any project.",
    "icon": "//lh3.googleusercontent.com/xxhMZ39raiDnp_YJvo8BmdNRf7sc5wxRpf82y7PgocsHwM9D0hptCfS9Ik8UcS47tGc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.1,
    "reviews": 11361,
    "developer": "Evernote Corporation",
    "developerId": "Evernote+Corporation",
    "developerEmail": "appstore@evernote.com",
    "developerWebsite": "http://www.evernote.com/",
    "developerAddress": "305 Walnut Street\nRedwood City, CA 94063",
    "updated": "July 2, 2014",
    "version": "0.9",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "\"Use Evernote as the place you put everything … Don’t ask yourself which device it’s on—it’s in Evernote\" – The New York Time“When it comes to taking all manner of notes and getting work done, Evernote is an indispensable tool.” – PC Mag--Evernote for Android Wear puts notes and checklists at your fingertips while your phone stays in your pocket. Use it together with Evernote for Android tor make your notes accessible at a glance whenever you need them.*KEY FEATURES*• Create a note with simple voice commands• View a note on your phone, lock the screen and that note appears on your watch• Check off to-dos by tapping your watch, and add new to-dos by speaking the to-do name• Find notes by speaking the text you are looking for• Find notes you created nearby, and notes you looked at recently• See relevant notes and content appear on your watch whenever you have a calendar event• For recurring meetings, see notes created during prior meeting---Also available from Evernote:EVERNOTE PLUS - More space. More freedom.• 1 GB of new uploads each month• Access your notes and notebooks offline• Save emails to Evernote• Add a passcode lock to your mobile app$2.99 monthly, $24.99 annuallyEVERNOTE PREMIUM - The ultimate workspace.• 10 GB of new uploads each month• Access your notes and notebooks offline• Save emails to Evernote• Add a passcode lock to your mobile app• Turn notes into presentations with Presentation Mode• Search inside Office docs and attachments• Annotate PDFs$5.99 monthly, $49.99 annuallyPrice may vary by location. Subscriptions will be charged to your credit card through your Google account. Your subscription will automatically renew unless cancelled at least 24 hours before the end of the current period. You will not be able to cancel the subscription once activated. Manage your subscriptions in Account Settings after purchase.",
    "descriptionHTML": "&quot;Use Evernote as the place you put everything &#x2026; Don&#x2019;t ask yourself which device it&#x2019;s on&#x2014;it&#x2019;s in Evernote&quot; &#x2013; The New York Time<br><br>&#x201C;When it comes to taking all manner of notes and getting work done, Evernote is an indispensable tool.&#x201D; &#x2013; PC Mag<br><br>--<br><br>Evernote for Android Wear puts notes and checklists at your fingertips while your phone stays in your pocket. Use it together with Evernote for Android tor make your notes accessible at a glance whenever you need them.<br><br>*KEY FEATURES*<br>&#x2022; Create a note with simple voice commands<br>&#x2022; View a note on your phone, lock the screen and that note appears on your watch<br>&#x2022; Check off to-dos by tapping your watch, and add new to-dos by speaking the to-do name<br>&#x2022; Find notes by speaking the text you are looking for<br>&#x2022; Find notes you created nearby, and notes you looked at recently<br>&#x2022; See relevant notes and content appear on your watch whenever you have a calendar event<br>&#x2022; For recurring meetings, see notes created during prior meeting<br><br>---<br><br>Also available from Evernote:<br><br>EVERNOTE PLUS - More space. More freedom.<br>&#x2022; 1 GB of new uploads each month<br>&#x2022; Access your notes and notebooks offline<br>&#x2022; Save emails to Evernote<br>&#x2022; Add a passcode lock to your mobile app<br>$2.99 monthly, $24.99 annually<br><br>EVERNOTE PREMIUM - The ultimate workspace.<br>&#x2022; 10 GB of new uploads each month<br>&#x2022; Access your notes and notebooks offline<br>&#x2022; Save emails to Evernote<br>&#x2022; Add a passcode lock to your mobile app<br>&#x2022; Turn notes into presentations with Presentation Mode<br>&#x2022; Search inside Office docs and attachments<br>&#x2022; Annotate PDFs<br>$5.99 monthly, $49.99 annually<br><br>Price may vary by location. Subscriptions will be charged to your credit card through your Google account. Your subscription will automatically renew unless cancelled at least 24 hours before the end of the current period. You will not be able to cancel the subscription once activated. Manage your subscriptions in Account Settings after purchase.",
    "histogram": {
        "1": 957,
        "2": 398,
        "3": 1047,
        "4": 2685,
        "5": 6274
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/5Z0AF951x9VuRtyaSy0h47xIHS7ULrf-Q2dbE0aigJGMBvkfxZhIV0UGqwshsU3PkTEw=h310",
        "//lh5.ggpht.com/BzPt1ZebFoxFxL-edHpTOrNrIKLg6FQEB0tqW38wo9kzdIbaifozwM2k96_PwRvD65H3=h310",
        "//lh5.ggpht.com/WjfGxp7nQFyKyiJUbHwrpPP8OaYGf-JE2MjPNrxTJRjE0MB48MxbD9MZFEC_7TKvTN0=h310",
        "//lh4.ggpht.com/scEhG90MnF0PKmNI8E-MwCwMphLhjlFcJyTFe-fqNPKwec-5_tBBYI3jdTBlEYb4Xw=h310",
        "//lh3.ggpht.com/PxyLlSag1mwj_UeA-NwlYhWCHIEpZ0FBRl19BU48ZWjP38mpO5CdIdUOnLCG7LIRqNI=h310",
        "//lh5.ggpht.com/nfAu_0UEge8cpIFw8RD1683CzmJYLMQndef6dodaWMmae7Hqqdd1rpZCDPYNLFg4odo=h310",
        "//lh6.ggpht.com/r_QF-wj1IIpEgEe-rH2q6OG-q4nW7tw-SU3-W-rH8kIHpFuJAvvcpCwj909CcQXlkUuX=h310",
        "//lh3.ggpht.com/D4qQpF42Px3tUoRJzcrq65IdHnEfmgTbdxofpj91E71-aRrymg9avMPQjZk5H9ooJk0=h310"
    ],
    "comments": [
        "well designed app! Evernote are a top-tier cross platform design company, and this app reflects that.  Open a note on your phone. Lock the phone screen - the note appears on your watch. This is exactly what you want... no mucking around on the watch.  A use case: create a shopping list on the phone. Lock the screen. When you're in the market - there it is on your watch: flick left, scroll through the items an in your basket they go.  Or you want a series of speaking notes on your wrist: Write them as a note. Lock the screen and bam... scroll through as the meeting proceeds to make sure you raise each issue you wanted to.",
        "This isn't working for me.  When I press \"To Dos\", it shows, \"Fetching to do notes\", but never does.  I get an alert saying \"Can't fetch to do notes.  Are you connected to the Internet?\" (I am).  When I press \"Find\" and say the name of the note I want it to find, the app just closes without any notice.  I finally figured out that I have to swipe up after the app closes to see the note.  This is version 0.9.  Hopefully version 1.0 will work better.",
        "Good, but could be better [Feature Request] Gets all my notes and lets me quickly add them, but for example, I have pictures and such spread throughout my notes. When I open them up on my watch I can't see the pictures between the text. I just see them somewhat in the background. Please make it so that the pictures are actually embedded in the text the way I view them on my computer. Thanks",
        "Too limited to be useful I keep a lot of notes in Evernote but, for my watch, I only ever use it for my shopping list.  This worked fine on my Pebble (though slow) but, on my Moto360, I can only pull up a checklist of 30 items max.  Am I supposed to re-order my list every time just to make sure that the items I need are in the first 30?  And what if, gods forbid, I have more than 30 things to buy? And why isn't my most-recently edited list at the top?",
        "Am I also missing something? What's going on with this version,where is it? I just installed it and it's nowhere to be found on my phone.I really loved Evernote and have always found it easy to get everything back once I have logged in whenever I have updated my operating system.And now I can't even access it.",
        "Useful, but could be better. You need to think through the UX/use-cases more thoroughly. Maybe by providing options so that the user actually knows what is going on. It's not clear to me why a notification sometimes (but not always) shows up on my watch for notes I recently looked at. It seems deliberate, but rarely something I actually want. The app on the watch has some useful functions but can be hard to actually use to find the note I want. It always just shows the three top search results, and shows them as notifications. If I find the note I want I have to dismiss the other two notifications. If I don't find the note I want I can't refine the search, or see more than the top 3 results. I think it would be more helpful to show all search results as a list inside the app, then show a notification for a note only once a particular note is selected. Then I can see all the results, and I don't end up with notifications I don't want. One last thing: the screen wake lock never times out of the main app, which is unnecessary for this kind of application."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.evernote.wear&hl=en&gl=us",
    "appId": "com.evernote.wear"
}