{
    "title": "Appie van Albert Heijn",
    "summary": "With Appie is shopping even easier and more personal",
    "icon": "//lh3.googleusercontent.com/-Juc8sVgmfjvBxwhssJiyI_Zi9oJ0jRY-aq0Q7BSDycnTTvwHKVawXyfm2YXt9ptoA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 16207,
    "developer": "Albert Heijn",
    "developerId": "Albert+Heijn",
    "developerEmail": "appie@aholdnl.helptu.nl",
    "developerWebsite": "http://www.ah.nl/appie",
    "developerAddress": "Provincialeweg 11\n1506 MA\nZaandam",
    "updated": "February 26, 2018",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "Appie is vernieuwd en daardoor wordt boodschappen doen nóg makkelijker en persoonlijker. Met Appie kies je zelf hoe je boodschappen doet bij Albert Heijn. Bij jou in de supermarkt of online.Maak makkelijk een boodschappenlijst- Gebruik de productenvinder, barcodescanner of kies uit je eerdere aankopen. Klik op het plusje om een product toe te voegen.- Bekijk alle Bonusaanbiedingen en zet ze direct op je boodschappenlijst. Log in op de voorpagina om direct je persoonlijke Bonusaanbiedingen te zien en toe te voegen.- Kies uit ruim 20.000 producten – net zoveel als in een AH XL winkel.- Blader door en zoek op ruim 16000 recepten uit Allerhande en voeg de ingrediënten toe aan je lijstje.- Log in met een Mijn ah.nl profiel en onder andere je lijst met bewaarde recepten zijn ook op andere apparaten beschikbaar.Vind je boodschappen snel terug in de winkel. En ontdek het gemak van mobiel zelfscannen- Sorteer het boodschappenlijstje op de looproute in je eigen AH winkel.- Link makkelijk naar de AH Zelfscannen app, scan zelf je boodschappen met je smartphone en reken af bij een betaalpaal. Mogelijk bij alle winkels met zelfscannen.Bestel direct alles op je lijstje- Zet je boodschappenlijstje om in een bestelling en laat de boodschappen bezorgen.- Zelf ophalen kan ook, je bestelling staat dan op afspraak klaar bij een Albert Heijn Pick Up Point.- Kies het tijdstip dat je het best uitkomt.- Een bestelling aanpassen kan tot aan de dag voor de bezorging.Appie is er om het je makkelijk te maken. Heb je ideeën over hoe het nog beter kan? Ga via het menu naar ‘Over Appie’, klik op ‘Feedback’ en stuur ons jouw feedback. Ook de Klantenservice van AH Online is via Appie direct bereikbaar.Met het downloaden van deze applicatie ga je akkoord met de algemene voorwaarden die van toepassing zijn op het gebruik van Appie en de diensten die via Appie worden geleverd. Je kunt ze nalezen op www.ah.nl/algemene-voorwaarden. Op deze applicatie is het privacy- en cookiebeleid van toepassing dat je kunt nalezen op www.ah.nl/privacy.Appie is een gratis service van Albert Heijn B.V., ingeschreven in Handelsregister KvK Amsterdam onder nummer 35012085, gevestigd aan de Provincialeweg 11 (1506 MA) te Zaandam. Aan deze applicatie zijn geen abonnementskosten verbonden.",
    "descriptionHTML": "Appie is vernieuwd en daardoor&#xA0;wordt boodschappen doen&#xA0;n&#xF3;g&#xA0;makkelijker en persoonlijker. Met Appie kies je zelf hoe je boodschappen doet bij Albert Heijn.&#xA0;Bij jou&#xA0;in de supermarkt of online.<br><br><b>Maak makkelijk een boodschappenlijst</b><br>- Gebruik de productenvinder, barcodescanner of kies uit je eerdere aankopen. Klik op het plusje om een product toe te voegen.<br>- Bekijk alle Bonusaanbiedingen en zet ze direct op je boodschappenlijst. Log in op de voorpagina om direct je persoonlijke Bonusaanbiedingen te zien en toe te voegen.<br>- Kies uit ruim 20.000 producten &#x2013; net zoveel als in een AH XL winkel.<br>- Blader door en zoek op ruim 16000 recepten uit Allerhande en voeg de ingredi&#xEB;nten toe aan je lijstje.<br>- Log in met een Mijn ah.nl profiel en onder andere je lijst met bewaarde recepten zijn ook op andere apparaten beschikbaar.<br><br><b>Vind je boodschappen snel terug in de winkel. En ontdek het gemak van mobiel zelfscannen</b><br>- Sorteer het boodschappenlijstje op de looproute in je eigen AH winkel.<br>- Link makkelijk naar de AH Zelfscannen app, scan zelf je boodschappen met je smartphone en reken af bij een betaalpaal. Mogelijk bij alle winkels met zelfscannen.<br><br><b>Bestel direct alles op je lijstje</b><br>- Zet je boodschappenlijstje om in een bestelling en laat de boodschappen bezorgen.<br>- Zelf ophalen kan ook, je bestelling staat dan op afspraak klaar bij een Albert Heijn Pick Up Point.<br>- Kies het tijdstip dat je het best uitkomt.<br>- Een bestelling aanpassen kan tot aan de dag voor de bezorging.<br><br>Appie is er om het je makkelijk te maken. Heb je idee&#xEB;n over hoe het nog beter kan? Ga via het menu naar &#x2018;Over Appie&#x2019;, klik op &#x2018;Feedback&#x2019; en stuur ons jouw feedback. Ook de Klantenservice van AH Online is via Appie direct bereikbaar.<br><br>Met het downloaden van deze applicatie ga je akkoord met de algemene voorwaarden die van toepassing zijn op het gebruik van Appie en de diensten die via Appie worden geleverd. Je kunt ze nalezen op www.ah.nl/algemene-voorwaarden. Op deze applicatie is het privacy- en cookiebeleid van toepassing dat je kunt nalezen op www.ah.nl/privacy.<br><br>Appie is een gratis service van Albert Heijn B.V., ingeschreven in Handelsregister KvK Amsterdam onder nummer 35012085, gevestigd aan de Provincialeweg 11 (1506 MA) te Zaandam. Aan deze applicatie zijn geen abonnementskosten verbonden.",
    "histogram": {
        "1": 1386,
        "2": 755,
        "3": 1382,
        "4": 4489,
        "5": 8195
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/LPCaefXVxpL_BwOh4BZjmPdNbl-8hNZqdx3ZnPZ5Z7cEZHjx2Z1P9zJEIEgx3pLQEqE=h310",
        "//lh3.googleusercontent.com/WQlA8T2VWSTO0Z5eRCuHuaqCzVJkYuWmmTMYzvCstNDI931mXTqQU4WpD-PWn34qIy4=h310",
        "//lh3.googleusercontent.com/6aR7hJkcPCw3SwjRq8sNgGdz9vHyYUhnIXXQ4UdIEzuu5bmc85LdUyPU7F0i-WbO4hS6=h310",
        "//lh3.googleusercontent.com/MdYH-_Gw7cTRxafI_mO0rbvD8NWb35aD3_gtpXklBFBRHdufqhuFVyDVeGByE-ar1EM=h310",
        "//lh3.googleusercontent.com/k-76wKCwxeSwB4Dx-LqDpcLpflWKstDpApEStGHppQy-hIZoSqO7Ssmg6Y4qC_iSGQ01=h310",
        "//lh3.googleusercontent.com/2HWuA_8NKXlLdMWXrQoSGoGVdJs7-gr-HjitsSY1mUD-fMjLbTh4JveiaJT05AO0lRs=h310",
        "//lh3.googleusercontent.com/dd-BBXc7z81PGdOlxWi5gZY7fL0hK8jGzzoyoeipQNN6qRS4q5Hn-q3RH4XsHOEmW0A=h310",
        "//lh3.googleusercontent.com/W5rB-0em7_bdf7bC_XN9bOfQbsF1gC5-grnwy_W_MB9lE7QIbWIHNclEh1Og8hSC8A=h310",
        "//lh3.googleusercontent.com/ql01z2kffaLFZ6tAQdyehEA-wsjI-rr5JA1i-sWHa5XWL-WzLGpjz3b0MVHsT2lgsp8=h310",
        "//lh3.googleusercontent.com/lXxPkkqykmKNbsoKgbn9qjap2B_uy4Mt9OYk2-BQL1bcPHBNXUNRaXLz6DsosRS3nRk=h310"
    ],
    "video": "https://www.youtube.com/embed/IeRak_4ZoxQ",
    "comments": [
        "Not happy with this app. I understand they want to make as much money as possible but well. Is it really necessary to not be able to see the total price of your order until the very last second? Feels like a rip off, certainly not a nice shopping experience. In addition, i lost the bonus prices twice already, once because it did not register my card properly and once because i ordered just after 0h. No warning at all. Most supermarkets also deliver free from a certain amount bit not this one. A pity for a big spender. Lastly, when you have the stuff delivered they leave crates behind for which you loan 4 euros per piece. Another trick to keep you ordering. So all in all, i never thought appie would find it necessary to use ALL the dirty tricks in the book. Sad.",
        "Goed op weg qua functionaliteit. Menu aan de onderkant is top. Verbeterpunten: up-to-date volgorde van boodschappenlijstje. Klopt nu niet helemaal met fysieke locatie in de winkel. Misschien ondersteunt met  pad-schap-vak nummers zodat je minder hoeft te zoeken. Of nog beter oplichtende lampjes in het schap gekoppeld aan de app. 😎 kun je nog meer klantdata verzamelen. Totale boodschappenlijstje zou ook prettig zijn.",
        "Best aardig al, maar te weinig confirmation naar de user toe. Als ik een bestelling aanpas, of iets eraf haal, of aantallen verander, dan zie ik toch liever een popup die bevestiging geeft, niet gewoon dat mysterieuze alles in de achtergrond gebeuren. Ik wordt steeds onzeker bij gebruik van appie. Nog iets: Koppelen of mergen optie van meerdere bonuskaarten graag, voor als 1 huishouden meer bonuskaartbezitters heeft die allemaal via 1 appie login bestellen.",
        "Used to show opening hours. No longer, it seems. Sucks pretty hard.",
        "Sync met website en app op andere telefoon is erg slecht, waardoor je boodschappen mist. Een paar keer tips gegeven voor verbetering van de app, maar daar wordt niets mee gedaan.",
        "Een net berichtje sturen met verbeterpunten via de App wordt niet op gereageerd. Klagen via Google Play en een slechte review schrijven wordt beloond met een reactie en de verbeteringen worden opgepakt. Bij deze ... 1) Na het activeren van je persoonlijke bonus verandert de status hiervan niet. Heb inmiddels al diverse keren mijn bonuskaart geactiveerd.  2) Na doorstrepen van een product of het veranderen van aantallen gaat Appie synchroniseren. Daarna komt de focus standaard onderaan de boodschappenlijst. Niet handig sterker nog zeer onhandig. Rol je snel (voor de synchronisatie) naar het begin van de lijst dan blijft de boodschappenlijst wel staan. ===================================== Update  19 jan 2018 Nog steeds problemen met deze App. - Looproute komt niet overeen met de winkel. - Producten in mijn lijstje wordt onder \"niet verkrijgbaar in deze winkel\" geplaatst terwijl deze wel beschikbaar zijn. - Enkele producten die uit de lijst \"zoek een product\" komen worden onder \"Niet herkend\" geplaatst. Hoe kan dit?!?  Recent weer een berichtje via de App gestuurd. Je hoort hier niks meer van. In dit berichtje ook de wens geuit dat je zelf een volgorde van de producten kan instellen."
    ],
    "recentChanges": [
        "Met deze update is je Bonuskaart altijd bij de hand! Start Appie, log in en tik op \"Mijn Bonuskaart\" in het menu. Daarnaast kan je van alle winkels de openingstijden van deze én volgende week bekijken.",
        "Heb je feedback of vragen? Stuur een mail naar appie.feedback@ah.nl. Ben je blij met Appie? Laat dan een recensie achter in Google Play. Wij horen het graag!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.icemobile.albertheijn&hl=en&gl=us",
    "appId": "com.icemobile.albertheijn"
}