{
    "title": "GetResponse",
    "summary": "GetResponse All-in-one Online Marketing Platform to Grow Your Business",
    "icon": "//lh3.googleusercontent.com/ZkDh8UaZN2q3hI_68ZeuGtp-4lQrS4PMJhtOXGsk22hEYm1Uo9BmdWV2zyGDfRqSTcn_=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.4,
    "reviews": 2277,
    "developer": "GetResponse",
    "developerId": "5053419609952754733",
    "developerEmail": "mobile@getresponse.com",
    "developerWebsite": "http://www.getresponse.com",
    "developerAddress": "Arkońska 6, 80-387 Gdańsk, Poland",
    "updated": "January 18, 2018",
    "version": "Varies with device",
    "genre": "Business",
    "genreId": "BUSINESS",
    "size": "Varies with device",
    "description": "GetResponse Email Marketing Platform presents our Android App, which includes new capabilities and an interface that is more intuitive than ever. Manage your email marketing campaigns, collect leads, and keep up to date on your statistics while you’re on the go.FEATURES:• Create and Send - create emails on the go or send drafts prepared previously on your laptop or desktop. It’s available anywhere you go, anytime you need it.• Manage List - view new subscribers instantly and search your database in real-time. It’s the handiest way to manage your contact list.• Track and Report - check your campaign performance and forward a report by email.• Add Subscribers - add contacts by manual entry or import from smartphone address book.• View Subscribers - check subscriber locations and activities.• Web form list - view statistics for your web forms in a clear, easy-to-read list. • Enhanced landing page module - get statistics, A/B testing, link-sharing to landing page creator, inbox preview — all in a simple, accessible display.• Click-through ratio (CTR) for links in messages - check statistics on links clicked in your messages.• GetResponse blog module - view GetResponse blog posts, now available directly from the dashboard.______________________________________________________Feel free to email us at mobile@getresponse.com if you have suggestions or ideas about the app.______________________________________________________ABOUT GETRESPONSEGetResponse is a complete email marketing platform, with tools for building complete marketing programs from start to finish in one place. The platform includes innovative features such as responsive design, landing page creator, email analytics, autoresponders, and smart list import. Its user-friendly interface, best-in-class 99.5% deliverability, and 5-star customer service make it the top solution in the market.  The platform is available in 19 languages and serves more than 350,000 customers from 193 countries, delivering 12 billion emails per year.",
    "descriptionHTML": "GetResponse Email Marketing Platform presents our Android App, which includes new capabilities and an interface that is more intuitive than ever. Manage your email marketing campaigns, collect leads, and keep up to date on your statistics while you&#x2019;re on the go.<br><br><br>FEATURES:<br><br>&#x2022; Create and Send - create emails on the go or send drafts prepared previously on your laptop or desktop. It&#x2019;s available anywhere you go, anytime you need it.<br><br>&#x2022; Manage List - view new subscribers instantly and search your database in real-time. It&#x2019;s the handiest way to manage your contact list.<br><br>&#x2022; Track and Report - check your campaign performance and forward a report by email.<br><br>&#x2022; Add Subscribers - add contacts by manual entry or import from smartphone address book.<br><br>&#x2022; View Subscribers - check subscriber locations and activities.<br><br>&#x2022; Web form list - view statistics for your web forms in a clear, easy-to-read list. <br><br>&#x2022; Enhanced landing page module - get statistics, A/B testing, link-sharing to landing page creator, inbox preview &#x2014; all in a simple, accessible display.<br><br>&#x2022; Click-through ratio (CTR) for links in messages - check statistics on links clicked in your messages.<br><br>&#x2022; GetResponse blog module - view GetResponse blog posts, now available directly from the dashboard.<br><br>______________________________________________________<br><br><br>Feel free to email us at mobile@getresponse.com if you have suggestions or ideas about the app.<br><br>______________________________________________________<br><br><br>ABOUT GETRESPONSE<br><br>GetResponse is a complete email marketing platform, with tools for building complete marketing programs from start to finish in one place. The platform includes innovative features such as responsive design, landing page creator, email analytics, autoresponders, and smart list import. Its user-friendly interface, best-in-class 99.5% deliverability, and 5-star customer service make it the top solution in the market.  The platform is available in 19 languages and serves more than 350,000 customers from 193 countries, delivering 12 billion emails per year.",
    "histogram": {
        "1": 98,
        "2": 58,
        "3": 143,
        "4": 429,
        "5": 1549
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/VGQiKBFeOOdfCh5HepzKBm8QY4GiLF_4AUJN8I8xiu-dBpuaGWV-YXkNoIiw49CZAXQ=h310",
        "//lh3.ggpht.com/27Z6hiMClYyTCrqfKpgxerIEfs5xQaJqXxR9LznpYE0viGw8tVVOjVDdSGx1utnm6SQ=h310",
        "//lh6.ggpht.com/gaoxwS4S2BIzxjXHQHPxcP1p7NX6qiiQf8QLSJjL952n_--vvXYfJzZrSgzTJIljnLY=h310",
        "//lh3.ggpht.com/2Y3NodxV4kO6pRLwqhuD4m_1ojf9XAFeVzzQ2Hmpm5N6Il4zQCWnaOhRYwqDLXpCQjw=h310",
        "//lh5.ggpht.com/XS9mWIR-RHpaVo-tC_PHAXLp0fdSojtBobw8AfqvRxTS2U9TcpUuqTze-0nepwzvPw=h310",
        "//lh5.ggpht.com/iG7MP53pCpLUaRHC4lxeUk0dIpNgOLFH8QhqjBlYq6b_PPSRrrSj2Y70oVf0JeivgA=h310",
        "//lh3.ggpht.com/ca4eeXFk3aqLLackOg4q9eALinFlFCDTY_5IiFECjwWzTf-3pH5dxIEvU6dScIRRc6c=h310",
        "//lh4.ggpht.com/0z8qNL1l2v1acY9ah0KZheu41CJWKx80LfGKBbUUjIqqtxU-iCikTxAe-TaYhYlJv40q=h310",
        "//lh3.googleusercontent.com/hs7E5Hcmf4Fia_YcXVffjUfU04Mis74vIn8aWp-K855dLNcpZ9o0c7vjh97_5zsqxog=h310",
        "//lh3.googleusercontent.com/FrsJE5EOMnaNWPnWgw6DokOU9khEHGKprVbuLDWUS0G_mvokXNGaGb49AQiQfbJWA5k=h310",
        "//lh3.googleusercontent.com/yQH9ufB9tYCdJjlBvUKr_8KQ6EMcakoYejTyYkgKliPF7NVel4tLVgAOIgUvbS293pc=h310",
        "//lh3.googleusercontent.com/aPFnrbgXkZXndUceygCaSGhms7onjhvdmY0C_hev1X0rp3lVjJBoFPVUULucT7c2d04=h310",
        "//lh3.googleusercontent.com/PGO2ECwVotODmcP2TGzJdArqL1hQkjHAdcMvAppt-v3PWguuz-XFIeVsr-0PprHrGrlg=h310",
        "//lh3.googleusercontent.com/GhtLzbcd3kyP4xbGESt6G5yqPsweTECPAM5MWkxrIx1T93QBE6EYz1Un8lJH7bxf0fg=h310",
        "//lh3.googleusercontent.com/isfS21X_rc8v_4bICMrju6mng6QHn81oxtlGT4qBBUmrULxo8g0S1SoIldxkwSYV51lm=h310",
        "//lh3.googleusercontent.com/Ek4dgQ67QEbT3El10Kkr-9yfkyUFrkTPlPTHQ5pdqn1kXH04BEHAzFjvV4dh-orAuQ=h310",
        "//lh3.googleusercontent.com/2ycQrPbqJupYEz-6RgmTfXGp8uJAF_bVQpMU8xmG3HSJlvqujIKVz5Jt_LROPcDVXOUx=h310",
        "//lh3.googleusercontent.com/MKTgslXBm2Id27SFa3ooEAWXC0XDQG6EJQK7IoGIl-NCQ5EkYQjn7_mwhRnjJdfO1g=h310",
        "//lh3.googleusercontent.com/kmEwJsbtlhUzENbk_DmDzK9GNbOcDxh-rukkjXhKZ2i1_k2hevKQjBDfVxQUdSKaalCp=h310",
        "//lh3.googleusercontent.com/G5AzaSZxxHOgmQ6wIqZadh0iqhzki9PfdUgVBP-rUc5Oyjox6NrW2FceQUjdORzvdZk=h310"
    ],
    "video": "https://www.youtube.com/embed/IYrKpPlF3Po",
    "comments": [
        "End up coming back after I left aweber, aweber is too complicated it was a waste of my time that why I'm back with getresponse easier and love the landing page newsletter. Thank God I made the right choice.",
        "This App is the Leader in my opinion of Marketing And Organizing .Is an asset to all business Incorporated, Etrapraneuer, Sole Proprietorship. They got us all covered .",
        "I wish we could edit our autoresponder emails from the app.",
        "Well trying using this up think its very good",
        "Its nice!! very useful in monitoring my daily added subscriber👍👍👍",
        "Nice app. Works flawlessly and show the basic statistics of the campaigns."
    ],
    "recentChanges": [
        "Improved app performance and bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.implix.getresponse&hl=en&gl=us",
    "appId": "com.implix.getresponse"
}