{
    "title": "OUI.sncf - Train travel",
    "summary": "Book and change your tickets",
    "icon": "//lh3.googleusercontent.com/wdcbdFVDUd0PbYXlN0yps2zELuYQOWBxTQT5KL5BMcRIpol8ISbXm-A-fMmipr_ZVw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.1,
    "reviews": 90544,
    "developer": "OUI.sncf",
    "developerId": "OUI.sncf",
    "developerEmail": "vscmobile@serviceclient.oui.sncf",
    "developerWebsite": "http://www.oui.sncf ",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "size": "Varies with device",
    "description": "OUI.sncf, THE NEW NAME FOR VOYAGES-SNCF Say OUI to all your travel desires. We continue to bring you more clarity, more support and more services.  We are keeping everything you love and improving the rest.OUI.sncf promises to be your favourite travel companion.OUI.sncf, EVEN SIMPLER TO BOOK YOUR TRAIN TICKETS WITHIN FRANCE AND ACROSS EUROPE. Book, change and cancel your journeys directly from your OUI.sncf app. Expert services? No. 1 travel partner for the past 15 years - more and more practical, personalised and quicker all the time. Find out why 12 million travellers prefer our app. EFFORTLESS TRAVEL AT THE BEST PRICE - Download the app for free - No need to register to check timetables or buy tickets - Safely book, change or cancel your journey in seconds - We choose the best journey for you: The shortest, cheapest and most comfortable - E-ticket, M-ticket... get everything you need to travel on your app - Want to make a booking and pay later? That’s possible: - If you wish, you can create a customer account and book in just 3 clicks!- Take advantage of the SNCF loyalty scheme on your mobile: Earn SNCF loyalty points by adding your card number or promo code to your order. - Make the most of your SNCF card by travelling with TGV Lyria (for example) for lessA MADE-TO-MEASURE APP - Find all your recent journeys- Access your own personal low prices- Using your client account, you only have to put in your preferences, promo cards and SNCF loyalty card numbers once - Season tickets, friends, family... we save all the information to save you time - It’s your space, personalise it with your choice of photos RELAX, WE’VE GOT THIS FOR YOU! - Your favourite searches are displayed on your home page - Location finder: We find your nearest station - We send you reminders of your timetable, seat number and platform information - Your reservation is about to expire...? The app will warn you! YOUR TRAVEL DATE HAS ARRIVED...? - Off you go! No need to validate your M-ticket / E-ticket - Your M-ticket is available in your app, under “My Tickets” - All the info about your journey is available on your mobile - Access real-time travel information on your day of departure - Share information about your journey on Facebook, WhatsApp, Twitter and other social media- Out of battery? Don't worry, take your identity document to the conductor s they can find your e-reservation. NEED A HAND? - Customer service: By e-mail or phone, we will always find a solution. - Social networks, a practical way of getting a response to your questions. We guarantee to answer you on Twitter within 2 hours via our account: @clt_ouisncf. - Our Help section might have the answer for you, feel free to check there at any time. OUR NETWORK - Go wherever you fancy, as our network serves more than 4000 stations in France and Europe. - Visit all of Europe: France, with SNCF; England, on Eurostar; Spain with RENFE; Belgium and the Netherlands, with Thalys; Ital,y with SVI and Switzerland, with TGV Lyria...",
    "descriptionHTML": "OUI.sncf, THE NEW NAME FOR VOYAGES-SNCF <br>Say OUI to all your travel desires. We continue to bring you more clarity, more support and more services. <br> We are keeping everything you love and improving the rest.<br>OUI.sncf promises to be your favourite travel companion.<br><br>OUI.sncf, EVEN SIMPLER TO BOOK YOUR TRAIN TICKETS WITHIN FRANCE AND ACROSS EUROPE. <br>Book, change and cancel your journeys directly from your OUI.sncf app. Expert services? No. 1 travel partner for the past 15 years - more and more practical, personalised and quicker all the time. Find out why 12 million travellers prefer our app. <br><br>EFFORTLESS TRAVEL AT THE BEST PRICE <br>- Download the app for free <br>- No need to register to check timetables or buy tickets - Safely book, change or cancel your journey in seconds <br>- We choose the best journey for you: The shortest, cheapest and most comfortable <br>- E-ticket, M-ticket... get everything you need to travel on your app <br>- Want to make a booking and pay later? That&#x2019;s possible: <br>- If you wish, you can create a customer account and book in just 3 clicks!<br>- Take advantage of the SNCF loyalty scheme on your mobile: Earn SNCF loyalty points by adding your card number or promo code to your order. - Make the most of your SNCF card by travelling with TGV Lyria (for example) for less<br><br>A MADE-TO-MEASURE APP <br>- Find all your recent journeys<br>- Access your own personal low prices<br>- Using your client account, you only have to put in your preferences, promo cards and SNCF loyalty card numbers once <br>- Season tickets, friends, family... we save all the information to save you time <br>- It&#x2019;s your space, personalise it with your choice of photos <br><br>RELAX, WE&#x2019;VE GOT THIS FOR YOU! <br>- Your favourite searches are displayed on your home page <br>- Location finder: We find your nearest station <br>- We send you reminders of your timetable, seat number and platform information <br>- Your reservation is about to expire...? The app will warn you! <br><br>YOUR TRAVEL DATE HAS ARRIVED...? <br>- Off you go! No need to validate your M-ticket / E-ticket <br>- Your M-ticket is available in your app, under &#x201C;My Tickets&#x201D; <br>- All the info about your journey is available on your mobile <br>- Access real-time travel information on your day of departure <br>- Share information about your journey on Facebook, WhatsApp, Twitter and other social media<br>- Out of battery? Don&apos;t worry, take your identity document to the conductor s they can find your e-reservation. <br><br>NEED A HAND? <br>- Customer service: By e-mail or phone, we will always find a solution. <br>- Social networks, a practical way of getting a response to your questions. We guarantee to answer you on Twitter within 2 hours via our account: @clt_ouisncf. <br>- Our Help section might have the answer for you, feel free to check there at any time. <br><br>OUR NETWORK <br>- Go wherever you fancy, as our network serves more than 4000 stations in France and Europe. <br>- Visit all of Europe: France, with SNCF; England, on Eurostar; Spain with RENFE; Belgium and the Netherlands, with Thalys; Ital,y with SVI and Switzerland, with TGV Lyria...",
    "histogram": {
        "1": 4506,
        "2": 2721,
        "3": 8393,
        "4": 34224,
        "5": 40700
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/C3lObbTkvg04KjTf3upBYkyNto76LK5V8i2tnYPwD2ykMVMqmlMC84SCVCXv4Sxjk00=h310",
        "//lh3.googleusercontent.com/IN6w2ZMyvlYkYln8ohGYOQ31LsZIE9H8Y0rGIyjaaAe8u2miqoFJydraeI1-B28XaJoY=h310",
        "//lh3.googleusercontent.com/gDzeBxn1w7CkcDbaVC8DUMpP6AWCwNXStlE7N3NQoialwfmx2A4mNikknT9dgoWjUjs=h310",
        "//lh3.googleusercontent.com/77s5Tum8TTIwFhV5jrRohPznCBopzsukhEhyYAupvXelWj_xGaEeLE9Vu9UYEndPM1Q=h310",
        "//lh3.googleusercontent.com/0e8mzjSX3HD64AqDiapb5bKF9nZnwDiBeS4-_FAZWGeFANG6zddgPGcp3B9y50tfhzM=h310",
        "//lh3.googleusercontent.com/LeCQmcLEyCjdD8AHRGAcijXSLdSfhBFNL5Yn36kWSJbFbARoIqwKsCXfCfo8fWZZWFUU=h310",
        "//lh3.googleusercontent.com/uZWqIrC41GAlgf3pOJq5Frp2WPYA5XgC2Uc9-DVlo9PBufyZi2JV2_XXGpTErWTDtJ4=h310",
        "//lh3.googleusercontent.com/YtLbFhbvOZhch_M2N80IqaXNA3kAd6COHW4zlSmxQwRp6JsHEjLu-IkpPBIxMryytQ=h310",
        "//lh3.googleusercontent.com/0osptk9R-aTnEVIZ4B2ycpqy-kuR0Pp6S3j-Ib6Y33EAlOkBlU4F7EYKFYvdFfE8_g=h310",
        "//lh3.googleusercontent.com/izS5NKssSzaED77cu3UuISiH2ksTqOnaU5pQSh9Dvu73iqPKNF0CXtI6KB19ks4tuw=h310",
        "//lh3.googleusercontent.com/PB6ZEV-YZXaJg00at2OeIuZVFY4lvttCXV35DfqP9wadny84GEit5PF-lp3XSND8Inhu=h310",
        "//lh3.googleusercontent.com/VXlTlWRlqllzE59RT8EMzEXczpPbxLZ1USB4AKm30VIZHUGY9u1fcPc4LlYjKConHiA-=h310",
        "//lh3.googleusercontent.com/wxMgD_kmZ4jOULaYy7yLmlfl1uRuJpMDExljg4gnCkVALzCB5TlTGK8-5xYIHoQ9XVI=h310",
        "//lh3.googleusercontent.com/af2Ed5ZJn3qsOqlxWfNZPhZx-r-Vt1N1gmjNIxaIdjQU8eRAL3GHvG8FqjTmw1SzjeY=h310"
    ],
    "video": "https://www.youtube.com/embed/rpWSYK_Ntek",
    "comments": [
        "User friendly and reliable.",
        "Nice",
        "The app is ok. The problem is that SNCF has two apps that offer intersecting functionalities and do not communicate with each other. So you never know which one to use and have to think of updating, e.g.,  your discount card information in each one separately.  The new version starts by itself on phone startup, then drains the battery without doing anything useful.  Ticket exchange with Carte week-end works every other time at best -- had to go to a train station to make the change.",
        "The application triggers my GPS and it never stops even after closing the app. I have to reboot my phone after each use if I do not want my battery to be empty in 3h. Even more energy consuming than the mobile games and screen together.",
        "App and website interface sucks. Majority of the options dont work properly",
        "Application agréable"
    ],
    "recentChanges": [
        "Redesign of the My Account section",
        "We have reworked the layout of the My Account section in order to help you manage your particulars, those of your co-passengers and your travel preferences more easily. Did you know that having a fully completed profile will save you time when making your next booking?",
        "Recent searches",
        "Restart your last search in one touch from the home page on your app. A new feature that will help you save time with your searches.",
        "Bus:  right on your search results page."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.vsct.vsc.mobile.horaireetresa.android&hl=en&gl=us",
    "appId": "com.vsct.vsc.mobile.horaireetresa.android"
}