{
    "title": "Hangouts",
    "summary": "Hangouts - free messaging, video, and voice",
    "icon": "//lh6.ggpht.com/5puZavg4x2pThSTJgos1sARWoARea7tzr_B8AWEwn2lV05RoXo9M8BM2XwcvwG6nIGc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000000,
    "maxInstalls": 5000000000,
    "score": 4,
    "reviews": 3246177,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "apps-help@google.com",
    "developerWebsite": "https://support.google.com/hangouts/?p=androidhelp",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "January 25, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Use Hangouts to keep in touch. Message contacts, start free video or voice calls, and hop on a conversation with one person or a group.  • Include all your contacts with group chats for up to 150 people. • Say more with status messages, photos, videos, maps, emoji, stickers, and animated GIFs. • Turn any conversation into a free group video call with up to 10 contacts. • Call any phone number in the world (and all calls to other Hangouts users are free!). • Connect your Google Voice account for phone calling, SMS texting, and voicemail integration. • Keep in touch with contacts across Android, iOS, and the web, and sync chats across all your devices. • Message contacts anytime, even if they’re offline.  Notes: Mobile carrier and ISP charges may apply. Calls to Hangouts users are free, but other calls might be charged. View our calling rates at https://www.google.com/hangouts/rates",
    "descriptionHTML": "Use Hangouts to keep in touch. Message contacts, start free video or voice calls, and hop on a conversation with one person or a group. <br><br> &#x2022; Include all your contacts with group chats for up to 150 people.<br> &#x2022; Say more with status messages, photos, videos, maps, emoji, stickers, and animated GIFs.<br> &#x2022; Turn any conversation into a free group video call with up to 10 contacts.<br> &#x2022; Call any phone number in the world (and all calls to other Hangouts users are free!).<br> &#x2022; Connect your Google Voice account for phone calling, SMS texting, and voicemail integration.<br> &#x2022; Keep in touch with contacts across Android, iOS, and the web, and sync chats across all your devices.<br> &#x2022; Message contacts anytime, even if they&#x2019;re offline.<br> <br> Notes: Mobile carrier and ISP charges may apply. Calls to Hangouts users are free, but other calls might be charged. View our calling rates at https://www.google.com/hangouts/rates",
    "histogram": {
        "1": 394145,
        "2": 144820,
        "3": 357433,
        "4": 525156,
        "5": 1824623
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/inqFU3HtbQewA_wFJqb0lTZZ8lfwkzuna1G7NT4rcy5-rjdTu5PVP6AGsNfEEQIuCANa=h310",
        "//lh3.googleusercontent.com/WY2lFDdnk3UpR0VCGpurLvTMn9kSsO2dimc6WyUMhJsza7ULL3ABVTeOj29EoaUXAw=h310",
        "//lh3.googleusercontent.com/PsorBk7XJ9UiYSWCPdTk1VlOhzP1XUB87Yb5waZJRhUvBkXyl3vd25KB-FNSsu150no0=h310",
        "//lh3.googleusercontent.com/lot00hbg5S4dc-EUropC4p6BQ1VxW7xllJIoJJPS37voKqRsc1JonBnuZcUx8W36zM0=h310",
        "//lh3.googleusercontent.com/JSpX0jvQy4dWRIH72wz_HMUdJCt7pqWxCmzxBAlcmDYk9iBLgM7tmfsHcakiBbxWcKo=h310",
        "//lh3.googleusercontent.com/HcNhEMaXyzrlcwDAI5jVJHv9fdzo981WIlDO2off8oGMfBdvBq8vk_C8qjvZusI1m_Nu=h310",
        "//lh3.googleusercontent.com/KD_ej5ZB7typNmdMxF98-e7LKC3Si9nJk2y1uxGkFJ4xFq-QoAnLFpJ9fvHFba2-tBk=h310",
        "//lh3.googleusercontent.com/bVN3PynCtMgjMw45ikOUds8LRxlrKxboV7NiOBzJuwVT-jdbjdgnwhsBnyIcU3xyEg=h310",
        "//lh3.googleusercontent.com/RcKpQ3Zm03yaKTq2iZTFkTvVthOYpXoic7gsFkF8pCMB3mh85npY27StdiR81ZeYlXQ=h310",
        "//lh3.googleusercontent.com/3C8bQcuUdsVCPB7DXygmErU1zcvkd1-KNtVOwjqklSxdgJV-7G6Cxp7TdUEvx1LwrpFh=h310"
    ],
    "comments": [
        "Its an ok app its simple and easy to use. I dont like the idea of not seeing contacts online, offline or if they idle the app. It wastes time messaging hoping they reply. If there was online status it would be easy to know the person is not available.... the video calling has bugs like hell. Please fix",
        "It's pretty good. I like it, but where does all the other folks come from on here ( Hangouts ). I've had wemen just hit me up out of nowhere. And the majority of them clam that they are over in some African country overseas doing some kind of Mission work for churches or just for their religion. And there parents and family are still over here in the states.",
        "Brings back very good memories. I met the love of my life threw Hangouts. I still use it to text him if my texting app doesn't work, and we call every day using Hangouts. I love video calling him. Can you please fix the issues with the camera? When I video call him sometimes I wanna show him threw my camera, but I can't because my camera goes on and off randomly, and there is no indication of this. The only way to know is if the person ur calling tells u. We both have Android phones and it happens to both of us. Plz fix it",
        "Hangouts is amazing and pretty much superior to any similar system. Aside from the occasional bugs and so on (which might be my fault), I absolutely love it. Edit 2/16/18: recently Hangouts has been lagging and bugging out. I'm not sure why but I've taken the review down to 3 stars because of that.",
        "I have been using telegram, whatsapp, line, fb messenger... Now stuck with hang out coz it is easier to use to reach someone on gmail. And took a while for me to see if someone is online or not, and sometimes even when they do it just says \"active just now\" nothing precise/direct info like is he online now or not. Other perks whatsapp have i wish hangout does too are direct reply to particular message/and doodling tool for the picture. So good luck",
        "Major Pet Peev w/ any App is missing or useless changelogs! The video really needs work, or it used to. Was so bad, turned me away from video. A shame cause my half sister is deaf. Its good for its purpose. I use the dialer more than the messaging."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.talk&hl=en&gl=us",
    "appId": "com.google.android.talk"
}