{
    "title": "VIP Access",
    "summary": "Use Symantec™ Validation &amp; ID Protection to protect your online accounts.",
    "icon": "https://lh5.ggpht.com/BSvKYSGcqIWOnYGTAIienBedwHAKzsH7Fkd_ASjNJEIC63_nphFm-ft7zs2PuW_tKA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.9,
    "reviews": 8397,
    "developer": "Symantec VIP",
    "developerId": "Symantec+VIP",
    "developerEmail": "vip_mobilesupport@symantec.com",
    "developerWebsite": "http://m.vip.symantec.com",
    "updated": "January 31, 2018",
    "version": "Varies with device",
    "genre": "Tools",
    "genreId": "TOOLS",
    "size": "Varies with device",
    "description": "Symantec VIP Access helps protect your online accounts and transactions by using a strong authentication process when you sign in to your VIP-enabled accounts.\t•\tStrong authentication: Provides strong, two-factor authentication when logging into your VIP-enabled accounts. •\tVIP Access Proximity: Securely lock and unlock your computer using your mobile device. •\tQR/App Code: Scan a QR Code to generate site-specific security codes for strong two-factor authentication to your favorite websites.Use VIP Access at participating organizations such as eBay, PayPal, E*TRADE, Facebook, Google, or any one of the hundreds of sites within the VIP Network: : https://vip.symantec.com FeaturesStrong AuthenticationVIP Access adds strong authentication to your normal login in one of the following ways: •\tDynamically generate a one-time use security code on your mobile device. Use that code along with your username and password.•\tReceive a push notification on your mobile device that you approve as authentication. If your organization requires you to define an additional device authentication mechanism to meet the security requirements, you will be prompted for the additional local authentication such as PIN, pattern, password, or fingerprint.•\tUse fingerprint or your security code in a push notification to authenticate yourself on your mobile device.Note: Fingerprint authentication requires that your mobile device is fingerprint capable and that you have registered a fingerprint on the device.The strong authentication method you use depends on the method implemented by your participating organization.You can generate a security code even if you do not have a network or mobile connection.VIP Access Proximity (requires Mac)When used with the VIP Access for Desktop app, VIP Access can securely lock and unlock your Mac computer with your mobile device. VIP Access will use your mobile device as a credential to unlock your computer when you are close to it, and to lock it when you move away. •\tFor greater security, you can require a fingerprint or push notification, in addition to device proximity, to unlock your computer•\tUsing VIP Access Proximity, you can send your push notifications to a paired computer by enabling settings through the Proximity screen.To use VIP Access Proximity feature, download and install the VIP Access for Desktop on your computer from https://vip.symantec.com QR/App CodesScan a QR Code at participating organizations such as Google, Facebook, Amazon, and more to generate a security code every 30 seconds to securely sign in. Enter this security code along with your password to add strong authentication to your favorite websites.Be sure to read the VIP End User Agreement after downloading VIP Access: ",
    "descriptionHTML": "Symantec VIP Access helps protect your online accounts and transactions by using a strong authentication process when you sign in to your VIP-enabled accounts.<br>\t<br>&#x2022;\tStrong authentication: Provides strong, two-factor authentication when logging into your VIP-enabled accounts. <br>&#x2022;\tVIP Access Proximity: Securely lock and unlock your computer using your mobile device. <br>&#x2022;\tQR/App Code: Scan a QR Code to generate site-specific security codes for strong two-factor authentication to your favorite websites.<br><br>Use VIP Access at participating organizations such as eBay, PayPal, E*TRADE, Facebook, Google, or any one of the hundreds of sites within the VIP Network: : <br>https://vip.symantec.com<br> <br>Features<br>Strong Authentication<br><br>VIP Access adds strong authentication to your normal login in one of the following ways: <br>&#x2022;\tDynamically generate a one-time use security code on your mobile device. Use that code along with your username and password.<br>&#x2022;\tReceive a push notification on your mobile device that you approve as authentication. If your organization requires you to define an additional device authentication mechanism to meet the security requirements, you will be prompted for the additional local authentication such as PIN, pattern, password, or fingerprint.<br>&#x2022;\tUse fingerprint or your security code in a push notification to authenticate yourself on your mobile device.<br>Note: Fingerprint authentication requires that your mobile device is fingerprint capable and that you have registered a fingerprint on the device.<br><br>The strong authentication method you use depends on the method implemented by your participating organization.<br><br>You can generate a security code even if you do not have a network or mobile connection.<br><br>VIP Access Proximity (requires Mac)<br><br>When used with the VIP Access for Desktop app, VIP Access can securely lock and unlock your Mac computer with your mobile device. VIP Access will use your mobile device as a credential to unlock your computer when you are close to it, and to lock it when you move away. <br><br>&#x2022;\tFor greater security, you can require a fingerprint or push notification, in addition to device proximity, to unlock your computer<br>&#x2022;\tUsing VIP Access Proximity, you can send your push notifications to a paired computer by enabling settings through the Proximity screen.<br><br>To use VIP Access Proximity feature, download and install the VIP Access for Desktop on your computer from https://vip.symantec.com <br><br>QR/App Codes<br><br>Scan a QR Code at participating organizations such as Google, Facebook, Amazon, and more to generate a security code every 30 seconds to securely sign in. Enter this security code along with your password to add strong authentication to your favorite websites.<br><br>Be sure to read the VIP End User Agreement after downloading VIP Access: ",
    "histogram": {
        "1": 1285,
        "2": 395,
        "3": 754,
        "4": 1402,
        "5": 4561
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/f2Ekk6qVXcsOSZuJNSWwbvQmuPUt8BSvVO-qs5hR7JKK2FV0KEp1dO1WaPiDPGtVKg=h310",
        "//lh3.googleusercontent.com/gwlGIH730EB1i_Gx0_uFGLx2lfrAb1KXt8kswuSV1-S4YEN_mo_GaquBW00kOy-JGxI=h310",
        "//lh3.googleusercontent.com/ImURkGKABTLGsYZECJ4AYNsGddEqf3LhGxY8iutMTu0axIiKZYQWRKeSvdrMVY9H5tY=h310",
        "//lh3.googleusercontent.com/nMg1r8yjcu2ipdYOvUkESVYOTUes-xrvDDsZbnqKjjN5UzoZueEEBuqhs55mfQlgUHSv=h310",
        "//lh3.googleusercontent.com/yGzqJHm-7bL7LEvH6wL47gduioju6q8MY3D6j2mMRnCqmLg66kerlnQrM3RxlBfzdw=h310",
        "//lh3.googleusercontent.com/ue-kFTKZ3CMvgunph6U90Cjos0edA0x3BAFSzPHlh09RP-fi69D1QnrFQduHb72xvWkM=h310",
        "//lh3.googleusercontent.com/jv4tmS5qfGPYtS0m9Uu4ZMmp_N7878XjWgayEGu1baMiTsczt3_dcR62So2BeCzdxA=h310",
        "//lh3.googleusercontent.com/PCv0Te4v1joqXWO5HengEIniV0CJ_Cey-EXj8CnSGRJJ3WKVg_HGilCf2mPzc2wNbw=h310",
        "//lh3.googleusercontent.com/AgYIaBRWUd0JTHLVv2GEeMmzjRrVVp-RLhaVz4SrdC0PnNnDvzJJQsY9dGoEjj8ZDQ=h310",
        "//lh3.googleusercontent.com/j0WGAC5Ef4tU7juSuNorg_zyBPQSjGUg0AuE88WrbTuNL1reU_N7ykoYuLCf09vY3m8=h310"
    ],
    "comments": [
        "Why can't I disable \"full network access\"? This app doesn't need network access at all. Also sad it's not open source, don't know what it is doing.",
        "On my tablet I have to keep reinstalling it. Works fine on phone but I want a backup device if phone isn't working.",
        "I am not getting approve option in notification in my android mobile. Every time I need to click on notification and it goes to app and there I need to click on right(✔️) option. Please provide me solution for this. I need notification with approve option.",
        "Bloated. Unnecessary, annoying visual effects that delay the function of the app.",
        "Visual effects unnecessarily delay the display of the code",
        "Verification approval request token stopped working since couple of months which was a key feature and very quick way to authenticate"
    ],
    "recentChanges": [
        "What's New in Version 4.1.2",
        "This release has the following updates:",
        "•\tSecurity enhancements and bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.verisign.mvip.main&hl=en&gl=us",
    "appId": "com.verisign.mvip.main"
}