{
    "title": "Potential Beta",
    "summary": "Potential syncs battery, WiFi and Bluetooth status across all your devices.",
    "icon": "//lh3.googleusercontent.com/lVxt3HNXzBaP9MfQ1CGZdRQZVMKRgXXnMIrXFrO-WoLeAdPig-YIbuWsSJDK1a77_xQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.6,
    "reviews": 979,
    "developer": "Paranoid-Gems",
    "developerId": "Paranoid-Gems",
    "developerEmail": "contact@paranoidgems.com",
    "developerWebsite": "http://www.paranoidgems.com",
    "developerAddress": "SMQ-139/5, AFS Chimney Hills, Bangalore, India",
    "updated": "April 12, 2015",
    "version": "0.9.2",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Note: We'll be rolling out a major update this Jan(2017) to fix most of the issues and improve overall user experience.Potential syncs battery, WiFi and Bluetooth status across all your devices.Forgot charging one of your devices? It’s not an issue any more. Get a notification whenever the battery of any of your devices is running low. You do not have to worry about keeping an eye on all your devices. We will inform you immediately if the battery of any of your devices falls below a threshold level.It often happens that one forgets to disable Bluetooth/WiFi after using it. Worry no more, you can now disable these battery consuming services anytime and from anywhere with just a single tap on the screen.You can also use Chrome extension to monitor your devices. Get the extension from here. http://goo.gl/7xkG5VTo start using just log in using the same credentials on all your devices.List of features available:● Low battery notifications● Remotely disable WiFi/Bluetooth● Ring my device● Material design● Android wear support● Widget● Chrome extensionKnown Issue:  Crashes frequently on HTC One M8. This needs some more time.NOTE: Since this app is currently in public beta, please report crashes by clicking on report button. This helps us in debugging the actual issue. You may also add a custom message about the circumstances under which the app closed. You can also recommend features by using our in-app contact us feature.ATTENTION\"Potential\" is an Early Access title. It is currently still under heavy development with new features being added. Currently there will be bugs, locked off content, missing features and other breaking issues. Early Access includes the full app when it releases and all future updates. Joining us in Early Access now will help support the cause and ensure continued expansion of the development team, their efforts and the planning and addition of even more features and depth eagerly awaited by fans. The app is updated quite frequently - and it's changing a lot.",
    "descriptionHTML": "<b>Note: </b>We&apos;ll be rolling out a major update this Jan(2017) to fix most of the issues and improve overall user experience.<br><br>Potential syncs battery, WiFi and Bluetooth status across all your devices.<br><br><br>Forgot charging one of your devices? It&#x2019;s not an issue any more. Get a notification whenever the battery of any of your devices is running low. You do not have to worry about keeping an eye on all your devices. We will inform you immediately if the battery of any of your devices falls below a threshold level.<br><br><br>It often happens that one forgets to disable Bluetooth/WiFi after using it. Worry no more, you can now disable these battery consuming services anytime and from anywhere with just a single tap on the screen.<br><br><b>You can also use Chrome extension to monitor your devices. Get the extension from here. http://goo.gl/7xkG5V</b><br><br><br><b>To start using just log in using the same credentials on all your devices.</b><br><br><br><b>List of features available:</b><br>&#x25CF; Low battery notifications<br>&#x25CF; Remotely disable WiFi/Bluetooth<br>&#x25CF; Ring my device<br>&#x25CF; Material design<br>&#x25CF; Android wear support<br>&#x25CF; Widget<br>&#x25CF; Chrome extension<br><br><br><b>Known Issue: </b> Crashes frequently on HTC One M8. This needs some more time.<br><br><br><br><b>NOTE</b>: Since this app is currently in public beta, please report crashes by clicking on report button. This helps us in debugging the actual issue. You may also add a custom message about the circumstances under which the app closed. You can also recommend features by using our in-app contact us feature.<br><br><br><b>ATTENTION</b><br>&quot;Potential&quot; is an Early Access title. It is currently still under heavy development with new features being added. Currently there will be bugs, locked off content, missing features and other breaking issues. Early Access includes the full app when it releases and all future updates. Joining us in Early Access now will help support the cause and ensure continued expansion of the development team, their efforts and the planning and addition of even more features and depth eagerly awaited by fans. The app is updated quite frequently - and it&apos;s changing a lot.",
    "histogram": {
        "1": 143,
        "2": 79,
        "3": 138,
        "4": 239,
        "5": 380
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/dNj5z2oJX3cfnuLTMyDlMM2I5GnQuBK9n6xyTSfTw9Cpvtqpivd0fL8jNJh704gj4_O_=h310",
        "//lh5.ggpht.com/gWvG2P0FJPjAXxrE-hekuz-nNiBn7rd5pLvfv0foHXWGG0ug0W2XBlxfHTT2noyNCPQ=h310",
        "//lh3.ggpht.com/EqzTOY1SkxCtl9A-PxWRxTuYguJ2UcVF271EgIy7eoIcoX2p44U0z95eOhcteDGMg98=h310",
        "//lh5.ggpht.com/90eTdEEd1ZNIpYzMezkjG1yI0qmwYSqscbMl2q9CzfF6Kl_cvp8uWH5V1WvQ0GfKpGk=h310",
        "//lh5.ggpht.com/VMI6PWv31Yn23gVC_IyKEPgD5qyzAMi4tQQa_kDe-6J-6iMu1GMIFnDtZxENrGFinN7d=h310",
        "//lh5.ggpht.com/3yoP1SVk3nivcawBOXxCBvyvINrWSCVJBTJasYVNhBFbvDS6thbPj6rHluUFYBK6Zw=h310"
    ],
    "comments": [
        "Kind of works I'm having some trouble getting it to work with my htc one m8 and my kids htc one m7's. I'm hanging in there though hoping for some updates. Is there any plans to include more device control such as volume control or other settings? Thanks.",
        "Worked after installing and logging in (Samsung Note 3 + Tab 2) but fails to update. Both devices show \"Updated x days ago\" and a manual refresh (pull down) is not resolving it. App is active on both devices and both are connected over Wifi. After a week of use, no updates at all and uninstalled",
        "Dont read the low star reviews This is a BETA app people. It worked great for me. To others, it hasn't. But isn't it the point of a beta? To learn your bugs to fix? Spoiled and ignorant people rated it very low for it being a BETA!",
        "Battery drain Oddly enough this app cuts my battery life almost in half. I had to uninstall it because I could not get a long enough charge from my phone with it.",
        "Download it. It works. Most of it. This would be a 5star if the \"Ring this device\" feature worked. Everything else works as designed. Even on multiple devices. Matthew Baldwin... My review is positive, and I'm a real person. Anything else to add?",
        "Still constantly crashes on Nexus 6 and 7. Uninstalling, not worth it anymore, drains too much battery, never actually updates anything, never warns battery life anymore. It's useless.  It barely ever works anymore, constantly freezes and crashes. The only way to fix it was to re-install but who wants to do that 5 times a day.  maybe it needs a notification that will stop it from dying all the time."
    ],
    "recentChanges": [
        "v0.9.2",
        "* Updated third party libraries",
        "* Some bug fixes",
        "v0.9.1",
        "New Feature: Ring my device",
        "Some bug fixes",
        "v0.8.3",
        "Fixed background crash!",
        "Some performance improvements.",
        "v0.8.2",
        "* An attempt to stop background crash"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.paranoidgems.potential&hl=en&gl=us",
    "appId": "com.paranoidgems.potential"
}