{
    "title": "PayPal",
    "summary": "Quickly and securely send, receive, and spend money",
    "icon": "//lh3.googleusercontent.com/vIJ7bv0rBwc3IdHaocUXloyLhJR6_vGhpwQGpXMR3ZD8dK_OnXpzPgb2FSpXnol-QipG=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000000,
    "maxInstalls": 100000000,
    "score": 4.3,
    "reviews": 631007,
    "developer": "PayPal Mobile",
    "developerId": "PayPal+Mobile",
    "developerEmail": "app-feedback@paypal.com",
    "developerWebsite": "https://www.paypal.com/mobile",
    "updated": "March 2, 2018",
    "version": "6.22.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "TAP INTO YOUR MONEYSend money to almost anywhere in the world in just seconds. Manage all the ways you send, receive, and spend money at a glance - it’s all here.SEND MONEY IN SECONDSSend Money to PayPal account holders in over 100 countries using just their email address or mobile number. When the money arrives in their account (usually in seconds), they can spend the money online or withdraw it with just a tap. And it’s completely free when you send money to friends in the US from your bank account or PayPal balance.GET PAID WITH EASESend a request for money that allows people to pay you back with just a tap. Whether you’re collecting money for a group gift or something you sold online, we make it easy for them and even easier for you. STAY ON TOP OF IT ALLWhenever you send, receive, and spend money with PayPal, the app sends an instant notification to help you keep track of it all. Whether you use PayPal Credit, your balance, your bank, or your debit and credit cards to pay with PayPal - you can find everything and anything you need to simply manage it all in this secure app.",
    "descriptionHTML": "TAP INTO YOUR MONEY<br>Send money to almost anywhere in the world in just seconds. Manage all the ways you send, receive, and spend money at a glance - it&#x2019;s all here.<br><br>SEND MONEY IN SECONDS<br>Send Money to PayPal account holders in over 100 countries using just their email address or mobile number. When the money arrives in their account (usually in seconds), they can spend the money online or withdraw it with just a tap. And it&#x2019;s completely free when you send money to friends in the US from your bank account or PayPal balance.<br><br>GET PAID WITH EASE<br>Send a request for money that&#xA0;allows people to pay you back with just a tap. Whether you&#x2019;re collecting money for a group gift or something you sold online, we make it easy for them and even easier for you. <br><br>STAY ON TOP OF IT ALL<br>Whenever you send, receive, and spend money with PayPal, the app sends an instant notification to help you keep track of it all.&#xA0;Whether you use PayPal Credit, your balance, your bank, or your debit and credit cards to pay with PayPal - you can find everything and anything you need to simply manage it all in this secure app.",
    "histogram": {
        "1": 47787,
        "2": 16692,
        "3": 35878,
        "4": 101554,
        "5": 429096
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/3mjf2hlik_oMkmuR0MNg2H1zBCkUiswj1Jm9Wq9Sq5ocpIdyxKfs9emnzSoqp-yFVCey=h310",
        "//lh3.googleusercontent.com/ucXfulpT5JSwxYCxZcegL1qjxXcR1rhH248lH45U8ajm959stJJCLm2ivlq0fHQsAohw=h310",
        "//lh3.googleusercontent.com/4vMbBDHLmK4xwWbIhonzeISuY88XNTNT5a6mVpVWkzghEtyf7MMRoY1lXc7rkFQYH_w=h310",
        "//lh3.googleusercontent.com/FpdWi_Rp87SXG947h7ZECtMssgRjBE83BTcQLuLOePBDRcUlX34SD2Aq9ANZLrK8fQ=h310",
        "//lh3.googleusercontent.com/5S_gG0s4zGoUuoTAz6Lk0ewdIkH7bdURg-euqUSk82gu6_tdDiNCOS-aAiu-Jnhtf55T=h310"
    ],
    "video": "https://www.youtube.com/embed/M9lbTxgcg2U",
    "comments": [
        "Best way to keep up with purchases you make and the security is #1 download it if you don't have it !",
        "Waiting for the sweet buddy to send me 10$ to -  paypal/NKambli",
        "can someone send me $20 please PayPal.me/fohnz",
        "Good",
        "PayPal granted me $1,000 credit line a while back. They were easy to pay back as well as easy to use. However, this is being written at a point in time when I cannot access my own account no matter how many times I try. The phone number on the account will not update no matter how many times I tried to verify with pictures of me, me and my driver's license, and other forms of verification. It has become incredibly difficult to access this account. I'd like to keep using it, however I'm looking into other options being that I cannot access my account.",
        "I've only encountered a problem 1 other time in the 10+ years I've been using PayPal. I can choose who I'm sending funds to, I can choose an amount and whether I want g&s or f&f but then....nothing. I can't send funds at all. I can receive funds, which is great as I receive more than I send, but I can't refund or send money back if overpayment occurs. I'm not always able to get to my laptop which is why I use the app and I've talked with several people locally that are having the same issue. Please fix this as it is a huge inconvenience."
    ],
    "recentChanges": [
        "We made your payment details easier to read."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.paypal.android.p2pmobile&hl=en&gl=us",
    "appId": "com.paypal.android.p2pmobile"
}