{
    "title": "iBobber",
    "summary": "Meet iBobber—the fishfinder that syncs with phones and tablets for Android™.",
    "icon": "//lh3.ggpht.com/MGnQLGzVTYv7nm5e-8M268DcNkJ5oOLIyGmr0oNoASkzqdL9aoxOAoarMgdmOmoO1e0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.6,
    "reviews": 298,
    "developer": "ReelSonar",
    "developerId": "ReelSonar",
    "developerEmail": "Info@ReelSonar.com",
    "developerWebsite": "http://www.reelsonar.com",
    "developerAddress": "1818 Westlake Ave N Ste 232\nSeattle, WA 98109",
    "updated": "November 24, 2017",
    "version": "1.99",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "There’s a lot to love about iBobber. It syncs via Bluetooth Smart® version 4.0 and with phones and tablets for Android™ (version 4.3 and later) up to 100’ away from a shore, boat, kayak, or pier, so you have a fishfinder with a solid connection, that won't deplete your phone's battery like wi-fi does, a fishfinder that goes up to 10hrs on a charge, that's half the size and weight— a fishfinder that’s as mobile as you are. Even if you have a boat-mounted fishfinder, iBobber can free you from seeing fish only under your boat. Now with Smart Watch sync! The iBobber app can now sync between your phone/tablet and your Android Wear smart watch (LG GWatch, Moto 360, Sony SmartWatch 3, Samsung Gear Live, and Asus Zen Watch). Note: Phones and tablets for Android™ must have Android 4.3 and Bluetooth Smart 4.0 to sync with iBobber.Just cast the iBobber bobber (sold separately) and Ping! the iBobber app syncs via Bluetooth Smart and displays where the fish are. The iBobber app and iBobber bobber enable you to locate fish down to 135’, GPS Tag hotspots, map the waterbed contour, and measure water temperature.You can save all your fishing adventures with the Trip Log, and share them all on social media. You’ll also love the Lunar Calendar, Fish Alarm, Strike Alarm, LED Beacon, Weather sync, and the app’s stunning graphics.iBobber is for anyone who loves to find fish, and wants to catch more of them.  The iBobber app is designed for one-handed use, and can help make fishing more fun  than it's ever been. And finding more fish is always a lot  more fun than just fishing! Note: Bluetooth Smart is very clever technology and is different from Bluetooth® used in other fishfinders. Bluetooth Smart is designed for short messages from nearby devices such as temperature sensors, proximity sensors, and medical devices such as heart monitors, and now sonar signals. It does a really good job of keeping devices continually paired.iBobber App Features:Sonar ScreenLocate Fish at Depths down to 135ftDepth ScaleFish Tagged with Depth2 Fish Sizes: 15\" and under & over 15\"Waterbed foliageSonar Status DashboardBattery Status (up to 8hrs of charge)Water TemperatureFish Alarm (on/off)Strike Alarm (on/off/adjustable)Bobber LED beacon (on/off)Trip LogTap any GPS Tag button on any screen and the Date, Time, and Location of your trip auto-loads in Trip Log. Name your trip, tlog conditions and type of fishing. Log the lures fish are hitting, and species of fish you've caught. Share it all on social media with friends who are stuck back in the office.Date Time Location (GPS coordinates)TitleLureConditionsType of FishingFish Caught (type & number)NotesShare: Facebook, Twitter, Mail, TextAuto-Archives Trips; Linked with Calendar: tap past date and archived Trip Logs appearWaterbed MappingMap the contour of the bottom up to 100ft away, down to 135'.Lunar CalendarMoonrise / moonset Sunrise / sunsetProvides moon phases by day and date. And moon rise/set, sunrise/set— just tap today's date to see them.Linked with Trip Log; tap past date and archived Trip Logs appearWeatherGPS based and provides current temperature, estimated high/low temperature for today, percentage chance of rain, wind speed/direction, barometric pressure.SettingsBluetooth Smart® SyncImperial / Metric Sonar Demo Waterbed Mapping speed adjustment10 Languages (English, French, Spanish, German, Portugese, Russian, Japanese, Korean, Chinese, Arabic)Bobber SpecsSonar Depth:  Down to 135ft / 41mBluetooth Smart Range:  Up to 100 ft / 30mSonar:  Single Beam, 90º, 118 kHzPower:  Auto-On in waterUnits:  Imperial / MetricBattery:  3.7V RechargeableBattery Charge:  Up to 8 hoursSize:  59mm DiameterWeight:  47gm / 1.7ozAndroid is a trademark of Google Inc.",
    "descriptionHTML": "There&#x2019;s a lot to love about iBobber. It syncs via Bluetooth Smart&#xAE; version 4.0 and with phones and tablets for Android&#x2122; (version 4.3 and later) up to 100&#x2019; away from a shore, boat, kayak, or pier, so you have a fishfinder with a solid connection, that won&apos;t deplete your phone&apos;s battery like wi-fi does, a fishfinder that goes up to 10hrs on a charge, that&apos;s half the size and weight&#x2014; a fishfinder that&#x2019;s as mobile as you are. Even if you have a boat-mounted fishfinder, iBobber can free you from seeing fish only under your boat. <br><br>Now with Smart Watch sync! The iBobber app can now sync between your phone/tablet and your Android Wear smart watch (LG GWatch, Moto 360, Sony SmartWatch 3, Samsung Gear Live, and Asus Zen Watch). <br><br>Note: Phones and tablets for Android&#x2122; must have Android 4.3 and Bluetooth Smart 4.0 to sync with iBobber.<br><br>Just cast the iBobber bobber (sold separately) and Ping! the iBobber app syncs via Bluetooth Smart and displays where the fish are. <br><br>The iBobber app and iBobber bobber enable you to locate fish down to 135&#x2019;, GPS Tag hotspots, map the waterbed contour, and measure water temperature.<br><br>You can save all your fishing adventures with the Trip Log, and share them all on social media. You&#x2019;ll also love the Lunar Calendar, Fish Alarm, Strike Alarm, LED Beacon, Weather sync, and the app&#x2019;s stunning graphics.<br><br>iBobber is for anyone who loves to find fish, and wants to catch more of them.&#x2028; The iBobber app is designed for one-handed use, and can help make fishing more fun &#x2028;than it&apos;s ever been. And finding more fish is always a lot&#x2028; more fun than just fishing! <br><br>Note: Bluetooth Smart is very clever technology and is different from Bluetooth&#xAE; used in other fishfinders. Bluetooth Smart is designed for short messages from nearby devices such as temperature sensors, proximity sensors, and medical devices such as heart monitors, and now sonar signals. It does a really good job of keeping devices continually paired.<br><br><b>iBobber App Features:</b><br><br><u>Sonar Screen</u><br><br>Locate Fish at Depths down to 135ft<br>Depth Scale<br>Fish Tagged with Depth<br>2 Fish Sizes: 15&quot; and under &amp; over 15&quot;<br>Waterbed foliage<br><br><br><u>Sonar Status Dashboard</u><br><br>Battery Status (up to 8hrs of charge)<br>Water Temperature<br>Fish Alarm (on/off)<br>Strike Alarm (on/off/adjustable)<br>Bobber LED beacon (on/off)<br><br><br><u>Trip Log</u><br><br>Tap any GPS Tag button on any screen and the Date, Time, and Location of your trip auto-loads in Trip Log. Name your trip, tlog conditions and type of fishing. Log the lures fish are hitting, and species of fish you&apos;ve caught. Share it all on social media with friends who are stuck back in the office.<br><br>Date <br>Time <br>Location (GPS coordinates)<br>Title<br>Lure<br>Conditions<br>Type of Fishing<br>Fish Caught (type &amp; number)<br>Notes<br><br>Share: Facebook, Twitter, Mail, Text<br><br>Auto-Archives Trips; Linked with Calendar: tap past date and archived Trip Logs appear<br><br><u>Waterbed Mapping</u><br><br>Map the contour of the bottom up to 100ft away, down to&#x2028;135&apos;.<br><br><br><u>Lunar Calendar</u><br><br>Moonrise / moonset <br>Sunrise / sunset<br>Provides moon phases by day and date. And moon rise/set, sunrise/set&#x2014; just tap today&apos;s date to see them.<br><br>Linked with Trip Log; tap past date and archived Trip Logs appear<br><br><br><u>Weather</u><br><br>GPS based and provides current temperature, estimated high/low temperature for today, percentage chance of rain, wind speed/direction, barometric pressure.<br><br><br><u>Settings</u><br><br>Bluetooth Smart&#xAE; Sync<br>Imperial / Metric <br>Sonar Demo <br>Waterbed Mapping speed adjustment<br>10 Languages (English, French, Spanish, German, Portugese, Russian, Japanese, Korean, Chinese, Arabic)<br><br><br><u>Bobber Specs</u><br><br>Sonar Depth:  Down to 135ft / 41m<br>Bluetooth Smart Range:  Up to 100 ft / 30m<br>Sonar:  Single Beam, 90&#xBA;, 118 kHz<br>Power:  Auto-On in water<br>Units:  Imperial / Metric<br>Battery:  3.7V Rechargeable<br>Battery Charge:  Up to 8 hours<br>Size:  59mm Diameter<br>Weight:  47gm / 1.7oz<br><br><br>Android is a trademark of Google Inc.",
    "histogram": {
        "1": 55,
        "2": 24,
        "3": 36,
        "4": 53,
        "5": 130
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/JGIcFtH4TNNcQksXNysu5Q_gsPN8NvP3vOfZSOUjQEhO3BKxKIfO2yIy5LPDVqYYxzw=h310",
        "//lh3.googleusercontent.com/bK9JATslV9yhHYeLzSVPTOBBlM8tE9r21K9Pqg1hW_qIO-FMqbz0nx4Skl1EmxdwTu4=h310",
        "//lh5.ggpht.com/5eF1BLPx63zEDdPfG4C5DZmyzDN1Lz2HPLU6CXDOJsAi-4fm6JOEQZJRSB2aPwgiZg=h310",
        "//lh3.ggpht.com/2_RclqtEvXrzYl4Dbqx8GL94VkEZvdoVepewEq820rkveiIdnOFywbO7cT6YcqGZ7qU=h310",
        "//lh5.ggpht.com/prgK_MjAeczWnMHHp_Cs_kcFtb5Do24Bwo3uQgTr77vA4OWWR-rlqCCtWxLr_YExZhcK=h310",
        "//lh3.googleusercontent.com/wXjfZrNrQdptOjY0QgPxERUNUBTwXSb_p7gUvD4bIM2APKm5AL8GfW0RaXhqPUsxJpk=h310",
        "//lh3.googleusercontent.com/OF5WLUZx6vGtW5xECq49mgc3P7Y40X0O4tyOAllNR3m5YgHnAWtxhz_CaNnY6IrFcuo=h310",
        "//lh3.googleusercontent.com/X74q73YXyyIpsfaQYcxFNan-P-vlLPAHlrEStrZjR9B2HDf8T5R2eAiOfLfsTx2d1mE=h310"
    ],
    "comments": [
        "Read the directions as well as watch the Utube videos. It's not a $1000 setup so didn't expect it to work like one. But it has got me more fish once I learned to use it. Update: since it uses Bluetooth I see that as a weak point. A cast of more than 40 ft is out of range, the closer to u the better the results.",
        "The idea of it is cool, although I feel it lacks some necessary detail. A more clear scan would make this tremendously better. I tried switching back and forth from the sonar screen to the fish screen, and any random dot above the floor is considered a fish, and at times it would show weeds where there clearly weren't any. The depth seemed decently accurate as I cross checked it with a map of the lake, but as far as what it considers to be fish or structure, I am skeptical.   I would like to see the ability to change the frequency to get a better picture. There is no advanced feature to twerk settings, and I think that would be great.   Does better on boat then on shore, as I didnt have to cast it, and it stayed within 5 feet from me. Casting from shore, it disconnects past 20 feet.   Overall cool idea, but I think I would go with a different product.  Edit 1/17--- Would be nice if there was an update for ice fishing. So far it's only been useful to check depth. Could be a great tool with a little firmware update.",
        "Glad to see that Ibobber works for Android... should have said something on the box because it ONLY works for iPhones waste of my money",
        "Buyer beware! Lots and lots of complaints but no updates for nearly a year. I'm thinking this company has abandoned the software. Too bad; seams to be a good idea VERY poorly implemented.",
        "This product sucks I tried to connect with my HTC BOLT 10 EVO it gets disconnect by it self for 30second and get connect by it self and this product is not useful",
        "It disconnects from Bluetooth quite often. I tried it on both my Pixel 2 and my HTC Turbo with the same results. Once it disconnects itself it has trouble reconnecting. Hopefully a firmware update can fix this issue (currently using latest firmware on iBobber)"
    ],
    "recentChanges": [
        "Improved power management."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.reelsonar.ibobber&hl=en&gl=us",
    "appId": "com.reelsonar.ibobber"
}