{
    "title": "Alarm Clock for Heavy Sleepers",
    "summary": "Free smart alarm clock app with loud alarms &amp; math problems for heavy sleepers",
    "icon": "//lh3.googleusercontent.com/mset_wwoJqB54H0ifmjtcMeRyCWob7Q36MUAGk8HD-qsnlavUGE0dgBLY6O_MALjhdk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 16179,
    "developer": "AMdroid Alarm Clock - No more oversleep",
    "developerId": "5758897849952032401",
    "developerEmail": "support@amdroidapp.com",
    "developerWebsite": "http://amdroidapp.com",
    "developerAddress": "2510 Dorog, Árpád utca 39.",
    "updated": "February 28, 2018",
    "version": "3.1.0",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "AMdroid Smart Alarm Clock is a free alarm clock for heavy sleepers with multiple alarms for Android. It's smart, fully customizable, free, and wakes you up slowly, naturally, gradually and in a gentle way, even if you have a deep sleep, making your morning better. No more oversleep, sleepyhead! This app was designed for heavy sleepers!• A free alarm clock for deep sleepers with fully customizable alarm profilesRecurring alarms - daily or weekly repeats, intervals, set expiration, etc.One-time alarms - set any dateCountdown alarms - the perfect app for an afternoon siestaWe've made the best effective alarms, so deep and heavy sleepers can wake up with a gradual wake - for free!• Each alarm has its own settingsWake up with a smart gentle alarm and start your day with your favorite song along with real-time weather informationUse challenges (math problems, Captcha, Wi-Fi, NFC, Barcode/QR code) to prevent oversleeping - great for heavy sleepersAdjust snooze time on the flyRestrict alarms to locationsIntegrate your calendar to AMdroidMany more features to tweak your alarms, but easy to familiarize withSet up multiple alarms that work — even for deep sleepers!• Let you sleep on off-daysEver been roused from a good, deep sleep on a public holiday because the alarm clock wasn't turned off? AMdroid knows the public holidays for your country; alarms won’t go off on these days (optional).• Android Wear integrationSnooze or dismiss alarms from your wrist. Adjust next alarm or add new one-time alarms using voice commands.• No more oversleep with this alarm clockCan't wake up? Configure dismiss challenges (puzzles) and math problems to wake up timely. Use post alarm confirmation to make sure you are awake and avoid oversleeping. Perfect loud alarm clock for heavy sleepers—just solve maths problems!• Wake up during light sleepAre you a heavy sleeper? Configure a gentle pre-alarm that will go off and wake you up naturally and gradually before the main one. It can be scheduled automatically according to your sleep patterns. Lower the volume and disable vibrating for this pre-alarm, so it'll only wake you up slowly if you are in light sleep for a better morning routine start. Helps defend against sleepiness and lethargy in the mornings. Wake up easily; be energetic! The power of our smart alarm.• Sleep trackingTo avoid oversleep you need to go to bed timely. AMdroid will let you know with a bedtime notification if it's time to fall asleep in order to wake up fresh and have a better morning routine. When sleep tracking is activated sleep cycle calculation can be started to follow your sleep patterns and have an easier wake in the morning. With Stats, you can also track how much time you spend sleeping.• PlacesMake your alarm clock location-aware, so your alarms will only go off if you are in a certain area. Heading out for a business trip or just sleep over somewhere else for the night? Your morning routine will probably change, so AMdroid will temporarily disable your regular alarm profile automatically.• StatsEver wondered how much time you spend snoozing? This material design alarm clock will show you statistics you can analyze and use to fine-tune your alarm settings.• Nothing better than an afternoon siestaTiredness overcame and feel drowsy? If you are sleepy, use the countdown alarm function as a timer for your afternoon doze. Set the timer for your zizz, and the alarm will go off if it has elapsed, and you won't oversleep. Waking up naturally is the best feeling.Let's fight deep sleep and build the best loud smart alarm clock app. Send your ideas or report issues to feedback@amdroidapp.com*Notes*If your device supports a battery saving function, please add AMdroid Smart Alarm Clock to the whitelist, as it may cause problems with alarmclock apps.The app is free and Ad supported (after the alarm); purchase Premium Upgrade to remove Ads.",
    "descriptionHTML": "AMdroid Smart Alarm Clock is a free alarm clock for heavy sleepers with multiple alarms for Android. It&apos;s smart, fully customizable, free, and wakes you up slowly, naturally, gradually and in a gentle way, even if you have a deep sleep, making your morning better. No more oversleep, sleepyhead! This app was designed for heavy sleepers!<br><br><b>&#x2022; A free alarm clock for deep sleepers with fully customizable alarm profiles</b><br>Recurring alarms - daily or weekly repeats, intervals, set expiration, etc.<br>One-time alarms - set any date<br>Countdown alarms - the perfect app for an afternoon siesta<br>We&apos;ve made the best effective alarms, so deep and heavy sleepers can wake up with a gradual wake - for free!<br><b>&#x2022; Each alarm has its own settings</b><br>Wake up with a smart gentle alarm and start your day with your favorite song along with real-time weather information<br>Use challenges (math problems, Captcha, Wi-Fi, NFC, Barcode/QR code) to prevent oversleeping - great for heavy sleepers<br>Adjust snooze time on the fly<br>Restrict alarms to locations<br>Integrate your calendar to AMdroid<br>Many more features to tweak your alarms, but easy to familiarize with<br>Set up multiple alarms that work &#x2014; even for deep sleepers!<br><b>&#x2022; Let you sleep on off-days</b><br>Ever been roused from a good, deep sleep on a public holiday because the alarm clock wasn&apos;t turned off? AMdroid knows the public holidays for your country; alarms won&#x2019;t go off on these days (optional).<br><b>&#x2022; Android Wear integration</b><br>Snooze or dismiss alarms from your wrist. Adjust next alarm or add new one-time alarms using voice commands.<br><b>&#x2022; No more oversleep with this alarm clock</b><br>Can&apos;t wake up? Configure dismiss challenges (puzzles) and math problems to wake up timely. Use post alarm confirmation to make sure you are awake and avoid oversleeping. Perfect loud alarm clock for heavy sleepers&#x2014;just solve maths problems!<br><b>&#x2022; Wake up during light sleep</b><br>Are you a heavy sleeper? Configure a gentle pre-alarm that will go off and wake you up naturally and gradually before the main one. It can be scheduled automatically according to your sleep patterns. Lower the volume and disable vibrating for this pre-alarm, so it&apos;ll only wake you up slowly if you are in light sleep for a better morning routine start. Helps defend against sleepiness and lethargy in the mornings. Wake up easily; be energetic! The power of our smart alarm.<br><b>&#x2022; Sleep tracking</b><br>To avoid oversleep you need to go to bed timely. AMdroid will let you know with a bedtime notification if it&apos;s time to fall asleep in order to wake up fresh and have a better morning routine. When sleep tracking is activated sleep cycle calculation can be started to follow your sleep patterns and have an easier wake in the morning. With Stats, you can also track how much time you spend sleeping.<br><b>&#x2022; Places</b><br>Make your alarm clock location-aware, so your alarms will only go off if you are in a certain area. Heading out for a business trip or just sleep over somewhere else for the night? Your morning routine will probably change, so AMdroid will temporarily disable your regular alarm profile automatically.<br><b>&#x2022; Stats</b><br>Ever wondered how much time you spend snoozing? This material design alarm clock will show you statistics you can analyze and use to fine-tune your alarm settings.<br><b>&#x2022; Nothing better than an afternoon siesta</b><br>Tiredness overcame and feel drowsy? If you are sleepy, use the countdown alarm function as a timer for your afternoon doze. Set the timer for your zizz, and the alarm will go off if it has elapsed, and you won&apos;t oversleep. Waking up naturally is the best feeling.<br><br>Let&apos;s fight deep sleep and build the best loud smart alarm clock app. Send your ideas or report issues to feedback@amdroidapp.com<br><br>*Notes*<br>If your device supports a battery saving function, please add AMdroid Smart Alarm Clock to the whitelist, as it may cause problems with alarmclock apps.<br>The app is free and Ad supported (after the alarm); purchase Premium Upgrade to remove Ads.",
    "histogram": {
        "1": 553,
        "2": 221,
        "3": 586,
        "4": 2863,
        "5": 11956
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/kE4mLHIN_iDN-rCBwyu1-1XrJfMdEPNlsAGitlNbO-FJV6XxTi931V3SRAVuHL85SGU=h310",
        "//lh3.googleusercontent.com/paICqjhvAomWj-93yNuPJD_JvKWZcUTZBaRBCLH0XUic0UnmXaP5HYuutTJmaqdu1KOU=h310",
        "//lh3.googleusercontent.com/th89YJwdCAtW5RIYFxV8jZbu5LLrk_jyLao0mP_eAaTSFjYVw98mQGIssywQMF0F0JGD=h310",
        "//lh3.googleusercontent.com/8DOu6XUHZXQbqwCbH2rB3IA9-VnZy7XJAWcG206xepye3k6E_mGFSsp6iqwccDYq7u8=h310",
        "//lh3.googleusercontent.com/PjTSy0qqXjkMp_451VhyH4LcPGrjkau9roAj2sxVk3izGaDJYzFXDF48oR-ADp9q_YQ=h310",
        "//lh3.googleusercontent.com/ltQQImXCS5h2NhbxEwdCKIPjraGCkd9IXh3JLZKuBAnRRmGz7dpd620LLR1fokfBkOc=h310",
        "//lh3.googleusercontent.com/J8kjI7TkizsTbMwFQIMaTUSchxnx1X-8T35odxJd6OdkwP1iNYv18Zg06cj1OiJOgg=h310",
        "//lh3.googleusercontent.com/LSg41tsQR9AqHyWFj-IuS4KPJtAHqyYlDkSDiq-4abvKBgjj8Eo_KLOsBhVva9P6ag=h310",
        "//lh3.googleusercontent.com/iD8nk4EsJ-sueKBsiyrswJu5xySVVF2zSwmuzkZ9grBmMVlNU-InxhKGzCw36ijCgg=h310",
        "//lh3.googleusercontent.com/ENeXKysq7wqt8Two3z2GditGZKQNQMVcvWZwKfIb_mnCs2UQqYZJh-T7yhB6119L_90=h310",
        "//lh3.googleusercontent.com/Pg85C_sQEphpNZSvsMWZtzX1BnH7E51c8Xv0k0zF3Qeyp0YSl7iH7VfBOyiOWySHlA=h310",
        "//lh3.googleusercontent.com/JpiHyDC7KkRCCZYrpupUW0WrO_AmsK8C6nyLNh4OHjXl1uGRIo-xyVG06LKWVjE1A9zn=h310",
        "//lh3.googleusercontent.com/J-SG5dr1BIPuKaQjbeXUL2XfbEWA81A9o3uXnREOpIxBMUWyEOSHDDXC9VCIZ5yH8g=h310",
        "//lh3.googleusercontent.com/qGwscJW5-At0MGdo4iZCFr69XBCTfIWcgh1Y5RgBc55jpX63Tl0OMivZFXQpDzrw6xA=h310"
    ],
    "comments": [
        "Update: The best alarm app. Only one which can properly identify odd even Saturday.   So far so good, yet to test fully. Can you please add odd and even Saturday settings in weekly alarms? I need alarms on odd Saturday only. Check sleep as android app for reference. Update: working so good. Upvoted 5 star.",
        "Great",
        "This app has a pre-alarm, alarm, and post-alarm option for each alarm you set. This is great for me, because I wake up a lot easier with this app. I hit the snooze button less, and I don't need to set a million alarms each morning now. I would recommend this app.",
        "Best alarm ever, and I've tried many. Has never failed after a couple years - knock on wood",
        "Good app. Better selection of ringtones would make it a 5 star app. Overall one of the best alarm apps I've used.",
        "One of the best alarm apps out here. I have even managed to get a dynamic alarm based on sunrise using its calendar feature. That could be something you could build into it too to make things easier."
    ],
    "recentChanges": [
        "With each update, we try to improve AMdroid so you can have a better morning routine every day.",
        "If you have questions, ideas or run into issues, send a message with the Help and Feedback menu.",
        "3.1.0",
        "NEW: Integration with automation apps (Tasker, Automate, Automagic, Locale, etc.) - Events, Conditions and Actions",
        "NEW: Option to hide the history tab or hide individual entries from the list",
        "NEW: Option to set timers with voice commands (with \"OK Google\")",
        "Bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.amdroidalarmclock.amdroid&hl=en&gl=us",
    "appId": "com.amdroidalarmclock.amdroid"
}