{
    "title": "Wear Baby Monitor",
    "summary": "Baby Monitor for Android Wear watches. Nanny works on Bluetooth and WiFi",
    "icon": "//lh3.googleusercontent.com/HOl17vsZXrqlPLgkdtsSay_oVg0lnXMzqNE1VmDuA7XTlJTip_8L0rA9bCyovWMU8w=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 1.9,
    "reviews": 12,
    "developer": "Stoneface",
    "developerId": "Stoneface",
    "developerEmail": "stonefaceapps@gmail.com",
    "developerAddress": "220140, Minsk, Belarus\n91 Pritytskogo str., 345",
    "updated": "September 11, 2015",
    "version": "1.0",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Wear Baby Monitor is a brand-new app that allows parents to keep a watchful eye on their child no matter where they are.To use Baby Monitor, just install the app on your Android device. The app also installs automatically on the connected to the device Android Wear watch.EASY-TO-USE:- Activate the Baby Monitor on your phone or tablet and leave it near the baby bed- If your baby wake up, you will get a notification on your watchFEATURES:- Supports WiFi and Bluetooth connections- Auto silent mode- Vibrate watch notification- Alert, in case the devices connection is lostThe Wear Baby Monitor is the easy-to-use nanny for watch out for your child when he sleeps.The Wear Baby Monitor has been tested on Moto速 360, LG速 G Watch R, ASUS速 ZenWatch, Sony速 SmartWatch and other. Any problems? Please email me and I'll try my best to fix any issues you have!",
    "descriptionHTML": "Wear Baby Monitor is a brand-new app that allows parents to keep a watchful eye on their child no matter where they are.<br><br>To use Baby Monitor, just install the app on your Android device. The app also installs automatically on the connected to the device Android Wear watch.<br><br>EASY-TO-USE:<br>- Activate the Baby Monitor on your phone or tablet and leave it near the baby bed<br>- If your baby wake up, you will get a notification on your watch<br><br>FEATURES:<br>- Supports WiFi and Bluetooth connections<br>- Auto silent mode<br>- Vibrate watch notification<br>- Alert, in case the devices connection is lost<br><br>The Wear Baby Monitor is the easy-to-use nanny for watch out for your child when he sleeps.<br><br>The Wear Baby Monitor has been tested on Moto&#xAE; 360, LG&#xAE; G Watch R, ASUS&#xAE; ZenWatch, Sony&#xAE; SmartWatch and other. Any problems? Please email me and I&apos;ll try my best to fix any issues you have!",
    "histogram": {
        "1": 9,
        "2": 0,
        "3": 0,
        "4": 1,
        "5": 2
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/JYPc0qsNBGLrTzArYNZhD3Q8v7v_uwk7JJxILNvmx7phVAgCQVcoSjo4sDQGvnC4rYcd=h310",
        "//lh3.googleusercontent.com/T1qjJynjv8B6w9ivH64k6ZHFCN1PP8hCPxa4SOmB1WTi3MV6Hxvoeobq0IPI97WeiA=h310"
    ],
    "comments": [
        "App wouldn't respond I installed the app and straight away a message came up saying it wasn't responding. I tried to turn it off and got the same message. Shame because if it worked it would be a great idea.",
        "Absolute shyte, doesn't open. Thank God for refunds...",
        "App never even opened",
        "Doesn't even launch"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.stoneface.nanny&hl=en&gl=us",
    "appId": "com.stoneface.nanny"
}