{
    "title": "My Verizon Nexus",
    "summary": "Take control of your account. Use the App to get account info on-the-go!",
    "icon": "//lh3.googleusercontent.com/mBNrXaxg0v8RyQ6nNHB9LbK6lg4BA1QWcKUdcMnRvfP37xpn8Ro6IY4V46G4_4e-bQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 2.3,
    "reviews": 4942,
    "developer": "Verizon - VZ",
    "developerId": "Verizon+-+VZ",
    "developerEmail": "MyVZMobile@VerizonWireless.com",
    "developerWebsite": "http://www.vzw.com",
    "developerAddress": "One Verizon Way, Basking Ridge, New Jersey",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Tools",
    "genreId": "TOOLS",
    "size": "Varies with device",
    "description": "***The My Verizon App works best if you are on one of our newer plans.  Don’t have a S, M, L or Unlimited?  Switch now.***   The My Verizon app lets you manage your entire Verizon account from anywhere.  Features include:The FeedAll you need to know about your data, plan, and bill in one seamless Feed, personalized with products and content just for you.The Data HubYour data control center.  Clearly see how much data is being used, who is using it and how to get more the second you need it. Plan ManagementReview and manage your plan from anywhere.  Easily switch to a different plan or go Unlimited at any time right from the palm of your hand. Simplified BillA clear and simple bill that explains what's changed from month to month. Understand and pay your bill with just a few tapsVerizon Up Rewards Rewards you really, really want.  Just for being a Verizon customer.  From amazing once-in-a-lifetime experiences to tons of good stuff from the brands you love. Because, thanks.  Simply enroll today, exclusively in the My Verizon app.On-Demand SupportIn-app support that’s there before you need it.  Instant access to the answers you want without having to call for help. Shop TechThe fastest and easiest way to browse, buy and customize the latest devices and accessories, all without leaving the app. Enhanced In-Store App ExperiencesOptimize your visit by checking-in for appointments upon arrival, scanning accessories for self-checkout, and much more.  Please note, App Notifications, WIFI, Bluetooth, and Location Services (set to “Always”) must be turned “ON” to access. One app. Total control. ***The My Verizon App is now available to conveniently serve all prepaid self-service needs.  Make payments, enroll in Auto Pay, monitor usage, add data or change a plan directly on your prepaid device. Managing your prepaid account on the most reliable network has never been easier.***",
    "descriptionHTML": "***The My Verizon App works best if you are on one of our newer plans.  Don&#x2019;t have a S, M, L or Unlimited?  Switch now.***  <br> <br>The My Verizon app lets you manage your entire Verizon account from anywhere. <br> <br>Features include:<br><br>The Feed<br>All you need to know about your data, plan, and bill in one seamless Feed, personalized with products and content just for you.<br><br>The Data Hub<br>Your data control center.  Clearly see how much data is being used, who is using it and how to get more the second you need it.<br> <br>Plan Management<br>Review and manage your plan from anywhere.  Easily switch to a different plan or go Unlimited at any time right from the palm of your hand.<br> <br>Simplified Bill<br>A clear and simple bill that explains what&apos;s changed from month to month. Understand and pay your bill with just a few taps<br><br>Verizon Up Rewards <br>Rewards you really, really want.  Just for being a Verizon customer.  From amazing once-in-a-lifetime experiences to tons of good stuff from the brands you love. Because, thanks.  Simply enroll today, exclusively in the My Verizon app.<br><br>On-Demand Support<br>In-app support that&#x2019;s there before you need it.  Instant access to the answers you want without having to call for help. <br><br>Shop Tech<br>The fastest and easiest way to browse, buy and customize the latest devices and accessories, all without leaving the app.<br> <br>Enhanced In-Store App Experiences<br>Optimize your visit by checking-in for appointments upon arrival, scanning accessories for self-checkout, and much more.  Please note, App Notifications, WIFI, Bluetooth, and Location Services (set to &#x201C;Always&#x201D;) must be turned &#x201C;ON&#x201D; to access.<br> <br>One app. Total control.<br> <br>***The My Verizon App is now available to conveniently serve all prepaid self-service needs.  Make payments, enroll in Auto Pay, monitor usage, add data or change a plan directly on your prepaid device. Managing your prepaid account on the most reliable network has never been easier.***",
    "histogram": {
        "1": 2816,
        "2": 290,
        "3": 315,
        "4": 488,
        "5": 1033
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/x-rwTHtWOsnn4R5dEOJ_P-5zPrL8SZJ2YeKzG04XQQQoHL3sMeaIAViewPkB5VJFsYOY=h310",
        "//lh3.googleusercontent.com/XHBKlbZq3GAbHUyRsq4XE43VBSONlaCOVKRw_URrUx6eInKvq1cYteE3QJCcAytZPnQ=h310",
        "//lh3.googleusercontent.com/HAk4DxIlCwpyTYRvWtLOxdru5j_LLgGC1qD4R_xwiajVA_Fdf0zGfA_qU40BWsV7qn8=h310",
        "//lh3.googleusercontent.com/HF3k6C6VUNiMHnsnkO07EpxktLiTaj1OkHAEteZppjWIFn6wXR30dgpYy1CPZ19nWBh2=h310",
        "//lh3.googleusercontent.com/uevkZdCXREcg_7_bK_jnomFAy-D0kxlu31IFrZxJprbZ1SB_KQnZ8cp5aGkGgq5BTQ=h310",
        "//lh3.googleusercontent.com/EBU2xWNcc768v772yGk5YfVmrlq7ZAQ1ddj-FHYCIIOzIV_WhSawP1k1Z0q3I0i-7BA=h310",
        "//lh3.googleusercontent.com/vpZ3TrXen3PUIr9DSUA8QUL7oMAki0tmmuzUlO9VMKI-Gu11CnthNUK7pRtlqIceNV0=h310",
        "//lh3.googleusercontent.com/DChWV7DfKYeckpKV9Xy0ljWMCb028GJ1wtONq_OF3R95hpxu4JAP8f_kYR7A9FacFVM=h310",
        "//lh3.googleusercontent.com/WD1hRyk_C-ZH9abfog7hiberA-RXR-Dap_Y0_58a8bFTita0ryiYdhL-cuiqMdX7=h310"
    ],
    "comments": [
        "Well designed app but does have the occasional error that causes a crash. Some things aren't very intuitive to find, but otherwise a pleasure to use and certainly better than the website.",
        "Every time I use the damn app it makes me sign in again!  Never used to have to do that",
        "It has a \"remember me\" option, but it NEVER remembers your login info.  I have to enter it Every. Single. Time.",
        "Hate it. Doesn't work!",
        "Great",
        "Latest  update -  Widget didn't update when data/billing cycle renewed. Inconvenient as usual. Still won't stay logged in. I have sign in every time I open the app. I have remember me marked. I even activated finger print. Leave it to Verizon to make doing anything account-related complicated and a hassle. Terrible app. Terrible customer support. No response from customer support. Just keep sending $$$$."
    ],
    "recentChanges": [
        "- Wall paper",
        "- Search",
        "- Autoplay video"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.vzw.hss.myverizonged&hl=en&gl=us",
    "appId": "com.vzw.hss.myverizonged"
}