{
    "title": "Swiss Snow Report",
    "summary": "Daily updated snow and weather information for Swiss winter sport destinations",
    "icon": "//lh3.googleusercontent.com/UXZ1-W1kLGR2lg8DOEhxwNwHzvhYi_yZw9_XVdT2BA2OmEQN9J7ShJKciCk0skn7mHk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.6,
    "reviews": 676,
    "developer": "MySwitzerland.com",
    "developerId": "MySwitzerland.com",
    "developerEmail": "mobileapps@switzerland.com",
    "developerWebsite": "http://www.myswitzerland.com",
    "updated": "December 4, 2017",
    "version": "5.3",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "Call up the current snow and weather conditions in your favourite Swiss ski resorts or discover new destinations with ideal conditions for your winter hobby.  The Swiss Snow Report App from Switzerland Tourism includes snow and facilities information for more than 250 Swiss winter resorts. Updated several times a day, the extensive database provides detailed information about the following winter sports: skiing, cross-country skiing, sledging and winter hiking.Where can I find the best snow and weather conditions? Which resorts have the most facilities open? Which sports can I enjoy at each destination? Where should I plan my next day trip?The Snow Report App from Switzerland Tourism helps you find the answers to these and many other questions with ease. It also includes the following the new features:• Easier, faster handling thanks to an intuitive navigation concept• Compare favourites using simple swipe gestures• Smartwatch support: take the main snow and weather data for your favourites with you wherever you go• Compare destinations using webcam images – now also available straight from the list view• Integrated 7-day weather forecast from SRF Meteo – ideal to help you plan your next weekend trip• Direct search for winter resorts with ideal conditions for your winter sportDo you have any questions, suggestions or ideas for improvement? Contact us at mobileapps@switzerland.comFollow us:Web: http://www.myswitzerland.comFacebook: http://www.facebook.com/MySwitzerlandTwitter: http://www.twitter.com/MySwitzerland_e",
    "descriptionHTML": "Call up the current snow and weather conditions in your favourite Swiss ski resorts or discover new destinations with ideal conditions for your winter hobby.  <br><br>The Swiss Snow Report App from Switzerland Tourism includes snow and facilities information for more than 250 Swiss winter resorts. Updated several times a day, the extensive database provides detailed information about the following winter sports: skiing, cross-country skiing, sledging and winter hiking.<br><br>Where can I find the best snow and weather conditions? Which resorts have the most facilities open? Which sports can I enjoy at each destination? Where should I plan my next day trip?<br><br>The Snow Report App from Switzerland Tourism helps you find the answers to these and many other questions with ease. It also includes the following the new features:<br><br>&#x2022; Easier, faster handling thanks to an intuitive navigation concept<br>&#x2022; Compare favourites using simple swipe gestures<br>&#x2022; Smartwatch support: take the main snow and weather data for your favourites with you wherever you go<br>&#x2022; Compare destinations using webcam images &#x2013; now also available straight from the list view<br>&#x2022; Integrated 7-day weather forecast from SRF Meteo &#x2013; ideal to help you plan your next weekend trip<br>&#x2022; Direct search for winter resorts with ideal conditions for your winter sport<br><br>Do you have any questions, suggestions or ideas for improvement? Contact us at mobileapps@switzerland.com<br><br>Follow us:<br>Web: http://www.myswitzerland.com<br>Facebook: http://www.facebook.com/MySwitzerland<br>Twitter: http://www.twitter.com/MySwitzerland_e",
    "histogram": {
        "1": 152,
        "2": 32,
        "3": 30,
        "4": 186,
        "5": 276
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/_G4DH7x9BgCAJsZvOZO25Ilbx3QU7vQEgusFM7zydnyic55ObYZRaCt46CUQZO_Iovg=h310",
        "//lh3.googleusercontent.com/iywoo8rzUvsBiQRZOcc-sjVOf-rGIrMhM01gQdRNAHGAD1IJn20SA2o4DO3c2vLXpj0=h310",
        "//lh3.googleusercontent.com/1qRY4MxGAm55mhDVwhcZC69FpjeamgDvclE1ifMGRJB8tfAFNRbDN63mah9HV3cdiXo=h310",
        "//lh3.googleusercontent.com/sB4bnNJs2Vtsa-qTVT5awbT0byRAem8HAp94uDwQyNebEMkG5DwYZ7Ej46P_77FFwYU=h310",
        "//lh3.googleusercontent.com/_bua87P5CGcPFLAPWuy8w4gN2eU8ZDngBI4GYfAkyJJVrzmJNPc1k6XJOMR8OeoE4y3t=h310",
        "//lh3.googleusercontent.com/EOubWPy70hafuNmhVgjB2N45Q30iBxdx6JHfX8AT0paAR03tHAyA5TvqiMg6d7AAZYE=h310",
        "//lh3.googleusercontent.com/RivPX4BW__CDHESiwu030h5tFBnZc6lMu-hcfOdEzOr7TLcCVCuvLUxA1dmWbkvAfyo=h310"
    ],
    "comments": [
        "Very useful but not easy to use. should be easier to browse resorts without going into the add resort to fovorites mode. Removing resorts is much harder than it should be.",
        "Nice interface with photos. Most importantly it gives up to date and accurate ski and snow conditions throughout 🇨🇭. Thx",
        "Pas facile d'utilisation",
        "Sehr gut!",
        "Good for checking snow conditions in Switzerland",
        "Great app."
    ],
    "recentChanges": [
        "- Winter destinations can now be found via the map",
        "- Inaccurate or outdated information can be reported using the app",
        "- Various minor optimisations to design and operation"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.SnowReport.screens&hl=en&gl=us",
    "appId": "com.SnowReport.screens"
}