{
    "title": "Acorns - Invest Spare Change",
    "summary": "Invest as little as $5 into more than 7,000 stocks &amp; bonds",
    "icon": "//lh3.googleusercontent.com/Id2IpnxsxOWEDbXrogHEGpwanOkjSp16ge5oSy4fd78AGcuT_EzP8ACwjoSG-BBlNgA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 40164,
    "developer": "Acorns",
    "developerId": "Acorns",
    "developerEmail": "androidsupport@acorns.com",
    "developerWebsite": "https://www.acorns.com",
    "developerAddress": "19900 MacArthur Blvd,  suite 400,\nIrvine, CA, United States",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Finance",
    "genreId": "FINANCE",
    "size": "Varies with device",
    "description": "►Grow your oak!◄With Acorns, it’s simple and secure to invest in your future, automatically. In fact, more than 2 million people are doing it! It only takes a few minutes. Ready to grow your oak?►FEATURES◄○ Painlessly invest your spare change into a diversified portfolio of ETFs of over 7,000 stocks and bonds automatically○ Easily invest more - with Recurring Investments (daily/weekly/monthly), One-Time Investments, Referrals, and Found Money!○ Watch your progress – check in on your account from anywhere○ SIPC Protected – up to $500,000 is protected against fraud so your money is secure○ Stay educated – Gain access to our online personal finance publication, Grow Magazine○ Withdraw anytime – at no charge.►WHAT THE WORLD IS SAYING◄FORBES: “The app makes investing effortless.”[1]ABC NEWS: “If you set aside just $5 every couple of days you would have set aside $1,000 in a year.”[2]WIRED: “Acorns simplified the often tedious and complex process of investing.”[3]US NEWS: “Acorns offers a unique solution to overcoming the mental barrier: ‘I just don’t have enough money to be investing.’”[4]►TRUSTED AND INTELLIGENT◄○ 256-bit encryption to keep your information safe and secure○ Automatically rebalances your portfolio ○ Automatically re-invests your dividends for you○ Diversified Portfolio includes hundreds of international companies, corporate and government bonds, and real estate.►PRICE◄Acorns costs $1 per month for accounts investing less than $5,000. After your account grows past $5,000, the fee switches to 0.25% per year (@$5,000 that’s about $1 a month). That’s like 3 semi-fancy cups of coffee (you know you do it) a year, just to invest in your future.In order for Acorns to invest your spare change from purchases, which is part of why we charge $1 per month, you will need to connect a bank account. Worry not - we've got 256-bit encryption. That's a nerdy way of saying we're as secure as the people you bank with. Now, stop reading and get invested.This app is operated by Acorns Advisers, LLC, an SEC Registered Investment Advisor. Brokerage services are provided to clients of Acorns by Acorns Securities, an SEC registered broker-dealer and member FINRA/SIPC. Investments are not FDIC insured and may lose value. Investing involves risk and investments may lose value, including the loss of principal. Please consider your objectives and Acorns fees before investing. Past performance does not guarantee future results. “Acorns”, the Acorns logo and “Invest the Change” are registered trademarks of Acorns Grow, Inc. Copyright © 2016 Acorns and/or its affiliates.Information about FINRA is available at www.finra.org. Explanatory brochures about SIPC protection are available upon request or at www.sipc.org.[1] http://www.forbes.com/sites/duncanrolph/2014/09/10/4-online-tools-to-manage-your-money-in-the-21st-century/[2] http://abcnews.go.com/WNT/video/slow-steady-key-retirement-savings-28043857[3] http://www.wired.com/2014/08/acorn-app/[4] http://money.usnews.com/money/blogs/my-money/2014/12/26/wealth-management-tools-for-the-not-so-wealthy",
    "descriptionHTML": "&#x25BA;<b>Grow your oak!</b>&#x25C4;<br>With Acorns, it&#x2019;s simple and secure to invest in your future, automatically. In fact, more than 2 million people are doing it! It only takes a few minutes. Ready to grow your oak?<br><br>&#x25BA;<b>FEATURES</b>&#x25C4;<br>&#x25CB; Painlessly invest your spare change into a diversified portfolio of ETFs of over 7,000 stocks and bonds automatically<br>&#x25CB; Easily invest more - with Recurring Investments (daily/weekly/monthly), One-Time Investments, Referrals, and Found Money!<br>&#x25CB; Watch your progress &#x2013; check in on your account from anywhere<br>&#x25CB; SIPC Protected &#x2013; up to $500,000 is protected against fraud so your money is secure<br>&#x25CB; Stay educated &#x2013; Gain access to our online personal finance publication, Grow Magazine<br>&#x25CB; Withdraw anytime &#x2013; at no charge.<br><br>&#x25BA;<b>WHAT THE WORLD IS SAYING</b>&#x25C4;<br><br>FORBES: &#x201C;The app makes investing effortless.&#x201D;[1]<br><br>ABC NEWS: &#x201C;If you set aside just $5 every couple of days you would have set aside $1,000 in a year.&#x201D;[2]<br><br>WIRED: &#x201C;Acorns simplified the often tedious and complex process of investing.&#x201D;[3]<br><br>US NEWS: &#x201C;Acorns offers a unique solution to overcoming the mental barrier: &#x2018;I just don&#x2019;t have enough money to be investing.&#x2019;&#x201D;[4]<br><br><br>&#x25BA;<b>TRUSTED AND INTELLIGENT</b>&#x25C4;<br>&#x25CB; 256-bit encryption to keep your information safe and secure<br>&#x25CB; Automatically rebalances your portfolio <br>&#x25CB; Automatically re-invests your dividends for you<br>&#x25CB; Diversified Portfolio includes hundreds of international companies, corporate and government bonds, and real estate.<br><br>&#x25BA;<b>PRICE</b>&#x25C4;<br>Acorns costs $1 per month for accounts investing less than $5,000. After your account grows past $5,000, the fee switches to 0.25% per year (@$5,000 that&#x2019;s about $1 a month). That&#x2019;s like 3 semi-fancy cups of coffee (you know you do it) a year, just to invest in your future.<br><br>In order for Acorns to invest your spare change from purchases, which is part of why we charge $1 per month, you will need to connect a bank account. Worry not - we&apos;ve got 256-bit encryption. That&apos;s a nerdy way of saying we&apos;re as secure as the people you bank with. Now, stop reading and get invested.<br><br><br><br>This app is operated by Acorns Advisers, LLC, an SEC Registered Investment Advisor. Brokerage services are provided to clients of Acorns by Acorns Securities, an SEC registered broker-dealer and member FINRA/SIPC. Investments are not FDIC insured and may lose value. Investing involves risk and investments may lose value, including the loss of principal. Please consider your objectives and Acorns fees before investing. Past performance does not guarantee future results. &#x201C;Acorns&#x201D;, the Acorns logo and &#x201C;Invest the Change&#x201D; are registered trademarks of Acorns Grow, Inc. Copyright &#xA9; 2016 Acorns and/or its affiliates.<br><br><br>Information about FINRA is available at www.finra.org. Explanatory brochures about SIPC protection are available upon request or at www.sipc.org.<br><br>[1] http://www.forbes.com/sites/duncanrolph/2014/09/10/4-online-tools-to-manage-your-money-in-the-21st-century/<br>[2] http://abcnews.go.com/WNT/video/slow-steady-key-retirement-savings-28043857<br>[3] http://www.wired.com/2014/08/acorn-app/<br>[4] http://money.usnews.com/money/blogs/my-money/2014/12/26/wealth-management-tools-for-the-not-so-wealthy",
    "histogram": {
        "1": 2963,
        "2": 1264,
        "3": 1889,
        "4": 6916,
        "5": 27132
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/NuuNMSNHZRIKDNfQ6UKS_0Lfpsdmc8QqfmpHSYrZj6GeSYU6qZ-DTfZvhXI6ogZj7MY=h310",
        "//lh3.googleusercontent.com/j3VabIwWXzTn5BJHxnpGhZkIIpWaPT8UL2wTZawISpdCexvBWW-tEw6StixE7Mu5ISQ=h310",
        "//lh3.googleusercontent.com/p8w-agcWQiO1aT23O4vnlxI96OYW4A1KEOFt2MoOAHaFLC0lOqLCSBxtQ2r-raW-Xww=h310",
        "//lh3.googleusercontent.com/zOgiqsTGzF3krJR3DOUxkt35ofDa28Yl8H0UD0-M59Zc3duhDr2qMOgXVDhRFD-6Hzo=h310",
        "//lh3.googleusercontent.com/5YrNdsU0QTajbdwQhZ0hVEQusw4ZcwjoYS9pMrx-KJhrPC9H1A0mGRmJxgyNmqfg_A=h310"
    ],
    "comments": [
        "Its really a good saving app. Because it helps you save with all the debit and credit cards you currently used.  The only thing I don't like is that when I want to withdraw any amount, it takes about a week to get transfer to my account. Just wish there was an instant option.",
        "Extremely easy to use for someone who is interested in saving for the future by investing, but doesn't really know where to start. Roundups has been very helpful getting me to see a little can add up to a lot in a small amount of time. I tested withdrawals and the money was in my account in the amount of days promised. I like that the money is not as easy to withdraw as the money in my regular savings because I am not as tempted to use for little purchases, that I really don't need. I plan on reinvesting the money I withdrew back into Acorns now I know the withdrawal worked as promised. I like the versatility of one-time, automatic or roundup ×1 ×2, just change or round 1.00 up as well and that I can change settings anytime I want. If things are going good, slow, bonus at work etc...So far I like just about everything and I have read some amazing tips on here that I may not have stumbled upon elsewhere. 👍👍.",
        "The more money I put in, the more money they lose. I don't think I have seen my account positive ever. You would get more return with a low interest savings account than this garbage. But hey they will link you a story that promises things will get better. And when they do we will lose all that too.",
        "Beware of a craigslist scammer named Matt. He'll say he's going to pay you 60 bucks to download,  register,  and give feedback on your experience. Long story short...... This is just a desperate attempt to gain more users of this app and Stash as well.  Really lame and a waste of time.",
        "Poor customer service. They do not respond inquiries. The only reason I started an account was to round up my change. After having an account open for 27 days, not a single cent was rounded up an invested. I had my account linked and my cards linked. I use my cards regularly.",
        "I downloaded the app and then starting reading the reviews. Way too many people complaining they can't get their money, can't verify accounts, but still have them easily charging them every month without fail. Make sure you read the reviews before you make the decision to go with these guys."
    ],
    "recentChanges": [
        "Happy New Year! We made some enhancements and fixed a few bugs to start 2018 right. We hope this makes Acorns work even better for you. Thanks for growing with us!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.acorns.android&hl=en&gl=us",
    "appId": "com.acorns.android"
}