{
    "title": "LG Call for Android Wear",
    "summary": "Make a call on your wrist. Don’t need to pull out a phone to initiate calls.",
    "icon": "//lh3.googleusercontent.com/-DRD_eR93M0qLJyX-8DiAzwyR2vPB5urU3f_kBMChpay8TAZTGdJUyGuQgc0j1OuosDe=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.4,
    "reviews": 4817,
    "developer": "LG Electronics, Inc.",
    "developerId": "6033443741999759446",
    "developerEmail": "LGEAppsCS@lge.com",
    "developerWebsite": "https://kr.m.lgaccount.com/customer/privacy",
    "updated": "May 6, 2015",
    "version": "3.4.4",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "LG Call for android wear is a companion app which is work with LG android wear device. You can enjoy Recent call, Favorite contact and Dial pad from your LG Android Wear device. Make a call on your wrist without pulling out a phone. (Paired with LG G Watch R, LG Watch Urbane)More about LG Call for android wear:★ To use: Pair with LG android wear device via Bluetooth. Simply open the Call app or say “open call” on your watch★ Supports: Android OS 4.3 above ★ Paired with LG G Watch R, LG Watch Urbane (SW update needed for G Watch R) ★ Work as a background without UI menu & IconKey Features:★ All features are only visible on your LG Android Wear device- RECENT CALL: Shows the list of recent call history & Make a call when touch- FAVORITE CONTACT: Shows favorite contact & Make a call when touch- DIAL PAD: Shows dial pad & Make a call when touch.- Modern & Stylish user interface",
    "descriptionHTML": "LG Call for android wear is a companion app which is work with LG android wear device. You can enjoy Recent call, Favorite contact and Dial pad from your LG Android Wear device. Make a call on your wrist without pulling out a phone. (Paired with LG G Watch R, LG Watch Urbane)<br><br>More about LG Call for android wear:<br><br>&#x2605; To use: Pair with LG android wear device via Bluetooth. Simply open the Call app or say &#x201C;open call&#x201D; on your watch<br>&#x2605; Supports: Android OS 4.3 above <br>&#x2605; Paired with LG G Watch R, LG Watch Urbane (SW update needed for G Watch R) <br>&#x2605; Work as a background without UI menu &amp; Icon<br><br>Key Features:<br>&#x2605; All features are only visible on your LG Android Wear device<br>- RECENT CALL: Shows the list of recent call history &amp; Make a call when touch<br>- FAVORITE CONTACT: Shows&#xA0;favorite contact &amp; Make a call when touch<br>- DIAL PAD: Shows dial pad &amp; Make a call when touch.<br>- Modern &amp; Stylish user interface",
    "histogram": {
        "1": 1371,
        "2": 198,
        "3": 399,
        "4": 778,
        "5": 2071
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/R22AUZbY6I6_SFLZzSR-JgfS2epWhXsm2NDX_PHmYq4lVT087YxfxMpyQMu7xEgqfXsl=h310",
        "//lh3.googleusercontent.com/EIzeuYdXErmXHRVi3j-OfVtBiRqEC8ZwaYjrriD5y3P5CVysUU8UH3vENxJdtKGGiiUy=h310",
        "//lh3.googleusercontent.com/Y7Mv7gDFe8DiRiilyYd4x7ekrAWA3rxSK1KjembmXxF9iI9Koy3gX6CDgkj3ctFrMTuF=h310",
        "//lh3.googleusercontent.com/DiTC1eSGw4roi_EJVKkq-ITj9TAj8lVNN4dBv1hPRfbmMvG_FJMWAhlGnWFd8IJnzpo=h310",
        "//lh3.googleusercontent.com/iLvS_xPS9tj-IK6AvEGf7kEWQ9gUksQrsBpS77b39CLHGK2sADI8gnGerLD7LaJA_A=h310"
    ],
    "comments": [
        "This will be my last product from LG Dropping the support for your previous watches like this!! I was an early adopter of LG G Watch R, which is still new and now no support by you (No Apps and no WiFi) although it has the same hardware as your Urbane watch. Believe me if it was not Google who still support us by updating Android Wear, we must have been left alone for along time by you. The most important factor in consumer market is after sale support, which you clearly lack. Sorry LG.",
        "Almost perfect Works well with watch urbane and lg3. Still need phone close by to make calls but you can receive and dial without a problem. If you have trouble seeing your contacts on the watch update your google plus contacts and mark them with the star. That should make them visisble on your watch. Add the speaker app to active your phone speaker on incoming calls. Handy if you are driving without a headset and phone is out of reach. Similar to car blue tooth sync to phone.",
        "Works perfectly on g watch r It took a couple of reboots on phone and watch but it works great. Download the app onto your phone, you do not need to open it and it doesn't appear in your app tray, although you can see it in your 'my app' as a downloaded app. I think I rebooted the watch 3 times and the phone once to get it all synced. App is neat with some handy features which work well.",
        "works perfectly on G Watch R since the 5.1.1 update and with a bluetooth headset : perfect ... my phone stay in my pocket.  for the whinners...  1. i bought my GWR cheaper than the Moto 360 because i thought she was better, well for 50chf less than the M360: she is every bit better than that one, round screen better battery life, better looking .(she always was cheaper and better than the M360)  2. updates are due and arrive at one point or another, for the WIFI stop complaining, it's due in september update. (not that wifi will bring a lot of things but still a nice addition.)  instead of whinning stay informed about the news on your devices ....",
        "No settings and seems to pop up from bottom There are no settings nor does Wear show it as an installed app.  When I first installed it, it popped up on my phone constantly and seemed to pop if I touched the bottom of the screen.   It seems to have settled down now but without any visible sign of an installation it needs setup and controlls  its nice to be able to dial a number or call from fav's or contacts so it is useful just frustraiting",
        "Not working for Marshmallow The app isn't working for Android 6.0 Marshmallow on my dual Sims Lenovo Vibe P1. Because Android chooses only one sim or will ask which sim to use. So I have to take my phone out to make the call. Worked perfectly on Lollipop. Please fix this."
    ],
    "recentChanges": [
        "[v3.4.4]",
        "- Bug fixes and stability improvements",
        "[v3.4.3]",
        "- Outgoing call's animation time increased to 3 seconds from 2 seconds",
        "[v3.4.2]",
        "- Bug fixes and stability improvements",
        "[v3.4.1]",
        "- First release"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.lge.wearcontacts&hl=en&gl=us",
    "appId": "com.lge.wearcontacts"
}