{
    "title": "Pictoword: Word Guessing Games & Fun Word Trivia!",
    "summary": "New guess the word pic guessing games! Adults &amp; kids play puzzles with friends!",
    "icon": "//lh3.googleusercontent.com/cFCur0Kk8LyKLF_DPxKQc704LA6LdXKaw4hmZsD1-KgWkjrFHjkjioDa1fOLbZnrUxA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.6,
    "reviews": 241508,
    "developer": "Kooapps LLC",
    "developerId": "8438468457954317322",
    "developerEmail": "support@kooapps.com",
    "developerWebsite": "http://www.kooapps.com/",
    "developerAddress": "2018 156th Ave NE, Bellevue, WA 98007",
    "updated": "February 21, 2018",
    "version": "1.7.2",
    "genre": "Word",
    "genreId": "GAME_WORD",
    "familyGenre": "Brain Games",
    "familyGenreId": "FAMILY_BRAINGAMES",
    "description": "* Featured Popular and Trending Top in 2018 *Looking for the best free word games to play with friends? Both adults and kids will love this amazing new trivia word game. Get Pictoword for your family and join millions of players worldwide for free!Fans of fun brain training games for kids, teens and adults, this is for you! Pictoword is a cool, simple yet addictive word game where you \"read\" a series of pics that combine to create a word or phrase.Guessing these words will be so much fun. Challenging and fun word puzzles will absolutely enlighten your day for girls and boys. Play single player or multiplayer word games with friends.For example, you'll see pics of SAND and WITCH. Combine the two to solve for SANDWICH - a lunchtime favorite! When you're stumped, try saying the words out loud or ask a friend! Ready? 2 Pics, 1 Word - Can you guess what's the word?Fun addicting games don’t get better than this. See if you can handle the addictive word challenge from Pictoword – the best trivia word games for your phone! Play online or offline games without wifi in your car!Picture Guessing Games for every level of player- Word challenges come in varying difficulty packs- Guessing games are fun for kids in Easy mode- Put your brain to the test with Hard picture packs- Brain training gets even more fun, addicting and intense with the extreme difficulty picture pack!Fun addicting word puzzles in tons of picture guessing categories- Test your knowledge unscrambling words from pics of historical figures, landmarks & countries- Guess the word from pop culture photos of celebrities, characters, movies & brands- Classic word games for free - unscramble over 300 word puzzles in the free classic pack- Puzzles updated all the time! New addicting categories like food, games & more!Word puzzle games any way you like to play- Puzzle yourself with solo mode multi-picture brain teasers- Word puzzle games have no time limit. Train your brain to solve the puzzle!- Brain puzzles are more flexible and fun than ever, letting you play at your paceFun games with friends let you ask for help and share tips- Puzzle game got you stumped? Friends can help solve the word puzzle when you e-mail!- Play with friends & take turns - see who can unscramble letters to solve the puzzle- Facebook connect lets you ask your friends to help you unscramble the word puzzleNew words are always available! Unlock fun new games from Picture Packs and keep guessing in categories like:Guess the celebrity- Guess the celeb in fun brain games that push your pop culture knowledge- This photo puzzle is totally tuned in with top celebrities. Are you?Guess the brand- Guess the logo or restaurant from your favorite brands in challenging tricky word puzzlesTV shows and Movie guess- Guess the movie or TV shows! Can you pick out your favorite movie titles from our pop culture word puzzles?- Movie and TV show trivia fans will have a blast with these addicting games as you scramble to solve puzzles- Guess the cartoon, sitcom or reality show that’s being described in the picturesGuess the place in the Countries & Cities category, solve history trivia in the Historical Figures pack, and show off your nature skills with the Animals pack!Pictoword is an addicting word puzzle game you can play alone or with friends! With exciting picture packs, challenging word puzzles of varying difficulty and tons of word puzzle games to play, you'll have endless hours of brain training unscrambling fun! Guess the word, earn coins & train your brain wherever you are.Download Pictoword today! Best games for 2018 in your pocket, don’t miss out!Read/write storage permissions is used when taking screenshots.Pictoword wants to make sure you're having the best time playing our fun new word game. If you have any comments, questions or feedback, contact us at support@kooapps.com.",
    "descriptionHTML": "* Featured Popular and Trending Top in 2018 *<br><br>Looking for the best free word games to play with friends? Both adults and kids will love this amazing new trivia word game. Get Pictoword for your family and join millions of players worldwide for free!<br><br>Fans of fun brain training games for kids, teens and adults, this is for you! Pictoword is a cool, simple yet addictive word game where you &quot;read&quot; a series of pics that combine to create a word or phrase.<br><br>Guessing these words will be so much fun. Challenging and fun word puzzles will absolutely enlighten your day for girls and boys. Play single player or multiplayer word games with friends.<br><br>For example, you&apos;ll see pics of SAND and WITCH. Combine the two to solve for SANDWICH - a lunchtime favorite! When you&apos;re stumped, try saying the words out loud or ask a friend! Ready? 2 Pics, 1 Word - Can you guess what&apos;s the word?<br><br>Fun addicting games don&#x2019;t get better than this. See if you can handle the addictive word challenge from Pictoword &#x2013; the best trivia word games for your phone! Play online or offline games without wifi in your car!<br><br>Picture Guessing Games for every level of player<br>- Word challenges come in varying difficulty packs<br>- Guessing games are fun for kids in Easy mode<br>- Put your brain to the test with Hard picture packs<br>- Brain training gets even more fun, addicting and intense with the extreme difficulty picture pack!<br><br>Fun addicting word puzzles in tons of picture guessing categories<br>- Test your knowledge unscrambling words from pics of historical figures, landmarks &amp; countries<br>- Guess the word from pop culture photos of celebrities, characters, movies &amp; brands<br>- Classic word games for free - unscramble over 300 word puzzles in the free classic pack<br>- Puzzles updated all the time! New addicting categories like food, games &amp; more!<br><br>Word puzzle games any way you like to play<br>- Puzzle yourself with solo mode multi-picture brain teasers<br>- Word puzzle games have no time limit. Train your brain to solve the puzzle!<br>- Brain puzzles are more flexible and fun than ever, letting you play at your pace<br><br>Fun games with friends let you ask for help and share tips<br>- Puzzle game got you stumped? Friends can help solve the word puzzle when you e-mail!<br>- Play with friends &amp; take turns - see who can unscramble letters to solve the puzzle<br>- Facebook connect lets you ask your friends to help you unscramble the word puzzle<br><br>New words are always available! Unlock fun new games from Picture Packs and keep guessing in categories like:<br><br>Guess the celebrity<br>- Guess the celeb in fun brain games that push your pop culture knowledge<br>- This photo puzzle is totally tuned in with top celebrities. Are you?<br><br>Guess the brand<br>- Guess the logo or restaurant from your favorite brands in challenging tricky word puzzles<br><br>TV shows and Movie guess<br>- Guess the movie or TV shows! Can you pick out your favorite movie titles from our pop culture word puzzles?<br>- Movie and TV show trivia fans will have a blast with these addicting games as you scramble to solve puzzles<br>- Guess the cartoon, sitcom or reality show that&#x2019;s being described in the pictures<br><br>Guess the place in the Countries &amp; Cities category, solve history trivia in the Historical Figures pack, and show off your nature skills with the Animals pack!<br><br>Pictoword is an addicting word puzzle game you can play alone or with friends! With exciting picture packs, challenging word puzzles of varying difficulty and tons of word puzzle games to play, you&apos;ll have endless hours of brain training unscrambling fun! Guess the word, earn coins &amp; train your brain wherever you are.<br><br>Download Pictoword today! Best games for 2018 in your pocket, don&#x2019;t miss out!<br><br>Read/write storage permissions is used when taking screenshots.<br><br>Pictoword wants to make sure you&apos;re having the best time playing our fun new word game. If you have any comments, questions or feedback, contact us at support@kooapps.com.",
    "histogram": {
        "1": 4273,
        "2": 1822,
        "3": 12383,
        "4": 41871,
        "5": 181159
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "3.0 and up",
    "androidVersion": "3.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ukXlvGO9poCO9ggtkBT9yns-nkHj6OogIoHu3gJlLNTZ1BVb-imxGldRiqVdN5ceYQ96=h310",
        "//lh3.googleusercontent.com/WroIf3bPL6WpXTz08sEUOcsR1pw-U2IxVGcb5J6RQZ3cAs2yiAWjwqQxhVVxy4AFpUk=h310",
        "//lh3.googleusercontent.com/bL0ahDtrnoeUMv1bH7vzR-A4wr4r7x4ww4UNrhwiElNvWlx2hTm3OENQnxjPG4iV9A=h310",
        "//lh3.googleusercontent.com/3UwXFLoJZ0tNSC7SlTVqmCEEPzyTfqHrJ2ntjEFsXOu96xsTzQ-MomIpxa-Jcj9U5BU=h310",
        "//lh3.googleusercontent.com/XI-qAIVnzaCmyfFVLuLdP3J6uQaVDWy1vLb5sJBbqSgvEx8kOkZjAukAI_faMtkoTPQ=h310",
        "//lh3.googleusercontent.com/feBlQx_u_1AoqS1_oqfTfDU2awZfNtrJaeDVYYr4ZcO5BgLrlgO0zSH3tE9daMKXQEP2=h310",
        "//lh3.googleusercontent.com/Po3QlCgwtiXh6v-YfHOI8MMmAUMTh5D-Bt9HW1pHQUKjXqAEf9imnoF9P_0_d5bJcrlL=h310",
        "//lh3.googleusercontent.com/h3k0SKqJWoRcHWyssKiEzQnU1GZwv8YnWahJLfFZDWVwvc5RlWXKc_JvCirX_vA4Ejs5=h310",
        "//lh3.googleusercontent.com/dgSPtFhjqQxhRosv1YeqJFA2P94oNKaYsVQna8d1LzH7ggjfvKxdglOgbk7qYuWfUA=h310",
        "//lh3.googleusercontent.com/KEkhhlOtnR9MCKvKkAFqU1dfmbMWKo1yagBl8hPsBWE0gNwIHjoT78bHgFXqZg2QX2o=h310",
        "//lh3.googleusercontent.com/F6cOzvc56yKuQjikV_nEV347txHARqOJuYwxj5FmelX3GKjdWWySvoljnneuH1RkVw=h310",
        "//lh3.googleusercontent.com/ueHR_MntGmd5S0bx3jsPelL_PPVE_d9TMnLFWh0Waclz1gOFogebNF1fhyc3Wq3PR2E=h310",
        "//lh3.googleusercontent.com/hEmZ0uqDcNIDPlhqRnqxPjTygItAXr0g0kuf8oPxDJMsUP1Cs6VhFHNvTNMD6vKpBiE=h310",
        "//lh3.googleusercontent.com/dZOc8lLlaRMD5n9Xvi9KU9ieMcXFtwNTDP2RM6nxXjwuz_aSnsNLbEihYOteIdOX7w=h310",
        "//lh3.googleusercontent.com/f44ZX18XgV0YkpIxYoL_H1DaeRSJO3-MYcI0t4W0qXZ-FOqr-Wm0ycX8k0_bFO_m5BA=h310"
    ],
    "video": "https://www.youtube.com/embed/HZL6P4VUvls",
    "comments": [
        "It's a good game but having an add after every puzzle is a bit much. Yake a bit too much time and easyy to lose interest. Maybe every 5 puzzles wo ups be better I know y'all gotta make your money but the constant ads make me want to uninstall.",
        "SenseLess pictures to form words. Game is designed in a way that you not find words. So you spend on coins. And after revealing, there was no way such words can be formed. For example : Heir(picture of prince) + few buffaloes=? plain =AIRPLANE. what???",
        "It's fun to try and figure out the problem. You get coins easily too. The adds are a bit annoying, but they don't pop up much",
        "Someone always tries to help me-- out loud. And an AD every game (but I chose this free version, and it only takes a second to X out), otherwise great game.",
        "It's ok, I wish the words were harder. The pop ups are far less than many other apps and I like games like this, even more so when they are challenging. I give it 3 stars.",
        "Really fun game! Just a couple of itsy bitsy things that get on my nerves. The coins you win are miniscule compared with how many you need when you use the Help function (even bumping it up to 5 coins for each correct answer would be better) & the other thing...I get that you need ads to keep these games free but does there need to be an ad after EVERY SINGLE PUZZLE??"
    ],
    "recentChanges": [
        "Get your spelling fingers ready and kiss your productivity goodbye! We have some great new changes in this update for Pictoword!",
        "*100 new free puzzles have been added! Picto-nerds rejoice!",
        "*Stronger than a feature film, faster than a box office rush, it's the Super Hero Pack! Available now under theme packs.",
        "*Cloud saving will tie your save file to your Google Play Account!",
        "*Lots of bug and crash fixes!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.kooapps.pictowordandroid&hl=en&gl=us",
    "appId": "com.kooapps.pictowordandroid"
}