{
    "title": "Gallery",
    "summary": "Millions have replaced their gallery with a smart photo gallery. Will you?",
    "icon": "//lh3.googleusercontent.com/7rADIIAXkEedoq9sf6SO4ZiBXkpu-XQCJBxratH4Ij4D1LxH4NbvcdRPLmjdsxfG662h=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.3,
    "reviews": 171230,
    "developer": "Flayvr Media",
    "developerId": "Flayvr+Media",
    "developerEmail": "android@avast.com",
    "developerWebsite": "http://www.avast.com",
    "developerAddress": "AVAST Software s.r.o.\nPikrtova 1737/1a\n140 00, Prague 4\nCzech Republic",
    "updated": "November 22, 2017",
    "version": "3.8.0",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "description": "Gallery is an intelligent photo gallery that learns what is most important to you, organizes your photos & videos into moments, helping you re-live and share life’s best memories.Meet Gallery, the fastest growing gallery app for Android and the first ever gallery for Android Wear.\"... is a smart and well-designed gallery replacement for the built-in phone gallery\"-TechCrunch\"...an intelligent mobile gallery app that displays all your best photos\"-The Next Web\"The genius of Gallery, however, happens under the hood, where a robust personalization system learns which photos mean more to you\"-Business InsiderThe only gallery chosen by Business Insider as one of the Top 100 Apps worldwide, Gallery is a free, next generation photo gallery that’s a complete replacement to your native gallery.With Gallery, you can:ORGANIZE YOUR GALLERY• Automatically organize all of your photos and videos according to your events, date, time, and location into album.• For the classic photo gallery feel, the Gallery view has all of your photos and videos in one slick gallery view.• Use the Moments view for a more unique, collage like view based around events, date, and location.SHARE• Easily share groups of photos and videos from your gallery, with just a tap! • Share album with ease to all of your favorite social networks: WhatsApp, Facebook, G+, Line, Kakao, WeChat, and more.• The easiest and fastest way to create Facebook photo albums, on the fly! HIGHLIGHT GREAT SHOTS & IDENTIFY SIMILAR PHOTOS• Smart Mode - Create a more personalized photo album that highlights the best photos in your photo gallery, identifies similar shots, and centers photo thumbnails around smiling faces!• Intelligent notifications - Have Gallery help you rediscover those photos from your trip abroad last month, your kids’ birthday last year, or any important memory that’s been lost in your gallery.KEEP ALL OF YOUR PHOTOS & VIDEOS SAFE IN ONE PLACE• A gallery that's not backed up is a sad photo gallery!• Integrate Gallery with your Google Photos (Picasa) so you can view and manage all of your photos & videos in one cloud gallery.VIEW YOUR GALLERY ON YOUR WRISTGallery offers the first ever photo gallery created for smartwatches. With Gallery on Android Wear, you can:• View or Delete your gallery photos - all from your smartwatch!• Share photos and albums directly to Facebook, on the fly.• Photo Notifications - Easily access your latest photos from your gallery with just a tap.FAQWhy replace my native gallery?Gallery is the only photo gallery that works for you - gone are the days of endless scrolling in your gallery in search of life’s best memories. Gallery is the only gallery app that learns about you the more you use it.How does Gallery work?Gallery has a strong technological difference from other gallery apps. The Gallery Curation Engine (GCE) uses computer vision and big data to understand what makes a great photo.Gallery then organizes the photos and videos in your gallery into moments that can be easily relieved and shared.PERMISSIONSAbout our permissionsCalendar - Gallery asks for permissions to read your calendar so that we can auto-title your moments based on your calendar events. We do not use this information for any other purpose.About PrivacyYour privacy is important to us! Gallery does not copy or store your photos and videos. Only the photos & videos which you have specifically chosen to share from your gallery will be uploaded to our secure servers.",
    "descriptionHTML": "<b>Gallery is an intelligent photo gallery that learns what is most important to you, organizes your photos &amp; videos into moments, helping you re-live and share life&#x2019;s best memories.<br><br>Meet Gallery, the fastest growing gallery app for Android and the first ever gallery for Android Wear.</b><br><br><i>&quot;... is a smart and well-designed gallery replacement for the built-in phone gallery&quot;</i><br>-TechCrunch<br><br><i>&quot;...an intelligent mobile gallery app that displays all your best photos&quot;</i><br>-The Next Web<br><br><i>&quot;The genius of Gallery, however, happens under the hood, where a robust personalization system learns which photos mean more to you&quot;</i><br>-Business Insider<br><br><b>The only gallery chosen by Business Insider as one of the Top 100 Apps worldwide, Gallery is a free, next generation photo gallery that&#x2019;s a complete replacement to your native gallery.</b><br><br><br><u>With Gallery, you can:</u><br><b>ORGANIZE YOUR GALLERY</b><br>&#x2022; Automatically organize all of your photos and videos according to your events, date, time, and location into album.<br>&#x2022; For the classic photo gallery feel, the Gallery view has all of your photos and videos in one slick gallery view.<br>&#x2022; Use the Moments view for a more unique, collage like view based around events, date, and location.<br><br><b>SHARE</b><br>&#x2022; Easily share groups of photos and videos from your gallery, with just a tap! <br>&#x2022; Share album with ease to all of your favorite social networks: WhatsApp, Facebook, G+, Line, Kakao, WeChat, and more.<br>&#x2022; The easiest and fastest way to create Facebook photo albums, on the fly! <br><br><b>HIGHLIGHT GREAT SHOTS &amp; IDENTIFY SIMILAR PHOTOS</b><br>&#x2022; Smart Mode - Create a more personalized photo album that highlights the best photos in your photo gallery, identifies similar shots, and centers photo thumbnails around smiling faces!<br>&#x2022; Intelligent notifications - Have Gallery help you rediscover those photos from your trip abroad last month, your kids&#x2019; birthday last year, or any important memory that&#x2019;s been lost in your gallery.<br><br><b>KEEP ALL OF YOUR PHOTOS &amp; VIDEOS SAFE IN ONE PLACE</b><br>&#x2022; A gallery that&apos;s not backed up is a sad photo gallery!<br>&#x2022; Integrate Gallery with your Google Photos (Picasa) so you can view and manage all of your photos &amp; videos in one cloud gallery.<br><br><b>VIEW YOUR GALLERY ON YOUR WRIST</b><br>Gallery offers the first ever photo gallery created for smartwatches. With Gallery on Android Wear, you can:<br>&#x2022; View or Delete your gallery photos - all from your smartwatch!<br>&#x2022; Share photos and albums directly to Facebook, on the fly.<br>&#x2022; Photo Notifications - Easily access your latest photos from your gallery with just a tap.<br><br><b>FAQ</b><br><u>Why replace my native gallery?</u><br>Gallery is the only photo gallery that works for you - gone are the days of endless scrolling in your gallery in search of life&#x2019;s best memories. Gallery is the only gallery app that learns about you the more you use it.<br><br><u>How does Gallery work?</u><br>Gallery has a strong technological difference from other gallery apps. The Gallery Curation Engine (GCE) uses computer vision and big data to understand what makes a great photo.<br><br>Gallery then organizes the photos and videos in your gallery into moments that can be easily relieved and shared.<br><br><b>PERMISSIONS</b><br><u>About our permissions</u><br>Calendar - Gallery asks for permissions to read your calendar so that we can auto-title your moments based on your calendar events. We do not use this information for any other purpose.<br><br><u>About Privacy</u><br>Your privacy is important to us! Gallery does not copy or store your photos and videos. Only the photos &amp; videos which you have specifically chosen to share from your gallery will be uploaded to our secure servers.",
    "histogram": {
        "1": 9948,
        "2": 4910,
        "3": 12106,
        "4": 35375,
        "5": 108891
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/WtCgF5A3pW6CHUZbwQmc99V07Bhv7tguS5ddSDHeEGJEkpYMn3hyvvehCDXYrLpi2d9Q=h310",
        "//lh3.googleusercontent.com/7SlTocaL-OUbt6m1GI1prL6Uk_wsv0KLCegmh7xJBunwQMPQQ6JGiAzWQzskYHv-buY=h310",
        "//lh3.googleusercontent.com/5myI6JUDPowD28ISW6VooF9mP1okyGxf4ajdwb_rgtFOMINo8bv0MWaV127ukdloaRQ=h310",
        "//lh3.googleusercontent.com/6l5y4ab3bR-KNOrJPfi0jd4wBK_zQLDqsDt6D6ZdtHu1KuEoXyCXA4JZhCMDkZfz4JmT=h310",
        "//lh3.ggpht.com/tKxixEeg0mxB7t2-5NWRPcVMWLDMwY2G9lb_pAR1-8IxMfajFL1sW6xt2pN_ugm9AA=h310",
        "//lh4.ggpht.com/7IrvCnbY7W4Vtj7h94TgeijI7o4myGdILVoXc1pEMI2dtopjEvhatykdn8t1Om6hcbA=h310",
        "//lh3.googleusercontent.com/bb95jItdd0jS_-lT4Mqhqlelu1gSvd_sEmWvKLLdZjgqAARCcwWC6QWMjNYOGt8si8g=h310",
        "//lh3.googleusercontent.com/D_QkWDAse6l_a2q3YCC8T0Lt7GtrNAkcP8of5ogvkPSEg1enLKaXh5cQR7QcRqls20Y=h310",
        "//lh3.googleusercontent.com/-w3rH2DKX5coBDD6ihdckyepquk868cd-sc2BtJnVTrnTtf9AtYVVYewMeMrbeywSg=h310",
        "//lh3.googleusercontent.com/MtN_G9qUuE_gyvez8uOKw1w4naH54kKDyoGGGiNue8RRX-rI3Oz-FA5d7FwH-FTeXQ=h310",
        "//lh3.googleusercontent.com/Z-7xU6SOgM5E6d0hPQVz9lNyqZRVwJ0ls76Q_deH42g4my7YP3GDEc8zMBh2w6shiQ=h310",
        "//lh3.googleusercontent.com/h1iL_26Y7tb1MzJ_LUSwABYzpDjQR945Vdpu3d-mz3vAY_LBiVQJ4IXhle3Brr9_Hl4=h310",
        "//lh3.googleusercontent.com/_86YAw15DLvaU0VXeWXXpau8z27E56beIrTOlSajmA0SiR0H-oqENZLJqwBz34ryHZ32=h310",
        "//lh3.googleusercontent.com/yQg4qD07Xn_SOaJwGM2s5calJ105iab8sDH0glCd_2NloGGVqT4bcmItMKU_XXX7-V7i=h310",
        "//lh3.googleusercontent.com/cVgU7BsGNPq7TkXPtHQnq2yXnN6XtOWeerSTQJAmK31XyfabFI0pDJIYYRgpIeWupIh5=h310",
        "//lh3.googleusercontent.com/_7jlxJof7LsKF2yAETLzxSiej9NKy0Luqdq7zRPS8uOHYXt_yNro58JUoT-lkAUdBw=h310",
        "//lh3.googleusercontent.com/Fc1eQvAjfO5c7ZMAGIoSXOrbGVwNTgFOu2D8q8S8xS39Axtj_NwVq3_LYtHXg9InhVg=h310",
        "//lh3.googleusercontent.com/zN2ZNA-9D1BXPlS1KMAKyHB943Czpo_ReVmRRSvhf0d0gzECARYCkMs2kKVKLsdBUJ0=h310",
        "//lh3.googleusercontent.com/mK-Z8uZLRGbfOjomM_9hue8z1rmJ2OdKowyT4HZy2PRbMFP-Uy3_Ppq2wSmTHJbnFg=h310",
        "//lh3.googleusercontent.com/mHkRD-Tcpcspw-KotcQEKZJFFkR9PXAT0KEIExAzeFIo_3Oi9h6IBfeX4YdYOxZXfDM=h310"
    ],
    "comments": [
        "Supports gifs however when viewing a gif, the app adds a weird white block to the right of the gif and glitches the resolution of the gif. Please fix immediately. This app is great and from what I read it had all the bells and whistles but I love my gifs and memes! The no-ad feature is nice, something a lot of third-party gallery apps lack. I love this third-party app for the reason a good trustworthy developer is behind it.",
        "I like the app...It's the best amongst others but now that I have changed my phone to one plus 5t the image rotate and are half cut so please fix this issue. I want to purchase the app but not until it is compatible to my new phone.",
        "At first the ads were annoying, but i get it - a free app might have ads to pay the bills. But then they started video ads.  I'd be trying to show a client a picture of some of my work and then a video ad would start playing, with sound, with no way to turn it off. I'm done with this app",
        "I like how it has a folder that is literally every photo from every folder, it's a nice feature, but the inability to add photos onto my SD card is a bit annoying. Not sure if apps are capable of doing that, though. And it seems to sometimes get cover photos stuck as photos no longer downloaded to my phone.",
        "It wasn't that bad until these last couple updates & the ads got to be way too much. I don't need to see ads from an app on my lock screen every time i go to open my phone. I'm uninstalling it right now.",
        "I \"almost\" love this app. However, it is unfortunately frustrating if you have delete picture multiple times just to make it go away. Everytime I need to delete any pictures, I need to close this app in the background to actually delete pictures."
    ],
    "recentChanges": [
        "- Streamlined Moment sharing",
        "- Fixed issues related to screen rotation"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.flayvr.flayvr&hl=en&gl=us",
    "appId": "com.flayvr.flayvr"
}