{
    "title": "Cisco Jabber",
    "summary": "Collaborate with video, voice, instant messaging and presence on Android device.",
    "icon": "//lh5.ggpht.com/8SJwWIlSqvTU_zBEOht4diByqRNgzGlVNh0qlv8B69cm1qevWgDGTx5DRb8s_0-EtaW8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.9,
    "reviews": 9744,
    "developer": "Cisco Systems, Inc.",
    "developerId": "Cisco+Systems,+Inc.",
    "developerEmail": "jabberfeedback@cisco.com",
    "developerWebsite": "http://www.cisco.com/c/en/us/products/unified-communications/jabber-android/index.html",
    "updated": "December 7, 2017",
    "version": "11.9.3.257962",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Product Description: Cisco Jabber™ for Android is a collaboration application that provides presence, instant messaging (IM), voice and video calling, and visual voice messaging capabilities on Android phone, tablet and Android Wear devices.  Escalate your Jabber calls into multi-party conferencing with Cisco WebEx® Meetings.  This integrated collaboration experience works with both on premise and cloud-based Cisco collaboration architectures. This application supports the following capabilities: •\tIntegrated voice calling•\tHigh-quality video calling with interoperability to Cisco TelePresence and other video endpoints•\tIM, presence•\tVisual voicemail •\tOne-tap escalation to WebEx meetings (cross-launches the Cisco WebEx® Meetings application) Device and Operating System Requirements:Cisco Jabber for Android Release 11.9 is officially supported on the following Android devices. (Refer to the Product Release Notes for more deployment details including Android OS version support and any potential update considerations):•\tSamsung devices that meet the minimal hardware requirement •\tGoogle Nexus 4, 5, 5x, 6, 6P,7, 9, 10, Pixel C, Pixel, Pixel XL•\tBlackberry Priv•\tSony Xperia ZR, M2, Z1, Z2, Z3, Z4, Z5, XZ•\tLG G2, G3, G4, G5 Optimus G Pro, V10•\tHTC One Max, M7, M8, M9, E9, A9, X9 Plus•\tMotorola Moto G, X, MC40, Z Droid•\tHuawei Ascend G6, Mate 7, Mate 8,Mate 9, P8, P9, Honor 7, M2•\tXiaomi 4, 4C, 5, Note, Note 2, Max, Pad, Pad2•\tSonim XP7•\tFujitsu Arrows M305, M555•\tHoneywell CT50•\tZebra MC67•\tPanasonic: Toughpad FZ-X1•\tCisco DX 650, DX70, DX80 For more information about Cisco Jabber, visit: http://www.cisco.com/go/jabberIMPORTANT: If connecting to Cisco Unified Communications Manager, administrators must enable the correct Cisco Jabber for Android configurations, or proper connectivity will not be established. For details, review the Cisco Jabber Installation and Configuration Guide.IMPORTANT: Most of the features described above are specific to a particular system configuration. Please check with your IT administrator to determine the specific features that are available to you. Portions of Cisco Jabber are licensed under the GNU Lesser General Public License (LGPL), and are “Copyright © 1999 Erik Walthinsen omega@cse.ogi.edu”. You may obtain a copy of the LGPL license at http://www.gnu.org/licenses/lgpl-2.1.html.Cisco, Cisco Unified Communications Manager and Cisco Jabber are trademarks of Cisco Systems, Inc. Copyright © 2013 - 2017 Cisco Systems, Inc. All Rights Reserved. By tapping “Install” you agree to install Jabber and all future software updates, and you accept the terms of service and privacy statement below:http://www.cisco.com/web/siteassets/legal/privacy.html http://www.cisco.com/web/siteassets/legal/jabber_supp.htmlSupport URLhttp://www.cisco.com/c/en/us/support/unified-communications/jabber-android/tsd-products-support-series-home.html\tConsult the Cisco Support Forums at http://supportforums.cisco.com or email to jabberfeedback@cisco.com if you encounter issues with unsupported devices.Marketing URLhttp://www.cisco.com/go/jabber What’s New-\tSignificantly faster Jabber client login and session reconnection experience-\tImproved experience when making a call while chatting-\tAnimated emoticons-\tExpanded device support-\tSecurity enhancements-\tStability Improvements",
    "descriptionHTML": "Product Description: <br><br>Cisco Jabber&#x2122; for Android is a collaboration application that provides presence, instant messaging (IM), voice and video calling, and visual voice messaging capabilities on Android phone, tablet and Android Wear devices. &#xA0;Escalate your Jabber calls into multi-party conferencing with Cisco WebEx&#xAE; Meetings. &#xA0;This integrated collaboration experience works with both on premise and cloud-based Cisco collaboration architectures. <br><br>This application supports the following capabilities: <br><br>&#x2022;\tIntegrated voice calling<br>&#x2022;\tHigh-quality video calling with interoperability to Cisco TelePresence and other video endpoints<br>&#x2022;\tIM, presence<br>&#x2022;\tVisual voicemail <br>&#x2022;\tOne-tap escalation to WebEx meetings (cross-launches the Cisco WebEx&#xAE; Meetings application) <br><br>Device and Operating System Requirements:<br>Cisco Jabber for Android Release 11.9 is officially supported on the following Android devices. (Refer to the Product Release Notes for more deployment details including Android OS version support and any potential update considerations):<br>&#x2022;\tSamsung devices that meet the minimal hardware requirement <br>&#x2022;\tGoogle Nexus 4, 5, 5x, 6, 6P,7, 9, 10, Pixel C, Pixel, Pixel XL<br>&#x2022;\tBlackberry Priv<br>&#x2022;\tSony Xperia ZR, M2, Z1, Z2, Z3, Z4, Z5, XZ<br>&#x2022;\tLG G2, G3, G4, G5 Optimus G Pro, V10<br>&#x2022;\tHTC One Max, M7, M8, M9, E9, A9, X9 Plus<br>&#x2022;\tMotorola Moto G, X, MC40, Z Droid<br>&#x2022;\tHuawei Ascend G6, Mate 7, Mate 8,Mate 9, P8, P9, Honor 7, M2<br>&#x2022;\tXiaomi 4, 4C, 5, Note, Note 2, Max, Pad, Pad2<br>&#x2022;\tSonim XP7<br>&#x2022;\tFujitsu Arrows M305, M555<br>&#x2022;\tHoneywell CT50<br>&#x2022;\tZebra MC67<br>&#x2022;\tPanasonic: Toughpad FZ-X1<br>&#x2022;\tCisco DX 650, DX70, DX80<br> <br>For more information about Cisco Jabber, visit: http://www.cisco.com/go/jabber<br><br><br>IMPORTANT: If connecting to Cisco Unified Communications Manager, administrators must enable the correct Cisco Jabber for Android configurations, or proper connectivity will not be established. For details, review the Cisco Jabber Installation and Configuration Guide.<br><br>IMPORTANT: Most of the features described above are specific to a particular system configuration. Please check with your IT administrator to determine the specific features that are available to you. <br><br>Portions of Cisco Jabber are licensed under the GNU Lesser General Public License (LGPL), and are &#x201C;Copyright &#xA9; 1999 Erik Walthinsen omega@cse.ogi.edu&#x201D;. You may obtain a copy of the LGPL license at http://www.gnu.org/licenses/lgpl-2.1.html.<br><br>Cisco, Cisco Unified Communications Manager and Cisco Jabber are trademarks of Cisco Systems, Inc. Copyright &#xA9; 2013 - 2017 Cisco Systems, Inc. All Rights Reserved.<br>&#xA0;<br>By tapping &#x201C;Install&#x201D; you agree to install Jabber and all future software updates, and you accept the terms of service and privacy statement below:<br>http://www.cisco.com/web/siteassets/legal/privacy.html <br>http://www.cisco.com/web/siteassets/legal/jabber_supp.html<br><br>Support URL<br>http://www.cisco.com/c/en/us/support/unified-communications/jabber-android/tsd-products-support-series-home.html<br>\t<br>Consult the Cisco Support Forums at http://supportforums.cisco.com or email to jabberfeedback@cisco.com if you encounter issues with unsupported devices.<br><br>Marketing URL<br>http://www.cisco.com/go/jabber<br>&#xA0;<br>What&#x2019;s New<br>-\tSignificantly faster Jabber client login and session reconnection experience<br>-\tImproved experience when making a call while chatting<br>-\tAnimated emoticons<br>-\tExpanded device support<br>-\tSecurity enhancements<br>-\tStability Improvements",
    "histogram": {
        "1": 1105,
        "2": 602,
        "3": 998,
        "4": 2183,
        "5": 4856
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/yTvFlG0Q73lh_9fcXvDvbagXsTQbqT1V5CZd_mt6j26EYKrHgCda9VhkgGsYgEZwnrA=h310",
        "//lh3.googleusercontent.com/XBGz7d9yJzP8OA7xFFQGLipxERIKlv_CNtmgHldXKdbFq-459en3IRb21K388Jnh-Fk=h310",
        "//lh3.googleusercontent.com/Cf2JTmhLs0SL7l-XTnHqdsja-WNcTvEpnCfBouG6SZ0HcuOXOZ8PkBf1TkBhwXQSUg=h310",
        "//lh3.googleusercontent.com/Xz5ZMsCqK19A4GmvQzYZoQyEW7owwLSCjic4bChyQ-xJ2EWgfX9SOMXjYRcghwFzmg=h310",
        "//lh3.googleusercontent.com/qzQV05SNMjMfQlhwdoNVpzSGULVq5nOhLm1kW9LXAwZDhgcCYvfjtzOz7KzeMk6UqKo=h310",
        "//lh3.googleusercontent.com/4dREuqA7cgRg7qijdfu8XuB-xVB6nqQkLMf3qPcdEwbvJcHnk-MR_t0s71jC143U_Q=h310",
        "//lh3.googleusercontent.com/dxPhvTkS5s-pl4r0HRNRzxZfPKmtMjAlFAfVLcGx1KrHkXPW4bTCmVDFwUsJP5CeUGI=h310",
        "//lh3.googleusercontent.com/iSFwWFGKu0Bf1RKVPMSMKE4oO0QvdxvTSe-SY3NfBnYhLT3HEmZUp7ywFmRl_iXfaIM=h310",
        "//lh3.googleusercontent.com/ayPtbP5E6_4zgio3Za6gXccEPNIiGd93q_UqNqOZJs1e5lxDvfYZqMZ-kYJ6D6IMzLQ=h310",
        "//lh3.googleusercontent.com/uYCFvhER34LGCxG3Y5empVUq_tV_L1gEtVtp8dgm6N5Cv6CM6PguGS2x7rXfqCN1Gw=h310",
        "//lh3.googleusercontent.com/1Cxcsxk1a1ZUxsgwVjzDPZJKEsEJzym9-qfjzGrXnOmn4YZX6GKUyjmHpnd4_6oTtg=h310",
        "//lh3.googleusercontent.com/wcxN1riJaGdz-s1E3bgYiHx08qhwehvoknXZqh6F1tM_OGa3zF9TysFqbwPOYb5P2qA=h310",
        "//lh3.googleusercontent.com/mf9o0uKvoUBUhREwhVP2v1b6D0lnrZxAW0Z2GAi9_EEWOGy1HNOWjXqjcRrQ9tq6mZI=h310",
        "//lh3.googleusercontent.com/oNIevuVptOOrbDItC6JL_Uqkf38iKobFHfLO5oA_L58JXCycNfJgj-xRhIqRvBlvHW1T=h310",
        "//lh3.googleusercontent.com/O30baRUguSIABeO_azNrIbbujZvMLBh7FmgLpQEXvggDwVOEXXi-lT36Q_gT2Fbyfnhd=h310",
        "//lh3.googleusercontent.com/J-uSPXi_ZuvC_ldhX_81TROHIPPNn884_W75Y5rUuy2fy540cGPRwyIU_Jl4PFgNBA=h310",
        "//lh3.googleusercontent.com/K6Od46qITvnOso8rGwo5cZEe021_mU184FDRWOfH45_vBvp1-1fcP2X0A0lAn8HpHA=h310",
        "//lh3.googleusercontent.com/BTR9iXHi3MjkjSapy5M_K3Ow8zTzcu38vXfkBFrHSiYVXrIHPP14yasOaQzCNeAvvg=h310",
        "//lh3.googleusercontent.com/_8-CzHTkj1BQnc-vw8_wbNPz_NHjt13alLOFxxLskYis9S_BlFigAYn9_yOY3CFf114=h310",
        "//lh3.googleusercontent.com/NCHxHOozonpRv-s_qzHi5zFPtVvAYnq6rkwkaUyukd-8RgXxKZi5tbriE2F3pnYlSwD0=h310",
        "//lh3.googleusercontent.com/fjvG-iuui_JJVD2tVsZlCzGeUFwAna9K_ZFPku3nHfMqhHuM_T_2_ZVPAMoHO1RREuM=h310"
    ],
    "comments": [
        "After update still issue persists. Mine phone is Xiomi A1, stock Android phone. Phone gets restarts when make call to extension number or local telephone numbers. All other applications are working fine in this mobile. In our Network other user's phone are working fine without any issues, Including some other Xiomi  model. Can you please look in to this issue...",
        "Hi guys! I'm a system engineer and I work with features and collab applications made by Cisco. Guys this app is awesome but I'm facing a weird issue with cellphones Xiaomi A1 running Android One. After the last update when I place a call or when a receive a call, the phone stucks and restarts, usually after 5 seconds call duration. Guys you really need fix this issue.",
        "Better than the desktop app, but that isn't saying much.   Really not pleased with having to use Their client when all I want to use is the Jabber/XMPP messaging service.  Turning open standards into vendor lock in.  Magic! :(",
        "Very unstable lately on Android platform. Used to be rock solid. Lots of connection problems and dropouts. Will disconnect for no reason and refuses to reconnect, even when Apple iPad and Windows 10 are working fine. After clearing all the data and re-signing it finally reconnect after about 10 attempts. Also what helps pretty consistently  is in this exact order do the following:   Sign out Go to app manager in settings and do a force stop. Relaunch it and sign in",
        "Frustrating to use.  It disconnects when it wants to, making phone calls is hit or miss (mostly miss) as the callers can't hear me and vice-versa, and I routinely have to tap “RESET JABBER” to at least get it connecting to the server again.  Only reason I use this app is because work requires it.  :/",
        "Keep the Green and Red buttons in the same place! When I'm answering a call the Green button is on the right hand side and the red 'hang up' is on the left, but as soon as I answer I the call the red button jumps to the right. Any slight delays in the app and I end up hanging up immediately after answering!"
    ],
    "recentChanges": [
        "-      Stability Improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.cisco.im&hl=en&gl=us",
    "appId": "com.cisco.im"
}