{
    "title": "The Guardian",
    "summary": "Award-winning journalism in an award-winning app.",
    "icon": "//lh3.googleusercontent.com/vKfEYq1gqPMEOo3i07YsU5-5T6AqPDkwazwMaoDXqurK_-1PtEbk3nrB6oRZt4PxPAnh=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.7,
    "reviews": 231888,
    "developer": "Guardian News & Media Ltd",
    "developerId": "Guardian+News+%26+Media+Ltd",
    "developerEmail": "userhelp@theguardian.com",
    "developerWebsite": "http://www.theguardian.com",
    "developerAddress": "Kings Place, 90 York Way\nLondon N1 9GU",
    "updated": "February 21, 2018",
    "version": "5.3.1506",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "description": "Make space for the issues that matter. The Guardian app gives you breaking news and full access to all of our award-winning journalism. Keep reading when you're offline, tailor your home screen with the sections that matter most to you, follow your favourite writers and stories using personalised notifications, save content for as long as you like, and get compelling journalism at any time on your devices.• Access the full range of Guardian journalism, specially designed for your phone or tablet• Stay up to date with live news and sport• Receive breaking news alerts to be informed of the big moments• Enjoy award-winning audio, video and interactive content, as well as full-screen galleries, with stunning Retina-quality images• Keep reading even when you’re offline• Make it yours by choosing the sections and topics that appear on your home screen• Follow your favourite stories, series, writers and football teams for personal notifications• Save any content you want to keep for a later date• Read comments on articles and share your own thoughts• Search by keyword, topic, series, section, or contributor• Upgrade to the premium tier for our daily crosswords, specially curated content, extracts from Guardian Books, and an advert-free experienceThis app is totally free to use. If you choose to upgrade to the premium tier, your payment can be taken immediately and is processed by Google Play.Terms of use:All content in the Guardian app is copyright Guardian News & Media 2018. All rights reserved. Terms of use and privacy policy apply when accessing content via the Guardian app.• Privacy policy: http://www.theguardian.com/help/privacy-policy• Terms and conditions: http://www.theguardian.com/help/terms-of-service",
    "descriptionHTML": "Make space for the issues that matter. The Guardian app gives you breaking news and full access to all of our award-winning journalism. <br><br>Keep reading when you&apos;re offline, tailor your home screen with the sections that matter most to you, follow your favourite writers and stories using personalised notifications, save content for as long as you like, and get compelling journalism at any time on your devices.<br><br>&#x2022; Access the full range of Guardian journalism, specially designed for your phone or tablet<br>&#x2022; Stay up to date with live news and sport<br>&#x2022; Receive breaking news alerts to be informed of the big moments<br>&#x2022; Enjoy award-winning audio, video and interactive content, as well as full-screen galleries, with stunning Retina-quality images<br>&#x2022; Keep reading even when you&#x2019;re offline<br>&#x2022; Make it yours by choosing the sections and topics that appear on your home screen<br>&#x2022; Follow your favourite stories, series, writers and football teams for personal notifications<br>&#x2022; Save any content you want to keep for a later date<br>&#x2022; Read comments on articles and share your own thoughts<br>&#x2022; Search by keyword, topic, series, section, or contributor<br>&#x2022; Upgrade to the premium tier for our daily crosswords, specially curated content, extracts from Guardian Books, and an advert-free experience<br><br>This app is totally free to use. If you choose to upgrade to the premium tier, your payment can be taken immediately and is processed by Google Play.<br><br>Terms of use:<br>All content in the Guardian app is copyright Guardian News &amp; Media 2018. All rights reserved. Terms of use and privacy policy apply when accessing content via the Guardian app.<br><br>&#x2022; Privacy policy: http://www.theguardian.com/help/privacy-policy<br>&#x2022; Terms and conditions: http://www.theguardian.com/help/terms-of-service",
    "histogram": {
        "1": 3245,
        "2": 1822,
        "3": 4752,
        "4": 47257,
        "5": 174812
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/LAa2gAIJNpDl8XT69-iZN6GrjzCsGu5XZkyQ3DCMeS_4ki1IA85GHoWrg01m4HOjW4li=h310",
        "//lh3.googleusercontent.com/L6LprHA0MS0TGscLIWIgMPxaf2c5dMo0N3ZVscER7OZWQj2md2n_ZDTq180Ifd-8Jg=h310",
        "//lh3.googleusercontent.com/H-BVOoZMriWDEXgZRj4LWDcDBYpR4VBBjirto0hWibHMbHW7MpiuGGZtRxDTlDYqBOaa=h310",
        "//lh3.googleusercontent.com/ce8gIYjhGT9NbVttyh8419Z69YVxBfW3SO9ZaU5X9htWaPWOsckWYV4e4U_n76HLsIg=h310",
        "//lh3.googleusercontent.com/cb2FF8xAZ4IOQnIILj8wv4-RAQyMvjSsNKUI3PdcH16gqOAR3fmNWEpOde9jqe6F8f4M=h310",
        "//lh3.googleusercontent.com/PxLYaL66YmjaAE3QO2InSBNuXIXdIcjFMRxmNjbfzSDDupu5_s1yrg6vam1AOyrlsA=h310"
    ],
    "comments": [
        "The Guardian is the best, most informative and reliable source of news and events. I particularly enjoy the thoughtful opinion pieces. The readers' comments range from insightful and thought provoking to the myopic and poorly written. I enjoy the ability to add my voice to the cacophony. Reading the Guardian is  pleasure, though what I read often makes me sad or angry. For the times we live, the voice of the Guardian is a beacon of freedom. It must never be allowed to be extinguished.",
        "There's probably not a better free app out there ... and not many paid ones either. There's an opportunity to contribute financially - and you should if you can. In a sensible world it would be seen as middle-of-the-road. I find it relevant and quick off the mark",
        "Too bad the comment streams \"jump\" many times during normal use, to the point where following a discussion or participating is unworkable. User's own comments stream also randomly \"forget\" some comments, even though they exist on the web.",
        "Visually appealing, no ad distraction, seems to be as much content as the paid version. Would much prefer to pay and support  as free is unsustainable. Still pay for the now unsupported subs version. Shame Guardian forced down this loss making route but without journalistic compromise. How long will it last.",
        "I previously had the shambolic BBC news app. So what a ray of sunshine this app is. Allows you to edit what news stories you wish to have on your homepage, so everything is just a swipe away. 5 stars.",
        "The articles are great as usual, but unfortunately the crosswords are no longer playable. With the latest update, when I click on a particular clue, it just turns into a solid black bar, therefore unreadable. As they are one of the main reasons I subscribe, I will be cancelling until an update has been issued to fix this problem."
    ],
    "recentChanges": [
        "Version 5.3 is mostly conspicuous, except for the changes to Opinion articles which are now presented with a light pink background.",
        "Notable bugs fixed in this version:",
        "* Unable to read selected crossword clue due to dark background.",
        "* (Older devices) Grey toolbar at the top of the screen, now white."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.guardian&hl=en&gl=us",
    "appId": "com.guardian"
}