{
    "title": "Musixmatch - Lyrics for your music",
    "summary": "Rediscover the music you love with lyrics and translations",
    "icon": "//lh4.ggpht.com/yrUJPyt4kgNtLTnWK42fHteubCfllwm-Hk0uDut2jQr96mkch4-uNwEoQXwVIEtmUeGd=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000000,
    "maxInstalls": 100000000,
    "score": 4.5,
    "reviews": 1822222,
    "developer": "Musixmatch",
    "developerId": "Musixmatch",
    "developerEmail": "support+android@musixmatch.com",
    "developerWebsite": "https://www.musixmatch.com",
    "developerAddress": "via Timavo 34\n20124 Milano MI\nItaly",
    "updated": "February 23, 2018",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Musixmatch is the world’s largest collection of song lyrics used by millions of people to get instant synchronised lyrics for Youtube, Spotify, Pandora and more. You can also now use it to get song translations on the go.KEY FEATURES:Musixmatch lets you:\t• Enjoy song lyrics with music from Spotify, Youtube, Pandora, Apple Music, SoundCloud, Google Play Music and all your other favourite streaming services\t• Tap on the real- time notification to display the Floating Lyrics widget and get the current track’s lyrics\t• Easily learn new languages by displaying the translation of the lyrics, in time with music. \t• Identify and get the lyrics to any song that’s playing around you with one tap\t• Search for your favourite song by title, artist and even just using a single line of the lyricsADDITIONAL FEATURESWith Musixmatch you can also:\t• Use the smart seek to find your favourite lyrics by easily skipping through a song using the the progress bar\t• Share your favourite song lyrics on amazing backgrounds with the LyricsCard feature\t• Play Youtube videos in full screen, on landscape mode, to enjoy the FloatingLyrics fully integrated with the video \t• Play, pause, skip track from your lock screen\t• Get notified instantly when new lyrics from your favourite artists are available\t• Quickly and easily find all your favorites on your profile\t• Preview songs or watch their Youtube videos\t• Collect your identified songs in a Spotify playlist\t• Join our Community so you can submit all your favourite lyrics, put them in time with music and even have fun translating them \t• Fetch song info and cover art for your songs.WEARABLES & TV STREAMING  • Musixmatch is available on your Android Wear devices  • Enjoy Musixmatch at home casting local music and lyrics to your TV with ChromecastMUSIXMATCH PREMIUM FEATURESOffline lyrics - enjoy all the lyrics you have viewed without a connection.No ads - get all the lyrics with no ads.No commitment - cancel any time you like.GET STARTEDNot sure where to start?Be sure to have enabled the FloatingLyrics and let Musixmatch find lyrics for your songs on Spotify, Pandora, Play music, Youtube, SoundCloud and more.COMMUNITYLove Musixmatch? Don’t miss our updates:Musixmatch Blog: https://blog.musixmatch.com/Facebook: https://www.facebook.com/musixmatchTwitter: https://twitter.com/MusixmatchInstagram: https://www.instagram.com/musixmatch/G+: https://plus.google.com/+musixmatchSpotify: https://open.spotify.com/user/musixmatchPROBLEMS? FEEDBACK?We love receiving your feedback, they help us to improve Musixmatch. Reach us: on Twitter: @musixmatch or via email Visit our Support: https://support.musixmatch.comREVIEWS AND HONORS Awarded in Android Excellence Apps 2018.The best Music Player as for AndroidPolice, Android Authority and The Next Web.\"Best Apps 2014 and 2015\" selection on Google Play Store.+50,000,000 people enjoying their Music with the power of LyricsGoogle Play Editor Choice with +1,2 mln 5 stars reviewsPERMISSIONS *We only ask for the permissions we need for the app to be at its best.Musixmatch requests the \"Notification access\" permission only to listen for music.",
    "descriptionHTML": "Musixmatch is the world&#x2019;s largest collection of song lyrics used by millions of people to get instant synchronised lyrics for Youtube, Spotify, Pandora and more. <br>You can also now use it to get song translations on the go.<br><br><br><b>KEY FEATURES:</b><br><br>Musixmatch lets you:<br><br>\t&#x2022; Enjoy song lyrics with music from Spotify, Youtube, Pandora, Apple Music, SoundCloud, Google Play Music and all your other favourite streaming services<br>\t&#x2022; Tap on the real- time notification to display the Floating Lyrics widget and get the current track&#x2019;s lyrics<br>\t&#x2022; Easily learn new languages by displaying the translation of the lyrics, in time with music. <br>\t&#x2022; Identify and get the lyrics to any song that&#x2019;s playing around you with one tap<br>\t&#x2022; Search for your favourite song by title, artist and even just using a single line of the lyrics<br><br><br><b>ADDITIONAL FEATURES</b><br><br>With Musixmatch you can also:<br><br>\t&#x2022; Use the smart seek to find your favourite lyrics by easily skipping through a song using the the progress bar<br>\t&#x2022; Share your favourite song lyrics on amazing backgrounds with the LyricsCard feature<br>\t&#x2022; Play Youtube videos in full screen, on landscape mode, to enjoy the FloatingLyrics fully integrated with the video <br>\t&#x2022; Play, pause, skip track from your lock screen<br>\t&#x2022; Get notified instantly when new lyrics from your favourite artists are available<br>\t&#x2022; Quickly and easily find all your favorites on your profile<br>\t&#x2022; Preview songs or watch their Youtube videos<br>\t&#x2022; Collect your identified songs in a Spotify playlist<br>\t&#x2022; Join our Community so you can submit all your favourite lyrics, put them in time with music and even have fun translating them <br>\t&#x2022; Fetch song info and cover art for your songs.<br><br><br><b>WEARABLES &amp; TV STREAMING</b><br><br>  &#x2022; Musixmatch is available on your Android Wear devices<br>  &#x2022; Enjoy Musixmatch at home casting local music and lyrics to your TV with Chromecast<br><br><b>MUSIXMATCH PREMIUM FEATURES</b><br><br>Offline lyrics - enjoy all the lyrics you have viewed without a connection.<br>No ads - get all the lyrics with no ads.<br>No commitment - cancel any time you like.<br><br><b>GET STARTED</b><br><br>Not sure where to start?<br>Be sure to have enabled the FloatingLyrics and let Musixmatch find lyrics for your songs on Spotify, Pandora, Play music, Youtube, SoundCloud and more.<br><br><b>COMMUNITY</b><br><br>Love Musixmatch? Don&#x2019;t miss our updates:<br><br>Musixmatch Blog: https://blog.musixmatch.com/<br>Facebook: https://www.facebook.com/musixmatch<br>Twitter: https://twitter.com/Musixmatch<br>Instagram: https://www.instagram.com/musixmatch/<br>G+: https://plus.google.com/+musixmatch<br>Spotify: https://open.spotify.com/user/musixmatch<br><br><b>PROBLEMS? FEEDBACK?</b><br><br>We love receiving your feedback, they help us to improve Musixmatch. <br>Reach us: on Twitter: @musixmatch or via email <br>Visit our Support: https://support.musixmatch.com<br><br><b>REVIEWS AND HONORS </b><br><br>Awarded in Android Excellence Apps 2018.<br>The best Music Player as for AndroidPolice, Android Authority and The Next Web.<br>&quot;Best Apps 2014 and 2015&quot; selection on Google Play Store.<br>+50,000,000 people enjoying their Music with the power of Lyrics<br>Google Play Editor Choice with +1,2 mln 5 stars reviews<br><br><br><b>PERMISSIONS </b><br><br>*We only ask for the permissions we need for the app to be at its best.<br>Musixmatch requests the &quot;Notification access&quot; permission only to listen for music.",
    "histogram": {
        "1": 73303,
        "2": 43472,
        "3": 115633,
        "4": 324232,
        "5": 1265582
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/_SpPo-SJ760X85CEMgY_d99AJNAN523lZYaV9l3PHvMQWZn_1BuVnPalqS8Q-AGp9A=h310",
        "//lh3.googleusercontent.com/gtNk7mQ2lbji37xkGWmNe34zdVYLzEEvrEGcdUGSibbxbgaKCSqLsx-pcr_5yV98BF0=h310",
        "//lh3.googleusercontent.com/w5gzdJBvDU5vSTsxcmrRf2wQ-Df7xK-MPKZt13_N6WzZ3Wqu60FWLB737yT5JbYSBKPi=h310",
        "//lh3.googleusercontent.com/_fNhwY2B7KQhOf3L3ubtSEFd2_EQFBmLKeXLySVj3UsqTCfa3w2jftW_6Q3mj8NgHj0=h310",
        "//lh3.googleusercontent.com/c_Yh8-P18AmTtQnp0qMqyHFLzqMjl4QZB2phJ5h-CEgRXG0Gb3mYDlRq7ZZ9c5Yp4JOD=h310",
        "//lh3.googleusercontent.com/IjQa_jIHlhzanZZMXe8065SDw144W0k1lrIxMwAv1QFQ_J2jX_xYBP56qCsNC30ggqI=h310",
        "//lh3.googleusercontent.com/_ojehEoVIf0YTehNcHN_2QoEi4UVJO_G95oJadTD340UYeROv5CGSbSZlw_FCoiNpw=h310",
        "//lh3.googleusercontent.com/2yOzBjRQ48oeqgFtIlX3H2e9jPAHazhMQiz79MAy-fl24X-hfzFhuO4NtNd64KeDnA=h310",
        "//lh3.googleusercontent.com/Di_pffIJseSBOZ6OYOdXFy6tg7CZs0OuQTWn2yxYOnLDC6B0BPFWBYlfYIsZa0e5ig=h310",
        "//lh3.googleusercontent.com/uYhR1Cv74eF8yYYNym0LTnyk4GoRUTzWdRbfwjFS6JTVZ_e9BZNBENXNI4elCnZUxI5h=h310",
        "//lh3.googleusercontent.com/qn_aH9OEpAw2Bq4TE47AwT4PWuBw1weFUiS5dRftpMPOjJkM4ISpIbW0fANuKKjJHsja=h310",
        "//lh3.googleusercontent.com/fuFRcqhGBFGEXxA5jGY-BC8UfOzirz8iclNgzE8_w_N-Ih40hohrtCuhHSSDGqeIh3zi=h310",
        "//lh3.googleusercontent.com/yw09SPC8GQdOW_l_kHRiJcbxfvigu3Lg-j8YnSZ4WLDXtdSTFFV99NMzUACGj4BXlQ=h310",
        "//lh3.googleusercontent.com/12p0NORn69UwYY6IMxoWU0-gSAkhZtjj4EEneZR1qGmIHNihS4J1XkNTgm6axuT5F_Vb=h310",
        "//lh3.googleusercontent.com/RUax91B3-JDMluBtmhC0Zx-MFcUBHlCbnYq3CKN9tCOQs_Kmvyehc29-R7jmDhR3bn8=h310"
    ],
    "comments": [
        "this was a much better app when it was partnered with spotify. I was trying to get a feel of how the app is without a subscription. But the ADS are just too much. They force 10-15 second ads on you FAR too often for me to want to give money. Not impressed.   Also, this app has a built in 'player' that sounds like utter trash. Comparing it to spotify's level of streaming and playback, this sounds gargled and excreted in comparison. Within seconds you can hear the shrill piercing treble of each song.",
        "Bad interface, non-intuitive, very convoluted. Lots of not needed stuff. Your widget popping up every time it wants is so annoying. Offline lyrics is a paid option. And I was even ready to pay, right to the moment it turned out to be a monthly subscription, not a one time order. I need this app like three times a year when I feel like it to listen to some rap albums, not going to pay every month or full year up front for that. Your search is just awful. There's no easy way to find one artist, then see all his albums, then see all the songs from the albums. I'm out.",
        "This app is getting pathetic and lamer by the day. Have been a loyal user of this app since day 1. From my galaxy, to my nexus and now on my oneplus. Used to love it earlier, even have a subscription. But now it just plain and simple pathetic. Random crashes, bugs and now not even able to make a lyrics card. I click on the option and nothing happens. Have a lot of things in life to be irritated from, now this app is also becoming an integral part in irritating me. I'll wait for the next update and if these  bugs and crashes are not fixed I am going to cancel my subscription and Uninstall this jet lag of a app.",
        "Really useful app, I love it! But I cannot give more than 3 stars because most of the lyrics are out of sync.. I've seen I can send a feedback if the lyrics is worng/out of sync but they take a long time to fix it. It's gonna be probably the best music app, but they firstly need to fix this problem",
        "Please provide another paid Pro app i want to paid your hard work. But i hate subscription base application ... So please bring a one time purchase app. Other wise I'll stick with the free one .",
        "There were ads popping up before I could even try the app out. It did identify the first song correctly but then provided me with lyrics to a whole other song Shame"
    ],
    "recentChanges": [
        "Bug fixes and performance improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.musixmatch.android.lyrify&hl=en&gl=us",
    "appId": "com.musixmatch.android.lyrify"
}