{
    "title": "Sparksfly | Manage your social feeds in one App",
    "summary": "Social Networks via One App. Social Simplified. Now Includes YouTube!",
    "icon": "//lh5.ggpht.com/0aZKQ3XCYo624SgbY-KjFpqjmNFLyMVTUx9YzJBz0Jm4axsUbQJY0Fl8J8-qwep1YZM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 1012,
    "developer": "Sparksfly Technologies",
    "developerId": "Sparksfly+Technologies",
    "developerEmail": "info@sparksfly.com",
    "developerWebsite": "http://www.sparksfly.com",
    "updated": "December 22, 2017",
    "version": "2.8.26",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "SparksFly™ simplifies and unifies the repeated steps you take participating in all your social feeds. One app, one screen lets you view and post all user-content regardless of what social media platform is it on. You gain “intelligent control” over searching, sorting and curating all of your feeds - control to know something before others do, to know more than others do - control to be more well-informed all from what is already flowing through your social mobile apps. SparksFly™ brings people, brands, ideas and relevant real-time information closer together than ever before. SparksFly™ Patent-pending Artificial Intelligence The more our AI engine learns about what you do, like and dislike in your feeds, the brighter and more frequent the “Sparks” fly. Sparks come from from the collection of content flowing through ALL of your feeds together SparksFly’s™ single screen and individualized AI engine enable anyone who uses more than one social network to keep up with ALL content and get ahead of its collective meaning. It's a MUST HAVE for those who use social to be in-the-know or want to be one of the first-to-know without the massive time commitment required today. Now in version 2.8, you can connect YouTube to Sparksfly! Quickly scan all your YouTube Channel subscriptions, View what you want now or tag what you like, store in a notebook and come back to view later. Social simplified. It's about time.",
    "descriptionHTML": "SparksFly&#x2122; simplifies and unifies the repeated steps you take participating in all your social feeds. One app, one screen lets you view and post all user-content regardless of what social media platform is it on. You gain &#x201C;intelligent control&#x201D; over searching, sorting and curating all of your feeds - control to know something before others do, to know more than others do - control to be more well-informed all from what is already flowing through your social mobile apps. SparksFly&#x2122; brings people, brands, ideas and relevant real-time information closer together than ever before. <br><br>SparksFly&#x2122; Patent-pending Artificial Intelligence <br>The more our AI engine learns about what you do, like and dislike in your feeds, the brighter and more frequent the &#x201C;Sparks&#x201D; fly. Sparks come from from the collection of content flowing through ALL of your feeds together <br><br>SparksFly&#x2019;s&#x2122; single screen and individualized AI engine enable anyone who uses more than one social network to keep up with ALL content and get ahead of its collective meaning. It&apos;s a MUST HAVE for those who use social to be in-the-know or want to be one of the first-to-know without the massive time commitment required today. <br><br>Now in version 2.8, you can connect YouTube to Sparksfly! Quickly scan all your YouTube Channel subscriptions, View what you want now or tag what you like, store in a notebook and come back to view later. <br><br>Social simplified. It&apos;s about time.",
    "histogram": {
        "1": 72,
        "2": 52,
        "3": 117,
        "4": 142,
        "5": 629
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/LKwjFOERTqs8MuvBdkME-ONtrkO__Iqqnei8ClzQHmCFSk2aBVL-r0QKOyz8_igabV0=h310",
        "//lh3.googleusercontent.com/LOAiA-hT-mdJpXpNc1jHQc2n8EbUprozaD19lbHC-GDqpmNYrg6QiLUq38lTb77avg=h310",
        "//lh3.googleusercontent.com/9e3yzbfdfSVjX399hwOwrpkwUDPK_Dr-QU7dmdJ90AMPeoEPQbM_noCH4_nKA0mpFzuO=h310",
        "//lh3.googleusercontent.com/JGqNT0oLiYAYENWkmSj19p9yh1ifZzBDHaft3uGgkWmUTmLPffCC3gUvvfd6wkbawA=h310",
        "//lh3.googleusercontent.com/qCMFLdNVi44OTetDoMmSI8EMFjr2_ihRgRfHEMc5t3XKQZX94K4MLtayJQvuyw2vurzp=h310",
        "//lh4.ggpht.com/vPpTxXWUuv3IZboH7ikZiT7EbuVxlsi1l5dQOqwifLSftHy14rIfslhEA_Ip1Awxcq4=h310",
        "//lh3.googleusercontent.com/iD6JtcDgwDduKPMke-cWpuoMDKYwke3d_hGH5wZEpzclbzMKmClXkeZSwMGUWrGuPw=h310",
        "//lh3.googleusercontent.com/H2gXO33jFPdrlVq6QiXFreOZzd9aXvvM-kiASxlSxMyby8AuGGc90PA-3Bk1JSn1Idc=h310",
        "//lh6.ggpht.com/auQDBYyOSKuSuQZdk-sMO9sVD_-1rg3KLujvNcUHSAyxgvwwhEucFSOJHLmYzdGx2mE=h310",
        "//lh4.ggpht.com/nzItvBkJHf-GGdijm2lTazhzYb1CGnKTqFzZ1cLdB8-2teil39kWuMPbqLQSyLtMT9M=h310",
        "//lh4.ggpht.com/F_GkLORwoDDvg9e752-15PX3o5CV1Rmvih5mEyvgyWFOykFUIX5HH93TZx7_eB_2z4D3=h310",
        "//lh6.ggpht.com/abdZyjwlFH9x7qVYojrC7w7KLTkg0kJN9TIP93TkdnXiZGJu12Z0MdKt-033F48pqQ=h310",
        "//lh4.ggpht.com/f7k6hQytEVU-yHCGxrk27DpfSOzEHBGPla5yKuITAMS_mIS0qF51OSzH5iL5KBeVsIQ=h310",
        "//lh6.ggpht.com/vTj3H-1XunbQEouc9-i5rD9cFyjEGcXXgNkKf1k5d_pa3-GSB5h_T4dW8UD7659d4ZM=h310",
        "//lh5.ggpht.com/tqAF0cP8ni0bfXKTP4xkvzKaCqxKJb_FlSsYlzByCu-FjEs6NPt_Njo8w3Qxyv0ols0=h310",
        "//lh3.ggpht.com/229s2sVL4r77-WJvaXutbvzG-3YTiGOx-H5Cu0LAx07ADTjUVllm-0Mc39LK7U8oYgmh=h310",
        "//lh3.ggpht.com/z7dxTb_CC0V3-xUb7neP2wN11Ey4Q5tPiSN0uRYH5tOF1qajDtpU3wdf8BlGpupvoRw=h310",
        "//lh3.ggpht.com/qv3Mc-OAQPraVUzyRwpyH-VLYEeRn9du5QssrbEucqy3Cq5-A_tuSrHhIIDrstCQtOA=h310",
        "//lh6.ggpht.com/zpWH3A74iNnym-VVl9Ep4wGmfOQArEYP3rHcU2wP5dFYMzcgDOFiRHo2A45DaUZhjAA=h310",
        "//lh6.ggpht.com/Owx9IUq5hSCqbXmLdbVnKMjjNZBVSEu0qQ0d-5ahA6HbGMUuBCc3yLIzEpBwwnzpPVg=h310",
        "//lh6.ggpht.com/FXEWDpX1Fz6MjhVrneW7rWfmeRx3zgaQPQoUWnZ9Uvxs1hkzbMfKlv7SSrphRftPkqk=h310",
        "//lh5.ggpht.com/UFsAIndhuUaDybRvbiOjCJL_zDw4fr41adW3nzfjHZTv78mz8gEf0ucOk3W3JEh2GQ=h310"
    ],
    "video": "https://www.youtube.com/embed/Ia2Y3S4EsE0",
    "comments": [
        "Desperately wanted to like it, but.. Does not show my fb contacts..a fundamental problem! Support team  replied straight away saying it's a known issue but it's been weeks and still nothing. Also find navigation very strange, needs to be more simple/typical. Great idea and still the only app i can find offering these features. Just not executed terribly well at the moment unfortunately :(",
        "It's getting there... I downloaded this app because I was encouraged by the developers strong involvement. So, developer: why doesn't anything from Facebook show up in my feed. At all. It says its logged on. Everything looks green-go. But nothings there. And yeah, the navigation a little weird--no way to get back up the tree sometimes. Also can we expect other social media apps in the near future? g+? WordPress?  Edit: No, don't get any updates but twitter now. I wanted to like it too. So pretty.   But its dead, Jim.",
        "Shows great promise but... Shows great promise can't wait!! Only twitter and Instagram are showing up now not Facebook, plus I would prefer a newsfeed style, not cards, also buggy and lagging freezing up, still bonus for G+ integration. Also not updating last card was from a few hours ago... Facebook only showing my own posts...",
        "Crummy Facebook Good app but it's been crippled by a power mad Facebook",
        "Won't work Every time i try to log in i get request failed.",
        "Sparks fly Hey i must have been away to long,  this one chic remember my member and she wants to come up and see if it is real"
    ],
    "recentChanges": [
        "Bug Fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sparksfly.android&hl=en&gl=us",
    "appId": "com.sparksfly.android"
}