{
    "title": "FOBO Bike",
    "summary": "FOBO Bike is an advanced Tire Pressure Monitoring System using Bluetooth 4.0",
    "icon": "//lh4.ggpht.com/fHggn-HydLNMCYf9sKEJCXG7KpO2e00tED2RJkbXRO2qtjEpqaWp7OSEWqJRHSH2SLE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.8,
    "reviews": 123,
    "developer": "Salutica Allied Solutions Sdn Bhd",
    "developerId": "Salutica+Allied+Solutions+Sdn+Bhd",
    "developerEmail": "fobo@salutica.com.my",
    "developerWebsite": "http://www.my-fobo.com",
    "developerAddress": "No 3, Jalan Zarib 6, Kawasan Perindustrian Zarib, 31500 Lahat, Ipoh, Perak, Malaysia",
    "updated": "December 7, 2017",
    "version": "4.3.3",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "FOBO Bike works directly with your smartphone to provide the cool features that comes with FOBO Tire. FOBO BIke is designed to cater for two wheel vehicles (motorcycles and bicycles) with tire pressure below 600kPa(87psi). FOBO Bike is the world’s first all Bluetooth Smart advanced Tire Pressure Monitoring System (TPMS) for two wheelers and three wheelers. FOBO Bike uses the latest Bluetooth 4.0 that works directly with your Android and iOS device. The main function of FOBO Bike is to monitor the air pressure and temperature of two wheelers & three wheelers like motorcycles, Can-Am Spider, bicycles. It then transmits the readings to a smart phone where the user can browse. The user can set upper and lower thresholds of the air pressure. FOBO Bike will monitor the pressure based on the thresholds with its smart algorithm and will provide three levels of alerts when the thresholds are breached.",
    "descriptionHTML": "FOBO Bike works directly with your smartphone to provide the cool features that comes with FOBO Tire. FOBO BIke is designed to cater for two wheel vehicles (motorcycles and bicycles) with tire pressure below 600kPa(87psi). FOBO Bike is the world&#x2019;s first all Bluetooth Smart advanced Tire Pressure Monitoring System (TPMS) for two wheelers and three wheelers. FOBO Bike uses the latest Bluetooth 4.0 that works directly with your Android and iOS device. The main function of FOBO Bike is to monitor the air pressure and temperature of two wheelers &amp; three wheelers like motorcycles, Can-Am Spider, bicycles. It then transmits the readings to a smart phone where the user can browse. The user can set upper and lower thresholds of the air pressure. FOBO Bike will monitor the pressure based on the thresholds with its smart algorithm and will provide three levels of alerts when the thresholds are breached.",
    "histogram": {
        "1": 17,
        "2": 8,
        "3": 10,
        "4": 31,
        "5": 57
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/cIpDtOy401I38msU079x1J_DU2oKPDJQpbywMF4McstkyV-G3xmOb3z6nBjNJlPHRaw7=h310",
        "//lh6.ggpht.com/bxtw0zU0dzfICBX3r58FUi101FY2eEX7rznhRXSGTYo7BW321e9wLQ1ZkVUKLAdv-n8=h310",
        "//lh6.ggpht.com/BlGRclYW2tlaQtIAMgaAdHkBNVzOy9YtDVxKA3I7xctijjk6eDIWdLn5JARVZXsukw=h310",
        "//lh5.ggpht.com/yrPSAWpQR13NrFeo7cFh_KfWqtrN7IV2RqPOjysg4nmUy74kQ7BWWbvhdN5rDdb-6Q=h310",
        "//lh5.ggpht.com/4QQtXFDIxGV8mgMJJ7x60gcaGGpB3uGriER8kNK7hzko1i_UZK9KhX1rIf6_QvCubfyr=h310"
    ],
    "comments": [
        "Have motorcycle with air shocks and air compressor. Would like to have designation in app for air shock pressure. I don't understand why app must have 'location' on to work. Why must a tpms app. need to know my location. Other than that, works as advertised. Battery lasted about one year. Im ok with that.   Please explain how i add the air shock ....as i bought the trike package to get the three sensors needed.",
        "an app for my tires that collects data and requires a log in.is a drain on note 8 because always searching. i have messaged fobo on many forums with no reply.can't disable without redo tire pressure for winter use.app is ok but needs fix.i see replies on here from fobo and they are not helpful.",
        "Useless with Android 8 Moto Z2 Force. Waiting for future updates. Will not connect to the BT sensors.",
        "Cannot connect to my Samsung note 8.. followed the instructions but still cannot connect. Very frustrated",
        "The app seems to work as described for the year that I've owned the product the only problem is It appears the only way to turn off is by aibling the sensors then you must go through the whole process of enabling them again you can't just turn the app off on your phone of enabling them again you can't just turn the app off on your phone you must have the sensors with the phone and hold the boxes for 5 seconds. Since I don't like all year round I have a problem in the winter time with my phone constantly beeping when I'm in the garage it forces you to continually keep your tires up to specks even when you are not using the bike lol going through the whole setup process again is very annoying just to be able to disable it it should be an on and off switch on the phone app even though there is a disable pop-up on the phone app it continually pops up and does not completely disable it just quiet sit down for 1 few minutes",
        "It sometimes loses connection to the sensors while I'm riding.  Otherwise I like the app."
    ],
    "recentChanges": [
        "v4.3.3",
        "What's fixed:",
        "- General settings UI bug.",
        "- No alerts while playing music bug.",
        "- Sometimes FOBO service does not appear bug.",
        "- After logout and login FOBO service does not restart bug.",
        "v4.3.2",
        "What's fixed:",
        "-Fix for below Android 5 version apps crashing.",
        "-Android 8 compatibility.",
        "-Bluetooth connection fine-tuned."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.fobo.bike&hl=en&gl=us",
    "appId": "com.fobo.bike"
}