{
    "title": "Keeper Password Manager",
    "summary": "Stay protected with the world&#39;s most trusted and #1 downloaded Password Keeper.",
    "icon": "//lh6.ggpht.com/9lSUNC7vjkE-y0DPt7bY91WDBRJuhvfnDTo-eymIVO0xDTbht8NYuyV1chOhTQoEoOk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.2,
    "reviews": 72243,
    "developer": "Keeper Security, Inc.",
    "developerId": "7329383055539325451",
    "developerEmail": "support@keepersecurity.com",
    "developerWebsite": "https://keepersecurity.com",
    "developerAddress": "850 W. Jackson Suite 500\nChicago, IL 60607 US",
    "updated": "February 28, 2018",
    "version": "11.2.2",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Stay protected with the world's most trusted and #1 downloaded password keeper and digital vault. Keeper’s password manager generates, stores, and autofills strong passwords on all of your devices while also securely storing and protecting your private documents. Don't get hacked. Get Keeper. Why Use Keeper Password Manager?• We help you easily generate and store strong passwords. No more sticky notes!• Our autofill feature makes signing in to your favorite websites a breeze across all of your devices.• We protect your confidential files, photos, and videos in a secure encrypted vault.• Our biometric fingerprint and facial recognition features allow you to quickly access your secure vault. • Keeper lets you securely share individual passwords or files with people you trust. • Our new Version History feature provides a valuable audit tool allowing you to view the date a record was modified, revert to a previous version, or permanently delete it from your vault.• Our Emergency Access feature enables you to elect up to 5 trusted individuals to access your account in the event of an emergency. What Makes Our Password Keeper The Best?• Every user is provided a secure and private vault protected by our unmatched Zero-knowledge security architecture with multiple levels of encryption. Each user's vault is guarded by a master password which only the user knows. • Keeper generates strong passwords inside the vault. Creating a unique and strong password to each website is critical to limiting the risk of being hacked. • KeeperFill™ provides a powerful and easy-to-use autofill feature. In addition to autofilling passwords, Keeper saves new passwords to the vault as you type. • Keeper’s Security Audit feature helps you identify which accounts require a password update and can generate a strong password for you with a single click. • Keeper protects your confidential files with military-grade encryption. Easily add files, photos, and videos to your vault and organize them with folders.• You can share passwords or files directly with another Keeper user or with a group of people you trust. Behind the scenes, information is encrypted with the recipient's public key and decrypted with their private key.• Easily switch between multiple Keeper accounts (like a business and personal vault) when you log in.• Keeper uses multiple layers of encryption by storing your data in our own secure cloud versus competitors who use partial encryption on their cloud or rely on third parties for password storage. With Keeper your information remains 100% encrypted 100% of the time.Keeper Password Manager Features & Benefits:• Protect unlimited passwords in your vault• Autofill passwords• Generate strong passwords• Log in with fingerprint scanner and facial recognition• Access and sync your passwords from any of your devices (phone, tablet, computer)• Lock files and photos in your secure vault• Use Keeper to securely share passwords and files with people you trust• Store your credit and debit card information securely• Organize passwords with folders and categories• Integrate with Android Wear for two-factor authentication • Built with Zero-knowledge security architecture• Integrates with two-step verification providers (SMS, Google Authenticator, Duo Security, or RSA SecurID)• Utilizes AES-256-bit encryption and PBKDF2 technology• Enable a custom logout timer• Certified TRUSTe and SOC-2 for your peace of mindJoin the millions of people who use Keeper Password Manager’s world-class security to safeguard their personal and professional information from hackers and cybercriminals.Keeper, Password Keeper and the Keeper logo are registered trademarks of Keeper Security, Inc. U.S. Patent No. 8,656,504, 8,868,932 and 8,738,934. Patents Pending.* If you need help, send us an email to support@keepersecurity.com.",
    "descriptionHTML": "Stay protected with the world&apos;s most trusted and #1 downloaded password keeper and digital vault. Keeper&#x2019;s password manager generates, stores, and autofills strong passwords on all of your devices while also securely storing and protecting your private documents. Don&apos;t get hacked. Get Keeper. <br><br><b>Why Use Keeper Password Manager?</b><br><br>&#x2022; We help you easily generate and store strong passwords. No more sticky notes!<br><br>&#x2022; Our autofill feature makes signing in to your favorite websites a breeze across all of your devices.<br><br>&#x2022; We protect your confidential files, photos, and videos in a secure encrypted vault.<br><br>&#x2022; Our biometric fingerprint and facial recognition features allow you to quickly access your secure vault. <br><br>&#x2022; Keeper lets you securely share individual passwords or files with people you trust. <br><br>&#x2022; Our new Version History feature provides a valuable audit tool allowing you to view the date a record was modified, revert to a previous version, or permanently delete it from your vault.<br><br>&#x2022; Our Emergency Access feature enables you to elect up to 5 trusted individuals to access your account in the event of an emergency. <br><br><b>What Makes Our Password Keeper The Best?</b><br><br>&#x2022; Every user is provided a secure and private vault protected by our unmatched Zero-knowledge security architecture with multiple levels of encryption. Each user&apos;s vault is guarded by a master password which only the user knows. <br><br>&#x2022; Keeper generates strong passwords inside the vault. Creating a unique and strong password to each website is critical to limiting the risk of being hacked. <br><br>&#x2022; KeeperFill&#x2122; provides a powerful and easy-to-use autofill feature. In addition to autofilling passwords, Keeper saves new passwords to the vault as you type. <br><br>&#x2022; Keeper&#x2019;s Security Audit feature helps you identify which accounts require a password update and can generate a strong password for you with a single click. <br><br>&#x2022; Keeper protects your confidential files with military-grade encryption. Easily add files, photos, and videos to your vault and organize them with folders.<br><br>&#x2022; You can share passwords or files directly with another Keeper user or with a group of people you trust. Behind the scenes, information is encrypted with the recipient&apos;s public key and decrypted with their private key.<br><br>&#x2022; Easily switch between multiple Keeper accounts (like a business and personal vault) when you log in.<br><br>&#x2022; Keeper uses multiple layers of encryption by storing your data in our own secure cloud versus competitors who use partial encryption on their cloud or rely on third parties for password storage. With Keeper your information remains 100% encrypted 100% of the time.<br><br><b>Keeper Password Manager Features &amp; Benefits:</b><br><br>&#x2022; Protect unlimited passwords in your vault<br>&#x2022; Autofill passwords<br>&#x2022; Generate strong passwords<br>&#x2022; Log in with fingerprint scanner and facial recognition<br>&#x2022; Access and sync your passwords from any of your devices (phone, tablet, computer)<br>&#x2022; Lock files and photos in your secure vault<br>&#x2022; Use Keeper to securely share passwords and files with people you trust<br>&#x2022; Store your credit and debit card information securely<br>&#x2022; Organize passwords with folders and categories<br>&#x2022; Integrate with Android Wear for two-factor authentication <br>&#x2022; Built with Zero-knowledge security architecture<br>&#x2022; Integrates with two-step verification providers (SMS, Google Authenticator, Duo Security, or RSA SecurID)<br>&#x2022; Utilizes AES-256-bit encryption and PBKDF2 technology<br>&#x2022; Enable a custom logout timer<br>&#x2022; Certified TRUSTe and SOC-2 for your peace of mind<br><br>Join the millions of people who use Keeper Password Manager&#x2019;s world-class security to safeguard their personal and professional information from hackers and cybercriminals.<br><br>Keeper, Password Keeper and the Keeper logo are registered trademarks of Keeper Security, Inc. U.S. Patent No. 8,656,504, 8,868,932 and 8,738,934. Patents Pending.<br><br>* If you need help, send us an email to support@keepersecurity.com.",
    "histogram": {
        "1": 7302,
        "2": 2428,
        "3": 4454,
        "4": 13498,
        "5": 44561
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/diMv6JDO5ol3p_Ttgh35oRj1dhrX-mOeNE3gVkxlE9WuiBdL_d3-AqklZX_-iq8GdWM=h310",
        "//lh3.googleusercontent.com/qIzAvb1lDkPTwKD-CRXBl9q4EF-Zu9PdCwLsMDjG9i8rJVw5u0d7tx3LjQBMwc3OKMv1=h310",
        "//lh3.googleusercontent.com/BMvHcJtG1qUUnmIStwxlJrSVbrMDnHblJpPPF5BZKqfPNLnXVv-IpfN6t_GaF3j2r7A=h310",
        "//lh3.googleusercontent.com/awRTw1xayKHXHchtYTfR1dPlM7e2Q4lzYnjipNapPyhCDF1M_4t7CIW8otKZpZJF8so=h310",
        "//lh3.googleusercontent.com/lcoWNlSv5XVU-cqROWdmDvDaNynM-VjLt5ekU97DfnP1u96iFLu9gHUz6nQhBjwr7FA=h310",
        "//lh3.googleusercontent.com/JxkBGQl5vFVH6eKaJKcududEe8avswPF4BgYz2sNfoQa16tZFLYjl-xXLBGSdjgdryw=h310",
        "//lh3.googleusercontent.com/QfXjpIttCEOETp-SKFhW0a0YVgOablySxO8tq4qMQLByc3fRhYGF4ayXRxYiLk4If4A=h310",
        "//lh3.googleusercontent.com/JsfzZiF82_UWlVGUEArz_T1vHcKMbEG3bc0lW-4NrxcGGBUKPuWcePAvcOToAAdwJYo=h310",
        "//lh3.googleusercontent.com/nc_hcX7hyd94uWZWTzLbH2wUBHlTmsAo9DNMTCXTMCTBkoQ8WWdObplx7U1BrVKISGyP=h310",
        "//lh3.googleusercontent.com/riB6b-xLbsefZm-pIcvWihJvq5LKQuo1vubLww32SnFHrAdm7nhNhhTPHHluvkDlGQ=h310",
        "//lh3.googleusercontent.com/RUPkpcnS54_yED67l6GkZSDcVgzCFdw7H0tDSWQfFRVHGEDFua5S8oJFrk37pHLsUfA=h310",
        "//lh3.googleusercontent.com/vJ2tVoZreoZoTFH9UD0_7dOGDCDwP6Lmuuhhf9zol3uwg7LFsWB23eON_hdwtL8qyA=h310",
        "//lh3.googleusercontent.com/jgy8I_sk9-684N8moD4RNJuSghPqkFo4MXgXeBgmCnVH1FDsapb-o_3pOTmelyCviTM=h310",
        "//lh3.googleusercontent.com/D_s24V92_3GDj4ToI_K-TW2Xv3jFFI8L9v2siicra2bQPWw6_lxLWuOMxtbQBhlG0w=h310",
        "//lh3.googleusercontent.com/4pXD9Rwf6Jcrs7k5i8RWJchpLigKd4vgoHKuxO-f2vbb_1dG_h6RA9kxxi56PacPNr8=h310",
        "//lh3.googleusercontent.com/_QijC4W5J6mYYegkJIZrwtt17dcahltWmHJIw3q1EA4cepAWpXzNKA5Y0a0VHeBLfA=h310",
        "//lh3.googleusercontent.com/2a69C34kuv6Xu7IeI6IfmZC64o2CGOrdrFQhglod079d-hXudIaMHdwflljhfECChQ=h310",
        "//lh3.googleusercontent.com/vc9OAe3kgRbWJKGnL6YOSf9lp4qz8fxsJ7AVH9KLEDjHxZqhJrBwPrG6laJ2rvwbOQ=h310",
        "//lh3.googleusercontent.com/lAy2EvX-th8_mCgDqO2t7nTkb0raBMhUw9tdeIlsZuNJEozAh0vfgRf7Cn7gigy9kl8=h310",
        "//lh3.googleusercontent.com/WLYMaocNSx0FjQ7_F9rYaUhwF4yt07mp0z5j4dh92YwUBsTpTtGB5H4lBHxzqFeveA4=h310",
        "//lh3.googleusercontent.com/_Ac29Kc3c9MZSHdtGR6hz8YRPNbLR75VS3H_51daFj6tetW_Z8APBa93xr-28yoPiGc=h310",
        "//lh3.googleusercontent.com/l_SLk_DffvSg-ErXB-miV6uk_hzXztmPhcNDb6YjfVuiWUE6nBrEgI5ar0XCtD1qrDE=h310",
        "//lh3.googleusercontent.com/Q7GhUaHpDjxGd3tU0OxX9r_rYP49qSSawcOkLoCcWSsCVrnE6gnZMu8uFUJxAGcBaG4=h310",
        "//lh3.googleusercontent.com/QTze-mi8j5cZ9MZDiZBV7GL8fpXi7nL2954I53OnAsYpkVbXLowA6cYqU4NpNvvOx30=h310",
        "//lh3.googleusercontent.com/qxmpd7m0CmTSzLzfhNo2IT5UtcqpWMdCpjoT_EWemTaZkAa0c4hu5XXq_L2V_YmSWQ=h310",
        "//lh3.googleusercontent.com/jYcADEZwNwsAFC0_9v9WzQWcjmfv7UFcv-1ZJHBodvyr_AYl7sY42bCb9e1mFscK6jM=h310",
        "//lh3.googleusercontent.com/wWwuZpnr4rGP_LfKao10uHXvVpBzl5YbAWOxhpAv50PdJ__5B_8GVCnTmIsiVDtiGoI=h310",
        "//lh3.googleusercontent.com/3Ifhd20492LgUdRMw366meRStOqssaIoGZRosGPCpjmnO683jgH4y-nRtuQxDDWS_w=h310",
        "//lh3.googleusercontent.com/9Hd5_QzS0FZt1v2EOTlxLAkAFbcz7KCZWCN6WreTw7yMyvd826aeZi_wK5Nn8pmTPVi1=h310"
    ],
    "video": "https://www.youtube.com/embed/TUKAUnhxr8U",
    "comments": [
        "A great way to keep all my passwords organized for work and home.  I love that I can set up folders for the different categories of my life,  and everything is in one convenient app. I pay for the full backup so even if my phone is lost or destroyed, I'll still be able to access all my passwords.",
        "WARNING!!!! DO NOT SUBSCRIBE TO THEIR SUBSCRIPTION.  I had subscribe and cancelled when it was expired now i cant use the app, since you're required to subscribe again to use the app. Here's their response to my email. \"Once your account is cancelled, you can no longer edit or add password. In order for that, you will have to renew your subscription.\"",
        "Great App!!! I've been using this App for a while now and I can honestly say it has made life so much easier and it's a easy system to operate and never had a problem with it!!!",
        "With the amount of accounts and passwords to remember this app is awesome. Customer service is prompt and very helpful.",
        "Perfect protection for all your passwords. Even after you change devices. Everything is downloaded to your new device. Have been using this app for 5 years.",
        "x40 times more expensive than lastpass...shame"
    ],
    "recentChanges": [
        "•  Autofill Search Features",
        "•  Performance improvements",
        "•  Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.callpod.android_apps.keeper&hl=en&gl=us",
    "appId": "com.callpod.android_apps.keeper"
}