{
    "title": "VOZ",
    "summary": "VOZ is a cross-platform voice chat app",
    "icon": "//lh5.ggpht.com/f5QJbQQxC1S5LV3dNmQ8KOtPoctbR_YMzI3dZRqXbOqswMZ_qJrMQx0ku4YpqKn7QEIA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4,
    "reviews": 70,
    "developer": "Netrunner Systems",
    "developerId": "Netrunner+Systems",
    "developerEmail": "support@voz.me",
    "developerWebsite": "http://voz.me",
    "developerAddress": "15 Queen Street #03-04\nSingapore 188537",
    "updated": "October 8, 2015",
    "version": "1.0.1.7",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "(If you have a Samsung Gear smart watch, please install VOZ from Gear Manager.)VOZ is a cross-platform voice chat app that lets you easily send anyone a voice message with just one touch. VOZ supports Android, iPhone, Windows Phone and BlackBerry so you can chat with almost anyone. The app includes built-in support for both Android Wear and Samsung Gear smartwatches, allowing you to send and receive voice messages directly from your smartwatch!Why use VOZ?★ Simple one-touch interface to playback and record messages.★ No hidden costs and completely free! VOZ uses your mobile data or wifi connection, without SMS or calling charges.★ Message anyone with a mobile number. There are no usernames or passwords to remember. All your phone contacts show up in VOZ.★ Works with all smartwatches that are voice-capable. Send and receive messages directly from your watch!★ VOZ is available in 15 languages so anyone can use VOZ!",
    "descriptionHTML": "(If you have a Samsung Gear smart watch, please install VOZ from Gear Manager.)<br><br>VOZ is a cross-platform voice chat app that lets you easily send anyone a voice message with just one touch. VOZ supports Android, iPhone, Windows Phone and BlackBerry so you can chat with almost anyone. The app includes built-in support for both Android Wear and Samsung Gear smartwatches, allowing you to send and receive voice messages directly from your smartwatch!<br><br>Why use VOZ?<br>&#x2605; Simple one-touch interface to playback and record messages.<br>&#x2605; No hidden costs and completely free! VOZ uses your mobile data or wifi connection, without SMS or calling charges.<br>&#x2605; Message anyone with a mobile number. There are no usernames or passwords to remember. All your phone contacts show up in VOZ.<br>&#x2605; Works with all smartwatches that are voice-capable. Send and receive messages directly from your watch!<br>&#x2605; VOZ is available in 15 languages so anyone can use VOZ!",
    "histogram": {
        "1": 11,
        "2": 4,
        "3": 4,
        "4": 6,
        "5": 45
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/bK8-CdzwPd6a8lbN3NVhO5Xoqi09XGYl_-ocTzHPcYTEehOPLW6VmQm5xgYLzHX_uw=h310",
        "//lh5.ggpht.com/xPeOy226Zi9fmCpKk8IzpqykIHkkxpy6wOXQ3HxHgLztUXmzMvPlAeMlARKB-iXQZvjj=h310",
        "//lh3.googleusercontent.com/GYLRViQcFZWDDJgpFBFq8SNJdjopt25bN-Y7I3NT0LT_HPw91fo7v4l82NLTgJuopcci=h310",
        "//lh3.ggpht.com/WRT8Msiwn97LhiTbV3rSlQLxAH-ABtlMiFsWWmxuulp9CU1pEFO6Ea5A_XnGbNh2bzE=h310",
        "//lh6.ggpht.com/iXBLnXGwo57uQFHeigo-c02zI1qjp4WEKm51nQcBcpXe4rz0kwKyjiGdBOpyjuCTEyo=h310"
    ],
    "comments": [
        "Most Important Notification,& Sound   What the hell, how your friend supposed to know they got a voice messages with no ringtones or notification sound in the settings I was surprised not to see that is this app supposed to be a beta, or just plainly forget . Please fix before I delete this app and much better UI is needed for the phone & watch please do and maybe 99 cents you can charge. Once you better this app .",
        "Clicknetwork♡ Hi I really thanks u that u create this apps . Cause currently my mum and dad are at vietnam so it's very hard for me to contact them . If I call them it will use a lot of money . And this apps make it so easily. Thanks guys ! I hope I can win the apple watch to give it to them. They are having a hard time working there ♡ thanks !",
        "Took me a while to find it. Typed VOZ and some voice changing app kept coming up.",
        "Unable to use. Crashes everytime I open it LG G2 running 5.0.2",
        "All good so far Superb concept and originality. Unfortunate that searching for voz in play store does not bring up this app at top result because it is great and alot of people would absolutely love it on their watch I believe.",
        "What is this"
    ],
    "recentChanges": [
        "Performance improvements and bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.netrunnersystems.voicemessaging_android&hl=en&gl=us",
    "appId": "com.netrunnersystems.voicemessaging_android"
}