{
    "title": "Wear Battery Saver v2",
    "summary": "Periodically toggles the Bluetooth radio on your Wear device to save battery",
    "icon": "//lh6.ggpht.com/PSv9EKt0GzMuUK6vVojtnu4y4wsakqIQeivPDr4VW0WTBHiIuLigbe4DHTD7iYNeWD6b=w300",
    "price": "$2.99",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 2.6,
    "reviews": 28,
    "developer": "DroidHackers, LLC",
    "developerId": "DroidHackers,+LLC",
    "developerEmail": "droidhackersllc@gmail.com",
    "developerWebsite": "http://droidhackers.com",
    "developerAddress": "423 River Mews Lane\nEdgewater, NJ 07020",
    "updated": "November 29, 2014",
    "version": "2.11",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Wear devices are great, but they all seem to have one major thing in common: poor battery life.Notice: Moto 360 devices are known to have some issues. v2 is known to perform much better than v1. If you have a Moto 360 and have any issues, please make a point of reporting them by sending an email.This app works by turning on and off the Bluetooth radio automatically, and is highly configurable.Features: • Saves your Wear battery by periodically turning off the Bluetooth • Aligned with the Android Wear connection cycle, allowing accurate timing • Can turn the Bluetooth on when the screen is turned on (this can take up to a minute depending on your settings) • Track the battery and connection times on your mobile with the mobile-side app • Keep the Bluetooth on or off when you need to, overriding the automatic cycle • See your Bluetooth state without opening the app with the Bluetooth widget • Get estimates of your remaining battery life for your Wear device • See the last time your Wear was connected on a mapNotes: • The Bluetooth widget can be moved just by dragging it • Long-pressing the Bluetooth widget will prompt you to disable it • Tapping the Bluetooth widget will prompt to toggle the Bluetooth state • Double-tapping the Bluetooth widget will take you to the app • Connections can sometimes take up to 256 seconds; this is out of our control and is a limitation in the Android Wear protocol. It is especially pronounced on the Moto 360. Please star this issue and comment if you'd like to see this get fixed: https://code.google.com/p/android/issues/detail?id=80744FAQ:Q: Why doesn't the Bluetooth ever change?A: You may not have activated the Battery Saver. Start it on your Wear, either by saying \"Ok Google, start Battery Saver\", or manually starting it from the Start menu. It'll prompt you if you want to enable it. Say Yes. You'll then need to set a plan in the Settings.Q: Why is the connection graph so irregular on the Moto 360?A: Due to some hardware problems on the Moto 360, the Bluetooth radio can take a few seconds to turn on. As there is only a 5 second window in Wear for the connection to succeed, this can cause the wearable to miss a cycle and take longer to connect. (This can happen on the Gear Live and other watches as well, but is rarer.)Q: Why does my Moto behave so strangely when it's charging?A: The Moto's inductive charger interrupts the Bluetooth radio, much like a microwave would mess up your Wi-Fi. This is a hardware problem and is outside of our control.Q: I found a bug! How do I report it?A: Send us an email to droidhackersllc@gmail.com with any relevant details and a description of the problem. Make sure to include 'Battery Saver' in your message subject!Q: I uninstalled the app but it's still on my Wear, even after resetting! Why?A: Android Wear is caching the app. Go to Settings, open Applications, Apps, or Application manager, go to All, scroll to 'Google Play services' and tap it. Then go to 'Manage storage', then hit 'Manage wearable storage' and press 'Clear now'. Then go to Android Wear, press the gears in the top-right, and choose 'Resync apps'. The app should be gone. If not, email us a bug report including any relevant information and a logcat.Q: Ugh! This app sucks!A: That's not a question... but, please remember we're people too when submitting a review. If you have an issue, please send us a bug report before you leave a negative review. We're committed to making this app as awesome as we can and we need your help to do that. Also, please try the new v2 branch if you've already used v1 - it's a lot better.",
    "descriptionHTML": "Wear devices are great, but they all seem to have one major thing in common: poor battery life.<br><br>Notice: Moto 360 devices are known to have some issues. v2 is known to perform much better than v1. If you have a Moto 360 and have any issues, please make a point of reporting them by sending an email.<br><br>This app works by turning on and off the Bluetooth radio automatically, and is highly configurable.<br><br>Features:<br> &#x2022; Saves your Wear battery by periodically turning off the Bluetooth<br> &#x2022; Aligned with the Android Wear connection cycle, allowing accurate timing<br> &#x2022; Can turn the Bluetooth on when the screen is turned on (this can take up to a minute depending on your settings)<br> &#x2022; Track the battery and connection times on your mobile with the mobile-side app<br> &#x2022; Keep the Bluetooth on or off when you need to, overriding the automatic cycle<br> &#x2022; See your Bluetooth state without opening the app with the Bluetooth widget<br> &#x2022; Get estimates of your remaining battery life for your Wear device<br> &#x2022; See the last time your Wear was connected on a map<br><br><br><br>Notes:<br> &#x2022; The Bluetooth widget can be moved just by dragging it<br> &#x2022; Long-pressing the Bluetooth widget will prompt you to disable it<br> &#x2022; Tapping the Bluetooth widget will prompt to toggle the Bluetooth state<br> &#x2022; Double-tapping the Bluetooth widget will take you to the app<br> &#x2022; Connections can sometimes take up to 256 seconds; this is out of our control and is a limitation in the Android Wear protocol. It is especially pronounced on the Moto 360. Please star this issue and comment if you&apos;d like to see this get fixed: https://code.google.com/p/android/issues/detail?id=80744<br><br><br>FAQ:<br>Q: Why doesn&apos;t the Bluetooth ever change?<br>A: You may not have activated the Battery Saver. Start it on your Wear, either by saying &quot;Ok Google, start Battery Saver&quot;, or manually starting it from the Start menu. It&apos;ll prompt you if you want to enable it. Say Yes. You&apos;ll then need to set a plan in the Settings.<br><br><br><br>Q: Why is the connection graph so irregular on the Moto 360?<br>A: Due to some hardware problems on the Moto 360, the Bluetooth radio can take a few seconds to turn on. As there is only a 5 second window in Wear for the connection to succeed, this can cause the wearable to miss a cycle and take longer to connect. (This can happen on the Gear Live and other watches as well, but is rarer.)<br><br><br><br>Q: Why does my Moto behave so strangely when it&apos;s charging?<br>A: The Moto&apos;s inductive charger interrupts the Bluetooth radio, much like a microwave would mess up your Wi-Fi. This is a hardware problem and is outside of our control.<br><br><br><br>Q: I found a bug! How do I report it?<br>A: Send us an email to droidhackersllc@gmail.com with any relevant details and a description of the problem. Make sure to include &apos;Battery Saver&apos; in your message subject!<br><br><br><br>Q: I uninstalled the app but it&apos;s still on my Wear, even after resetting! Why?<br>A: Android Wear is caching the app. Go to Settings, open Applications, Apps, or Application manager, go to All, scroll to &apos;Google Play services&apos; and tap it. Then go to &apos;Manage storage&apos;, then hit &apos;Manage wearable storage&apos; and press &apos;Clear now&apos;. Then go to Android Wear, press the gears in the top-right, and choose &apos;Resync apps&apos;. The app should be gone. If not, email us a bug report including any relevant information and a logcat.<br><br><br><br>Q: Ugh! This app sucks!<br>A: That&apos;s not a question... but, please remember we&apos;re people too when submitting a review. If you have an issue, please send us a bug report before you leave a negative review. We&apos;re committed to making this app as awesome as we can and we need your help to do that. Also, please try the new v2 branch if you&apos;ve already used v1 - it&apos;s a lot better.",
    "histogram": {
        "1": 11,
        "2": 5,
        "3": 3,
        "4": 2,
        "5": 7
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/XCv7OLEhuCwUqzCWLA021PukmG6KIY_7V7j4OtnQB4kKVnLx6T4lV3qNAjsIdsBU1LY=h310",
        "//lh4.ggpht.com/nXIGkaVwsq137_8MD57DP6VHE-zl-7OXOVDpmLIgQJTCcqMPHnzZaB61yhkQeyM5YDk=h310",
        "//lh3.ggpht.com/OqdRI7zKIQpxqV94b12duMwdcOdIsbLu3JE0AE9QSAhPzxLobM8QWryxENewLWQuYYw=h310",
        "//lh4.ggpht.com/0Op5nEcpDsmTu13xbjlRTyvG7OD3uwS8_wKxa9pjQHHdsjEabzhXhQ8m5QMN4t9BHFM=h310",
        "//lh5.ggpht.com/z4z0QJNXq8qZsQbv1T2n0RECtndCg26QTIYAoZxOcNsvWfMA1gZAAxbR8WrVZxafImQ=h310",
        "//lh4.ggpht.com/FxlKXIJvekLT1qOxvHwwSay-lcLnM57LpuRpMP3PnHQeNOg8F14MzakwZsa-pNqLc3sE=h310",
        "//lh4.ggpht.com/-OrzrPYYWBD6brZgrkOAal6pCoYVJMJg2DTXywIOLUj5CwD6KPwn0QW2CrIALilaT9c=h310",
        "//lh3.ggpht.com/ix0Z_mByHqPxoWuDyj5Dc8rNdyrd39kKtGaU4giFMZKmFDwTJh6x0uD2b2154yYg_-Qi=h310",
        "//lh3.ggpht.com/_d2QHdoR_RaVv_Y_DcYaGAT-Xhj3KXe_d0gywwt4C411qj0a3D_rW1jhfwDX8KbtLeM=h310",
        "//lh5.ggpht.com/QnX--OV7_IEaVbgSzeJW5u-9t-C8EN9k2RZ3i8GcXGfJU0QTrpgbNmDYLT9vABKwv4Y=h310",
        "//lh4.ggpht.com/AMMktTdNv1doxXptUMjoetXNFACapLMvJP-L3EBXeY5Bx8b4MplQJ8BPRD-as7OSqtw=h310"
    ],
    "comments": [
        "Doesn't Work Tried connecting this app to two different moto 360s and the say thing happens, it crashes and does not connect. Tried emailing the developers and nothing. Was really hoping to get this work. Guess not",
        "Good effort. Needs tweaking. On Moto360 app stops running. Have to re-enable it atleast twice in the day.  Would like a custom schedule option for battery savings were I can define On and Off time. Thanks keep it up.",
        "Annoying B/T icon App setting allow you to disable the b/t icon, yet it stuff shows on all your windows.  Uninstalled. Developer clueless.",
        "Could be great but It needs to stop auto enabling the widget when I reset and it needs custom options to be able to turn Bluetooth on and off at as many different times as you want at custom set times during in the day too so you could have it disabled if busy at multiple times in the day and if you don't want to be distracted by it and when your asleep etc.",
        "Great Idea Seems to be working on my LG Watch R although the watch image doesn't show a picture of my watch just a question mark?  Also the widget and icons could do with bringing up to date with the Android 5 style as they'd fit better on the watch face!",
        "Oozes potential I'm really excited about this app! Even though it's not quite working with the moto 360 at this time, I've purchased to support the future development. Please keep at it - if I can only squeeze an extra hour a day out of my watch, it'll be money well spent!"
    ],
    "recentChanges": [
        "v2.11",
        "• **Improve Moto behavior",
        "• Internal fixes",
        "• New mobile app with stats",
        "• New BT Widget for viewing the Wear's BT state",
        "• Wear side is more configurable",
        "• Timings now line up with the Wear connection cycle",
        "• Add battery life projection",
        "• Some renaming for clarity",
        "• Saver is now off by default, and must be configured",
        "New Perms:",
        "• Location: For the Last Seen pane in the mobile app",
        "• Draw over apps: Used to display the BT widget",
        "Notes:",
        "• Mobile app UI is temporary, and will be replaced soon."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.droidhackers.wear.batterysaver&hl=en&gl=us",
    "appId": "com.droidhackers.wear.batterysaver"
}