{
    "title": "Volusion",
    "summary": "Volusion is your all-in-one solution for selling online.",
    "icon": "//lh3.googleusercontent.com/cQ32gs5Idj06ef3jig55-h2qClLDQ9yIcCLIA6YoivRU-4CN-vpFEVnr00xcwpMj8LM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.8,
    "reviews": 182,
    "developer": "Volusion, Inc",
    "developerId": "Volusion,+Inc",
    "developerEmail": "android.volusion@gmail.com",
    "developerWebsite": "http://www.volusion.com",
    "updated": "January 8, 2018",
    "version": "4.3.420180108",
    "genre": "Business",
    "genreId": "BUSINESS",
    "description": "Volusion merchants are over 3 times more successful than merchants on any other platform, and we’re excited to add another critical piece to contribute to your overall success. SIGN UP AND DESIGN YOUR STORE- Choose from one of our beautiful site themes- Apply your custom styles and upload your logo to your store- Add products and categoriesMANAGE YOUR INVENTORY- Create variants- Maintain your in-stock counts- Receive alerts when you're running lowPROCESS ORDERS- Accept payment from your customers via one of our integrated gateways- Purchase postage and print shipping labels- Send receipts and shipping notifications to your customersEXPLORE APPS AND EXTENSIONS- Expand your store's functionality with discounts, shipping label printing, social media integrations, and much more!",
    "descriptionHTML": "Volusion merchants are over 3 times more successful than merchants on any other platform, and we&#x2019;re excited to add another critical piece to contribute to your overall success. <br><br>SIGN UP AND DESIGN YOUR STORE<br>- Choose from one of our beautiful site themes<br>- Apply your custom styles and upload your logo to your store<br>- Add products and categories<br><br>MANAGE YOUR INVENTORY<br>- Create variants<br>- Maintain your in-stock counts<br>- Receive alerts when you&apos;re running low<br><br>PROCESS ORDERS<br>- Accept payment from your customers via one of our integrated gateways<br>- Purchase postage and print shipping labels<br>- Send receipts and shipping notifications to your customers<br><br>EXPLORE APPS AND EXTENSIONS<br>- Expand your store&apos;s functionality with discounts, shipping label printing, social media integrations, and much more!",
    "histogram": {
        "1": 23,
        "2": 11,
        "3": 25,
        "4": 42,
        "5": 81
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/RKZLdOLmEP2iqbt0tqg6-zsTQhp1brLJapexLhtjsyeephMEUFMNqmgvQYwiyCeMd68=h310",
        "//lh3.googleusercontent.com/2Pe9aXoLA8h9lYyw3dGw_u6xrZZgd6A1o8lb-VRcniHCnLjyxGe6435OGu0_4HGWkg=h310",
        "//lh3.googleusercontent.com/viH6BX6ajnOSXcelvf4eZTMBB9xh5SlyGsCDY-aRi3bhl6Ue5TFUIyZwVi1Kak3kFg=h310",
        "//lh3.googleusercontent.com/ijACfQuCuhmEsdkIClEg7YBXK5ySq_4aZSj4kc4KmbfX6vZ_vT8tcUoAiM2FcK85R9Q=h310",
        "//lh3.googleusercontent.com/p7USBZXv4UWD8lPAg-cmZ8wDFmclXcZcHi8k-rNS24zphriaD_4TNaYbXdhv8vLyzlU=h310",
        "//lh3.googleusercontent.com/Bb6V5CojKZ1W0xRsmxzJr6ImE35OJQ_Z1rc5j4EEDWRF5VqY662Mco4_kUq2FAKmgtCA=h310",
        "//lh3.googleusercontent.com/usdOUP2QjM9XSMJgeFYGMo1rOHlw2E2MwjOuNdyqWg2-DQ-qo6M2g-vIJmnwmDtd4ic=h310",
        "//lh3.googleusercontent.com/CncPsHPRS_Q2J3EseiDAQj3d2NViUmYXBDUeL8Zj5PzJ5WOfzXkqFRH7kCsCq8QB8p1n=h310",
        "//lh3.googleusercontent.com/z9CJZvyPVVAGFhlQTRbqWL-SDA-5C3_VMjtWthhS0Cc_YibIoiguSO0Mxuic891MWA=h310"
    ],
    "video": "https://www.youtube.com/embed/TDc53m8ZPNQ",
    "comments": [
        "Ok at first glance, but overall not useful. Customers are sorted by first name!! And you cannot change the sort order. Too slow. Ok when you need a quick glance but no substitute for the main interface.",
        "I am so sick of logging in over and over and over. Please fix this horrible glitch. Been waiting two years now. This app is useless.",
        "I could not get past the login screen for over an hour",
        "Amazing and easy to use. I easily set up and customized my website and shopping cart with the app. And the design looks beautiful.",
        "I set up a local store who's inventory changes almost daily I'll really like that I can make changes to products on my phone but I can't add photos if I add a new product please fix that",
        "No"
    ],
    "recentChanges": [
        "Bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.volusion.merchant&hl=en&gl=us",
    "appId": "com.volusion.merchant"
}