{
    "title": "WhatsApp Messenger",
    "summary": "Simple. Personal. Secure.",
    "icon": "//lh6.ggpht.com/mp86vbELnqLi2FzvhiKdPX31_oiTRLNyeK8x4IIrbF5eD1D5RdnVwjQP0hwMNR_JdA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000000,
    "maxInstalls": 5000000000,
    "score": 4.4,
    "reviews": 64392451,
    "developer": "WhatsApp Inc.",
    "developerId": "WhatsApp+Inc.",
    "developerEmail": "android@support.whatsapp.com",
    "developerWebsite": "http://www.whatsapp.com/",
    "developerAddress": "650 Castro Street, Suite 120-219\nMountain View, CA, USA, 94041",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "WhatsApp Messenger is a FREE messaging app available for Android and other smartphones. WhatsApp uses your phone's Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family. Switch from SMS to WhatsApp to send and receive messages, calls, photos, videos, documents, and Voice Messages. WHY USE WHATSAPP: • NO FEES: WhatsApp uses your phone's Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family, so you don't have to pay for every message or call.* There are no subscription fees to use WhatsApp.• MULTIMEDIA: Send and receive photos, videos, documents, and Voice Messages.• FREE CALLS: Call your friends and family for free with WhatsApp Calling, even if they're in another country.* WhatsApp calls use your phone's Internet connection rather than your cellular plan's voice minutes. (Note: Data charges may apply. Contact your provider for details. Also, you can't access 911 and other emergency service numbers through WhatsApp). • GROUP CHAT: Enjoy group chats with your contacts so you can easily stay in touch with your friends or family.• WHATSAPP WEB: You can also send and receive WhatsApp messages right from your computer's browser.• NO INTERNATIONAL CHARGES: There's no extra charge to send WhatsApp messages internationally. Chat with your friends around the world and avoid international SMS charges.* • SAY NO TO USERNAMES AND PINS: Why bother having to remember yet another username or PIN? WhatsApp works with your phone number, just like SMS, and integrates seamlessly with your phone's existing address book. • ALWAYS LOGGED IN: With WhatsApp, you're always logged in so you don't miss messages. No more confusion about whether you're logged in or logged out. • QUICKLY CONNECT WITH YOUR CONTACTS: Your address book is used to quickly and easily connect you with your contacts who have WhatsApp so there's no need to add hard-to-remember usernames.• OFFLINE MESSAGES: Even if you miss your notifications or turn off your phone, WhatsApp will save your recent messages until the next time you use the app.• AND MUCH MORE: Share your location, exchange contacts, set custom wallpapers and notification sounds, email chat history, broadcast messages to multiple contacts at once, and more!*Data charges may apply. Contact your provider for details. --------------------------------------------------------- We're always excited to hear from you! If you have any feedback, questions, or concerns, please email us at: android-support@whatsapp.com or follow us on twitter: http://twitter.com/WhatsApp@WhatsApp---------------------------------------------------------",
    "descriptionHTML": "WhatsApp Messenger is a FREE messaging app available for Android and other smartphones. WhatsApp uses your phone&apos;s Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family. Switch from SMS to WhatsApp to send and receive messages, calls, photos, videos, documents, and Voice Messages. <br><br>WHY USE WHATSAPP: <br><br>&#x2022; NO FEES: WhatsApp uses your phone&apos;s Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family, so you don&apos;t have to pay for every message or call.* There are no subscription fees to use WhatsApp.<br><br>&#x2022; MULTIMEDIA: Send and receive photos, videos, documents, and Voice Messages.<br><br>&#x2022; FREE CALLS: Call your friends and family for free with WhatsApp Calling, even if they&apos;re in another country.* WhatsApp calls use your phone&apos;s Internet connection rather than your cellular plan&apos;s voice minutes. (Note: Data charges may apply. Contact your provider for details. Also, you can&apos;t access 911 and other emergency service numbers through WhatsApp). <br><br>&#x2022; GROUP CHAT: Enjoy group chats with your contacts so you can easily stay in touch with your friends or family.<br><br>&#x2022; WHATSAPP WEB: You can also send and receive WhatsApp messages right from your computer&apos;s browser.<br><br>&#x2022; NO INTERNATIONAL CHARGES: There&apos;s no extra charge to send WhatsApp messages internationally. Chat with your friends around the world and avoid international SMS charges.* <br><br>&#x2022; SAY NO TO USERNAMES AND PINS: Why bother having to remember yet another username or PIN? WhatsApp works with your phone number, just like SMS, and integrates seamlessly with your phone&apos;s existing address book. <br><br>&#x2022; ALWAYS LOGGED IN: With WhatsApp, you&apos;re always logged in so you don&apos;t miss messages. No more confusion about whether you&apos;re logged in or logged out. <br><br>&#x2022; QUICKLY CONNECT WITH YOUR CONTACTS: Your address book is used to quickly and easily connect you with your contacts who have WhatsApp so there&apos;s no need to add hard-to-remember usernames.<br><br>&#x2022; OFFLINE MESSAGES: Even if you miss your notifications or turn off your phone, WhatsApp will save your recent messages until the next time you use the app.<br><br>&#x2022; AND MUCH MORE: Share your location, exchange contacts, set custom wallpapers and notification sounds, email chat history, broadcast messages to multiple contacts at once, and more!<br><br>*Data charges may apply. Contact your provider for details. <br><br>--------------------------------------------------------- <br>We&apos;re always excited to hear from you! If you have any feedback, questions, or concerns, please email us at: <br><br>android-support@whatsapp.com <br><br>or follow us on twitter: <br><br>http://twitter.com/WhatsApp<br>@WhatsApp<br>---------------------------------------------------------",
    "histogram": {
        "1": 4167204,
        "2": 1711385,
        "3": 4110333,
        "4": 9493627,
        "5": 44909902
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/MMue08byixTw74ST_VkNQDUUJBgVEbjNHDYLhIuHmYhMIMJIp3KjVlnhhqZQOZUtNt8=h310",
        "//lh3.googleusercontent.com/foFmwvVGIwWWXJIukN7png18lFjFgbw3K7BqIm8G-jsFgSTVtkCa-dDkFApUzbvzIvbe=h310",
        "//lh3.googleusercontent.com/iLgMXFO5qEPlTffpI21zaoG51AORnfu8NPb_2SdAXYgOYcb-xDOMfCryPhVvGNjoew=h310",
        "//lh3.googleusercontent.com/ElfUPGX67gv0TNQXuDxQGa5a4BYnLAZIgJJmoNoARvqlLQsKEQcNNWz-J_zqGV5vzQ=h310",
        "//lh3.googleusercontent.com/wBgVA58O2xncQkksLatHGoNLI8L6o_1ZM8AC3GCScxCyaDOWOvMsMilaj1Scp3kEOIw=h310",
        "//lh3.googleusercontent.com/nknhZ6--QSyZlohrv72BaPlwO2EHPvGKJY8NNACYY0IY8j4QKYATP6alT1yyMYb-35j9=h310",
        "//lh3.googleusercontent.com/B9Lc7aFHld7epfMpOcdRnDEDEkZ9ke27Ba61HWCafPEFvznGvKS89R9ftzBAhAIYXGII=h310"
    ],
    "comments": [
        "Nice App",
        "One of the worst app I saw. It used to be great untill February 2018 update (2.18.46). However, since than,and till now it keeps eating my phone battery!!  I downgraded the app and it fixed the issue.howver, whastapp won't allow me to continue to using it, which, forced me to update and kill my battery once again.  I send bug reports, tried cancelling permissions but nothing worked. You should kick out your bad QA team and CS.",
        "Need to update daily basis",
        "Awesome service",
        "It is awesome",
        "Best"
    ],
    "recentChanges": [
        "• You can once again set a text-only update in your profile and it's called About. Tap Settings and then your profile name to edit it. Thanks for the feedback!",
        "• Search for the perfect animated GIF right from within WhatsApp. Tap the emoji button in a chat and then tap GIF at the bottom of the emoji panel to get started."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.whatsapp&hl=en&gl=us",
    "appId": "com.whatsapp"
}