{
    "title": "Genesis Intelligent Assistant",
    "summary": "Connect to your G80, G90 or Hyundai Genesis and access your Blue Link features",
    "icon": "//lh3.googleusercontent.com/16i41vXBkqCBx5FuOHeuxb_uxnn41RdIfNySm4e8LjwrGhV2WhH4UmHlRJ3NGB5SJyj2=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3,
    "reviews": 247,
    "developer": "Hyundai Motor America",
    "developerId": "Hyundai+Motor+America",
    "developerEmail": "customercare@genesismotorsusa.com",
    "developerWebsite": "https://www.genesismotorsusa.com/owners/myaccount/contactus",
    "updated": "March 6, 2017",
    "version": "2.8.8",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Connect to your Genesis G80, G90 or Hyundai Genesis to access your Genesis Connected Services or Blue Link features.**********Android version 4.4 and higher required. Supported Devices: Galaxy S6, S6 Edge, S6 Edge+, S5, S4, Note 5, Note 4, Note 3, HTC One, Nexus 6, Nexus 5, LG G4, and G3. Compatible Devices: Note Edge, Galaxy S3, Droid Turbo, Moto X, and Droid Maxx.**********An active Genesis Connected Services or Blue Link subscription is required to login and access the Intelligent Assistant App. Use your Genesis.com or MyHyundai.com login email and password to access the app. **********An active Remote or Guidance package may be required to access all the Genesis Connected Services or Blue Link features listed. For technical assistance contact: www.hyundaiusa.com/loginhelp.**********Intelligent Assistant App Highlights:\t• Combines Genesis Connected Services or Hyundai Blue Link features, data from the vehicle, the owner’s smartphone and the internet with multiple layers of intelligence to send reminders and notifications.\t• Saves owners time with pre-drive app reminders and notificationsWith the Intelligent Assistant App you can:\t• Receive calculated departure messages for synced calendar events with location\t• Receive proactive notifications to remotely start and cool or heat your vehicle based on current temperature\t• Remotely start your vehicle\t• Search and send Points of Interest to your vehicle\t• Remotely unlock or lock the door \t• Check if your doors are locked or unlocked\t• Remotely activate the horn and lights \t• Find your car\t• Access your saved POIs\t• Make a service appointment \t• Access Genesis Connected Services or Blue Link Customer Care \t• Access maintenance information and Monthly Vehicle Report\t• Five Genesis widgets for Remote Features, Parking, POI search & Send to Car, and moreGenesis app now supports Android Wear features. Use voice command or Smartwatch menu to access select features.With the Genesis Smartwatch App you can:\t• Remotely start your vehicle\t• Remotely unlock or lock the door\t• Remotely activate the horn and lights\t• Car Finder\t• Parking MeterFor technical assistance contact: www.hyundaiusa.com/loginhelpAs a security measure to protect your account, this app is not supported on rooted devices.",
    "descriptionHTML": "Connect to your Genesis G80, G90 or Hyundai Genesis to access your Genesis Connected Services or Blue Link features.<br><br>**********<br><br>Android version 4.4 and higher required. Supported Devices: Galaxy S6, S6 Edge, S6 Edge+, S5, S4, Note 5, Note 4, Note 3, HTC One, Nexus 6, Nexus 5, LG G4, and G3. Compatible Devices: Note Edge, Galaxy S3, Droid Turbo, Moto X, and Droid Maxx.<br><br>**********<br><br>An active Genesis Connected Services or Blue Link subscription is required to login and access the Intelligent Assistant App. Use your Genesis.com or MyHyundai.com login email and password to access the app. <br><br>**********<br><br>An active Remote or Guidance package may be required to access all the Genesis Connected Services or Blue Link features listed. For technical assistance contact: www.hyundaiusa.com/loginhelp.<br><br>**********<br><br>Intelligent Assistant App Highlights:<br>\t&#x2022; Combines Genesis Connected Services or Hyundai Blue Link features, data from the vehicle, the owner&#x2019;s smartphone and the internet with multiple layers of intelligence to send reminders and notifications.<br>\t&#x2022; Saves owners time with pre-drive app reminders and notifications<br><br>With the Intelligent Assistant App you can:<br>\t&#x2022; Receive calculated departure messages for synced calendar events with location<br>\t&#x2022; Receive proactive notifications to remotely start and cool or heat your vehicle based on current temperature<br>\t&#x2022; Remotely start your vehicle<br>\t&#x2022; Search and send Points of Interest to your vehicle<br>\t&#x2022; Remotely unlock or lock the door <br>\t&#x2022; Check if your doors are locked or unlocked<br>\t&#x2022; Remotely activate the horn and lights <br>\t&#x2022; Find your car<br>\t&#x2022; Access your saved POIs<br>\t&#x2022; Make a service appointment <br>\t&#x2022; Access Genesis Connected Services or Blue Link Customer Care <br>\t&#x2022; Access maintenance information and Monthly Vehicle Report<br>\t&#x2022; Five Genesis widgets for Remote Features, Parking, POI search &amp; Send to Car, and more<br><br>Genesis app now supports Android Wear features. Use voice command or Smartwatch menu to access select features.<br><br>With the Genesis Smartwatch App you can:<br>\t&#x2022; Remotely start your vehicle<br>\t&#x2022; Remotely unlock or lock the door<br>\t&#x2022; Remotely activate the horn and lights<br>\t&#x2022; Car Finder<br>\t&#x2022; Parking Meter<br><br><br>For technical assistance contact: www.hyundaiusa.com/loginhelp<br>As a security measure to protect your account, this app is not supported on rooted devices.",
    "histogram": {
        "1": 64,
        "2": 37,
        "3": 42,
        "4": 41,
        "5": 63
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/O9MZfHaflJskTjsZCpsV_en73vAlGdnMI4sIsDalcCYZpX9psdOfUFU9RKlJyj2qfA=h310",
        "//lh3.googleusercontent.com/Nf4kEXherqRWnx8j-XY2lnj_EKcidfYhn3eOWyOeFWEOkS8puf9esc18HimqGU1xn8k=h310",
        "//lh3.googleusercontent.com/RwrvOPkZrhNCtq7JGf1akdBSQQHJkwMRVEd7d03HTzpHPpNY564XamQ6J_I8wyBW_969=h310",
        "//lh3.googleusercontent.com/lKj87LpHFZWJy_wYXhQzKc8bnf0eeyXk27Oe93z5a4C_GfKKRGzUBlVD3QbvdLx1Lbg=h310",
        "//lh3.googleusercontent.com/TSLsNh2Ug5UFHVN0YJSmaZ9fCdwuS-ImCEWKeOOIy4I6ZxFExL5qAJKQNHB1tvPN7mDT=h310",
        "//lh3.googleusercontent.com/hyjcw9yp5cMzEHLPDkq4A2lBE_anCUYajV1_J-aBDuVPi-Hq11Dk9tZvw-GRkKtUy4po=h310",
        "//lh3.googleusercontent.com/IfP7oIB5IypCZ38LIXm0AkV3QV6bU1f8pZdlYoO-xpCRMFe8yPoQANUAu9uae2tMBg=h310",
        "//lh3.googleusercontent.com/ApvP6o2Xb5PTRKgxmFG_badvDycWcAMAtILJTpovxoKvRAhMbqVy6_GjsG3yUw1bueoh=h310"
    ],
    "comments": [
        "Really disappointed in this app.  Unreliable.  It frequently fails to operate, leaving a message that says \"server busy\".   When it works, takes way too long to start your car.  It won't warn you if your doors are unlocked, you just have to wait, seemingly forever, to find out, then you have to repeat the start command.    The absence of a fob-based transmitter is a MAJOR deficiency, in my opinion, especially for a so called luxury vehicle.  It only takes a couple button clicks and presto, car starts.  By contrast, this web based app is total aggravation.",
        "I've had this app since car purchase 2.5 yrs ago  and the only thing impressive is the apps look.  The app has many flaws and yet they do nothing about it. If I was late with my payment they would be all over me so why not give the paying consumers the same sincerity when ensuring this app works consistently. Please do something soon as I will drop this app and get my balance paid.",
        "Horrible idea to take over my calendar events. I don't need calendar reminder from Genesis app, I have a calendar app for that. In addition it's a battery hog, and that's on a Galaxy S8+, which so far (before installing this app) showed stellar battery life.  OK, the problem with the calendar is solved by revoking calendar privilege from the app. But it's completely unacceptable, that the app doesn't even wawrn the user that it's going to read it.",
        "The app does what it says it does. I've had no problems remote starting or licking my vehicle.  The main issues is it keeps my phone awake and drains the battery constantly. The only fix I've found is force stopping the app after I've used it. Otherwise it wake locks.",
        "The app itself is great. It has widgets which makes it super useful. My 1 star rating is because the Android Wear app doesn't work at all since the Android Wear 2. 0 update. I was hoping they would fix it but they have just ignored the problem.",
        "I heard Hyundai received notification about a vulnerability in the Hyundai Bluelink app. Does Genesis app have the same issue?  Hyundai Motor America (Hyundai) was made aware of a security vulnerability that only affects certain prior versions of the application. Upon learning of this vulnerability, Hyundai promptly took immediate steps to remediate the issue. Hyundai has released an updated version of the application that eliminates the vulnerability."
    ],
    "recentChanges": [
        "What’s New:",
        "- Bug fixes and enhancements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.stationdm.genesis&hl=en&gl=us",
    "appId": "com.stationdm.genesis"
}