{
    "title": "Real Estate & Rentals - Zillow",
    "summary": "Listings for homes for sale &amp; rent. Home values on nearly all US homes.",
    "icon": "//lh3.googleusercontent.com/aGHZSx4stxSgNSNEWS7-rNvRnWneqq90bnxDb14wgchXwN82iQO-Aiak2XWVng56PVU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.5,
    "reviews": 401373,
    "developer": "Zillow",
    "developerId": "9009299467586107971",
    "developerEmail": "androidfeedback@zillow.com",
    "developerWebsite": "http://www.zillow.com/android",
    "developerAddress": "1301 Second Avenue, Floor 31,\nSeattle, WA 98101",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "House & Home",
    "genreId": "HOUSE_AND_HOME",
    "size": "Varies with device",
    "description": "You’re not just looking for a house. You’re looking for a place for your life to happen™. Zillow’s top-rated real estate app opens the door to millions of homes for sale and rent across the U.S., including real estate listings you won’t find anywhere else. Compare industry-exclusive Zestimate® home values for more than 100 million homes nationwide. Using our app’s real estate search options, you can view photos and videos of listed homes near top-rated schools, find apartments near the city center or discover your dream vacation home with a view. The Zillow app helps you stay on top of your local real estate market with up-to-date listings and instant notifications about new homes in your search area, price changes and more.Zillow also has tools to help you determine your budget and find and contact a local real estate agent or property manager. We also make the home buying process easier with tools to connect you with trusted lenders for mortgage pre-approval and custom mortgage quotes.The Zillow real estate app has everything you need to find your way home while on the go.Key features:• Browse U.S. homes for sale and for rent, including more than 1 million listings you won’t find on an MLS.• See the Zestimate® of nearly any home in the U.S. and see Rent Zestimates® (estimated monthly rental prices) on most homes and apartments.• Receive instant notifications when new listings hit the market, drop in price or are sold. • Find a local lender in minutes who can pre-approve you for a mortgage. Getting pre-approved can show sellers that you’re a serious and credible buyer.• Access mortgage calculators, real-time mortgage rates and personalized loan quotes.• Get detailed ratings and reviews on public and private schools in your desired area. Use custom search tools to find homes based on school ratings and boundaries.• Create a Renter Profile to grab the attention of potential landlords and property managers, and increase your chance of securing the perfect rental.• Only on Zillow: Get FREE access to foreclosure information across the nation. View foreclosure listings in your area, including pre-foreclosures, foreclosure auctions and bank-owned properties. • For Android Wear users, use your watch to record a note for your favorite home, get directions to a property or find open houses nearby.• Find every type of property: single-family homes, apartments, townhomes, condos and more. • Search four ways: Search from where you are (via GPS locator), type in an address, use voice search or draw a custom region on the map.• Filter searches by price, beds, baths, keywords and more.• Save your favorite homes and searches, then view them on Zillow.com or any mobile device.• Contact a local agent to tour a home.We love to hear from you! Please send any feedback or bug reports to the team at androidfeedback@zillow.com.",
    "descriptionHTML": "You&#x2019;re not just looking for a house. You&#x2019;re looking for a place for your life to happen&#x2122;. Zillow&#x2019;s top-rated real estate app opens the door to millions of homes for sale and rent across the U.S., including real estate listings you won&#x2019;t find anywhere else. Compare industry-exclusive Zestimate&#xAE; home values for more than 100 million homes nationwide. Using our app&#x2019;s real estate search options, you can view photos and videos of listed homes near top-rated schools, find apartments near the city center or discover your dream vacation home with a view. The Zillow app helps you stay on top of your local real estate market with up-to-date listings and instant notifications about new homes in your search area, price changes and more.<br><br>Zillow also has tools to help you determine your budget and find and contact a local real estate agent or property manager. We also make the home buying process easier with tools to connect you with trusted lenders for mortgage pre-approval and custom mortgage quotes.<br><br>The Zillow real estate app has everything you need to find your way home while on the go.<br><br>Key features:<br>&#x2022; Browse U.S. homes for sale and for rent, including more than 1 million listings you won&#x2019;t find on an MLS.<br>&#x2022; See the Zestimate&#xAE; of nearly any home in the U.S. and see Rent Zestimates&#xAE; (estimated monthly rental prices) on most homes and apartments.<br>&#x2022; Receive instant notifications when new listings hit the market, drop in price or are sold. <br>&#x2022; Find a local lender in minutes who can pre-approve you for a mortgage. Getting pre-approved can show sellers that you&#x2019;re a serious and credible buyer.<br>&#x2022; Access mortgage calculators, real-time mortgage rates and personalized loan quotes.<br>&#x2022; Get detailed ratings and reviews on public and private schools in your desired area. Use custom search tools to find homes based on school ratings and boundaries.<br>&#x2022; Create a Renter Profile to grab the attention of potential landlords and property managers, and increase your chance of securing the perfect rental.<br>&#x2022; Only on Zillow: Get FREE access to foreclosure information across the nation. View foreclosure listings in your area, including pre-foreclosures, foreclosure auctions and bank-owned properties. <br>&#x2022; For Android Wear users, use your watch to record a note for your favorite home, get directions to a property or find open houses nearby.<br>&#x2022; Find every type of property: single-family homes, apartments, townhomes, condos and more. <br>&#x2022; Search four ways: Search from where you are (via GPS locator), type in an address, use voice search or draw a custom region on the map.<br>&#x2022; Filter searches by price, beds, baths, keywords and more.<br>&#x2022; Save your favorite homes and searches, then view them on Zillow.com or any mobile device.<br>&#x2022; Contact a local agent to tour a home.<br><br>We love to hear from you! Please send any feedback or bug reports to the team at androidfeedback@zillow.com.",
    "histogram": {
        "1": 10157,
        "2": 6615,
        "3": 21714,
        "4": 110579,
        "5": 252308
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/imrh-51cgksFvDIwjPM_tAsBWAnY918s5ee9DVEr6wJra-KOyCJONS9pEI1v1K-G-T4=h310",
        "//lh3.googleusercontent.com/1jn4sj-2thECyTx2rauto4h_PvtiiODblEs98HogXJUmPpbXDqbp36AQcP0-4Ax751Q=h310",
        "//lh3.googleusercontent.com/Z4-JeQxViV1lvLX4K0HZ7jydAPngGNB4Unwts7kPNb-p7Ci-5V1GrXpLq6UWTHEjOEA=h310",
        "//lh3.googleusercontent.com/Z89QwoFk3Iuh3-trpzct_meghjT-9NDNMNdRHok0IVsiyquAAq9ezhTSRl8Gh0-asEo=h310",
        "//lh3.googleusercontent.com/l_43ODERr3ZfgUT_y9VikXkmvRS4UXwPTrc9kq8R8pWCmF9s-oznJViAdun5dgRRAZc=h310",
        "//lh3.googleusercontent.com/VAagpHhTCfp9t0hjtLNeCZ_yuT96y4bE8EZC4Kc2H1SO35p14Q65ZVS6s8Kp7lZjrHlE=h310",
        "//lh3.googleusercontent.com/BeRjNcGwXRx9LL2Df-OBRAGJq885hdF0MDn9nilAZ-fBa50E9pYWP3x-mMErZoa0F5Im=h310",
        "//lh3.googleusercontent.com/fyGIOH94xt55it4tOC6KY_Jtvl61dB9L5B-9Md166lWRHvPT1B1MPYW5IsMqke3rpg=h310",
        "//lh3.googleusercontent.com/xmM9lWe1_cBQGKFp1o3GTTqFHrqpYcFj-sLSCdc6FrMI3kqxbWNL317a9gQM7TM8CqU=h310",
        "//lh3.googleusercontent.com/3kL6seQY8a-mE50gHOtFIaGLYKH2Xbo93-GbEjlGB3aenDFjAD0ebJIP_64VtECBxA=h310",
        "//lh3.googleusercontent.com/Vq1tebRiBX4wS6RBCXEsfPMD-sPxpOJaL2Gfou-Ru6Bz9S1LuCVGj7IusReHEUECuEk=h310",
        "//lh3.googleusercontent.com/7vEvllx5UtazD8VNBmomc4Accgs7KlYUHyI8VJnYtkZNipZzaw5FEMw_SsrEV_Cjzg=h310",
        "//lh3.googleusercontent.com/_xgGXVlhnau2K-XNoqOp0hoAzjfmn2DyeUo__8uQpy5e-lZGT2gkLtEp3m5nu4NP-aU=h310",
        "//lh3.googleusercontent.com/pW3wmA4PUH0um21O9cUHGy7uNwN0MzXKlri-GsiJ7du0SfOJNzoIELiHlzBCCQv69mk=h310",
        "//lh3.googleusercontent.com/3KFD32FkMIPpx2Knk-oUnwxVTMquB9ASC0JZhBJDIji0TWezhwrdGOC0eIBmVJzlRx_E=h310",
        "//lh3.googleusercontent.com/QMwOUzK5iVhhdIMtPk24__CjZNlgej2yrBwXF5AMI9nDmkfb_MS6NTWR0opyKP2wMYI=h310",
        "//lh3.googleusercontent.com/8lf95xpL4ARc1m1ujBVP4A3PxovZEfY3RzgT5nnW6GoyRlHzLMSz2Rht5ofRAVVM3w=h310"
    ],
    "video": "https://www.youtube.com/embed/xXZu1WkngNM",
    "comments": [
        "Sorting for Saved Homes is messed up. On desktop you can sort by status, For Sale, Pending, Sold. However on the App it sorts by updated date. So if a home just went pending or sold it shows on top of my list. I need scrool and find the actual for sale properties mixed in with the pending and sold ones. Terrible on Open house weekends when I'm trying to find the next house to visit. Terrible, terrible.",
        "Wrote a Zillow review and Zillow wants me to edit it. No swearing or vulgarity anywhere in the review. Nancy Bivins is unprofessional is about all it says. But I guess Zillow won't allow reviews that aren't 100% positive.",
        "I don't like that you cant filter out 55+ communities. Seems fishy that the sellers/agents wont even post that in the notes. You have to expand everything and check the schools section to see the word  \"Adult\"  to know its 55+ community.",
        "I used Zillow a couple of years ago to sell a home and had several negative issues.  I have tried about 10 times over the last two days to post a house for sale and I repeatedly get the message...can't process at this time...contact customer service.  I actually called them, got a voice mail saying that they may get back to me within 5 days. Zillow is a joke! I do not understand how it is supposedly the number one Realty website. My experience has been terrible and the app doesn't even give appropriate options for listing!",
        "Easy searches and user friendly. Seems like latest update has removed the \"lot lines\" feature. This is important to me. It is one of the reasons I use Zillow more often than competitors' apps.",
        "Please make it possible to filter pet types allowed when searching rentals! This would be so helpful, being that when I search \"pets allowed\" a whole bunch of listings that specify only cats and small dogs are allowed show up, and I have a large dog."
    ],
    "recentChanges": [
        "We are always working hard to improve our apps. This is a small update to fix a few bugs. Please continue to send your feedback to androidfeedback@zillow.com. We appreciate it."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.zillow.android.zillowmap&hl=en&gl=us",
    "appId": "com.zillow.android.zillowmap"
}