{
    "title": "Buienradar - weer",
    "summary": "Want to avoid walking straight into a rainstorm? Check the rain radar and graph!",
    "icon": "//lh6.ggpht.com/CMouFd8mx9DeQtd--Uf_XN95gR8WmXWY86RtqocaXUDgBOt1xvFhE5HcZB3oPNnsYqo=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 3.7,
    "reviews": 26272,
    "developer": "Buienradar® B.V.",
    "developerId": "Buienradar%C2%AE+B.V.",
    "developerEmail": "appsupport@buienradar.nl",
    "developerWebsite": "http://www.buienradar.nl",
    "developerAddress": "Barend en Van Dorpweg 2\n1217 WP Hilversum",
    "updated": "February 5, 2018",
    "version": "Varies with device",
    "genre": "Weather",
    "genreId": "WEATHER",
    "size": "Varies with device",
    "description": "Trying to avoid walking straight into a rainstorm when you go out? Check our rain radar and rain graph before you leave so you never have to get drenched!\tDe Buienradar app starts with the 2 hour, 3 hour or the 24 hour rain radar forecast. The rain radar image will show you whether it is going to rain in the next upcoming hours or even the next day. Below the radar is the rain graph. In this graph you can see exactly when it is going to rain and how much rainfall is predicted (in millimeters). If you prefer an even more detailed image of your city or town you can press the magnifying glass icon to zoom in.The Buienradar app is available for your Android phone, tablet and Android Wear (Smartwatch). Using your Android Wear device you will see at a glance whether rain is expected! Using the handy widget, which includes the rain graph, you can check whether rain is expected without even having to open the app!Besides the Buienradar you can also find other radars and maps-              Drizzle-              Snow-              Storm-              Sun-              Satellite images of Holland-              Pollen (hay fever)-              Fog-              Temperature-              Windchill-              Wind direction-              Buienradar (rain radar) of Europa-              Satellite images of EuropaYou can find personalized weather info in the table “Komende 24 uur in” (Next 24 hour weather prediction) for your favorite location (even abroad!) like hour-to-hour predictions for: temperature, the number of millimeters of rain per hour, the chance of rain, wind direction and wind force (in Beaufort).Besides thunderstorm, snow, sun, wind and temperature maps we also offer wind chill, ground temperature, sun intensity, air pressure, wind direction, gusts, visibility and humidity data, together with the exact times of sunrise and sunset for your location.Suffering from hay fever? We developed “Pollenradar” to give you an insight in the expected hay fever levels for the next 5 upcoming days (1: low, 10: very high). You can find Pollenradar by tapping (in the bottom left corner on the Buienradar map), and then tap “Pollenradar”.You can also easily find the snow depth per skiing and snowboarding location by entering one of the 700 available locations in the search bar. For example, try entering Mayrhofen, Flauchau, Gerlos, Val Thorens, Sölden en Saalbach-Hinterglemm. When scrolling down, you will see the snow depth for this location in the section “Nu in” (Now) (above the times of the sunrise and sundown).In the “14-daagse” section (14 day forecast) you will find the weather forecast (in a graph) for the next 14 days. You can also see a detailed list view when you click on the tab “Lijst”. This list offers an hourly forecast for the next 7 days and a daily average for the second week. In the “Alerts” section you can create your own rain alert (free push notification) customized to your daily time schedule and most visited locations so you will never be unprepared for a storm. If you don’t want to see ads, we also offer the Buienradar Plus plan for 1,79€. You can find this easily in “Over Buienradar” (“About”) and then press “Neem Buienradar Plus” (Get Buienradar Plus).We are continuously improving the Buienradar app. If you have any suggestions on how we can improve or if you have any questions, you can always send us a message by using the feedback form in the app or by sending us an e-mail via appsupport@buienradar.nl. Thanks!",
    "descriptionHTML": "Trying to avoid walking straight into a rainstorm when you go out? Check our rain radar and rain graph before you leave so you never have to get drenched!<br>\t<br>De Buienradar app starts with the 2 hour, 3 hour or the 24 hour rain radar forecast. The rain radar image will show you whether it is going to rain in the next upcoming hours or even the next day. Below the radar is the rain graph. In this graph you can see exactly when it is going to rain and how much rainfall is predicted (in millimeters). If you prefer an even more detailed image of your city or town you can press the magnifying glass icon to zoom in.<br><br>The Buienradar app is available for your Android phone, tablet and Android Wear (Smartwatch). Using your Android Wear device you will see at a glance whether rain is expected! Using the handy widget, which includes the rain graph, you can check whether rain is expected without even having to open the app!<br><br>Besides the Buienradar you can also find other radars and maps<br>-              Drizzle<br>-              Snow<br>-              Storm<br>-              Sun<br>-              Satellite images of Holland<br>-              Pollen (hay fever)<br>-              Fog<br>-              Temperature<br>-              Windchill<br>-              Wind direction<br>-              Buienradar (rain radar) of Europa<br>-              Satellite images of Europa<br><br>You can find personalized weather info in the table &#x201C;Komende 24 uur in&#x201D; (Next 24 hour weather prediction) for your favorite location (even abroad!) like hour-to-hour predictions for: temperature, the number of millimeters of rain per hour, the chance of rain, wind direction and wind force (in Beaufort).<br><br>Besides thunderstorm, snow, sun, wind and temperature maps we also offer wind chill, ground temperature, sun intensity, air pressure, wind direction, gusts, visibility and humidity data, together with the exact times of sunrise and sunset for your location.<br><br>Suffering from hay fever? We developed &#x201C;Pollenradar&#x201D; to give you an insight in the expected hay fever levels for the next 5 upcoming days (1: low, 10: very high). You can find Pollenradar by tapping (in the bottom left corner on the Buienradar map), and then tap &#x201C;Pollenradar&#x201D;.<br><br>You can also easily find the snow depth per skiing and snowboarding location by entering one of the 700 available locations in the search bar. For example, try entering Mayrhofen, Flauchau, Gerlos, Val Thorens, S&#xF6;lden en Saalbach-Hinterglemm. When scrolling down, you will see the snow depth for this location in the section &#x201C;Nu in&#x201D; (Now) (above the times of the sunrise and sundown).<br><br>In the &#x201C;14-daagse&#x201D; section (14 day forecast) you will find the weather forecast (in a graph) for the next 14 days. You can also see a detailed list view when you click on the tab &#x201C;Lijst&#x201D;. This list offers an hourly forecast for the next 7 days and a daily average for the second week. <br><br>In the &#x201C;Alerts&#x201D; section you can create your own rain alert (free push notification) customized to your daily time schedule and most visited locations so you will never be unprepared for a storm. <br><br>If you don&#x2019;t want to see ads, we also offer the Buienradar Plus plan for 1,79&#x20AC;. You can find this easily in &#x201C;Over Buienradar&#x201D; (&#x201C;About&#x201D;) and then press &#x201C;Neem Buienradar Plus&#x201D; (Get Buienradar Plus).<br><br>We are continuously improving the Buienradar app. If you have any suggestions on how we can improve or if you have any questions, you can always send us a message by using the feedback form in the app or by sending us an e-mail via appsupport@buienradar.nl. Thanks!",
    "histogram": {
        "1": 3749,
        "2": 2137,
        "3": 3379,
        "4": 7124,
        "5": 9883
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/e6xJ1-4x6uNU23FxYvSUTdx0-oUZjWqd7KPr_qFzPVnddxcoA1VrwTWwLkiZdYp_FkU=h310",
        "//lh3.googleusercontent.com/3JaRkZcr8BJwyH1zDenlj-mUErV4C1BbpiHLKNtrTuekvYL8bTE2uOrsi8fvgP6q-iA=h310",
        "//lh3.googleusercontent.com/yruiKf3auBpDkDWam7QBgU6RXtcC5pUMRgn7H6SnVBo42ZGVQCx5RfFBRLNV8RPm6zw7=h310",
        "//lh3.googleusercontent.com/C87-PrthF3sCvM7xYQ5716R98_9ODsVuX-NKEr-vUQu13mzt0T1hWI7id6IjCfD6PQ=h310",
        "//lh3.googleusercontent.com/tARPLcVVrY5ZFbilJUjmJNcmGPeY5F6ElFLCzA_NsOTbqC7MMZhD-l-ZXRKCCTTn9gAG=h310",
        "//lh3.googleusercontent.com/izPAzV3csJLMcDddME_vnnPj4YVFar86P9qHJfV6_0jvD1mjcpTBFt5NEQ81zpSUulI=h310",
        "//lh3.googleusercontent.com/6Qp9NrwT6zLVAIi4GE486AmnE-yTfja4xe1Y1P6q10_cN1052UrIAfgZMvzeJG_b6g=h310",
        "//lh3.googleusercontent.com/gk4gVc_VAuf-hGWaNSWyZZaNrOauJ58V2Zr3csNsrPWLcE27XiCiYbhMIcS7QgSb1Qc=h310",
        "//lh3.googleusercontent.com/9j4hduvempOqjHKHeZwUAopTdU7_urkzSr-HB4qVKoTm1HdWj66qdFQgia_hHVGHGVY=h310",
        "//lh3.googleusercontent.com/4odBmqu8kryeeRf-7t2V5CPg8TZvb3jP5kDkYHpKjZ3evutmGF7cG7g-BOUOlkMuv9o=h310"
    ],
    "comments": [
        "How do I remove my review? Stupid Google",
        "App is crashing as of today. It is not working anymore",
        "Heel irritant...!",
        "UPDATE: dank voor de fix. De widget werkt weer!   Buienradar - wat is er aan de hand? Sinds de android security update van samsung kan ik in de widget geen gegevens meer laden en werkt in de app de feedbackknop niet meer? Dan maar zo: graag de app fixen zodat de widgets op samsungs ook weer werken.",
        "Not very accurate. Outdated design and bad quality maps...",
        "Please please consider adding English as a language option! Otherwise, it's a very reliable weather app ❤"
    ],
    "recentChanges": [
        "Bedankt dat u Buienradar gebruikt!",
        "U kunt nu ook de sneeuwradar bekijken voor +2 & +3 uur.",
        "Nu maar hopen dat februari kouder wordt dan januari, zodat we van deze nieuwe functie gebruik kunnen maken.",
        "Daarnaast zijn er enkele bugs opgelost.",
        "Heeft u een suggesties of een vraag? Stuur ons een berichtje via het feedbackformulier in de app."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.supportware.Buienradar&hl=en&gl=us",
    "appId": "com.supportware.Buienradar"
}