{
    "title": "SPORT Weather",
    "summary": "Provides the sports enthusiast with weather info critical to their activities.",
    "icon": "//lh4.ggpht.com/Ziv8L6KEca2jTAJY4eAKkt0Axhmd0szJrFLR-EvWUco6Mja-ckxAMdI3ZcpnTdwXvr0=w300",
    "price": "$3.99",
    "free": false,
    "minInstalls": 10,
    "maxInstalls": 50,
    "score": 2.3,
    "reviews": 3,
    "developer": "Appervasive, LLC",
    "developerId": "Appervasive,+LLC",
    "developerEmail": "storage@omniburstmedia.com",
    "developerWebsite": "http://sportweather.com",
    "developerAddress": "123 Ashley St\nAnn Arbor, MI 48104",
    "updated": "January 5, 2015",
    "version": "2.0",
    "genre": "Weather",
    "genreId": "WEATHER",
    "description": "SPORT Weather is an award winning watch face for Android Wear that provides the sports enthusiast with the weather information that is critical to their activities - mainly, will it rain and when?  (or snow!) The most important weather info is displayed in the main screen alongside the clock - when will it start and stop raining, what is the \"feels like\" temperature, and the humidity. >>>>>> Finalist for the Million Dollar Samsung App Gear Challenge!       <<<<<<<<SPORT Weather has already gained attention on the Samsung Gear 2 platform, chosen among thousands of submissions as finalist for the million dollar Samsung App Gear Challenge. >>>>>> The award winning Gear 2 app now available on Android Wear!  <<<<<<<<  60 minute by-the-minute rain forecast with eery accuracy!But I have a weather app, why do I need this?  Does your weather app tell you exactly when it is going to rain, down to the minute if you are within an hour? Doubtful.  Does it have freakishly accurate data down to the minute like this app, or just general data about the entire day (that is often wrong anyway!).   General, shmeneral!  We need to know if it is going to rain right now, don't we!  We deserve to know!  If it is going to rain in eight minutes, this app will tell you, and then it will rain in exactly 8 minutes.  It is that accurate!  If it looks like it is going to start pouring rain, but this app says you still have 30 minutes.  You still have 30 minutes, so get in that quick jog!Another Note - Within the next couple hours, this app is freakishly accurate.  Go out six hours and it is still very accurate.  As it gets further out, the forecast gets less accurate.  We become more reliant on those weather folks at that point, rather than the super smart algorithm this app bases your forecast on.  But for most SPORT enthusiasts, the next six hours are by far the most important.  Hence the name, SPORT Weather!Why is the app $3.99 when other Wear apps tend to be less?  We pay for the weather data long after you've paid us for the app.  To make this app feasible we have to collect some extra money to cover those ongoing costs.  But seriously, for $3.99 you get to-the-minute accurate rain predictions right on your watch!  That is a small price to pay!Please note: This Wear app is an integrated app.  When you purchase it through the Google Play app store, the app will be installed on your smart phone or device, and that app will install the wear app onto the watch within the next couple minutes.  If the connection is broken, the app may not install correctly, so just delete this app and reinstall it from Google Play.  Companion Android AppThe Android App that comes with this Wear app has additional information that just doesn't fit on the watch.  It serves as a helpful stand alone current weather app as well and we'll continue to make updates to it based on user feedback.",
    "descriptionHTML": "SPORT Weather is an award winning watch face for Android Wear that provides the sports enthusiast with the weather information that is critical to their activities - mainly, will it rain and when?  (or snow!) <br><br>The most important weather info is displayed in the main screen alongside the clock - when will it start and stop raining, what is the &quot;feels like&quot; temperature, and the humidity.<br><br> &gt;&gt;&gt;&gt;&gt;&gt; Finalist for the Million Dollar Samsung App Gear Challenge!       &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br>SPORT Weather has already gained attention on the Samsung Gear 2 platform, chosen among thousands of submissions as finalist for the million dollar Samsung App Gear Challenge.<br> &gt;&gt;&gt;&gt;&gt;&gt; The award winning Gear 2 app now available on Android Wear!  &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;  <br><br>60 minute by-the-minute rain forecast with eery accuracy!<br><br>But I have a weather app, why do I need this?  <br>Does your weather app tell you exactly when it is going to rain, down to the minute if you are within an hour? Doubtful.  <br>Does it have freakishly accurate data down to the minute like this app, or just general data about the entire day (that is often wrong anyway!).   General, shmeneral!  We need to know if it is going to rain right now, don&apos;t we!  We deserve to know!  <br><br>If it is going to rain in eight minutes, this app will tell you, and then it will rain in exactly 8 minutes.  It is that accurate!  <br><br>If it looks like it is going to start pouring rain, but this app says you still have 30 minutes.  You still have 30 minutes, so get in that quick jog!<br><br>Another Note - Within the next couple hours, this app is freakishly accurate.  Go out six hours and it is still very accurate.  As it gets further out, the forecast gets less accurate.  We become more reliant on those weather folks at that point, rather than the super smart algorithm this app bases your forecast on.  But for most SPORT enthusiasts, the next six hours are by far the most important.  Hence the name, SPORT Weather!<br><br>Why is the app $3.99 when other Wear apps tend to be less?  <br>We pay for the weather data long after you&apos;ve paid us for the app.  To make this app feasible we have to collect some extra money to cover those ongoing costs.  But seriously, for $3.99 you get to-the-minute accurate rain predictions right on your watch!  That is a small price to pay!<br><br>Please note: This Wear app is an integrated app.  When you purchase it through the Google Play app store, the app will be installed on your smart phone or device, and that app will install the wear app onto the watch within the next couple minutes.  If the connection is broken, the app may not install correctly, so just delete this app and reinstall it from Google Play.  <br><br>Companion Android App<br>The Android App that comes with this Wear app has additional information that just doesn&apos;t fit on the watch.  It serves as a helpful stand alone current weather app as well and we&apos;ll continue to make updates to it based on user feedback.",
    "histogram": {
        "1": 2,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/nCTnm_ZWo_srttAcvxMYC3roBEqnaOfrEqDY7Iq4nDhlVzS5PuGhfrJj9oHPYvXV8oo=h310",
        "//lh5.ggpht.com/bDI8fJnWLyp0P7VOR3GQmIZTd9Lx4r1tcsf9VU0n7fukwKefuAVxW560mutET94TKw=h310",
        "//lh5.ggpht.com/rpzEFybPTZJMJxlPaqbvUbLUopP7jEHRkqEhV0JyOzUJjXTRf8CTPmrjRkk9fwi5Trw=h310",
        "//lh5.ggpht.com/XVRSzStk26CUZaZZcb1TKDUs2tXvGAfhmecQLh2ArSFv3tsHTCsO2MW2mXdMdsVsnEg=h310"
    ],
    "comments": [
        "Weather doesn't sync. Completely non functional",
        "Only weather app for wear watches that works Of the official weather watch faces,  this is the only one that works for me. Other apps seem broken, weather never shows up. But can't wait for the next version mentioned with the by-the-minute rain info."
    ],
    "recentChanges": [
        "Recent Updates:",
        "> Added by-the-minute forecasts to handheld and watch",
        "> Added humidity to handheld and watch",
        "> Improved refresh button functionality (pulls more data)",
        "> Major UI update",
        "> Changed location accuracy to \"coarse\", since we don't need it to be super accurate and it saves the battery.",
        "> Reduced size of app by 40%!",
        "> Added support for devices that do NOT have Android Wear installed (so you can still use the companion app)."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.appervasive.sportweatherwear&hl=en&gl=us",
    "appId": "com.appervasive.sportweatherwear"
}