{
    "title": "Parrot Zik",
    "summary": "Groove on with Parrot Zik",
    "icon": "//lh3.googleusercontent.com/oxnzH5PqwwqviPfsN4AlJnN9cTE2k8cTLc6KgAWEOMWPduxfFaoGeTtN_BOedqUxSObv=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 3219,
    "developer": "Parrot SA",
    "developerId": "Parrot+SA",
    "developerEmail": "hot-line@parrot.com",
    "developerWebsite": "http://www.parrot.com/zik3",
    "developerAddress": "174 quai de Jemmapes 75010 Paris",
    "updated": "December 7, 2017",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Use the Parrot Zik application to easily modify the configuration and settings of your Parrot Zik headset (2.0 and 3).(Support for Android Wear)(Not compatible with the first-generation Parrot Zik)Use your Parrot Zik application to customise all the features of your headset:- Adjustment of noise reduction- Presence sensor around the neck- Automatic Bluetooth connection - Maximum down-time before automatic shut-out- Choice of language for vocal announcement of caller- Colour of the application theme- Travel mode (to disable Bluetooth waves and save on the battery)Artist audio presetsWith Parrot Zik, you can customise audio playback. Parrot offers artists a chance to create and share their own audio Presets. Users can thus download these Presets and experience music the way the artists intended.Producer ModeYou can use Producer Mode to create your own Audio Presets and share them with the Parrot Zik community. Recreate unique acoustics using the 5-band parametric Parrot Pro equalizer combined with sound spatialisation.Smart Audio TuningThe Parrot Zik application uses tags in your music files and selects the best presets automatically.Graphic equalizerUse the graphic equalizer to intuitively and quickly adjust your headset's audio playback. Simply point at the musical style best adapted to your taste.Parrot \"Concert Hall Effect\"Parrot Zik 2.0 and 3 have powerful processors capable of recreating the acoustics of various concert halls. Use the Parrot Zik application to choose a venue and achieve a lounge or concert hall effect.World map of noise (New!)Get an instant view of the noisiest places on the planet.The world map of noise is produced thanks to the participation of consenting Parrot Zik 2.0 & 3 owners.**Parrot does not save any vocal data, only the ambient noise level (dB) is shared, provided the user consents.Automatic adaptive noise reduction Multiple integrated microphones sense exterior noise and cancel it out using the anti-noise waves the headphones send back. This helps to achieve optimum sound quality all the time. Several options are available in the application, to ensure unique listening comfort.- Noise reduction: for insulation from exterior noise during telephone conversations and while listening to music- Street mode: to enjoy the sensation of not wearing a headset, to remain alert in the street. Exterior sound is reinjected into the earbuds.",
    "descriptionHTML": "Use the Parrot Zik application to easily modify the configuration and settings of your Parrot Zik headset (2.0 and 3).<br><br>(Support for Android Wear)<br>(Not compatible with the first-generation Parrot Zik)<br><br>Use your Parrot Zik application to customise all the features of your headset:<br>- Adjustment of noise reduction<br>- Presence sensor around the neck<br>- Automatic Bluetooth connection <br>- Maximum down-time before automatic shut-out<br>- Choice of language for vocal announcement of caller<br>- Colour of the application theme<br>- Travel mode (to disable Bluetooth waves and save on the battery)<br><br>Artist audio presets<br><br>With Parrot Zik, you can customise audio playback. Parrot offers artists a chance to create and share their own audio Presets. Users can thus download these Presets and experience music the way the artists intended.<br><br>Producer Mode<br><br>You can use Producer Mode to create your own Audio Presets and share them with the Parrot Zik community. Recreate unique acoustics using the 5-band parametric Parrot Pro equalizer combined with sound spatialisation.<br><br>Smart Audio Tuning<br><br>The Parrot Zik application uses tags in your music files and selects the best presets automatically.<br><br>Graphic equalizer<br><br>Use the graphic equalizer to intuitively and quickly adjust your headset&apos;s audio playback. Simply point at the musical style best adapted to your taste.<br><br>Parrot &quot;Concert Hall Effect&quot;<br><br>Parrot Zik 2.0 and 3 have powerful processors capable of recreating the acoustics of various concert halls. Use the Parrot Zik application to choose a venue and achieve a lounge or concert hall effect.<br><br>World map of noise (New!)<br><br>Get an instant view of the noisiest places on the planet.<br>The world map of noise is produced thanks to the participation of consenting Parrot Zik 2.0 &amp; 3 owners.*<br>*Parrot does not save any vocal data, only the ambient noise level (dB) is shared, provided the user consents.<br><br>Automatic adaptive noise reduction <br><br>Multiple integrated microphones sense exterior noise and cancel it out using the anti-noise waves the headphones send back. This helps to achieve <br>optimum sound quality all the time. Several options are available in the application, to ensure unique listening comfort.<br>- Noise reduction: for insulation from exterior noise during telephone conversations and while listening to music<br>- Street mode: to enjoy the sensation of not wearing a headset, to remain alert in the street. Exterior sound is reinjected into the earbuds.",
    "histogram": {
        "1": 356,
        "2": 104,
        "3": 173,
        "4": 797,
        "5": 1789
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/bx0euTiXdsqbfnVAdr_qOtOM9q7qaGQ6JLPZX0bYBNNiMJQTxjftxYaUMpUWBiigCQ=h310",
        "//lh3.googleusercontent.com/BIXp_e3-T88vPnys8HKVfGr_A1zcEjDHc51-0nIp8M6nUdrdvXhzWeD-7tCR4mz-ZD4=h310",
        "//lh3.googleusercontent.com/lYaCnL2qc98WzIPPFPL1yp2ZB1_qKhh1dmcY0wshLFgHkqpF0EibpeQONMBmsdHhJLc=h310",
        "//lh3.googleusercontent.com/KLhttS765dzWnvGFCX0fLcy6NMjjTsrtkJofKGzFpqRAG3msK8W8exsnHSpEoR45nd_X=h310",
        "//lh3.googleusercontent.com/TDI_DxeZEjh8jpowN7176hX4SIV8dGbyj30FhD09USuFGEQJiNU6AjZq_MC3Hkgp150=h310",
        "//lh3.googleusercontent.com/-qZkO287u_S8SvG4bYxA5Jb9WoeCCWgsxe2xW1UtnmvFmVpZGCk857X1TmdAb1MTuXc=h310",
        "//lh3.googleusercontent.com/fEYzyIxsgu4ZVFBeini29WvSY5Zc-OQoJ6GTtnvAVm67dwlccr62gS0u4PLN4f9n4g0=h310",
        "//lh3.googleusercontent.com/pFBeq6FPhigYICuk4Gt7e-vf7n5j8MSOET8A1GTC4QZN0KD64479qu5mqKT0s4LMcQ=h310",
        "//lh3.googleusercontent.com/MJvYqTxc2crWdfSif4cT1OqhcxILctQzc7CMSY-Hl5_JjXybv5OgQ4j4DPaBaEtp8MK9=h310"
    ],
    "comments": [
        "Great to really max out the power in your Zik headphones!",
        "love these head phones. Expensive but well worth it. They kick Bose ass.",
        "Would be nice to have more presets but otherwise works very very well",
        "Works well. I like the battery indicator.",
        "Great companion to the parrot zik 2!",
        "Only 4 stars because i don't like apps that want to track my location for no obvious reasons. Other than that I love my zik parrot! Cheers"
    ],
    "recentChanges": [
        "Android 8 application crash correction on tablet + bug correction"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.parrot.zik2&hl=en&gl=us",
    "appId": "com.parrot.zik2"
}