{
    "title": "Chaos Control: GTD Organizer & Task List Manager",
    "summary": "All you need to get things done: GTD, Tasks, To-Do Lists, Projects and",
    "icon": "//lh3.googleusercontent.com/nuvMlOOW2n9PBHtRUhBFu0iSsaaNGfUp4oB0eBqHUYrF89MrIWpFTKQe8fYIaCPooKZv=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.1,
    "reviews": 13316,
    "developer": "Chaos Control",
    "developerId": "7602978102231839745",
    "developerEmail": "cc@tarasov-mobile.com",
    "developerWebsite": "http://chaos-control.mobi",
    "developerAddress": "143989, Russia, Moscowskaya oblast, Zheleznodorogniy, Granichnaya st., 20",
    "updated": "February 1, 2017",
    "version": "1.8",
    "genre": "Business",
    "genreId": "BUSINESS",
    "description": "Chaos Control was created to help you manage your goals, to-do lists and tasks in both your business and personal life. People don't usually achieve impressive results simply by being good at task management. It's the ability to set legitimate goals that makes the difference. Just write down your desired outcomes to make them real. This simple technique helps you to prioritize your goals before acting on them. Chaos Control is a task manager based on the best ideas of GTD (Getting Things Done) methodology created by David Allen. Whether you are running a business, launching an app, working on a project or simply planning your holiday trip, Chaos Control is a perfect tool to manage your goals, juggle your priorities, and organize your tasks to get things done. And the best part is, you can handle both heavyweight project planning and simple daily routine like shopping list management in one flexible app. Also, Chaos Control is available across all major mobile and desktop platforms with seamless sync. HERE IS HOW IT WORKS: 1) MANAGE YOUR PROJECTSProject is a goal combined with a set of tasks you need to complete in order to achieve it. Create as many projects as you like to write down all the desired outcomes you have 2) ORGANIZE YOUR GOALSCreate unlimited number of projects and group them by category using Folders 3) USE GTD CONTEXTSOrganize tasks from different projects using flexible context lists. If you are familiar with GTD you would just love this feature 4) PLAN YOUR DAYSet due dates for tasks and make plans for any particular day 5) USE CHAOS BOXPut all the incoming tasks, notes and ideas into Chaos Box in order to process them later. It works similar to GTD inbox, but you can use it as a simple to-do list 6) SYNC YOUR DATAChaos Control works on both desktop and mobile devices. Setup an account and sync your projects across all of your devices This app is designed with creative people in mind. Designers, writers, developers, startup founders, entrepreneurs of all kinds and pretty much anyone with ideas and desire to make them happen. We combined the power of GTD with the convenient interface to help you with:☆ personal goal setting☆ task management☆ time management☆ planning your business and personal activities☆ building your routine☆ handling simple to do lists, checklists and shopping lists☆ catching your ideas and thoughts to process them later KEY FEATURES☆ Seamless cloud sync across all major mobile and desktop platforms☆ GTD-inspired Projects and Contexts supplemented with Folders, sub-folders and sub-contexts☆ Recurring tasks (daily, weekly, monthly and chosen days of the week)☆ Chaos Box - Inbox for your unstructured tasks, notes, memos, ideas and thoughts. Great tool for staying on track inspired by GTD ideas☆ Notes for tasks, projects, folders and contexts☆ Fast and smart search Have a productive day!",
    "descriptionHTML": "Chaos Control was created to help you manage your goals, to-do lists and tasks in both your business and personal life.<br> <br>People don&apos;t usually achieve impressive results simply by being good at task management. It&apos;s the ability to set legitimate goals that makes the difference. Just write down your desired outcomes to make them real. This simple technique helps you to prioritize your goals before acting on them.<br> <br>Chaos Control is a task manager based on the best ideas of <b>GTD (Getting Things Done)</b> methodology created by David Allen. Whether you are running a business, launching an app, working on a project or simply planning your holiday trip, Chaos Control is a perfect tool to manage your goals, juggle your priorities, and organize your tasks to get things done. And the best part is, you can handle both heavyweight project planning and simple daily routine like shopping list management in one flexible app. Also, Chaos Control is available across all major mobile and desktop platforms with seamless sync.<br> <br><b>HERE IS HOW IT WORKS:</b><br> <br><b>1) MANAGE YOUR PROJECTS</b><br>Project is a goal combined with a set of tasks you need to complete in order to achieve it. Create as many projects as you like to write down all the desired outcomes you have<br> <br><b>2) ORGANIZE YOUR GOALS</b><br>Create unlimited number of projects and group them by category using Folders<br> <br><b>3) USE GTD CONTEXTS</b><br>Organize tasks from different projects using flexible context lists. If you are familiar with GTD you would just love this feature<br> <br><b>4) PLAN YOUR DAY</b><br>Set due dates for tasks and make plans for any particular day<br> <br><b>5) USE CHAOS BOX</b><br>Put all the incoming tasks, notes and ideas into Chaos Box in order to process them later. It works similar to GTD inbox, but you can use it as a simple to-do list<br> <br><b>6) SYNC YOUR DATA</b><br>Chaos Control works on both desktop and mobile devices. Setup an account and sync your projects across all of your devices<br> <br>This app is designed with creative people in mind. Designers, writers, developers, startup founders, entrepreneurs of all kinds and pretty much anyone with ideas and desire to make them happen. We combined the power of GTD with the convenient interface to help you with:<br>&#x2606; personal goal setting<br>&#x2606; task management<br>&#x2606; time management<br>&#x2606; planning your business and personal activities<br>&#x2606; building your routine<br>&#x2606; handling simple to do lists, checklists and shopping lists<br>&#x2606; catching your ideas and thoughts to process them later<br> <br><b>KEY FEATURES</b><br>&#x2606; Seamless cloud sync across all major mobile and desktop platforms<br>&#x2606; GTD-inspired Projects and Contexts supplemented with Folders, sub-folders and sub-contexts<br>&#x2606; Recurring tasks (daily, weekly, monthly and chosen days of the week)<br>&#x2606; Chaos Box - Inbox for your unstructured tasks, notes, memos, ideas and thoughts. Great tool for staying on track inspired by GTD ideas<br>&#x2606; Notes for tasks, projects, folders and contexts<br>&#x2606; Fast and smart search<br> <br>Have a productive day!",
    "histogram": {
        "1": 1154,
        "2": 656,
        "3": 1267,
        "4": 2875,
        "5": 7364
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/K_TCFIpxcdZ6so4m2wnmqViGn4FmFpofq9hE0j4-4l56-D8H3g5YWw2MeypR8EYERA=h310",
        "//lh3.googleusercontent.com/-1n80X4zZnvRaJLxuggcqfwuhz-UYTI9aDxiFBBdL4pvhNioNh4HmFryTXmz03MzUj0=h310",
        "//lh3.googleusercontent.com/RXS9KwB5dMc2zsyjcqD7bKwKN_uKIMo46zWP5qIp-gHh2sgNWzAtO4J7-JKat-0AAdmx=h310",
        "//lh3.googleusercontent.com/hTAQEr5XcOrntbeHdAfLx0TjteLhF3EQcYXOG5u8Vz5pAcobKcTjdmZ-mhx96WURDJkF=h310",
        "//lh3.googleusercontent.com/AbqfPyHVCIZ1Fhe91YZae5EHF7HsPZLtvDm2QLz4zHYU49hpKVjofi5P4Km2Xwoc6cI=h310",
        "//lh3.googleusercontent.com/8gB64ZxTv-SM_u7kk1eMmJ7rfzxuho1f6ZsOSTSoS9Aacm18BkSHdC9LFT65Dwz02hIb=h310",
        "//lh3.googleusercontent.com/TLrJGavr311lm_wJxXsAbR8mAafuSVKrctV9kBBnEBYXUS1UdnOlHSFoalFRfLGxOIk=h310",
        "//lh3.googleusercontent.com/Cpky_IGjSaCGiR5OGP8pA7qq6W1MIvXI9vC2J9FzNuidmaazNGs2IVUc1IfBIVmZaQ=h310",
        "//lh3.googleusercontent.com/JSG7417rO9xu1z5Ljv_bcKmWZBQOnk15prcXGSNa4zWjRB7_Fst--tLOiYqc6fe_NUUj=h310",
        "//lh3.googleusercontent.com/ObN7ROW1NgzO_ZoUBsKpviZhS0wRu7h9TacTFl9SBgfqK2pT8MekXrsPD6ctdwM7TI6T=h310",
        "//lh3.googleusercontent.com/IhraKYtLDv-X2Y_B-V4Yg9PmeUVqXr8ikamkBqEDkn7NuPqy8PZMGiqnxnsPTlyqLIQ=h310",
        "//lh3.googleusercontent.com/qrLs9anBaL3TKK6tgh_1ljYFLCFZcxijkDN_MZa7gLClqr6PdcE2XneSiFnyW2fjn5Q=h310",
        "//lh3.googleusercontent.com/tS1DWAW9YNJfFUtXg86CNv4vBCLA_4Fws40kmw9eJp65tfIvojqxnKTuorvyeZUnPw=h310",
        "//lh3.googleusercontent.com/hpIrhci1Ds6y2jNi0oQFJhlnbaj7kS7iKvqQEJJ8aX-qproEaSAl2T-NS4ZdxUpCjA=h310",
        "//lh3.googleusercontent.com/HliJPZoFki1y8fvvTN5PNQrIvwUf2AuHAjGcJ6GlUMpfv956qQO8UMS1B2QKTHb1W1s=h310",
        "//lh3.googleusercontent.com/IkHHBwopd6XQZ0Ckj-NkO98qgJUOe-33LsbRTLxSFvufeEiA-0cCZAsDFVjbcXmAVg=h310",
        "//lh3.googleusercontent.com/-bLvNRLTY4Oj3HIO6B7a7A_wEn0RRf7DqlLIeq3uwdFC5OUzziBI6HJwTfXOWHDfmw=h310",
        "//lh3.googleusercontent.com/AgyXLGQHbollsTTCpeTNIZ_y-zxKcWvJNv47cRerfIqdfqZM1NhUYBRqtEdznPaXWpqN=h310",
        "//lh3.googleusercontent.com/Idsti_H1SK7LDfD9Yj91TurWM43nIwcmS_-aP8rGLhSZeX98XrlGpzMNkRFWc3L3yP0=h310",
        "//lh3.googleusercontent.com/CAhWJbaCIpNpEZlTWsWxZhg3QScQK4EfhvNjDJrehtyHX6GW07J6SGjWtb5kBA6Y3hc=h310",
        "//lh3.googleusercontent.com/X_NH-rvm_0VStnMhTIqkMxVOE8TIDGlIaQcNUluRHe3m7_GqcNt7_E4cr-oo-PwY4A=h310",
        "//lh3.googleusercontent.com/SyYaszAgxYBPG_LQPn0Pqwa0Z9enFUQKtAA0Bqz3vQmVZvjuW2MHSrDU3gNAuzXD7g=h310",
        "//lh3.googleusercontent.com/_ui8mjeunHZvSIfXeThTougclN0U-NhVAi848z8oSn7jS2O07xJYVIIT_F3wT0E89j8=h310",
        "//lh3.googleusercontent.com/b-X2uoMb4fl7aLQU58hFCQcBXvVj0NXs29T5F0s4sgU1I2Xnfp-AmtWqichY3iZkXzY=h310"
    ],
    "video": "https://www.youtube.com/embed/IxkGeNxO-pw",
    "comments": [
        "Very intuitive GUI. I love the ability to break down projects into tasks paired with context labels (think tags). I've tried many organization apps including Evernote, onenote, Jorte, Wunderlist etc., but this app is the first I have continually used and benefitted from. Those other apps are all fine, but this works best for me!",
        "I have been trying to find a GTD app that integrates across platforms as well as flexible in use. Chaos Control has the best mobile app for GTD and works well across platforms. MacOS app is good but I'd like more control over let's say the font size and themes to help me use it effectively. None the less this is a very good GTD app.",
        "I do not do reviews but phenomenal app. Great for work or personal stuff. Very easy to learn and use.  Showed it to the Senior project manager and asked him to try it. He has switched as well as the 4 others. Even the kids like it. Not a big app purchaser but will be getting the computer version.",
        "This app has simplified my life. I have Dissociative Identity Disorder, and this app helps my alters and I get or stay on a similar page. Everyone can see what is here, and add their own projects, in one central location, that cannot be misplaced or forgotten about, like a paper planner or random notes.",
        "Terrible app, I'd like a refund of my £6.49! Firstly you need a degree in computer programming to set customised reminders (i.e. Only on certain days of the month) then they either fail to go off or there is no snooze function. Extremely restrictive and fed up of being told to purchase the desktop version. Uninstalling now and will continue to use my phones default calendar and reminder app for free. Don't waste your time or money!",
        "The home screen widget is too limited. Only 2 options, Chaos Box and Due Today. I'd really like to see my Contexts list as an optional default view in the widget. Using the GTD method, I like to see all tasks I can get done when a particular context is appropriate. Having a quick way right from my devices home screen to select a context from the list to see all related tasks, without having to open the app and select Contexts from the menu, that would be awesome.   Also, I try to launch the app on my Android Wear smartwatch and all I get is a spinning circle that vanishes quickly and I go right back to the watch home screen.  The app never opens on the watch.   Fix these 2 things and you will get 5 stars from me. But until then, 3 is all I can give."
    ],
    "recentChanges": [
        "Further Android 7.x optimisations and improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tarasovmobile.gtd&hl=en&gl=us",
    "appId": "com.tarasovmobile.gtd"
}