{
    "title": "Wear Gesture Control (BETA)",
    "summary": "Use gestures to control your phone!",
    "icon": "//lh3.googleusercontent.com/_Nkrybftqtd3efOTpr1Homs9rpnlbS17XEstJLrIEJ3wKa-xANadxjryFVD_h2qrz8Y=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 2.5,
    "reviews": 30,
    "developer": "Ivan  Yu",
    "developerId": "Ivan++Yu",
    "developerEmail": "me@ivanyu.ca",
    "developerWebsite": "http://www.ivanyu.ca",
    "developerAddress": "200 University Ave W,\nWaterloo, ON\nN2L 3G1",
    "updated": "June 30, 2015",
    "version": "1.0",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Do more than just scroll through notifications! Now you can use wrist gestures to control music, launch an app, or adjust watch settings. Not enough for you? Then the Tasker plugin will take care of anything else you can think of!  Features:★ Assign actions for up to 18 different gestures★ Create custom profiles to suit your needs★ Toggle gesture detection ON/OFF from watch or phone app★ TASKER Integration***Currently taking suggestions for more gestures/actions. Feel free to suggest other features that you would like to see!***List of actions:-Volume: UP-Volume: DOWN-Media: PAUSE/PLAY-Media: PREV-Media: NEXT-Launch an application-Ringer: Silent-Ringer: Vibrate-Ringer: Normal-Trigger TASKER Event-Gesture Control: Switch Profile-Gesture Control: Turn off-Wifi ON-Wifi OFF-SLEEP Handset-WAKE HandsetList of gestures: -Raised Clockwise Twist-Raised C-Clockwise Twist-Raised Clockwise Double-Twist-Raised C-Clockwise Double-Twist-Raised Clockwise Triple-Twist-Raised C-Clockwise Triple-Twist-Level Clockwise Twist-Level C-Clockwise Twist-Level Clockwise Double-Twist-Level C-Clockwise Double-Twist-Level Clockwise Triple-Twist-Level C-Clockwise Triple-Twist-Lowered Clockwise Twist-Lowered C-Clockwise Twist-Lowered Clockwise Double-Twist-Lowered C-Clockwise Double-Twist-Lowered Clockwise Triple-Twist-Lowered C-Clockwise Triple-TwistThis app uses the Device Administrator permission.",
    "descriptionHTML": "Do more than just scroll through notifications! Now you can use wrist gestures to control music, launch an app, or adjust watch settings. Not enough for you? Then the Tasker plugin will take care of anything else you can think of!  <br><br><br>Features:<br>&#x2605; Assign actions for up to 18 different gestures<br>&#x2605; Create custom profiles to suit your needs<br>&#x2605; Toggle gesture detection ON/OFF from watch or phone app<br>&#x2605; TASKER Integration<br><br><br>***Currently taking suggestions for more gestures/actions. Feel free to suggest other features that you would like to see!***<br><br><br>List of actions:<br>-Volume: UP<br>-Volume: DOWN<br>-Media: PAUSE/PLAY<br>-Media: PREV<br>-Media: NEXT<br>-Launch an application<br>-Ringer: Silent<br>-Ringer: Vibrate<br>-Ringer: Normal<br>-Trigger TASKER Event<br>-Gesture Control: Switch Profile<br>-Gesture Control: Turn off<br>-Wifi ON<br>-Wifi OFF<br>-SLEEP Handset<br>-WAKE Handset<br><br><br>List of gestures: <br>-Raised Clockwise Twist<br>-Raised C-Clockwise Twist<br>-Raised Clockwise Double-Twist<br>-Raised C-Clockwise Double-Twist<br>-Raised Clockwise Triple-Twist<br>-Raised C-Clockwise Triple-Twist<br>-Level Clockwise Twist<br>-Level C-Clockwise Twist<br>-Level Clockwise Double-Twist<br>-Level C-Clockwise Double-Twist<br>-Level Clockwise Triple-Twist<br>-Level C-Clockwise Triple-Twist<br>-Lowered Clockwise Twist<br>-Lowered C-Clockwise Twist<br>-Lowered Clockwise Double-Twist<br>-Lowered C-Clockwise Double-Twist<br>-Lowered Clockwise Triple-Twist<br>-Lowered C-Clockwise Triple-Twist<br><br>This app uses the Device Administrator permission.",
    "histogram": {
        "1": 10,
        "2": 8,
        "3": 4,
        "4": 3,
        "5": 5
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/jD_cQPuCJCJjn5dqU_hwfLi-ddMYoyboM3A9JJxWVxBSQW986FvmQzc5izXStN6rQDc=h310",
        "//lh3.googleusercontent.com/6UZ-5chYdBOh-whNlXu7cV8CFsxGpbHJh_VXOzZZ6FCSUcybpZfnN01BetgsHEtzS5w=h310",
        "//lh3.googleusercontent.com/OdzJhGyXP-Id7J8LyYb1Bd5yOX3RWnSf_UEky_xkfk0qJbK9LRVz15bJqKtdELFuWfQ=h310",
        "//lh3.googleusercontent.com/vwsWjxLeQTdl32D0H-OUAl5VifV9maOO7iktIVvGDiskXkBB9z6HZaEhsupn-vnjZQc=h310",
        "//lh3.googleusercontent.com/CrBpYmUWCwyTzrTqGAC5mvtNSMCJyI4o0tbC03LIemg2HXSWdKLguH-3Gc2wB8d9FoBR=h310",
        "//lh3.googleusercontent.com/fCEBUcfG2xaxzl2gRWh78uPSueB7WA90IW68kGNQPhBGioEKD--1UIRcjQYd7gMwSOA=h310",
        "//lh3.googleusercontent.com/3SkNPh1rLYg4O-Rc6MpObIam_qn2qRhd6yzrCrDKddA098SfaKJimF_4DxtO7v_K34g=h310"
    ],
    "video": "https://www.youtube.com/embed/7SL4mQgJUwc",
    "comments": [
        "This poor app that has so much potential looks to be abandoned by its developer. I've been looking for an app like this for some time. It felt like Christmas until I discovered that none of the gestures work on my Huawei 1st Gen watch. I'm not much of a beggar, but I beg to the developer to please take care of your app. It's the only one of it's kind.",
        "Can do much better It works relatively well on my Sony SmartWatch3. But doesn't work on my Moto 360. Please Fix! I will get premium when it is fixed!",
        "More motions needed. Twist are inefficient. Sw3 supports elbow rotation",
        "Great concept, more support needed Not functioning on Moto 360",
        "Doesn't work at all on moto 360",
        "Not working Not working on LG G Watch. Hopefully fixed soon. Cool idea."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.yu.ivanyu.weargesturecontrol&hl=en&gl=us",
    "appId": "com.yu.ivanyu.weargesturecontrol"
}