{
    "title": "My Verizon",
    "summary": "Take control of your account. Use the App to get account info on-the-go!",
    "icon": "//lh3.googleusercontent.com/WKrdHiuItXoIBeHmb1-Hprg1DbKCJhVduaVB1GT6Iy5_iSgmE64CsPuHW4mk32w4RoPd=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000000,
    "maxInstalls": 100000000,
    "score": 3.9,
    "reviews": 257760,
    "developer": "Verizon - VZ",
    "developerId": "Verizon+-+VZ",
    "developerEmail": "MyVZMobile@VerizonWireless.com",
    "developerWebsite": "http://www.verizonwireless.com",
    "developerAddress": "One Verizon Way, Basking Ridge, New Jersey",
    "updated": "March 2, 2018",
    "version": "Varies with device",
    "genre": "Tools",
    "genreId": "TOOLS",
    "size": "Varies with device",
    "description": "***The My Verizon App works best if you are on one of our newer plans.  Don’t have a S, M, L or Unlimited?  Switch now.***   The My Verizon App has a new look! Use this app to manage your entire Verizon account from anywhere, in style. Features include:The FeedAll you need to know about your data, plan, and bill in one seamless Feed, personalized with products and content just for you.The Data HubYour data control center.  Clearly see how much data is being used, who is using it and how to get more the second you need it.Plan Management Review and manage your plan from anywhere.  Easily switch to a different plan or go unlimited at any time right from the palm of your hand. Simplified BillA clear and simple bill that explains what's changed from month to month. Understand and pay your bill with just a few tapsVerizon Up Rewards Rewards you really, really want.  Just for being a Verizon customer.  From amazing once-in-a-lifetime experiences to tons of good stuff from the brands you love.  Because, thanks.  Simply, enroll today, exclusively in the My Verizon app.  On-Demand SupportIn-app support that’s there before you need it.  Instant access to the answers you want without having to call for help.  Shop Tech The fastest and easiest way to browse, buy and customize the latest devices and accessories, all without leaving the app.In-Store App ExperiencesIn your settings, set app location services to “Always” prior to your visit and take advantage of customize in-store experiences.  Optimize your visit by checking-in for appointments upon arrival, scanning accessories for self-checkout, and much more.  One app.  Total control.***The My Verizon App is now also available to conveniently serve all prepaid self-service needs.  Make payments, enroll in Auto Pay, monitor usage, add data or change a plan directly on your prepaid device. Managing your prepaid account on the most reliable network has never been easier.***",
    "descriptionHTML": "***The My Verizon App works best if you are on one of our newer plans.  Don&#x2019;t have a S, M, L or Unlimited?  Switch now.***   <br><br>The My Verizon App has a new look! Use this app to manage your entire Verizon account from anywhere, in style. <br><br>Features include:<br><br>The Feed<br>All you need to know about your data, plan, and bill in one seamless Feed, personalized with products and content just for you.<br><br>The Data Hub<br>Your data control center.  Clearly see how much data is being used, who is using it and how to get more the second you need it.<br><br>Plan Management <br>Review and manage your plan from anywhere.  Easily switch to a different plan or go unlimited at any time right from the palm of your hand. <br><br>Simplified Bill<br>A clear and simple bill that explains what&apos;s changed from month to month. Understand and pay your bill with just a few taps<br><br>Verizon Up Rewards <br>Rewards you really, really want.  Just for being a Verizon customer.  From amazing once-in-a-lifetime experiences to tons of good stuff from the brands you love.  Because, thanks.  Simply, enroll today, exclusively in the My Verizon app.  <br><br>On-Demand Support<br>In-app support that&#x2019;s there before you need it.  Instant access to the answers you want without having to call for help.  <br><br>Shop Tech <br>The fastest and easiest way to browse, buy and customize the latest devices and accessories, all without leaving the app.<br><br>In-Store App Experiences<br>In your settings, set app location services to &#x201C;Always&#x201D; prior to your visit and take advantage of customize in-store experiences.  Optimize your visit by checking-in for appointments upon arrival, scanning accessories for self-checkout, and much more.  <br><br>One app.  Total control.<br><br>***The My Verizon App is now also available to conveniently serve all prepaid self-service needs.  Make payments, enroll in Auto Pay, monitor usage, add data or change a plan directly on your prepaid device. Managing your prepaid account on the most reliable network has never been easier.***",
    "histogram": {
        "1": 39523,
        "2": 10450,
        "3": 21430,
        "4": 54284,
        "5": 132073
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Y643k9NNlADzXo879BXlOl1SB7_G2mFpaqUdFix5X9Ra6Di7Mff4NwWGrfR09JTykg=h310",
        "//lh3.googleusercontent.com/nc_VD5pZEhyVU4q0UkTXnC_uLYfMKTPAMOyh1_WAufeJ7FbB6Qh7WNbvpk3H01YexT4=h310",
        "//lh3.googleusercontent.com/1ALpsNqd9EGu7WfVAbEevkaL7DixAU0fUqpfzqextg9rpxgYRWB8z7lYglXuDFeABNGf=h310",
        "//lh3.googleusercontent.com/hyyr0e3GpG11iZPWp24obcMl2K0Rpnn0EOXnS8oC4wp3Hqulmtuty6uinLY3MU6qUQ=h310",
        "//lh3.googleusercontent.com/lzRpcxzMwBwnJVdIWb-BUJ2aBl4Wje6mzUD0fW66KAwZkSCL-KS7Lr3MjIs6HT-NNQQ=h310"
    ],
    "comments": [
        "Verizon does what it says, most of the time. Meaning the app! Works great! Awesome tech support! 😄 But not the chat. It pops up when I barely touch to get into the app. Verizon Is my Top choice for products They offer. I don't see the options I once Seen IN the app cuz Then I have to go Really online in my browser, I think. Overall Verizon is The Best 4G etc., etc. Etc, for many of my needs. I can't get to Repair like I used to either at my Odd hours ~",
        "The new \"card\" layout is very bad. So much wasted space and very ugly. This is not a news app. It also seems fingerprint login is not an option anymore. I would be impressed if Verizon had the foresight to realize this is wrong and just scrap the new design. Consider it a mistake learned from.",
        "Terrible redesign. Used to look like a great Android app. Now I don't even know what design it's going for. Go back to the drawing board, Verizon. This is abysmal.",
        "This app used to work great for bill paying....but for the last several months I get an error saying \"oops something went wrong\" and i can't even open the app. Several calls to customer service, was told they would call me back as it was something on their end on my account...still no resolution and never heard back from them. Wish I could just uninstall it.",
        "New app design is not visually appealing. Very generic and \"cheap\" looking. It's slower also. Other design was more user friendly. Don't like that i have to keep logging in. Revert back!",
        "Went from 5 stars to 1. Who designed the UI? A 14 year old? It's bland, cannot dismiss cards, and reminds me every time I open the app that yes I know I canceled my order. I hate to say it but T-mobile's UI is better at this time."
    ],
    "recentChanges": [
        "The My Verizon App has a new look! Use this app to manage your entire Verizon account from anywhere, in style."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.vzw.hss.myverizon&hl=en&gl=us",
    "appId": "com.vzw.hss.myverizon"
}