{
    "title": "ABC News - US & World News",
    "summary": "ABC News brings you the latest headlines &amp; video on politics, us and world news",
    "icon": "//lh4.ggpht.com/VLAqGQWkvx6lt3UdBYuUjMGq3_lB2GzXi_MoKdZQKLLy1KzKlqrvfZ-d9rU-deudBA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4,
    "reviews": 18750,
    "developer": "ABC News",
    "developerId": "ABC+News",
    "developerEmail": "abcnews.androidapp@abc.com",
    "developerWebsite": "http://abcnews.go.com",
    "updated": "February 8, 2018",
    "version": "3.17.13",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "description": "Watch ABC News directly from your Android phone - Watch news clips from your favorite shows including Good Morning America, World News, Nightline, This Week and 20/20. Get breaking U.S. and world news or catch up with the latest stories in entertainment, politics, sports, health, technology, science and business:- Watch streaming live coverage as news breaks - Multi-task -  Browse and read stories as videos stream  - Listen to ABC News Radio in the car or wherever you are -  even when you are in other apps- Get personalized alerts & a custom ‘News Inbox’ keep you from missing stories for the topics you care aboutSTREAMING NEWS - VIDEO CLIPS & ABC NEWS RADIO:No Cable subscription - No problem! Get hassle free news, wherever and whenever you need it, no signup or service required! Our new Android ABC News app lets you stream news from anywhere, whether you have WiFi or just a 3G connection - No need to log in or have a cable subscription. Not interested in reading the News? Watch local and national news clips, check out news slideshows or listen to ABC Radio!NEWS ALERTS THAT YOU CONTROL:The ABC News app lets you set up and control a personalized list of alerts, so that we can send you push notifications about the topics that interest you. You can tell us how often you want to get the push notifications, and when. No need to wade through a bunch of news that you don’t care about! We will help you find exactly the stories, articles and videos that you are interested in. NEWS CATEGORIES INCLUDE:-US News-Politics-Local Interest Stories-International News-Investigative Reporting-Lifestyle & Entertainment News-Health-Financial Stories-Technology News-Sports Reporting-Travel SEARCHABLE MULTI-MEDIA NEWS OF ALL TYPES:Read, watch or listen to news that you want to hear! The ABC News App lets you search to find exactly what you are looking for. You can search by keyword, show or topic. We also have sections for ‘Trending News’ ‘Top Stories’ and the ‘Daily Rewind’ which will show you a visual recap of the events of the day! SAVE FAVORITES & SET ALERTS:Want to skip straight to your favorite topics? Save stories and topics you like in your Favorites, and we will automatically add those stories as well as any follow-up news related to those stories. Your ABC News Favorites holds just the stories that you care about. LOCAL NEWS STORIES BY GEOGRAPHY:Watch local stories from ABC stations in Chicago, Fresno, Houston, Los Angeles, New York, Philadelphia, Raleigh & San Francisco.SPORTS STORIES FROM ESPN:Want to know when your favorite teams are playing or how they are doing? The ABC News app is all over it. We can store news stories and updates about domestic and international sports news & events directly in your bookmarks. We can even send you push-notifications about certain teams. Just customize your settings to tell us exactly what you want! We have NFL, NBA, NHL, tennis, golf and everything newsworthy in sports.",
    "descriptionHTML": "Watch ABC News directly from your Android phone - Watch news clips from your favorite shows including Good Morning America, World News, Nightline, This Week and 20/20. Get breaking U.S. and world news or catch up with the latest stories in entertainment, politics, sports, health, technology, science and business:<br><br>- Watch streaming live coverage as news breaks <br>- Multi-task -  Browse and read stories as videos stream  <br>- Listen to ABC News Radio in the car or wherever you are -  even when you are in other apps<br>- Get personalized alerts &amp; a custom &#x2018;News Inbox&#x2019; keep you from missing stories for the topics you care about<br><br>STREAMING NEWS - VIDEO CLIPS &amp; ABC NEWS RADIO:<br>No Cable subscription - No problem! Get hassle free news, wherever and whenever you need it, no signup or service required! Our new Android ABC News app lets you stream news from anywhere, whether you have WiFi or just a 3G connection - No need to log in or have a cable subscription. <br><br>Not interested in reading the News? Watch local and national news clips, check out news slideshows or listen to ABC Radio!<br><br>NEWS ALERTS THAT YOU CONTROL:<br>The ABC News app lets you set up and control a personalized list of alerts, so that we can send you push notifications about the topics that interest you. You can tell us how often you want to get the push notifications, and when. No need to wade through a bunch of news that you don&#x2019;t care about! We will help you find exactly the stories, articles and videos that you are interested in. <br><br>NEWS CATEGORIES INCLUDE:<br>-US News<br>-Politics<br>-Local Interest Stories<br>-International News<br>-Investigative Reporting<br>-Lifestyle &amp; Entertainment News<br>-Health<br>-Financial Stories<br>-Technology News<br>-Sports Reporting<br>-Travel <br><br>SEARCHABLE MULTI-MEDIA NEWS OF ALL TYPES:<br>Read, watch or listen to news that you want to hear! The ABC News App lets you search to find exactly what you are looking for. You can search by keyword, show or topic. We also have sections for &#x2018;Trending News&#x2019; &#x2018;Top Stories&#x2019; and the &#x2018;Daily Rewind&#x2019; which will show you a visual recap of the events of the day! <br><br>SAVE FAVORITES &amp; SET ALERTS:<br>Want to skip straight to your favorite topics? Save stories and topics you like in your Favorites, and we will automatically add those stories as well as any follow-up news related to those stories. Your ABC News Favorites holds just the stories that you care about. <br><br>LOCAL NEWS STORIES BY GEOGRAPHY:<br>Watch local stories from ABC stations in Chicago, Fresno, Houston, Los Angeles, New York, Philadelphia, Raleigh &amp; San Francisco.<br><br>SPORTS STORIES FROM ESPN:<br>Want to know when your favorite teams are playing or how they are doing? The ABC News app is all over it. We can store news stories and updates about domestic and international sports news &amp; events directly in your bookmarks. We can even send you push-notifications about certain teams. Just customize your settings to tell us exactly what you want! We have NFL, NBA, NHL, tennis, golf and everything newsworthy in sports.",
    "histogram": {
        "1": 2103,
        "2": 973,
        "3": 1620,
        "4": 3633,
        "5": 10421
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone 10+",
    "screenshots": [
        "//lh3.googleusercontent.com/jIFN0rIqDpSqNCN8CdmrBkiHzertGY4JncEmqPgmc93BAt5MoeUxwZJNNdPzbAs0MQ=h310",
        "//lh3.googleusercontent.com/OUXeImIsrjv1Vp4TzOa8LLJE8_GaZRIQ7Al8GsjocYWIuHoCptYzMkRA1JxDKCyVpw=h310",
        "//lh3.googleusercontent.com/_5Z7rVqD2xYe0GznYI41SfnQ8EqBWtXzGwZDsBe5rIDEPie6qxzGU6QeXY9SAfSH7Q=h310",
        "//lh3.googleusercontent.com/KlHCQaREcHTLRHpmE0a7YVwyjLibRchVqg1ONmlRKz6hgt6hvFIhJbgoWGzL0y1k=h310",
        "//lh3.googleusercontent.com/kktMgXTxPR-RYZmHm-CVRgaXmhAbsFUKgIAw_YfRjUYIhB177gjNatfFq2ooZirdmWoQ=h310",
        "//lh3.googleusercontent.com/fkzGi3f1rs25OpXHGaGsngyzti7AK9WxxvNj7dgOb214PYRqZokwNm3-SDSjBJgm9ern=h310"
    ],
    "comments": [
        "Was my go-to news app with great articles for years. In the past year, it has become almost unusable due to crashes, long load times and unresponsiveness. Please fix.",
        "Love the news I get from abc but still lot of issues. It went from \"Houston we've got a problem\" when I try to play videos to the videos auto playing when I open the page. Made sure auto play was not checked in settings. Then for the videos I want to watch, apart from the ads, it takes so long to stream that I end up closing it. I can immediately go to another news app & have no connection issue, or trouble playing a video...only with abc news!",
        "Needs dark/night mode so doesn't hurt eyes or waste so much battery",
        "Horrible to be honest, Spyware masquerading as a news app",
        "FLAMING BLEEDING HEART LIBERAL BULL $HIT",
        "Keep informed of what is happening !"
    ],
    "recentChanges": [
        "UI enhancements to better match the Material Design spec. Bug fixes and performance enhancements as well."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.abc.abcnews&hl=en&gl=us",
    "appId": "com.abc.abcnews"
}