{
    "title": "Clock",
    "summary": "Your simple and beautiful alarm clock for Android",
    "icon": "//lh3.googleusercontent.com/Q-TyP-0iMexxAQDt7N81PLjLCrkoBkZVuSxP_1laOHxmctHhwJKsOXC9DYeBGXs8NIM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.1,
    "reviews": 155265,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "android-clock-feedback@google.com",
    "developerWebsite": "http://www.google.com/",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Tools",
    "genreId": "TOOLS",
    "size": "Varies with device",
    "description": "Clock combines all of the functionality you need into one simple, beautiful package.  • Set alarms, add timers, and run a stopwatch • Keep track of time around the world using the World Clock • Pair with Android Wear devices to bring your alarms and timers to your wrist",
    "descriptionHTML": "Clock combines all of the functionality you need into one simple, beautiful package. <br><br> &#x2022; Set alarms, add timers, and run a stopwatch<br> &#x2022; Keep track of time around the world using the World Clock<br> &#x2022; Pair with Android Wear devices to bring your alarms and timers to your wrist",
    "histogram": {
        "1": 14697,
        "2": 6929,
        "3": 13725,
        "4": 27895,
        "5": 92019
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/-d2Oynia6jFo3MHFJ-VhxeGnXP7RZV3p1QJ--Y28PQaUTSFmS1EUMnqB4IJNA6_Fkw=h310",
        "//lh3.googleusercontent.com/Ww8_4SgzE8Y047b5uRlW7QZJ_Po5ONZU5tThVEHp9UF8DoPSzIDBUCjYci1rvRnmnQ=h310",
        "//lh3.googleusercontent.com/hMFMXZJNnp4qjaXVZlTBl7HTfIDQSYP3icCr1L6SMLIH4PcYQPWsUWEbNiCBbkTTCkVs=h310",
        "//lh3.googleusercontent.com/CPpyVynLCdJ8zruWlruuciZ_pqpA0ZsOVWXgA4A9JmyWLRH4TQc9NbTJHbUYwR5O7qg=h310",
        "//lh3.googleusercontent.com/O_IpXuPCfbYgbgRTBKpb0BfEIygNafvBn-LtooVm3QcMBlyd3ExlxLMjl4oZ27ftiw=h310",
        "//lh3.googleusercontent.com/6EE6Q7eQCLz7IPsnl0btuac3iRMqRY2uCgKaSSneAVAv9yhpIAGjSJYuYYo_r32C6A=h310",
        "//lh3.googleusercontent.com/a50R0Ci7pqWDJYOW22iPX5vpUXwgg-sBtCrnnOYGoKKMsgtsCDarXvVogR-RSmwopA=h310",
        "//lh3.googleusercontent.com/PJCO4qVMxRUeyP2uFcQ50IyxXh_IuveYjtgM2chKBNZwCX99LmeKhrnez6qotvCMLZb3=h310",
        "//lh3.googleusercontent.com/xyhsGCGAmJbdaMfjWjPL24t6C58BSAxQ335CYsJY0COBEPgC_IDAIft6nEmqVaXxC8I=h310",
        "//lh3.googleusercontent.com/evjU9jENXiMQuIGVnHK_vLbYbAdDZYFrHKFq26Wnvi2YfKfR13qNx9M7ZfxOary5m4MR=h310",
        "//lh3.googleusercontent.com/asD7gWLGbUo9OIVs2JK83dO4mBA11Ci7H_wKxrtw7LHEo4UoJr0d1WwH1lJVIh7sYa57=h310",
        "//lh3.googleusercontent.com/DrtcJ_oZRU_RpUGI0eWJuGor88hUDq6D1I7KzCEnAIGCZkXgxU7R4CV9tD5VlYEQPxQ=h310"
    ],
    "comments": [
        "On Android wear alarm can not have name.",
        "This app is ok but can be great. Constantly have to be going through manually trying of my million and one alarms individually. How about adding a feature where alarms can be grouped? So you have alarms for work that are all turned off or on by a master button. {{Is it me or the alarm fill screen alert has shifted up quite a bit?}}",
        "Would be great if actually functioned as alarm clock. Alarm tones do not work on updated Android operating system.  Phone let's out a muted beep every so often instead of an alarm. Emailed about this, no response. This app could have got me fired.  It used to be reliable,but is far from it now",
        "Great app and would be 5 stars if they would do 2 things. First and most importantly is make it harder to turn the alarm off. The snooze and off buttons are too close and I have turned off alarms instead of hitting snooze.   And secondly make the snooze time separate for each alarm not a global setting. Other than those 2 issues I really like it.",
        "App is not working properly after and update. This morning it missed the alarm which was set to turn on every working day at 7:15 for the last two years. I am switching to the built in Samsung app unfortunately since this app has better and more intuitive UI combined with awesome material design, but it fails as a simple alarm app it should be.",
        "In an earlier review I stated that all alarms had to use the same alarm sound tone. This is not correct.  What I meant to write is this app only allows one (1) downloadable alarm sound tone.  The user can select multiple alarm sound tones from the in app provided list.  Unfortunately, if you prefer to download your own alarm sound tones you are limited to just one. Why?  Since my last review an update moved the alarm names to the right side of the days of the week.  Although this is more aesthetically pleasing it still does not address the fact that both the week days and alarm name sometimes fight for space on the same line which can  hide part of the alarm name."
    ],
    "recentChanges": [
        "• Add any city in the world to your World Clock",
        "• Drag to reorder cities in your World Clock"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.deskclock&hl=en&gl=us",
    "appId": "com.google.android.deskclock"
}