{
    "title": "Mein Bauprojekt",
    "summary": "The app for renovation and construction schedules and costs can easily grip",
    "icon": "//lh3.googleusercontent.com/gxX87DR90g_d-sgLgcYlVPnWjYeYv4WCKw2OZ7ithq3NSxE1E3SYvbCEE5ZwaALZa9g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.3,
    "reviews": 42,
    "developer": "Bosch Thermotechnik GmbH",
    "developerId": "Bosch+Thermotechnik+GmbH",
    "developerEmail": "info@effizienzhaus-online.de",
    "developerWebsite": "http://www.effizienzhaus-online.de/mein-bauprojekt",
    "developerAddress": "Bosch Thermotechnik GmbH\nSophienstraße 30-32\n35576 Wetzlar",
    "updated": "September 4, 2017",
    "version": "1.4.3",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Bauen und sanieren übersichtlich organisieren. Die App „Mein Bauprojekt“ von Bosch macht die Organisation und Umsetzung Ihres Neubau- /Sanierungsprojekts ganz leicht: sie zeigt auf einen Blick, ob sich Ihr Bauprojekt im Kostenrahmen bewegt und termingerecht fertig wird. Der besondere Vorteil besteht in den sehr ausführlichen Checklisten für alle Gewerke, die Sie auf typische Umsetzungsprobleme und Baumängel hinweisen.Die in der Grundversion kostenlose App ermöglicht eine umfangreiche Bauplanung und -Bauorganisation: Möglich ist das Eingeben Ihrer Zeitplanung samt Terminen und Erinnerungsfunktion, sowie der Vergleich von Handwerkerangeboten. Für Neubau und viele Sanierungsmaßnahmen beispielsweise Heizungs- oder Fenstertausch, Badsanierung oder Dach- und Fassadendämmung sind Gewerke-Pläne hinterlegt. Wird  während der Umsetzung festgestellt, dass für den Zeitpunkt des Bauprojekts bereits zu viel Geld ausgegeben wurde oder das Restbudget bedrohlich schrumpft, weist die App Sie durch eine Farbänderung sofort darauf hin. Ändert sich der Start- oder Endtermin einzelner Arbeiten werden Sie und alle davon betroffenen Handwerker automatisch informiert.Auch ein Bautagebuch mit Dokumenten und Fotos vom Baufortschritt kann eingerichtet werden. So haben Sie als Bauherr immer alle wichtigen Informationen dabei und können Ihr Bauprojekt auch von unterwegs optimal steuern.Vor allem für umfangreichere Bau- oder Sanierungsmaßnahmen mit mehreren Gewerken wird diese App schnell unentbehrlich. App „Mein Bauprojekt“ – so funktioniert‘s:App installieren: die Grundversion mit bis zu drei Bau- oder Sanierungsgewerken ist kostenlos, die volle Version kostet zur Einführung 14,99 Euro. In der Planungsphase legen Sie als Bauherr die gewünschten Maßnahmen bzw. Gewerke mit Angeboten, Handwerker-Kontakten und Zeiten an. Ihr geplantes Budget geben Sie ein oder es wird automatisch aus den ausgewählten Angeboten mit Puffer ermittelt. Die Handwerker-Rechnungen werden später damit verglichen. Zusätzliches Plus: Die App enthält für alle Baumaßnahmen bzw. Gewerke hilfreiche Checklisten zur Abnahme von Handwerkerleistungen.",
    "descriptionHTML": "Bauen und sanieren &#xFC;bersichtlich organisieren. Die App &#x201E;Mein Bauprojekt&#x201C; von Bosch macht die Organisation und Umsetzung Ihres Neubau- /Sanierungsprojekts ganz leicht: sie zeigt auf einen Blick, ob sich Ihr Bauprojekt im Kostenrahmen bewegt und termingerecht fertig wird. Der besondere Vorteil besteht in den sehr ausf&#xFC;hrlichen Checklisten f&#xFC;r alle Gewerke, die Sie auf typische Umsetzungsprobleme und Baum&#xE4;ngel hinweisen.<br><br>Die in der Grundversion kostenlose App erm&#xF6;glicht eine umfangreiche Bauplanung und -Bauorganisation: M&#xF6;glich ist das Eingeben Ihrer Zeitplanung samt Terminen und Erinnerungsfunktion, sowie der Vergleich von Handwerkerangeboten. F&#xFC;r Neubau und viele Sanierungsma&#xDF;nahmen beispielsweise Heizungs- oder Fenstertausch, Badsanierung oder Dach- und Fassadend&#xE4;mmung sind Gewerke-Pl&#xE4;ne hinterlegt. <br>Wird  w&#xE4;hrend der Umsetzung festgestellt, dass f&#xFC;r den Zeitpunkt des Bauprojekts bereits zu viel Geld ausgegeben wurde oder das Restbudget bedrohlich schrumpft, weist die App Sie durch eine Farb&#xE4;nderung sofort darauf hin. &#xC4;ndert sich der Start- oder Endtermin einzelner Arbeiten werden Sie und alle davon betroffenen Handwerker automatisch informiert.<br>Auch ein Bautagebuch mit Dokumenten und Fotos vom Baufortschritt kann eingerichtet werden. So haben Sie als Bauherr immer alle wichtigen Informationen dabei und k&#xF6;nnen Ihr Bauprojekt auch von unterwegs optimal steuern.<br>Vor allem f&#xFC;r umfangreichere Bau- oder Sanierungsma&#xDF;nahmen mit mehreren Gewerken wird diese App schnell unentbehrlich.<br>&#xA0;<br>App &#x201E;Mein Bauprojekt&#x201C; &#x2013; so funktioniert&#x2018;s:<br><br>App installieren: die Grundversion mit bis zu drei Bau- oder Sanierungsgewerken ist kostenlos, die volle Version kostet zur Einf&#xFC;hrung 14,99 Euro. In der Planungsphase legen Sie als Bauherr die gew&#xFC;nschten Ma&#xDF;nahmen bzw. Gewerke mit Angeboten, Handwerker-Kontakten und Zeiten an. Ihr geplantes Budget geben Sie ein oder es wird automatisch aus den ausgew&#xE4;hlten Angeboten mit Puffer ermittelt. Die Handwerker-Rechnungen werden sp&#xE4;ter damit verglichen. <br>Zus&#xE4;tzliches Plus: Die App enth&#xE4;lt f&#xFC;r alle Bauma&#xDF;nahmen bzw. Gewerke hilfreiche Checklisten zur Abnahme von Handwerkerleistungen.",
    "histogram": {
        "1": 12,
        "2": 3,
        "3": 3,
        "4": 7,
        "5": 17
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/vYA-ny731KVyZhrluAa_85kal1CtNBFbWlOZvlNO-HOzvBCJ1EZXmigf6ibuOrXidw=h310",
        "//lh3.googleusercontent.com/9NBpmvFSyYLdB2n9DLo82hluO1Xjif3W_VOB8ODIcTefX2SqZWR2jWxihhWqkRlib54=h310",
        "//lh3.googleusercontent.com/CDNyrQdBFmr1AG4cnfgmAro4ZlNbNk5ObZ2JrLKKArALp0xh4GfiRmVIRlhaepuT-7s=h310",
        "//lh3.googleusercontent.com/4s100tTd6jo0nA1ierM2Jt1P6FT2H53h5qT6veQDOoj5orkFit6UzzZzZ7Y2skmhoeJv=h310",
        "//lh3.googleusercontent.com/rgpoPOq51r0oKkZk-1Sp-3pobwFPttym2lKj_DIFse_o3p3rrzA3ITGUUffni4uOVj6T=h310",
        "//lh3.googleusercontent.com/Oyj0nS3LzDmwgVFtN9F6m_2NjbiwpmZLPd-5n9b81xpi6FOQvnnrRyPQY6aV74-XF6E=h310",
        "//lh3.googleusercontent.com/iCJujHbOPZFAm0nyyTMxIdfmdHe0ytcpQQOtVscrbX0Cfxzs7c5Rq1IZrtOVUPVTTzQ=h310",
        "//lh3.googleusercontent.com/bTXawi-ARnqeBxTIaNgvbrsPrvSI48EAaHH0Mfegx9CYPc5KJVQNijK4Zf0_Olf9t0k=h310",
        "//lh3.googleusercontent.com/l2iZIO5GffuEl7z_isXfxmG_cdlX67X61kYnJuji0uPfrrgGfH8gqdHdC5qwc8tvRQ=h310",
        "//lh3.googleusercontent.com/hVwzjdPMqBSA4RC3q_J3YCZOkD0vq9hUUZyB45jzvzXb7HYJCG5HalyIrn8iTHUczFY=h310",
        "//lh3.googleusercontent.com/B4FyOD8Q0A9fG3ekDXbsy7Guc8CgRwy_ZSBBvLC1ukhFyZbIqzp1ntA7zDe5fFQGmdU=h310"
    ],
    "video": "https://www.youtube.com/embed/5k-XMH7AObg",
    "comments": [],
    "recentChanges": [
        "Performance-Verbesserung",
        "Allgemeine Verbesserungen in der Nutzung",
        "Beseitigung von Fehlern"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bosch.tt.de.mybuildingproject&hl=en&gl=us",
    "appId": "com.bosch.tt.de.mybuildingproject"
}