{
    "title": "PDF Reader for Android Wear",
    "summary": "PDF Reader for Wear is a standalone PDF viewer",
    "icon": "//lh5.ggpht.com/Uqzi7FLvRdu7nUwyqwR4LpOxHUWVpG2c6a70T6DNnL_yXPh8vrA9hHVTxEY3ONZSr8c=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.5,
    "reviews": 720,
    "developer": "Marcel Dopita",
    "developerId": "4670723780649918393",
    "developerEmail": "its@brouken.com",
    "developerWebsite": "https://brouken.com/",
    "developerAddress": "Na Libuši 631\n39165 Bechyně\nCzech Republic",
    "updated": "September 24, 2016",
    "version": "0.4.0a",
    "genre": "Books & Reference",
    "genreId": "BOOKS_AND_REFERENCE",
    "description": "How to start viewing PDF on Android Wear?- Tap share from opened PDF file in Adobe Reader and select „PDF Reader“ (same red colored icon).- Alternatively browse to your PDF file in any file manager on your phone and open it in „PDF Reader“. Within a moment, it will be transferred to Wear. (But transferring files as large as 50 MB will take few minutes.) - Long tap in the PDF Reader on Android Wear to access all transferred filesHow to control PDF Reader on Android Wear?- You can use touch, double tap, pinch and even double touch drag („one hand zoom“) to browse your content. To move between pages, use the dedicated controls at bottom of the screen. Page indicator can be touched to enable dictation (for skiping to specific page number).- Additional options are available after a long press on a screen. There's an „invert“ (night) mode and a list of transferred files to open.Please note that it's not really technically feasible to support reflow or search in this small and free app.Support thread: http://forum.xda-developers.com/android-wear/development/app-pdf-reader-android-wear-standalone-t3031369",
    "descriptionHTML": "How to start viewing PDF on Android Wear?<br>- Tap share from opened PDF file in Adobe Reader and select &#x201E;PDF Reader&#x201C; (same red colored icon).<br>- Alternatively browse to your PDF file in any file manager on your phone and open it in &#x201E;PDF Reader&#x201C;. <br>Within a moment, it will be transferred to Wear. (But transferring files as large as 50 MB will take few minutes.) <br>- Long tap in the PDF Reader on Android Wear to access all transferred files<br><br><br>How to control PDF Reader on Android Wear?<br>- You can use touch, double tap, pinch and even double touch drag (&#x201E;one hand zoom&#x201C;) to browse your content. To move between pages, use the dedicated controls at bottom of the screen. Page indicator can be touched to enable dictation (for skiping to specific page number).<br>- Additional options are available after a long press on a screen. There&apos;s an &#x201E;invert&#x201C; (night) mode and a list of transferred files to open.<br><br><br>Please note that it&apos;s not really technically feasible to support reflow or search in this small and free app.<br><br><br>Support thread: http://forum.xda-developers.com/android-wear/development/app-pdf-reader-android-wear-standalone-t3031369",
    "histogram": {
        "1": 159,
        "2": 47,
        "3": 82,
        "4": 118,
        "5": 314
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/W7Npbnx_w6-ZvRR08EWd-wC4fwjg11uoieDzSp5swtZ-b2ytxQU7L8V445zvtX6OvrM=h310",
        "//lh3.googleusercontent.com/M6k3zHgD3D9wVU-M2DFc8Lgsiv2c0d20vA69-rGMUQ_t7QpaEcSUpyjhRAIR-mf8niHL=h310",
        "//lh3.googleusercontent.com/w4rEMdF4irHGJcoB7_zlNIFbuf-I5C103sGeBvs_a2b_ETQnYxwvIbczq2dLRdON8gxT=h310",
        "//lh3.googleusercontent.com/o0RF_3iCh3GDDRwT2m2UsCNHZfi-LUfb9mkEI1F6LW-ax_UTVps0LtuTMW-DObo2fA=h310",
        "//lh3.googleusercontent.com/qNEe4u5q9xieCpHnbfO5WJam6mVXDWpB2VJU57I40dvM_Wixhxrh6EJ4QAioqNpJyQ=h310",
        "//lh3.googleusercontent.com/LqcIVux4R-ehdLznKM9Xrj_zkSmqNMo6tZTgxe2Gzl5MuQkH2rik_mRzYOUCI2_8Cg=h310"
    ],
    "comments": [
        "It was very useful when I had LG g4, but since I have Samsung s8 with LG watch urbane, it is not longer working. When I try to upload from app, it is not uploading, and if I open the file with PDF reader app, I receive a notification alerting me that the file was sent with a random name, contains some numbers but doesn't appears in watch app.",
        "I tried it for some 5 mins because I couldn't open my PDF. It's stuck on the pinch or double tap PDF I sent the file successfully but can find a way to open it. An update will get you 5 stars from me.. I gave 4 because it's free can send files for offline viewing and it's not hardware intense. But I should give 3 because my 378MB file crashes your phone app Everytime. It's a physics book please update this app on both phone and watch. thanks",
        "No good for Moto 360 2nd gen. Can't press the \"next\" button to turn page. All I can see and access is the first page of the PDF.",
        "Amazing! I would suggest adding the capability of managing the files on watch from the phone app (upload/delete). Also if swiping left and right could be used for navigation it would make the app just perfect!",
        "Great app but seems to not allow the zoom Function after android wear 2.0 update on LG urbane. Can you do a quick patch fix for an awesome app. Cheers in advance :)",
        "Installed on my Phone (HTC One M9) and the icon appeared on my Watch (LG Urbane) but when trying to send PDF`s to it nothing happens , tried with range of files 3-20 MB but nothing happens nor any Notification is Received"
    ],
    "recentChanges": [
        "v0.4.0a",
        "- Fix mobile app layout",
        "v0.4.0",
        "- Add how-to screen for sending files to a watch",
        "- Other minor enhancements",
        "v0.3.1",
        "- Replace \"file received\" toast with notification",
        "v0.3.0",
        "- Add UI for \"Go To Page\"",
        "- Fix UI on Moto 360 2nd gen",
        "v0.2.3",
        "- Fix file transfer"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.smartmadsoft.wear.pdfreader&hl=en&gl=us",
    "appId": "com.smartmadsoft.wear.pdfreader"
}