{
    "title": "Gett",
    "summary": "Driven by Quality. Best Rated Drivers, Exceptional Service, Affordable Price",
    "icon": "//lh4.ggpht.com/twAmTIdcBnY0cPcO-Jb5Irs9Qe4z3Uz4mdEu7aRuh6Qhh9tjuO99HlsVHLSnlSvDl2k=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 181713,
    "developer": "Gett - Driven by Quality. The Best Taxi App",
    "developerId": "Gett+-+Driven+by+Quality.+The+Best+Taxi+App",
    "developerEmail": "support@gett.com",
    "developerWebsite": "http://www.gett.com",
    "developerAddress": "Cyprus (LTD)\nGT Get Taxi LTD\nClarion Business center\n25 Aphrodite Street\n2nd Floor\nNicosia Cyprus\nVAT Number: 10271894T",
    "updated": "February 26, 2018",
    "version": "9.12.61",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "description": "Gett is a global ride sharing app built on a simple idea - if you treat drivers better, they will treat riders better. Gett is available in more than 100 cities across Europe, including London, Moscow, and Tel Aviv. Download Gett today to start riding with the best rated drivers in Russia, the UK and Israel.In the US, Gett acquired Juno to provide the highest quality service. Download the Juno app today to start riding with the best rated drivers in NYC!We are here for you, with 24/7 support.In the US, call Juno at + (844) JUNO USA (844-586-6872) or email us at help@gojuno.com.",
    "descriptionHTML": "Gett is a global ride sharing app built on a simple idea - if you treat drivers better, they will treat riders better. <br><br>Gett is available in more than 100 cities across Europe, including London, Moscow, and Tel Aviv. <b>Download Gett today to start riding with the best rated drivers in Russia, the UK and Israel.</b><br><br>In the US, Gett acquired Juno to provide the highest quality service. <b>Download the Juno app today to start riding with the best rated drivers in NYC!</b><br><br>We are here for you, with 24/7 support.<br>In the US, call Juno at + (844) JUNO USA (844-586-6872) or email us at help@gojuno.com.",
    "histogram": {
        "1": 14108,
        "2": 3527,
        "3": 4698,
        "4": 14979,
        "5": 144401
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/qzpJvuJZtOKKtd4FU5Benc3f3h2yu2BznGgdH3nAiMbAuk8P-9aXJeNLOwQhv6OZvyP0=h310",
        "//lh3.googleusercontent.com/3nS4ESTVN247IwB6UXQMRBqrOo4GecW1_3CINArRVGHBMR3GdrcVi6cSrcFG6LrKLA=h310",
        "//lh3.googleusercontent.com/u01muNFsz6S-Q3GiG9wNbgvGBiSPADeKjTPVg5QhscBGB8cwyMm6xErYZRwTZBK_VgA=h310",
        "//lh3.googleusercontent.com/6UHlP8CA0BBcpbGLFHmroSy-06Tcw-yAPjbGxAxdaCBuQO0YuYy78VFAWE0Th9XAZg=h310",
        "//lh3.googleusercontent.com/--Yvrpm2e2FSrK-alVHLwFWVQY8L4gXYVqGWiSoA8IYfVgsZ3-vever7kTnDN3dqCGA=h310"
    ],
    "comments": [
        "Very unhappy with my first experience with gett it is the beast from the east snow weather i ordered my taxi last night with plenty of notice and had to leave 20 minutes early to get to a main road where i was accessable for the taxi driver. It tells you that you need at least 10 minute warning to cancel your taxi but i was stood on the ice with my sister who also was on her way to work till 2 minutes past its due arrival time only then to get a message that there was not a taxi in our area. This is unexceptable not only are we missing an hour of our work shifts pay but we also had to pay a lot more for a last minute taxi pick up.",
        "Either you have drivers or not. Don't let me know a driver would be available within 10 minutes to then tell me there is no driver available. Still a lot of work has to be made there",
        "Fantastic app. Taxi was here in less than 1 minute! And the driver David was a great guy. As I was taking my son to Great Ormond Street he offered to do it for free. I highly recommend this.",
        "In London bad weather all others failed.. Gett was available for rescue",
        "Промокод \"GTDEOVF\" дает скидку до 1500 рублей на 10 поездок. Налетайте!  Уже и в Казани появилось)",
        "Brilliant! Will always use Gett. Confirmed rides and fares. Trust me... You won't be sorry."
    ],
    "recentChanges": [
        "Gett acquired Juno to provide the highest quality service in NYC.",
        "To ride with the highest rated drivers in New York and enjoy the best ride experience - download the Juno app today!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.gettaxi.android&hl=en&gl=us",
    "appId": "com.gettaxi.android"
}