{
    "title": "KakaoTalk: Free Calls & Text",
    "summary": "KakaoTalk - the free, fast and fun messenger!",
    "icon": "//lh6.ggpht.com/71QkuTssZGm4B9_Vf0RINVZRJaOdNzU9OYzR6jZH2b6u-V7E1Lrw1K3nl56PVRHueVQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.3,
    "reviews": 2494839,
    "developer": "Kakao Corporation",
    "developerId": "Kakao+Corporation",
    "developerEmail": "help.notice@kakaocorp.com",
    "developerWebsite": "http://www.kakao.com/talk",
    "developerAddress": "690-140",
    "updated": "February 6, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "KakaoTalk is a fast & multifaceted messaging app. Send messages, photos, videos, voice notes and your location for free. Make chatting extra fun with an array of emoticons and sticker collections. More about KakaoTalk: ★ Chosen by more than 150 million users worldwide ★ Fast, fun, easy way to communicate with friends and family ★ Uses Internet connection (3G/EDGE or Wi-Fi) for calls and messaging ★ Supports: Android, iOS, Windows OS, Mac OS Key Features: - FAST: Speedy & reliable messaging no matter what your network- FREE CHATS: FREE messages & multimedia (photos, videos, voice notes) - FREE CALLS: High-quality voice calls (1:1 and group) - EMOTICONS: Express it all with our included emoticons PLUS select from endless sticker collections in our Item Store- GROUP CHAT: Chats with an unlimited number of friends - PLUS FRIEND: Exclusive coupons & deals from your favorite brands - VOICE FILTER: Fun free calls with Talking Tom & Ben’s voice filters - ANDROID WEAR: Reply with voice from wearable devices Other Amazing Features: - Share your location - See who read your messages (unread count) - Multitask during free calls (send messages in other chat rooms) - Schedule appointments, lunches, gatherings (w/ reminders) - Use KakaoTalk on any smartphone and PC (multi-platform) - Have even more fun with Kakao mobile games Contact us at http://www.kakao.com/talk/en/contact Like us at http://facebook.com/kakaotalk Follow us at http://twitter.com/kakaotalk",
    "descriptionHTML": "KakaoTalk is a fast &amp; multifaceted messaging app. Send messages, photos, videos, voice notes and your location for free. Make chatting extra fun with an array of emoticons and sticker collections. <br><br>More about KakaoTalk: <br>&#x2605; Chosen by more than 150 million users worldwide <br>&#x2605; Fast, fun, easy way to communicate with friends and family <br>&#x2605; Uses Internet connection (3G/EDGE or Wi-Fi) for calls and messaging <br>&#x2605; Supports: Android, iOS, Windows OS, Mac OS <br><br>Key Features: <br>- FAST: Speedy &amp; reliable messaging no matter what your network<br>- FREE CHATS: FREE messages &amp; multimedia (photos, videos, voice notes) <br>- FREE CALLS: High-quality voice calls (1:1 and group) <br>- EMOTICONS: Express it all with our included emoticons PLUS select from endless sticker collections in our Item Store<br>- GROUP CHAT: Chats with an unlimited number of friends <br>- PLUS FRIEND: Exclusive coupons &amp; deals from your favorite brands <br>- VOICE FILTER: Fun free calls with Talking Tom &amp; Ben&#x2019;s voice filters <br>- ANDROID WEAR: Reply with voice from wearable devices <br><br>Other Amazing Features: <br>- Share your location <br>- See who read your messages (unread count) <br>- Multitask during free calls (send messages in other chat rooms) <br>- Schedule appointments, lunches, gatherings (w/ reminders) <br>- Use KakaoTalk on any smartphone and PC (multi-platform) <br>- Have even more fun with Kakao mobile games <br><br>Contact us at http://www.kakao.com/talk/en/contact <br>Like us at http://facebook.com/kakaotalk <br>Follow us at http://twitter.com/kakaotalk",
    "histogram": {
        "1": 206946,
        "2": 82916,
        "3": 203427,
        "4": 383470,
        "5": 1618080
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/PgIDPQeV_lMACA0aFis8XGy7o-zfW-ZxMYaM3wHqtJ9WfL5Y_LPphi8lwEVy4F2F3U8=h310",
        "//lh3.googleusercontent.com/XqhKPC_06xf11MZoDltH-D1X24o-yT63wNfOieybU1m1GQVNp9DdEO3BTx8kI0zor-A=h310",
        "//lh3.googleusercontent.com/GllSLQzdiWgUbo-btRCRODqqjf5he7jAUA05jxDGjX24j7uQeoUU3QLfhgh52tgOWOam=h310",
        "//lh3.googleusercontent.com/AjelCGJJpfOFNWpnmeHRS8pLHIyFURvTpSAgFpTSWRD_uYfh9V37wfUNhlHRTdngSrF5=h310",
        "//lh3.googleusercontent.com/X6dQelW2rYF6B3edwNcNMHD9fO9ZKAImEMom6AtMuXtnY2rhy7zclFJF9tk76FeCECo=h310",
        "//lh3.googleusercontent.com/QUnvksUBbXKBrjW65476bbpInAX2sWh9Tw0W3LI9zcD17MIOLB4715lsavUywaMdScaJ=h310"
    ],
    "comments": [
        "I've had this app for years now and it's great! I love the group chat function and the unique emojis. It's great for communicating with others even from different countries. The video and call chats aren't the best at times, they do cut off randomly sometimes whereas video calls on other platforms don't as often. However I rarely use those functions, so this is a perfect texting app I'm very happy with.",
        "My account is not being suspended but, whenever I try to enter open groupchat, it always tell me your action have been suspended and should call the customer service for this. It always get me troubled because there is no FAQ about this in kakaotalk CS. Please fix this. Thankyou for your hardwork.",
        "Horrible update, can no longer send pictures or videos, it just shows as sending then shows a red \"X\" for no delivery. My stickers I bought are now useless. Fix this issue and I will change the rating  EDIT: issue has been fixed, I can send photos and videos again, and all my stickers work now. Thank you",
        "I love KakaoTalk. The only problem I'm having is that, when a person sends a message to me, it is often marked as 'read' when I haven't even opened it. I'm worried it might create misunderstanding that I seen-zoned people. I hope you will fix it.",
        "Hi, I'm installing this app cause it's a great app to communicate with people. So, hit me up if you wanna talk. I'm a moeslim and also a Carat, Army, and 5SOSFam. My ID is Orizaiza20 . Feel free to chat me :)",
        "I use this on a huawei p9 lite and I have notification problems and I have checked the settings. I do not receive any notifications on messages unless I open the app.:( please fix this But a great app, love the interface and everything else."
    ],
    "recentChanges": [
        "[v7.0.5]",
        "• Bug fixes and stability improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.kakao.talk&hl=en&gl=us",
    "appId": "com.kakao.talk"
}