{
    "title": "TextNow - free text + calls",
    "summary": "Unlimited FREE texting &amp; calling + free to low-cost international calling!",
    "icon": "//lh4.ggpht.com/nrNrI-mpolozU8SGzXEyZDRZvd2lsujq-2fbAhPT5ZK_H5P29rk4DNINhZCiJx9c8so0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.4,
    "reviews": 390696,
    "developer": "TextNow, Inc.",
    "developerId": "8273134989898180729",
    "developerEmail": "textnow.android.feedback@enflick.com",
    "developerWebsite": "http://www.textnow.com",
    "developerAddress": "Suite 310 - 375 Hagey Blvd\nWaterloo, ON\nN2L 6R5\nCanada",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Social",
    "genreId": "SOCIAL",
    "size": "Varies with device",
    "description": "FREE SMS TEXTING, PICTURE MESSAGING, CALLING, AND VOICEMAILDEDICATED PHONE NUMBERGive your friends your very own phone number they can call!UNLIMITED TEXT MESSAGINGYou can send as many text messages as you want to US & Canada - FREE!UNLIMITED CALLS TO USA AND CANADAMake unlimited free phone calls to any phone number in the US & Canada!LOW-COST & FREE INTERNATIONAL CALLINGAdd money or earn free money by completing offers to your account and make low-cost international callsHIGHLIGHTS:- Make and receive voice calls- Full picture messaging : send, receive and save pictures!- Voicemail Transcription- Caller ID - PassCode: keep your messages under lock n’ key- Google SmartLock: no need to remember your password- Emoticons :-)- Call Forwarding- Signatures: add your own signature to each text- Customizable text-tone, ringtone & vibration- Customizable backgrounds- Assign individual contacts their own ringtone & background- Quick Reply to easily (and quickly) respond to friends- Home screen widget to launch TextNow, compose a new message or quickly make a call- Unified inbox: send and receive your texts directly via TextNow - use TextNow as your one-stop SMS texting app!- Real SMS texting and calling: text and call ANY phone that accepts SMS texting, and ANY phone for calling.- TextNow.com - text from your computer too! All messages seamlessly synchronize with your mobile device.IS IT REALLY FREE?There is no catch. No yearly or monthly fees! It is completely free!HOW CAN ALL OF THIS BE FREE?The app comes with a few ads. If you don't like ads, you can purchase a subscription to remove them.PEOPLE WHO LOVE TEXTNOW\"If you want an unlimited texting without the high priced carrier based texting plans, then Textnow is the app for you.\" 4/5 rating --AppAdvice\"Anyone needing an unlimited number of texts, we’d recommend TextNow as our app of choice\" --AppAddict\"Just as fast sending/receiving as regular texts for me (including people who don't have the app).\" -tbm248, MacRumors",
    "descriptionHTML": "FREE SMS TEXTING, PICTURE MESSAGING, CALLING, AND VOICEMAIL<br><br>DEDICATED PHONE NUMBER<br>Give your friends your very own phone number they can call!<br><br>UNLIMITED TEXT MESSAGING<br>You can send as many text messages as you want to US &amp; Canada - FREE!<br><br>UNLIMITED CALLS TO USA AND CANADA<br>Make unlimited free phone calls to any phone number in the US &amp; Canada!<br><br>LOW-COST &amp; FREE INTERNATIONAL CALLING<br>Add money or earn free money by completing offers to your account and make low-cost international calls<br><br>HIGHLIGHTS:<br>- Make and receive voice calls<br>- Full picture messaging : send, receive and save pictures!<br>- Voicemail Transcription<br>- Caller ID <br>- PassCode: keep your messages under lock n&#x2019; key<br>- Google SmartLock: no need to remember your password<br>- Emoticons :-)<br>- Call Forwarding<br>- Signatures: add your own signature to each text<br>- Customizable text-tone, ringtone &amp; vibration<br>- Customizable backgrounds<br>- Assign individual contacts their own ringtone &amp; background<br>- Quick Reply to easily (and quickly) respond to friends<br>- Home screen widget to launch TextNow, compose a new message or quickly make a call<br>- Unified inbox: send and receive your texts directly via TextNow - use TextNow as your one-stop SMS texting app!<br>- Real SMS texting and calling: text and call ANY phone that accepts SMS texting, and ANY phone for calling.<br>- TextNow.com - text from your computer too! All messages seamlessly synchronize with your mobile device.<br><br>IS IT REALLY FREE?<br><br>There is no catch. No yearly or monthly fees! It is completely free!<br><br>HOW CAN ALL OF THIS BE FREE?<br><br>The app comes with a few ads. If you don&apos;t like ads, you can purchase a subscription to remove them.<br><br>PEOPLE WHO LOVE TEXTNOW<br><br>&quot;If you want an unlimited texting without the high priced carrier based texting plans, then Textnow is the app for you.&quot; 4/5 rating --AppAdvice<br><br>&quot;Anyone needing an unlimited number of texts, we&#x2019;d recommend TextNow as our app of choice&quot; --AppAddict<br><br>&quot;Just as fast sending/receiving as regular texts for me (including people who don&apos;t have the app).&quot; -tbm248, MacRumors",
    "histogram": {
        "1": 22914,
        "2": 10228,
        "3": 25175,
        "4": 49529,
        "5": 282850
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/wKfXJGTOahOLVi64vvXtHz0mZMt1SaXJx8POK-Ngk4Eh25pJ96EOqgnsSV97SLmvqGo=h310",
        "//lh3.googleusercontent.com/BI3QlgM2dpEnxQlYz1BEHGSRfK_dlAz1Pmk4-5q9Ol-Cv4gwtdGCeJR8ZpVSq3VbtA=h310",
        "//lh3.googleusercontent.com/Qvk3r_LgF7g-fzwZFuqMa8p6Zci2_yil7B7bP5vfjETJXi0zjH_3qkzOMz3Su0uMAqPY=h310",
        "//lh3.googleusercontent.com/UkYhxI9Ef3qm4dyyHWMQS1klIfRT9NVdU0vrHuanWKbpgnvlldYk-3QoFqcK0G_Og50=h310",
        "//lh3.googleusercontent.com/WkFrq2TTPLq8TYbi4lWQK7sLM7QYrNVuZzwSj4im-bh3__4XDFxxUEUctFfrJqi8QA=h310",
        "//lh3.googleusercontent.com/ZEqDCzZHc8EF5SNd5QXhzvyZgp99Z_Hy73p2Th4nBboiYT3lAjknzMoYWkdWhr0vAw=h310",
        "//lh3.googleusercontent.com/FanVjtFJGbgMjhJFr9DGwJeNyn8Ax980Nf0GYLVmZ2sFOeKdvxfjAn9VB4WTVIQDag=h310",
        "//lh3.googleusercontent.com/B8yrGEIDpjQWfPEtQ_xM0ek9vKLXmXJchQRrimc_VMCCOJjYPKjfGdjUTJmIvGhYoQ=h310",
        "//lh3.googleusercontent.com/EkaBgKLt7yzm5yNIdYuAP_LmByYX0KfTMCoFVZlemI_uJpTuwHLIg8VetqB3ilD3lUc=h310",
        "//lh3.googleusercontent.com/PMbYjJy_T3eYxsTzmyTA9VKQq8zMo7Azx7NjSMZPNch8asutuYzt-47SbCw8oy5VQBtb=h310",
        "//lh3.googleusercontent.com/-1_kFtwiQvxWoTH1ixmPp8vLhmQK0u_elH-W6uax9CBHUI2N4FS9bZbMVFmEl1icNA=h310"
    ],
    "comments": [
        "It's a decent app, could be better only issue I have is that it drops calls alot and causes some errors with the note 8  But easy to use just wish my calls wouldn't drop ever 3 minutes literally",
        "I have had a problem paying up my subscription I cannot find where to pay sent message to the trouble shoot dept no help at all .I'm still not sure if I'm going to keep this service. Alot of unanswered question",
        "It is pretty awesome! The service works just as any other mobile service does. The only difference is text now is used off your Wi-Fi only unless you purchase one of the plans. I highly recommend bringing your own device if it is capitible to use through text now service. However, if you are looking for something to temporarily get you by and need a phone plan and phone that is cheap. Text now is your go too.",
        "This is THE BEST app. Now I can text and call my friends on their number without sharing my personal one. It's so simple. Get a number, Share your number or just start chatting with friends without any extra money or any privacy problems. Thanks to the developers",
        "I downloaded this app because my boyfriend lost his cell phone when his house burnt down a few months ago. I decidee to let him use my cell because I had a tablet & this was a great option for us. We both have had problems with this app... shutting down mid-way through phone calls/texts AND locking up our devices because the app runs so slow. Another feature that I feel like this app should add.... is a contacts list. Just like on a regular cell phone. I have people on my contacts list that I would love to get rid of and it's IMPOSSIBLE to do so on this app. How could a calling/texting app not think of making that easier?!",
        "I wish people would learn how to accept the fact that not everything is perfect the way you imagine it to be whether you hate it or not whether it's broken or not tech will always mess up no matter how many times you fix it so learn how to deal with it before getting mad people use ads for money cause they need it, don't expect them to answer you if your not worthy to understand tech."
    ],
    "recentChanges": [
        "New features. Improved reliability. Squashed bugs. We never stop working to make your TextNow experience better.",
        "*PassCode* - keep your messages under lock n’ key"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.enflick.android.TextNow&hl=en&gl=us",
    "appId": "com.enflick.android.TextNow"
}