{
    "title": "Shazam",
    "summary": "GIVE AN ANSWER TO: “WHAT’S THAT SONG?&quot;",
    "icon": "//lh3.googleusercontent.com/mwTU9-4NX-_QlATb6lILSinKI47wAtOM38GjPYRPQSsQOG2hVRY4h9OfEhDxpf8ADQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.4,
    "reviews": 3214101,
    "developer": "Shazam Entertainment Limited",
    "developerId": "Shazam+Entertainment+Limited",
    "developerEmail": "android.support@shazamteam.com",
    "developerWebsite": "http://www.shazam.com",
    "developerAddress": "Shazam Entertainment Limited\n26-28 Hammersmith Grove\nLondon W6 7HA",
    "updated": "February 13, 2018",
    "version": "Varies with device",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "size": "Varies with device",
    "description": "Shazam is one of the world’s most popular apps, used by hundreds of millions of people each month to instantly identify music that’s playing and see what others are discovering. All for free.And that’s just the beginning: One-tap access to video clips, song lyrics, related tracks and streaming services, where you can listen to your Shazams in full or buy them. Top artists like Adele, Kendrick Lamar, Demi Lovato, are using Shazam to find new music, and you can follow them to share in the thrill of discovery. MUSIC DISCOVERY• Identify music with one tap• Sing along to songs with music lyrics, or watch their videos• Preview songs and add them to Spotify playlists**• Shazam Offline: Identify music even when you’re not connected!*• Check out recommended tracks to find new music• Stay in the loop with Shazam’s real-time charts• Simply log in to sync all your Shazams across all devices• Launch Pandora radio based on artists you Shazam**• Buy your Shazamed songs in Google Play Music with just one tapCONNECT & SHARE • See what your friends are Shazaming when you connect your Facebook account• Follow your favorite artists to see what they’re Shazaming• Share your discoveries through Facebook, Twitter, WhatsApp, Pinterest, Google+ and more…MORE THAN MEETS THE EAR• Shazam visual recognition: Tap the camera icon to Shazam posters, magazines, books and so much more! Use it anywhere where you see the Shazam camera logo• Visual recognition also works as a QR code reader• Launch Shazam on your Android Wear smartwatch to see the artist and song appearOTHER INFO• Previewing and buying music requires the Google Play music store in your country• MIPS devices are not supported• Why does Shazam need these app permissions? https://support.shazam.com/hc/en-us/articles/205139787-App-Permissions• Shazam may share collected location data for interest based advertising, allowing advertisersto infer interests and serve ads to users based on their activity and location over time• For more information on Shazam’s privacy practices, please read the Privacy Policy, available at http://www.shazam.com/terms#privacy_policy• Don’t want the advertising? Upgrade to Shazam Encore: https://play.google.com/store/apps/details?id=com.shazam.encore.android *Song names will appear in your My Shazam tab once connection is restored**Some features are dependent on location, device and app versionAny questions or feedback? Check out: https://support.shazam.com/hc/en-us/categories/200239877-Android",
    "descriptionHTML": "Shazam is one of the world&#x2019;s most popular apps, used by hundreds of millions of people each month to instantly identify music that&#x2019;s playing and see what others are discovering. All for free.<br><br>And that&#x2019;s just the beginning: One-tap access to video clips, song lyrics, related tracks and streaming services, where you can listen to your Shazams in full or buy them. <br><br>Top artists like Adele, Kendrick Lamar, Demi Lovato, are using Shazam to find new music, and you can follow them to share in the thrill of discovery. <br><br>MUSIC DISCOVERY<br><br>&#x2022; Identify music with one tap<br>&#x2022; Sing along to songs with music lyrics, or watch their videos<br>&#x2022; Preview songs and add them to Spotify playlists**<br>&#x2022; Shazam Offline: Identify music even when you&#x2019;re not connected!*<br>&#x2022; Check out recommended tracks to find new music<br>&#x2022; Stay in the loop with Shazam&#x2019;s real-time charts<br>&#x2022; Simply log in to sync all your Shazams across all devices<br>&#x2022; Launch Pandora radio based on artists you Shazam**<br>&#x2022; Buy your Shazamed songs in Google Play Music with just one tap<br><br>CONNECT &amp; SHARE <br><br>&#x2022; See what your friends are Shazaming when you connect your Facebook account<br>&#x2022; Follow your favorite artists to see what they&#x2019;re Shazaming<br>&#x2022; Share your discoveries through Facebook, Twitter, WhatsApp, Pinterest, Google+ and more&#x2026;<br><br>MORE THAN MEETS THE EAR<br><br>&#x2022; Shazam visual recognition: Tap the camera icon to Shazam posters, magazines, books and so much more! Use it anywhere where you see the Shazam camera logo<br>&#x2022; Visual recognition also works as a QR code reader<br>&#x2022; Launch Shazam on your Android Wear smartwatch to see the artist and song appear<br><br>OTHER INFO<br><br>&#x2022; Previewing and buying music requires the Google Play music store in your country<br>&#x2022; MIPS devices are not supported<br>&#x2022; Why does Shazam need these app permissions? https://support.shazam.com/hc/en-us/articles/205139787-App-Permissions<br>&#x2022; Shazam may share collected location data for interest based advertising, allowing advertisers<br>to infer interests and serve ads to users based on their activity and location over time<br>&#x2022; For more information on Shazam&#x2019;s privacy practices, please read the Privacy Policy, available at http://www.shazam.com/terms#privacy_policy<br>&#x2022; Don&#x2019;t want the advertising? Upgrade to Shazam Encore: https://play.google.com/store/apps/details?id=com.shazam.encore.android <br><br>*Song names will appear in your My Shazam tab once connection is restored<br>**Some features are dependent on location, device and app version<br><br>Any questions or feedback? Check out: https://support.shazam.com/hc/en-us/categories/200239877-Android",
    "histogram": {
        "1": 196818,
        "2": 86292,
        "3": 197144,
        "4": 516575,
        "5": 2217272
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/KzffbWKrijJ5WKKR6I3iEoELkt7LW6yjYkTUJHCm2QQskWdzDuccxP3NWntacYAnB_k=h310",
        "//lh3.googleusercontent.com/S7LldNz31HzdpmRkJWbw2WQoqb9emQZjhMocMo9ppthW6OwbvA3K7U9TQRxblzI3VXnF=h310",
        "//lh3.googleusercontent.com/3d-8i6l5Gmm3fP4JUitu_hkQ3oZU3Z7ai9NYFgpYxmnGyPkx5vipWvEEdhxuUykJEA=h310",
        "//lh3.googleusercontent.com/SvKMc1VCVDnY16H6OqND3Bch8LAfyVHSp4xvPtiqQmpf9Y9vUtboTi_JRbIq6YrauKru=h310",
        "//lh3.googleusercontent.com/q-3os3TWHDouWgWkOY4JmPtGX-LOvf6EfsZsZE1a2A7T-wmVOVw2gZdq3Eh3Q0YlLHnK=h310",
        "//lh3.googleusercontent.com/r2v_QXTnk6UkhuMjEVXltx0hwgLBNm0lQE4ULJ7Nl20G6oIRIJGmlMhNVjQCAt2JfRU=h310",
        "//lh3.googleusercontent.com/g59XJE_dPla8S-IHxA27nUF8zWi4ZXq_X3ZUF234b9RUCudSiwfYTr-yqGiYjYK43zpQ=h310",
        "//lh3.googleusercontent.com/Zui08lxBncgIp_OQpSLmKowZZ0eOjJpwtcmd-IacRX_Mos43pk89mG4AJJ4IGPdx_A=h310",
        "//lh3.googleusercontent.com/gx3aenRr25Az8acJXFCp5RxcoUvTcrNDNIOUlse9uwnXbaV7bKNgoEn0g58rsiUH2G7D=h310",
        "//lh3.googleusercontent.com/-fOjDQNL5Mhl1_6ZF2fwj4DOORJiDul_OLav0hTaSLymDb3PcXMkiUq7TTMTiKtchmWl=h310"
    ],
    "comments": [
        "Loving the updats, this app is great and so easy to use  Having it linked to spotify so i can add songs directly to my playlists without even going into the spotify app is awesome!   Also Finds 99% of songs, its great.  I dont usually leave reviews but thought this app deserves one.  Good job!",
        "Love the functionality. I've been disappointed today after using the app and the images of the artist aren't correct. Not sure why but it's very disappointing and I will be looking forward to seeing the actual artists image portrayed with the song. SN: totally agree with RioVentura. I miss having the blue button there. The convienence of having the button there to tap was nice.",
        "I used to use shazam years ago and it was perfect. It could find a song over noise and even when the song was low volume. It didn't take too long to get a recording and have the song you want to know. But now it doesn't seem to work. It only recognises the most popular songs and even then you have to try a few times. But what's the point of it if everyone and their grandma already know the only songs this app seems to recognise?  I wanted this app to be able to recognise the songs I don't know on the radio and on TV shows but most times it won't work or by the time it would, the song would be over and gone. This is incredibly sad as I know for a fact that shazam used to be so much better than this. Please fix this",
        "I haven't yet identified a single track since downloading it. Sony recommends it highly but it is not replacement of Sony's track ID. U got to improve it, it is must to find it in radio so that I trace music directly from my phone's radio 📻 thru 🎧. It shouldn't be limited a speaker 🔊 of radio and TV but it must thru headphones too just like the track id of Sony did. Thanks and I hope that u will improve just like I requested 😉",
        "When I first tried Shazam years ago, it was fantastic. It could tell me a song playing over the noise of a restaurant & cafe. These days, I'd say 1/10 songs are recognized. I can find it faster using Google and a line of lyrics.",
        "The best thing about shazaam was that the lyrics would come up. I don't know what you did, but the layout is different (Which is fine), but lyrics are non existent. What exactly is your purpose, if not to give ALL the info one is expecting when they \"shazaam\"? Like \"Shazaam!\" It's there! More like \"sha-meh\"😐 there's other lyric sights, I guess."
    ],
    "recentChanges": [
        "Your Shazams have a new look!",
        "Once you’ve named that tune, you’ll see a brand new song page with...",
        "- No more clutter! Just a big, beautiful photo of the artist you’ve Shazamed. Looking for the artwork? Tap the artist’s pic for more info about the song.",
        "- A new menu, meaning you can get to the lyrics, videos & artist updates in one tap.",
        "- Quick links to play, buy or open-in your favourite streaming service.",
        "- Connected to Spotify? You’ll now see an ‘Open’ or ‘Add to’ playlist button."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.shazam.android&hl=en&gl=us",
    "appId": "com.shazam.android"
}