{
    "title": "Atlas Workout Tracker",
    "summary": "The only tracker that learns any exercise to track every aspect of your training",
    "icon": "//lh3.googleusercontent.com/7q2nz_LwAbZBoTlcg_aojdJj4f7nnCrWQ2lNsU7ek3KePlD0HZG_XEiZIP_7301cZZw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.4,
    "reviews": 160,
    "developer": "Atlas Wearables, Inc.",
    "developerId": "5524386978117995381",
    "developerEmail": "peter@atlaswearables.com",
    "developerWebsite": "http://www.atlaswearables.com",
    "developerAddress": "7101 Easy Wind Dr UNIT 3103, Austin, TX 78752\nUSA",
    "updated": "January 16, 2017",
    "version": "2.3.16",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Atlas Wristband is the only wearable that automatically recognizes the exercise you’re doing then logs your rep count and analyzes your form. Use this app to view your workout journal, dive deeper into your data, and get feedback on calories burned, heart-rate zones, form score and more. Atlas Wristband uses 360 degree sensors and the most advanced exercise database and machine-learning. WORKOUT JOURNAL. Whether you’re interested in cross-fitness, Body-building, weight loss, gym activities or anything in between, Atlas Wristband is perfect for those looking to automatically record workouts and track progress toward fitness goals.STRENGTH IN NUMBERS. Sync your workout journal effortlessly from the Atlas Wristband with this Atlas Wearables app. In this app you can dive deeper into advanced fitness analytics when you need it most. View muscle focus, heart rate data, calories burned, form evaluation and tunable metrics such as power, stability and velocity. There’s no magic bullet for health and fitness, and you deserve feedback and guidance on what matters to you. GUIDED WORKOUTS. Sync guided workout programs from the app to your Atlas Wristband to navigate your workouts like a pro. Atlas Coach gives you turn-by-turn fitness helping you hit every muscle group and optimize your workout efficiency.SYNC WIRELESSLY: Atlas Wristband syncs your hard-earned stats with your iPhone 5 and later to give you complete access to your progress without plugging in.",
    "descriptionHTML": "Atlas Wristband is the only wearable that automatically recognizes the exercise you&#x2019;re doing then logs your rep count and analyzes your form. <br><br>Use this app to view your workout journal, dive deeper into your data, and get feedback on calories burned, heart-rate zones, form score and more. Atlas Wristband uses 360 degree sensors and the most advanced exercise database and machine-learning. <br><br>WORKOUT JOURNAL. Whether you&#x2019;re interested in cross-fitness, Body-building, weight loss, gym activities or anything in between, Atlas Wristband is perfect for those looking to automatically record workouts and track progress toward fitness goals.<br><br>STRENGTH IN NUMBERS. Sync your workout journal effortlessly from the Atlas Wristband with this Atlas Wearables app. In this app you can dive deeper into advanced fitness analytics when you need it most. View muscle focus, heart rate data, calories burned, form evaluation and tunable metrics such as power, stability and velocity. There&#x2019;s no magic bullet for health and fitness, and you deserve feedback and guidance on what matters to you. <br><br>GUIDED WORKOUTS. Sync guided workout programs from the app to your Atlas Wristband to navigate your workouts like a pro. Atlas Coach gives you turn-by-turn fitness helping you hit every muscle group and optimize your workout efficiency.<br><br>SYNC WIRELESSLY: Atlas Wristband syncs your hard-earned stats with your iPhone 5 and later to give you complete access to your progress without plugging in.",
    "histogram": {
        "1": 29,
        "2": 23,
        "3": 22,
        "4": 33,
        "5": 53
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/0qrzo-fkOOH9SJNGKYnyOUyoozOM94r4PEmYzGQ8Kd0Bqks9o-JHISMbLqKV7JkWxinh=h310",
        "//lh3.googleusercontent.com/M1btSXi1pmKTjvrYls8tDU-ZcUuL9Lf6rgPmdAoXOcjF-OaUgobUbAoELYZ0WBkdUTM=h310",
        "//lh3.googleusercontent.com/38ctGjtfkw8vGCPe-vvtUnPUv8n7PQLt3N5LkoeFiEnqdaU0bJ77K_wxCb6prUp-as4=h310",
        "//lh3.googleusercontent.com/J_XTO6BJcfXx17LSdvzA-gyAw6eKTiGoxJF-GYBOuXAaVrK3FGIreyeC9hFzwwA4fw=h310",
        "//lh3.googleusercontent.com/-YRufzwClMw5bkxpjvnPXBOgpGUQzD7uNqMztoYXlT5wsBoNlgGo7c7rcwOGeRyttQ=h310"
    ],
    "video": "https://www.youtube.com/embed/nfS-5IVy4hE",
    "comments": [
        "It's ok but won't recognize extremely simple movements like a trap bar deadlift. Needs some work but has promise.   Update - this thing once had potential but now it genuinely sucks. They've essentially abandoned it for their next tracker. The app hasn't been updated in months and neither has the firmware. Not even worth the $50 you can get it for on Amazon now.",
        "Completely stopped all syncing now wont work at all except the clock. Its less then 5 months old why did it stop working so soon after purchase? Please fix this otherwise it was my fav watch worked so well",
        "the app work good here. the band is the problem for me. I do crossfit and the app at first look like it recognize some exercise. the problem is that the exercise had to be done in slow motion and execute it perfectly to the wristband recognize it. so at the end maybe I returned it. when I get home I need to spend a lot of time to edit everything.",
        "Won't sync to Moto Droid Z.  Instructions for Syncing are beyond cryptic. Sounds easy, doesn't work. At all.  Glad I only wasted $30.00 on this thing.",
        "It's perfection. The perfect work out tracker. Freestyle is the way to go. It automatically detects what exercise you're doing and counts the reps. If you're doing an exercise that it does not recognize you can set a custom exercise and teach the device to recognize the movements but it does take about three times of teaching it for it to pick it up perfectly sometimes four times that's not a problem. This device works perfectly I am on my second wristband 2 the reason why I'm on my second one because the first one I bought I carried it around in my backpack everywhere I went and it caused a device to quit working properly. I think it's because since this is a motion detector that if you wear it or carry it around when you are not using it it jams up the sensing mechanisms and detection software so I would like to let everyone know and I think you should let everyone know that this wristband 2 should only be worn during a workout when you're not using it put it in a place where it's not going to be moving around I'll just keep it on your wrist all the time or keep it in a backpack. I only wear it for your workout teach it what it does not know when you are not working out put it in a place where it will not move and the device will stay working perfectly and if you are teaching it a custom exercise and teach it to where it's high-quality at least 3 or 4 times and delete the medium and poor quality teaching. I love this device and I strongly recommended and endorse it",
        "After 1 month, it refuses to sync. Bluetooth detects the device, but the app doesn t sync. It got completly discharged, maybe that kills the bluetooth. Many improvements to be made in the ap and in the way the watch menu layout is (very very unintuitive) . Great potential, but for a product to be unusable after one month..."
    ],
    "recentChanges": [
        "Bug Fixes:",
        "- Scroll screen when entering notes",
        "- Journal updated to work in 2017"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.atlaswearables.ionic&hl=en&gl=us",
    "appId": "com.atlaswearables.ionic"
}