{
    "title": "MyCiTi Cape Town",
    "summary": "Cape Town MyCiTi bus routes, timetables, current card balance and much more!",
    "icon": "//lh6.ggpht.com/H8ujHHzCm0LQtjjRre0z5fcHsxOcQ_otjyvbg1Ts-YK7swLMk3TQbBA9aMsuYOxK2XOq=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 537,
    "developer": "Apkola",
    "developerId": "Apkola",
    "developerEmail": "myciticapetown@gmail.com",
    "developerWebsite": "https://plus.google.com/104172920439666320836",
    "updated": "January 16, 2018",
    "version": "1.4.0",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "description": "Unofficial appGet useful information on the Cape Town MyCiTi bus services such as current card balance and bus times. A crucial app for tourists, travellers and daily commuters.Where's my bus?• get up-to-the-minute bus times for any stop (note: currently using schedule, not real-time info)• find the closest bus stops based on your location• Android Wear companion app provides this feature directly on your wearableTimetables• see a detailed timetable of every route and stopFare calculator• calculate the cost of any journey• plan your journey with point-to-point directionsMyCiTi map• a map of all the routes, stations and stops• get directions to any stop or stationScan your card*• get your current balance and other info directly from your myConnect card• see a detailed breakdown of all the trips you've takenMyCiTi service updates• get notifications of real-time updates affecting MyCiTiWidgets• always have an eye on your card balance by adding a widget to your home-screen* requires your device has NFCThis app is unofficial and not endorsed by MyCiTi or the City of Cape Town.",
    "descriptionHTML": "<i>Unofficial app</i><br>Get useful information on the Cape Town MyCiTi bus services such as current card balance and bus times. A crucial app for tourists, travellers and daily commuters.<br><br><b>Where&apos;s my bus?</b><br>&#x2022; get up-to-the-minute bus times for any stop (note: currently using schedule, not real-time info)<br>&#x2022; find the closest bus stops based on your location<br>&#x2022; <i><b>Android Wear</b> companion app provides this feature directly on your wearable</i><br><br><b>Timetables</b><br>&#x2022; see a detailed timetable of every route and stop<br><br><b>Fare calculator</b><br>&#x2022; calculate the cost of any journey<br>&#x2022; plan your journey with point-to-point directions<br><br><b>MyCiTi map</b><br>&#x2022; a map of all the routes, stations and stops<br>&#x2022; get directions to any stop or station<br><br><b>Scan your card</b>*<br>&#x2022; get your current balance and other info directly from your myConnect card<br>&#x2022; see a detailed breakdown of all the trips you&apos;ve taken<br><br><b>MyCiTi service updates</b><br>&#x2022; get notifications of real-time updates affecting MyCiTi<br><br><b>Widgets</b><br>&#x2022; always have an eye on your card balance by adding a widget to your home-screen<br><br>* requires your device has NFC<br>This app is unofficial and not endorsed by MyCiTi or the City of Cape Town.",
    "histogram": {
        "1": 29,
        "2": 25,
        "3": 59,
        "4": 121,
        "5": 303
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/DEeskcvvcVeFB1JqV9DWRBdOsfl0H3iFij1XdbnUCLmV56h14VssGZI4jbCXIR6-nIg7=h310",
        "//lh6.ggpht.com/_GhzzTdwDtP-qnkHdxxQGCyiF7mbqfZhwhxo0MKf0Jh701e84wcyA5EGMnQUPRca5g=h310",
        "//lh6.ggpht.com/5y-D3RUGGiUPYMMJ1NvnFgj7n3CgPHGxK3XiVBC1dtQUcS3_llt5wqw08IepQ_GlUDI=h310",
        "//lh3.ggpht.com/f3P7p-HosBVxApc2FhmDTlrdiREzSTVnMD4xRfDKH5UyZRyvKFsIOvxvYOqtD7TBSFU=h310",
        "//lh6.ggpht.com/II-5YsAMZIVLSk5wt0otkd86dwOD1xrhWt-WETsTosCEBFB80CQZh32VLcEvb2aQ9675=h310",
        "//lh3.ggpht.com/ehGEUIpyNKaMwluwEwGjWb1w1OW5LMaoP12uF6LpPiknVJJe4sZdEYz9bWqCdt7N-Q=h310",
        "//lh6.ggpht.com/4NuCNCAFtsMYxHupE5VqoIuYk-lLgZaBfcRVtRhEWOc_GZQ4Wt5hEJha_lr4nPnKfOs=h310",
        "//lh5.ggpht.com/1rT02jV2HxxlRLYkgy-UTXGoMqQ0ika_SDG5HUWalLm0XSZW-_Zh_-UuT2CGtfCDN7Y=h310",
        "//lh3.ggpht.com/lSDyWOzw01Jtx96yXVRgmpieo_oodrYvkEh5NCQn86IWe2y_miBQvqlOT5PaS6bGYN8=h310",
        "//lh5.ggpht.com/1rKUOf5uQB1jqlo_Gqseu3i0s8P503BGWkakCETKSHTS3nLnvaTZuqNoAL0Ev1d0NOxe=h310",
        "//lh3.ggpht.com/nHA1cKRVYLJJOjXuCZnx0ng-7wELO5d1D1ecFRWYewZnJjUhXi2TJIq8tyhGKiJLHjNp=h310",
        "//lh3.ggpht.com/JFe21-r4hMMNFcamvT9FnXHfukJmAEqsQUISNnCXMsTrEYz6aZSjrL_SFqyyUoR1NYo=h310",
        "//lh5.ggpht.com/A54y6Wi7j2f8z_7ODa34P_9XYj2PxswmyRWaptV3uRzrjUtfSl9fVYG8mUAg-fKCFuE=h310",
        "//lh6.ggpht.com/xcrtAcmXd9ypxsfrBgSf5hphRl55Sw856X1-mFxwVDQ_XGSD6bad-C1aB38IOogdqg=h310"
    ],
    "video": "https://www.youtube.com/embed/pS1MT8UugX8",
    "comments": [
        "Note that the 230 route starts AND ends at Melkbosstrand. Their is no option to see the return times. Please updated the service to include the missing return stops. Many thanks",
        "A very crucial app for any would be MyCiti client\\user. Timetable and fares always up to date. Routes and maps also a great as well as checking your card balance on the go.  Its my go to app for anything MyCiti related.",
        "The app is good for seeing the routes and location of bus stops but the timetables are far off from the real bus times on the routes.",
        "Time tables aren't being kept up to date. This app is now outdated, please don't rely on the times presented. New routes are also not included. You're better off downloading the myciti time tables from the myciti website.  Edit: Back up to date. Tx",
        "Since the last update there are some services missing. Where have the T01 & X01 timetables gone? I was looking for times from Wood Station and they are completely gone....",
        "Very useful app! A must have for MyCiti users."
    ],
    "recentChanges": [
        "In 1.4.0 (2018/01/15)",
        "• Updated timetables (T01, 232, 232a, 241, 243)",
        "• Added new routes: X02, T01d",
        "• Added some missing stops",
        "• Updated all other timetables",
        "• Card data and preferences now automatically backed up across device installs",
        "• Bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.apkola.myciti&hl=en&gl=us",
    "appId": "com.apkola.myciti"
}