{
    "title": "Priceline Hotel Deals, Rental Cars & Flights",
    "summary": "Travel smarter - book exclusive hotel deals, rental cars and cheap flights",
    "icon": "//lh3.googleusercontent.com/09r4MPM2xcrD1yFmcHNWz0pIhypJKKoeMyoYS8mwN6Q5ZL_ogqRQ_oNXakwFRxRJYiyz=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.3,
    "reviews": 43667,
    "developer": "priceline.com",
    "developerId": "9038987167384069337",
    "developerEmail": "mobile@priceline.com",
    "developerWebsite": "http://www.priceline.com",
    "updated": "February 22, 2018",
    "version": "4.30.165",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "Download the priceline.com app and join millions of smart travelers who book great travel deals with us every day.Rated by Travel + Leisure as a Best App for Travelers!Our app makes people happy: • Book exclusive hotel deals found only on the app.• Travel deals everywhere you look - low-priced hotels, discounted rental cars and cheap flights. • You’ll save up to 60% off with Express Deals® and even more with Name Your Own Price®. Seriously.• Personalized, relevant hotel booking recommendations. We have the travel deals that matter to you.• As you search more, we uncover even more deals just for you.• Super-quick travel booking, especially when you’re signed in! We do fast well.Our app saves you time:• Did we mention the super-quick travel booking?• Easily access and make changes to your trip wherever you are with our My Trips feature. • Get all of your reservation and travel info right on your phone, even if you booked on your computer. Like magic. • Search by city, address or point of interest to book the most conveniently located hotels and rental cars. Our app takes you there:• Anywhere you want to go, and it goes there with you. But it never complains.• Across the globe with super deals on thousands of domestic and international flights across the globe. Pace yourself.• On the road with rental car deals on 22 brands in 28,000+ locations. That's how we roll.• To wonderful rooms in 800,000+ hotels worldwide. That’s a lot of little shampoo bottles.Our app has your back. And it’s watching your wallet, too.Problems? Just give us a call 24/7. 1-877-477-5807 Or browse our help page to find your answers: https://www.priceline.com/help/#/We'd love to connect with you!Facebook https://www.facebook.com/priceline/Instagram https://www.instagram.com/priceline/Twitter https://twitter.com/priceline",
    "descriptionHTML": "Download the priceline.com app and join millions of smart travelers who book great travel deals with us every day.<br><br>Rated by Travel + Leisure as a Best App for Travelers!<br><br>Our app makes people happy: <br>&#x2022; Book exclusive hotel deals found only on the app.<br>&#x2022; Travel deals everywhere you look - low-priced hotels, discounted rental cars and cheap flights. <br>&#x2022; You&#x2019;ll save up to 60% off with Express Deals&#xAE; and even more with Name Your Own Price&#xAE;. Seriously.<br>&#x2022; Personalized, relevant hotel booking recommendations. We have the travel deals that matter to you.<br>&#x2022; As you search more, we uncover even more deals just for you.<br>&#x2022; Super-quick travel booking, especially when you&#x2019;re signed in! We do fast well.<br><br>Our app saves you time:<br>&#x2022; Did we mention the super-quick travel booking?<br>&#x2022; Easily access and make changes to your trip wherever you are with our My Trips feature. <br>&#x2022; Get all of your reservation and travel info right on your phone, even if you booked on your computer. Like magic. <br>&#x2022; Search by city, address or point of interest to book the most conveniently located hotels and rental cars. <br><br>Our app takes you there:<br>&#x2022; Anywhere you want to go, and it goes there with you. But it never complains.<br>&#x2022; Across the globe with super deals on thousands of domestic and international flights across the globe. Pace yourself.<br>&#x2022; On the road with rental car deals on 22 brands in 28,000+ locations. That&apos;s how we roll.<br>&#x2022; To wonderful rooms in 800,000+ hotels worldwide. That&#x2019;s a lot of little shampoo bottles.<br><br>Our app has your back. And it&#x2019;s watching your wallet, too.<br><br>Problems? Just give us a call 24/7. 1-877-477-5807 <br>Or browse our help page to find your answers: https://www.priceline.com/help/#/<br>We&apos;d love to connect with you!<br>Facebook https://www.facebook.com/priceline/<br>Instagram https://www.instagram.com/priceline/<br>Twitter https://twitter.com/priceline",
    "histogram": {
        "1": 2697,
        "2": 1155,
        "3": 2555,
        "4": 9033,
        "5": 28227
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/rpZ_Kjf1ecksaR57KiN78yhBI1WwtvywMizOalN4NFPwLZvddY_7qwME3gPp8lg1l1A=h310",
        "//lh3.googleusercontent.com/zkXesn_fOcOLAqFNRerf6EmqFwzmgIHxMoQhPibqtqfj5T9-c5_ulAcG9cPTpxVZHvo=h310",
        "//lh3.googleusercontent.com/9kO-rSxwd2paEqbAV3KlZqib14p5jgMXxVpBafs5ljjbcnPXMnfUdSz6srCDg-8ugg=h310",
        "//lh3.googleusercontent.com/LFMuIiAPLknK-qxUVBpN5kZRi10Jnf3V6nZuo5OiDZbxgxUPQVZH3NqIG9bGXebvjVg=h310",
        "//lh3.googleusercontent.com/3wyQUAfchBZ0amFb9P69wa1W0k-13OXUp9dPsLm1CEWy37sPBlBA76QezoEnGekuLA=h310"
    ],
    "video": "https://www.youtube.com/embed/juHHOnWvbRk",
    "comments": [
        "You just lost a LONG time (since the beginning) faithful user and advocate by forcing my LANDSCAPE tablet into PORTRAIT mode.  I use my device mounted in place and will NOT crane my neck to try read portrait forced apps.  Nor will I allow them to waste space on my device.  Forget about recommending this app to all of my fellow spontaneous travelers. Any app that forces my landscape tablet into portrait mode can go shove itself up its own ass.",
        "SOme of the hotels are over rated. Especially in the 2 1/2 star range. Also some of the areas in the blind bid selection are very large. (I wish there was a east and west or a 2 miles from a pin drop choice.}",
        "The mobile app is a rip off for price. DON'T BOOK USING MOBILE APP. The prices shown on mobile app are higher as compared to priceline website for same search criteria and same dates. USE website if you want better price",
        "Easy to use but prices for rentals aren't guaranteed. When you make a rental reservation the price could completely change at counter. Not good at all. Prices are fake.",
        "Very good app. If your not satisfied with your first attempt. Wait 15 min and try again. Things change.",
        "Great app, very easy to use, you can also set up your own price by picking how many stars you choose from and they will pick the motel if they except what ever amount you choose."
    ],
    "recentChanges": [
        "More rental car deals are now available! Our app has the lowest rates you can find.",
        "Never miss a trip update! We can now provide you with trip alerts for flights you booked on Priceline. Make sure you have push notifications enabled to enjoy this feature.",
        "We’ve given our home screen a facelift. Same great app, new look!",
        "As always, we tackled some bugs to improve your experience."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.priceline.android.negotiator&hl=en&gl=us",
    "appId": "com.priceline.android.negotiator"
}