{
    "title": "Wanderlust - Your travel buddy",
    "summary": "All info you ever wanted to know country wise, now at your fingertip!",
    "icon": "//lh3.googleusercontent.com/4umGTxURMiYqkq7Qb6VRRn-PXt-evDX7O0Eo73swUPajTLhBVpDr5VhvIF-6v0lYK9Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.9,
    "reviews": 136,
    "developer": "Technopear",
    "developerId": "8521908621700068530",
    "developerEmail": "info@technopear.com",
    "developerWebsite": "http://www.technopear.com/",
    "updated": "December 22, 2017",
    "version": "3.1",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "TechnoPear brings you one of the best travel app that assists while you are on the go. Whether travelling locally within the country or across international borders, travel buddy is at your beck & call like a personal assistant.  It provides real time weather of a selected country/city/ time zone. With the spot finder, find a locale of your need with address & contact details. Get emergency numbers of any country, in case you need, with EM Calls. Currency converter gives you live conversion rates. It facilitates comparison between more than two countries.  The inbuilt compass gives directions for easy navigation. Now no need to refer Google for finding holidays while you are abroad. Our all-new cool travel app comes with awesome features:1. Current Weather & weather forecast: Why download a weather app separately when you have one inbuilt in Wanderlust? Get current weather & also weather data as per any city for the next 7 days. Weather includes humidity, wind, high and low temperatures that are shown in symbols and in figures. Just select the places whose weather you want to be updated with regularly and the selected places will show the current accurate weather information there.  The selected cities keep updating the current weather whenever you open the app. You can convert temperature from Celsius into Fahrenheit & vice versa.  Travel worry free as you can get local weather forecast wherever you are travelling. Knowing weather of any country, city or time zone is made easy. 2. Time Converter, time zone comparison & time zone alarm: Time conversion & calculation is handy now. Get time for different time zones. You can set alarm alerts to monitor selected time zones/countries. You can set alarm for & as per multiple time zones. Shows ahead/ back in time of home country in hours: minutes. You can set alarm alerts to monitor selected time zones/countries.  You can check other time zones in comparison to any selected time zone and not necessarily your default time zone. You can set different alarms for different time zones & different days too.3. Universal currency converter plus calculator: Foreign currency exchange calculation is made easy. It provides the latest foreign currency exchange rates for money conversion. It facilitates unit rate comparison, conversion & calculation. Check exchange rate & convert currency directly without referring calculator.4. Tools: A. Compass: No need to occupy your phone memory with an additional Compass app. To aide your navigation while globe trotting, our inbuilt compass will ensure, you wont get lost while trekking on your next wilderness camping as our sensitive 360 degree compass sensor will guide you even in remote locations.B. Unit Converter: Different countries/ continents use different units, weights & measures. Shopping is now made easy as our weight convertor will exactly quantify how much you need to by in local parlance. Now conversion of Oz to Ml, Kms to miles, kgs to pounds is just at your fingertip! No need to download a separate app for unit conversion.C. Size Chart: What if you are travelling across continents and are confused with the size labels while shopping? Our size chart helps as we have listed out international size with reciprocal local size.5. Country Wise holiday calendar: We have listed out which festivals fall on which days along with public holidays country wise. Get list of public/ bank holidays, national holidays, and observances, festivals etc. of any country selected. 6. Spot Finder: We have added broad categories of places of social, educational, healthcare, retail interest, automation & business, ATMs etc.  city wise. You will also find top rated places you are searching for.  7. Emergency phone numbers: What if you land in an emergency situation while travelling abroad? Fret Not. Get emergency telephone numbers such as fire station, ambulance, police etc. by country. We have listed Emergency SOS numbers for every country.",
    "descriptionHTML": "TechnoPear brings you one of the best travel app that assists while you are on the go. Whether travelling locally within the country or across international borders, travel buddy is at your beck &amp; call like a personal assistant.  It provides real time weather of a selected country/city/ time zone. With the spot finder, find a locale of your need with address &amp; contact details. Get emergency numbers of any country, in case you need, with EM Calls. Currency converter gives you live conversion rates. It facilitates comparison between more than two countries.  The inbuilt compass gives directions for easy navigation. Now no need to refer Google for finding holidays while you are abroad. <br><br>Our all-new cool travel app comes with awesome features:<br><br>1. Current Weather &amp; weather forecast: Why download a weather app separately when you have one inbuilt in Wanderlust? Get current weather &amp; also weather data as per any city for the next 7 days. Weather includes humidity, wind, high and low temperatures that are shown in symbols and in figures. Just select the places whose weather you want to be updated with regularly and the selected places will show the current accurate weather information there.  The selected cities keep updating the current weather whenever you open the app. You can convert temperature from Celsius into Fahrenheit &amp; vice versa.  Travel worry free as you can get local weather forecast wherever you are travelling. Knowing weather of any country, city or time zone is made easy. <br><br>2. Time Converter, time zone comparison &amp; time zone alarm: Time conversion &amp; calculation is handy now. Get time for different time zones. You can set alarm alerts to monitor selected time zones/countries. You can set alarm for &amp; as per multiple time zones. Shows ahead/ back in time of home country in hours: minutes. You can set alarm alerts to monitor selected time zones/countries.  You can check other time zones in comparison to any selected time zone and not necessarily your default time zone. You can set different alarms for different time zones &amp; different days too.<br><br>3. Universal currency converter plus calculator: Foreign currency exchange calculation is made easy. It provides the latest foreign currency exchange rates for money conversion. It facilitates unit rate comparison, conversion &amp; calculation. Check exchange rate &amp; convert currency directly without referring calculator.<br><br>4. Tools: <br><br>A. Compass: No need to occupy your phone memory with an additional Compass app. To aide your navigation while globe trotting, our inbuilt compass will ensure, you wont get lost while trekking on your next wilderness camping as our sensitive 360 degree compass sensor will guide you even in remote locations.<br><br>B. Unit Converter: Different countries/ continents use different units, weights &amp; measures. Shopping is now made easy as our weight convertor will exactly quantify how much you need to by in local parlance. Now conversion of Oz to Ml, Kms to miles, kgs to pounds is just at your fingertip! No need to download a separate app for unit conversion.<br><br>C. Size Chart: What if you are travelling across continents and are confused with the size labels while shopping? Our size chart helps as we have listed out international size with reciprocal local size.<br><br>5. Country Wise holiday calendar: We have listed out which festivals fall on which days along with public holidays country wise. Get list of public/ bank holidays, national holidays, and observances, festivals etc. of any country selected. <br><br>6. Spot Finder: We have added broad categories of places of social, educational, healthcare, retail interest, automation &amp; business, ATMs etc.  city wise. You will also find top rated places you are searching for.  <br><br>7. Emergency phone numbers: What if you land in an emergency situation while travelling abroad? Fret Not. Get emergency telephone numbers such as fire station, ambulance, police etc. by country. We have listed Emergency SOS numbers for every country.",
    "histogram": {
        "1": 19,
        "2": 6,
        "3": 12,
        "4": 26,
        "5": 73
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/TXcElNVUGOUhkFho98LHB5apYhL5Kxdhtzt9HnZH7whIlrSzaymGAiORk4df0Dm3cWU=h310",
        "//lh3.googleusercontent.com/FN5WdB_Ygm3JNGuDii-WlT2aqZllk3FrTs-RzdMaKqm-_b6AEj_SNrk8Ml22gvXkSGc=h310",
        "//lh3.googleusercontent.com/o1xqArdawOcxDhgVHHHkR6vPzxc5S0UuzrzHp8atgx2MDwgTOFto9HJfOLnTAtEfdw=h310",
        "//lh3.googleusercontent.com/O-QmkuX2maiw6JQILC0rehJSrauzFsHaFoLbTPpVqjd6VTrj1IlSt3ghb6FrUK4wgQ=h310",
        "//lh3.googleusercontent.com/dBfgNv0MxVMl17EiVzjHNKExAKfv_1tC2t1O24M33nIvWZHEmXdbQc7jfVUnoQCiEek=h310",
        "//lh3.googleusercontent.com/aB1tId-FbRWyJIAM8DfJeJsG43W9_8HWx5SDLwfhH2-rpJdQUcN_bH_00nML4IbTig=h310",
        "//lh3.googleusercontent.com/EEMP2cXun3PbiKpL34kDrE1RAPqTMBXXW7a0ba2tjVfIFIy41CPAJ_UuHrT_P7WHug=h310",
        "//lh3.googleusercontent.com/dZvgGQKr18lZkRUkDlsfzB5d5v5ep0RTXKtxOU3tz3V2ySJ2kOoNnkXfwXxsoB6lrG0=h310"
    ],
    "comments": [
        "App stop working after recent update (Nougat machine). I reload it again now with Oreo update, yes is working now. Really weird.",
        "It worked, and very nicely at that, but somehow only until yesterday ... Never saw the app on my phone, and I reinstalled the app to make that work but now the app on my phone (even after yet another reinstall and reboot of the phone) doesn't start any more.  What am I missing?  Edit: works a charm again! Thanks for the incredibly quick solution!",
        "Great app! please just fix the one thing that doesn't work. When I click on tools in my LG Watch Sport the app is crushing.",
        "Stopped working now just get the following message when trying to access from my watch, No data here add from your mobile tried reinstalling no luck. Deleted.  Retried now with AW2 but still not working, if you open app on phone at same time it will show on watch but not on watch alone, whats the point of that ? Deleted again.",
        "Doesn't scale for square screens It installs fine, but all the screens get cut off on a square watch. I have a zenwatch 2 (1.45\") and every \"card\" is cut off on each side.",
        "Doesn't work I just downloaded it and it keeps taking me back to play store"
    ],
    "recentChanges": [
        "-New user-friendly classy UI.",
        "-Emergency Calls: What if you land in an emergency situation while travelling? Fret Not. Get emergency contact numbers such as fire station, ambulance, police etc. by country. We have listed SOS numbers for every country.",
        "-Spot finder: When you travel with a list of places to see or a bag of things to shop &amp; don’t know how, search it on our Spot finder & bingo! You get the address and contact details of the place. Now you will know how to reach there better."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.evoli.wtc_v1&hl=en&gl=us",
    "appId": "com.evoli.wtc_v1"
}