{
    "title": "Freelancer - Hire & Find Jobs",
    "summary": "Freelancer, the world’s largest marketplace for freelancing, is now on Android!",
    "icon": "//lh3.googleusercontent.com/xPgG18R6w5DejxQDGTPPdWPnT1uAdowsaQHtdFtbugRTaXsZTzehQwFTor7RHDj1HQxG=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 28682,
    "developer": "Freelancer.com",
    "developerId": "Freelancer.com",
    "developerEmail": "android@freelancer.com",
    "developerWebsite": "http://www.freelancer.com",
    "updated": "February 28, 2018",
    "version": "3.6.14",
    "genre": "Business",
    "genreId": "BUSINESS",
    "description": "At Freelancer we turn ideas into reality. We are the world’s largest freelancing and crowdsourcing marketplace that connects employers and freelancers. Hire the best talent, or find work from anywhere in the world. Let’s get it done. POST A PROJECT FOR FREESimply post a project for free, and you’ll start to receive bids within seconds. You can choose to get projects done at fixed or hourly rates, and you’ll only have to pay for the work once you are 100% satisfied. It’s that easy. HIRE PROFESSIONALS IN ANY FIELDWe have millions of Freelancers ready to work on thousands of jobs: from web design and product manufacturing, to graphic design and data entry. Whatever your needs, there will be an expert to get it done. EARN MONEY BY DOING WHAT YOU LOVEAre you talented in a field and looking for work? Join our platform as a freelancer. You’ll be able to offer your service to employers from around the world, whilst working whenever and from wherever you like. For employers:— Get project completed quickly, efficiently, and within budget.— Only pay for work when you are 100% satisfied.  — Post a job and instantly receive bids from talented freelance professionals all over the world.— View and choose the perfect freelancer for your project needs.— Securely held payments.— Get projects done at fixed or hourly rates.— Award project on-the-go. Just tap via the app, award, and your freelancer begins their work.— Communicate via instant messenger with your freelancer, and stay updated. For freelancers:— Work from home or from anywhere in the world.— Say goodbye to 9-to-5 and say hello to a life of job flexibility.— Find freelance work from a global base of employers.— Set up a free account, browse, and bid on projects that suit your skills. — Bid on work while you’re on-the-go. — Communicate with employers via instant messenger.— Only start work once payment milestones have been uploaded. — Be protected by a secure freelance platform that works for both freelancers and employers.If you have any feedback on the current version, or suggestions for future updates,please email us at:android@freelancer.com",
    "descriptionHTML": "At Freelancer we turn ideas into reality. We are the world&#x2019;s largest freelancing and crowdsourcing marketplace that connects employers and freelancers. Hire the best talent, or find work from anywhere in the world. Let&#x2019;s get it done. <br><br>POST A PROJECT FOR FREE<br>Simply post a project for free, and you&#x2019;ll start to receive bids within seconds. You can choose to get projects done at fixed or hourly rates, and you&#x2019;ll only have to pay for the work once you are 100% satisfied. It&#x2019;s that easy. <br><br>HIRE PROFESSIONALS IN ANY FIELD<br>We have millions of Freelancers ready to work on thousands of jobs: from web design and product manufacturing, to graphic design and data entry. Whatever your needs, there will be an expert to get it done. <br><br>EARN MONEY BY DOING WHAT YOU LOVE<br>Are you talented in a field and looking for work? Join our platform as a freelancer. You&#x2019;ll be able to offer your service to employers from around the world, whilst working whenever and from wherever you like. <br><br><br>For employers:<br>&#x2014; Get project completed quickly, efficiently, and within budget.<br>&#x2014; Only pay for work when you are 100% satisfied.  <br>&#x2014; Post a job and instantly receive bids from talented freelance professionals all over the world.<br>&#x2014; View and choose the perfect freelancer for your project needs.<br>&#x2014; Securely held payments.<br>&#x2014; Get projects done at fixed or hourly rates.<br>&#x2014; Award project on-the-go. Just tap via the app, award, and your freelancer begins their work.<br>&#x2014; Communicate via instant messenger with your freelancer, and stay updated. <br><br><br>For freelancers:<br>&#x2014; Work from home or from anywhere in the world.<br>&#x2014; Say goodbye to 9-to-5 and say hello to a life of job flexibility.<br>&#x2014; Find freelance work from a global base of employers.<br>&#x2014; Set up a free account, browse, and bid on projects that suit your skills. <br>&#x2014; Bid on work while you&#x2019;re on-the-go. <br>&#x2014; Communicate with employers via instant messenger.<br>&#x2014; Only start work once payment milestones have been uploaded. <br>&#x2014; Be protected by a secure freelance platform that works for both freelancers and employers.<br><br>If you have any feedback on the current version, or suggestions for future updates,<br>please email us at:<br>android@freelancer.com",
    "histogram": {
        "1": 2855,
        "2": 1231,
        "3": 2441,
        "4": 5213,
        "5": 16942
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/q8mc2OIbu1Wx4yKtv6nkJOeSiU19pLoBexMZDuxKeJubcMCfaJNnBPWL92RgiGBS8g=h310",
        "//lh3.googleusercontent.com/3i6IaiQEfI-KHgn9mHoQ_nEYI5tjde9HHy6f1JA71V5Jz9dY5lUog_smisOthTWDz3g=h310",
        "//lh3.googleusercontent.com/tBSDWbfq1RdZpsx37RTiCDrVcNdzR3LgTUIjL_CPe7rr83RozIm9Z5llLH3WCJVUp6Q=h310",
        "//lh3.googleusercontent.com/vE-EcqnRYvEaL0ngtoS6NR3x0NTTWW75_dwsGzkS6wI2BYRTiI31nNfZ_JAVbEc_-cE=h310",
        "//lh3.googleusercontent.com/-NBBoTHC2sXFo6XNA1NUeAeN9LHJNN5IBJgR10qEBPPt0LLWzdSOM5edPv-zMnj9Qw=h310",
        "//lh3.googleusercontent.com/nvMUwMC37IgL0AWpbAJkAHGtWfkeitQv5NWgQmZifl885Y1bQ5KfV6HJFFxuqBZ2FQ=h310"
    ],
    "comments": [
        "Still no notifications on mobile...  Why just you guys don't work it out.?? What's the issue... I am really 😡",
        "It doesn't notify that we have new message from developer or client. How am I supposed to work on freelancer. Please fix this.",
        "appreciate the efforts.. keeps on loading even if Internet is working perfect ! needs a lot of improvement",
        "One of the finest in quality app for freelancers who needs work and want to finish like they need",
        "Last update and the app is asking me twice will I update my mebmership",
        "Facing problem in paypal payment gateway..cannot load money..."
    ],
    "recentChanges": [
        "We're releasing regular updates to bring you the best app experience possible. This version includes the following:",
        "- Bug fixes and improvements",
        "Please reach out to android@freelancer.com with any issues or suggestions."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.freelancer.android.messenger&hl=en&gl=us",
    "appId": "com.freelancer.android.messenger"
}