{
    "title": "Fly Delta",
    "summary": "Manage your travel on Delta with access to boarding passes, flight info &amp; more.",
    "icon": "//lh6.ggpht.com/zP1693CpuJuDpuZrXZgze8VmiusYr3w4v7bYJuyCzSi6jsgpaENFdcqjObBTy1fQ9HE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 3.7,
    "reviews": 26895,
    "developer": "Delta Air Lines, Inc.",
    "developerId": "Delta+Air+Lines,+Inc.",
    "developerEmail": "MobileApp@delta.com",
    "developerWebsite": "http://www.delta.com/app",
    "updated": "February 28, 2018",
    "version": "4.9",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "DESCRIPTION:Welcome to Fly Delta 4.0, the biggest update yet to Delta’s award winning Android app. With a redesigned Today screen which provides quick access to your eBoarding pass and other important day-of-travel information, Fly Delta makes travel easier than ever before.• Find, compare and book Domestic and International flights• Book SkyMiles® award tickets• Purchase Delta Comfort+™ and Trip Extras, including in-flight Wi-Fi, Priority Boarding and more• Reserve Preferred Seats like bulkhead and aisle• Rebook cancelled flights or missed connections• Manage your trips, profile and customize your travel preferences• Check your SkyMiles® account balance and current Medallion® status• Check in and view your eBoarding Pass• Pay for checked bags and track their location• Check the latest flight status and receive flight and gate change notifications• Save a photo to remember your parking spot• Check your status on the upgrade or standby list• View or change your seat• Locate Delta Sky Club® lounges• View airport maps, public transportation details and weather information• Get detailed info about our fleet and partners• Map flights en route with an interactive flight tracker• “Today” gathers everything you need for your day of travel into one convenient place• “Feed” ensures you always have the latest flight updates, gate changes and moreThe Fly Delta app for Android and delta.com are always free to use on Delta’s Wi-Fi-enabled flights. Visit delta.com/app for more information.Delta Air Lines serves more than 160 million customers each year. With its unsurpassed global network, Delta and its partner airlines offer service to more than 350 destinations in nearly 70 countries in six continents.",
    "descriptionHTML": "DESCRIPTION:<br>Welcome to Fly Delta 4.0, the biggest update yet to Delta&#x2019;s award winning Android app. With a redesigned Today screen which provides quick access to your eBoarding pass and other important day-of-travel information, Fly Delta makes travel easier than ever before.<br><br>&#x2022; Find, compare and book Domestic and International flights<br>&#x2022; Book SkyMiles&#xAE; award tickets<br>&#x2022; Purchase Delta Comfort+&#x2122; and Trip Extras, including in-flight Wi-Fi, Priority Boarding and more<br>&#x2022; Reserve Preferred Seats like bulkhead and aisle<br>&#x2022; Rebook cancelled flights or missed connections<br>&#x2022; Manage your trips, profile and customize your travel preferences<br>&#x2022; Check your SkyMiles&#xAE; account balance and current Medallion&#xAE; status<br>&#x2022; Check in and view your eBoarding Pass<br>&#x2022; Pay for checked bags and track their location<br>&#x2022; Check the latest flight status and receive flight and gate change notifications<br>&#x2022; Save a photo to remember your parking spot<br>&#x2022; Check your status on the upgrade or standby list<br>&#x2022; View or change your seat<br>&#x2022; Locate Delta Sky Club&#xAE; lounges<br>&#x2022; View airport maps, public transportation details and weather information<br>&#x2022; Get detailed info about our fleet and partners<br>&#x2022; Map flights en route with an interactive flight tracker<br>&#x2022; &#x201C;Today&#x201D; gathers everything you need for your day of travel into one convenient place<br>&#x2022; &#x201C;Feed&#x201D; ensures you always have the latest flight updates, gate changes and more<br><br>The Fly Delta app for Android and delta.com are always free to use on Delta&#x2019;s Wi-Fi-enabled flights. Visit delta.com/app for more information.<br><br>Delta Air Lines serves more than 160 million customers each year. With its unsurpassed global network, Delta and its partner airlines offer service to more than 350 destinations in nearly 70 countries in six continents.",
    "histogram": {
        "1": 4187,
        "2": 1936,
        "3": 2787,
        "4": 6237,
        "5": 11748
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/YC5qCtHCGSnYypgED7EajXPyOJzsktQyAa3L6Nq-xFCg65IQOoKfGrQBJhsy8dJtsEs=h310",
        "//lh3.googleusercontent.com/fAzeCbOJaJbVNE8dJiWxEv3MokCuGvFhRIqIMVCV2_cyyd16G7qca-YWfOJBZ3c70w=h310",
        "//lh3.ggpht.com/WjWqUMd1gs_HQnj7fSmFuQaf3SuUzRExw8-9PYARrajlSXvE25kmFOurzVY4_776qoY=h310",
        "//lh6.ggpht.com/nZF-dV84dFIN-xKt-ayy58YcjYDlG15xR0kHQiwdC56JcAwjfRPmBS3OZMSBNNfqyQ=h310",
        "//lh5.ggpht.com/UbRjJeWY9TCkqfxto1cbTqqoy_LbuvCvajh3ZO91N7eXbmEbd_aDaWxbvpN03evFnTc=h310",
        "//lh3.googleusercontent.com/mHr-RNyGqGO32ME_HnmLCSRq6vSIpxM7X0mXLD1AR8MaZp6KUvxfNOXTL57oMWfDzw=h310",
        "//lh3.googleusercontent.com/eJM6z4RM_0WUxiyojCXwWOlkUgxtMSrldQirAjCHMqLgKZT8RbkyZTz9C3zd2-BrCTE=h310",
        "//lh3.googleusercontent.com/qFgCRKhN53OaLyf7YR5GHnhiYmhQjRKovRFbyUnZXuEimxZ27BxOkqmcYt9dWb5XCtVS=h310",
        "//lh3.googleusercontent.com/74SSA8H_Lh0_dqzHU8xDJ8CfaGFnX4S7XZ5AtmrrcsRb25fmJU6OlRGSieZg4V2g4R8=h310",
        "//lh3.googleusercontent.com/SRQNp00fbFOkuAh4ANhoEcOxT07ap_kDbgz-0vkdwYlFQPMWUj6UXLg58_vTL9ez3qc=h310",
        "//lh3.googleusercontent.com/84l7GtpwFIMsaw2rr3W3z79Q2mSkTroj-M2p3ePYOvz7l8fD3i9iGy1FqJOqXZh_Naw=h310",
        "//lh3.googleusercontent.com/iMm5Zz4e4cYLA6hYmsQAyokEP0Sf4z5IgYznvP9BjVHiJ5QKWFz3y3VUFnUwXcEblik=h310",
        "//lh3.googleusercontent.com/MhbfNP7NsK572uhZROkIVewPGrTnYdKYLIe8WNIglDcXj8DEBk3hkT3IFoAymH6LSUI=h310"
    ],
    "comments": [
        "Unable to view annual companion ticket or vouchers on the account",
        "NO NRA DISCOUNT = NO DELTA ! ! !",
        "Fails to give updates on delayed fights.  Doesn't update when you select manual update.  Carson Wagon-lit flight app gets my my Delta delay notices when Delta never gets old out.  Focus on the flying business!",
        "Still buggy. Doesn't show all trips. Crashes trying to select seats. Logs you out without fail and always requires entering a last name for no reason what so ever. Credit card form fails every time.",
        "This app used to be excellent. Recently added auto check in makes things very difficult if you are within 24 hours of departure and need to change your flight. You cannot do it because it checked you in the moment you opened the app. Now you need to call delta which regularly takes over 2 hours to speak to someone to get Un checked in and often the flight I try to switch to is then sold out. There should be a way to opt out of this feature. One size does not fit all.",
        "Keeps logging me out and then refusing to log me back in despite correct login and password, then locking me out so I get to call an 800 number and sit on hold for hours to reactive my account. This the the very definition of bad."
    ],
    "recentChanges": [
        "• You can now view the miles you’ve earned for your trip on the arrival screen of “Today”",
        "• We’ve added two new interactive wayfinding maps. Get turn-by-turn directions inside the airport in both Amsterdam and Mexico City",
        "• Bug fixes and stability enhancements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.delta.mobile.android&hl=en&gl=us",
    "appId": "com.delta.mobile.android"
}