{
    "title": "Surge: Gay Dating & Chat",
    "summary": "Surge is free gay social network to meet and chat with curious, bi and gay men.",
    "icon": "//lh3.googleusercontent.com/SEJu92fMZfksRjFk4yXE71AYDMErlCEiVNs7WIWT2QEkyRAZh9RHCikDwM_SE5Anjg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 36283,
    "developer": "Surge Gay App s.r.o.",
    "developerId": "Surge+Gay+App+s.r.o.",
    "developerEmail": "info@surgeapp.com",
    "developerWebsite": "http://www.surgeapp.com/",
    "developerAddress": "Surge Gay App s.r.o.\nRohanske nabrezi 678/23\nPrague 8, 18600\nCzech Republic",
    "updated": "February 15, 2018",
    "version": "5.10.2",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Surge is the most convenient way to meet gay guys nearby.Features:- Browse through unlimited number of profiles with multiple photos- Chat with the ones you match with- Get notified of new messages even when the app is on background- Upload up to 8 pictures to your profile- Send photos and videos in chat that permanently disappear after being viewedSurge is determined to provide a safe experience. You must be 18 years old / young to use Surge.",
    "descriptionHTML": "Surge is the most convenient way to meet gay guys nearby.<br><br><br>Features:<br>- Browse through unlimited number of profiles with multiple photos<br>- Chat with the ones you match with<br>- Get notified of new messages even when the app is on background<br>- Upload up to 8 pictures to your profile<br>- Send photos and videos in chat that permanently disappear after being viewed<br><br><br>Surge is determined to provide a safe experience. You must be 18 years old / young to use Surge.",
    "histogram": {
        "1": 1895,
        "2": 621,
        "3": 1377,
        "4": 4477,
        "5": 27913
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/9_p0Pmtpg7xAfiE4EKrQYikbyFcbpuo7MYfKwsOADnFL22xlXe4D0F_EjGXRassLtls=h310",
        "//lh3.googleusercontent.com/AbROxDCeRL2EEggAnVLpvbFbKA6z4Ozh_X3f-hA-X4F1Zzswgqe5YuJIKEvnx1PMCrU=h310",
        "//lh3.googleusercontent.com/-gSw8wkXAcomEz4KrYGkSDIx6xpzuzgxZmub3zHft9YEIOY6jagXl2w3hg3UYySKpHw=h310",
        "//lh3.googleusercontent.com/oBFX1GODNs9BWER2aBnztyWWu8vWh4JYT37MvdFX7kf1dL9u41peQvEDoUiGCgGTPzw=h310",
        "//lh3.googleusercontent.com/eniTwqXCLYu3_tvOcvpkX1VxOLqQ1NTHuWLuQj3nMtF1KxWjIIO3LeMs6OgaVAxsX0tU=h310"
    ],
    "video": "https://www.youtube.com/embed/-9yD5zawPkE",
    "comments": [
        "There are so many fake profiles it is utter ridiculous. I get likes from at least two of them a day! This is a problem that has to be fixed. If you want to be constantly bothered by fake profiles; then by all means get this app. I even tried the paid version, it wasn't any better. This whole app might just be a scam.",
        "I enjoy the app BUT there are SO MANY FAKE ROBOTS who pretend to be military guys and they sound like they are from India the way they text. Why can't the developers do something to control this???? Even when I PAID for the app it didn't stop the robots. Really sad. Otherwise all the features are great unless a robot spammers starts messaging you like a stalker.",
        "Not the biggest fan of dating apps that only allow you to swipe left or right. It would be nice to be able to look people up by name and/or user name and be able to send instant messages to anyone instead of having to be a \"match\" etc.",
        "I honestly was giving up on dating sites. Then I stumbled upon this miracle app. My hope and prayers were saved. Not only are you COMPLETELY , you also have access to guys that you are attracted toward. The team is very dedicated to Surge. They asked me personally how I felt about the app. They seriously care! Get this app!!!!!",
        "I'm not convinced this app wasn't developed by Nigerian scammers to run their \"419\" romance scams.  I experienced 11 attempts at various scams in my first week. This app is crawling with 'em.  Don't waste your time, though if you enjoy trolling these guys, this is the app for you.",
        "It works well however the UI does feel slightly cluttered but it does offer the simplistics and lets you spdcify a lot of details well. The chat management is good as well, letting you send photos which can only be viewed once etc."
    ],
    "recentChanges": [
        "- verification bug fix",
        "- stability and performance improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.lavendrapp.lavendr&hl=en&gl=us",
    "appId": "com.lavendrapp.lavendr"
}