{
    "title": "Emergency Alert button",
    "summary": "Sends coordinates to predefined numbers and emails in case of emergency alert",
    "icon": "https://lh3.ggpht.com/XxlE8sAa6VwkM20P6isfGrha0-DN7j6T9c5qjceZSPciMWkfDn0kUjpUMH_TVFzksMY=w300",
    "price": "$2.71",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.2,
    "reviews": 62,
    "developer": "Megapps Ventures Inc.",
    "developerId": "6659558985272229143",
    "developerEmail": "megapps_support@techie.com",
    "developerAddress": "Eschersheimer Landstrasse 42\nFrankfurt 60322\nGermany",
    "updated": "May 5, 2015",
    "version": "2.8",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "The Emergency Panic Button is an app that must be pre-installed on all Android devices!Improve your own safety by installing our emergency alert button and let everybody know you are in trouble by letting the app send a short alert notification to your friends or family via email or SMS/text message and calling a number with a simple push of the power or soft widget button.If you care for the safety of your family members, loved ones, let them  know about this App. Are you a lone worker or working somewhere outdoors? You also need this App!Make sure to watch the embedded youtube video for proper way of invoking the emergency.Here is a short user review explaining some of the main features:http://www.youtube.com/watch?v=m-SlhF-3VzAFeatures at a glance:✔ Android wear support (one button click required) - the only Emergency app with Wear support!✔ Set up a list of contacts (phone numbers or emails) and every time you are in need of assistance (being attacked, robbed, lost or having health problems) you can issue an emergency call by a combination of presses on the power/sleep button (fast presses within 2 seconds to avoid false alarms!) OR with a Home Screen or Lock Screen Widget (same number of fast presses for safety reasons). ✔ Current location (either GPS, network or both) and predefined message will be sent to your selected contacts as SMS and or Email.✔ A contact person set up by you will also be called✔ Home Screen and Lock Screen Widget✔ Use the sms contact feature to post on Twitter and Facebook when you are in trouble via their post from sms features.✔ Set up a trusted list numbers and everybody in that list (or everybody knowing the SMS command if you choose to do so) can send SMS commands to the phone if they suspect that something wrong is happening to you, even if no emergency has been triggered.✔ Receive one time location updates or start automatic locations predefined by the device holder in the App's settings✔  Password protection, both for the app itself or for the SMS commands.✔ Auto enabling GPS. The app will try to auto enable the GPS chip even if disabled in Android settings to get the best current position (works on almost any Android device, but might not work on some!)✔ Stealth mode - Choose to have a notification icon in a case of emergency or disable it and run the emergency in stealth mode, so that potential abusers would not suspect anything. Use case scenarios: ✔ Install the app on your device on the device of a family member (parents, spouse, kids, relatives etc.), boy/girlfriend, friend you care about  and let them add you as a contact in a case of Emergency.If they are in trouble, all they have to do is press the power button a few times and you will be notified of their emergency. They can use the app as a panic button.✔ If you are being attacked, robbed, or just lost, having health problems and no way to call or text, just press the power button a few times and all of your contacts will know that you are in trouble.✔ Your kids are running late from school and you are worried? No Problem, just send a location request to their phones and you will be notified of their position.✔ You could also use the app to track your lost android or stolen android or find my phone.If you have questions, suggestions please email us from within the app or to the email below.Please make sure to  check out our other cool Apps by clicking on more from developerIcon by: http://www.icons-land.com",
    "descriptionHTML": "The Emergency Panic Button is an app that must be pre-installed on all Android devices!<br>Improve your own safety by installing our emergency alert button and let everybody know you are in trouble by letting the app send a short alert notification to your friends or family via email or SMS/text message and calling a number with a simple push of the power or soft widget button.<br><br>If you care for the safety of your family members, loved ones, let them  know about this App. Are you a lone worker or working somewhere outdoors? You also need this App!<br><br>Make sure to watch the embedded youtube video for proper way of invoking the emergency.<br>Here is a short user review explaining some of the main features:<br>http://www.youtube.com/watch?v=m-SlhF-3VzA<br><br><br><br>Features at a glance:<br>&#x2714; Android wear support (one button click required) - the only Emergency app with Wear support!<br>&#x2714; Set up a list of contacts (phone numbers or emails) and every time you are in need of assistance (being attacked, robbed, lost or having health problems) you can issue an emergency call by a combination of presses on the power/sleep button (fast presses within 2 seconds to avoid false alarms!) OR with a Home Screen or Lock Screen Widget (same number of fast presses for safety reasons). <br>&#x2714; Current location (either GPS, network or both) and predefined message will be sent to your selected contacts as SMS and or Email.<br>&#x2714; A contact person set up by you will also be called<br>&#x2714; Home Screen and Lock Screen Widget<br>&#x2714; Use the sms contact feature to post on Twitter and Facebook when you are in trouble via their post from sms features.<br>&#x2714; Set up a trusted list numbers and everybody in that list (or everybody knowing the SMS command if you choose to do so) can send SMS commands to the phone if they suspect that something wrong is happening to you, even if no emergency has been triggered.<br>&#x2714; Receive one time location updates or start automatic locations predefined by the device holder in the App&apos;s settings<br>&#x2714;  Password protection, both for the app itself or for the SMS commands.<br>&#x2714; Auto enabling GPS. The app will try to auto enable the GPS chip even if disabled in Android settings to get the best current position (works on almost any Android device, but might not work on some!)<br>&#x2714; Stealth mode - Choose to have a notification icon in a case of emergency or disable it and run the emergency in stealth mode, so that potential abusers would not suspect anything. <br><br><br>Use case scenarios: <br>&#x2714; Install the app on your device on the device of a family member (parents, spouse, kids, relatives etc.), boy/girlfriend, friend you care about  and let them add you as a contact in a case of Emergency.<br>If they are in trouble, all they have to do is press the power button a few times and you will be notified of their emergency. They can use the app as a panic button.<br>&#x2714; If you are being attacked, robbed, or just lost, having health problems and no way to call or text, just press the power button a few times and all of your contacts will know that you are in trouble.<br>&#x2714; Your kids are running late from school and you are worried? No Problem, just send a location request to their phones and you will be notified of their position.<br>&#x2714; You could also use the app to track your lost android or stolen android or find my phone.<br>If you have questions, suggestions please email us from within the app or to the email below.<br><br>Please make sure to  check out our other cool Apps by clicking on more from developer<br><br>Icon by: http://www.icons-land.com",
    "histogram": {
        "1": 14,
        "2": 8,
        "3": 7,
        "4": 15,
        "5": 18
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/nQImQWTB2n0bfTr9Yqoj7kAzn4NWY_OFCMtnN-zgy18woaHncAKupQrGAy9qQtqGJw=h310",
        "//lh6.ggpht.com/PT69Pu5Milz8oUoxr31uP1SLoRZoH72eWGRznbJPpatl6StYoT23xAoR3vhmVerFcxg=h310",
        "//lh4.ggpht.com/goxHhU3PfPTXLM0xeDes9ZtJhI5unMNF7K6SBA26nd9pMMFb-aKIwll0hhQYjRiIccQ=h310",
        "//lh3.ggpht.com/dirZk4VPjNWY98keifcvfXAwbU3yY6wGHOrgN4BhlpctE0SXNV_4JWyTjXNN7V3zEcY=h310",
        "//lh6.ggpht.com/USvQQFdsiuFcG4EBMQpbbn6ZL0xkBeT3jK9ow5yKOzeYnvM0us1jUoqZVpWp2WRbq-4O=h310",
        "//lh5.ggpht.com/IsCHqg-_-3nsD9kmHoCW_Y0fz4EoNEvYnT9Utc9FfEFGAaAjfKIVX2Qd_9GIx1N1aA=h310",
        "//lh3.ggpht.com/CpS-C5QRUs4tId-P9YFMJLxVRR69DnLqaHC7JKFs9ZnT_njr6gyXHJ-RGHaWBuN3Kw=h310",
        "//lh6.ggpht.com/kGT3h03rSae7x_39g8UWyMYJHAdodPev7BbxOIkjJitKtLD3-AkuwjQBWg2Qs158PyU=h310",
        "//lh5.ggpht.com/0NlW3U5q16Ys1kjy3-hnS0zkErvs0Y5NkZLTUO6HjdgJk0z97OvetIdwj70MeEvTs15p=h310",
        "//lh6.ggpht.com/9ooEYU-LIo_d0d427P9QbuU2-IKzWiYPbSa5t7rVjzRahXpZgWEuvQ3AkxiGVClXKfU=h310",
        "//lh3.ggpht.com/wqit7p5nQwS25NsulehixOzLRIUsavog7hi5U7Ka6s0EwsWK1mAd0YUyWMoXX77kxw=h310",
        "//lh4.ggpht.com/BKCvdytvdvtYvqfVM9sSTR3LBPKeyks5lioVnAGcYzXGhsHXYn3P8w3CV5F7ErzQ4jk=h310",
        "//lh5.ggpht.com/RsJVDOhq44tiy5jQsy8eT0B923H0A6Zsc6sMKdohW-08l4gwFJUZnbjaXZ8fgQgdT9Uz=h310",
        "//lh3.ggpht.com/9rwLqgVY4kfx88QRiOYYgkUQfEDXqigrtTrRSrIYxal3blyh7QtHA3-4Uwc5FcX4GRc=h310",
        "//lh3.ggpht.com/LLDgd9GatiISGBoiOZKZDha2zxQDi0fXkMg6VIQ9jzG_BkKVuWvOsqMDftFySxa3JA=h310",
        "//lh3.ggpht.com/1-nRRmYcQb80MFacoRKF-lnzqhAO9b06ngy9XFn2s-SuCyAL6OeBzWIjVKLQfD0Wx7_N=h310",
        "//lh5.ggpht.com/LAjIwh7ah2PnEovL4RtsOWOYzRAP_BJI0aWocuTTU_pjtgLRo5qagOfLEI1VaRPnqgM=h310",
        "//lh6.ggpht.com/J1libXQSHzx4VEjUCHF8_AyivzY1exgjqor-eKZY6IuhKM73E2yX-boad12jfw_mMEL1=h310",
        "//lh6.ggpht.com/jlDgPxdInL9JX7QTgoNBW_MaN0mVNxpS66qCsbJMRE0WSgXWm8pUadtbMmQfQncZhSw=h310"
    ],
    "video": "https://www.youtube.com/embed/oTF9J33RU6Q",
    "comments": [
        "Doesn't work samsung galaxy s5 Doesny work with my galaxy s5 with sony smart watch 3. You press the panic button and the app tries to send out messages but thats as far as it gets. No messages or emails get sent.",
        "Seems ok I just downloaded this yesterday. My problem is that I can only figure out how to put in 1 emergency contact. I went on today to work on it more and I can find no way to open to the page.",
        "The number of presses of the power button shall be 3 also. And once triggered, a confirmation vibration should be included. With these, I would consider 5 stars !",
        "Android wear not working Phone side works good, widget works good. Liking the ability for multiple sms numbers. But can't get android wear to activate no help info. Emailing developer",
        "SMS location (to receive location after issuing an SMS) option not working? Be sure you uncheck the \"Trusted list\" or input the Trusted list exactly as in the recipients (international codes and all).",
        "HTC Brilliant"
    ],
    "recentChanges": [
        "2.8",
        "- bugs fixed",
        "old:",
        "- Android wear support-only 1 press required via watch button",
        "- UI design update",
        "- Lock screen widget - same number of presses!",
        "- Home Screen Widget - alternative to the power button (same number of presses)",
        "- Call a number in case of emergency",
        "- Hide the GPS icon in a case of Emergency (stealth mode)",
        "- Support for Wap Push SMS",
        "- Stop the emergency event: just use the same combination to disable the emergency event once triggered. Works as a safety switch."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.incorporateapps.emergency&hl=en&gl=us",
    "appId": "com.incorporateapps.emergency"
}