{
    "title": "TripCase – Travel Organizer",
    "summary": "The travel app to organize trip items, with free flight alerts &amp; travel tools",
    "icon": "//lh3.googleusercontent.com/B9zXXM5I8_zvu-2DITw1mRRIcVbRvNDiYMFIALSuHKHFQzOPF_c3n2-l-Zw3i0mqM92D=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 17267,
    "developer": "Sabre Traveler Solutions",
    "developerId": "Sabre+Traveler+Solutions",
    "developerEmail": "support@tripcase.com",
    "developerWebsite": "http://www.tripcase.com/signup",
    "developerAddress": "3150 Sabre Dr\nSouthlake, TX 76092",
    "updated": "December 6, 2017",
    "version": "4.14.7",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "Organize all of your trip details and travel plans into one streamlined itinerary. TripCase lets you manage flight itineraries, hotel bookings, and rental car reservations in one app. Get airport terminal and gate information in one glance on your phone, and receive notifications on your phone, tablet or smartwatch if there is a change to your flight. Great for business travelers and frequent fliers.BEFORE YOUR TRIP• add reservation details to your account so you can access your itinerary from anywhere• share your trip with others and TripCase will keep them updated on your behalfAT THE AIRPORT• view flight information and receive notifications if anything changes• locate your seat on the plane or check out what’s available with real time seat maps• search alternate flights when you need to make adjustmentsAT YOUR DESTINATION• quickly access directions or request an Uber ride to get to your next destination• uncover something new with helpful messages specific to your destination• instantly add new locations to your itinerary to remember them later",
    "descriptionHTML": "Organize all of your trip details and travel plans into one streamlined itinerary. TripCase lets you manage flight itineraries, hotel bookings, and rental car reservations in one app. Get airport terminal and gate information in one glance on your phone, and receive notifications on your phone, tablet or smartwatch if there is a change to your flight. Great for business travelers and frequent fliers.<br><br>BEFORE YOUR TRIP<br>&#x2022; add reservation details to your account so you can access your itinerary from anywhere<br>&#x2022; share your trip with others and TripCase will keep them updated on your behalf<br><br>AT THE AIRPORT<br>&#x2022; view flight information and receive notifications if anything changes<br>&#x2022; locate your seat on the plane or check out what&#x2019;s available with real time seat maps<br>&#x2022; search alternate flights when you need to make adjustments<br><br>AT YOUR DESTINATION<br>&#x2022; quickly access directions or request an Uber ride to get to your next destination<br>&#x2022; uncover something new with helpful messages specific to your destination<br>&#x2022; instantly add new locations to your itinerary to remember them later",
    "histogram": {
        "1": 876,
        "2": 635,
        "3": 1215,
        "4": 4002,
        "5": 10539
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/xyP4usLEJ5kEVFRaBfzGzBro9lt0kIDkcMBSh5SMFcW2xmNNXz4Sfy1XKKdoskxxMBxn=h310",
        "//lh3.googleusercontent.com/N8aYGT8Kb1eyPnxDW7m7SWvi-chU5PtntPqU59MWuuYvp8dXKuUk5I0GzMyTKnIeDw=h310",
        "//lh3.googleusercontent.com/eH5GJyuDffgHL6EHLIZc4RvFvtSScJgEwWxTYvts0tqtap_OqPfMWy0XqM2RUShwmHGp=h310",
        "//lh3.googleusercontent.com/sIyftD2EDKOud4D4TKOvRQygsdbS7fuIs2FWhPW4I7dp4QtBCL-vwo-6XByGQTbd9m73=h310",
        "//lh3.googleusercontent.com/f8qjaa1cJPOvXl0tfE5GCdD1VKxrrfgkF1Fre865N0dh79IoJSCMKwzlhdlGGUchR1I=h310",
        "//lh3.googleusercontent.com/24455Yo03DjqMhaiZFLSuS1tP6tZqUaJSR-Fu1ir6HpCYM_o2LesrpRspGZSl5YkZw=h310",
        "//lh3.googleusercontent.com/iw-pW8U5x35s3L3Y4JfCIWA6rGKKpCGY0LES0iQaWlEY5oEm5HkwTaXt7wVVCSCKkA=h310",
        "//lh3.googleusercontent.com/B9fGr6nYFxUJSjdcE7LgKuyS2ZHEtfzsqghAHyepPOBrkLuf7EazJ3oXfST9hzX6Dkc=h310",
        "//lh3.googleusercontent.com/ZJS93IV-2YrKiXwhZq7-HPRyjQAorK71TjKkLWdwTkqfGgC4VkQ669RTW7xA94EPKw=h310",
        "//lh3.googleusercontent.com/raL6lzRkJU5gpiBSV3O3EKam-AhX2etegy3KqFY9TagnoIex1bdLc04QLl0icyofq4A=h310",
        "//lh3.googleusercontent.com/GQ-O65jiTHHpasfKzSNdNw9bW7pC13XQJdncOd7eRkuKvePTwQxwyhEtzS_JNRXnBhM=h310"
    ],
    "video": "https://www.youtube.com/embed/yLkjVNvBoFw",
    "comments": [
        "I hate reverse onus offers. I don't want a free trial period to automatically charge me at the end of the trial. If I find after the trial that I didn't find it useful then I shouldn't have to begin paying. Instead, the vendor should ask me if I want to continue or not. Accordingly, I've attempted to cancel, yet this attempt has been blocked on my new pixel 2. No idea why, but that's another issue...",
        "I rarely write reviews but thought this app warranted it. I used to use a similar app called Worldmate so that's my benchmark. Comparatively, TripCase is just not intuitive whatsoever. After forwarding through email confirmations it rarely picks up hotels and it also doubles up on travel confirmations (say if there are 2 of you travelling, or if you have sent a confirmation through twice accidentally). The reason I give it 2 stars not 1, is because it does look nice and the realtime flight data is available and seemingly free.  Recommend just spending some decent effort on making it way more intuitive and linking into Google's accommodation database and I'll reconsider using it.",
        "Just not a very clever! Great for flight information , but pretty useless when it comes to other aspects of trip planing.  No possibility of attaching a document, say pdf confirmation, and no means to share itineraries via WhatsApp and other social media, only via email, which requires recipient to join Tripcase to view.  Not recommended for anything other than the most basic of planning.",
        "Sent duplicate alerts... Hard to read had to get past their ads for upgrades to find my travel info. Airline and hotel apps far superior.",
        "This app was so good once.... now it's just gone to garbage. What a shame. Uninstall and get TripIt instead.",
        "Dear Tripcase, PLEASE PLEASE change the way this app works when travelling. It is useless and not fit for purpose \"as-is\". It's an easy change - FIRST, load the itinerary as it is in the buffer/storage. THEN, check for updates on the Internet. What always happens is I'm standing at the immigration desk and when they ask me what hotel I'm staying at, or what flight I'm departing on, I have to stand there like an idiot for minutes while the app tries to update the itinerary (hint, I'm travelling so probably don't have Internet). Just load what you have and THEN in the background go ahead and try to update. The only way to make it work is to stay in flight mode."
    ],
    "recentChanges": [
        "We regularly improve performance, fix bugs, and deliver features to help you take better trips. Any major updates will be highlighted for you inside the app."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sabre.tripcase.android&hl=en&gl=us",
    "appId": "com.sabre.tripcase.android"
}