{
    "title": "Quoty - Liste Course et Promos",
    "summary": "Manage your shopping lists and discover the best specials every day",
    "icon": "//lh3.googleusercontent.com/VP6UKcawQxyBaRTWpPqyk3xEBeG2D3ZTLHHeTx-BNXEFmBFxnxKg1j0NnBhyZpJoKvs=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 3.9,
    "reviews": 5817,
    "developer": "La Poste",
    "developerId": "La+Poste",
    "developerEmail": "serviceclients@quoty.fr",
    "developerWebsite": "http://www.quoty.fr",
    "developerAddress": "9 rue du Colonel Pierre Avia\n75015 paris",
    "updated": "November 7, 2017",
    "version": "6.4.7",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "« Quoty se voulait avant tout une application qui condenserait toutes les fonctions les plus pratiques quand on fait ses courses. La Poste vient de la mettre en ligne, et force est de constater que le pari est plutôt réussi.Imaginez une application qui regrouperait toutes vos cartes de fidélité en version numérique, tous vos coupons de réduction, qui vous proposerait d'éditer votre liste de courses, et vous proposerait même des bons plans régulièrement. Telles sont les fonctionnalités de Quoty »  - Radins.comVous en avez assez de toujours oublier d’acheter LE produit qu’il vous manquait lors de vos courses ? Vous voulez profiter des meilleures réductions et avantages sans efforts ? Vous voulez réduire vos dépenses quotidiennes et améliorer votre budget ?Quoty sera alors un incontournable qui vous suivra partout lors de vos courses et vos achats pour réaliser des économies.Vous l’aurez compris, Quoty vous permettra de gérer vos listes de courses mais pas seulement ! L’application offre beaucoup d’autres possibilités !Retrouvez-y aussi :• Les meilleures offres de remboursement, • Tous les bons de réduction, • Des échantillons gratuits, • Les catalogues de vos magasins préférés géolocalisés mis à jour en fonction de l’endroit où vous êtes, pour découvrir les meilleures offres à proximité !• Plus de 1400 cartes de fidélité de magasins partenaires directement dans l’applicationNe vous encombrez plus avec toutes vos cartes de fidélité mais rajoutez-les directement dans l’application pour les avoir toujours à disposition et réaliser des économies ! Retrouvez-y toutes vos enseignes préférées comme Auchan, Carrefour, Casino, Franprix, G20, Leclerc, Monoprix, mais aussi Go Sport, Fnac, Conforama et bien d’autres !L’avantage supplémentaire, c’est que Quoty est très simple d’utilisation :• Repérez les produits, les bons plans, et toutes autres offres dans les catalogues de vos magasins préférées• En un clic, ajoutez les produits, promos, à votre liste en préparant vos courses• Retrouvez de nombreuses offres de remboursement, produits et coupons à imprimer de vos marques favorites• Faites vos achats en magasin en réduisant vos dépenses et en faisant des économies• Sortez votre smartphone et présentez votre carte de fidélité à la caisse• Enfin, photographiez votre ticket de caisse afin d’obtenir votre remboursement en 7 jours seulement !L’application sera donc, grâce à ses réductions, ses coupons, ses catalogues, ses bons plans et ses offres, un assistant tout-en-un pour réduire vos dépenses quotidiennes lors de vos courses.Toutes les fonctionnalités sont disponibles GRATUITEMENT.Retrouvez l’actualité de Quoty sur :Site web : http://www.quoty.fr/ Facebook : http://www.facebook.com/quotyfranceTwitter : http://www.twitter.com/quoty_france",
    "descriptionHTML": "&#xAB; Quoty se voulait avant tout une application qui condenserait toutes les fonctions les plus pratiques quand on fait ses courses. <br>La Poste vient de la mettre en ligne, et force est de constater que le pari est plut&#xF4;t r&#xE9;ussi.<br>Imaginez une application qui regrouperait toutes vos cartes de fid&#xE9;lit&#xE9; en version num&#xE9;rique, tous vos coupons de r&#xE9;duction, qui vous proposerait d&apos;&#xE9;diter votre liste de courses, et vous proposerait m&#xEA;me des bons plans r&#xE9;guli&#xE8;rement. <br>Telles sont les fonctionnalit&#xE9;s de Quoty &#xBB;  - Radins.com<br><br>Vous en avez assez de toujours oublier d&#x2019;acheter LE produit qu&#x2019;il vous manquait lors de vos courses ? Vous voulez profiter des meilleures r&#xE9;ductions et avantages sans efforts ? Vous voulez r&#xE9;duire vos d&#xE9;penses quotidiennes et am&#xE9;liorer votre budget ?<br><br>Quoty sera alors un incontournable qui vous suivra partout lors de vos courses et vos achats pour r&#xE9;aliser des &#xE9;conomies.<br><br>Vous l&#x2019;aurez compris, Quoty vous permettra de g&#xE9;rer vos listes de courses mais pas seulement ! L&#x2019;application offre beaucoup d&#x2019;autres possibilit&#xE9;s !<br><br>Retrouvez-y aussi :<br>&#x2022; Les meilleures offres de remboursement, <br>&#x2022; Tous les bons de r&#xE9;duction, <br>&#x2022; Des &#xE9;chantillons gratuits, <br>&#x2022; Les catalogues de vos magasins pr&#xE9;f&#xE9;r&#xE9;s g&#xE9;olocalis&#xE9;s mis &#xE0; jour en fonction de l&#x2019;endroit o&#xF9; vous &#xEA;tes, pour d&#xE9;couvrir les meilleures offres &#xE0; proximit&#xE9; !<br>&#x2022; Plus de 1400 cartes de fid&#xE9;lit&#xE9; de magasins partenaires directement dans l&#x2019;application<br><br>Ne vous encombrez plus avec toutes vos cartes de fid&#xE9;lit&#xE9; mais rajoutez-les directement dans l&#x2019;application pour les avoir toujours &#xE0; disposition et r&#xE9;aliser des &#xE9;conomies ! Retrouvez-y toutes vos enseignes pr&#xE9;f&#xE9;r&#xE9;es comme Auchan, Carrefour, Casino, Franprix, G20, Leclerc, Monoprix, mais aussi Go Sport, Fnac, Conforama et bien d&#x2019;autres !<br><br>L&#x2019;avantage suppl&#xE9;mentaire, c&#x2019;est que Quoty est tr&#xE8;s simple d&#x2019;utilisation :<br>&#x2022; Rep&#xE9;rez les produits, les bons plans, et toutes autres offres dans les catalogues de vos magasins pr&#xE9;f&#xE9;r&#xE9;es<br>&#x2022; En un clic, ajoutez les produits, promos, &#xE0; votre liste en pr&#xE9;parant vos courses<br>&#x2022; Retrouvez de nombreuses offres de remboursement, produits et coupons &#xE0; imprimer de vos marques favorites<br>&#x2022; Faites vos achats en magasin en r&#xE9;duisant vos d&#xE9;penses et en faisant des &#xE9;conomies<br>&#x2022; Sortez votre smartphone et pr&#xE9;sentez votre carte de fid&#xE9;lit&#xE9; &#xE0; la caisse<br>&#x2022; Enfin, photographiez votre ticket de caisse afin d&#x2019;obtenir votre remboursement en 7 jours seulement !<br><br>L&#x2019;application sera donc, gr&#xE2;ce &#xE0; ses r&#xE9;ductions, ses coupons, ses catalogues, ses bons plans et ses offres, un assistant tout-en-un pour r&#xE9;duire vos d&#xE9;penses quotidiennes lors de vos courses.<br><br>Toutes les fonctionnalit&#xE9;s sont disponibles GRATUITEMENT.<br><br>Retrouvez l&#x2019;actualit&#xE9; de Quoty sur :<br>Site web : http://www.quoty.fr/ <br>Facebook : http://www.facebook.com/quotyfrance<br>Twitter : http://www.twitter.com/quoty_france",
    "histogram": {
        "1": 725,
        "2": 359,
        "3": 600,
        "4": 1466,
        "5": 2667
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/PPuwyX7AJmx_AhPfd39RxDsteY8c4n3Tdd3c5zxdElYNGGdM4aXAraYf2gU8wJA5OfMZ=h310",
        "//lh3.googleusercontent.com/bunYutdNufQgw8X_SPfY66zovSjBpPcI3da2LRMAmi2UccRFv870UsWvFJL0uSmpSUA=h310",
        "//lh3.googleusercontent.com/uZOIQUPc3VP9D7zWfYmjtAsdXA_aFuDXsoaxp9mTdot4aXVxgDI46htKSTCZuSFIJkA=h310",
        "//lh3.googleusercontent.com/iTSV0YHrSRYRMn4zgsNe4BF5ng9o9k_vwuCmNFRt013KG1KcyfLidnMtbLy8h4qEpg=h310",
        "//lh3.googleusercontent.com/8OdvCwFw9dN618Zg2WQo9hnRj4wvdkyvwiuTjMromQ1d9bwxVkwNl_6AVstvBvF5Vw=h310"
    ],
    "video": "https://www.youtube.com/embed/v9QqSDq3e3s",
    "comments": [
        "Trop de pub Toutes ces offres on s'en tamponne. Dommage pour le reste très pratique. Avant je crois ca s'appelait Plan courses. Parfait. Les codeurs l'ont bousillé.",
        "L'application ne marche pas On a fait plusieurs mises à jour cette année, mais l'application ne marche toujours avec Marshmallow!",
        "Migration Comment migrer depuis prixing les cartes de fidelités? J en ai beaucoup et pas le courage de scanner / tapper les cartes a nouveaux",
        "Mise à jour nulle Bonne application jusqu'à ce que tout change, je ne m'y retrouve plus du tout...les images sont nulles, c'était mieux les photos des produits",
        "Misses prices Nice app in general better than others,  comfortable code scanner that's not interrupted by adds,  I erasesd one just for this reason,  but still this app is not complete,  it would be perfect if it included prices of products so consumers can calculate their budget!",
        "Ergonomie bluffante Clairement nettement au dessus de toutes les autres gestions de liste, si vous n'avez pas besoin de partager vos listes. Simple et agréable."
    ],
    "recentChanges": [
        "Correction de bugs"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.agilys.moncaddy&hl=en&gl=us",
    "appId": "com.agilys.moncaddy"
}