{
    "title": "Sportstracklive",
    "summary": "Share, compare, train and compete in your sport on http://sportstracklive.com",
    "icon": "//lh4.ggpht.com/uxcICjvym6Uw-D_awYkKOPmKUhcwm5tOUPo6ohG6ksLIu7cSRFd639dCQx0tHhlMNw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.3,
    "reviews": 3511,
    "developer": "SPORTSTRACKLIVE",
    "developerId": "SPORTSTRACKLIVE",
    "developerEmail": "support@sportstracklive.com",
    "developerWebsite": "http://sportstracklive.com",
    "developerAddress": "SPORTSTRACKLIVE / TOUCOULEUR\nRoute de Bages, F-66450, Pollestres, FRANCE",
    "updated": "April 3, 2015",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Track your training live and beat your personal bests! Millions of activities recorded since 2008.Superior GPS sports tracking and fitness app. For all outdoor (using GPS) and indoor sports (using sensors). For running, cycling, mountain biking, skiing, snowboarding, sailing, biking and indoor gym workouts and fitness classes. The best featured app to record your GPS track and monitor your performance and cardio fitness. TRACK YOUR WORKOUT★ Live tracking and offline recording of all GPS based activities.★ Live tracking and offline recording of sensor based activities using bluetooth, BLE SMART and ANT+ ★ Track speed, distance, heart rate, time, pace, altitude gain/loss and more★ Enter Manual activities based on workout time or details from another deviceTARGET YOUR TRAINING★ Customize speed, pace and heart rate based training plans in the app★ Race previous tracks ★ Receive highly customizable and detailed audio coaching and voice feedbackTRACK WORKOUT HISTORY & PERFORMANCE★ Track workouts on your calender and see your monthly totals★ Use the Activity Summary charts to compare distance, time, speed, pace and calories with previous months or years★ Measure yourself against your annual personal bests for each sport★ Get notified when you beat personal bestsCOMPATIBLE WITH SENSORS AND WATCHES★ Android wear support★ Bluetooth Zephyr HxM and Polar Wearlink BT and Zephyr BioHarness★ Bluetooth low energy SMART heart rate monitors, bike and running sensors★ Polar Wearlink® + transmitter with Bluetooth®★ Polar H7 and Zephyr Hxm SMART★ ANT+ heart rate monitors, bike and running sensorsEXPORT★ Export workouts in GPX, CSV, KML from the websiteFor bluetooth sensors see http://sportstracklive.com/help/heart-rate for more info.For Bluetooth SMART (Bluetooth low-energy) sensors. See http://sportstracklive.com/help/bluetooth-smartThis app is ANT+ certified and supports ANT+ enabled heart rate sensors, footpods and bicycle speed & cadence sensors. Visit http://www.thisisant.com/directory for compatible devices.Email support@sportstracklive.com if you have any problemUse for running, cycling, mountain biking, skiing, snowboarding, sailing, windsurfing, paddle boarding and all outdoor sports using GPS or use sensor only mode for indoor sports such as fitness classes and gym workouts.Help, Feature requests and forum http://getsatisfaction.com/sportstrackliveBlog http://blog.sportstracklive.com",
    "descriptionHTML": "Track your training live and beat your personal bests! <br><br>Millions of activities recorded since 2008.<br><br>Superior GPS sports tracking and fitness app. For all outdoor (using GPS) and indoor sports (using sensors). For running, cycling, mountain biking, skiing, snowboarding, sailing, biking and indoor gym workouts and fitness classes. The best featured app to record your GPS track and monitor your performance and cardio fitness. <br><br>TRACK YOUR WORKOUT<br>&#x2605; Live tracking and offline recording of all GPS based activities.<br>&#x2605; Live tracking and offline recording of sensor based activities using bluetooth, BLE SMART and ANT+ <br>&#x2605; Track speed, distance, heart rate, time, pace, altitude gain/loss and more<br>&#x2605; Enter Manual activities based on workout time or details from another device<br><br>TARGET YOUR TRAINING<br>&#x2605; Customize speed, pace and heart rate based training plans in the app<br>&#x2605; Race previous tracks <br>&#x2605; Receive highly customizable and detailed audio coaching and voice feedback<br><br>TRACK WORKOUT HISTORY &amp; PERFORMANCE<br>&#x2605; Track workouts on your calender and see your monthly totals<br>&#x2605; Use the Activity Summary charts to compare distance, time, speed, pace and calories with previous months or years<br>&#x2605; Measure yourself against your annual personal bests for each sport<br>&#x2605; Get notified when you beat personal bests<br><br>COMPATIBLE WITH SENSORS AND WATCHES<br>&#x2605; Android wear support<br>&#x2605; Bluetooth Zephyr HxM and Polar Wearlink BT and Zephyr BioHarness<br>&#x2605; Bluetooth low energy SMART heart rate monitors, bike and running sensors<br>&#x2605; Polar Wearlink&#xAE; + transmitter with Bluetooth&#xAE;<br>&#x2605; Polar H7 and Zephyr Hxm SMART<br>&#x2605; ANT+ heart rate monitors, bike and running sensors<br><br>EXPORT<br>&#x2605; Export workouts in GPX, CSV, KML from the website<br><br>For bluetooth sensors see http://sportstracklive.com/help/heart-rate for more info.<br><br>For Bluetooth SMART (Bluetooth low-energy) sensors. See http://sportstracklive.com/help/bluetooth-smart<br><br>This app is ANT+ certified and supports ANT+ enabled heart rate sensors, footpods and bicycle speed &amp; cadence sensors. Visit http://www.thisisant.com/directory for compatible devices.<br><br>Email support@sportstracklive.com if you have any problem<br><br>Use for running, cycling, mountain biking, skiing, snowboarding, sailing, windsurfing, paddle boarding and all outdoor sports using GPS or use sensor only mode for indoor sports such as fitness classes and gym workouts.<br><br>Help, Feature requests and forum http://getsatisfaction.com/sportstracklive<br><br>Blog http://blog.sportstracklive.com",
    "histogram": {
        "1": 178,
        "2": 110,
        "3": 309,
        "4": 815,
        "5": 2099
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/NpD9sUdXIKHJwqFCkk_n6xfQ3ki1ex7G2AgVn0ifPsBaZmksl2CKmCS83487XtaA28M=h310",
        "//lh4.ggpht.com/crTPMnH5sj30AIynjoIqfun1OSVWza8x7v4ucFP7Tm_-njYLjgW9KpN5br4bSvukl8A=h310",
        "//lh3.ggpht.com/xXvUWeC3zmp2CB4ix3kSqN2E93s0E9Y6WNprwqFfKBAcUqGRtLlk8fLrhbCLaN-nieA=h310",
        "//lh5.ggpht.com/ndZpRID20pHTsMtwjgeVDNERuJ27wqZvBu8chCwmA_NHkA5k48tRUWp5ZxUw8vYD2dc=h310",
        "//lh4.ggpht.com/O06BGX2Yv1pVPEfsg3albmCh-XAh54n2O55zmie8H8qt943KdDD-Dzha_GZGwaOE-S0=h310",
        "//lh5.ggpht.com/kmOR-3scdwWFJH5_ocjyh_1eOJLMG2m7UPKiagwAddXJUdFW3LtzDMY-GC_a-Q047YY=h310",
        "//lh5.ggpht.com/8VthLFU1xt9oFSWN8AiM4xRnXPYqhrhYZxJec9JaOCtsTPkhgqG1IFzsgoK20dx2OSY=h310",
        "//lh3.ggpht.com/RMekwQXPo0nqLN4ej6IG7UuprO4tYK7B9s-hxPJyxNYNgQQoZgeEoYeTig9FJ35Qqg=h310",
        "//lh3.googleusercontent.com/1idseac4nko2pKo9_If-kTCzOl_m7x7bNBKP_PljpZ6BiQ0st4rnmeeN-VbCgAmTI_0=h310",
        "//lh3.googleusercontent.com/wDhqCO_A5qdZ6clybIEoyFCWpbFGie9UCJXYgul5WxTrxvbj3twil_Db2aM8yyHV958=h310",
        "//lh3.googleusercontent.com/P7avDeVWCJ7Jv-uPSbt2yBgVp7fi3MmPMJ-zP4CHp5UKbdLfNaAy0UFHlzmSQJulemIv=h310",
        "//lh3.googleusercontent.com/5TXZzIGhNIbVOSPSPn4c7pEHWA6ggoCdBBJJtPSuhQiBRF1QXTGAGJhWWc7wBypFXQ=h310",
        "//lh3.googleusercontent.com/i5ymrwPdboep-tkcyKZ2M4u2LXJy2WUm8weMP7ejy-Sd1EYnnx5k8pFnX8sbdltCDuA=h310"
    ],
    "video": "https://www.youtube.com/embed/EHPXH3fU6Ms",
    "comments": [
        "Good one So far the best free app. It has all the set up needed, lacking accuracy for distances as well as altitude...seems that when changing location with a different altitude there is an offset that takes time to happen? The voice does not match with the logged data, still give 5 because it is the best I found.",
        "Excellent app I used to use Endomondo but after buying Ant+ speed and cadence sensor I wasn't able to make it work. With this app I run both BLE HRM and ANT+ Garmin Speed@Cadence sensor and it works well so I brought full version.",
        "GPS live speeds very jumpy and inaccurate Used it today for the first time, and well I was rather impressed but a few problems. The GPS data for speed was up and down constantly. I compared this to a garmin GPS and I was easy 2km/hr fast at live speeds but my average speeds where spot on and th e distance. So nothing wrong with my phone. Perhaps something to look into. Also perhaps atleast a demo version of the full app could be worth it in the long run.",
        "Inaccurate, inconsistent gps reporting. As an example, it indicated I was going 0.0 mph for a distance of .2 miles for 30 minutes, even though an app with the same function had no issues   I changed my gps settings from \"high\" to \"device only,\" restarted the app, uninstalled and reinstalled; no change.  It is totally unreliable. I could work with the app if support would work with me, but support did not respond after I emailed for assistance.  Seems like whoever is responsible doesn't have a clue.",
        "Non existent support Application licensing fails if you change sims when travelling. Does not come back when old sim restored. No response from support ... doesn't exist ?",
        "I am baffled by this app! I set it up as instructed. I enjoyed the gym workout on the elliptical with my Polar Beat bluetooth chest strap on. The app tracked my entire workout and told me every minute the time of the workout, the heart rate, whether it was fat burning, aerobic or anaerobic, and the calories burned. I thought it was great. After the workout, I tried to view it and it wasn't there. There was no workout that I could find. I went to the website and there was nothing. WTF!! It looks like an App, it sounds like an App, but it seems to be Crap. There's no help feature and no customer support. It's a big fat nothing! They talk a good game though!  I guess the bottom line is that the App I used is the \"free\" App, but to get the be paid via PayPal.free app to do what the website says it can do, $5 must must be paid via PayPal. Huh????."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sportstracklive.android.ui.activity.lite&hl=en&gl=us",
    "appId": "com.sportstracklive.android.ui.activity.lite"
}