{
    "title": "Fiets! NL",
    "summary": "Bike! - Plan a fun route and let guide you during your bike ride.",
    "icon": "https://lh3.ggpht.com/O_YEA3sZ_YREShUjDMln11kwZKqanW3jeNwUP-HEOSmcvcrMJUNcZRZZY6a2LApIAfPJ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.4,
    "reviews": 406,
    "developer": "Stoneroos",
    "developerId": "Stoneroos",
    "developerEmail": "stoneroos@stoneroos.com",
    "developerWebsite": "http://www.fietsapp.nl",
    "developerAddress": "Joop van den Endeplein 1\n1217 WJ Hilversum\nNederland",
    "updated": "April 14, 2016",
    "version": "1.8.4",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "Met Fiets! kunt u makkelijk een fietsroute plannen met behulp van het knooppuntennetwerk van Nederland, de route opslaan, delen en als routebegeleider gebruiken tijdens uw fietstocht.Hoe gaat het plannen in zijn werk? Heel simpel: u kiest een startknooppunt en van daaruit plant u een route door de beschikbare knooppunten op de kaart en slaat u de route op. U kunt ook een begin –en eindpunt selecteren en automatisch de kortste route laten berekenen of GRATIS routes van andere Fiets!-app gebruikers ophalen vanaf het Routeplein.Tijdens het fietsen kunt u de Fiets!-app gebruiken als routebegeleider. Selecteer een van de opgeslagen of opgehaalde routes en start de routebegeleiding. Op de kaart kunt u zien waar u zich bevindt en wat het volgende knooppunt is op uw route.U kunt uw eigen fietsroutes ook delen met andere gebruikers van Fiets!. Op www.routeplein.nl verschijnen al deze routes, aangevuld met GRATIS en betaalde routes van geselecteerde partners. Dat maakt Fiets! tot hét platform voor het ontdekken en delen van nieuwe knooppuntroutes. Bekijk alle routes op het Routeplein, zoek een leuke route en haal deze GRATIS op met de Fiets!-app.Fiets! is nu ook beschikbaar op de Pebble smartwatch. Door uw Pebble smartwatch te koppelen aan uw Android toestel, kunt u de belangrijkste functies van de Fiets!-app nu op uw horloge aflezen. Dit is niet alleen handig, maar scheelt ook nog eens batterij van uw telefoon.Fietsen in Vlaanderen? Sinds versie 1.2.0 van Fiets! heet de app Fiets! NL en kunt u alleen gebruik maken van het knooppuntennetwerk in Nederland. Om een fietsroute te plannen met behulp van het knooppuntennetwerk in Vlaanderen download u Fiets! VL. De aparte app voor België bevat alle officiële knooppunten van Vlaanderen, mede mogelijk gemaakt door Toerisme Vlaanderen. Veel fietsplezier! Dit zeggen gebruikers over de Fiets!-app: \"Werkelijk verrassend hoe mooi je eigen omgeving is. Dit merk je pas wanneer je gebruik maakt van deze geweldige app.\" \"Handige app voor topografische nitwit te fiets. Fijn dat je zowel zelf route kunt uitstippelen als het laten doen door 'Fiets'. [...] Verrassend te merken hoeveel verscholen paadjes in ons land zijn aangelegd.\"",
    "descriptionHTML": "Met Fiets! kunt u makkelijk een fietsroute plannen met behulp van het knooppuntennetwerk van Nederland, de route opslaan, delen en als routebegeleider gebruiken tijdens uw fietstocht.<br><br>Hoe gaat het plannen in zijn werk? Heel simpel: u kiest een startknooppunt en van daaruit plant u een route door de beschikbare knooppunten op de kaart en slaat u de route op. U kunt ook een begin &#x2013;en eindpunt selecteren en automatisch de kortste route laten berekenen of GRATIS routes van andere Fiets!-app gebruikers ophalen vanaf het Routeplein.<br><br>Tijdens het fietsen kunt u de Fiets!-app gebruiken als routebegeleider. Selecteer een van de opgeslagen of opgehaalde routes en start de routebegeleiding. Op de kaart kunt u zien waar u zich bevindt en wat het volgende knooppunt is op uw route.<br><br>U kunt uw eigen fietsroutes ook delen met andere gebruikers van Fiets!. Op www.routeplein.nl verschijnen al deze routes, aangevuld met GRATIS en betaalde routes van geselecteerde partners. Dat maakt Fiets! tot h&#xE9;t platform voor het ontdekken en delen van nieuwe knooppuntroutes. Bekijk alle routes op het Routeplein, zoek een leuke route en haal deze GRATIS op met de Fiets!-app.<br><br>Fiets! is nu ook beschikbaar op de Pebble smartwatch. <br>Door uw Pebble smartwatch te koppelen aan uw Android toestel, kunt u de belangrijkste functies van de Fiets!-app nu op uw horloge aflezen. Dit is niet alleen handig, maar scheelt ook nog eens batterij van uw telefoon.<br><br>Fietsen in Vlaanderen? <br>Sinds versie 1.2.0 van Fiets! heet de app Fiets! NL en kunt u alleen gebruik maken van het knooppuntennetwerk in Nederland. Om een fietsroute te plannen met behulp van het knooppuntennetwerk in Vlaanderen download u Fiets! VL. De aparte app voor Belgi&#xEB; bevat alle offici&#xEB;le knooppunten van Vlaanderen, mede mogelijk gemaakt door Toerisme Vlaanderen. <br><br>Veel fietsplezier! <br><br>Dit zeggen gebruikers over de Fiets!-app: <br><br>&quot;Werkelijk verrassend hoe mooi je eigen omgeving is. Dit merk je pas wanneer je gebruik maakt van deze geweldige app.&quot; <br><br>&quot;Handige app voor topografische nitwit te fiets. Fijn dat je zowel zelf route kunt uitstippelen als het laten doen door &apos;Fiets&apos;. [...] Verrassend te merken hoeveel verscholen paadjes in ons land zijn aangelegd.&quot;",
    "histogram": {
        "1": 63,
        "2": 48,
        "3": 58,
        "4": 123,
        "5": 114
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/7zjhej6fmahonu1uDLGZPNGoRsW-vFljWh_00MAPY4Wf-xU8tjeUkT-K_uywJbMrFy8=h310",
        "//lh3.googleusercontent.com/cRiLP9qRQQo1_C7g4IAjAkREjfj3NBelXTRfflOZC-IEC7SyKKPbVrendtTxDd-RwIGx=h310",
        "//lh3.googleusercontent.com/aiXY2I0OrfcwlXG6A-JA-dJEkAMqwfYMQFJz8vdHh8iQCnslpahHwX9lXF5c86xguso=h310",
        "//lh3.googleusercontent.com/TJWbw3jMPTz9629pqF_wogpRfLI2lcAO7vfvWFvzI3HbzopPdF7U8Wmy0_yoJuTMHz4=h310",
        "//lh3.googleusercontent.com/WIUrO-uMwA2O2wihXUTwQcPX0L0hf69ovEC9h99HJAgytIBfbpiLZKq5C4yX76XreqQ=h310",
        "//lh3.googleusercontent.com/hqlQ_9xdR_l56IcIJ83XUd21jn9tKugFjvu3td5tXNY5wi7SKsVoRFTk4CqWA3z7WA=h310",
        "//lh3.googleusercontent.com/UHQIujvbZIDmCJW6ZTNzzXXWNgTOCO-lVuLnSQwVrqdELGVbaWpXyva2YUI4ABVWbMn9=h310",
        "//lh3.googleusercontent.com/rabm37ckHT1BMriRmZ9rwiZDVz6w_8EbGVxVCVbbz2f9_9EPWXt6iffz-dK4xfNfHBs=h310",
        "//lh3.googleusercontent.com/fPmu3zMxWNai6oZwZSSenaC8FoVCNsUJjKlhW_9yvCCBhv6CAY1_9x5X50TJEraYtac=h310",
        "//lh3.googleusercontent.com/wNkg6fEe7TJ4gNsxGCEaUb8LlSAB966AemLTB0qfCvvUxnhGVqb7vehMFVM3panwlk3w=h310",
        "//lh3.googleusercontent.com/cK1xI5fUhYIP6UGsiNQaKq3dXG3mF6FszU6Mv4uS1lS9dkfHAWnKipgTcDase3YfvQ=h310",
        "//lh3.googleusercontent.com/WeLhauniDzJl0QlZ-9r63F1xWUfAqOepf6GQLZMJp5CGMmECeDkx8JT-e9kUrv-kiDM=h310",
        "//lh3.googleusercontent.com/GsG5BFZpZNrYJxg3cjMHTLzm67ve6ul2r6sxrWhwtmMbo7yCwWryTlRCrzhWzAuUVQ=h310",
        "//lh3.googleusercontent.com/Om3mmIpvkJ9zzBovuOx3kDQ58mOBHh5Dv--KkCaA8MKQdZd0iRkWQKhY8f7F-S9DJA=h310",
        "//lh3.googleusercontent.com/kXZmvtWpUaXnxMWtBN-5tzT5fJDgiqZmFbS7djfv3_3rMwxD7Hcwo3essjjXQHtVt5w=h310"
    ],
    "comments": [
        "Stopt regelmatig met werken. Verder werkt pebble integratie niet (stopt met updaten na 20 minuten). Developer gemaild, maar nooit reactie gehad.",
        "Update maakt app minder goed Sinds de meest recente update wordt er een andere plattegrond gebruikt dan voorheen. Deze laadt veel langzamer, maar toont daarentegen minder: het contrast tussen de onderdelen van het landschap is minder goed te zien, en iets basaals als een station zie ik er niet meer tussen staan.",
        "Kaarten laden veel te traag",
        "pep",
        "Mis navigatie op andere Node starten. Zodra je een route hebt gedownload en werkt gaan rijden kun je alleen beginnen bij het eerste knooppunt. Het zou handig zijn als je ook op een ander knooppunt kunt beginnen van de route.",
        "Waardeloos Maarten worden steeds weer geladen... Selecteren van start en eindpunt is niet intuitief en lijkt onmogelijk. Nul sterren"
    ],
    "recentChanges": [
        "Nu ook leuke tips waar u in de zon kunt zitten op het terras of lekker kunt eten!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.stoneroos.android.fiets&hl=en&gl=us",
    "appId": "com.stoneroos.android.fiets"
}