{
    "title": "Movn Exercise Sit Pedometer",
    "summary": "Movn is a smart pedometer that motivates you to stay active and sit less",
    "icon": "//lh6.ggpht.com/h0zjfkoF6p7LdCBzWc_ul2bQfotxlRg5QeaFAo1ui5I3yP7bWonOPKjxPjJX1XpBSX4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.9,
    "reviews": 343,
    "developer": "Moving Analytics",
    "developerId": "Moving+Analytics",
    "developerEmail": "info@movinganalytics.com",
    "developerWebsite": "http://www.movinganalytics.com",
    "updated": "February 3, 2018",
    "version": "0.9.2",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "This information is for the Movn Sit reminder For information about the Movn Cardiac Rehab app, contact us at info@movinganalytics.comGo beyond counting steps with Movn, the intelligent activity tracker with a simple, friendly interface that requires no extra gadgets. Being healthy doesn't have to be about hitting the gym but about small active choices that add up in your day. Sitting is the new smoking. Use Movn to stop yourself from sitting too long and be healthy!Movn empowers you to not only meet but break through your activity goals through encouraging nudges that give you guidance and motivation to stay active. Movn sets smart goals that shift the more you complete them and celebrates all your accomplishments.Movn also lets you create a friend circle where you can share your achievements and motivate each other to be active as well.Movn is the intelligent activity assistant that empowers and grows with you. So let's go beyond counting steps and let's get Movn!App features:--------------------● Automatically track your daily movements when phone is on you● Sit reminders and inactivity sensing. Notifies you to get up when you’ve been sitting too long through a sitting timer● Sends you encouraging nudges throughout the day to boost your mood● No external hardware required and so no losing hardware or damaging it in the washing machine.● Helps you set you set your activity goal and engages you till you achieve it● Gives you a graphical representation of your historical performanceFAQ:----● Is Movn the same as a pedometer?Movn goes beyond what a regular pedometer can do by helping you track active minutes and constantly giving you encouragement to stay active.● Will Movn drain my phone battery?In our tests, Movn consumed <1% of phone battery levels over 24 hours with typical phone usage. We're working hard to reduce battery consumption. We believe that you should control your battery needs, that's why we provide you an explicit on/off button and let you know when Movn records information through the notification icon.● Why did you not calculate steps?We include all forms of movement including steps as active minutes. This includes activities like walking, running, jogging and certain sports. Our goal is to get you moving and not worry about steps. ● Why should I stay active?Performing moderate intensity exercise like walking, running, cycling and jogging for at least 30 minutes a day can reduce your risk for a variety of conditions like diabetes, coronary heart disease, obesity, hypertension, high blood pressure, depression and some forms of cancer. Going to the gym once a day is not enough, it’s important to stay active throughout your day.",
    "descriptionHTML": "This information is for the Movn Sit reminder For information about the Movn Cardiac Rehab app, contact us at info@movinganalytics.com<br>Go beyond counting steps with Movn, the intelligent activity tracker with a simple, friendly interface that requires no extra gadgets. Being healthy doesn&apos;t have to be about hitting the gym but about small active choices that add up in your day. Sitting is the new smoking. Use Movn to stop yourself from sitting too long and be healthy!<br><br>Movn empowers you to not only meet but break through your activity goals through encouraging nudges that give you guidance and motivation to stay active. Movn sets smart goals that shift the more you complete them and celebrates all your accomplishments.<br><br>Movn also lets you create a friend circle where you can share your achievements and motivate each other to be active as well.<br><br>Movn is the intelligent activity assistant that empowers and grows with you. So let&apos;s go beyond counting steps and let&apos;s get Movn!<br><br>App features:<br>--------------------<br>&#x25CF; Automatically track your daily movements when phone is on you<br>&#x25CF; Sit reminders and inactivity sensing. Notifies you to get up when you&#x2019;ve been sitting too long through a sitting timer<br>&#x25CF; Sends you encouraging nudges throughout the day to boost your mood<br>&#x25CF; No external hardware required and so no losing hardware or damaging it in the washing machine.<br>&#x25CF; Helps you set you set your activity goal and engages you till you achieve it<br>&#x25CF; Gives you a graphical representation of your historical performance<br><br>FAQ:<br>----<br>&#x25CF; Is Movn the same as a pedometer?<br>Movn goes beyond what a regular pedometer can do by helping you track active minutes and constantly giving you encouragement to stay active.<br><br>&#x25CF; Will Movn drain my phone battery?<br>In our tests, Movn consumed &lt;1% of phone battery levels over 24 hours with typical phone usage. We&apos;re working hard to reduce battery consumption. We believe that you should control your battery needs, that&apos;s why we provide you an explicit on/off button and let you know when Movn records information through the notification icon.<br><br>&#x25CF; Why did you not calculate steps?<br>We include all forms of movement including steps as active minutes. This includes activities like walking, running, jogging and certain sports. Our goal is to get you moving and not worry about steps. <br><br>&#x25CF; Why should I stay active?<br>Performing moderate intensity exercise like walking, running, cycling and jogging for at least 30 minutes a day can reduce your risk for a variety of conditions like diabetes, coronary heart disease, obesity, hypertension, high blood pressure, depression and some forms of cancer. Going to the gym once a day is not enough, it&#x2019;s important to stay active throughout your day.",
    "histogram": {
        "1": 43,
        "2": 12,
        "3": 44,
        "4": 75,
        "5": 169
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/0O5I66bb-nDpUcXJkiH43GQAnho_rqvsAz0Wml6QhHN9rPkuV5fbir7Ecd84UsCJfcQ=h310",
        "//lh4.ggpht.com/LsontfuVm2m2loMK8dc4gx-j4cPgsQOt4YiK_-JDEAPGRl7WLHH6fw5A-QZtblKcGN4=h310",
        "//lh5.ggpht.com/P8QVnVdWbW691SGV5VzSM9PFJnMKbcY5L9duHlX_X3FSWDzHKOppV5FNbJZxi4kKBAfa=h310",
        "//lh5.ggpht.com/RBsAElbEntb4VBT7P30XwtrrxEXIdmyJg8Ggyj9IPlvRV8p8fyKbS0WX5z79g2u_Za8=h310",
        "//lh3.ggpht.com/47kjN3eA_mC3zZnEBr0siE8gC1mg4SqLlv_7_7IZcgV4-LigFOhqDj1gJwgaop6cWDw=h310"
    ],
    "comments": [
        "Awesome app but... This app is great, my main reason for downloading it was to remind me to get up and move when sitting in the office. However it always has its logo in the notification bar and for that reason I can't give it 5 stars. Really annoying to have it there all the time",
        "Good Reminder, Algorithm? The reminder to move after a certain amount of inactivity is great and the interface is very easy to use.  More than once, though, it has indicated that I hadn't moved for quite a while immediately after doing something that should qualify as moving in my mind, such as going out and playing fetch with the dog, or carrying laundry down and starting a load.  It does catch bigger things, like taking a walk or exercise class, so it makes me wonder what the threshold is.",
        "I like this giving me reminders when I have been sitting around too long at the office, but the actual activity time is not accurate. Many times when commuting to work, I will be on the freeway for a while, hit my exit, and get a congratulations for being active 20 minutes. So, this still does the one thing nothing else in does, and gives me inactivity reminders, and I'll use Google Fit to track my actual steps.",
        "Good app to remind yourself to get up and get movn I like how the app reminds me when I have been inactive for too long. The activity tracking works for me without any issues. The persistent notification is mildly annoying, as noted by many others.",
        "Needs a few more features Great concept but I don't see anywhere to set up when I want it working and when I don't so presumably I need to remember to turn it on and off each day for sleep.  Also my phone's vibrate is really lame so I don't feel it most times.  It needs an option to add sound.  Also agree with everyone else that having the icon at the top all the time is a drag.",
        "Great idea Great idea, but having used it for a few days I'm not sure about the accuracy. I went for a good 50min walk and it only logged 15 min, my partners logged 40min which is closer but still off. Think it tracks bits of my car journeys too? I like the concept, the design and it's really simple to use but think it needs some work on accuracy."
    ],
    "recentChanges": [
        "Bug fix and driving detection."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.movinganalytics.couchpotato&hl=en&gl=us",
    "appId": "com.movinganalytics.couchpotato"
}