{
    "title": "Cinnamon Grocery Shopping List",
    "summary": "Improve your grocery shopping and grocery list building experience today!",
    "icon": "//lh3.googleusercontent.com/AoNNBeQTIOeAnoUkuWhtAnXbGikpxa1QqwFcmSyQ51DjaBP-K5iU-3b-nbCuaGG6Ur4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 757,
    "developer": "Gary Wong",
    "developerId": "Gary+Wong",
    "developerEmail": "mail@cinnamonlist.com",
    "developerWebsite": "http://xgary.github.io/Cinnamon/privacy.html",
    "developerAddress": "3403 23rd Avenue East\nVancouver, Canada\nV5R 1C1",
    "updated": "March 14, 2017",
    "version": "1.5.9",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "Cinnamon is a beautiful and efficient grocery shopping list app. Cinnamon has features that are guaranteed to improve your grocery shopping and grocery list building experience. Here are some amazing features that make that possible:• Sync and share your shopping list with others. Shopping lists sync within mere seconds of each other.• Bundles allow you to group multiple grocery items together and add them to your grocery list all at once. Create a Bundle for your weekly grocery staples, create a Bundle for all the ingredients you need for a recipe, the power is in your hands.• Keep track of what you already have and never buy the same item twice. Purchased items are automatically sent to your Pantry. Once you've used up an item in your Pantry, you can send it back to your shopping list with a single swipe.• The \"Next Time\" feature is a section in addition to your Buy List and Cart. You can send items there that you have decided to buy the Next Time (out of stock, too expensive, etc) so that you only keep items that you need to buy in your shopping list. The items will be sent back to your shopping list on your next shopping trip. (Enable this feature in Settings)• Add items to your grocery list via barcode scanning or voice recognition. • Organize your grocery list by using the predefined categories or create your own.• Sort your grocery list anyway you like.• Keep track of the total price of all the items in your shopping cart.• You can enter the amount and unit of the grocery item directly when adding.• Automatic unit conversions.• Android Wear smartwatch support.• And many more for you to discover on your own!",
    "descriptionHTML": "Cinnamon is a beautiful and efficient grocery shopping list app. Cinnamon has features that are guaranteed to improve your grocery shopping and grocery list building experience. Here are some amazing features that make that possible:<br><br>&#x2022; Sync and share your shopping list with others. Shopping lists sync within mere seconds of each other.<br><br>&#x2022; Bundles allow you to group multiple grocery items together and add them to your grocery list all at once. Create a Bundle for your weekly grocery staples, create a Bundle for all the ingredients you need for a recipe, the power is in your hands.<br><br>&#x2022; Keep track of what you already have and never buy the same item twice. Purchased items are automatically sent to your Pantry. Once you&apos;ve used up an item in your Pantry, you can send it back to your shopping list with a single swipe.<br><br>&#x2022; The &quot;Next Time&quot; feature is a section in addition to your Buy List and Cart. You can send items there that you have decided to buy the Next Time (out of stock, too expensive, etc) so that you only keep items that you need to buy in your shopping list. The items will be sent back to your shopping list on your next shopping trip. (Enable this feature in Settings)<br><br>&#x2022; Add items to your grocery list via barcode scanning or voice recognition. <br><br>&#x2022; Organize your grocery list by using the predefined categories or create your own.<br><br>&#x2022; Sort your grocery list anyway you like.<br><br>&#x2022; Keep track of the total price of all the items in your shopping cart.<br><br>&#x2022; You can enter the amount and unit of the grocery item directly when adding.<br><br>&#x2022; Automatic unit conversions.<br><br>&#x2022; Android Wear smartwatch support.<br><br>&#x2022; And many more for you to discover on your own!",
    "histogram": {
        "1": 31,
        "2": 22,
        "3": 53,
        "4": 164,
        "5": 487
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/pk8p0AkkrEJsI258ZPiiKDtiEbIy28e4myFgO3niKK_upvxTDZi7awBycagfHTijyA=h310",
        "//lh3.googleusercontent.com/PhVF7s-6RhM6-vrTYRdolBKk_dwy_qaW5hvGkbTglNEcrbdl7A66VXpDsizuqNIed5s=h310",
        "//lh3.googleusercontent.com/bu7uU34d_-Ezn1gx333bzOJk7N_fph0Qzf5T1xxmVLO-eCJGjye8HCWQNBcVVIa0Mn1m=h310",
        "//lh3.googleusercontent.com/pAhu9POwseTJOJkwvznrSdb0Tyo-0GOnixhEHmryDuX8WlxHI4mzOAgvw2-Lv1GSRDw=h310",
        "//lh3.googleusercontent.com/PZ7fMH_Ksqye3ta7srjsuk9hIIHleZ1rQI6YmjEgJsvj6Giv68o49092QMQbK7xpaA=h310",
        "//lh3.googleusercontent.com/OD0YdS5j4pgLKmtvPRxmE2A2JhRw_Q8WnxUUUlRFWo_4pXnilve0timHMMqh3gn5r9g=h310",
        "//lh3.googleusercontent.com/57m6iEvrmxEMTZP5PBAfIV4EAsOCpQZtbYYcGBV1sCwnYXoqdRNnzbZM10Pr_1DFBw=h310",
        "//lh3.googleusercontent.com/C0NtIYNe_NwZKashJa_9tbXB1n4WTLck4-EnhOpg9pJKtRmF96l-QJveHSI16-EIQPZv=h310"
    ],
    "comments": [
        "Spouse and I were using an alternate app for a few years. Due to lack of expressed wants from customers and improvements from that one, we moved to this app. Cinnamon is very impressive. Highly customizable and has many of the features we were looking for.  Only thing I would like to see in the future builds would be a user guide within that features tips on ease of use.  A web browser interface option for our account would be awesome too.  Well done to the developer.",
        "This app has been very helpful! When shopping I use it every time due to its ease of use, intuitive user interface, and overall great way to make a list and know what's what. I used Google Keep for a shopping list before this, but Cinnamon has blown Keep out of the water. Love it.",
        "I've tried a few different grocery/pantry apps and didn't like them for one reason or another (seems often they either make things overly complicated or they don't allow for ENOUGH detail). This one, however, seems very intuitive and easy to use with just enough features that I don't get option-overload. Also has a very lovely UI!",
        "Love this app - tried lots of lists and this is by far the most convenient and beautiful. Would love an option to have price for each individual item show up in buy list so I can compare without having to click on it (unless I'm just missing that option!)",
        "This is the best shopping list app out there. I have tried all of them but they do not have the features I wanted. I cannot tell you how much I love this app. When I plan a shopping trip I always use this app and I use it to keep inventory of my household items. Gary, please keep this app going with updates! You made an amazing one.",
        "I love this app. Simple to use, allows me to keep a record of my pantry, which in turn means that I no longer buy a jar of cinnamon when I already have two in the cupboard! Lot less food waste as a result too. This app saves me money."
    ],
    "recentChanges": [
        "v1.5.9",
        "• Added Privacy Policy",
        "v1.5.7",
        "• Fixed issue with login page",
        "v1.5.6",
        "• Minor visual tweaks",
        "v1.5.5",
        "• Fixed bug with deletes made during logged off not syncing to cloud when logging on.",
        "v1.5.4",
        "• Fixed popup window opening off-screen.",
        "v1.5.3",
        "• Added Icelandic and Romania translations",
        "• Fixed incorrect Swedish translation in Pantry."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.imdevgary.cinnamon&hl=en&gl=us",
    "appId": "com.imdevgary.cinnamon"
}