{
    "title": "Find My Phone - Android Wear",
    "summary": "Instant Notification when you loose your device and ability to ring device",
    "icon": "//lh6.ggpht.com/NQR8F0sHhbzLAIN64AYUsM3KgpA57EE-vKYnEwHO1Bk0xtaldrS24lwOsBd2YLkwE9s=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 50,
    "maxInstalls": 100,
    "score": 3,
    "reviews": 2,
    "developer": "mades",
    "developerId": "mades",
    "developerEmail": "6061171@gmail.com",
    "developerAddress": "1441 e wilson ave\nGlendale, CA 91206",
    "updated": "March 10, 2015",
    "version": "1.0",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "!!**!! NOTE !!**!! This is the only app that will notify you as soon as you go out of contact with your DEVICE. Meaning if you forget your phone your watch will vibrate as soon as contact is breached so you will never have the issue of leaving the house, your work, restaurant and leaving your phone behind. Cant find your phone ? No problem. Click on Ring Alarm on your watch and you'll find your phone in no time. You can activate the app on your watch by going to start and clicking on Find My phone or speaking \" start find my phone \"  Once our android wear app \" find my phone \" is open simply click on start alarm and wait to hear your phone's alarm go off. Once you find your phone simply click on stop alarm on your android watch. To change what alarm sound is made when app is activated open the find my phone app on your mobile device and there you will see a list of sound files. Our Android wear app \" find my phone \" will bring up all your sound files even mp3 files, giving you the user the choice of picking what sound you want to hear when looking for your phone. If you prefer to use the same sound as your default alarm sound then simply select the top option \" Default \"and our app will use whatever you selected as your alarm sound. *Note* We have put the alarm sound on an endless loop to make sure you are able to hear the alarm as long as your looking for your phone. This is done as some or most apps on the market auto stop the sound and the user would have to go back to the app on their watch and activate the alarm. We found this to be not efficient so we made sure our users can find their phone with just one click. Please submit all suggestions and comments via contact developer options and we will work very hard to add your favorite options or make any changes to make our app your most favorite android wear app on the market.",
    "descriptionHTML": "!!**!! NOTE !!**!! This is the only app that will notify you as soon as you go out of contact with your <br>DEVICE. Meaning if you forget your phone your watch will vibrate as soon as contact is breached so you will <br>never have the issue of leaving the house, your work, restaurant and leaving your phone behind. <br>Cant find your phone ? No problem. <br>Click on Ring Alarm on your watch and you&apos;ll find your phone in no time. <br>You can activate the app on your watch by going to start and clicking on <br>Find My phone or speaking &quot; start find my phone &quot;  <br>Once our android wear app &quot; find my phone &quot; is open simply click on <br>start alarm and wait to hear your phone&apos;s alarm go off. Once you find your phone simply click <br>on stop alarm on your android watch. <br><br>To change what alarm sound is made when app is activated open the <br>find my phone app on your mobile device and there you will see a list of <br>sound files. <br>Our Android wear app &quot; find my phone &quot; will bring up all your sound files even mp3 files, <br>giving you the user the choice of picking what sound you want to hear when looking for your <br>phone. <br>If you prefer to use the same sound as your default alarm sound then simply select the top option &quot; Default &quot;<br>and our app will use whatever you selected as your alarm sound. <br><br>*Note* <br>We have put the alarm sound on an endless loop to make sure you are able to hear the alarm as long as your looking for your phone. This is done as some or most apps on the market auto stop the sound and the user would have to go back to the app on their watch and activate the alarm. We found this to be not efficient so we made sure our users can find their phone with just one click. <br><br>Please submit all suggestions and comments via contact developer options and we will work very hard to add your favorite options or make any changes to make our app your most favorite android wear app on the market.",
    "histogram": {
        "1": 1,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/ebsd9MTDpRNjJR0oCEpk-YP_Ws9jPBM3Q7lMj0acZoI7mEMwYQoKMt3JvCGqfAZb-A=h310",
        "//lh3.ggpht.com/-6IkP6XC5e54x15jVkDZ7FwRQQ05jSNFpAnm7cw3vOiFc9DZR8ZdlQBoIu5Nyjq5-hSa=h310",
        "//lh5.ggpht.com/083z9kONRsppeT00Wo_SMqEx-ELCncVnINCKNPIxfHC_WeaEOoikpCQM29CIGTC27iI=h310",
        "//lh4.ggpht.com/pmZaob_mTmdbWdzqZdZoC-LKv2rPL3vcVCGHyEYEDlx8ZmIVmNdBCGDEcDoRMOcxWK_7=h310",
        "//lh4.ggpht.com/F9K1EXF6NZP-4S1x7vO2y2VybhPBJvEvkKNguCkBwjO7_AlYt5SxDUERjek6yguPaw=h310",
        "//lh4.ggpht.com/yZ4cvHxebLXLjN_YnA68_nEw0R-SE5aW21d1YUGC6r6Lr2MTgV61Qfd__uOrppA2bhhU=h310",
        "//lh5.ggpht.com/cp0nsvnc_JXKjBs7W7JkKuLY9CeJT0zqBaQe-UCBSWqhrRKJ06IIA0EIe5oitEDrv_U=h310",
        "//lh6.ggpht.com/OVo-cmmneuneFnr2QUbM8tJvTb8Cy8nTXAEIHp2mgXwK_LYCTdeogndEfyxv3M7kTsLv=h310",
        "//lh4.ggpht.com/fdh76gJMXv6n_sC9iZvCRXMO3FdVWyVa_VJRMnQQw59BuQHm7KMqNRjBuyLmjV2JpbU=h310"
    ],
    "comments": [],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.vick.wearable.findphone&hl=en&gl=us",
    "appId": "com.vick.wearable.findphone"
}