{
    "title": "Fred Meyer",
    "summary": "Save with Fred Meyer! Coupons, ads, rewards &amp; shopping list in one app!",
    "icon": "//lh6.ggpht.com/qa6WN70_N7noTRg08nuDHCILhHdssV6abJJZuMJwA3td2R94KGFpERxYyticoW91oIY5=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4,
    "reviews": 2657,
    "developer": "The Kroger Co.",
    "developerId": "The+Kroger+Co.",
    "developerEmail": "android.support@kroger.com",
    "developerWebsite": "http://www.fredmeyer.com",
    "updated": "February 22, 2018",
    "version": "13.5.2",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "Looking for a faster, easier, more rewarding shopping experience? Save time and money with the Fred Meyer app! It puts convenience, savings and rewards at your fingertips. Simply download the app, create an account and register your Fred Meyer Shopper’s Card to access all these great benefits:- Shop ClickList® curbside pickup or delivery right from the app!- Easily build your online shopping list, and use it to shop in-store or to place your ClickList® order.- View your Weekly Ads and quickly add sale items or specials to your shopping list.- Load digital coupons directly to your Shopper’s Card and use them to save on items from your shopping list.- Get even more savings when you choose items from our Smart Suggest feature.- Refill your Fred Meyer Pharmacy prescriptions directly from your phone or tablet. Just type in your prescription number, select your Pharmacy and schedule a convenient pickup time.- Check your fuel points.- Use our locator to find the closest Fred Meyer store or fuel center.- View your purchase history. Use it to create standard orders that will save you time.- Save BIG with exclusive promotions, personalized offers and bonus rewards.To use the Fred Meyer app, you'll need a Fred Meyer digital account. You can register for your account and link your Shopper’s Card through the app. If you don't have a Shopper’s Card, you can create one when you register to access all of these savings and rewards!",
    "descriptionHTML": "Looking for a faster, easier, more rewarding shopping experience? Save time and money with the Fred Meyer app! It puts convenience, savings and rewards at your fingertips. Simply download the app, create an account and register your Fred Meyer Shopper&#x2019;s Card to access all these great benefits:<br><br>- Shop ClickList&#xAE; curbside pickup or delivery right from the app!<br><br>- Easily build your online shopping list, and use it to shop in-store or to place your ClickList&#xAE; order.<br><br>- View your Weekly Ads and quickly add sale items or specials to your shopping list.<br><br>- Load digital coupons directly to your Shopper&#x2019;s Card and use them to save on items from your shopping list.<br><br>- Get even more savings when you choose items from our Smart Suggest feature.<br><br>- Refill your Fred Meyer Pharmacy prescriptions directly from your phone or tablet. Just type in your prescription number, select your Pharmacy and schedule a convenient pickup time.<br><br>- Check your fuel points.<br><br>- Use our locator to find the closest Fred Meyer store or fuel center.<br><br>- View your purchase history. Use it to create standard orders that will save you time.<br><br>- Save BIG with exclusive promotions, personalized offers and bonus rewards.<br><br>To use the Fred Meyer app, you&apos;ll need a Fred Meyer digital account. You can register for your account and link your Shopper&#x2019;s Card through the app. If you don&apos;t have a Shopper&#x2019;s Card, you can create one when you register to access all of these savings and rewards!",
    "histogram": {
        "1": 248,
        "2": 162,
        "3": 322,
        "4": 610,
        "5": 1315
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Nsy3WwoqraZroIbcsr7_8al-RhzYuPjDM0lvWKTsq9VKmR6aURDEBwvIgrGyNcbjVA=h310",
        "//lh3.googleusercontent.com/vfSI26DDgYp39O9u_ZyksiGYaUyxQqVCgChAYSVYEtHkFx1doW7c0Ywp5m1tZGqOwDY=h310",
        "//lh3.googleusercontent.com/ZiRH600Vw_yKAfD9zfgYFDY3dp22PRjKDG8QoPs0YwV2jUwnIRoVTJ1xHB_vOu3zkIBJ=h310",
        "//lh3.googleusercontent.com/4lrw6saITdeKRpWQskMgLrnfE8Ykqy6NM0uQ8Rk3bF1vh3AJxFXHfulKBkFp3fJxWGz3=h310",
        "//lh3.googleusercontent.com/JEmlJG7-kI9arUnJgNKyO886axdtHM0qIwGmLPvp0t01Ge1399TbjLNNWaK1xurY3A=h310",
        "//lh3.googleusercontent.com/PymAVlcWh4JmU0OHC0PURBWXAJfdBPts0H2HtPH-9-Iz4hQ8Yp_UEGiIMw1bJSPPg2A=h310",
        "//lh3.googleusercontent.com/vC2-wzYF4qsRvGuB8hDQaEkUiTCz1piBVyXZli8w0GAnFzPbguSKpCPvDAgAjNmKQQ=h310",
        "//lh3.googleusercontent.com/RmKL8_tC12NSzIG0usrAo3ROMWBlmiukbzVDrUa1zcqhQ7ZHZXEVh09BTEgSvn1yHB_V=h310",
        "//lh3.googleusercontent.com/dZEz90xKaphlyING-u6ZNL_9yt8fOiYOUIkG5EcNESKJKxj-2b2bqdN4S8sCxB36Wxg=h310",
        "//lh3.googleusercontent.com/v72SxENYA7JJAf7UNC6FiEYsezXENGT0Tp8gSV9xPUcgVvi-lJGLRzStggqBagctxusl=h310",
        "//lh3.googleusercontent.com/jXchjDVaW4JxCueFHvvA_T35RfwxCJjs-F3qihnZTKaLW-M7VstALXxbPZf3kHB13Oo=h310",
        "//lh3.googleusercontent.com/cVl67zjh7p5gY9A5vrC1lFfGJcMn3d3w2bHP5gn__F3MNpNVB40kOOAI_MwvSp0v5kM=h310"
    ],
    "comments": [
        "Why can't we scan paper coupons to the app? Has a Print View but you can't print coupons. Huh? Filters don't work. Even with the Clicklist stuff unchecked in filters it still shows up in the coupon list. Now we have to wade through all the coupons that are ONLY for Clicklist. (Only 8 people on the planet are interested in clicklist so why do we have all those coupons interspersed with regular coupons?). A complete waste of time.",
        "Not impressed with forcing me with check list coupons. Wish I could turn them off. Not interested in someone doing my shopping. Pass on the savings for me actually coming to your store, giving you my time to shop and buy products. How can it be cheaper to pay someone to shop for me?",
        "This is the most tedious way to put together a list of items for purchase.  It would take less time to just go to the store and wander the aisles. If it is changed to include a shop by department or aisle, it would help. I like being able to see the weekly add in either list or print view. But there's so many items you miss when looking only at sale items.",
        "Would be better if I could view the whole ad in print view. The very bottom section is cut off from view.",
        "If we could sort the coupons that we have loaded onto the card it would help a lot. I have to scroll through the entire list when I'm shopping just to see what I have and it takes forever. Or a search option in the coupons would be very helpful",
        "I injoy my one STOP shopping and the friendly People that work there very helpful ALWAY'S Thank You"
    ],
    "recentChanges": [
        "Great news! 13.5 of the app is now available for download. We’ve added new features and enhancements to make your mobile experience even better!",
        "• View your pending ClickList® orders",
        "• Cancel your pending ClickList® orders",
        "• Receive push notifications for your ClickList® orders",
        "• Improved search functionality",
        "• Nutritional info added to products",
        "• Product descriptions",
        "• Print your Cart or Shopping Lists directly from the app",
        "Plus some minor bug fixes and other great enhancements!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.fredmeyer.mobile&hl=en&gl=us",
    "appId": "com.fredmeyer.mobile"
}