{
    "title": "X Factor 2017",
    "summary": "Follow X Factor with the new App in quickly and easily, whenever you want!",
    "icon": "//lh3.googleusercontent.com/ySiVHETWbPH-HIKY98WPxzAIQPsKs8q0po9rMggQpqZtCQo5mA6062UC6p8Y7QM7iw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4,
    "reviews": 7954,
    "developer": "Sky Italia S.r.l.",
    "developerId": "Sky+Italia+S.r.l.",
    "developerEmail": "mobile@skytv.it",
    "developerWebsite": "http://xfactor.sky.it/",
    "developerAddress": "Via Monte Penice, 7\n20138 Milano",
    "updated": "December 11, 2017",
    "version": "11.4.1",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "description": "X Factor  2017#XF11: Il coraggio di lanciarsi!Scopri tutte le novità di questa edizione, sempre più sorprendente ed emozionante, in onda in esclusiva su Sky Uno HD, dal 14 settembre 2017.Scarica gratis l’App ufficiale X FACTOR 2017 per smartphone e tablet Android e accedi ogni volta che vuoi! Per te tanti contenuti interattivi e coinvolgenti man mano che ci si avvicinerà al Live Show a partire dalle conferme e novità della frizzante giuria composta da: Mara Maionchi, Manuel Agnelli, Levante e Fedez.Accedi ai contenuti dell'App e scopri le anticipazioni della prossima edizione attraverso un nuovo DOPPIO MENU che ti permetterà di immergerti nel SOUND di XF: da SOUND TUNED accedi a tutte le curiosità del Format e da SOUND ACTIVE vivrai lo Show con il massimo del coinvolgimento.Sii curioso e sempre aggiornato attraverso le seguenti sezioni:•\tNEWS: notizie, appuntamenti, curiosità, indiscrezioni e tanto altro legate al      programma•\tVIDEO: clip video dei momenti più coinvolgenti•\tFOTO: fotogallery che ritraggono le situazioni più appassionanti e divertenti•\tXF SOCIAL: partecipa con il tuo account Twitter tramite #XF11•\tCAST: accedi al profilo dei giudici e del conduttore e interagisci con il loro account Twitter •\tRADIOLUTION: in collaborazione con RTL, potrai ascoltare i migliori brani che hanno segnato la storia di X Factor attraverso il canale radio XF Story.  A partire dal Live si aggiungerà il canale radio, XF On Air(2), che ti permetterà di ascoltare tutti i brani cantati dai concorrenti durate la gara e di seguire il palinsesto radiofonico di RTL dedicato a #XF11.•\tXF TOUR: anche in questa edizione potrai metterti alla prova con un gaming che ti permetterà di guadagnare punti, scalare la classifica e vincere i biglietti per partecipare al Live Show, come pubblico, e a fantastici premi finali. Giocando potrai vivere un’esperienza immersiva percorrendo virtualmente tutte le tappe di XF e vivendo la stessa esperienza che hanno vissuto i concorrenti di #XF11 dal primo casting fino alla Finale. •\tTALENTI(1): sezione che ti permette di scoprire i concorrenti in gara •\tWHATS HOT(2): accedi ai contenuti più interessanti scelti per te! •\tXF CLUP(2):  per tutti i veri fan di X Factor abbiamo il nuovo APPLAUSOMETRO rinnovato graficamente  e pronto ad essere usato da chi vuole far sentire il proprio SOUND!•\tXF CHANNEL(2):  accedi ai video clip memorabili delle precedenti edizioni A partire dal Live solo tu potrai agire davvero sull’esito della gara grazie ai tuoi voti. Fai Login, accedi alla sezione VOTO(2) durante il Live, esprimi le tue preferenze e porta alla vittoria il tuo talento preferito. Potrai votare anche da Smart Watch.Anche quest’anno ci sarà un altro momento importante in cui le tue azioni saranno decisive. Verrà data un’altra occasione a coloro che hanno percorso la dura strada delle selezioni, ma non sono riusciti ad essere tra i 12 finalisti. Tanti ci hanno appassionato e coinvolto in questi ultimi anni e adesso è arrivato il loro momento. Segui Xtra Factor e potrai votarli durante un momento speciale riservato a loro: Strafactor! Accedi a VOTO XTRA(2) quando sarà il loro momento e vota il tuo preferito fino a farlo esibire sul palco della Finale di X Factor!Per la puntata finale avrai, ancora una volta, la possibilità di vedere le performance dei concorrenti sul palco di X Factor a 360°, in real time, e scegliere ‘il punto di vista’ che preferisci grazie alla sezione XF A 360°(3). Dopo La Finale potrai continuare a vedere le performance dei finalisti e degli ospiti ogni volta che vuoi sempre in modalità 360°.X Factor, basato sul format \"The X Factor\" realizzato per Sky da FremantleMedia Italia.X Factor is a registered trademark of FremantleMedia Limited and Simco Limited. Licensed by FremantleMedia Limited www.fremantlemedia.com(1) Funzionalità disponibile dal 20/10/2017(2) Funzionalità disponibili dal Live, 26/10/2017(3) Funzionalità disponibile dal 14/12/2017",
    "descriptionHTML": "X Factor  2017<br><br>#XF11: Il coraggio di lanciarsi!<br><br>Scopri tutte le novit&#xE0; di questa edizione, sempre pi&#xF9; sorprendente ed emozionante, in onda in esclusiva su Sky Uno HD, dal 14 settembre 2017.<br><br>Scarica gratis l&#x2019;App ufficiale X FACTOR 2017 per smartphone e tablet Android e accedi ogni volta che vuoi! <br><br>Per te tanti contenuti interattivi e coinvolgenti man mano che ci si avviciner&#xE0; al Live Show a partire dalle conferme e novit&#xE0; della frizzante giuria composta da: Mara Maionchi, Manuel Agnelli, Levante e Fedez.<br><br>Accedi ai contenuti dell&apos;App e scopri le anticipazioni della prossima edizione attraverso un nuovo DOPPIO MENU che ti permetter&#xE0; di immergerti nel SOUND di XF: da SOUND TUNED accedi a tutte le curiosit&#xE0; del Format e da SOUND ACTIVE vivrai lo Show con il massimo del coinvolgimento.<br><br>Sii curioso e sempre aggiornato attraverso le seguenti sezioni:<br><br>&#x2022;\tNEWS: notizie, appuntamenti, curiosit&#xE0;, indiscrezioni e tanto altro legate al      programma<br>&#x2022;\tVIDEO: clip video dei momenti pi&#xF9; coinvolgenti<br>&#x2022;\tFOTO: fotogallery che ritraggono le situazioni pi&#xF9; appassionanti e divertenti<br>&#x2022;\tXF SOCIAL: partecipa con il tuo account Twitter tramite #XF11<br>&#x2022;\tCAST: accedi al profilo dei giudici e del conduttore e interagisci con il loro account Twitter <br>&#x2022;\tRADIOLUTION: in collaborazione con RTL, potrai ascoltare i migliori brani che hanno segnato la storia di X Factor attraverso il canale radio XF Story.  A partire dal Live si aggiunger&#xE0; il canale radio, XF On Air(2), che ti permetter&#xE0; di ascoltare tutti i brani cantati dai concorrenti durate la gara e di seguire il palinsesto radiofonico di RTL dedicato a #XF11.<br>&#x2022;\tXF TOUR: anche in questa edizione potrai metterti alla prova con un gaming che ti permetter&#xE0; di guadagnare punti, scalare la classifica e vincere i biglietti per partecipare al Live Show, come pubblico, e a fantastici premi finali. Giocando potrai vivere un&#x2019;esperienza immersiva percorrendo virtualmente tutte le tappe di XF e vivendo la stessa esperienza che hanno vissuto i concorrenti di #XF11 dal primo casting fino alla Finale. <br>&#x2022;\tTALENTI(1): sezione che ti permette di scoprire i concorrenti in gara <br>&#x2022;\tWHATS HOT(2): accedi ai contenuti pi&#xF9; interessanti scelti per te! <br>&#x2022;\tXF CLUP(2):  per tutti i veri fan di X Factor abbiamo il nuovo APPLAUSOMETRO rinnovato graficamente  e pronto ad essere usato da chi vuole far sentire il proprio SOUND!<br>&#x2022;\tXF CHANNEL(2):  accedi ai video clip memorabili delle precedenti edizioni <br><br>A partire dal Live solo tu potrai agire davvero sull&#x2019;esito della gara grazie ai tuoi voti. Fai Login, accedi alla sezione VOTO(2) durante il Live, esprimi le tue preferenze e porta alla vittoria il tuo talento preferito. Potrai votare anche da Smart Watch.<br><br>Anche quest&#x2019;anno ci sar&#xE0; un altro momento importante in cui le tue azioni saranno decisive. Verr&#xE0; data un&#x2019;altra occasione a coloro che hanno percorso la dura strada delle selezioni, ma non sono riusciti ad essere tra i 12 finalisti. Tanti ci hanno appassionato e coinvolto in questi ultimi anni e adesso &#xE8; arrivato il loro momento. Segui Xtra Factor e potrai votarli durante un momento speciale riservato a loro: Strafactor! Accedi a VOTO XTRA(2) quando sar&#xE0; il loro momento e vota il tuo preferito fino a farlo esibire sul palco della Finale di X Factor!<br><br>Per la puntata finale avrai, ancora una volta, la possibilit&#xE0; di vedere le performance dei concorrenti sul palco di X Factor a 360&#xB0;, in real time, e scegliere &#x2018;il punto di vista&#x2019; che preferisci grazie alla sezione XF A 360&#xB0;(3). Dopo La Finale potrai continuare a vedere le performance dei finalisti e degli ospiti ogni volta che vuoi sempre in modalit&#xE0; 360&#xB0;.<br><br>X Factor, basato sul format &quot;The X Factor&quot; realizzato per Sky da FremantleMedia Italia.<br>X Factor is a registered trademark of FremantleMedia Limited and Simco Limited. Licensed by FremantleMedia Limited www.fremantlemedia.com<br><br>(1) Funzionalit&#xE0; disponibile dal 20/10/2017<br>(2) Funzionalit&#xE0; disponibili dal Live, 26/10/2017<br>(3) Funzionalit&#xE0; disponibile dal 14/12/2017",
    "histogram": {
        "1": 988,
        "2": 373,
        "3": 626,
        "4": 1338,
        "5": 4629
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/-TeYkYRVBJinQspqxw1IARUdRDylGVFgtP_jn3vhGRTbRv3vb3pXPZEbZub9-fD5Bw=h310",
        "//lh3.googleusercontent.com/q_6fDRqrhkjVHokNSX4KMy-J6XOr0Fk0uuOdIux_zA2KA4tj8xse2iZTYPSlrxITeWM=h310",
        "//lh3.googleusercontent.com/QCOQPnnBdrXQlCQl9Zz68aW8Zd3V7l2nfZliZtBW9rRxVlVUnZ9d2voqQgP2TvjAaQA=h310",
        "//lh3.googleusercontent.com/rgnguPXkafBQjQ5pNpf9v383Qp5LEwrjbf78UoMdWdRQWl4JtiZwvaYRhAh70974J1I=h310",
        "//lh3.googleusercontent.com/asKuAlguQMr8oyKiM6uBaTbBJ_-_4qT7XwQCL38ZYky05-l1e5o_qX9DZDYgGIksZuo=h310",
        "//lh3.googleusercontent.com/_wGAJy35f4zhLzPpk4QB3f3_epzd1h9iwuagXnXNCFTz1dfRLU4SqBjjeTjGaOa5b1U=h310",
        "//lh3.googleusercontent.com/rLY7PyI39UiOmCCoDRZaQcSjgaQ3V8xyHdH45ZiBcmKi93_yzXY9LHgfAiuqSjL9cJM=h310",
        "//lh3.googleusercontent.com/tgdAcep7mMFTsZraNeAGMjchA4y93PaMWh_jwvv6HuURmBpS3HacaLDGWa6Ht_bh4q1G=h310",
        "//lh3.googleusercontent.com/S4O5vaEDiFC4UnX6LYjhK5aWndYuxQUqcH4wnSfzKLzomqJ3AmKW94hJF58QxxJWlvU=h310",
        "//lh3.googleusercontent.com/_PY4eA_FT6an8SfEF1tYAJWRLg2V124bbC9BMzDa4YDbjxhohWVc7MGcS_zfiL61pA=h310",
        "//lh3.googleusercontent.com/tAdaihb0bMHsrwLMMWJ03W8m4aEbKP4hrMuppCZJ2PXftUlhB6pnZ6RGXXuG_7gR5fA=h310",
        "//lh3.googleusercontent.com/OJpEWnCWKPq-qNP_m1eoAeqnaop9na9vm_GVjHVxdzLzzEtS80EWNefOJY8-0PRiBw=h310"
    ],
    "comments": [
        "Mi rimane nella schermata home",
        "Non esiste che per votare si deve accedere tramite Facebook, Twitter ecc.",
        "Xf live Sistemate le canzoni del live please..vorrei poterle sentire senza che saltino come vecchi CD",
        "Crasha Quando faccio la sincronizzazione per il backstage Live...",
        "Wowwew Good",
        "Applicazione molto migliorata Eccellente quest'anno, solo ok l'anno scorso"
    ],
    "recentChanges": [
        "Bug Fixing"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.zodiakactive.xfactor&hl=en&gl=us",
    "appId": "com.zodiakactive.xfactor"
}