{
    "title": "Flipkart Online Shopping App",
    "summary": "India’s No.1 Shopping App - Trusted by over 100 mn Indians for online shopping!",
    "icon": "//lh3.googleusercontent.com/REVWVIfDnMlClUnFat1qgVljxhvFxd2azTIIH2sPSmLZI-1KTonBD8niz8fh7pg4WX9U=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.4,
    "reviews": 4980991,
    "developer": "Flipkart",
    "developerId": "5793131769291455541",
    "developerEmail": "app-feedback@flipkart.com",
    "developerWebsite": "http://www.flipkart.com",
    "updated": "March 3, 2018",
    "version": "Varies with device",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "size": "Varies with device",
    "description": " Flipkart Online Shopping App - Download app for a delightful shopping experience Online shopping with Flipkart is very easy as you get to shop from the comfort of your home and get products delivered at your doorstep. By downloading the Flipkart free online shopping app on your Android phone or tablet, you can effortlessly browse our massive collection of more than 80 crore products from multiple categories including mobile phones, fashion wear, electronic devices, accessories and consumer durables._____________________________________The products you can find on Flipkart shopping app are: •Mobile Phones•Mobile accessories•Laptops, Computer Accessories & Tablets•Electronic gadgets•Games & Gaming Console•Home & Kitchen Appliances•Women’s Clothing•Men’s Clothing•Women’s & Men’s footwear•Sports, gym & fitness products•Travel, luggage & handbags•Personal care appliances•Home & Furniture_____________________________________ Install Flipkart app for unique benefits Simply download the Android  shopping app on your device (phone or tablet) and create an account for yourself. Now, you will be taken to the Home screen where you will find links to all the category products, along with amazing offers, deals and discounts under the 'Offer Zone' and 'Deals of the day'. 1. Easily type in the product you are looking for in the ‘Search’ tab and find it instantly2. Narrow down your search using filters like price, color, style, pattern, brand to find your desired product3. Check ratings and reviews given by other customers along with seller ratings, price and description of the product while buying the product4. You can also add products to your wishlist with a single tap5. To place the order, choose among easy payment options like Cash on Delivery (COD), debit card, credit card, netbanking or UPI enabled PhonePe6. Track your orders inside the app, get notifications on personalized offers, price drops, order status, exclusive launches and upcoming sale events_____________________________________ Permissions  In addition to basic permissions, the Flipkart shopping app needs access to other functions on your device for it to support the above features -• Device and App History: To detect critical crashes and recover the app state• Identity: For native login functionality with your Google account• SMS: To auto-verify OTPs. We do not read existing messages_____________________________________You can contact our 24x7 customer support for any product or delivery related issues. Download Flipkart app now and start shopping!",
    "descriptionHTML": "<b> Flipkart Online Shopping App - Download app for a delightful shopping experience </b><br><br>Online shopping with Flipkart is very easy as you get to shop from the comfort of your home and get products delivered at your doorstep. By downloading the Flipkart free online shopping app on your Android phone or tablet, you can effortlessly browse our massive collection of more than 80 crore products from multiple categories including mobile phones, fashion wear, electronic devices, accessories and consumer durables.<br>_____________________________________<br><br><br><b>The products you can find on Flipkart shopping app are: </b><br><br>&#x2022;<b>Mobile Phones</b><br>&#x2022;<b>Mobile accessories</b><br>&#x2022;<b>Laptops, Computer Accessories &amp; Tablets</b><br>&#x2022;<b>Electronic gadgets</b><br>&#x2022;<b>Games &amp; Gaming Console</b><br>&#x2022;<b>Home &amp; Kitchen Appliances</b><br>&#x2022;<b>Women&#x2019;s Clothing</b><br>&#x2022;<b>Men&#x2019;s Clothing</b><br>&#x2022;<b>Women&#x2019;s &amp; Men&#x2019;s footwear</b><br>&#x2022;<b>Sports, gym &amp; fitness products</b><br>&#x2022;<b>Travel, luggage &amp; handbags</b><br>&#x2022;<b>Personal care appliances</b><br>&#x2022;<b>Home &amp; Furniture</b><br>_____________________________________<br><br><b> Install Flipkart app for unique benefits </b><br><br>Simply download the Android  shopping app on your device (phone or tablet) and create an account for yourself. Now, you will be taken to the Home screen where you will find links to all the category products, along with amazing offers, deals and discounts under the &apos;Offer Zone&apos; and &apos;Deals of the day&apos;. <br><br>1. Easily type in the product you are looking for in the &#x2018;Search&#x2019; tab and find it instantly<br>2. Narrow down your search using filters like price, color, style, pattern, brand to find your desired product<br>3. Check ratings and reviews given by other customers along with seller ratings, price and description of the product while buying the product<br>4. You can also add products to your wishlist with a single tap<br>5. To place the order, choose among easy payment options like Cash on Delivery (COD), debit card, credit card, netbanking or UPI enabled PhonePe<br>6. Track your orders inside the app, get notifications on personalized offers, price drops, order status, exclusive launches and upcoming sale events<br>_____________________________________<br><br><b> Permissions </b> <br><br>In addition to basic permissions, the Flipkart shopping app needs access to other functions on your device for it to support the above features -<br>&#x2022; Device and App History: To detect critical crashes and recover the app state<br>&#x2022; Identity: For native login functionality with your Google account<br>&#x2022; SMS: To auto-verify OTPs. We do not read existing messages<br>_____________________________________<br><br>You can contact our 24x7 customer support for any product or delivery related issues. Download Flipkart app now and start shopping!",
    "histogram": {
        "1": 211542,
        "2": 94153,
        "3": 327453,
        "4": 1239029,
        "5": 3108814
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/ibr88Iv5d6JZ1YU9CjTwowOyG5cgrIe4aTNFtc4Hd0th_dQkE11c_Jxp-a3rP_ok_BE=h310",
        "//lh3.googleusercontent.com/N_I-PVq4EyDg8z2O8oFkB7DFZ5Q5Y4KYj9iy7ATwj8TsRnsynu29DoTmZ55a14A7LQ=h310",
        "//lh3.googleusercontent.com/FlRovJwfkL-LaCQFb3OGtXuu3IPzvVNfrJkAzrygSc2EPugXVBvfQ7gEXJtDkS_0cVo=h310",
        "//lh3.googleusercontent.com/PoxHuOsTijsDTH5TMkYYDj47-CoxiRec9tMYAM9dkhtru--4LiKXurAGlByRdWXLDuM=h310",
        "//lh3.googleusercontent.com/4NyqmZt9J33sK8OF4EI9OuvOX24ifvBhHK2GaLrXYd9kd2EzPTzWP4PCMd5WuCvcKZs=h310",
        "//lh3.googleusercontent.com/TEFbDPWpOUmd_sPQ5Fis6CJfFndps1q3tZgFRSHLZFP-4NWl-BQKu3Ewti7hoWghk7cg=h310",
        "//lh3.googleusercontent.com/IGEvCGyj1-wGoGxs_EdsTKZFelVN53G3RTaMUG4WJgbJoY2ZXs9gWKDs6sUS-TYn_rk=h310",
        "//lh3.googleusercontent.com/FB_WrDX4DEtt1uY404zHkSi8fMZ3vlHmRoss3uAIeOH8HvH8IvCZQyUr2k0n80rM8gR4=h310"
    ],
    "video": "https://www.youtube.com/embed/mPpD_CocHMU",
    "comments": [
        "All and all I am happy with the flipkart and the experience till the time is really satisfactory.  1) The presentation of the product is good either it's through the images uploaded on the site or the description for the product. 2) the team is really working on the feedbacks and from time to time they will come up with something new like flipkart pay later option is quite cool as of now.  Keep the good work going 👍👍",
        "flipkart app truly gives an awesome shopping experience.. however,i think flipkart should work on its business model where shipping cost is often seemingly unjustified.. it's better if listing includes shipping cost so that i can sort products according to the final all inclusive cost that i pay for",
        "Not good Doesn't provide Cod on latest phone. And do auto cancellation. We are not fools that we will do online payment for the product that is going to be cancelled within seconds or after shipment. Worst online shopping site",
        "Worst ever experience of flash sale.. they canceled my orders about 3-4 times. They are just playing with our feeling. I want to gift it to my mother on her birthday and these stupid things are happening.   No COD on Redmi Note 5 pro.....! are you jocking....? What do you want...? Should I pay an amount of about 14000 and if there is any problem in that product, will you return that amount as fast as we paid...? Well I don't think so... Why should I give you my whole salary of a month for 2 days... Are you..",
        "Very bad customer service. I didn't sign in from 18th Feb in Flipkart account.  And from that date I contacted with customer care continuously via call or mail also but the issue is not resolved yet.  They repeat again and again \"sir wait for 24 hours or 72 hours our back-end team will contact you and sent an email to you.  But till today I didn't receive any mail or call from Flipkart team.",
        "I'm rating down this due to cancellation of orders even after shipping.   When speaking to the customer care, we receive a response to made a new order of the same item..ooohmy..G... what on earth..! Everyone knew the difficulty of booking flash sales..and not every sales include bank offers and cash backs..  Dear flipkart...you really need to review this types of problems.  THIS IS A BIG LOST OF MONEY AND TIME for regular customers like us"
    ],
    "recentChanges": [
        "🔅 Watch Youtube Videos on product pages for additional information",
        "🔅 Buy the right product using 'buying guides' for mobiles & large home appliances",
        "🔅 Retrieve your account password via Auto OTP verification",
        "🔅 Comprehensive ratings & reviews for mobiles & large home appliances",
        "🔅 Digital products launch, extended warranty, accidental damage protection",
        "🔅 Extra discount using Phone health-check with exchange, if the phone health is good"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.flipkart.android&hl=en&gl=us",
    "appId": "com.flipkart.android"
}