{
    "title": "Sports Tracker Running Cycling",
    "summary": "Power your passion for sports with Sports Tracker - The original fitness app.",
    "icon": "//lh3.googleusercontent.com/1Wts4LHePfumygMVHafbY0_ZJVdiWscqdCaXC-V8ixbgdir2zr9xGBzi5ZC5axBit1Y=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 183521,
    "developer": "Amer Sports Digital",
    "developerId": "Amer+Sports+Digital",
    "developerEmail": "support@sports-tracker.mail.helpshift.com",
    "developerWebsite": "http://www.sports-tracker.com",
    "developerAddress": "Tammiston kauppatie 7 B\n01510 Vantaa\nFinland",
    "updated": "February 27, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Sports Tracker is not only one of the best fitness apps around, it’s the original sports app. For over a decade, Sports Tracker has helped millions of fitness fans around the world get inspired through exercise, and it can help you too -- whether it’s running, cycling, walking, hiking, mountain biking, skiing, or other sports activities that power your passion.Track your training using powerful GPS and maps, analyze everything from calories burned to average speed and altitude, and monitor your progress as you work towards your fitness goals. Best of all, you don’t have to go it alone! Sports Tracker is the social sports tracking application and service that started it all. Powerful social features let you share your workout progress and photos with friends and followers, motivating you to stay on track with your training.FANTASTIC FEATURES TO GET YOU FITSports Tracker for Android comes with powerful social features in addition to award-winning GPS tracking capabilities, making it the most feature-packed, easy to use fitness app available: - Track and analyze your workout performances - Monitor your fitness progress - Record data in your Workout Diary for progress analysis and back it up on Sports Tracker’s online service - Track calories burned, average training and cycling speed, running pace, altitude and more - Use GPS maps, time and distance calculators - Get voice feedback during training - Follow friends who inspire and motivate you and see their progress on your social feed - Encourage friends by commenting and liking their updates, right from your home screen - Share your progress, photos, workouts, favorite running and cycling maps and more with friends on Sports Tracker, Facebook, and Twitter - Prefer a private workout? No problem! There’s no pressure to share.HEART RATE MONITORINGTake your training to the next level with the Sports Tracker Bluetooth Heart Rate Monitor – available separately at http://shop.sports-tracker.com/FREE ONLINE SERVICE AT WWW.SPORTS-TRACKER.COMSports Tracker is the most powerful social sports tracking solution available for Android when used with the full-featured online service at www.sports-tracker.com.The free online service offers automatic workout backup, detailed maps and analysis views, friends' workouts and lots more.Ready to have fun getting fit so that you can be your personal best? Download Sports Tracker today and join the world’s first and the best social sports app community.",
    "descriptionHTML": "Sports Tracker is not only one of the best fitness apps around, it&#x2019;s the original sports app. For over a decade, Sports Tracker has helped millions of fitness fans around the world get inspired through exercise, and it can help you too -- whether it&#x2019;s running, cycling, walking, hiking, mountain biking, skiing, or other sports activities that power your passion.<br><br><br>Track your training using powerful GPS and maps, analyze everything from calories burned to average speed and altitude, and monitor your progress as you work towards your fitness goals. Best of all, you don&#x2019;t have to go it alone! Sports Tracker is the social sports tracking application and service that started it all. Powerful social features let you share your workout progress and photos with friends and followers, motivating you to stay on track with your training.<br><br><br><br><b>FANTASTIC FEATURES TO GET YOU FIT</b><br>Sports Tracker for Android comes with powerful social features in addition to award-winning GPS tracking capabilities, making it the most feature-packed, easy to use fitness app available:<br><br><br> - Track and analyze your workout performances<br> - Monitor your fitness progress<br> - Record data in your Workout Diary for progress analysis and back it up on Sports Tracker&#x2019;s online service<br> - Track calories burned, average training and cycling speed, running pace, altitude and more<br> - Use GPS maps, time and distance calculators<br> - Get voice feedback during training<br> - Follow friends who inspire and motivate you and see their progress on your social feed<br> - Encourage friends by commenting and liking their updates, right from your home screen<br> - Share your progress, photos, workouts, favorite running and cycling maps and more with friends on Sports Tracker, Facebook, and Twitter<br> - Prefer a private workout? No problem! There&#x2019;s no pressure to share.<br><br><br><br><b>HEART RATE MONITORING</b><br>Take your training to the next level with the Sports Tracker Bluetooth Heart Rate Monitor &#x2013; available separately at http://shop.sports-tracker.com/<br><br><br><br><b>FREE ONLINE SERVICE AT WWW.SPORTS-TRACKER.COM</b><br>Sports Tracker is the most powerful social sports tracking solution available for Android when used with the full-featured online service at www.sports-tracker.com.<br><br>The free online service offers automatic workout backup, detailed maps and analysis views, friends&apos; workouts and lots more.<br><br>Ready to have fun getting fit so that you can be your personal best? Download Sports Tracker today and join the world&#x2019;s first and the best social sports app community.",
    "histogram": {
        "1": 5377,
        "2": 3486,
        "3": 8706,
        "4": 46155,
        "5": 119797
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/b7CywFFaciyauhTy2QDyRve9NjdYrlQFj3M7qdubjbpfY6YlgVmy8Czos1wfeDg3urU=h310",
        "//lh3.googleusercontent.com/Ak4d3pcjbHQzyaabTTBLHROaiUn8T8owZHsBhnbxfzSMZ3hfS87fTucWnwKV9a8qAdo=h310",
        "//lh3.googleusercontent.com/Z6rdNDlqT5Wj1jEQL1lIQkaCV9V_ziofhP2AubBVTrYFBYW4TEtVwm3SVF6KhaAP3c4=h310",
        "//lh3.googleusercontent.com/03H5ExSqyRWaS8TXvPL89-6qw7hJh7J0OYmk34nmhT1UIAxHmKQPfOK5YqI2j0BLtw=h310",
        "//lh3.googleusercontent.com/6d1CrfsZOeL9Lqxg10aBa4mf-_MHSXFCO7erGZmetKCjVR9dCKFJcx4OWei44K9C_qo=h310",
        "//lh3.googleusercontent.com/-JinsyBzaqjWoQXouMMn0XpMebsIUJ75DbaxTUqcXSfpcU4EDFw-viIBT0DGxdb0mW4=h310",
        "//lh3.googleusercontent.com/StHbrgBAx88qpjnpGbaqMo0374RWIT6No2UrDshwRq5vme89cH3QjvB8-Eku0DRv__k=h310",
        "//lh3.googleusercontent.com/W_3No4SPw7LxADrrrE3cgGSRU4Q_IZzow0I3rFw2eQosImxwbX83iesr6FeeI6ehILg=h310"
    ],
    "comments": [
        "Gps is fairly good. Functionality is a little tricky at times. It's fine if you are recording your exercise as you go but its a bit confusing if you want to add past exercise logs. My biggest irritation is that I wish it gave the option to change the start of the week to Monday instead of Sunday. I'd also like to see the ability to change the 'other 1,2,3,etc' options to specify what you are doing instead of writing in the description",
        "Great app, use it for everything from measuring out training routines to tracking all forms of exercise. Never had a glitch or issue. Highly recommended.",
        "One of best and accurate app for running.Excellnt analysis of workout available, helpful for motivation.",
        "This app have helped me getting fit by the year 😎😆",
        "Great app for my walking routine. Helps me to improve my distance an time",
        "This thing is amazing for every sport"
    ],
    "recentChanges": [
        "Great news!",
        "To make your Sports Tracker experience better than ever, we’ve made most of our Premium features free for everyone. You can now use Training Summaries, compete with the Ghost Target, and much more!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.stt.android&hl=en&gl=us",
    "appId": "com.stt.android"
}