{
    "title": "BandLab - Social Music Maker and Recording Studio",
    "summary": "Record, mix &amp; share your music! Join millions of creators and fans on BandLab.",
    "icon": "//lh3.googleusercontent.com/OavWAFQYn-66EPNQcy5conEHClQ3IvUCgCsXKIlJqeYrT_46Mh-iHb0B707y2X3byvY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 16170,
    "developer": "BandLab",
    "developerId": "8375301961782396369",
    "developerEmail": "support@bandlab.com",
    "developerWebsite": "https://www.bandlab.com",
    "updated": "January 29, 2018",
    "version": "6.4.0",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "BandLab is changing the world of music. Join millions of creators and fans using BandLab to make and share their music from more than 180 countries around the world. BandLab makes it easy to make great music and find great music to listen to. You can listen to tracks from other creators, publish your own as well as create and collaborate with other musicians.Global competitions to win cash and prizes are launched regularly and community events are driven by our passionate audience of creators to discover new artists.Unlike other apps, BandLab’s award-winning creation and social features are completely FREE with no ads to ruin your music experience either.CREATION HIGHLIGHTS:• 12-Track Mix Editor - record live audio, import, mix, solo, pan and mute tracks to create the perfect song. • Unlimited Projects & Secure Storage via the Cloud - no limits to your creativity.• >30 Guitar/Bass/Vocal FX Presets - world-class cross-platform FX with real-time monitoring.• Looper (NEW) - make your own beats with just your imagination and a few clicks with our professionally created Loop Packs.• Tweak Your Beats (NEW) - gate, retrigger, quantisation and FX all available in the Looper.• Work across ALL your devices - all your projects, feeds, bands and communities are cross-platform and accessible via iOS or your browser (even more features available).• Photo/Video Shouts - share photos, videos, add emojis and publish it to your friends and followers.• Built-in Guitar Tuner & Metronome - the tools you need to capture inspiration.• Remix Tracks - “fork” tracks that other creators have shared with the community and make it your own.COMMUNITY FEATURES:Join the world’s fastest growing social network around music. Follow other artists and their creative process, share and publish your music to get heard, keep your followers up to date to get feedback and much more. Start bands and collaborations to meet new musicians and work on projects privately or publicly - no matter whether they live next door or on the other side of the world!Create collections and playlists of your favourite music and listen to them wherever and whenever you want.Whether you like Pop, Hip-Hop, R&B, Blues, Funk, Rock or Jazz - millions of creators and fans use BandLab to make and share their music - with more than 4 million tracks created and listened to on BandLab to date.Get #InTheLab today!",
    "descriptionHTML": "<b>BandLab is changing the world of music.</b> Join millions of creators and fans using BandLab to make and share their music from more than 180 countries around the world. <br><br>BandLab makes it easy to <b>make great music and find great music to listen to.</b> You can listen to tracks from other creators, <b>publish your own</b> as well as <b>create and collaborate with other musicians.</b><br><br><b>Global competitions</b> to win cash and prizes are launched regularly and community events are driven by our passionate audience of creators to <b>discover new artists.</b><br><br>Unlike other apps, <b>BandLab&#x2019;s award-winning creation and social features are completely FREE</b> with <b>no ads</b> to ruin your music experience either.<br><br><b>CREATION HIGHLIGHTS:</b><br><br>&#x2022; <b>12-Track Mix Editor</b> - record live audio, import, mix, solo, pan and mute tracks to create the perfect song. <br>&#x2022; <b>Unlimited Projects &amp; Secure Storage via the Cloud</b> - no limits to your creativity.<br>&#x2022; <b>&gt;30 Guitar/Bass/Vocal FX Presets</b> - world-class cross-platform FX with real-time monitoring.<br>&#x2022; <b>Looper (NEW)</b> - make your own beats with just your imagination and a few clicks with our professionally created Loop Packs.<br>&#x2022; <b>Tweak Your Beats (NEW)</b> - gate, retrigger, quantisation and FX all available in the Looper.<br>&#x2022; <b>Work across ALL your devices</b> - all your projects, feeds, bands and communities are cross-platform and accessible via iOS or your browser (even more features available).<br>&#x2022; <b>Photo/Video Shouts</b> - share photos, videos, add emojis and publish it to your friends and followers.<br>&#x2022; <b>Built-in Guitar Tuner &amp; Metronome</b> - the tools you need to capture inspiration.<br>&#x2022; <b>Remix Tracks</b> - &#x201C;fork&#x201D; tracks that other creators have shared with the community and make it your own.<br><br><b>COMMUNITY FEATURES:</b><br><br>Join the world&#x2019;s <b>fastest growing social network</b> around music. <b>Follow other artists</b> and their creative process, <b>share and publish your music to get heard</b>, keep your followers up to date <b>to get feedback</b> and much more. <b>Start bands and collaborations</b> to meet new musicians and work on projects <b>privately or publicly</b> - no matter whether they live next door or on the other side of the world!<br><br><b>Create collections and playlists</b> of your favourite music and <b>listen to them wherever and whenever you want.</b><br><br>Whether you like Pop, Hip-Hop, R&amp;B, Blues, Funk, Rock or Jazz - millions of creators and fans use BandLab to make and share their music - with <b>more than 4 million tracks</b> created and listened to on BandLab to date.<br><br>Get <b>#InTheLab</b> today!",
    "histogram": {
        "1": 1282,
        "2": 497,
        "3": 1202,
        "4": 2661,
        "5": 10528
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/7qLCkp1XZYlXJCdigGT4CK6r2s07_-LKwYUxsJvl-1Cso6SP9HNEVsFoHCItp56ImPzq=h310",
        "//lh3.googleusercontent.com/7FjZAaVBVnXskczJpviRWERdN-IQnpKvkOaoFwVaiwQmIwsldRPU5jEkPZfFpIe7_Xo=h310",
        "//lh3.googleusercontent.com/7VHiQkMoJa2iHqM6SQYFtQNW4RI8JNKypR23Sz7XBec54-ee7eLk_vUkczIm-GhqXzg=h310",
        "//lh3.googleusercontent.com/5b_vULlrr42yv6z0MES3PcIzmIzMeYH99TWnQJ93BfIhQtkEul-4iKLvMCoSQczRkmL7=h310",
        "//lh3.googleusercontent.com/oxG06rW87EZYcOCO0tUmOTmzUx3etacsXILR-7FCQoZxEu74kjsIjCmuqdN_20i-9Vnf=h310",
        "//lh3.googleusercontent.com/AVm-ntgeHz5rotlwlhMqsEgmxbS0_ACX3WGWVdehes_vB0AT88-Qtai3xtwReeuZ4h8=h310"
    ],
    "comments": [
        "I get better sounding vocals with this app than I've ever gotten from spending be hundreds of dollars on protools equiptment, FireWire microphones and soundproofing materials. Not for nothing, even though I still can't edit my profile information even after logging out and logging back in, this app is low-key legit once you get the hang of it. Not for nothing but I can see this app getting low-key popular in the future.",
        "Great app for making music. Good quality sound. Good guitar effects. Good quality vocal recording, dont even need to plug in my microphone, I directly record on phone mic. But just one thing is missing; Midi support..... Using pads is really hard. I hope you add midi support too.  Thank You",
        "I love this app so much! It's easy to use and make music in my style. But i have a problem now. The app cant record any sound from my device after pushing red button. The other recording apps still can. I've tried re-install, turn on recording permission, and reboot the device. But it doesn't work. Please help me. Thank you ❤️",
        "Can't even make it past creating my name? It just continues to load . I'll keep trying but if it won't work my rating will drop more.  Update: Rating changed to 5 star's. I Love the app,but it seems to be slow with my device? Running with Samsung Galixy S5.  Other then that everything is fantastic!",
        "Keeps on messing up my songs that I've spent hours working on! When I publish it, it changes the tempo, tone and sound of my voice/music. It's really annoying me now!",
        "This might be a good app. I'm not really sure because I COULDN'T EVEN START IT. The bottom of my phone covered one of the 'next' buttons completely, making it impossible to go further than the genres of music part. Shame, I was looking forward to using it."
    ],
    "recentChanges": [
        "New instrument in Mix Editor - introducing BandLab Pads 🎉",
        "Pick your sound out of 120 professionally created soundbanks and enjoy make some rad beat 😎"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bandlab.bandlab&hl=en&gl=us",
    "appId": "com.bandlab.bandlab"
}