{
    "title": "Gmail",
    "summary": "Email from Google",
    "icon": "//lh6.ggpht.com/8-N_qLXgV-eNDQINqTR-Pzu5Y8DuH0Xjz53zoWq_IcBNpcxDL_gK4uS_MvXH00yN6nd4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000000,
    "maxInstalls": 5000000000,
    "score": 4.3,
    "reviews": 4349603,
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "apps-help@google.com",
    "developerWebsite": "http://support.google.com/mail/bin/topic.py?hl=en&topic=2451697&parent=2451730&ctx=topic",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "updated": "February 27, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Gmail is an easy to use email app that saves you time and keeps your messages safe. Get your messages instantly via push notifications, read and respond online & offline, and find any message quickly.With the Gmail app you get:• An organized inbox - Social and promotional messages are sorted into categories so you can read messages from friends and family first.• Less spam - Gmail blocks spam before it hits your inbox to keep your account safe and clutter free.• 15GB of free storage - You won’t need to delete messages to save space.• Multiple account support - Use both Gmail and non-Gmail addresses (Outlook.com, Yahoo Mail, or any other IMAP/POP email) right from the app.",
    "descriptionHTML": "Gmail is an easy to use email app that saves you time and keeps your messages safe. Get your messages instantly via push notifications, read and respond online &amp; offline, and find any message quickly.<br>With the Gmail app you get:<br>&#x2022; An organized inbox - Social and promotional messages are sorted into categories so you can read messages from friends and family first.<br>&#x2022; Less spam - Gmail blocks spam before it hits your inbox to keep your account safe and clutter free.<br>&#x2022; 15GB of free storage - You won&#x2019;t need to delete messages to save space.<br>&#x2022; Multiple account support - Use both Gmail and non-Gmail addresses (Outlook.com, Yahoo Mail, or any other IMAP/POP email) right from the app.",
    "histogram": {
        "1": 265717,
        "2": 125790,
        "3": 343210,
        "4": 798932,
        "5": 2815954
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/qfCWb_QLcmsaE2JqmW_szIGKyDv1hto_xbqL1UMmKWEIz3UmGyXR5gD2sic00pd8dg=h310",
        "//lh3.ggpht.com/xq5BEIHWBYcbLNIji4Pjdx3gIlscoC0fHxYlG84TPFCxxVSMnCTJbDZ5J47lnVMH7vU=h310",
        "//lh3.ggpht.com/oBOGoEOSPRnoo1RM9t8k5dcmCc3Nhb0gautw-dx0eosnHCm56HULM5pS8SPiGX0yZnM=h310",
        "//lh6.ggpht.com/vghbjHKH9xo9Ld7g6rx_AkgR1OV564MxEnhfiXyWwB-fdLEppc8g_RftQgw_Bd6GOLT3=h310",
        "//lh5.ggpht.com/WK1g2s6NMv0pWJPJPfGBf2tzDgxI0IdSj4YFB2YrZhOI3f3-5sJIYjLLwKF7AEJmfgc=h310",
        "//lh3.ggpht.com/dmKfexnbDeRg_9elMFUQlAJGW0DzYYhKS5XxSWsMZguWyQ8gSN41oQE0mZ2RlS1llv1f=h310",
        "//lh4.ggpht.com/eaQpNQQOHXjymcbYpyhGTcxbS-P4Ti-0k1UuqFWh_JcNBu-GZyVWVNWhiLyzDGqTnEw=h310"
    ],
    "video": "https://www.youtube.com/embed/egjApkX8sIk",
    "comments": [
        "Every time there's an update, it says bug fixes and performance improvements.  Does it mean that the earlier version are not proper and why the update is released before checking for the bugs.   Nowadays, I am not getting notification tone nor intimation whenever there's a new message.  I need to keep checking the Gmail box every half an hour.. kindly check it out.",
        "Displays the correct number of new mails but does not display the actual mail immediately after forced or auto sync. I end up opening Gmail in Chrome to read the emails...additionally, what's with ads taking up screen real estate in my inbox? Not a fan, at all.",
        "I have a lot of mails in every folders (spam, promotion...,) So while trying to delete Every messages from social folder I have to select one by one by hold pressing. It will take so much time to delete message on specific folder. So I expect that your future update of Gmail app will have a option to delete Every messages on a folder by one click....",
        "All of the sudden I can't change which email address I'm sending my message from. I used to be able to select from the drop down and now nothing happen s and I can't switch. And since attaching a file is a nightmare is you compose first, i have to select several images from my gallery and click share via email instead. But then i cant change which email account to send it from.",
        "For about a month now same issue no matter what I do with the settings and no matter the latest update. I am constantly not notified of new emails and they don't even show until I manually sync. Everything is set so it should be working on auto-sync. I have never had this issue before.  Please fix, I always enjoyed using Gmail.",
        "Horrible. I am CONSTANTLY deleting emails from several years ago. Each time I delete them, they return a minute later. Extremely frustrating! We're talking 295 emails every few minutes even though they are repeatedly deleted. Doesn't matter if I empty trash, clear cache, or uninstall & reinstall. Terrible app. Would not recommend it."
    ],
    "recentChanges": [
        "• Bug fixes and performance improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.google.android.gm&hl=en&gl=us",
    "appId": "com.google.android.gm"
}