{
    "title": "Decidr",
    "summary": "The prettiest decision making app you&#39;ve ever seen!",
    "icon": "//lh3.ggpht.com/LWY1KYrnYoFgBZupePXnXHj6CB90nRJ94otTmPsRCY98HVMTFXgVwkEkM6XgcJocbQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 564,
    "developer": "PX Studios",
    "developerId": "PX+Studios",
    "developerEmail": "support@pxstudios.com",
    "developerWebsite": "http://pxstudios.com",
    "updated": "August 7, 2014",
    "version": "1.0",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "description": "If you're indecisive and have trouble deciding whether you should go to bed or keep looking at cat videos all night, choosing between pizza or Chinese for dinner, figuring out who's turn it is to get the next round... or pretty much any thing for that matter... Then look no further, Decidr is the app for you!Decidr includes the following tools and games to help you make the best decision!★ Yes or No★ Truth or Dare★ Heads or Tails★ Spin the Bottle★ Magic 8 BallSimply flick up on the screen and you'll have your answer. Decidr is also fully compatible with Android Wear so you can make quick decisions on the go!",
    "descriptionHTML": "If you&apos;re indecisive and have trouble deciding whether you should go to bed or keep looking at cat videos all night, choosing between pizza or Chinese for dinner, figuring out who&apos;s turn it is to get the next round... or pretty much any thing for that matter... Then look no further, Decidr is the app for you!<br><br>Decidr includes the following tools and games to help you make the best decision!<br><br>&#x2605; Yes or No<br>&#x2605; Truth or Dare<br>&#x2605; Heads or Tails<br>&#x2605; Spin the Bottle<br>&#x2605; Magic 8 Ball<br><br>Simply flick up on the screen and you&apos;ll have your answer. Decidr is also fully compatible with Android Wear so you can make quick decisions on the go!",
    "histogram": {
        "1": 25,
        "2": 36,
        "3": 61,
        "4": 135,
        "5": 307
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh3.ggpht.com/Avgqa66emfd9SUX7egq0fmBbwvo_2E7k4cjUL6S9XiPlUFs9K4ANOxf0p4XzGHDpnUQ=h310",
        "//lh5.ggpht.com/X9B2IdK7Ev6VeiGHFMV0IxOSdhjSdlv9H10bCQKHxzamfBZqchnfrEYYe976ny0rfsAW=h310",
        "//lh3.ggpht.com/Vg-_Q7qiJ98JNMkJ0ge4sD-v80iUKVp3V2CyrQ0VkPNrYVkyFkZzIVvNYIlGMyPFsg=h310",
        "//lh6.ggpht.com/s0T8FkJkYiHcoxj6AkkwEGG-oqnZvLa57M7MEGd3ZYFmMvS3FuOYq2gxtFQrCDVULQ=h310",
        "//lh6.ggpht.com/YHwj1I0ZEZ97TStN9EZIUatxgkTKrnbh4lmuky3kltZ2C5dMDYgO4piLSTdTZQ0QSVIH=h310",
        "//lh4.ggpht.com/hY_nKlJROAi8s0sFRspRDxtPajbGykgjsbbgfRuTbuJMwEm5nnpxKTWHEOHY7Ygg6z0=h310"
    ],
    "comments": [
        "Great app Sometimes a simple app is the best app. This app delivers on exactly what it is meant to do. And it does so very well. The full compatibility with android wear is also a killer feature. One feature I would love to see is the ability to create a custom spinner where 2 or more options can spun. Something silly like inputting your favorite four pizza places and letting decidr decide for you where to order from. I think that would be a fun addition to this app.",
        "The Ultimate Decision Assistant If you have a difficult time making decisions, this app is all you will ever need. Not only does it come with more options than anything out there, but it's free and works on my smart watch (Huawei). 5☆!",
        "A very good decision maker. This app is awesome. I love how it has a simple layout. And it helps you with the toughest choices! Though I'd still not reccomend this for choices that could change your life, such as if you're going to break up. But it's good for simple things, such as deciding which clothes you wear.",
        "Is it good? Decidr says yes. This little app is so useful in those situations where nobody wants to make a decision. Visually, Decidr is nice on the eyes and performs well; I'm particularly fond of being able to use it on my Moto 360 Smartwatch.",
        "..undecidedly Optimistic! Read the reviews,.hmmm...         Kinda made it more interesting on my part. I just need to be totally 'DECIDED\" if i have to keep this app & add those couple more stars to give it a 5*rating.. or if i should hit Uninstall..  As for now, let me keep those stars.",
        "Nice UI. Predictable outcome. I liked it a lot at first, but then I realized that the app developer made no effort for a randomizing algorithm or anything. I got heads 86 times in a row.. The ones where there are only two options just don't work well."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pxstudios.decidr&hl=en&gl=us",
    "appId": "com.pxstudios.decidr"
}