{
    "title": "WearMail for Android Wear",
    "summary": "Email notifications with commands for Android Wear Smartwatches and Accessories",
    "icon": "//lh3.googleusercontent.com/h9OdT6riyCUTp2yqt3rX4nvog7HhgDSjtyQsn9xkCAHM5FmWRn3-Sh5d9upROpl2jRA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4,
    "reviews": 257,
    "developer": "Maxlab Mobile",
    "developerId": "Maxlab+Mobile",
    "developerEmail": "support@maxlabmobile.com",
    "developerWebsite": "http://www.maxlabmobile.com",
    "developerAddress": "eWhiz Mobile\n5th Floor (744-750), The Salisbury House, London Wall, London EC2M 5QQ",
    "updated": "November 3, 2017",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Achtung: Android Wear 2 users  1. Please try the new BETA 2.53 (Dec 19 2017):https://play.google.com/apps/testing/com.maxlabmobile.wearmail.androidwear  2. If you do not wish to use the BETA, set \"Enable Watch App\" to OFF in version 2.33 [Causes the app to use the standard notification framework which still provides most of the functionality of the app]  3. support@maxlabmobile.com if you need help or to report issues with the BETADisplays email notifications stacked in a single notification on an Android Wear smartwatch or accessory.The email notifications contain smart commands such as 'quick reply', delete email' and 'archive'  that are designed to facilitate ultra-quick processing of email on Android Wear smartwatches and accessories.WearMail works with nearly all email accounts by supporting the following protocols: IMAP, IMAP-IDLE (Push Mail), POP3 & Exchange via EWS or IMAP. WearMail is a standalone app that works in conjunction with *any* email app.  [There are no dependencies on K9, Gmail APIs or anything else.] Features:  • Stack email notifications as an expandable set of cards or use individual notifications instead • Display sender, subject and email body • Choose the number of watch commands and the order of the commands • Choose a command to run when the notification is dismissed [Typically: 'Mark as Read' or 'Archive'] • Ability to open the email directly on the phone [Use 'Simple Viewer' as your email app] • Reply to emails via voice or preset responses • Select or create your own vibration pattern • Option to display email notifications on the watch only • Customize notification backgroundWatch App Features: [New 2.25]  • Disable or enable notifications • Snooze notifications • Force an immediate check for mail • Redeliver recent notifications Commands:  • Open: Opens the email app inbox on the phone from the Android Wear watch • Delete Message: Deletes the email message from the mail server  • Mark as Read: Marks the message as read on the mail server • Mark as High Pri: Marks the message as high priority on the mail server • Archive: Moves the message to the designated folder on the mail server • Quick Reply: Issue a reply from the Android Wear watch Good to know:  • Watches Supported: LG G Watch, LG G Watch R, Samsung Gear Live, Asus Zen Watch, Huawei Watch, Moto 360, LG Watch Urbane, Sony Smartwatch 3, and more • App tested on Samsung Gear Live No Notifications [Or commands]  • GooglePlay services version on the watch and phone must match • If the versions do not match, do a \"resync apps\" in the Android Wear app • Wait about 5 minutes and check the version numbers again  Wear 2.0:  • Join the beta test group to receive the 2.0 version of the watch app: https://play.google.com/apps/testing/com.maxlabmobile.wearmail.androidwear Note: WearMail should facilitate ultra quick processing of mail. If there is anything in the day-to-day use of this app that you feel should be streamlined or improved please contact me at the support address: support@maxlabmobile.com",
    "descriptionHTML": "Achtung: Android Wear 2 users<br>  1. Please try the new BETA 2.53 (Dec 19 2017):<br>https://play.google.com/apps/testing/com.maxlabmobile.wearmail.androidwear<br>  2. If you do not wish to use the BETA, set &quot;Enable Watch App&quot; to OFF in version 2.33 [Causes the app to use the standard notification framework which still provides most of the functionality of the app]<br>  3. support@maxlabmobile.com if you need help or to report issues with the BETA<br><br>Displays email notifications stacked in a single notification on an Android Wear smartwatch or accessory.<br><br>The email notifications contain smart commands such as &apos;quick reply&apos;, delete email&apos; and &apos;archive&apos;  that are designed to facilitate ultra-quick processing of email on Android Wear smartwatches and accessories.<br><br>WearMail works with nearly all email accounts by supporting the following protocols: IMAP, IMAP-IDLE (Push Mail), POP3 &amp; Exchange via EWS or IMAP. <br><br>WearMail is a standalone app that works in conjunction with *any* email app.  [There are no dependencies on K9, Gmail APIs or anything else.]<br><br><b> Features: </b><br>&#x2003;&#x2022; Stack email notifications as an expandable set of cards or use individual notifications instead<br>&#x2003;&#x2022; Display sender, subject and email body<br>&#x2003;&#x2022; Choose the number of watch commands and the order of the commands<br>&#x2003;&#x2022; Choose a command to run when the notification is dismissed [Typically: &apos;Mark as Read&apos; or &apos;Archive&apos;]<br>&#x2003;&#x2022; Ability to open the email directly on the phone [Use &apos;Simple Viewer&apos; as your email app]<br>&#x2003;&#x2022; Reply to emails via voice or preset responses<br>&#x2003;&#x2022; Select or create your own vibration pattern<br>&#x2003;&#x2022; Option to display email notifications on the watch only<br>&#x2003;&#x2022; Customize notification background<br><br><b>Watch App Features: [New 2.25] </b><br>&#x2003;&#x2022; Disable or enable notifications<br>&#x2003;&#x2022; Snooze notifications<br>&#x2003;&#x2022; Force an immediate check for mail<br>&#x2003;&#x2022; Redeliver recent notifications<br><br><b> Commands: </b><br>&#x2003;&#x2022; <i>Open:</i> Opens the email app inbox on the phone from the Android Wear watch<br>&#x2003;&#x2022; <i>Delete Message:</i> Deletes the email message from the mail server <br>&#x2003;&#x2022; <i>Mark as Read:</i> Marks the message as read on the mail server<br>&#x2003;&#x2022; <i>Mark as High Pri:</i> Marks the message as high priority on the mail server<br>&#x2003;&#x2022; <i>Archive:</i> Moves the message to the designated folder on the mail server<br>&#x2003;&#x2022; <i>Quick Reply:</i> Issue a reply from the Android Wear watch<br><br><b> Good to know: </b><br>&#x2003;&#x2022; Watches Supported: LG G Watch, LG G Watch R, Samsung Gear Live, Asus Zen Watch, Huawei Watch, Moto 360, LG Watch Urbane, Sony Smartwatch 3, and more<br>&#x2003;&#x2022; App tested on Samsung Gear Live<br><br><b> No Notifications [Or commands] </b><br>&#x2003;&#x2022; GooglePlay services version on the watch and phone must match<br>&#x2003;&#x2022; If the versions do not match, do a &quot;resync apps&quot; in the Android Wear app<br>&#x2003;&#x2022; Wait about 5 minutes and check the version numbers again <br><br><b> Wear 2.0: </b><br>&#x2003;&#x2022; Join the beta test group to receive the 2.0 version of the watch app: https://play.google.com/apps/testing/com.maxlabmobile.wearmail.androidwear<br><br><b> Note: </b><br>WearMail should facilitate ultra quick processing of mail. If there is anything in the day-to-day use of this app that you feel should be streamlined or improved please contact me at the support address: support@maxlabmobile.com",
    "histogram": {
        "1": 23,
        "2": 15,
        "3": 29,
        "4": 54,
        "5": 136
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/GyOPpdikdupPR1I5iDTpoDVMRAoB4fTqmdLLWLMcOg5SiPPErOqZT4HpHLfmqix0028=h310",
        "//lh4.ggpht.com/KdfiLBM5iI_V-4MzzQ7f9yxL3tVx2crOZxohpYSBn9BQaRSaVdsH1CLki2ya-S9phw=h310",
        "//lh3.googleusercontent.com/auRrP66LzhrdxQouDem2Nsbuv3mIpSHc185-kUKh-6GZawGsSGIOVk4rw2xN0Gu9zxkQ=h310",
        "//lh3.googleusercontent.com/zP8BbBjXfn5QKGqKbEMwTkPZmYq72FR1Ofcl_WxRTAZ1TkAJpaPpvzemtC6XRTVf6qc=h310",
        "//lh3.googleusercontent.com/yUFd_vcuZfC4uOP15aVsQTcCbkE1JwpuPiuHgWIGkO0Lc8MHzmxsckoVJfblAWwpXA=h310",
        "//lh3.googleusercontent.com/lzyzTHLcufk7tHxkWoNUtk6gdoBRa44dTiZleogRW04aGFyieucxnT0JBa--17O4_Q=h310",
        "//lh3.googleusercontent.com/oZDXdVCeEOBjZWDA2Vy8seeH9JfD12dnraj7nWKDf847vPLfYJsNtanny6tm3tfkgbOd=h310",
        "//lh3.googleusercontent.com/oTh33kt_V29Z1M8J3SY-BdSQU3u93JSybGxt41GtXvLh5omqp4QAq9E2Cs9_QZEnzw=h310"
    ],
    "video": "https://www.youtube.com/embed/u1AjUpP1mYw",
    "comments": [
        "So far, I am using this application to inform me of e-mail updates by way of my new Motorola smartwatch. This software definitely makes the watch and my smartphone very interoperable.  Two thumbs up from me! Many thanks for a very nice piece of software!",
        "Based on reviews... Based on the reviews and honestly how active the developer (s)  are. I decided to give this a shot. Keep up the great work!",
        "Great app and developer! Tried app after app, looking for one that would delete my hotmail emails and still display on my watch.  This app is the solution. Had issues with it at first, but the developer was extremely responsive and took care of my trouble quickly.  If you are looking for a similar solution, give this a try and if you have issues, contact the developer.  This one actually cares about their app.",
        "Comms to the Watch seems to fail There doesn't seem to be a way of checking if it works or how to fix it. The switch off/ on notifications for phone or watch buttons are a little illogical: off for one, on for the other",
        "Works I have Been looking for a app that can delete my Hotmail emails on my watch and this works grate",
        "Brilliant app and brilliant support. Within minutes of contacting the developer about a bug with an Android update, he was onto it and was fixed  quickly. Essential app!"
    ],
    "recentChanges": [
        "Android 8.1 Update"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.maxlabmobile.wearmail.androidwear&hl=en&gl=us",
    "appId": "com.maxlabmobile.wearmail.androidwear"
}