{
    "title": "Newton Mail - Email & Calendar",
    "summary": "Supercharge your mail with Email Tracking, Send Later, Undo Send,Calendar &amp; more",
    "icon": "//lh3.googleusercontent.com/SCQT5j5IaPIJCtaC8sSZ-ZY4S9v1ZpZRP-XNbirk03FGW9bELbdFkPPpGlBcc4Vsplk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4,
    "reviews": 122724,
    "developer": "CloudMagic, Inc.",
    "developerId": "CloudMagic,+Inc.",
    "developerEmail": "hello@newtonhq.com",
    "developerWebsite": "https://newtonhq.com",
    "developerAddress": "CloudMagic, Inc.\n501 Forest Avenue, Suite PH3\nPalo Alto, CA 94301",
    "updated": "March 4, 2018",
    "version": "9.8.187",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Newton is a subscription-based service that supercharges your email with power features like Read Receipts, Snooze, Send Later, Undo Send, Sender Profile, Connected Apps and more across Android Phone, Tablet and Wear. Comes with a 14-day free trial. Newton is available as an in-app subscription for $49.99/yr. That’s about $4/mo for something that you use dozens of times every day. Works with Gmail, Exchange, Yahoo Mail, Hotmail/Outlook, iCloud, Google Apps, Office 365 and all IMAP accounts.Supports Calendar for Gmail, Google Apps, and Exchange (EWS). Manage your email & Calendar without switching between apps.What Happens After 14 DaysThe app stops working. You won’t get new emails, push notifications and access to power features Read Receipts, Send Later, Snooze & more. Definitely not an email experience we recommend.Sign Up Once, Use EverywhereYour Newton account is your key to all things Newton. Use it to instantly access your email anytime, across ALL your devices. It’s that simple. With your account, you can have all your email preferences and settings synced magically across devices - be it Android Phone, Tablet, Wear, Mac or Windows.Why Newton is the only email app you need● Instant push notifications for ALL types of email - Gmail, Hotmail/Outlook, Exchange, Yahoo Mail, iCloud, Google Apps, Office 365 and any IMAP account.● Read Receipts - Get read-status for every email you send. Also get notified as soon as the email is read. Know exactly who read your email with individual mail tracking.● Send Later - Schedule emails to be sent later and have them delivered to the recipient’s inbox at just the right moment. Also, you can stop the scheduled email if the recipient emails you in between.● Tidy Inbox - Focus on emails that matter. Weed out newsletters and social media emails to another folder and make your inbox distraction-free. Think Gmail tabs for all email accounts.● Sender Profile - Know more about the people who email you. Get job titles, organization​ info, location, LinkedIn, Facebook, Twitter profiles & more. Send better emails by knowing the context and background of the sender.● Snooze - Set your emails to come back to Inbox at a more convenient time. Got an important email while travelling? Just Snooze to Desktop and deal with it only when you’re ready. Snooze emails, not productivity.● Connected Apps - Complete your workflow without leaving your email. Add important emails to your favorite productivity apps like Todoist, Evernote, OneNote, Pocket, Trello, Zendesk, Salesforce and Asana. ● Undo Send - Pull back that email blunder you just sent. Especially useful when you’re on mobile and need to reply in a hurry.● 2-step verification - Protect your Newton account with both your password & phone.● One-click Unsubscribe - Instantly unsubscribe from unwanted email newsletters.  ● Custom Inbox Swipes - Customizable long/short swipes for actions like Delete, Archive, Mark as Read, Mark as Spam and more.● Save email attachments to your favorite​ cloud storage service like Google Drive, Box, Dropbox, OneDrive etc. with ease.● Remote Wipe your data in case you lose your device.● Custom Folder Sync - Get notified about emails that land in your folders. But wait...there’s more!- HTML signatures- Email Aliases- Turn on/off Conversations- Swipe between emails- Easy on battery and data - Passcode Lock - Mark as Spam- Interactive notifications- Unified Inbox- Available in all major languagesNewton is available as an in-app subscription for $49.99 per year. Price may vary by location. Subscriptions will be charged to your credit card through your Google account. Your subscription will automatically renew unless cancelled at least 24 hours before the end of the current period. Manage your subscriptions in Account Settings.Privacy Policy: https://newtonhq.com/k/privacypolicyTerms of Use: https://newtonhq.com/k/TOS",
    "descriptionHTML": "Newton is a subscription-based service that supercharges your email with power features like <b>Read Receipts, Snooze, Send Later, Undo Send, Sender Profile, Connected Apps</b> and more across Android Phone, Tablet and Wear. Comes with a 14-day free trial.<br> <br>Newton is available as an in-app subscription for $49.99/yr. That&#x2019;s about $4/mo for something that you use dozens of times every day.<br> <br>Works with Gmail, Exchange, Yahoo Mail, Hotmail/Outlook, iCloud, Google Apps, Office 365 and all IMAP accounts.<br><br>Supports Calendar for Gmail, Google Apps, and Exchange (EWS). Manage your email &amp; Calendar without switching between apps.<br><br><b>What Happens After 14 Days</b><br><br>The app stops working. You won&#x2019;t get new emails, push notifications and access to power features Read Receipts, Send Later, Snooze &amp; more. Definitely not an email experience we recommend.<br><br><b>Sign Up Once, Use Everywhere</b><br><br>Your Newton account is your key to all things Newton. Use it to instantly access your email anytime, across ALL your devices. It&#x2019;s that simple. <br><br>With your account, you can have all your email preferences and settings synced magically across devices - be it Android Phone, Tablet, Wear, Mac or Windows.<br><br><b>Why Newton is the only email app you need</b><br><br>&#x25CF; Instant push notifications for ALL types of email - Gmail, Hotmail/Outlook, Exchange, Yahoo Mail, iCloud, Google Apps, Office 365 and any IMAP account.<br><br>&#x25CF; Read Receipts - Get read-status for every email you send. Also get notified as soon as the email is read. Know exactly who read your email with individual mail tracking.<br><br>&#x25CF; Send Later - Schedule emails to be sent later and have them delivered to the recipient&#x2019;s inbox at just the right moment. Also, you can stop the scheduled email if the recipient emails you in between.<br><br>&#x25CF; Tidy Inbox - Focus on emails that matter. Weed out newsletters and social media emails to another folder and make your inbox distraction-free. Think Gmail tabs for all email accounts.<br><br>&#x25CF; Sender Profile - Know more about the people who email you. Get job titles, organization&#x200B; info, location, LinkedIn, Facebook, Twitter profiles &amp; more. Send better emails by knowing the context and background of the sender.<br><br>&#x25CF; Snooze - Set your emails to come back to Inbox at a more convenient time. Got an important email while travelling? Just Snooze to Desktop and deal with it only when you&#x2019;re ready. Snooze emails, not productivity.<br><br>&#x25CF; Connected Apps - Complete your workflow without leaving your email. Add important emails to your favorite productivity apps like Todoist, Evernote, OneNote, Pocket, Trello, Zendesk, Salesforce and Asana. <br><br>&#x25CF; Undo Send - Pull back that email blunder you just sent. Especially useful when you&#x2019;re on mobile and need to reply in a hurry.<br><br>&#x25CF; 2-step verification - Protect your Newton account with both your password &amp; phone.<br><br>&#x25CF; One-click Unsubscribe - Instantly unsubscribe from unwanted email newsletters.  <br><br>&#x25CF; Custom Inbox Swipes - Customizable long/short swipes for actions like Delete, Archive, Mark as Read, Mark as Spam and more.<br><br>&#x25CF; Save email attachments to your favorite&#x200B; cloud storage service like Google Drive, Box, Dropbox, OneDrive etc. with ease.<br><br>&#x25CF; Remote Wipe your data in case you lose your device.<br><br>&#x25CF; Custom Folder Sync - Get notified about emails that land in your folders. <br><br>But wait...there&#x2019;s more!<br><br>- HTML signatures<br>- Email Aliases<br>- Turn on/off Conversations<br>- Swipe between emails<br>- Easy on battery and data <br>- Passcode Lock <br>- Mark as Spam<br>- Interactive notifications<br>- Unified Inbox<br>- Available in all major languages<br><br>Newton is available as an in-app subscription for $49.99 per year. <br><br>Price may vary by location. Subscriptions will be charged to your credit card through your Google account. Your subscription will automatically renew unless cancelled at least 24 hours before the end of the current period. Manage your subscriptions in Account Settings.<br><br>Privacy Policy: https://newtonhq.com/k/privacypolicy<br>Terms of Use: https://newtonhq.com/k/TOS",
    "histogram": {
        "1": 17520,
        "2": 3212,
        "3": 6114,
        "4": 28340,
        "5": 67538
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/7832eyiW-982OaYw_3U9RDUSzPYIRR0qxaob_8rqwLZCRCExQSaHhZQX_PNgewm9TA=h310",
        "//lh3.googleusercontent.com/DnltiAnKk_gNoRH7dRyzMR5Y_jyKoWi5-_Hes7tMFsoKpUYcJWmaV4hylcHmhESOpfI=h310",
        "//lh3.googleusercontent.com/gd_8WwQXXlonbIVvDE8pHI2t-q0Mb1h1HMHWfiojtbeExYCMIODqkoaCiDzIHKiRn-rq=h310",
        "//lh3.googleusercontent.com/6X4D9CO_VKrdKswK1tS06WDijX1mpSVzdGhw3YfkbZc4GEYwTj-diUAZs-aNIqgnWDuG=h310",
        "//lh3.googleusercontent.com/v8n0A1Wt5U3TJSNl8-uIapNklm6rEi1Gm5RVPYQoAEULC6NLK5q6TnAHgZgxLesncA=h310",
        "//lh3.googleusercontent.com/ldYNCGs0v-7I50AQNwUya7IJqt13ERJntdlAGdX-FDhXGUnLLzB_8-1W7198U-zA_g=h310",
        "//lh3.googleusercontent.com/cm87RyMQI0rgTruQIyjBEEa3Ekjmj1bmjTa-G9_0DVozqTtZ0r_2cq5bUsErfn03HDo=h310",
        "//lh3.googleusercontent.com/g-5lZIfguMqRBaOrjcHCBasnfet-WaWKeYwH-yXX1_A1GIEcjwoJoBgQwUsiCXtOf006=h310",
        "//lh3.googleusercontent.com/76YXlzlKPjIw-6Hd1FEbbuXKthMtbg789hd1SnvOkArmg1wvokgCuTTLoRMk8vHa1YC2=h310",
        "//lh3.googleusercontent.com/y7exntEHC35CdQYEl7CdhzYSu5IUiTIt4cx9ipoaUiyHLQB7S8E7zkILIHtyNdLc828=h310",
        "//lh3.googleusercontent.com/LzH6n500iR-bcAWgdp4eLNy5kygsjA6tywCTC23Ai9anHQ1fY9Wsd1hGuCxXLpEecA=h310",
        "//lh3.googleusercontent.com/k7MFCzM8r4Oreie0jcJgF5FCiLlowoYMTzXmAyEYEPsj49i5HNRq5MX9hUTHspIdrtnS=h310",
        "//lh3.googleusercontent.com/0_sdZL5GgIcB3ODeJ5qXBNACRonWofR42JUTe6onbF7xwq7jl1mZsNTq7Y97HRZGhco=h310",
        "//lh3.googleusercontent.com/cAX2URtbNduY7zS73zlCEHB3SUn1vbRTIJEaz7rE-lPoDeb7vneFnr3bghGW5tas0Kkx=h310"
    ],
    "comments": [
        "Clean and efficient. Does a great job with great stability. Although 50 bucks a year is a bit steep and some functionalities could be added.",
        "By far the best email app I have ever used, I absolutely love it. I use it along side the mac app, for read receipts and reminders. It can also remind you if you don't get a reply to an email you send. I previously tried air mail and polymail and this is far better. For such a powerful tool it is worth every penny they charge. We pay a lot for other software, why should a good email client be any different! Take the trial, you won't turn back.",
        "This is the most coolest email apps I have ever used. It's really good but I'm uninstalling due to it's price. You guys can come down a bit on the pricing. Nevertheless a great job done by the devs!!",
        "Better than sliced bread. After years of using Gmail and Google Inbox I decided to try Outlook 2016...big mistake. Outlook 2016 and Outlook live suck. Newton does everything an email app should and does it well.",
        "This is not as feature rich as an Outlook. It has calendar in phone but not on desktop. It is impossible to copy a contact/email from an email. Often times I respond to emails and need to move someone from cc to to or vis versa. Send later sometimes fails and doesn't notify you, so you always have to check if it actually sent.",
        "I have Newton on multiple devices and platforms (iOS, Android, Window, Mac) - that's the reason I use and pay for the service.  Unfortunately, there's a problem with delayed syncing across all those devices, esp. if I don't use a particular device for a day or two (regardless if it's iOS, Android, Mac, Windows.)  It can take minutes to sync or even fail to fully sync unless I close and re-open the app to force another sync attempt.  Tech support says it's a known problem but the problem seems to have gotten worse over time.  Hopefully, they can resolve it soon."
    ],
    "recentChanges": [
        "- Secure your emails with fingerprint unlock",
        "Go to Settings > General > Passcode to enable it.",
        "- Optimise images before sending",
        "Trouble sending large attachments? Newton can now optimize the size of images you attach.",
        "- Bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.cloudmagic.mail&hl=en&gl=us",
    "appId": "com.cloudmagic.mail"
}