{
    "title": "News Republic: Breaking News & Local News For Free",
    "summary": "Breaking News, Latest National, Local &amp; World Headlines, Daily Curated Updates",
    "icon": "//lh3.googleusercontent.com/Tw0y51K74O5GFuO2KpHHckSOAcgT--88wwmLGCBwkJS8BnRlhVBk87gsk6XJcPrcOj43=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.3,
    "reviews": 436718,
    "developer": "News Republic",
    "developerId": "News+Republic",
    "developerEmail": "contact.store@news-republic.com",
    "developerWebsite": "http://www.news-republic.com",
    "developerAddress": "Rue Robert Caumont,\nBureaux du Lac II, Bat. P\n33049 BORDEAUX CEDEX",
    "updated": "March 2, 2018",
    "version": "Varies with device",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "size": "Varies with device",
    "description": "Get complete up-to-the-minute daily breaking news coverage and headlines from over 2,500 fully licensed & trusted news sources nationally and worldwide. Easily customizable and personalized to give you what you are interested in. Get the latest US Headlines, World News, International Headlines, Global Finance, Sports, NFL, Entertainment, Politics, Technology, Celebrity News - Over 1 million personalized topics in a lightning-fast, material design interface. • Quick to set up and access: No more truncated RSS feeds - we bring you complete articles with full text, photos and video all inside the app from trusted US, local and world news sources from New York to San Francisco, to New Delhi and Tokyo. • Smart: News Republic learns as you read, our technology personalizes your news experience automatically. • Daily News Digest: My Personalized Newsfeed is your daily breaking news and headlines briefing, built around your interests. • RSS Feeds: Add custom headlines from your favorite RSS newsfeeds. • Trending News: Keep yourself updated with the most popular trending articles and topics of the moment. • Personalized: Choose from over 1 million topics for a custom home screen and news experience. • Sports fans rejoice: Keep up with the latest news on the NFL, NBA, MLB, NHL, Global International Soccer, NASCAR, Formula 1, MotoGP news, opinion and more. • Video News: Lightning fast video newsfeeds optimized and in-app including the latest breaking International, Finance, National, Global, Tech, Entertainment and World News. Featured news partners include CBS News, Reuters, Bloomberg, Quartz, Huff Post, The Guardian, Associated Press, San Francisco Chronicle, LA Times and local newspapers as well as many more covering National, Global News, Business, Sports, NFL, Entertainment, Tech News, Science News, Celebrity News, Finance, Health and many more. • Create your own news personal profile and use across multiple devices with a free account, login with Facebook, Google+ or Email. • Offline access - Read the news and your newsfeeds while offline when you are out of coverage. Save articles for reading later, even custom RSS feeds can be read offline. Share across all your favorite apps.",
    "descriptionHTML": "Get complete up-to-the-minute daily breaking news coverage and headlines from over 2,500 fully licensed &amp; trusted news sources nationally and worldwide. Easily customizable and personalized to give you what you are interested in. <br><br>Get the latest US Headlines, World News, International Headlines, Global Finance, Sports, NFL, Entertainment, Politics, Technology, Celebrity News - Over 1 million personalized topics in a lightning-fast, material design interface. <br><br>&#x2022; Quick to set up and access: No more truncated RSS feeds - we bring you complete articles with full text, photos and video all inside the app from trusted US, local and world news sources from New York to San Francisco, to New Delhi and Tokyo. <br>&#x2022; Smart: News Republic learns as you read, our technology personalizes your news experience automatically. <br>&#x2022; Daily News Digest: My Personalized Newsfeed is your daily breaking news and headlines briefing, built around your interests. <br>&#x2022; RSS Feeds: Add custom headlines from your favorite RSS newsfeeds. <br>&#x2022; Trending News: Keep yourself updated with the most popular trending articles and topics of the moment. <br>&#x2022; Personalized: Choose from over 1 million topics for a custom home screen and news experience. <br>&#x2022; Sports fans rejoice: Keep up with the latest news on the NFL, NBA, MLB, NHL, Global International Soccer, NASCAR, Formula 1, MotoGP news, opinion and more. <br>&#x2022; Video News: Lightning fast video newsfeeds optimized and in-app including the latest breaking International, Finance, National, Global, Tech, Entertainment and World News. Featured news partners include CBS News, Reuters, Bloomberg, Quartz, Huff Post, The Guardian, Associated Press, San Francisco Chronicle, LA Times and local newspapers as well as many more covering National, Global News, Business, Sports, NFL, Entertainment, Tech News, Science News, Celebrity News, Finance, Health and many more. <br>&#x2022; Create your own news personal profile and use across multiple devices with a free account, login with Facebook, Google+ or Email. <br>&#x2022; Offline access - Read the news and your newsfeeds while offline when you are out of coverage. Save articles for reading later, even custom RSS feeds can be read offline. Share across all your favorite apps.",
    "histogram": {
        "1": 34806,
        "2": 7862,
        "3": 20175,
        "4": 106132,
        "5": 267743
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/FA8F4ed4j6z2SIftjmk4svqfZWsEXKE5IeYrOr2OpxL3IPz2VP32YG5aPmfsE_P46dNW=h310",
        "//lh3.googleusercontent.com/EHwQ_LmWm5SGMN0HzL5_FTVZylvvhq7cDZtWbFMYX9YkMNp6VTzBGCBXrZ5Ou3JZiSYQ=h310",
        "//lh3.googleusercontent.com/UouROLpU2avu-R6kPD_2fmdW0_PIuickMkp1w0ycxXnRwQcPk5SVjE2j4C4n2GV8dBk=h310",
        "//lh3.googleusercontent.com/YAEfu51gtkkmIfEJokTIMRRMzvLbl8W933xtaHYsY-xa3pMsMP9k1Vmuk2qaSsUwVYc=h310",
        "//lh3.googleusercontent.com/PlwxK1FNQo3JiYMopEuulKZYxHgeN0hQW1xeRlt9qBW5p5KShYzke65FSlQZzhMjE8OP=h310",
        "//lh3.googleusercontent.com/x_kdEjlmlTcVN_P-99zsSADpacvh4z155XFjax3fI1tWGF-jetLDAPSW-L-e0zFxHZdz=h310",
        "//lh3.googleusercontent.com/i1RbPISBn52AINxB_RdK2dh8DiR8hrM-3bfUH9rK7ABPOWiZnzc_-08YaOXF6c9rVJk=h310",
        "//lh3.googleusercontent.com/2oRskIOg9lwF6AKxuRKbbCtcYFGl1j47sJD6eOhysaEy_omILBT4P2IDJ2ZrBoLBxKU=h310",
        "//lh3.googleusercontent.com/HIL8GhR1PvyjJ-F0YGM_8Enndg0pm3d4MP0MziTkQmL9TNGOACgU8TLvmdKdh-irHOpK=h310",
        "//lh3.googleusercontent.com/BfUtvXMn5auXH9EdA0vsDy62Y147UAl3qDHtYHdEpmzUUOC9Z57358UbZDB4P-MOdQ=h310",
        "//lh3.googleusercontent.com/JJYX5pQMQo-LmaBAmqHeMIQjOWqlBVX4cZQO9j7pkZJu0FRXzKD49FPjbzL16KQM4XIR=h310"
    ],
    "video": "https://www.youtube.com/embed/CxaGK3gzUds",
    "comments": [
        "Blinkfeed never shows the topics that I am subscribed to.  I have my topics set in the app, but I'm still shown news I don't care about.",
        "Worse english seen used ever to tell a news. The sentences make no sense in many of the reported news.",
        "good app ...get it",
        "Lol",
        "For HTC Blinkfeed integration of News Republic it's a desaster. No news are loading, or news from feed that I deactivated are still loaded. News Republic please give up of supporting the HTC Blinkfeed, HTC is doing better without you. Please be honest and publish this. Edit: Just wrote u thru the app feedback sistem. Last update just reset the language and region and activated push notification. You are hungry for users",
        "I'm incredibly dissapointed with the recent update. Now that I'm unable to choose my sources the app is unusable. You are bombarded with dross about the Kardashians and the only option is to manually go through and say you're not interested in the source, not that it seems to make any difference.   If it wasn't impossible to uninstall the app from my HTC it would have been long gone."
    ],
    "recentChanges": [
        "Dear users,",
        "We are recoding the app to make it better for future versions. It is still possible that you experience issues with this version, but everything will return back to normal soon! We worked on the night mode, widget, topics, account, saved articles, recommendation engine and design. The comments are new and you can now comment without Facebook! If you experience any issue, Please send us your feedback to contact.us@news-republic.com.",
        "Thanks for your support and patience!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mobilesrepublic.appy&hl=en&gl=us",
    "appId": "com.mobilesrepublic.appy"
}