{
    "title": "Drinking regime",
    "summary": "Track your DRINKING REGIME with the application from Aquila!",
    "icon": "//lh3.ggpht.com/hw2aGX2F8bTifv0b1mw8kM5NdOBLrazqhM07J3OC2KppHniNKWly3_lhfEtUUNpqSQU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 1531,
    "developer": "Karlovarské minerální vody a.s.",
    "developerId": "Karlovarsk%C3%A9+miner%C3%A1ln%C3%AD+vody+a.s.",
    "developerEmail": "info@mattoni.cz",
    "developerWebsite": "http://www.aquilavoda.cz",
    "updated": "June 8, 2017",
    "version": "1.4.10",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Headaches and tiredness can be signals that you aren’t getting enough water. However, knocking back half a litre of water four times a day is not a good idea. The best way for our bodies to process liquids is in small but regular doses. A small glass of water every half hour is optimal. If you pour Aqualinea Natural in your glass, you can be sure that you are treating your body to liquids that have an optimal composition. This app will help you to keep a regular drinking regime: Just enter your vital stats and it will calculate your ideal daily water consumption. To record every glass, simply tap the app. Customized reminders will notify you when it is time to have another drink. Do you have a smart watch? You can start drinking smarter. You can record each glass of drink to watch. Watch will regularly warns you that it is time to drink again. And when someone asks you how much did you drink last few days, feel free to leave your phone in your pocket. The watch can display statistics for up to four days old.Download the application and see for yourself how a regular drinking regime will boost your energy for work, fun, and sports.",
    "descriptionHTML": "Headaches and tiredness can be signals that you aren&#x2019;t getting enough water. However, knocking back half a litre of water four times a day is not a good idea. <br><br><br>The best way for our bodies to process liquids is in small but regular doses. A small glass of water every half hour is optimal. If you pour Aqualinea Natural in your glass, you can be sure that you are treating your body to liquids that have an optimal composition. <br><br><br>This app will help you to keep a regular drinking regime: <br>Just enter your vital stats and it will calculate your ideal daily water consumption. <br>To record every glass, simply tap the app. <br>Customized reminders will notify you when it is time to have another drink. <br><br><br>Do you have a smart watch? You can start drinking smarter. You can record each glass of drink to watch. Watch will regularly warns you that it is time to drink again. And when someone asks you how much did you drink last few days, feel free to leave your phone in your pocket. The watch can display statistics for up to four days old.<br><br><br>Download the application and see for yourself how a regular drinking regime will boost your energy for work, fun, and sports.",
    "histogram": {
        "1": 159,
        "2": 123,
        "3": 215,
        "4": 294,
        "5": 740
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/-puepYtWaPu6nD0GcJE8s8f6bsh6JGxPqS0d7-OhaHARmjHmkNqLmRatQphvgHwV6g=h310",
        "//lh3.googleusercontent.com/QaIP8xkm3VBmbDxYzv1SiQTL0y0io2M8FDaHnpTW67UZUap-839CK-QOaNv_P19x-KBy=h310",
        "//lh3.googleusercontent.com/I1y8WAm9o3EkwIBojjc65CW9B8tniiIXz-sKOOpX_XKGqhRxe_21UAx-TfzF8m-2I41S=h310",
        "//lh3.googleusercontent.com/7sMXPZE5jDPVmolbJ_Vb-bOK8oKJXoQA7iGx76RV0w9-yrOjJVJOMo6PLZtP_rovBMep=h310",
        "//lh3.googleusercontent.com/Y-2YpTkENjiNBROcq7Qu5hQ9RCN1_mTRifgxLAHkcVH4Fx6Cz3Ieazo3Dh5HeC2HIAFp=h310"
    ],
    "comments": [
        "Doesn't work. Wear app freezes during installation.",
        "Ok app I agree that it would be good to change the measurements. My standard cup size is about 150ml, which the app cannot cope with.            The push message reminders are fine,  but not everything is translated into English.",
        "Notifications. The app is good, but I often forget to use it. It would be nice if they sent you push notifications to remind you to fill in how much you've drank.",
        "Good Does what it's supposed to do, but if you could update the application so that it doesn't open on the phone when you enter a drink, that would be great :)",
        "Pretty good and useful Add Google Fit integration.  AndroidWear not updating totals correctly. AndroidWear won't launch the app if it's not actively running on device.",
        "Gr8 app Thanks for creating an app using metric....so sick of apps that use Imperial old fashion measurements. Most of the world uses metric. Only the back water places use Imperial these days"
    ],
    "recentChanges": [
        "Vylepšili jsme sdílení, abyste mohli sdílet i mimo Facebook."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.thefuntasty.pitnyrezim&hl=en&gl=us",
    "appId": "com.thefuntasty.pitnyrezim"
}