{
    "title": "Wear Mini Launcher",
    "summary": "Your apps next to your finger",
    "icon": "//lh5.ggpht.com/SXNVOo89uCVGvpWkpYe5qF2zAZd2Akb82313Dl82LKgo6g76gziYlJg-awSkuyg8U5o=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.2,
    "reviews": 13673,
    "developer": "Mini Launcher",
    "developerId": "Mini+Launcher",
    "developerEmail": "WearMiniLauncher@gmail.com",
    "developerWebsite": "https://plus.google.com/u/1/communities/117978695237721340523",
    "developerAddress": "No8. Dongbeiwang.W Rd.\nHaidian District, Beijing\nP.R of China",
    "updated": "August 31, 2017",
    "version": "5.8.3",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Best Launcher on Android Wear Devices, Over 400,000 User's Choice Now come with 3 fully customizable interactive watch faces, access your favorite apps / toggles without activate launcher. It's often a pain to open an app on your Android Wear device. You have to remember its name or scroll through different lists to find and launch it.Wear Mini Launcher is designed to allow you to quickly launch any app from anywhere.You have also access to quick settings with the double swipe gesture. You can change the brightness of your wear device, change the wifi state, the ring mode of your handheld or make it ring to find it back!Make it looks like you! With many customization options, the launcher is now exactly as you want it to be.Customize the position to slide from the part of the screen you chose.You have to own an Android Wear device to use this appCurrently compatible devices:► HUAWEI Watch► Moto 360 Gen 2 (2015)► Moto 360 Gen 1 (2014)► Asus Zenwatch► LG G Watch► LG G Watch R► LG G Watch Urbane (Android Wear version)► Samsung Gear Live► Sony SmartWatch 3First time startTo make it work when you first install it, please:* Open the app on your smartphone while the watch is connectedor* Open the app on your watchIf the handheld app shows a loading icon multiple times, reboot your watch. It sometimes loses the connection to your smartphone.In-App purchases are only used by the donation system. The app and all the features will remain completely free.**Wear Mini Launcher was original created by Nicolas Pomepuy",
    "descriptionHTML": "<b>Best Launcher on Android Wear Devices, Over 400,000 User&apos;s Choice</b> <br><b>Now come with 3 fully customizable interactive watch faces, access your favorite apps / toggles without activate launcher.</b> <br><br>It&apos;s often a pain to open an app on your Android Wear device. You have to remember its name or scroll through different lists to find and launch it.<br><b>Wear Mini Launcher</b> is designed to allow you to quickly launch any app from anywhere.<br><br>You have also access to quick settings with the double swipe gesture. You can change the brightness of your wear device, change the wifi state, the ring mode of your handheld or make it ring to find it back!<br><br>Make it looks like you! With many customization options, the launcher is now exactly as you want it to be.<br><br>Customize the position to slide from the part of the screen you chose.<br><br><b>You have to own an Android Wear device to use this app</b><br><b>Currently compatible devices:</b><br><br>&#x25BA; HUAWEI Watch<br>&#x25BA; Moto 360 Gen 2 (2015)<br>&#x25BA; Moto 360 Gen 1 (2014)<br>&#x25BA; Asus Zenwatch<br>&#x25BA; LG G Watch<br>&#x25BA; LG G Watch R<br>&#x25BA; LG G Watch Urbane (Android Wear version)<br>&#x25BA; Samsung Gear Live<br>&#x25BA; Sony SmartWatch 3<br><br><br><b>First time start</b><br>To make it work when you first install it, please:<br>* Open the app on your smartphone while the watch is connected<br>or<br>* Open the app on your watch<br><br>If the handheld app shows a loading icon multiple times, <b>reboot your watch</b>. It sometimes loses the connection to your smartphone.<br><br>In-App purchases are only used by the donation system. The app and all the features will remain completely free.<br><br>**Wear Mini Launcher was original created by Nicolas Pomepuy",
    "histogram": {
        "1": 1097,
        "2": 458,
        "3": 907,
        "4": 2720,
        "5": 8491
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/5tmzgCK-3CcQJYcS_2kQC1aVXF7vzYEBWQwxmFMt_FUw9H9Vy8GjTMargpwSsuT6QXf7=h310",
        "//lh3.googleusercontent.com/AOi8coRsWeEAOSfkCderZwahssHx6DlYXo23Nc8RAzKPwMRNld_uq8YjAcJbwdhPCA=h310",
        "//lh3.googleusercontent.com/_kO93jItxWdzORBdjpFUxVpksfU56zy830cod5S6RHc-kizj2iKSDO9Ilh7ydvu9yQ=h310",
        "//lh3.googleusercontent.com/zqntm8iXJnlgR7aNY6k76beaW2WL-9vTfQeQ5UxzwlvHY-dABFJ3n480rLIV9Uy6A7GZ=h310",
        "//lh3.googleusercontent.com/XmF88GeMJpJp8jc0mH3YvSSsPuO98fdfEyKXLoYJl5jwqKUH13j1WHAqeq20uWiPQ_I=h310",
        "//lh3.googleusercontent.com/dO19wg3Z2tUcKpd7wqXR8tOh-41TF_dMcFwThvlqQ8UPm3pCskW2rqy5PPnjxMQj6w=h310",
        "//lh3.googleusercontent.com/GIqKcTbAPRCrSAFUWyHjzFjJYJS2kyJ0Vl9UFpo0NMHWnR4Bhnh-p8HobKD6onO207YL=h310",
        "//lh3.googleusercontent.com/0D3u4jfAtK0vv0l6HdoVkMMaHySUSLZRSGm-2ifQpZJ5FC64CIcBXQN1DYP9441niT8=h310"
    ],
    "video": "https://www.youtube.com/embed/-VO_9QFkpS4",
    "comments": [
        "Excellent, looks great, don't need use button anymore. No ads at me! Just for update step counter need change watch face and back on. After then will a step counter update, also sometimes show less than Google fit. Can you fix this please?  Edit: after update to Oreo missed some icons!!!",
        "I had this app for about a month and it was most definitely 5 Stars. However, half of the icons have recently disappeared.. . And it's not much use without them.  Come on, please fix this if you want your five stars back. I'm using a Michael Kors watch",
        "Very much enjoyed the app.   However, I would like to have an option to resize the launcher handle. It seems like it is too little and sometimes the launcher gets overridden by the system launcher, which I don't want to happen.  Also, I would like the app to let me \"split\" the app drawer and the widget drawer into two different swipes. For example, when I swipe down I get the widget drawer and when I swipe right I get the app drawer.",
        "This is an INCREDIBLE app and watch launcher.   But, once in a while the watch face becomes black and I have not found a simple way to fix that besides to delete cache and data.  Because of that, all customizations are deleted and I have to do it all over again.  Aside of that deal breaker bug, the app is amazing, but essentially unusable.  I am using Huawei watch 2.  Edit: I have found what crashes the launcher. Whenever I try to use the brightness bar on the widget drawer, the app crashes. A simple solution is to simply disable it in the customization tab.",
        "Broken after a recent update. I tried uninstalling and re-installing, but nothing works. At this point it even shows a round watch when I have the Sony Smartwatch 3 connected.  I'll put 5 stars when it works again.",
        "Suddenly stops working. Impossible to launch the app on watch. Top left drawer stops responding. App on phone shows 'not connected' warnings. Meanwhile everything else on my watch works fine. Zenwatch 2 Android Wear 2.0. //Edit: Removing app data on watch seems to fix the launch issue. But the smartphone app still can't connect."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.npi.wearminilauncher&hl=en&gl=us",
    "appId": "com.npi.wearminilauncher"
}