{
    "title": "Truecaller: Caller ID, SMS spam blocking & Dialer",
    "summary": "Use Truecaller to identify unknown calls, and block spam calls and spam SMS.",
    "icon": "//lh3.googleusercontent.com/sRmOaGKtn9ByTyHyEjPHLOqcgSdROfqiF7-q3P0B_8AkPywuZm-CDt1pX9z8Oob4Y3Od=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.5,
    "reviews": 6838796,
    "developer": "True Software Scandinavia AB",
    "developerId": "5383913004303935162",
    "developerEmail": "support@truecaller.com",
    "developerWebsite": "http://www.truecaller.com/",
    "developerAddress": "Kungsgatan 15\n111 43 Stockholm\nSweden",
    "updated": "February 27, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "250 million people trust Truecaller every day to identifying unknown calls, block spam calls and spam SMS. It filters out the unwanted, and lets you connect with people who matter.Truecaller is the only app you need to make your communication safe and efficient.  Powerful Dialer: - The world’s best Caller ID will identify any unknown caller- Block spam and telemarketing calls  - See names of unknown numbers in the call history- Flash messaging - Share location, emoji & status in a flash to your friends - Know when your friends are free to talk- Backup call history, contacts and settings to Google DriveSmart SMS app: - Automatically identify every unknown SMS - Automatically block spam and telemarketing SMS - Block by name and number series Truecaller has full dual SIM support! Truecaller will not upload your phonebook to make it public or searchable.  ----------------------- Got feedback? Write to support@truecaller.com or go to http://truecaller.com/support",
    "descriptionHTML": "250 million people trust Truecaller every day to identifying unknown calls, block spam calls and spam SMS. It filters out the unwanted, and lets you connect with people who matter.<br>Truecaller is the only app you need to make your communication safe and efficient. <br> <br>Powerful Dialer: <br>- The world&#x2019;s best Caller ID will identify any unknown caller<br>- Block spam and telemarketing calls  <br>- See names of unknown numbers in the call history<br>- Flash messaging - Share location, emoji &amp; status in a flash to your friends <br>- Know when your friends are free to talk<br>- Backup call history, contacts and settings to Google Drive<br><br>Smart SMS app: <br>- Automatically identify every unknown SMS <br>- Automatically block spam and telemarketing SMS <br>- Block by name and number series <br><br>Truecaller has full dual SIM support! <br>Truecaller will not upload your phonebook to make it public or searchable.  <br>----------------------- <br>Got feedback? Write to support@truecaller.com or go to http://truecaller.com/support",
    "histogram": {
        "1": 200417,
        "2": 113153,
        "3": 404966,
        "4": 1254591,
        "5": 4865669
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/czGHO3CEOCQaXm1h7MlF9MzQhtamj1uIhLjlyIeKRdxy-LBi1DELyKyQ6DqXrqjR9w=h310",
        "//lh3.googleusercontent.com/polVqdbWkl1JDhw3kW9KgKcAnwzQDrdR8_MSunlLw-sOgoD4GAyYbnO8OO66DTWWBfw=h310",
        "//lh3.googleusercontent.com/ggfEhHd2v3UxcoXtrGztXaexZkRbulsDXK2j0yaYGiUYq4P52RvemyENksjHkKVVNw=h310",
        "//lh3.googleusercontent.com/-pOiLR5_zaj77xu5YcnB9aNx9HdwiVXjmJapmvJ3ZK5MNOMd1Z4umYnIzzwIwOJXQQ=h310",
        "//lh3.googleusercontent.com/ik3akGqtvn83yvmokPQCAw5jbd0bfZ6x9YtMBSw8bWvM7L2JxGDI_5_0nVWTe-Pxwg=h310",
        "//lh3.googleusercontent.com/wOsQnrgpKI9P7O3ek1slpwAb1IvhewuA36Y5zU35lcueKHaO6FoGpGPqcjR4o8HsAfeK=h310"
    ],
    "comments": [
        "Superb",
        "Best app to identify unknown numbers. Love the camera scanning feature. A small feature request... Rather than backing up everything, it would be better to have an option for selecting what to backup. A lot of people already use Google Contacts for contacts. So, the only thing left to backup is call log, block list and SMS log. It would be nice if this feature is implemented. Also, it would be really nice to have backup over WiFi and an option to select what precise time the backup happens. It keeps using my mobile data always as the backup happens around 17:00 and I'm outside at that time.",
        "It's pretty handy and catches some spam callers. The main issue I have with it. The caller ID doesn't work while the call is coming in. All it says is that I need 3G/LTE OR WIFI network to identify. The issue is when ever a call is coming in, the mobile network and not the data network is the only thing active. I don't use WIFI on my phone much and even if I did, it would only be at home. This app will however tell you who is calling after you ignore it. You can call back if it's not a spam caller.",
        "Request #349295   That request number was emailed to you previously. I responded to the ticket email & sent to your address.  Licence tied to phone number. Number change disables licence. Their support is unresponsive. Their support system did send me a survey email, though. Damn shame they are so afraid of losing a penny they effectively stole my money.  Emailed them as instructed here on 20 Feb 2018. Nothing. No response. They ethyl have my $18. I still have nothing from them.",
        "MMS doesn't function, and only sends messages individually, no groups.  Caller I'd comes up under other windows which makes it useless.  I bought the pro version, and am regretting it.  Could be a 5 star app with more work and friendlier user interface.  Maybe all they need to do is have a tutorial that helps people get some answers!",
        "Truecaller should show the name when I got the call from unknown number. Instead of that, true caller shows the name of unknown caller once I receive or decline the call. There is no meaning to show the callers only which are in my contact list even though my internet data is always on."
    ],
    "recentChanges": [
        "* Performance improvements when loading SMS",
        "* Bug fixed that caused MMS to fail at times"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.truecaller&hl=en&gl=us",
    "appId": "com.truecaller"
}