{
    "title": "Wunderlist: To-Do List & Tasks",
    "summary": "Your beautiful and simple to-do list",
    "icon": "//lh5.ggpht.com/SaVG1N0oTjZ_YymlQn2Y8u4i-RgmvlsBN_6dmmTr9VwF1HRCzCi7wi-YEt0tLAXzb1c=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.6,
    "reviews": 382424,
    "developer": "6 Wunderkinder GmbH",
    "developerId": "4781674248947850944",
    "developerEmail": "support@wunderlist.com",
    "developerWebsite": "http://www.wunderlist.com",
    "developerAddress": "6 Wunderkinder GmbH\nKarl-Liebknecht-Strasse 32\n10178 Berlin\nGermany",
    "updated": "February 6, 2017",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Wunderlist helps millions of people around the world capture their ideas, things to do and places to see. Whether you’re sharing a grocery list with a loved one, working on a project, or planning a vacation, Wunderlist makes it easy to share your lists and collaborate with everyone in your life. Wunderlist instantly syncs between your phone, tablet and computer, so you can access your lists from anywhere.“The best to-do list app.” - The VergeWunderlist has also been featured in The New York Times, Lifehacker, TechCrunch, CNET, The Guardian, Wired, and Vanity Fair, just to name a few.Key Wunderlist Features:• Create all the lists you need and access them from your phone, tablet and computer• Easily share lists and collaborate with family, friends and colleagues• Start conversations about your to-dos• Attach photos, PDFs, presentations and more• Share the work and delegate to-dos• Setting a Reminder ensures you never forget important deadlines (or birthday gifts) ever again• Organize your projects for home, work and everywhere in between with FoldersWunderlist is free to download and use. Wunderlist Pro upgrades your experience and gives you unlimited access to Files, Assigning and Subtasks to help you accomplish even more for $4.99 a month through an in-app purchase.Our Terms of Use: http://www.wunderlist.com/terms-of-useOur Privacy Policy: http://www.wunderlist.com/privacy-policyLearn more about Wunderlist at www.wunderlist.com",
    "descriptionHTML": "Wunderlist helps millions of people around the world capture their ideas, things to do and places to see. Whether you&#x2019;re sharing a grocery list with a loved one, working on a project, or planning a vacation, Wunderlist makes it easy to share your lists and collaborate with everyone in your life. Wunderlist instantly syncs between your phone, tablet and computer, so you can access your lists from anywhere.<br><br>&#x201C;The best to-do list app.&#x201D; - The Verge<br><br>Wunderlist has also been featured in The New York Times, Lifehacker, TechCrunch, CNET, The Guardian, Wired, and Vanity Fair, just to name a few.<br><br>Key Wunderlist Features:<br>&#x2022; Create all the lists you need and access them from your phone, tablet and computer<br>&#x2022; Easily share lists and collaborate with family, friends and colleagues<br>&#x2022; Start conversations about your to-dos<br>&#x2022; Attach photos, PDFs, presentations and more<br>&#x2022; Share the work and delegate to-dos<br>&#x2022; Setting a Reminder ensures you never forget important deadlines (or birthday gifts) ever again<br>&#x2022; Organize your projects for home, work and everywhere in between with Folders<br><br>Wunderlist is free to download and use. Wunderlist Pro upgrades your experience and gives you unlimited access to Files, Assigning and Subtasks to help you accomplish even more for $4.99 a month through an in-app purchase.<br><br>Our Terms of Use: http://www.wunderlist.com/terms-of-use<br>Our Privacy Policy: http://www.wunderlist.com/privacy-policy<br><br>Learn more about Wunderlist at www.wunderlist.com",
    "histogram": {
        "1": 6924,
        "2": 4789,
        "3": 14986,
        "4": 93024,
        "5": 262701
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/VmDT9lQgY6hUGms3IieS4gipTQPPGSj2g6rfXlmpWN078AivvxclbIzPQkuqGsoT4nRq=h310",
        "//lh3.googleusercontent.com/Ib8W1d_qfXGy2a7OA9dDQsG-rl8RGDqCnflRIY7HD9CVPo7_1a50aEM8IWTYqYCNBw=h310",
        "//lh3.googleusercontent.com/I8r6vLJ3rBSnGUTWjuLWpBiRjyEFs1qWfAkA-C1DV6DrXyHtfxXshJ0QbKQSKiWqi0iL=h310",
        "//lh3.googleusercontent.com/-ycx4FaZZNwqx-G_5PviiFyRqwd6tER6deYGTr2AfxIYOhhjMa5CX8Sg9DTJYPp1u_8=h310",
        "//lh3.googleusercontent.com/3LEm7WaudqXzgSZzUt68AU3h8-LRhT7Hn5oLlLmughnjLhiUW8ESSxnbASR6MLhW5sw=h310",
        "//lh3.googleusercontent.com/EBa0C4WUorivlEYQiEYorR7jwBLsKy-pzPWy6xxIlCL8TXS9dqk3sf_3bVcm1FQIA0A=h310",
        "//lh3.googleusercontent.com/69tJfjyBf_EPOMfpuGCQsoNC6qllUw3iP95GNthajAybOGux-TxzOTpJTe-8mErnkEw=h310",
        "//lh3.googleusercontent.com/61CKlsu1aY7YEPAyUz1WdqLyEzYYsJmpAd68U94Q_3DCCki4LwnT5iLWmaOAUEfhfTo=h310",
        "//lh3.googleusercontent.com/-FU-yx1zA3wogj81HDthLaZF3JgZiBU3PF_4c7Od485VGChi7rL0T4RjDy4p4sNa4Wg=h310",
        "//lh3.googleusercontent.com/Kr8dWPuJiWxOGqwme1pS8fBGpwaocoOkT14Ul6Df5wIH3bbvsnfg7QDsuasNzqQ-j_M=h310",
        "//lh3.googleusercontent.com/w7MX0_sKGRR2FVYxy9Sr7rOc3Z2n2-cMie_q0ca8H3SUZ-i53g4rrgIQVgceWvcynyc=h310",
        "//lh3.googleusercontent.com/o3aHytuiYSMkCS4Aikm-NDQM8cOtYPPZDZW8A0MVWg_VZyKzfHRx8ww0FZXzrntV_w=h310",
        "//lh3.googleusercontent.com/tIQ8JR8cQri4u_TH5zevQRh-_BtF1IJuwtmRf6NwZBdMM9ypfl0hX7yTzL5bx52bO6K7=h310",
        "//lh3.googleusercontent.com/usToHNcXp0NQOH7PjYRlIMiJIaj8UQti89Gx816ZQHCAoa1Jv1cmQucIhc--X2WmQ6t5=h310",
        "//lh3.googleusercontent.com/gW_xsfx5jn8adtf2B2WlxxuYTa2e6rJYe0qy8eYHQn_Ibqw0RUbugxueDB_SgXxVqFY=h310",
        "//lh3.googleusercontent.com/Mvcd9G-cyAoHmaiOHFh-W-ZHCmsKlNT7YGgQnAGMwpF4JzUrT_RGPQDAP3-Vvej1uQw=h310",
        "//lh3.googleusercontent.com/eiJNMGLCKKR7QnGa7zGidtz2zfkPakTjrF01GElbMbMgNRlBZZNGGtoykAHsn33CWJk=h310",
        "//lh3.googleusercontent.com/h1UYp0RqaM76k22MECqE0PG9Dn4bp3RlDd1BkSMA9qE9Zm7RpWJ9G67tNTw4XhzQTQ=h310",
        "//lh3.googleusercontent.com/fNEfMvcide2toFSvaN6XqHQIaQHTHXt6Rea-oScydNAWdto40Qb74_tTtKXBOPnbtqc=h310",
        "//lh3.googleusercontent.com/dy8_mbeZw6xWzW2WdG6Sui8mN_QtQS6tu8FDDMqQQss9VqrA1ilIQ_2b4mII8KlvE-Wr=h310"
    ],
    "video": "https://www.youtube.com/embed/HjbxEhKHGuE",
    "comments": [
        "Honestly, it's a godsend if you have to coordinate your life and activities with someone else. You can share lists and keep others private (so it isn't intrusive). If you have the memory span of a gnat (like me) you can set reminders. Terrific for planning and for backup to personal calendar. I love the option to check off completed tasks (and they're not deleted so if the person you're sharing with checks it off before it's done, you can go back to review).  Even free, its a 9 on the Divorced Mom of Teenagers scale!",
        "I love the app! Loved it right from the get go.  I'm a list maker and think in terms of to-dos and scattered tasks.  Wunderlist helps me pull all those together and keep track of my thoughts in various categories. It helps me set milestones within a particular task which helps shorten the entire list,  making it more manageable.  I can also share it with my colleagues and collaborators,  so truly,  I have nothing more to ask of it. Perfect app for me!",
        "Lovely app, great interface and gradients, one of the best Todo organizer. The only complaint I have to make is about the widget: it doesn't seem to register the touch when I want to change the list from my Inbox to my Work todos. It is quite annoying especially because the widget can give you a nice, compact view of your tasks but since it doesn't update it's pointless. Hope you can fix it quickly, that would definitely convince me to give you the 5th star.",
        "It's so nice, whenever the old man goes to the store for me, I can tell exactly what isle he's on by him marking off the items as he shops. Lol it's very easy to use and convenient. Kinda slow sending new additions to the list though. If I add something sometimes he doesn't get it until after he leaves the store. They need to work on that. But other than that it's a great app. Thanks",
        "I recently left a business and had my account set to my works email. I changed my email to my personal one but during the process made a typo. Now when ever I try to correct this i am met with a message telling me the wunderlist serve is down. I receive this same message when i try to report this issue via the internal channels. When i try to use the website to correct these issue i am ment with a message directing me to the app. Please can you assist.  Regards Grant",
        "I have used this on android, ios, browser, Desktop, and Windows phone. I have been equally impressed on each platform. This app has kept me on track for school mostly. There hasn't been a single thing that I dislike about this tool and I will continue to use this.  Update: My thoughts haven't really changed much. I still absolutely love it but there's one feature that would make my life so much easier.  Integrate OneDrive and Google Drive please!"
    ],
    "recentChanges": [
        "We've been scrubbing and polishing to make our app shiny and bright for 2017. What does that mean? We've cleaned out the bugs, dusted in the corners and made a few minor improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.wunderkinder.wunderlistandroid&hl=en&gl=us",
    "appId": "com.wunderkinder.wunderlistandroid"
}