{
    "title": "InstantRecall Contact Notes",
    "summary": "Free contact note-taking app that lets you &quot;Remember Everything about People&quot;",
    "icon": "//lh5.ggpht.com/Mdfnfn_lSvVMGXlOSGOaSUYS7LsY35LzDCCrnGiisycxMpbFocVV3f8Z3yP9vjrgeq8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.3,
    "reviews": 67,
    "developer": "InstantRecall.io",
    "developerId": "InstantRecall.io",
    "developerEmail": "info@neurocrunch.com",
    "developerWebsite": "http://www.instantrecall.io",
    "developerAddress": "66 Emanuel Drive, Suite 100\nBoxboro, MA 01719",
    "updated": "January 24, 2017",
    "version": "3.1.0",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "InstantRecall is a free note-taking app that lets you \"Remember Everything about People\". We complement your existing contact manager by replicating your smartphone's contacts. You can then easily add unlimited notes to each contact by using your voice or typing. Add notes about a contact's hobbies, interests, education, achievements, and more. Tag the contact notes for easy sorting. Display your notes on your smartphone or smartwatch -- it's a modern rolodex of personal information about your contacts. Our note taking app makes it easy to remember and instantly recall these notes. Never again will you forget the name of a client's spouse or a friend's favorite sports team. It's like having a perfect memory with instant recall! Free Features:-Quickly add and recall contact information using the Notes editor-Create a Profile screen that provides a summary of your contact’s key personal information-Tag your contact notes for easy sorting and retrieval-Automatically replicates contacts from your phone's contact manager-Rolodex display of all your contacts, or sort by recent contacts, starred, or groups  -”Dialer feature”: call, text, or email your contact by pressing and holding on a contact’s photo-Display notes about a contact - while you are talking on the phone-Reminds you of key events such as birthdays and anniversaries, or a specific note -Copy information directly into InstantRecall notes from virtually any application-Backup and Restore capability-Use Voice Mode (BETA) to add and recall notes using your voice:   *Easily add notes by speaking to your smartphone or smartwatch using a simple command (“Add a note to Jayesh Shah”).   *Easily display notes on your smartphone or smartwatch using simple commands such as “Jayesh Shah notes”,  or “Jayesh Shah’s spouse”. Premium Features:- Unlimited notes- Create custom fields for the Profile screenWhy use this contact notes app? Do you find it challenging to remember names and important personal details of friends and colleagues? Do you wish you had a perfect memory? Our mission is to help you build stronger relationships by \"Remembering Everything about People\".InstantRecall is a new-age rolodex contact information manager! Suffering from memory loss or early stage Alzheimers? InstantRecall can help you remember names, contact information and related personal information. *** Check out instantrecall.io/blog for useful tips and tutorials ***Key New V3 FeaturesVoice Mode:-Say “help” and Voice Mode will respond with a list of voice commands. Dialer:-Press and hold on a Contact’s photo anywhere in the application, and a pop-up menu is displayed that allows you to call, text, or email your contact.-A notification is triggered when you receive a call from one of your contacts. Clicking on the notification displays your contact’s notes - while you are talking.Daily Reminders:-Be reminded of key events such as birthdays and anniversaries, and add a reminder alarm to a specific note. Improved User Experience:-Consistent actions when tapping or tapping and holding a contact:-Tapping on a contact’s name or photo takes you to the notes screen-Tapping and holding a contact’s name lets you add a note. -Tapping and holding a contact’s photo takes you to the Dialer pop-upNotes screen:-Edit the date and time of a note-Add a hyperlink to a web pageFloating Action Bar:-Add a contact directly in InstantRecall. Contact is replicated as a local contact on your phone.",
    "descriptionHTML": "InstantRecall is a free note-taking app that lets you &quot;Remember Everything about People&quot;. <br><br>We complement your existing contact manager by replicating your smartphone&apos;s contacts. You can then easily add unlimited notes to each contact by using your voice or typing. Add notes about a contact&apos;s hobbies, interests, education, achievements, and more. Tag the contact notes for easy sorting. Display your notes on your smartphone or smartwatch -- it&apos;s a modern rolodex of personal information about your contacts. <br><br>Our note taking app makes it easy to remember and instantly recall these notes. Never again will you forget the name of a client&apos;s spouse or a friend&apos;s favorite sports team. It&apos;s like having a perfect memory with instant recall! <br><br>Free Features:<br><br>-Quickly add and recall contact information using the Notes editor<br>-Create a Profile screen that provides a summary of your contact&#x2019;s key personal information<br>-Tag your contact notes for easy sorting and retrieval<br>-Automatically replicates contacts from your phone&apos;s contact manager<br>-Rolodex display of all your contacts, or sort by recent contacts, starred, or groups  <br>-&#x201D;Dialer feature&#x201D;: call, text, or email your contact by pressing and holding on a contact&#x2019;s photo<br>-Display notes about a contact - while you are talking on the phone<br>-Reminds you of key events such as birthdays and anniversaries, or a specific note <br>-Copy information directly into InstantRecall notes from virtually any application<br>-Backup and Restore capability<br>-Use Voice Mode (BETA) to add and recall notes using your voice:<br>   *Easily add notes by speaking to your smartphone or smartwatch using a simple command (&#x201C;Add a note to Jayesh Shah&#x201D;). <br>  *Easily display notes on your smartphone or smartwatch using simple commands such as &#x201C;Jayesh Shah notes&#x201D;,  or &#x201C;Jayesh Shah&#x2019;s spouse&#x201D;. <br><br>Premium Features:<br>- Unlimited notes<br>- Create custom fields for the Profile screen<br><br>Why use this contact notes app? <br><br>Do you find it challenging to remember names and important personal details of friends and colleagues? Do you wish you had a perfect memory? Our mission is to help you build stronger relationships by &quot;Remembering Everything about People&quot;.<br><br>InstantRecall is a new-age rolodex contact information manager! <br><br>Suffering from memory loss or early stage Alzheimers? InstantRecall can help you remember names, contact information and related personal information. <br><br>*** Check out instantrecall.io/blog for useful tips and tutorials ***<br><br>Key New V3 Features<br><br>Voice Mode:<br><br>-Say &#x201C;help&#x201D; and Voice Mode will respond with a list of voice commands. <br><br>Dialer:<br><br>-Press and hold on a Contact&#x2019;s photo anywhere in the application, and a pop-up menu is displayed that allows you to call, text, or email your contact.<br>-A notification is triggered when you receive a call from one of your contacts. Clicking on the notification displays your contact&#x2019;s notes - while you are talking.<br><br>Daily Reminders:<br><br>-Be reminded of key events such as birthdays and anniversaries, and add a reminder alarm to a specific note. <br><br>Improved User Experience:<br><br>-Consistent actions when tapping or tapping and holding a contact:<br>-Tapping on a contact&#x2019;s name or photo takes you to the notes screen<br>-Tapping and holding a contact&#x2019;s name lets you add a note. <br>-Tapping and holding a contact&#x2019;s photo takes you to the Dialer pop-up<br><br>Notes screen:<br><br>-Edit the date and time of a note<br>-Add a hyperlink to a web page<br><br>Floating Action Bar:<br><br>-Add a contact directly in InstantRecall. Contact is replicated as a local contact on your phone.",
    "histogram": {
        "1": 3,
        "2": 5,
        "3": 7,
        "4": 7,
        "5": 45
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/sTJoUvWffcrNcpdDKAFaRfY6kUPb4jMqE2uqmFhijUS5ecAsw-eoJ6kEoOk2lVLW69Q=h310",
        "//lh6.ggpht.com/6FjoOdoS29nRrkXV3yXnkETxV9fWTofjNRlHTTg_EHYqTxsV2_OL8J7ire-PvLccDCQ=h310",
        "//lh6.ggpht.com/Ml0hoQztF7m_aOslzFgnPqX--TZ337-jrPGYeVuhMTAHB3szbTuseKmXdd2HMKXzf620=h310",
        "//lh6.ggpht.com/JMC9mbts5a0ehhBdHzEac3z1Gh2W4ZHAMdvvJd6CfvBjLWVhkTjr-fTPYyI52ltDAPFF=h310",
        "//lh3.ggpht.com/8EoimZJxDpFyNWn_KeOAyRImYjmC6Q4DELjlaak7by5OQZUMLvFuqgrRK4f6-QdwAeyb=h310",
        "//lh3.ggpht.com/T2n4a7Fe1oS461Xdw3MXPJ7D2IXJPnHNXpIaNjPAmOVCL_E1_OaMGgIB3sW0Arw8_sj9=h310",
        "//lh3.ggpht.com/BlSXyWwxtR9cMttlftnDN5E2On9Ea0CwszAKIDsCcjo3eMYfhj7yWqEPCNMQnbQQnA=h310",
        "//lh3.googleusercontent.com/xvBbk1tfjEsZ9Q9RXjZMGUuMUNbUO7THef5UxTveMk7d7R9KQ--JyFmfuzVbZrsAo3Gj=h310"
    ],
    "video": "https://www.youtube.com/embed/pWGjqpwP8Lw",
    "comments": [
        "Contact notes is better.  It actually shows notes that are already in my contacts.  Where this app wants me to make all new notes.",
        "Best note taking app for contacts",
        "Wonderful app. Use this app all the time to remember info about my friends.",
        "Great app! Use it all the time..",
        "Great app Very functional",
        "Nice Me keep who me love!"
    ],
    "recentChanges": [
        "UI Enhancements",
        "Dialer: Tap and hold on a Contact’s photo to call, text, or email your contact. Display your contact’s notes on your phone when talking.",
        "Daily Reminders: Be reminded of birthdays and anniversaries, and add a reminder alarm to a specific note.",
        "Notes screen: Toggle on/off the date and time of note. Edit the date/time of a note.",
        "Floating Action Bar: Add a contact directly to InstantRecall."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.neurocrunch.contact&hl=en&gl=us",
    "appId": "com.neurocrunch.contact"
}