{
    "title": "ASUS Email",
    "summary": "Manage your emails efficiently, intuitively and smartly",
    "icon": "//lh3.googleusercontent.com/nQgdFMATyWOL7Nms1jK3c7u97KAdQ67LL42cJnYkqldlTGsaNERf72q6dMQIENs3-g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.6,
    "reviews": 262534,
    "developer": "ZenUI, ASUS Computer Inc.",
    "developerId": "6704106470901776285",
    "developerEmail": "zenui@asus.com",
    "developerWebsite": "http://www.asus.com",
    "developerAddress": "NO. 400, Sec. 7, Chende Rd., Beitou Dist., Taipei 112, Taiwan",
    "updated": "July 25, 2016",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "ASUS Email is the only app you need to manage multiple inboxes across all your mobile devices! With multiple preset email services included setup is as easy as could be, and ASUS Email’s VIP filter enables super-efficient message organization so you’ll never again miss messages from your most important contacts. ASUS Email integrates seamlessly with other ASUS ZenUI tools, displaying an unread-messages badge in ASUS ZenUI Launcher and enabling email-related tasks to be marked with ASUS ZenUI Do It Later. Intelligent sorting, seamless integration, intuitive operation and beautiful design — ASUS Email has everything you need to stay on top of your inbox![Key Features]- Choose ‘Combined view’ to manage multiple email accounts in one easy-to-browse inbox.- Navigate conversations quickly and easily by grouping messages by subject or sender or sort messages by date.- Never miss an important message again, by marking selected contacts as VIPs.- Your days will flow smoother than ever with ASUS ZenUI Do It Later integration, allowing you to add selected messages to your to-do list.- Automatic fast filters let you view emails marked as Flagged, Important, Invitation or Attached for easier management of what matters now.- Quickly create and send meeting invitations with ASUS Calendar integration.[Tips]1. Effortlessly select accounts and filters by swiping right from the left edge of the screen, opening the navigation panel.2. Browse Inbox and Sent folders simply by tapping ‘Inbox + Sent’ ASUS Email in the navigation panel.3. View emails from VIP contacts by selecting the VIP filter in the navigation panel. Mark contacts as VIPs in the ZenUI People app.4. Select ‘Combined view’ from the navigation panel to see all your emails in one easy-to-browse inbox.[Notes]1. The appearance and operation of some features may vary,depending on your device.2. ASUS Email is a free app for ASUS devices. You will not be charged for downloading or using this app.[Contact Us]For more information about ASUS Email, please visit http://www.asus.com/ASUS_ZenUI/Email: zenui@asus.com",
    "descriptionHTML": "ASUS Email is the only app you need to manage multiple inboxes across all your mobile devices! With multiple preset email services included setup is as easy as could be, and ASUS Email&#x2019;s VIP filter enables super-efficient message organization so you&#x2019;ll never again miss messages from your most important contacts. ASUS Email integrates seamlessly with other ASUS ZenUI tools, displaying an unread-messages badge in ASUS ZenUI Launcher and enabling email-related tasks to be marked with ASUS ZenUI Do It Later. Intelligent sorting, seamless integration, intuitive operation and beautiful design &#x2014; ASUS Email has everything you need to stay on top of your inbox!<br><br><b>[Key Features]</b><br>- Choose &#x2018;Combined view&#x2019; to manage multiple email accounts in one easy-to-browse inbox.<br>- Navigate conversations quickly and easily by grouping messages by subject or sender or sort messages by date.<br>- Never miss an important message again, by marking selected contacts as VIPs.<br>- Your days will flow smoother than ever with ASUS ZenUI Do It Later integration, allowing you to add selected messages to your to-do list.<br>- Automatic fast filters let you view emails marked as Flagged, Important, Invitation or Attached for easier management of what matters now.<br>- Quickly create and send meeting invitations with ASUS Calendar integration.<br><br><b>[Tips]</b><br>1. Effortlessly select accounts and filters by swiping right from the left edge of the screen, opening the navigation panel.<br>2. Browse Inbox and Sent folders simply by tapping &#x2018;Inbox + Sent&#x2019; ASUS Email in the navigation panel.<br>3. View emails from VIP contacts by selecting the VIP filter in the navigation panel. Mark contacts as VIPs in the ZenUI People app.<br>4. Select &#x2018;Combined view&#x2019; from the navigation panel to see all your emails in one easy-to-browse inbox.<br><br><b>[Notes]</b><br>1. The appearance and operation of some features may vary,depending on your device.<br>2. ASUS Email is a free app for ASUS devices. You will not be charged for downloading or using this app.<br><br><b>[Contact Us]</b><br>For more information about ASUS Email, please visit http://www.asus.com/ASUS_ZenUI/<br>Email: zenui@asus.com",
    "histogram": {
        "1": 4855,
        "2": 3127,
        "3": 13955,
        "4": 44144,
        "5": 196453
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/SnfZIUAtG7J98crLqTz-aAAQaZc8DEVtr51I0K_Kp4B_Ibn4Pbr3DflTVKA1C4pdcIc=h310",
        "//lh3.googleusercontent.com/Cf3OxnAKq5iAQACLZO-TI_1VG7lA55CucURK2xoUnS0APqPinUSZTOGpXUEjgyBfOUc=h310",
        "//lh3.googleusercontent.com/hC87EUlGK_ouTC_0Wp8z0Pb_2LnhSRfDCKAKQspp_x-UHO-OSDtKcaj74NkCdw3ifjY=h310",
        "//lh3.googleusercontent.com/9vqtawX98tAMgc4x14HhPfIAsSMYhFArdY8UqO8a0x4mSgT9SzDN3g21By5jj6w53Zdz=h310",
        "//lh6.ggpht.com/vDQtoWU_bCH8geWeViNXCyjqprFGJyYZcyGlNW6JBfSFSDn484gqLFsfI7GLt071EHi9=h310",
        "//lh6.ggpht.com/TACP6mcNxzWmSao3PjqXpIb-AIA5-a9qDq1HZnyzyR8aftbHTM3DPnuUy_i6B7gRyw=h310",
        "//lh6.ggpht.com/rOeZDg1CnQ4M0SN1-UEo20oCRo9dlU8PFpbJBbLQjtSeLqgudMFKcqbqxtzn87tpxaQ=h310",
        "//lh6.ggpht.com/oK1BiBmiaNUR9Oan2ombOSQI0BcGS-Uto1O--K_ggt8b1tk9VdzaNVjstZARIqknjA=h310",
        "//lh4.ggpht.com/sf1KwU1gjTtfgPaaeIdv1sSndgGG125bWtS9Mb8Tkf4KZ7awMkLMFBiYgB5JWxLiX0a7=h310",
        "//lh5.ggpht.com/xSIHLF2lIOY6pHLej-BDvg9MywRro7lkYcRhF_4gD7ssA4dduxBOgi7rvZA-D1kBIOw=h310",
        "//lh4.ggpht.com/Ru0EewfKXou63wCFiV-_ptuvH5IocQXNmHhzEk96XqVkPiM-jZJho3GlZqb7DWjrIYY=h310"
    ],
    "comments": [
        "Says it's incompatible with my device. It's preloaded software on ZenFone Selfie. how could it be incompatible??? Actually I installed the updated version straight from apk and it works fine. Dark theme does not apply to the widget. This is a bug.",
        "Error again Facing error now and then. After sending mails, sent items still shows empty.kindly fix it.",
        "I am not able to delete emails. I have changed my preferences to stop receiving Google play emails but they continue to show up. Gmail sucks",
        "I really like this app, but after a factory reset of my Zenfone 2, I get a message that it is now incompatible with my device. Please fix. I like the integration with the other Asus apps and I don't want to resort to Gmail.",
        "Every day this entry draft report and other wonderful creations the best and most importantly Happy New world wide web design and development company",
        "Easy to handle but.... If only i can delete the old email easily  i would like to love it!"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.asus.email&hl=en&gl=us",
    "appId": "com.asus.email"
}