{
    "title": "Password Manager SafeInCloud",
    "summary": "The best cross-platform Password Manager with cloud sync and free Desktop app.",
    "icon": "//lh3.googleusercontent.com/LZEF76NQo_8gVuWukD8dxGGLqmJEY2v2uiRSLWePdRH1al2OArCvSIW3y2gZrGUD5TI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.3,
    "reviews": 7280,
    "developer": "SafeInCloud",
    "developerId": "SafeInCloud",
    "developerEmail": "support@safe-in-cloud.com",
    "developerWebsite": "http://www.safe-in-cloud.com",
    "developerAddress": "5th Voykovskiy Proezd 16, Moscow, Russia, 125171",
    "updated": "February 23, 2018",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "SafeInCloud Password Manager allows you to keep your logins, passwords, and other private info safe and secure in an encrypted database. You can synchronize your data with another phone, tablet, Mac or PC via your own cloud account.All Pro features are free for two weeks, then you can unlock the full application functionality with a single in-app purchase. No subscriptions, no monthly fees!KEY FEATURES◆ Easy to Use◆ Material Design◆ Black Theme◆ Strong Encryption (256-bit Advanced Encryption Standard)◆ Cloud Synchronization (Google Drive, Dropbox, OneDrive, Yandex Disk, NAS, ownCloud, WebDAV)◆ Login with Fingerprint (Samsung devices & Android 6.0 devices)◆ Android Wear App◆ Password Strength Analysis◆ Password Generator◆ Browser Integration◆ Free Desktop App (Windows, Mac)◆ Automatic Data Import◆ Cross-PlatformEASY TO USETry it yourself and enjoy an easy-to-use yet powerful user interface.MATERIAL DESIGNSafeInCloud was completely redesigned to match new Material Design user interface language by Google. In addition to the standard Light theme SafeInCloud also has a Dark theme option to help you saving a significant amount of battery life.STRONG ENCRYPTIONYour data is always encrypted on a device and in a cloud with a strong 256-bit Advanced Encryption Standard (AES). This algorithm is used by the U.S. Government for protection of a top secret information. AES is also widely adopted worldwide and became the de facto encryption standard.CLOUD SYNCHRONIZATIONYour database is automatically synchronized with your own cloud account (Google Drive, Dropbox, OneDrive, Yandex Disk, NAS, ownCloud, WebDAV). Thus you can easily restore your entire database from a cloud to a new phone or computer (in case of a loss or an upgrade). Your phone, tablet and computer are also automatically synchronized between each other via a cloud.LOGIN WITH FINGERPRINTYou can instantly unlock SafeInCloud with a fingerprint on devices with a fingerprint sensor. This feature is available on all Samsung devices. Devices from other manufacturers should have Android 6.0 or higher.ANDROID WEAR APPYou can put some selected cards on your wrist to easily access them on the run. These could be your credit card PINs, door and locker codes.PASSWORD STRENGTH ANALYSISSafeInCloud analyses your password strengths and shows a strength indicator next to each password. The strength indicator displays an estimated crack time for a password. All cards with weak passwords are marked with a red sign.PASSWORD GENERATORThe password generator helps you generating random and secure passwords. There is also an option to generate memorable, but still strong passwords.BROWSER INTEGRATIONThe Desktop application integrates with a browser. This allows you to paste passwords directly into web pages. You don't need to manually copy and paste passwords from SafeInCloud into a browser. The mobile application contains a built-in browser with a similar password auto-fill functionality.FREE DESKTOP APPDownload a free Desktop application for Windows or Mac OS from www.safe-in-cloud.com to be able access your database on your computer. The Desktop application also makes data entry and editing fast and easy using a hardware keyboard.AUTOMATIC DATA IMPORTThe Desktop application can automatically import your data from another password manager. You don't need to manually reenter all your passwords.CROSS PLATFORMSafeInCloud is available on the following platforms: Mac (OS X), iOS (iPhone and iPad), Windows, and Android.",
    "descriptionHTML": "SafeInCloud Password Manager allows you to keep your logins, passwords, and other private info safe and secure in an encrypted database. You can synchronize your data with another phone, tablet, Mac or PC via your own cloud account.<br><br>All Pro features are free for two weeks, then you can unlock the full application functionality with a single in-app purchase. No subscriptions, no monthly fees!<br><br><b>KEY FEATURES</b><br>&#x25C6; Easy to Use<br>&#x25C6; Material Design<br>&#x25C6; Black Theme<br>&#x25C6; Strong Encryption (256-bit Advanced Encryption Standard)<br>&#x25C6; Cloud Synchronization (Google Drive, Dropbox, OneDrive, Yandex Disk, NAS, ownCloud, WebDAV)<br>&#x25C6; Login with Fingerprint (Samsung devices &amp; Android 6.0 devices)<br>&#x25C6; Android Wear App<br>&#x25C6; Password Strength Analysis<br>&#x25C6; Password Generator<br>&#x25C6; Browser Integration<br>&#x25C6; Free Desktop App (Windows, Mac)<br>&#x25C6; Automatic Data Import<br>&#x25C6; Cross-Platform<br><br><b>EASY TO USE</b><br>Try it yourself and enjoy an easy-to-use yet powerful user interface.<br><br><b>MATERIAL DESIGN</b><br>SafeInCloud was completely redesigned to match new Material Design user interface language by Google. In addition to the standard Light theme SafeInCloud also has a Dark theme option to help you saving a significant amount of battery life.<br><br><b>STRONG ENCRYPTION</b><br>Your data is always encrypted on a device and in a cloud with a strong 256-bit Advanced Encryption Standard (AES). This algorithm is used by the U.S. Government for protection of a top secret information. AES is also widely adopted worldwide and became the de facto encryption standard.<br><br><b>CLOUD SYNCHRONIZATION</b><br>Your database is automatically synchronized with your own cloud account (Google Drive, Dropbox, OneDrive, Yandex Disk, NAS, ownCloud, WebDAV). Thus you can easily restore your entire database from a cloud to a new phone or computer (in case of a loss or an upgrade). Your phone, tablet and computer are also automatically synchronized between each other via a cloud.<br><br><b>LOGIN WITH FINGERPRINT</b><br>You can instantly unlock SafeInCloud with a fingerprint on devices with a fingerprint sensor. This feature is available on all Samsung devices. Devices from other manufacturers should have Android 6.0 or higher.<br><br><b>ANDROID WEAR APP</b><br>You can put some selected cards on your wrist to easily access them on the run. These could be your credit card PINs, door and locker codes.<br><br><b>PASSWORD STRENGTH ANALYSIS</b><br>SafeInCloud analyses your password strengths and shows a strength indicator next to each password. The strength indicator displays an estimated crack time for a password. All cards with weak passwords are marked with a red sign.<br><br><b>PASSWORD GENERATOR</b><br>The password generator helps you generating random and secure passwords. There is also an option to generate memorable, but still strong passwords.<br><br><b>BROWSER INTEGRATION</b><br>The Desktop application integrates with a browser. This allows you to paste passwords directly into web pages. You don&apos;t need to manually copy and paste passwords from SafeInCloud into a browser. The mobile application contains a built-in browser with a similar password auto-fill functionality.<br><br><b>FREE DESKTOP APP</b><br>Download a free Desktop application for Windows or Mac OS from www.safe-in-cloud.com to be able access your database on your computer. The Desktop application also makes data entry and editing fast and easy using a hardware keyboard.<br><br><b>AUTOMATIC DATA IMPORT</b><br>The Desktop application can automatically import your data from another password manager. You don&apos;t need to manually reenter all your passwords.<br><br><b>CROSS PLATFORM</b><br>SafeInCloud is available on the following platforms: Mac (OS X), iOS (iPhone and iPad), Windows, and Android.",
    "histogram": {
        "1": 540,
        "2": 237,
        "3": 457,
        "4": 1067,
        "5": 4979
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/cTMdNlub9Rm6a6cfOVX_ebUCkZpGh7n8Kh7foFudr05ssy2CpJq7tSHcwlAGUDxLLQ=h310",
        "//lh3.googleusercontent.com/yJasQK3qAvVMEhXb9pP2HSO1VZuRDpO8OZz1eCJ6yBAiDO9WSHNVF3ov-tIObeT-uYsj=h310",
        "//lh3.googleusercontent.com/UrC3IZmN2CLszcgp7AvgBGrAxmT4Ez3_BCBsllirp2sjLRlzrw-R2j5e0eZo4NqyyA8=h310",
        "//lh3.googleusercontent.com/eQwjEnz6wCtTOa-5p-zG5FkEozRRh2uWicvPNbxI3G1QpjIqdEsRfjdvjEfM_kSpgg=h310",
        "//lh3.googleusercontent.com/dnYBM9wt5Z8RZuiiOhKmZnzLxc-zFNBHqG_YvqSNwvwcOW4V15ynL3PeNIpW6Pn8wK0=h310",
        "//lh3.googleusercontent.com/weQr9Hd1qXYf0ZF4LxcfM_ZiVGTeqhE5iQipDDffH_eJsG3cW38-a3J16P9giAM30w=h310",
        "//lh3.googleusercontent.com/Pvh_Nhz6acIln2oBtns_dpjBoG2jkFZlh0S-STBomizSrhtiAZ-ThL9A0XDK6J8A0SBE=h310",
        "//lh3.googleusercontent.com/kykfbKeabtVRvn9zwgOwJVeNv_2PmtuBx6X6DYuyPmy3eKtvePCuA1nux9F_eZkZxFE=h310",
        "//lh3.googleusercontent.com/uJJHZYSn3r1EgTRGH69vDeMiNqQXD9YBhqy-Igl81-aEjIzFTfCfDkASJA9Ifl_ssOM=h310",
        "//lh3.googleusercontent.com/gsEo9c5_gOa5B_VH_MygA4qdecKra6F2iyO4pm7KIqWXdaeFv6XRE6hl9I2u3ni2PNs=h310",
        "//lh3.googleusercontent.com/JsKN2nh1HYFe6QVHXPPmepYdBOjr8Cnz9ms85fyGLnXfcpW2CAu0YO95y6NCTb0aIQ=h310",
        "//lh3.googleusercontent.com/ASNICpNlmTf3CNSrpC4EVBB01bDEkm7hnke7waNQk_hpjVHz5h3Sf1AgnoJfqfbSsw=h310",
        "//lh3.googleusercontent.com/TUq971NWp3UeQHe7DfGJsmN6jsv6bbh_ePKj-rKVPoaaDmwq6l1tqBfYFraK_oAUTvE=h310"
    ],
    "comments": [
        "As described, the best cross-platform Password Manager with cloud sync and free Desktop app. Fast cloud sync on Android, IOS, Mac and latest Windows 10. Can attach resized and cropped images (and files) and still smaller in size. Have imported from Keepass to save re-entry and plus pulls website icons easily. Bought the one-off payment  pro version as loving it so far. Best to install free one first to get the icon shortcut on mobile to open database as found you do not get this with pro install first. With fingerprint unlock and now expiry date (23 Feb 2018) too. Kudos to developer.",
        "Works beautifully. There's only a handful of apps I pay for and this is one of them. The import feature they have is EXTREMELY comprehensive and robust. An obscure old manager of mine was discontinued, so I had to switch. SIC was there only one that allowed straightforward import, and I looked at a few before making the jump. Worth the money for sync capabilities to PC.",
        "Can no longer add passwords without purchasing pro version. They don't say if it is a one time fee or annual. Not worth an annual $5 fee, to many other options.",
        "Pleasantly easy to use and accepted all info from a different brand password protector faultlessly. Also the scanned items feature comes in very handy. A winner !!",
        "Very excellent application I have used handysafe but this is better can be attached image file  & notes",
        "I am using this app for 1 years and it's been a great."
    ],
    "recentChanges": [
        "◆ Warning of expiring cards",
        "◆ New labels: Expiring, Expired",
        "◆ New field type: Expiry",
        "◆ New symbols: RuPay, rupee",
        "◆ Deprecated sync with Yandex Disk",
        "◆ Bug fixes",
        "If you have questions, suggestions or problems, please contact support@safe-in-cloud.com."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.safeincloud.free&hl=en&gl=us",
    "appId": "com.safeincloud.free"
}