{
    "title": "Desjardins mobile services",
    "summary": "Desjardins mobile services",
    "icon": "https://lh5.ggpht.com/EEUq6EKdHvyXis4VexVmxks3U6DXKv9-AkyX2WajzHC6SJQZBFGImMsAv6q3qTmXTpUt=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4,
    "reviews": 8660,
    "developer": "Desjardins",
    "developerId": "Desjardins",
    "developerEmail": "info@desjardins.com",
    "developerWebsite": "http://www.desjardins.com",
    "developerAddress": "Fédération des caisses Desjardins du Québec\n100 avenue des Commandeurs\nLévis QC G6V 7N5",
    "updated": "February 8, 2018",
    "version": "4.4.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Use Desjardins mobile services to make your standard business or personal financial transactions securely and get financial information, no matter where you are. Certain functions also available on Android Wear.Use AccèsD mobile to:• deposit cheques by taking a photo of them, without having to go to your caisse or an ATM• make purchases with Android Pay.• check your caisse, credit card and prepaid card account balances without having to log on with InstaBalance, whether you are an individual or business member. Also available to non-members who are Desjardins credit or prepaid cardholders• turn on and receive Desjardins notifications• search transactions made in the last 12 months in your various caisse accounts by type and period• pay your bills, suppliers, credit card accounts and Accord D financing plan and repay your line of credit• add service providers and organizations for bill payments• transfer funds between your accounts and between individuals (including transfers to accounts of Desjardins credit cardholders) and add or delete recipients• make Interac e-Transfers®• select a monthly plan or change your current one• open or close a High Interest S@vings Account or Enhanced Investment Business Account or invest in Term S@vings• renew your market-linked guaranteed investments and Term Savings deposits• create, track, modify a project as part of My Savings Plan or support a loved one’s savings plan• use the Hop ’n S@ve instant savings tool and receive notifications to help you reach your goals • get access to Desjardins credit card cash advances• apply for a credit card or mortgage loan• use the My budget tool to manage your budget• make an RRSP contribution to your Regular Savings Account RRSP• see, modify or delete pending transactions• register for AccèsD • reactivate your AccèsD password• contact a Desjardins advisor by secure message, whether with your caisse or other Desjardins Group componentsYou can also use Desjardins mobile services to:• access new content like financial tips and information about various products and services• find a caisse, Desjardins Business centre or ATM• get the phone numbers to reach us• use the currency converter• check rates• follow the stock market and trade securities on the Disnat mobile site• check Desjardins job opportunities• access the Desjardins assistance services and Ajusto mobile apps• request a car or tenant insurance quote• see Desjardins Member Advantages• open an account and become a memberN.B.: Features available on AccèsD mobile and AccèsD Affaires mobile may vary.® Interac e-Transfer is a registered trademark of Interac Inc. Used under license.***********************************Your satisfaction is a top priority and is key to helping us improve our mobile services. Keep sending us your feedback by email at info@desjardins.com.***********************************",
    "descriptionHTML": "Use Desjardins mobile services to make your standard business or personal financial transactions securely and get financial information, no matter where you are. Certain functions also available on Android Wear.<br><br>Use Acc&#xE8;sD mobile to:<br>&#x2022; deposit cheques by taking a photo of them, without having to go to your caisse or an ATM<br>&#x2022; make purchases with Android Pay.<br>&#x2022; check your caisse, credit card and prepaid card account balances without having to log on with InstaBalance, whether you are an individual or business member. Also available to non-members who are Desjardins credit or prepaid cardholders<br>&#x2022; turn on and receive Desjardins notifications<br>&#x2022; search transactions made in the last 12 months in your various caisse accounts by type and period<br>&#x2022; pay your bills, suppliers, credit card accounts and Accord D financing plan and repay your line of credit<br>&#x2022; add service providers and organizations for bill payments<br>&#x2022; transfer funds between your accounts and between individuals (including transfers to accounts of Desjardins credit cardholders) and add or delete recipients<br>&#x2022; make Interac e-Transfers&#xAE;<br>&#x2022; select a monthly plan or change your current one<br>&#x2022; open or close a High Interest S@vings Account or Enhanced Investment Business Account or invest in Term S@vings<br>&#x2022; renew your market-linked guaranteed investments and Term Savings deposits<br>&#x2022; create, track, modify a project as part of My Savings Plan or support a loved one&#x2019;s savings plan<br>&#x2022; use the Hop &#x2019;n S@ve instant savings tool and receive notifications to help you reach your goals <br>&#x2022; get access to Desjardins credit card cash advances<br>&#x2022; apply for a credit card or mortgage loan<br>&#x2022; use the My budget tool to manage your budget<br>&#x2022; make an RRSP contribution to your Regular Savings Account RRSP<br>&#x2022; see, modify or delete pending transactions<br>&#x2022; register for Acc&#xE8;sD <br>&#x2022; reactivate your Acc&#xE8;sD password<br>&#x2022; contact a Desjardins advisor by secure message, whether with your caisse or other Desjardins Group components<br><br>You can also use Desjardins mobile services to:<br>&#x2022; access new content like financial tips and information about various products and services<br>&#x2022; find a caisse, Desjardins Business centre or ATM<br>&#x2022; get the phone numbers to reach us<br>&#x2022; use the currency converter<br>&#x2022; check rates<br>&#x2022; follow the stock market and trade securities on the Disnat mobile site<br>&#x2022; check Desjardins job opportunities<br>&#x2022; access the Desjardins assistance services and Ajusto mobile apps<br>&#x2022; request a car or tenant insurance quote<br>&#x2022; see Desjardins Member Advantages<br>&#x2022; open an account and become a member<br><br>N.B.: Features available on Acc&#xE8;sD mobile and Acc&#xE8;sD Affaires mobile may vary.<br>&#xAE; Interac e-Transfer is a registered trademark of Interac Inc. Used under license.<br><br>***********************************<br>Your satisfaction is a top priority and is key to helping us improve our mobile services. Keep sending us your feedback by email at info@desjardins.com.<br>***********************************",
    "histogram": {
        "1": 1077,
        "2": 432,
        "3": 639,
        "4": 1824,
        "5": 4688
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/B32NKWJZKIrSl5KCsTeMDDyv01Ue4tX8oIFbO_csHbUMnnSGV6O1E28dmHlw-8ztNw=h310",
        "//lh3.googleusercontent.com/OXaLI7lebHyQqtcqxaI1VwEPoRNFf6voHvlxXn0ggSEGHfHNnQQTDPUjGa8wTgoqQFA=h310",
        "//lh3.googleusercontent.com/3YC2zBuTINcH4JwHv7f4KJ0O-ZmLKE0baw2SqxV9Bao3y8OxBRUlevpYkrvwb8Daiddb=h310",
        "//lh3.googleusercontent.com/FyjX6mGYkkX9vMuBv3GLtiJ9e1IruQ6Vi_BveAq3dVM_0P4APP5PpmKZaCdHPFS0GA=h310",
        "//lh3.googleusercontent.com/n-ByNkDWXRG6jNq3IIx4RLb7o5SxUWH-TbkeNXJbUZghNHlJmbWiEnE64oDt0QIDEIWH=h310",
        "//lh3.googleusercontent.com/1cH8KM1U0CoI1_1TS7b_y9GpdaPWojTTzn4EmRjup9wEoojJGCLmEwd1o4HY6LfVIg=h310",
        "//lh3.googleusercontent.com/UHMBkH4cRupT9N2P4pDnoVqEtFyN9_0cVNatOpem-un1Ss3JzrkjVDxPjX8y6MJWbrc=h310",
        "//lh3.googleusercontent.com/8N_zIi3wI61t_NJjcM5Wv_TwS-bKJ2cgSaJkXcp01xaA2088eKG66ID7oKdAjzRRkPU=h310",
        "//lh3.googleusercontent.com/MqjOFPM-cnT-bi-ycm2ybpRT0FDdGb6hf2XhJ0172a53UwAmVSD1IyYB9zLjzhDS6Hs=h310",
        "//lh3.googleusercontent.com/3cJC30wAtMDO9w8pZLmRhzTfO0GF6lUaQaPhY04MPn5HOyD3qUYygbcGn4ktQgMw6z6G=h310",
        "//lh3.googleusercontent.com/3M1vCXxcPbm96hf4fqMW_cyj3K4mgCZyFobnB8MtEP8HkgH6VZQNZtmxngc-csuu-L8=h310",
        "//lh3.googleusercontent.com/nIJRM2T0aEg6t9oCf9_RIuPaRoiT1iNeIV5NNiZAHGpg_aJRDEZX_he_e53tT5PW7hXK=h310",
        "//lh3.googleusercontent.com/557eUk6KdiH5pMXTypWgGjOV2ZzsQ3AErLGGx33YqKrcVrQbsCe1c8TCXPyf-smwBwk=h310",
        "//lh3.googleusercontent.com/N0oLn667fKeqc-9qdfEJmNZZN3MNAcHhi-8kxu1xu2B3FcZDnAgJH4sSGuq1WUeayHw=h310",
        "//lh3.googleusercontent.com/4LQe2COGd5dRDqWgfnR7YtlJt31_rDJslglMYn9dxzjkDu-KalgZp0pT_h4yVhfEPw=h310"
    ],
    "comments": [
        "Am I the only one who can't even log on? But then have no problem logging on through my desktop? This is frustrating.",
        "Ever since upgrading to Oreo 8.1 the app crashes every time on startup. I had to install it on another phone running 7.1 to get it to work. Very frustrating.",
        "Trouble with view scaling while using check deposit, but beside that it works ok (Samsung Galaxy Note 4)",
        "The app description says you can look at your Desjardins credit card, and it accepts the login I use on the website, but there is no info about me VISA anywhere!",
        "Appareil incompatible avece déverrouillage par empreinte? Cette fonctionnalité est pourtant disponible sur n'importe quelle autre application... Une excuse pour ne pas corriger un bug de votre part et ne pas s'embêter avec les appareils plus anciens (3 ans et plus. Pas si anciens). Plus vraiment si utile que ça cette application maintenant qu'il me faut autant (voir plus) d'étape que sur la version Web pour accéder au détail de mes comptes.",
        "Only Ontario and Quebec. Garbage."
    ],
    "recentChanges": [
        "Turn on and receive Desjardins notifications. Notifications provide useful information, such as alerts on your accounts. You can turn notifications on or off at any time under Profile and preferences."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.desjardins.mobile&hl=en&gl=us",
    "appId": "com.desjardins.mobile"
}