{
    "title": "Messages for Android Wear",
    "summary": "Message with keyboard via SMS/Hangouts/WhatsApp/Facebook on Android Wear watches",
    "icon": "//lh3.googleusercontent.com/E6pxy-ja6KBq4uaiCC5RQRzabNF0HQ2W2fMEiDlDK69_iNCzUCMGIF1H1XOTFOCmIf1B=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 3.6,
    "reviews": 3914,
    "developer": "appfour",
    "developerId": "8815886658662427637",
    "developerEmail": "info@appfour.com",
    "developerWebsite": "http://www.appfour.com",
    "developerAddress": "appfour GmbH\nMarie-Juchacz-Str 7\n76137 Karlsruhe\nGermany",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Requirements: Android Wear Smartwatch and Android companion device. App Flat Rate users please be aware: This app is our only app that will not work with an iPhone. Use this messenger to quickly reply to SMS, Hangouts, WhatsApp, Facebook and other Messenger conversations on your Android Wear smartwatch. Write messages with the integrated keyboard with text predictions and emojis , configurable pre-defined texts or voice input. Open web and YouTube links directly on your watch. Customize vibration patterns.Features:- Integrated QWERTY keyboard with text predictions and emojis- Conversation view- View photos received as multimedia messages- Send photos as multimedia messages with our Photos app- Keyboard app integration, e.g. https://play.google.com/store/apps/details?id=com.appfour.wearkeyboard- Always-on support to keep the current conversation open- SMS conversation support- Hangout conversation support- Reply to WhatsApp messages on your watch (requires the WhatsApp app to be installed)- Reply to Facebook messages on your watch (requires the Facebook Messenger app to be installed)- Reply to Slack, Viber, Threema, Telegram, Line and Kakao Talk (requires the official apps to be installed) - Contacts- Rich message view with hyperlinks- Open web links and YouTube video links with our Web Browser and YouTube wear apps- Easy setup with single-click sign inTo customize vibration patterns and sound (full version only):- Choose \"Notification Settings\" on new message cards or long press on a conversation- Define a conversation specific vibration pattern or sound, or define a pattern and sound for all messages- Choose a pre-defined pattern or record your own patternFeatures of the full version only:- Configurable signature- Configurable message size per conversation- Configurable card style- Configurable vibrate feedback- Configurable pre-defined texts- Option to sync phone notifications and cards- Custom vibration patterns- Custom notification soundThe Wear Messages app is compatible with all Android Wear smart watches:- Motorola Moto 360- Sony Smartwatch 3- LG G Watch- LG G Watch R- LG Watch Urbane- LG Watch Urbane 2nd Edition- ASUS ZenWatch- ASUS ZenWatch 2- Huawei Watch- Samsung Gear Live- Fossil Q Founder- TAG Heuer Connected",
    "descriptionHTML": "Requirements: Android Wear Smartwatch and Android companion device. <br>App Flat Rate users please be aware: This app is our only app that will not work with an iPhone. <br><br>Use this messenger to quickly reply to SMS, Hangouts, WhatsApp, Facebook and other Messenger conversations on your Android Wear smartwatch. Write messages with the integrated keyboard with text predictions and emojis , configurable pre-defined texts or voice input. Open web and YouTube links directly on your watch. Customize vibration patterns.<br><br>Features:<br>- Integrated QWERTY keyboard with text predictions and emojis<br>- Conversation view<br>- View photos received as multimedia messages<br>- Send photos as multimedia messages with our Photos app<br>- Keyboard app integration, e.g. https://play.google.com/store/apps/details?id=com.appfour.wearkeyboard<br>- Always-on support to keep the current conversation open<br>- SMS conversation support<br>- Hangout conversation support<br>- Reply to WhatsApp messages on your watch (requires the WhatsApp app to be installed)<br>- Reply to Facebook messages on your watch (requires the Facebook Messenger app to be installed)<br>- Reply to Slack, Viber, Threema, Telegram, Line and Kakao Talk (requires the official apps to be installed) <br>- Contacts<br>- Rich message view with hyperlinks<br>- Open web links and YouTube video links with our Web Browser and YouTube wear apps<br>- Easy setup with single-click sign in<br><br>To customize vibration patterns and sound (full version only):<br>- Choose &quot;Notification Settings&quot; on new message cards or long press on a conversation<br>- Define a conversation specific vibration pattern or sound, or define a pattern and sound for all messages<br>- Choose a pre-defined pattern or record your own pattern<br><br>Features of the full version only:<br>- Configurable signature<br>- Configurable message size per conversation<br>- Configurable card style<br>- Configurable vibrate feedback<br>- Configurable pre-defined texts<br>- Option to sync phone notifications and cards<br>- Custom vibration patterns<br>- Custom notification sound<br><br>The Wear Messages app is compatible with all Android Wear smart watches:<br>- Motorola Moto 360<br>- Sony Smartwatch 3<br>- LG G Watch<br>- LG G Watch R<br>- LG Watch Urbane<br>- LG Watch Urbane 2nd Edition<br>- ASUS ZenWatch<br>- ASUS ZenWatch 2<br>- Huawei Watch<br>- Samsung Gear Live<br>- Fossil Q Founder<br>- TAG Heuer Connected",
    "histogram": {
        "1": 620,
        "2": 326,
        "3": 553,
        "4": 825,
        "5": 1590
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/d1l7WiYeO-AJPFUgmrLdXmRKzVvvooLkOaSwTlXfDsq1Xw4UOIRB_3L-jEYuSaV6nl86=h310",
        "//lh3.googleusercontent.com/k6m0_p5Kp-DGlmrR244zVTx7T3X7ED8qDH08Mi3ih-s64jqCEOgDMdYS72LJ4e-MPA=h310",
        "//lh3.googleusercontent.com/FN2OeChP59fGSSkni_yNnOWAKDYZvljSVn5F8VpFvS6077FPYLnSZSLcwiITnqEtJzJx=h310",
        "//lh3.googleusercontent.com/aVBacLknbHaWdk_jimlgvsKPybzsw0NUhUXx0x8kXnrEBAXI3cARwd9MucWkxiqF6w=h310",
        "//lh3.googleusercontent.com/yWyzB-g430woOy4KBhs1aIr4R06E4lFtGpfRpGXm9-JMeNn8DH2yv0prKXZ-gcVz0mY=h310",
        "//lh3.googleusercontent.com/CqCrZXo1ZeOBUwHstXyrBB5XIK2o1V7NBKMek495_NLqiocDoA7XW3DiJH4Ksu3N6v8=h310",
        "//lh3.googleusercontent.com/rcLyZQaeHqvQrtuoM_bInto-w5pq5UfZj8R9DZvqkHsk2mubDI5HmQPyzBG8vaNLmA=h310",
        "//lh3.googleusercontent.com/ovm-a8TVtThOZ14z0azl893VjUXRmC97FSi-K8GS6Gankyk4NKJIGjd_Fm1K_jJ1s0U=h310",
        "//lh3.googleusercontent.com/aRS3bfxUiopW52o_31OW_XaDW4Iru5bezTIyCl7qpFCC5JvyxMIcGBfluAb3KzI7QvWY=h310",
        "//lh3.googleusercontent.com/oz_JK8K4NmBSOEPdWsvV7vHjiXos6-PUv4-y2KkujiQ_eMCX9nqp4kyQELpHc2OqIA=h310",
        "//lh3.googleusercontent.com/05aBdMYurOMHPOgUzPQr0zjFwo68ayDGiKrkqa1zgKcnceKFjpU8MUd4XY9iliVBHpc=h310",
        "//lh3.googleusercontent.com/Y9tIVIfvl4JoZYyXczGVbE5PNyFwku8yUtssKC7yc-FRzHU1N26fJgvxazaaUbOk6w=h310"
    ],
    "comments": [
        "Works fine overall, but the UI group messages could be improved. The way it works right now is that the app seperates each person in a group, so your message history has an entry for each person which makes it impossible to read through a group chat's conversation history using this app.",
        "Works really well with my fossil watch but paid for full version had to reinstall and now wants me to pay again. Pls help, All issues resolved (thank you). I am using a fossil  3rd gen Q Explorist watch and an android phone, messages email calendar in fact all apps from appfour are working perfectly. Messages and mail come thru within a second of my phone going off, love it",
        "I like it but would like it a lot more if it would stop notifying me of a text once I swiped it away. I don't need a notification every minute for a message I've already read and swiped away. Please stop the repeat notifications!!",
        "I cant stand it!! I use this with my fossil watch and i receive every text 30s-1min after i receive a text on my phone. It sounds small...but it's the most annoying thing ever! I am about ready to get rid of this watch and switch back to samsung so I dont have to deal with the delay.",
        "Forked out for full version. ZERO functionality on fossil q explorist. No whatsapp messages received. So disappointed",
        "DOESNT WORK. I bought the full version and I've been trying to send messages but as soon as I press the send button the message disappears! I check my phone and sure enough it didn't send. It was really embarrassing when I was showing it off to someone and tried 3 times to send them a message and it didn't work. I want a refund!"
    ],
    "recentChanges": [
        "Fixed: Viber messenger",
        "Older changes",
        "New: Support for VK messenger",
        "New: Swipe down to refresh conversations",
        "Fixed: Missing notifications",
        "New: WhatsApp video support",
        "New: Do not vibrate on muted conversations",
        "New: Settings activity on watch"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.appfour.wearmessages&hl=en&gl=us",
    "appId": "com.appfour.wearmessages"
}