{
    "title": "Wear Battery Stats",
    "summary": "Monitor your Android Wear battery level",
    "icon": "//lh3.ggpht.com/M3HrdL35Ot8ZXkqNBoMP4dWAKtjG3pTKd-KvA4ik3u-iByr4zLqetTGbxKvOIuHvnSQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.1,
    "reviews": 1083,
    "developer": "Nicolas POMEPUY",
    "developerId": "Nicolas+POMEPUY",
    "developerEmail": "nicolas.pomepuy@gmail.com",
    "developerWebsite": "http://nicolaspomepuy.fr/",
    "developerAddress": "5 rue des Mariniers\n82600 Verdun sur Garonne",
    "updated": "December 22, 2014",
    "version": "2.0.4",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Wear Battery Stats helps you monitor your Android Wear device battery life.It's the perfect companion for your watch when you want to know more about your battery life.With this app you easily can:► Track the battery level and predict when you will be out of battery► See your apps activity to determine if an app causes a battery drain► Be notified when the battery percentage or the remaining time are below a levelThis is a first release, more features are coming. Please be also tolerant with your rating. If something doesn't work, you can contact me (see below). I try the be as responsive as possible to fix the issues.This app is a Pay What You Want app. It means that some features are locked but can be unlocked with the lowest amount allowed by the Play Store.You have to own an Android Wear device to use this appCurrently compatible devices:► LG G Watch► Samsung Gear Live► Moto 360First startTo make it work when you first install it, please:* Open the app on your smartphone while the watch is connectedor* Open the app on your watch",
    "descriptionHTML": "Wear Battery Stats helps you monitor your Android Wear device battery life.<br><br>It&apos;s the perfect companion for your watch when you want to know more about your battery life.<br><br>With this app you easily can:<br>&#x25BA; <b>Track the battery level</b> and predict when you will be out of battery<br>&#x25BA; See your <b>apps activity</b> to determine if an app causes a battery drain<br>&#x25BA; <b>Be notified</b> when the battery percentage or the remaining time are below a level<br><br>This is a first release, more features are coming. Please be also tolerant with your rating. If something doesn&apos;t work, you can contact me (see below). I try the be as responsive as possible to fix the issues.<br><br><b>This app is a <i>Pay What You Want app</i></b>. It means that some features are locked but can be unlocked with the lowest amount allowed by the Play Store.<br><br><b>You have to own an Android Wear device to use this app</b><br><b>Currently compatible devices:</b><br>&#x25BA; LG G Watch<br>&#x25BA; Samsung Gear Live<br>&#x25BA; Moto 360<br><br><b>First start</b><br>To make it work when you first install it, please:<br>* Open the app on your smartphone while the watch is connected<br>or<br>* Open the app on your watch",
    "histogram": {
        "1": 61,
        "2": 40,
        "3": 119,
        "4": 365,
        "5": 498
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/gLX85DZAIBhgI3_VBGFYKuXrUzu1Rz-6Z81kV9rfNRL_T9GbPV6uRDzCMtZ28uHppC8=h310",
        "//lh6.ggpht.com/rkhp-qSSQt28yLpOVf_5QTfG7ImWOZYgBOH-UQAE8pWMLd4OjW9JEVhQmobPw4L4Tu0=h310",
        "//lh6.ggpht.com/XfUB1HqOi9GPfrBy3FGtRL4Dbw-S8Trgp72lGdZ1TnR-oaGjhBFYfmTeQ46MoorRoZA=h310",
        "//lh5.ggpht.com/QEsZpBy125950QT-_LNnfvZA7voTdOR74WMkSv9hmo2lmAkR2DOhUIjRssEdOa94Qhg=h310",
        "//lh5.ggpht.com/sY2Til2BpxOm1dZhkFNNTpM40RpHIQZBaIVokJUkB-5krjjI_vhJcrvtAZ9bQW2MkvD4=h310",
        "//lh5.ggpht.com/kieHEZYEY5GOjYKzGR97CYqXbxWzPrdJ8d1ONP7haCNTlF8frEoyMRLw_dMDQFLbX0NA=h310"
    ],
    "comments": [
        "Awesome, but with weird bugs Time estimate to battery drain is currently -364 days... Not sure that's what I want. Otherwise, love the prediction for how much longer you have, although I wish it would also say how long the watch has already been on, or even better an estimate of how much total time you should get while unplugged. With that you can compare days and quickly determine if a new app or setting is significantly impacting battery life. Will return to 5 stars once bug is fixed.",
        "Expected more, not much use. Paid for one of the non-free versions and expected a bit more No disrespect to the developer(s), but the app doesn't really give granularity to what is using your battery.  It's not really that much more useful than the battery info you get in the wear app.  If you're looking for what is causing battery drain, all this seems to tell you is what applications you have installed, not how much battery is being used by each app or process.",
        "Very promising app. I'd like to see more details just like the battery information for the phone where it shows which app consumed more battery in % and how long each app was running individually. In such way we can determine which app is misbehaving/battery hugging. Please keep on the good work, I'd love to give 5 stars for this app.",
        "Simple and perfect little nugget of helpful and important info. Knowing the time until a battery is empty is a vital thing, especially on a small battery such as a smartwatch.  The graph and rate of decline is interesting too, but I'd give a 5th star to this review if I could configure this thing to show the \"fully discharged in X hours\" message immediately when I launch it, it would reduce me to using one awkward screen press to view that info from my watchface instead of two.",
        "It's OK, could be better Would love if it could show what's using the battery. The native Android Wear app gives a useful breakdown that this app seems to be missing. For instance, how much has Bluetooth consumed? How much has the heart rate monitor consumed, etc",
        "Needs a Widget All I'm really looking for is a widget for my phone that tells me my Android Wear watch's battery percentage. I don't like that I have to open up the app just to see that. Overall good, worth checking out."
    ],
    "recentChanges": [
        "2.0.4",
        "Fix white screen",
        "Fix screen states",
        "2.0.2",
        "Remove unneeded permissions",
        "2.0.1",
        "You can now get the whole app for free by buying the watchface",
        "2.0",
        "Better remaining time calculation",
        "Adding something for the future ;)",
        "1.1.3",
        "Stability update",
        "1.1.2",
        "Layout improvement for Moto 360",
        "1.1.1",
        "Fix discharging rate issue with Moto 360 (will unfortunately only apply for new values)",
        "1.1.0",
        "Shows the discharge rate",
        "Small fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.npi.wearbatterystats&hl=en&gl=us",
    "appId": "com.npi.wearbatterystats"
}