{
    "title": "Moovit: Bus & Train Live Info",
    "summary": "Real Time Transit: Bus, Train, Subway, Maps ★Google Play&#39;s 2016 Best App Winner★",
    "icon": "//lh3.googleusercontent.com/msu9nWi0l643QdCdw03G3ELh21up0uc_jAbzC4m8vtAc_3gqSkbMpvx423r85ayFUPY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.3,
    "reviews": 563735,
    "developer": "Moovit",
    "developerId": "5648891177850034767",
    "developerEmail": "support@moovitapp.com",
    "developerWebsite": "https://www.company.moovit.com/?utm_source=googleplay&utm_medium=Organic",
    "updated": "February 26, 2018",
    "version": "Varies with device",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "size": "Varies with device",
    "description": "We all use public transportation through various points in our lives. Whether we ride the train, subway, bus, light rail, or metro on a daily basis or take the train, subway, bus, light rail, or metro on occasion. No matter how frequently you use public transit, you know that planning a trip can be stressful.Instead of guessing how to get to your destination or wondering if the train will arrive on schedule, Moovit can ease that stress.  We help you find the nearest train station to your destination or which bus station is closest to home. We’ll tell you which alternative lines can also get you to your destination or how far is the walking distance. From when does the last train of the day depart to when the first bus line starts operating-- use Moovit to get all the info you need in advance. It’s just a tap away. Moovit guides more than 100 million users, in over 1800 cities throughout the world. Commuters will find updated schedules and, where available, real-time line arrivals based on GPS devices on-board buses and trains. You will also find nearby stations, on-the go live navigation guidance, get-off alerts at your destination, and everything necessary to ensure a smooth ride This is why Moovit has been named one of the best apps of the year in 2016 and 2017 by the Google Play and App Stores, respectively.Moovit is your personal assistant for every bus, subway, train or metro ride! 🚍 Real time arrivals. View real-time arrivals, which are taken directly from GPS devices positioned on buses and trains. Know the exact time they will arrive to your station. Avoid wasting time waiting at your stop -- use that time to enjoy another cup of coffee and leave the house when it’s most convenient for you.🔔 Live Directions. Get step-by-step guidance from A-to-B: Know how long you need to walk to your station, view the arrival time of your line, recieve get-off alerts at your destination, and more. ⌚ Real time updates. Know about issues ahead of time by receiving service alerts such as: emergency/expected disruptions and delays, traffic jams, new construction, and more.📱Users reports. Moovit’s users report to us about issues found with stations, line service and schedules, so that we can inform all nearby riders about what’s going on in their area. 🗺️ Maps view.Interested in seeing the whole picture? View all stations, routes, and lines on the map. Additionally, maps are available in PDF for when you’re offline, or underground on the subway. 🚩Favorite lines, stations, and places. Get easy access to lines, stations, and places you visit all the time. Plus, get real-time updates if/when there are changes to your Favorite lines!🚴 Bike routes. Get bike routes in addition to bus, subway, train, or metro trip plans. If you ride bikes (yours or rented) we can plan a route that includes the train or bus. Moovit will help you plan a trip that meets your transit-needs  The biking feature is only available in supported metro areas at this time.Moovit is the No.1 public transportation app in the world. We’re proud to work together with both large and small partnerships with public transit agencies across the United States, including:MTA, NJ Transit, MBTA, SEPTA, LA Metro, Muni, BART, Caltrain, CTA, Metra, WMATA, MTA Maryland, TriMet, Sound Transit.You only need one app on your phone to navigate in the U.S. and across 78 countries and in 44 languages. If you’d like to know which bus line arrives at a particular stop in London, Barcelona, Madrid, or Rome, or, if you need to find out when the last bus leaves a certain station in Rio de Janeiro, Sao Paulo, Melbourne, Seoul, Moovit has you covered. You ride, we guide.   ***Have an idea or a question? Feel free to contact us:Support@moovitapp.commoovit@Facebook, Twitter, Instagram",
    "descriptionHTML": "We all use public transportation through various points in our lives. Whether we ride the train, subway, bus, light rail, or metro on a daily basis or take the train, subway, bus, light rail, or metro on occasion. No matter how frequently you use public transit, you know that planning a trip can be stressful.<br><br>Instead of guessing how to get to your destination or wondering if the train will arrive on schedule, Moovit can ease that stress.  We help you find the nearest train station to your destination or which bus station is closest to home. We&#x2019;ll tell you which alternative lines can also get you to your destination or how far is the walking distance. From when does the last train of the day depart to when the first bus line starts operating-- use Moovit to get all the info you need in advance. It&#x2019;s just a tap away. <br><br><strong>Moovit guides more than 100 million users, in over 1800 cities throughout the world. Commuters will find updated schedules and, where available, real-time line arrivals based on GPS devices on-board buses and trains. You will also find nearby stations, on-the go live navigation guidance, get-off alerts at your destination, and everything necessary to ensure a smooth ride This is why Moovit has been named one of the best apps of the year in 2016 and 2017 by the Google Play and App Stores, respectively.</strong><br><br><strong>Moovit is your personal assistant for every bus, subway, train or metro ride!</strong> <br><br>&#x1F68D; <strong>Real time arrivals.</strong> View real-time arrivals, which are taken directly from GPS devices positioned on buses and trains. Know the exact time they will arrive to your station. Avoid wasting time waiting at your stop -- use that time to enjoy another cup of coffee and leave the house when it&#x2019;s most convenient for you.<br><br>&#x1F514; <strong>Live Directions.</strong> Get step-by-step guidance from A-to-B: Know how long you need to walk to your station, view the arrival time of your line, recieve get-off alerts at your destination, and more. <br><br>&#x231A; <strong>Real time updates.</strong> Know about issues ahead of time by receiving service alerts such as: emergency/expected disruptions and delays, traffic jams, new construction, and more.<br><br>&#x1F4F1;<strong>Users reports.</strong> Moovit&#x2019;s users report to us about issues found with stations, line service and schedules, so that we can inform all nearby riders about what&#x2019;s going on in their area. <br><br>&#x1F5FA;&#xFE0F; <strong>Maps view.</strong>Interested in seeing the whole picture? View all stations, routes, and lines on the map. Additionally, maps are available in PDF for when you&#x2019;re offline, or underground on the subway. <br><br>&#x1F6A9;<strong>Favorite lines, stations, and places.</strong> Get easy access to lines, stations, and places you visit all the time. Plus, get real-time updates if/when there are changes to your Favorite lines!<br><br>&#x1F6B4; <strong>Bike routes.</strong> Get bike routes in addition to bus, subway, train, or metro trip plans. If you ride bikes (yours or rented) we can plan a route that includes the train or bus. Moovit will help you plan a trip that meets your transit-needs  The biking feature is only available in supported metro areas at this time.<br><br>Moovit is the No.1 public transportation app in the world. We&#x2019;re proud to work together with both large and small partnerships with public transit agencies across the United States, including:<br>MTA, NJ Transit, MBTA, SEPTA, LA Metro, Muni, BART, Caltrain, CTA, Metra, WMATA, MTA Maryland, TriMet, Sound Transit.<br><br>You only need one app on your phone to navigate in the U.S. and across 78 countries and in 44 languages. If you&#x2019;d like to know which bus line arrives at a particular stop in London, Barcelona, Madrid, or Rome, or, if you need to find out when the last bus leaves a certain station in Rio de Janeiro, Sao Paulo, Melbourne, Seoul, Moovit has you covered. You ride, we guide.  <br><br><br> ***<br><br>Have an idea or a question? Feel free to contact us:<br><br>Support@moovitapp.com<br>moovit@Facebook, Twitter, Instagram",
    "histogram": {
        "1": 32793,
        "2": 18106,
        "3": 39911,
        "4": 106077,
        "5": 366848
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/GadaJv-1_BxqsQFGMMmtaviaa8C-XSXprP3BEUBkRDAde08JxDWuJPlvZMRIn6Q9T7Oh=h310",
        "//lh3.googleusercontent.com/KYf5nNfvuYeKrw8A9HGYiZeRCpoEDeZwDfvz610h9POCLsgyGeNylxO9lITEafnngw=h310",
        "//lh3.googleusercontent.com/9SMv0vGxyIy8nolxZXHLCfZWqAw9i2okWuN5AoTMeM_qFfHA1e1w2aXKm_QbbyJuXMNS=h310",
        "//lh3.googleusercontent.com/X0treqewyMrzdrUaxq8b7XzY0CFJ7W76_2BoNpif_190bh-kIYCuVko74ZojBytZmM4=h310",
        "//lh3.googleusercontent.com/AhHuLJVTrQw3vHJcy-ACFWOjinhMYKEoXn2CXa4SdI_Q_UCwT7umRfnq9ndBw8SpMUk=h310",
        "//lh3.googleusercontent.com/-oQ9pbGrMeTBpd52NoMS_h2Vr-Had1QRPmCRT4ds-I6Dfm-WcKj2DC6H7UrT1k8Rkjg=h310"
    ],
    "comments": [
        "Worst possible route, no subways, terrible estimation of arrival, can't check the stations on map, no zoom out on double tap. Google maps is much better.",
        "Bad user experience. Support never replies. Ugly user interface. Hate that I have to use it daily to commute.",
        "Lovely app. Helped me a lot after I moved to Singapore",
        "Very helpful",
        "Perfect!",
        "Awesome"
    ],
    "recentChanges": [
        "We are constantly working to make your public transit experience even better. We are always searching for better routes, updating new schedules, mapping out new stations, and working behind the scenes to make sure our app works smoothly.",
        "Every update is carefully thought out by our team with your experience in mind.",
        "Enjoy our app? Give us a five-star rating in the Google Play Store. We would love to hear your ideas and suggestions, send us feedback via support@mooviapp.com"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tranzmate&hl=en&gl=us",
    "appId": "com.tranzmate"
}