{
    "title": "RBFCU Mobile",
    "summary": "RBFCU Mobile",
    "icon": "https://lh3.ggpht.com/iZvDGFZtYC-vFNJq0O-kH0IQAiXIc9QV9iiiyCyzlTgiMP3cgoNWG6InJMQvSviGpN8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 2934,
    "developer": "Vertifi Software",
    "developerId": "Vertifi+Software",
    "developerEmail": "memberservices@rbfcu.org",
    "developerWebsite": "http://www.rbfcu.org",
    "updated": "December 5, 2017",
    "version": "5.1",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Say Hello to your Credit Union On-the-Go! Managing your money has never been easier! With RBFCU Mobile, a service of Randolph-Brooks Federal Credit Union, your personal finances are just a tap away! Whether you need to check your balance, find the nearest ATM or deposit a check, RBFCU Mobile has the capability to do it all - and without ever stepping foot in a branch! Features: * Use the ATM/Branch locator tool to find RBFCU and/or surcharge-free ATMs* Check your account balances* Make quick, convenient transfers between your RBFCU accounts* Stay on track by reviewing your loans and making payments on-the-go* Get more for your money by checking RBFCU's current deposit and loan rates* Pay your bills online using your RBFCU ePay account* Conveniently open Money Market accounts and Share Certificates* Deposit checks from anywhere, anytime from your camera-enabled device*Don't forget to give your phone a shake on the Login page to find out \"What's Shakin' at RBFCU!\"Download today and experience the RBFCU difference - convenient access to your personal finances in the palm of your hand! For Randolph-Brooks Federal Credit Union account holders. Qualify for membership and join online at www.rbfcu.org. RBFCU does not charge a fee for the RBFCU Mobile application, but you may be charged for Web access by your mobile wireless provider. Federally insured by the NCUA.*Additional qualifications apply to use eDeposits. All deposits are subject to the Randolph-Brooks Funds Availability Policy.",
    "descriptionHTML": "Say Hello to your Credit Union On-the-Go! <br><br>Managing your money has never been easier! With RBFCU Mobile, a service of Randolph-Brooks Federal Credit Union, your personal finances are just a tap away! <br><br>Whether you need to check your balance, find the nearest ATM or deposit a check, RBFCU Mobile has the capability to do it all - and without ever stepping foot in a branch! <br><br>Features: <br><br>* Use the ATM/Branch locator tool to find RBFCU and/or surcharge-free ATMs<br>* Check your account balances<br>* Make quick, convenient transfers between your RBFCU accounts<br>* Stay on track by reviewing your loans and making payments on-the-go<br>* Get more for your money by checking RBFCU&apos;s current deposit and loan rates<br>* Pay your bills online using your RBFCU ePay account<br>* Conveniently open Money Market accounts and Share Certificates<br>* Deposit checks from anywhere, anytime from your camera-enabled device*<br><br>Don&apos;t forget to give your phone a shake on the Login page to find out &quot;What&apos;s Shakin&apos; at RBFCU!&quot;<br><br>Download today and experience the RBFCU difference - convenient access to your personal finances in the palm of your hand! <br><br>For Randolph-Brooks Federal Credit Union account holders. Qualify for membership and join online at www.rbfcu.org. <br><br>RBFCU does not charge a fee for the RBFCU Mobile application, but you may be charged for Web access by your mobile wireless provider. Federally insured by the NCUA.<br><br>*Additional qualifications apply to use eDeposits. All deposits are subject to the Randolph-Brooks Funds Availability Policy.",
    "histogram": {
        "1": 219,
        "2": 106,
        "3": 131,
        "4": 368,
        "5": 2110
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ldMIjuoSICqraLbnHmSA2p_3driDveE57RlGaCif6I_WzGwCBQnP07FSNG8Nzy0_7N7s=h310",
        "//lh3.googleusercontent.com/HoQskHK_nBI8_2KB0WI_EF2SpRAnEzL0PEZ4FzPnCRRQU-k-BKJfb6yQVcGwMNJS9A=h310",
        "//lh3.googleusercontent.com/O7vluMBziJcTQhftoQ0bVkP-ClT0JYsvK4iu9K6TNmfIAJJhZX5CSG9pGb6ISuGnww=h310",
        "//lh3.googleusercontent.com/NgBYInPhAgPWGLkPriH653L7KN2L5tAmRypYMM8haM35yE2eYwqdfXU7vBSeGPpjXA=h310",
        "//lh3.googleusercontent.com/IGaSeEKcrkWf8uwvLDwu22hrMrpKsq5dL1P1v0kDIwb9Z8ycQTHsNNEXPQHo1K-nEg=h310",
        "//lh3.googleusercontent.com/0mpxlDY0BwzWJVRytpT_IoOWoILEps2uYi4tcijZHAFRNNueYhYR1zz70XAwoA8BXlAz=h310",
        "//lh3.googleusercontent.com/kLYRfbSzD6WwpGF_iIq1ucswYfYA9577JoEC18r4R2VGLcK74QKQWRKrAga9ansUuxQ=h310",
        "//lh3.googleusercontent.com/sXpnCiGJVnNIg7b4BSwtKa9NzrMFvbnbc2g-eeiWfUGSh46wAz2VUmJcES4hNdJdHA=h310",
        "//lh3.googleusercontent.com/0yPHdzgt2YZOSJf89ErJr5vIK8V8q3ljhaQBbL1D3Et8CSGKF3WTebJ2c96I0TpHnBM=h310",
        "//lh3.googleusercontent.com/RUj4_Rb_jZ5Ehtnfdi6DZVsHInXEzqejMzpdKGFIhKxW18v0dHYAyIj21dBynBrmBtrg=h310",
        "//lh3.googleusercontent.com/Zj_05r64WZ7ZoiT-nisy0tVBBnc48Zs1Xg9RyxLF_h60psokBYQacCBx7BZ5NQLtPyc=h310",
        "//lh3.googleusercontent.com/Yjm-RPabY1zzXPNIo0kHTGlR7w7etpr3UO9StVxnFYhMDsb5rCeM9jRddr4IA5o36p49=h310",
        "//lh3.googleusercontent.com/TaRmnxL8_k25AEEWoKoZYZzL_9rpDDP5BpCNrNEAY6n7aoyXpZNSRYyLmorF7cynD_c=h310",
        "//lh3.googleusercontent.com/ip05gslp_vDybnnTE2HM9nftiYiIZ21cugbexSWxnErcTqqqB_IDFt_gN71u1mNh9TU=h310"
    ],
    "comments": [
        "App messed up and there was a transfer issue. Now I have a $24 overdraft charge. Called \"money services\", excuse me \"member sevices\" and explained my issue, not a care in the world. If you use this app double check every transaction and fee. Or just go to a different Credit Union/Bank.",
        "Keeps locking up. When it works it's great",
        "I like the app but the bill pay is not working. I keep getting an error when entering the amount to pay and can't get past the screen to complete the payment information.",
        "This app wasn't showing the correct amount of money available so needless to say that charges were not showing up on hold . So that cost me over 150.00 on overdrafts fees . I never have had a overdraft with any of my banks . So they really need to get things fixed on this application. Cause it Only hurts the customers who depend on the the app to show all debit charges to be showing up .",
        "App keeps asking me to verify my phone number EVERY TIME open it up. This is getting really old really fast!",
        "I would have known about a fraud faster if the widget would update better"
    ],
    "recentChanges": [
        "What’s New?",
        "Thanks for using the RBFCU Mobile App. Our team is constantly working to improve speed, functionality and security. This release features the following updates:",
        "* Speak with an RBFCU representative using the new chat feature",
        "* eDeposit feature now allows mobile camera to automatically capture check image when properly displayed within image border",
        "* eDeposit history now accessible through the eDeposit History folder"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.Vertifi.DeposZip.P314089681&hl=en&gl=us",
    "appId": "com.Vertifi.DeposZip.P314089681"
}