{
    "title": "Jokester for Android Wear",
    "summary": "Jokester for Android SmartWatch is guaranteed to put a smile on your face.",
    "icon": "//lh3.ggpht.com/6lAf8oemiZi5ieSlVzrm3c66lFyJaLKPZhUC463qJ7TedFsGFfxuOMQmJRw-wx2PIEjs=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.7,
    "reviews": 24,
    "developer": "Kanda Software",
    "developerId": "Kanda+Software",
    "developerEmail": "jokester@kandasoft.com",
    "developerWebsite": "http://www.kandasoft.com",
    "updated": "May 13, 2015",
    "version": "1.3.4",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "description": "Brighten Your Day – and Your Wrist - with Jokester!Jokester turns any Android smartwatch into a humor hub with the carefully curated jokes delivered to your smartwatch at random intervals throughout the day.No matter what ails you - Jokester is the best medicine. Unless, of course, you need a real medicine.Sitting in a boring meeting? Having a bad day? Or simply want to have a few good laughs to raise your spirits? Jokester will keep your mood up by displaying hilarious jokes on your smartwatch – and letting you know the joke has arrived by vibrating your watch a little. Share with friends and family and put a smile on their face! Never get bored - new funny jokes are added every couple of days. Jokester is a part of A Smarter Watch family - Kanda Software’s suite of informative, motivational and entertainment apps that you can enjoy on your Android Wear devices.Features:● Set a time frame during the day when you want to see jokes on your smart watch;● Control how many jokes you want to receive per day – anywhere from 1 to 20;● Jokes are refreshed every couple of days automatically – no need to download anything;● Jokes are delivered to your Android Wear at random intervals, so you are always pleasantly surprised.",
    "descriptionHTML": "Brighten Your Day &#x2013; and Your Wrist - with Jokester!<br><br>Jokester turns any Android smartwatch into a humor hub with the carefully curated jokes delivered to your smartwatch at random intervals throughout the day.<br><br>No matter what ails you - Jokester is the best medicine. Unless, of course, you need a real medicine.<br>Sitting in a boring meeting? Having a bad day? Or simply want to have a few good laughs to raise your spirits? Jokester will keep your mood up by displaying hilarious jokes on your smartwatch &#x2013; and letting you know the joke has arrived by vibrating your watch a little. Share with friends and family and put a smile on their face! Never get bored - new funny jokes are added every couple of days. <br><br>Jokester is a part of A Smarter Watch family - Kanda Software&#x2019;s suite of informative, motivational and entertainment apps that you can enjoy on your Android Wear devices.<br><br>Features:<br>&#x25CF; Set a time frame during the day when you want to see jokes on your smart watch;<br>&#x25CF; Control how many jokes you want to receive per day &#x2013; anywhere from 1 to 20;<br>&#x25CF; Jokes are refreshed every couple of days automatically &#x2013; no need to download anything;<br>&#x25CF; Jokes are delivered to your Android Wear at random intervals, so you are always pleasantly surprised.",
    "histogram": {
        "1": 3,
        "2": 3,
        "3": 3,
        "4": 5,
        "5": 10
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/OCOhlMq1mvoeWi7DidEyAgAt6S0Dvm2HY61c_ADY4Vo0K1Ou-kfVsonxl-RHyQUyByQ=h310",
        "//lh6.ggpht.com/J-tJXw_RUKdjv44G1lSEDuPWBDI4PHzARogmz082lS7wjmc8Yj6wfgYVsiz4Imdm_g=h310",
        "//lh6.ggpht.com/dJG8ID3hQqDm-0RQW6arWcaPfrqRmkaHy_kVZ2pjJMmTCGpHcvhnQXbVCFJ7TmApvA8=h310"
    ],
    "comments": [
        "A good idea in theory and I like the way the jokes pop up on the watch. Unfortunately I get the same 10 or so jokes on repeat, the long jokes have the end cut off when you scroll down and I only get 1 or 2 jokes a day despite setting the frequency to the highest setting.",
        "Hmmm Works fine. Better is I could just open the app on my watch and scroll through joke categories, like maybe 5 types of jokes and I can scroll through them. Please respond with your honest thoughts, thanks again",
        "I like the idea of this app and the jokes are great to see randomly.  Just one thing.  When the joke pops up the, screen stays on for a long time taking up precious battery of my moto360.  Could you please make a setting to turn off screen sooner?  Also the once the screen turns off I do not see the joke when i turn the screen back on so I may miss it.",
        "No jokes I had this app working fine. Now im lucky if i get one joke a day are you running out of jokes? Could be a great app",
        "I'm really mad because It did not show up on my watch and I dont know how to activate it for my watch please reply soon if I get help I will rate this five stars",
        "Good but... Needs more jokes daily. I have everything turned on and up and I hardly get like 1 a day"
    ],
    "recentChanges": [
        "Start sharing jokes with your friends on Facebook, Twitter and Google+.",
        "Filter by jokes categories, we have added long jokes and dirty jokes.",
        "Dirty jokes can be covered before revealing."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.kandasoft.jokester&hl=en&gl=us",
    "appId": "com.kandasoft.jokester"
}