{
    "title": "Coffee Time for Android Wear",
    "summary": "Just say &quot;OK Google, open Coffee Time&quot;, then scan and pay and you&#39;re done!",
    "icon": "//lh6.ggpht.com/cvW7rDppXG6j_aWBB_cFmta1i_BQXAjROKTxmylAIoHFBg1T6YT4UmHUSLvU7mcU-vg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.3,
    "reviews": 154,
    "developer": "Not Just 4 Time",
    "developerId": "Not+Just+4+Time",
    "developerEmail": "admin@notjust4time.com",
    "developerWebsite": "http://notjust4time.com",
    "developerAddress": "333 Nelson Street #216\nAtlanta GA 30313",
    "updated": "April 30, 2015",
    "version": "1.4.0",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "We had to remove the the watch face until we can implement the new watch face api. So be on the look out for a fresh new design!!!!Please send comments/feedback to  admin@notjust4time.com - hope you continue to enjoy. ★If you love Starbucks™, then \"Coffee Time for Android Wear\" is the most useful app you can install on your Android Wear watch right now★With this amazing new Android Wear App, just flip your watch and say \"OK Google, start Coffee Time\", and you are ready to scan and pay for your Starbucks™ coffee .UPDATE: Now you won't even have to say or tap anything, just flip your wrist and pay with the watch face!!!★ It's very simple to setup ★   ✔ open the phone app   ✔ enter your Starbucks™ Card Number    ✔ your barcode will be created on you watchAfter Setup★ You WON'T have to touch your wallet★ You WON'T have to touch your phone★ You WON'T EVEN HAVE TO TOUCH YOUR WATCH!Just say \"OK Google, start Coffee Time\" on your Android Wear watch, and your barcode will slide in on your watch and you're ready to scan and pay. Or just flip your wrist and show your watch face.Once you are done paying, just slide it out of the way to close the Wear app.★★★★★ It's probably the most convenient way to pay for your Starbucks™ coffee. In our opinion, it's certainly the coolest!!!! ★★★★★*** You can set the watch face barcode to hide when the watch dims. Just go to the phone app's setting menu and check the Hide barcode checkbox.*** Please remember to touch and slide to the right to close the app once you are done paying.*** We are not affiliated with Starbucks™Please email us at admin@notjust4time.com if you have any questions.",
    "descriptionHTML": "We had to remove the the watch face until we can implement the new watch face api. So be on the look out for a fresh new design!!!!<br><br>Please send comments/feedback to  admin@notjust4time.com - hope you continue to enjoy. <br><br>&#x2605;If you love Starbucks&#x2122;, then &quot;Coffee Time for Android Wear&quot; is the most useful app you can install on your Android Wear watch right now&#x2605;<br><br>With this amazing new Android Wear App, just flip your watch and say &quot;OK Google, start Coffee Time&quot;, and you are ready to scan and pay for your Starbucks&#x2122; coffee .<br><br>UPDATE: Now you won&apos;t even have to say or tap anything, just flip your wrist and pay with the watch face!!!<br><br>&#x2605; It&apos;s very simple to setup &#x2605;<br><br>   &#x2714; open the phone app<br>   &#x2714; enter your Starbucks&#x2122; Card Number <br>   &#x2714; your barcode will be created on you watch<br><br><br>After Setup<br><br>&#x2605; You WON&apos;T have to touch your wallet<br>&#x2605; You WON&apos;T have to touch your phone<br>&#x2605; You WON&apos;T EVEN HAVE TO TOUCH YOUR WATCH!<br><br><br>Just say &quot;OK Google, start Coffee Time&quot; on your Android Wear watch, and your barcode will slide in on your watch and you&apos;re ready to scan and pay. Or just flip your wrist and show your watch face.<br><br><br>Once you are done paying, just slide it out of the way to close the Wear app.<br><br><br><br>&#x2605;&#x2605;&#x2605;&#x2605;&#x2605; It&apos;s probably the most convenient way to pay for your Starbucks&#x2122; coffee. In our opinion, it&apos;s certainly the coolest!!!! &#x2605;&#x2605;&#x2605;&#x2605;&#x2605;<br><br>*** You can set the watch face barcode to hide when the watch dims. Just go to the phone app&apos;s setting menu and check the Hide barcode checkbox.<br><br>*** Please remember to touch and slide to the right to close the app once you are done paying.<br><br>*** We are not affiliated with Starbucks&#x2122;<br><br>Please email us at admin@notjust4time.com if you have any questions.",
    "histogram": {
        "1": 12,
        "2": 7,
        "3": 8,
        "4": 30,
        "5": 97
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/WaTqDl9asY7VlmVAhGdcIraq6I0QrYvF6THrX_YebHbwOymsO4cLDnAkOSw43qNYYgZc=h310",
        "//lh4.ggpht.com/K-bO6iVVpX639o94iBBsZvPAyJdkEhUSPS-5XlaZu8aQ9MlNZj4OTQo4ZwfO_cBAgVlg=h310",
        "//lh5.ggpht.com/CBMbE4EpbTb6bTklcVTsVB-l8tG25GzwbMeqsZkWShLkelF8Q9yyZUPZVKv5x9tqQg=h310"
    ],
    "comments": [
        "Barcode Covered on ZenWatch 2 On the Asus ZenWatch 2 the bottom card covers most of the barcode due to the last number dropping down to a 2nd row. Emailed developer months ago about it. Used to be one of my favorite apps but still can't use.",
        "Cool…  one feature missing It would be great if the warchapp would turn if I flick my weist (so its upside down)…  i always have to twist my arm for paying..  Thats kinda uncool hahah",
        "Great app! Worked for a month on my g watch r then after verizon had an update it was down for 4 to 5 days then I got an update on samsung beam services and it works again. Not sure if that was the reason. Love using my watch to pay. People are still at aw....",
        "I used to have an Apple Watch and was accustomed to being able to pay for my purchases directly from the Starbucks app on my watch. Fast forward to now, and I find out that my new Android watch won't be able to get the Starbucks app on it, because Starbucks never developed an app for Android Wear. Luckily I discovered this third party solution, downloaded it on my new LG Watch Style, and tested it out at Starbucks. Worked without a hitch. It actually works more consistently than the official Starbucks app on the Apple Watch did. I'm sold. Thank you for developing this app. I look forward to seeing the Coffee Time watch face soon.",
        "Shows promise but... On my sony smartwatch 3 the pop up with the card number covers the barcode rendering it pointless as it won't scan... But great other than that...",
        "This was working great on my Huawei watch until I changed phones.  After re-pairing it to my new phone, I couldn't install this app.  For some reason it is listed as \"not supported\" for my watch, even though it was running fine on it when it was paired to my previous phone.  I can get the app just fine on my phone, it just won't show up on the watch.  Please add Huawei watch back to the list of supported devices!"
    ],
    "recentChanges": [
        "- ver 1.4.0 - removed BETA watch until new designs are finished",
        "- ver 1.3.0 - added round watch support - *note round watch face coming",
        "- ver 1.2.0 - Watch face BETA - a lot of you asked for a watch face so we've included one. We were going to wait until Google releases the official watch face API's but we've gotten so many request we just said what the hell. Hope you enjoy!",
        "- ver 1.0.1 - added ability to turn off sounds"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.notjust4time.coffeetimeforwear&hl=en&gl=us",
    "appId": "com.notjust4time.coffeetimeforwear"
}