{
    "title": "Trivia for Android Wear",
    "summary": "Fun and challenging trivia game questions for your AndroidWear device",
    "icon": "//lh6.ggpht.com/Ai13Wp7Wh9OOPY9LZUT3fN8PkziGsFlWfSxfpB78B1wikEzXFoPrRs-FoQkXnrZfSQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4,
    "reviews": 26,
    "developer": "pyromonk apps",
    "developerId": "pyromonk+apps",
    "developerEmail": "pyromonkapps@gmail.com",
    "developerWebsite": "https://www.facebook.com/pyromonkapps",
    "developerAddress": "2221 Larkin street\nCA94109 San Francisco",
    "updated": "February 12, 2015",
    "version": "1.1",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "description": "For less money than you would ever spend on a bar drink, you will in return get some interesting facts, learn something new and all of this for your Android Wear device, therefore no need to think twice about downloading this fun Trivia app to test your trivia knowledge. Got a craving for brain teasing Trivia questions? Are you the local Pub Quiz hero! Got some time to kill? Looking for a smart time waster app to crack open some brain cells? Test your knowledge of totally random and fun fact trivia questions. Discreet entertainment on your wrist! Play it whilst you're on daily commute, standing in line or in your meeting room/classroom! Learn fun facts on the go! The MUST HAVE Trivia game app made for Android Wear. Download the FREE trial app with a limited set of questions and if you feel up to the challenge go ahead and download the full version! If you do, you rock already!Trivia for Android Wear v1more apps on www.pyromonk.comlike us on facebook: www.facebook.com/pyromonkapps",
    "descriptionHTML": "For less money than you would ever spend on a bar drink, you will in return get some interesting facts, learn something new and all of this for your Android Wear device, therefore no need to think twice about downloading this fun Trivia app to test your trivia knowledge. <br><br>Got a craving for brain teasing Trivia questions? Are you the local Pub Quiz hero! Got some time to kill? Looking for a smart time waster app to crack open some brain cells? Test your knowledge of totally random and fun fact trivia questions. Discreet entertainment on your wrist! Play it whilst you&apos;re on daily commute, standing in line or in your meeting room/classroom! Learn fun facts on the go! The MUST HAVE Trivia game app made for Android Wear. <br><br>Download the FREE trial app with a limited set of questions and if you feel up to the challenge go ahead and download the full version! If you do, you rock already!<br><br><br>Trivia for Android Wear v1<br><br>more apps on www.pyromonk.com<br>like us on facebook: www.facebook.com/pyromonkapps",
    "histogram": {
        "1": 5,
        "2": 0,
        "3": 2,
        "4": 1,
        "5": 18
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/btvMnSxQcioy-4NM4wGymb3jj23uzYSv_gSlCScCUA3uOyZYNofhgGvKW6kXjK__5w=h310",
        "//lh3.googleusercontent.com/3jqgBR8NX3CLDIXS8KQNNpdmsgoSIJ3d8UNsEHpiKOGEDS2JvDlcfDg9z5sRYoJfiww=h310",
        "//lh3.googleusercontent.com/PPrBsko6HESkpHSMLboaa_57-T8t08kzwgyScBjTrNyl5u8CuHCKBaaxQCvK2XYoZJQ=h310"
    ],
    "comments": [
        "Addicting! Great way to start your mornings with some trivia. Cool interface and I really enjoy how the app gives more details about the answer to each question.",
        "Great App but I can't read the whole text This is a very good quiz app.   But on my Huawei Watch I can't read the whole block of text, when the answer explanation is given or your score stats are given at the end.  You should be able to scroll through the blocks of text, for smaller watches.",
        "Can't even play free version. I downloadead as I love quiz games but I get a page come up saying Thankyou for downloading free version now download full version but doesn't give me a chance to play for free....so not paying for something I don't know if any good",
        "Full version? I purchased full version,  but it keeps telling me to download the full version when i already purchased it.  Will give it 5 stars when this is fixed...",
        "Awesome, simple app 5 stars for it's simplicity and amount of fun.",
        "Purchased Purchased the full version, watch still keeps telling me to upgrade, phone says i have already"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.fishysoft.quiz3&hl=en&gl=us",
    "appId": "com.fishysoft.quiz3"
}