{
    "title": "Pill Reminder and Medication Tracker by Medisafe",
    "summary": "💊  Never forget a pill again! Google Editor&#39;s Choice (Awarded 2016)",
    "icon": "//lh3.googleusercontent.com/j0FjkVjQmN_DwrWfVsNf097awS2iAbkwmjhy7s65zAM4_5meKtVO8cNwJBIrh_iA7Us=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 156110,
    "developer": "Medisafe®",
    "developerId": "4633965556977420998",
    "developerEmail": "support@medisafe.com",
    "developerWebsite": "http://www.medisafe.com",
    "developerAddress": "745 Atlantic Ave. Boston, MA USA 02111\n(888) 289-5236",
    "updated": "February 14, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Medisafe is a MUST HAVE APP (Seen in CNBC, Wired, Readers Digest & More!)Millions use Medisafe to stay safe with their meds and keep track of blood pressure, glucose and other measurements. With Medisafe you can easily share results with doctors to track better outcomes, faster.Keep yourself and loved ones safe and never forget to take your meds, supplements and vitamins again with Medisafe, the easy-to-use and FREE app that helps you remember when to take your pills and manage pill usage. Be safe with prescriptions. Studies show improper medication use and tracking in the United States leads to:• 50% of patients not taking medications as prescribed• 125,000 deaths a year, one every 4 minutes• 700,000 hospital visits a year• 44 out of 100 prescriptions never picked up at the pharmacy.Don't put yourself or your loved ones at risk by missing a dosage -- or taking a double dose because nobody tracked. Our mission is giving people the tools, support and information they need to take their medications the way they're supposed to. That's why millions use Medisafe, the top-rated medication manager and pill reminder for those who need reminders to take meds, fertility drugs, birth control, and other medicines.Medisafe is capable of managing drugs for many complex health conditions, such as diabetes, heart disease, and cancer. It also acts as a perfect companion for those who need a mobile organizer for vitamins, blood pressure meds, glucose level tracking, period tracking, and other health concerns.Whether you’re taking medication or know someone who is, you can use Medisafe to manage hourly, daily, or weekly pill dosages.Medisafe is perfect for those in charge of their own med schedule but need a reminder for dosages and the correct med to take.How Does Medisafe Work?With a few simple steps, you can add a medication, get reminders for taking pills, and receive constant tracking of your healthprogress.Add your family member’s medications or have a caregiver manage your meds as prescribed.FREE Medisafe Features:• Intuitive visual interface with easy-to-use medication reminder• Track other measurements - such as blood pressure, weight - to make sure you’re in great health• Choose your medication reminder sound• View your medication reminder list to see “what’s due today?”• Rx refill reminders so you can restock your meds• List PRN medication• Medication progress reports that you can send to a doctor or nurse• Sync reminders with your Android Wear smartwatch• Medication discount card and coupons (US only) at drugstores like Walgreens, Rite-Aid, CVS• New! Now patients using the SureMed pack by Omnicell get a special Medisafe SureMed version for their full medication management experience• Registration (not required) features automatic backup and restore on the Medisafe HIPAA-compliant serversSee how it works: Watch these Medisafe Android how-to videos:https://youtu.be/FS3z4Adnf-EApp Permissions Information:Read Your Contacts - used if you choose to add a doctor or Medfriend. The app never stores your address book content and it doesn’t access your address book without asking you first.Find Accounts on the Device - Medisafe uses push notifications to Medfriends to let those with permission know if the main user has forgotten to take medication.Supported Android Wear Smartwatches: LG G, Moto 360 (1st/2nd gen.), Moto 360 Sport, Samsung Gear Live, Huawei Watch, ASUS ZenWatch 2FAQsTermsPrivacy",
    "descriptionHTML": "Medisafe is a MUST HAVE APP (Seen in CNBC, Wired, Readers Digest &amp; More!)<br><br>Millions use Medisafe to stay safe with their meds and keep track of blood pressure, glucose and other measurements. With Medisafe you can easily share results with doctors to track better outcomes, faster.<br><br>Keep yourself and loved ones safe and never forget to take your meds, supplements and vitamins again with Medisafe, the easy-to-use and FREE app that helps you remember when to take your pills and manage pill usage. <br><br><br>Be safe with prescriptions. Studies show improper medication use and tracking in the United States leads to:<br>&#x2022; 50% of patients not taking medications as prescribed<br>&#x2022; 125,000 deaths a year, one every 4 minutes<br>&#x2022; 700,000 hospital visits a year<br>&#x2022; 44 out of 100 prescriptions never picked up at the pharmacy.<br><br>Don&apos;t put yourself or your loved ones at risk by missing a dosage -- or taking a double dose because nobody tracked. Our mission is giving people the tools, support and information they need to take their medications the way they&apos;re supposed to. <br><br>That&apos;s why millions use Medisafe, the top-rated medication manager and pill reminder for those who need reminders to take meds, fertility drugs, birth control, and other medicines.<br><br>Medisafe is capable of managing drugs for many complex health conditions, such as diabetes, heart disease, and cancer. It also acts as a perfect companion for those who need a mobile organizer for vitamins, blood pressure meds, glucose level tracking, period tracking, and other health concerns.<br><br><br>Whether you&#x2019;re taking medication or know someone who is, you can use Medisafe to manage hourly, daily, or weekly pill dosages.<br><br><br>Medisafe is perfect for those in charge of their own med schedule but need a reminder for dosages and the correct med to take.<br><br><br><b>How Does Medisafe Work?</b><br>With a few simple steps, you can add a medication, get reminders for taking pills, and receive constant tracking of your health<br>progress.<br><br><br>Add your family member&#x2019;s medications or have a caregiver manage your meds as prescribed.<br><br><br><br><b>FREE Medisafe Features:</b><br>&#x2022; Intuitive visual interface with easy-to-use medication reminder<br>&#x2022; Track other measurements - such as blood pressure, weight - to make sure you&#x2019;re in great health<br>&#x2022; Choose your medication reminder sound<br>&#x2022; View your medication reminder list to see &#x201C;what&#x2019;s due today?&#x201D;<br>&#x2022; Rx refill reminders so you can restock your meds<br>&#x2022; List PRN medication<br>&#x2022; Medication progress reports that you can send to a doctor or nurse<br>&#x2022; Sync reminders with your Android Wear smartwatch<br>&#x2022; Medication discount card and coupons (US only) at drugstores like Walgreens, Rite-Aid, CVS<br>&#x2022; New! Now patients using the SureMed pack by Omnicell get a special Medisafe SureMed version for their full medication management experience<br>&#x2022; Registration (not required) features automatic backup and restore on the Medisafe HIPAA-compliant servers<br><br><b>See how it works: Watch these Medisafe Android how-to videos:</b><br>https://youtu.be/FS3z4Adnf-E<br><br><b>App Permissions Information:</b><br>Read Your Contacts - used if you choose to add a doctor or Medfriend. The app never stores your address book content and it doesn&#x2019;t access your address book without asking you first.<br><br>Find Accounts on the Device - Medisafe uses push notifications to Medfriends to let those with permission know if the main user has forgotten to take medication.<br><br><b>Supported Android Wear Smartwatches:</b> LG G, Moto 360 (1st/2nd gen.), Moto 360 Sport, Samsung Gear Live, Huawei Watch, ASUS ZenWatch 2<br><br><a href=\"https://www.google.com/url?q=https://www.google.com/url?q%3Dhttps%253A%252F%252Fmedisafe.com%252Fhelp%252F%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNHE8xsLc3v015iD1Ljl0t6TW7tmSg&amp;sa=D&amp;usg=AFQjCNEKDyXav690aonfb_oJPhJ_5KxvYA\" target=\"_blank\"><b>FAQs</b></a><br><a href=\"https://www.google.com/url?q=https://www.google.com/url?q%3Dhttps%253A%252F%252Fwww.medisafe.com%252Fterms%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNG-b2sQpXu3KONpxuuHiBAMOVzW6A&amp;sa=D&amp;usg=AFQjCNGQnYB6AAV7yLb3LCcZtaglWdPeXw\" target=\"_blank\"><b>Terms</b></a><br><a href=\"https://www.google.com/url?q=https://www.google.com/url?q%3Dhttps%253A%252F%252Fwww.medisafe.com%252Fprivacy%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNGuGwc9G7P_LdM0YiQcAYS6b_KQiA&amp;sa=D&amp;usg=AFQjCNF33Jc3TN3iRD1yyAj7Gh1HZBtElA\" target=\"_blank\"><b>Privacy</b></a><br><br>",
    "histogram": {
        "1": 3419,
        "2": 2622,
        "3": 7083,
        "4": 33861,
        "5": 109125
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/aj_0DlgwpbpvGJ5Cg4AOUapxXCLTRTNkM9vYvfYn_-1COo-HWLNqhB4cGGORSBgUQj_I=h310",
        "//lh3.googleusercontent.com/ahekBw1xpR0uhXjLY2FCmhvcU0-Xy08rzczM21_UOTmtn1lJPeXBcnmluyVvflNjt8M=h310",
        "//lh3.googleusercontent.com/dC3rHV7h1sW9sxaZZ_sdxOA-vjL5JU_1Aw6pyGHgkc5_EpeL5qFDV7Aw5KubbSMclg=h310",
        "//lh3.googleusercontent.com/VoqFsyTXpsbQal8QTQv2VeFUt7wiM5osnx7KOeUt0qOYwPIgOD8NEC7O-WsqNw2RJpCC=h310",
        "//lh3.googleusercontent.com/zDIc1ayexoee--DlTSXwGlt3HyEotzXix6oIEEkaM23toEbj6CYzEYaeEZ9FA0jNE4gU=h310",
        "//lh3.googleusercontent.com/ZFp9xHuZMtAPL1jtdN75iEW3lihTapQNZ3C-ztZFzRwgOCL8XEXtVaaEJONt-kic8fE=h310",
        "//lh3.googleusercontent.com/-B3EIIWhZ-oHKrBRfTBqinbDyJXsarjVKnvl5BQCoMAB2M93yKGiwArmMvV5C7-14Lw=h310",
        "//lh3.googleusercontent.com/SIMGwOnMuRJJDOEZoE-EXzqckhGfUFHK2KA4_5p36oCDopYcx-rWODw9RBrhEhFqOA0Z=h310",
        "//lh3.googleusercontent.com/Sr0s7Ni4tX4q-4vZtiFMQOkD1N2tjmVKK7c9xj-NroivHsg8XpklQPPMBr12WsjPhh-W=h310",
        "//lh3.googleusercontent.com/trfdExusBY0sctyRCiDhyEyIwY2leh20S0Yw0-lYwsrHiaDgokosOWmvGLvaLSTotg=h310",
        "//lh3.googleusercontent.com/fFDUnQkrOWtGnwE7WzKR92SypQMd4YSVojOzfAWhYh1ZU9oMZJOy98QlxW9Qd1hXmw=h310",
        "//lh3.googleusercontent.com/T87MnrSGIJG5w2u-gBscCfbCOw3UwCTA3xQEm8CntLJhKnPcx1plYSdb7Vb6_Nb3KA=h310"
    ],
    "comments": [
        "Update: Nice new home screen! Just began to use this app after I hadn't used it in a long while. I like the updates that have been made. Would love to see this app somehow connect with the MYCHART app by EPIC. All hospitals are trying to give patients access to as much information as possible from their medical charts through the EPIC system. This would be an awesome update.",
        "Since it's new, I'm giving it 4 stars because it offers alot of features that is worth using and very convenient. Once they include more pharmacies and hospitals everywhere, I will upgrade to 5 stars. Update, have been using it for about 3 weeks now and when I visited 2 Doctors so far and it's been very helpful documenting the meds, times meds were taken and doses. It's very convenient and easily accessible. I like the diary feature, it's where I note sudden changes in my vitals. The color codes should be customizable for ones own needs. This app is very close to earning 5 stars.",
        "Awesome app. The only thing I wish they had was a reminder from the last time I took a med. (For example, pain meds every 6 hours.) Otherwise, very easy to use and awesome for keeping track of everything. I love the little med graphics that are different for pill color, size, or even needles or inhaler, etc. Very customizable.",
        "So helpful as with my medication if I forget to take my meds I feel it by the end of the day and for days after. Was a bit frustrated when you press take and you need to make a selection, because I tend to forget to record it straight away but the \"shake to take\" makes it a non-issue. Would love if you could set up pets as other members and for medication courses which are not daily, like dog worming or for some people injections. Have recommended this app to others who need help remembering meds.",
        "I have epilepsy. After 2 very scary extended blackout incidents in Jan & Feb, my son found the Medisafe app. So easy for me to enter meds, but the best part is having 3 people who will let me know when I miss anything. I showed my neurologist, she was so excited and she says she will recommend it to her patients. Thanks!",
        "Very easy to use, very flexible,  and extremely helpful. Since I downloaded the app about a year ago I haven't had to worry about rememberimg to take any of my meds and more importantly IF I'd taken them(it was a daily dilemma)! Highly recommended"
    ],
    "recentChanges": [
        "Version 7.55:",
        "- New measurements requested by Medisafers are now available, including CD4 Cell Count, HIV Viral Load, CD4%, Creatinine, T-Score and EGFR.",
        "- Bug fixes",
        "Thanks for using Medisafe and please continue sending all your suggestions and reviews. If you gave us less than 5 stars, we'd appreciate it if you'd update your review to help others find us too.",
        "Have ideas or want to see what's coming soon? Join our Beta Community at medisafe.com/betacommunity."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.medisafe.android.client&hl=en&gl=us",
    "appId": "com.medisafe.android.client"
}