{
    "title": "Todait - Smart study planner",
    "summary": "Prepare for exams, be productive, and manage your time with Todait.",
    "icon": "//lh3.googleusercontent.com/IIdqG_7HftkZ4-JlgsHEDc6QThloZDpdJ5ETylOWyer-XB7meUFxyHfXju4Htwx3-Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.5,
    "reviews": 13390,
    "developer": "Todait Inc.",
    "developerId": "Todait+Inc.",
    "developerEmail": "android@todait.com",
    "developerWebsite": "http://todait.com/",
    "developerAddress": "서울시 구로구 디지털로30길 28, 821호",
    "updated": "February 11, 2018",
    "version": "Varies with device",
    "genre": "Education",
    "genreId": "EDUCATION",
    "size": "Varies with device",
    "description": "Todait is an authentic study planner to help you utilize 100% of your time and ace your exams. Todait is especially useful for students who need help with productivity and effective time management. Use it to prepare for the ACTs, AP Exams, ASVAB, PSAT/NMSQT, SAT, ISEE, SHSAT, SSAT, GED, TOEFL, DAT, GMAT, GRE, LSAT, MCAT, OAT, PCAT, Bar exam, COMLEX-USA, NAPLEX, NBDE, PANCE/PANRE, USMLE, NCLEX, Metism, BMAT, UKCAT, and A levels.We strongly recommend this app for anyone who:- has a massive amount of material to cover and has no idea where to start studying- is preparing for a big exam, such as the SATs, LSATs, APs, IBs, etc. - wants to make a habit of routine studying- wants to be productive and efficiently manage their timeTodait automatically plans and divides your study materials over a specific period of time while providing detailed feedback. All you have to do is enter how much you’d like to study for each subject as well how many hours you’d like to spend per week.Todait’s Unique Functions:- Emphasizes studying rather than planning     - Automatic Distribution tells you how much you should study each day to achieve your goals within a chosen period of time     - Automatic Plan Adjustment redistributes your study material based on whether you’re ahead of or behind schedule     - The stopwatch allows you to measure and manage how long you study for each subject     - The widget allows you to start studying right from your home-screen without running the app itself- Gives feedback on your study habits that you can’t get on your own      - The Study Trend Graph shows your weekly progress and average study times     - The time-table shows your study times for each day     - The calendar keeps track of your monthly performance     - An alarm reminds you to start studying at whatever time you set- The Study Diary allows you to reflect upon your daily performance for each task- Lock-out Mode prevents you from getting distracting notifications or using other apps while the stopwatch is running- Can view all your tasks in a simple check-list layout- Allows you to check and manage your study times on other devices- Gives more feedback from Todait based on your progress and data- The timeline motivates you to study by comparing your study times with your friends’ (not updated yet)Todait Inc.Please direct your questions and feedback to support@todait.com !",
    "descriptionHTML": "Todait is an authentic study planner to help you utilize 100% of your time and ace your exams. Todait is especially useful for students who need help with productivity and effective time management. Use it to prepare for the ACTs, AP Exams, ASVAB, PSAT/NMSQT, SAT, ISEE, SHSAT, SSAT, GED, TOEFL, DAT, GMAT, GRE, LSAT, MCAT, OAT, PCAT, Bar exam, COMLEX-USA, NAPLEX, NBDE, PANCE/PANRE, USMLE, NCLEX, Metism, BMAT, UKCAT, and A levels.<br><br><br>We strongly recommend this app for anyone who:<br>- has a massive amount of material to cover and has no idea where to start studying<br>- is preparing for a big exam, such as the SATs, LSATs, APs, IBs, etc. <br>- wants to make a habit of routine studying<br>- wants to be productive and efficiently manage their time<br><br><br>Todait automatically plans and divides your study materials over a specific period of time while providing detailed feedback. All you have to do is enter how much you&#x2019;d like to study for each subject as well how many hours you&#x2019;d like to spend per week.<br><br><br>Todait&#x2019;s Unique Functions:<br><br>- Emphasizes studying rather than planning<br>     - Automatic Distribution tells you how much you should study each day to achieve your goals within a chosen period of time<br>     - Automatic Plan Adjustment redistributes your study material based on whether you&#x2019;re ahead of or behind schedule<br>     - The stopwatch allows you to measure and manage how long you study for each subject<br>     - The widget allows you to start studying right from your home-screen without running the app itself<br><br>- Gives feedback on your study habits that you can&#x2019;t get on your own <br>     - The Study Trend Graph shows your weekly progress and average study times<br>     - The time-table shows your study times for each day<br>     - The calendar keeps track of your monthly performance<br>     - An alarm reminds you to start studying at whatever time you set<br><br>- The Study Diary allows you to reflect upon your daily performance for each task<br>- Lock-out Mode prevents you from getting distracting notifications or using other apps while the stopwatch is running<br>- Can view all your tasks in a simple check-list layout<br>- Allows you to check and manage your study times on other devices<br>- Gives more feedback from Todait based on your progress and data<br>- The timeline motivates you to study by comparing your study times with your friends&#x2019; (not updated yet)<br><br><br><br>Todait Inc.<br>Please direct your questions and feedback to support@todait.com !",
    "histogram": {
        "1": 548,
        "2": 327,
        "3": 861,
        "4": 2432,
        "5": 9222
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/doIOOiOgDr2322AehK4Nl2n1B_oD_jHpRYexlNnkbyCCcZekZ8L6xnYKWuWPXh6cmZtR=h310",
        "//lh3.googleusercontent.com/QB8SuVFij9N4BbcrjEa89A73V6q9PP_YQjmoI7SOJTpgZ4csU1rJIOL2Bxep042Danw=h310",
        "//lh3.googleusercontent.com/lfA4zzDU2795cyNZaKBgCcsXbcWsFukw1W2y5cOjXcD8gp5El9KhxAJIs1CVKHJOaS4=h310",
        "//lh3.googleusercontent.com/M8QK2ZufZwjbXUbKSsPRGRB31g2BIdzveL0S2rF_YtfUMTk2twmRSB6HqEkbJdsOKBo=h310",
        "//lh3.googleusercontent.com/HKw_zsAIk0tw_iNYWIpo2dHinT95wYn-QddWelxqU_0mSlsmBtY-44acewuRQdkuiVo=h310"
    ],
    "comments": [
        "What a brilliant idea and an amazing app..... Only one problem is there..... while using the app if anyone calls me then for the first time the app displays the call window but if again someone calls me then the app doesn't display the call window and I even cannot close the app and it takes about 2 to 3 minutes to close the app which happens automatically this is the only problem that I am facing if the developers put fix this issue then the app would be fabulous",
        "Difficult to use...or it doesnt do what it says ...I was trying 10 minutes to see how do I set my goals for example to read 100pages in one week...I couldnt find what should I do so the app can tell me how many pages should I read daily...",
        "So far has been super useful!! A little clunky to get started but once it's set up it's very handy",
        "This is an amazing application. Very useful for time management. But please make an option for restarting the app to start fresh at times. Edit : Thx for listening. The reset option is here and it works perfectly. Thx a million.",
        "One of the best apps I have used in a long time. It increases productivity and helps us utilise our precious time judiciously. Must use apps for all students.",
        "It's verrry good and thanks to biology bites I found this app because of them"
    ],
    "recentChanges": [
        "- Added Traditional Chinese translation (Yay~)",
        "- Fixed typos (English)",
        "- Fixed some minor bugs"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.autoschedule.proto&hl=en&gl=us",
    "appId": "com.autoschedule.proto"
}