{
    "title": "MacroDroid - Device Automation",
    "summary": "Automation for everyone!",
    "icon": "//lh3.googleusercontent.com/qdoTw7ietamTnPvvn6V5HCyD7bTDG3QYPLIbf-lEIUjQ_8FAm9V-fnBzjTAINGQRLzg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 21381,
    "developer": "ArloSoft",
    "developerId": "ArloSoft",
    "developerEmail": "support@macrodroid.com",
    "developerWebsite": "http://www.macrodroid.com",
    "developerAddress": "96A Marshall Road\nGillingham\nKent\nME8 0AN",
    "updated": "February 16, 2018",
    "version": "3.19.12.3",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "MacroDroid is the easiest way to automate your daily tasks on your Android smartphone or tablet. Via the smart user interface MacroDroid offers a simple solution to make automated tasks on your device in just a few taps.MacroDroid helps you by automating the activities you did manually before, and customize them in a way you want it to work for you. A few examples of how MacroDroid can help you to get automated:# Optimize your daily workflow on your phone; switch on bluetooth and start playing music when you enter your car. Or switch on WiFi when you are near your house.# Reduce battery drain (like dimming your screen and switching Wifi off)# Saving on roaming costs (automatically switch off your Data)# Increasing safety during commuting by reading your incoming notifications (via Text to Speech) and sending automated responses via email or SMS# Make custom sound and notification profiles. # Remind you to do certain tasks using timers and stopwatches.These are just a few examples out of hundreds of scenarios where MacroDroid can make your Android life a little easier. With only 3 simple steps this is how it works:1. Select a Trigger.The trigger is the cue for the macro to start. MacroDroid offers 65 triggers to start your macro, i.e. location based triggers (like GPS, cell towers, etc), device status triggers (like battery level, app starting/closing), sensor triggers (like shaking, light levels, etc) and connectivity triggers (like Bluetooth, Wifi and notification triggers).Macros can be triggered automatically, but it is also possible to create a shortcut on the homescreen of your device or start using the unique and customizable Macrodroid sidebar. 2. Select the Actions you like to automate.MacroDroid can automate more than 100 actions, which you normally would do by hand. Connect to your Bluetooth or Wifi device, select volume levels, speak text (like your incoming notifications or current time), start a timer, dim your screen and many more.3. Optionally: Configure Constraints.Constraints help you to let the macro fire only when you want it to. Living near your work, but only want to connect to your company's Wifi during work days? With a constraint you can select specific times or days that the macro can be invoked. MacroDroid offers 50 constraint types like: battery level,  connected devices, time and day constraints, headphones insterted and many more.For beginners===========MacroDroids unique interface offers a Wizard that guides step by step through the configuration of your first macros. It is also possible to use an existing template from the template section and customize it to your needs.The built-in forum allows you to get help from other users, allowing you to easy learn the ins and outs of MacroDroid.For more experienced users=======================MacroDroid offers more comprehensive solutions like use of plugins, use of system/user defined variables, scripts, intents, advance routing like IF, THEN, ELSE clauses, use of AND + ORsThe free version of MacroDroid allows you to configure up to 5 macros. The Pro version (a small one time fee) unleashes the full power of MacroDroid and lets you create an unlimited amount of macros.Support=======Please use the in-app forum for all usage questions and feature requests, or access the forums via www.macrodroid.com.To report bugs please use the built in 'Report a bug' option available via the settings.Notices======This app uses the Device Administrator permission (BIND_DEVICE_ADMIN). This permission is used by the failed login trigger (nothing else) and will only be enabled if you explicitly give MacroDroid device admin access from within the app.This app uses Accessibility services. It is a useful tool to help those with disabilities use their device more easily. MacroDroid is widely embraced by the blind community and those with limited motor skills to provide simple automations to greatly simplify device usage.",
    "descriptionHTML": "MacroDroid is the easiest way to automate your daily tasks on your Android smartphone or tablet. Via the smart user interface MacroDroid offers a simple solution to make automated tasks on your device in just a few taps.<br><br>MacroDroid helps you by automating the activities you did manually before, and customize them in a way you want it to work for you. A few examples of how MacroDroid can help you to get automated:<br><br># Optimize your daily workflow on your phone; switch on bluetooth and start playing music when you enter your car. Or switch on WiFi when you are near your house.<br># Reduce battery drain (like dimming your screen and switching Wifi off)<br># Saving on roaming costs (automatically switch off your Data)<br># Increasing safety during commuting by reading your incoming notifications (via Text to Speech) and sending automated responses via email or SMS<br># Make custom sound and notification profiles. <br># Remind you to do certain tasks using timers and stopwatches.<br><br>These are just a few examples out of hundreds of scenarios where MacroDroid can make your Android life a little easier. With only 3 simple steps this is how it works:<br><br>1. Select a Trigger.<br><br>The trigger is the cue for the macro to start. MacroDroid offers 65 triggers to start your macro, i.e. location based triggers (like GPS, cell towers, etc), device status triggers (like battery level, app starting/closing), sensor triggers (like shaking, light levels, etc) and connectivity triggers (like Bluetooth, Wifi and notification triggers).<br>Macros can be triggered automatically, but it is also possible to create a shortcut on the homescreen of your device or start using the unique and customizable Macrodroid sidebar. <br><br>2. Select the Actions you like to automate.<br><br>MacroDroid can automate more than 100 actions, which you normally would do by hand. Connect to your Bluetooth or Wifi device, select volume levels, speak text (like your incoming notifications or current time), start a timer, dim your screen and many more.<br><br>3. Optionally: Configure Constraints.<br><br>Constraints help you to let the macro fire only when you want it to. <br>Living near your work, but only want to connect to your company&apos;s Wifi during work days? With a constraint you can select specific times or days that the macro can be invoked. MacroDroid offers 50 constraint types like: battery level,  connected devices, time and day constraints, headphones insterted and many more.<br><br><br>For beginners<br>===========<br><br>MacroDroids unique interface offers a Wizard that guides step by step through the configuration of your first macros. <br>It is also possible to use an existing template from the template section and customize it to your needs.<br>The built-in forum allows you to get help from other users, allowing you to easy learn the ins and outs of MacroDroid.<br><br>For more experienced users<br>=======================<br><br>MacroDroid offers more comprehensive solutions like use of plugins, use of system/user defined variables, scripts, intents, advance routing like IF, THEN, ELSE clauses, use of AND + ORs<br><br>The free version of MacroDroid allows you to configure up to 5 macros. The Pro version (a small one time fee) unleashes the full power of MacroDroid and lets you create an unlimited amount of macros.<br><br>Support<br>=======<br><br>Please use the in-app forum for all usage questions and feature requests, or access the forums via www.macrodroid.com.<br><br>To report bugs please use the built in &apos;Report a bug&apos; option available via the settings.<br><br>Notices<br>======<br><br>This app uses the Device Administrator permission (BIND_DEVICE_ADMIN). This permission is used by the failed login trigger (nothing else) and will only be enabled if you explicitly give MacroDroid device admin access from within the app.<br><br>This app uses Accessibility services. It is a useful tool to help those with disabilities use their device more easily. MacroDroid is widely embraced by the blind community and those with limited motor skills to provide simple automations to greatly simplify device usage.",
    "histogram": {
        "1": 919,
        "2": 448,
        "3": 1041,
        "4": 3065,
        "5": 15908
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/MmOi_pf9-1oCjI2_CIp0Dms8Xw2P0opPWL2BaMmla8gRpyvktrk3dW-OX8oxDsZaMpqu=h310",
        "//lh3.googleusercontent.com/jUj08FhqQZFpGvl9l7wmyn73v4RQ3MS-ae6kr4pLqGSPYYUDvZpShno-vmY9sbvMSQmc=h310",
        "//lh3.googleusercontent.com/LearFsrbWfCdNWmEa0aI2wWgdIMK_lsQq3ggw7cLkaJvrD1TIzkL5nySZrue6fRVHhA=h310",
        "//lh3.googleusercontent.com/9k1I_8duXLdqrAOBznrsP8wgYkQZRX1LRRbZ88BICeG8EGg9PPIbTof3Jj3VmhYjWFo=h310",
        "//lh3.googleusercontent.com/ub5aEE78kKeXsA4EL1NwnyEogJq_eJrzKWykRASf8pPlTF40LAF5ox84dqRuk5ZRwvY=h310",
        "//lh3.googleusercontent.com/F8iMYY0WRiZFo6Za6pgytiyFalhfCxfNI_LgeE91RyEkYowGqtHBbc-Xzjb5wfxiquA=h310",
        "//lh3.googleusercontent.com/mfGnqErnixnTIQEqw5si8s8m3mostJnv3z4Vi8UrP6Mdfpa-yEzw1kmADthcCets9Eg=h310",
        "//lh3.googleusercontent.com/EU1zxxQ6KWloW2y_RGs_Xi0Kxa_aVLtJrcwe2atMTjAFWvV9QiVUub1fppJOHwrJ=h310"
    ],
    "video": "https://www.youtube.com/embed/x7itdy7Rz4k",
    "comments": [
        "For some reason, the lastest update break my default Nexus fingerprint gestures. Would it be possible to create an option to allow people to not route the fingerprint gestures through macrodroid? Other than that I absolutely love this app and recommend it to countless people at work. Thanks for the great work!! Keep it up! 🙂",
        "So much easier to use than Tasker. It's also updated much more frequently, supports the latest version of Android, and works super well. I have 8 macros set up and they all work consistently with no extra battery drain. We have a new champion!",
        "It is very well thought application. It is very easy to learn how to use it and it has so many options, triggers and actions which is great. However I have a problem in my device (Xiaomi Mi Note 3)  as it is unable to activate or deactivate mobile (cellular) data and battery saver even though I did ADB hack as explained on macrodroid forum. Mobile data toggle changes how it looks but data isn't disabled or enabled and battery saver doesn't even change the toggle. I would like to use this app very much as I think it's great, but I still haven't started to use it properly because of these problems.",
        "Please make fingerprint gestures to be supported on any type of fingerprint sensors. For example on my Sony Xperia X(Android 8.0) this trigger don't works and i gave access to accessibility for Macrodroid.",
        "THANK YOU SO MUCH FOR LISTENING TO ME!!!!!!!! I cannot express how ultimatly happy i am that you decided to help me and add some of those features!!!!!! I am very very very very *INF happy that you added the features!!!!!! I wish you the best of luck and hope your carreer may be successful in devolping code!!!!! You macrodroid team are a genius!!!!!!  (Old message (you wont need to read this but anyways): Please add a way to see the x y positions of floating buttons using a variable It would also be good if you could use actions to control where a floating button is And please add actions that can change a floating button's image Also it would be a good idea to add actions where you can do something once the user touches on the floating button and one that does something when the user stops touching the floating button)",
        "Great App, very user-friendly and done by just one developer! who is friendly and responsive and keeps adding more functions. Like to see the App grow and become better and better."
    ],
    "recentChanges": [
        "Created separate fingerprint accessibility service (Android 8.0+) to prevent standard accessibility service interfering with system fingerprint gestures.",
        "Added new mechanism to hotspot action to try and make it work on (some) Android 7.1+ devices.",
        "Dim screen action now effects MacroDroid drawer (and drawer handle).",
        "Floating Button can now initialise at specific X,Y location.",
        "Various UI updates to show more detailed information about a macro's configuration in the list and edit modes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.arlosoft.macrodroid&hl=en&gl=us",
    "appId": "com.arlosoft.macrodroid"
}