{
    "title": "Time Balance - Personal Timer",
    "summary": "Time Balance helps you to manage the time spent in your daily activities.",
    "icon": "//lh4.ggpht.com/t5bsyG0pjZNw5fi5mXwXphv7-CRib2nSSRNY0yrKwRtjSQoFsOX4GM7cN5ZMvF4MX5E=w300",
    "price": "$1.99",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.4,
    "reviews": 190,
    "developer": "Acquasys",
    "developerId": "7896438756410566003",
    "developerEmail": "contact@acquasys.com",
    "developerWebsite": "http://www.acquasys.com",
    "developerAddress": "Av. Presidente Juscelino Kubitschek, 1600\nSão Paulo, SP - Brasil",
    "updated": "August 4, 2016",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Time Balance is a personal-oriented time tracker that can help you to make a better use of your day by controlling the duration of common activities like exercises, study, work, commutes, sleep, time with family etc.By means of an efficient timer mechanism, Time Balance lets you start and stop activities easily and visualize your time allocation in a graphical report. And if you find yourself dedicating too little or too much time for an activity, you can set duration limits and let Time Balance warn you when your cross them.Features:★ Includes activity timers which can run exclusively or in parallel. Timers work even when the app is not running and consume almost no battery (in fact they work even if phone is off).★ Running activities are shown in the notification area, from where you can quickly access your activity list.★ You can specify in which days of the week each activity is done, keeping your daily list clean and focused.★ A notification is triggered if an activity reaches the maximum duration defined or if you have not spent the minimum duration desired.★ Each activity can have a reminder shown at a specific time of each day it is supposed to be done.★ Activities can be grouped in categories like Family, Work, Health etc for better organization and statistics.★ Activities can be chained (an activity can automatically start another when finished).★ Time Balance can play audio cues while specific activities run, using simple beeps or the text-to-speech engine. You can also set them to vibrate for silent reminders.★ You can give a rating for each activity performed, and see its quality evolution over time as a chart.★ You can jump to specific dates or simply move backwards and see the exact time spent for each activity and any limits crossed in the past.★ It is possible to manually adjust any duration, including  past dates, and transfer time between activities.★ A graphical summary shows how your time is being allocated, including average, minimum and maximum daily duration for each activity, and total time spent in the last week, month and year (by category and activity).★ It is possible to change, start and stop activities from the home screen using a widget. A lock screen widget is also available for Android 4.2 and later.★ All entries can be exported to CSV files and manipulated in desktop apps like Microsoft Excel.★  Tasker plugin: allows activities to be started and stopped automatically based on events (ie. start \"Work\" activity when the phone connects to the company's network, \"Commute\" when it enters car mode, \"Exercises\" when you are at the gym etc). Time Balance can also start Tasker tasks when an activity is started/stopped.★ Google Fit integration (experimental): Allows exporting and importing activites to/from Google Fit automatically.★  Companion apps for Android Wear and Pebble smartwatches: allows you to start, stop and adjust activities right from your wrist.Please use the contact e-mail for bug reports, questions or suggestions, so we can respond as necessary. When reporting bugs, please include any steps and info you may find useful for diagnosis. If you like Time Balance, please leave your rating here. Thank you!Note: If you are looking for an app to manage work related tasks and projects, check out Time4Work and let us know what you think!https://play.google.com/apps/testing/com.acquasys.time4work",
    "descriptionHTML": "Time Balance is a personal-oriented time tracker that can help you to make a better use of your day by controlling the duration of common activities like exercises, study, work, commutes, sleep, time with family etc.<br><br>By means of an efficient timer mechanism, Time Balance lets you <b>start and stop activities</b> easily and visualize your <b>time allocation</b> in a graphical report. And if you find yourself dedicating too little or too much time for an activity, you can set <b>duration limits</b> and let Time Balance warn you when your cross them.<br><br><b><u>Features</u></b>:<br><br>&#x2605; Includes <b>activity timers</b> which can run exclusively or in parallel. Timers work <u>even when the app is not running</u> and consume almost no battery (in fact they work even if phone is off).<br><br>&#x2605; Running activities are shown in the notification area, from where you can quickly access your activity list.<br><br>&#x2605; You can specify in which <b>days of the week</b> each activity is done, keeping your daily list clean and focused.<br><br>&#x2605; A notification is triggered if an activity reaches the <b>maximum duration</b> defined or if you have not spent the <b>minimum duration</b> desired.<br><br>&#x2605; Each activity can have a <b>reminder</b> shown at a specific time of each day it is supposed to be done.<br><br>&#x2605; Activities can be grouped in <b>categories</b> like Family, Work, Health etc for better organization and statistics.<br><br>&#x2605; Activities can be <b>chained</b> (an activity can automatically start another when finished).<br><br>&#x2605; Time Balance can play <b>audio cues</b> while specific activities run, using simple beeps or the text-to-speech engine. You can also set them to vibrate for silent reminders.<br><br>&#x2605; You can give a <b>rating</b> for each activity performed, and see its <b>quality evolution</b> over time as a chart.<br><br>&#x2605; You can jump to specific dates or simply move backwards and see the exact time spent for each activity and any limits crossed in the past.<br><br>&#x2605; It is possible to manually adjust any duration, including  past dates, and transfer time between activities.<br><br>&#x2605; A graphical summary shows <b>how your time is being allocated</b>, including average, minimum and maximum daily duration for each activity, and total time spent in the last <b>week, month and year</b> (by category and activity).<br><br>&#x2605; It is possible to change, start and stop activities from the home screen using a <b>widget</b>. A lock screen widget is also available for Android 4.2 and later.<br><br>&#x2605; All entries can be exported to CSV files and manipulated in desktop apps like Microsoft Excel.<br><br>&#x2605;  <b>Tasker plugin</b>: allows activities to be started and stopped automatically based on events (ie. start &quot;Work&quot; activity when the phone connects to the company&apos;s network, &quot;Commute&quot; when it enters car mode, &quot;Exercises&quot; when you are at the gym etc). Time Balance can also start Tasker tasks when an activity is started/stopped.<br><br>&#x2605; <b>Google Fit</b> integration (experimental): Allows exporting and importing activites to/from Google Fit automatically.<br><br>&#x2605;  Companion apps for <b>Android Wear and Pebble</b> smartwatches: allows you to start, stop and adjust activities right from your wrist.<br><br>Please use the contact e-mail for bug reports, questions or suggestions, so we can respond as necessary. When reporting bugs, please include any steps and info you may find useful for diagnosis. <br><br>If you like Time Balance, please leave your rating here. Thank you!<br><br>Note: If you are looking for an app to manage work related tasks and projects, check out Time4Work and let us know what you think!<br>https://play.google.com/apps/testing/com.acquasys.time4work",
    "histogram": {
        "1": 3,
        "2": 8,
        "3": 16,
        "4": 51,
        "5": 112
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ISkxvtH0iGZC2sMEYKLzST-NIriCa4aisMNU1vM9jNvG57qjGNRjNdFAE8Dip44Svzg=h310",
        "//lh3.googleusercontent.com/t5PYaevxjy6LkojKNaBsJ69tzmg_3l04fg_TUkj5b5vzpcV7f4r6XkhdCCrJn3RfA6M=h310",
        "//lh3.googleusercontent.com/GFGtZajI-3neBD-dNzpQzLPYMshGOcVvIEIVfLcRLVhNtCGM9pnJc0O5SvAvgOT27D4=h310",
        "//lh3.googleusercontent.com/1FNQPOYhz4Fcu1G6yuRdaMzw9HZQIAjnGq81rPOjMROkueVu2nTBTwsl-DwYoTdwMw=h310",
        "//lh3.googleusercontent.com/f_CEYDHbH3inQ_MsNUBKulw-8jAWR69_ccU_2zWMIWL_rMYibE5lhWgllJ9RnrQfxNsK=h310",
        "//lh3.googleusercontent.com/HDSVaPKFJPZkGfbw2tQpikTBPS-NuyOhIoNC8lm5M1lVx8TzzHtGdMHZr15h7U3iYsE=h310",
        "//lh3.googleusercontent.com/lBZTzP_wj5J8vKufV1NYFvVt3lYNnJrhjmJJ5THg3ig5qfbC3knCYDG4RYrFpPt6Wdw=h310"
    ],
    "video": "https://www.youtube.com/embed/1xOG6_QiJzM",
    "comments": [
        "Glitches need sorting out Daily activities are recorded accurately and it is useful for keeping track of these. I am finding it helpful in managing my time for this. Anything set for a week though does not work. For example: task set for 1 hour a week. 20 minutes Monday, 10 minutes Tuesday, and so on - the task will not go green when I have accumulated an hour. Alternatively, more than an hour on Monday - goes green for that day, but then returns to red on Tuesday even though completed  week's task. PLEASE FIX THIS.",
        "The app doesn't work correctly for weekly tasks. For instance if I say 1 hour a week and do 20m one day and 40m another it should show as done. However it only shows as done if the whole hour happens in one day. This bug has been present for a nearly a year.",
        "What? Very good idea and use interface. However the Activites of the same Cathegory does not sum up in the overview! Instead you have min, max and avg.? You would really want to sum upp time of the activities in one category. Otherwise the \"time remaining\" does not even make sense there. Fix this and it will be a really great app.",
        "Keeps track of my time and easy to use. But min/max settings don't function and no daily totals. I would like timer to turn on a programmed task time for min and off at max time. Lots of other good features",
        "Great idea; integration needed With this type of app you need to have as much integration as possible. Pebble, Tasker is a great start. Unfortunately, it seems to be proprietary software, so I'll pass for now.",
        "Now it is not working on my Asus Ze601kl mobile kept writing developer months but no response"
    ],
    "recentChanges": [
        "- Layout improvements",
        "- Hi-res icons",
        "- Minor bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.acquasys.timebalance&hl=en&gl=us",
    "appId": "com.acquasys.timebalance"
}