{
    "title": "Golfshot Plus: Golf GPS",
    "summary": "Improve your game and master the course with Golfshot Plus.",
    "icon": "//lh3.googleusercontent.com/GVJenMuuQyQzGVATcdxKXWkn4BPyvJGMShgIERZzfMWmzq-ZIUXkGcKm2UYJz0s95A=w300",
    "price": "$29.99",
    "free": false,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.1,
    "reviews": 3367,
    "developer": "Shotzoom Software",
    "developerId": "5427737915563914060",
    "developerEmail": "support@golfshot.com",
    "developerWebsite": "http://golfshot.com",
    "developerAddress": "11101 W 120th Ave.\nSuite 300\nBroomfield, CO, 80021",
    "updated": "January 31, 2018",
    "version": "4.15.0",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "Improve your game and master the course while enjoying a whole, new golf experience with Golfshot Plus. Over 2 million members of the Golfshot community rely on our golf GPS apps to save time, money and strokes. A one-time purchase of Golfshot Plus gets you lifetime access to these features that help you play better golf:- Interactive, real-time distances to the front, back and center of each green and all key hazards and targets on over 40,000 courses worldwide- Dynamic 3D flyover previews of each hole- Advanced game scoring with Stroke Play and Stableford- Zoom in on targets and layups for better shot planning and saved strokes- Save up to 80% off Hot Deal tee times provided by GolfNow when booked through Golfshot Want even more? Upgrade to Golfshot Pro and you’ll get:- Premium GPS distance features, scoring and shot tracking for Android Wear- Personalized club recommendations based on your statistics- Scoring for Skins, Nassau, Match play and other games- Save an extra $20 off a Hot Deal tee time provided by GolfNow- Over $200 in savings on golf equipment, GolfNow tee times, golf magazine subscriptions, golf travel, golf instruction and moreALL Golfshot members enjoy these accurate and innovative golf GPS features:- Distances to the center of the green- Easy-to-use scorecard for yourself or your foursome- Android Wear support- In-depth statistics of your game, covering fairways hit, greens in regulation (GIR), putts per hole, and more- Up to 80% off tee times provided by GolfNow when booked through Golfshot - The latest golf news, both in your app and in our monthly member newsletter- FREE one-week trial of Golfshot ProGolfshot Plus requires a GPS-enabled Android phone or tablet. Android Wear™ requires an Android wearable device and watch app. For battery-saving tips, FAQs and all of the amazing features of Golfshot visit golfshotgps.com. If you don’t see your course in Golfshot, email us at support@golfshot.com to request a course update or send us your feedback! Course list at golfshot.com/coursesCreated by Shotzoom LLC",
    "descriptionHTML": "Improve your game and master the course while enjoying a whole, new golf experience with Golfshot Plus. Over 2 million members of the Golfshot community rely on our golf GPS apps to save time, money and strokes. <br><br>A one-time purchase of Golfshot Plus gets you lifetime access to these features that help you play better golf:<br>- Interactive, real-time distances to the front, back and center of each green and all key hazards and targets on over 40,000 courses worldwide<br>- Dynamic 3D flyover previews of each hole<br>- Advanced game scoring with Stroke Play and Stableford<br>- Zoom in on targets and layups for better shot planning and saved strokes<br>- Save up to 80% off Hot Deal tee times provided by GolfNow when booked through Golfshot <br><br>Want even more? Upgrade to Golfshot Pro and you&#x2019;ll get:<br>- Premium GPS distance features, scoring and shot tracking for Android Wear<br>- Personalized club recommendations based on your statistics<br>- Scoring for Skins, Nassau, Match play and other games<br>- Save an extra $20 off a Hot Deal tee time provided by GolfNow<br>- Over $200 in savings on golf equipment, GolfNow tee times, golf magazine subscriptions, golf travel, golf instruction and more<br><br>ALL Golfshot members enjoy these accurate and innovative golf GPS features:<br>- Distances to the center of the green<br>- Easy-to-use scorecard for yourself or your foursome<br>- Android Wear support<br>- In-depth statistics of your game, covering fairways hit, greens in regulation (GIR), putts per hole, and more<br>- Up to 80% off tee times provided by GolfNow when booked through Golfshot <br>- The latest golf news, both in your app and in our monthly member newsletter<br>- FREE one-week trial of Golfshot Pro<br><br>Golfshot Plus requires a GPS-enabled Android phone or tablet. Android Wear&#x2122; requires an Android wearable device and watch app. For battery-saving tips, FAQs and all of the amazing features of Golfshot visit golfshotgps.com. If you don&#x2019;t see your course in Golfshot, email us at support@golfshot.com to request a course update or send us your feedback! Course list at golfshot.com/courses<br><br>Created by Shotzoom LLC",
    "histogram": {
        "1": 343,
        "2": 132,
        "3": 189,
        "4": 785,
        "5": 1918
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/4FAZQYPcQVzmaxQYKI61oVrJCIyBX2ZVAzKSMe3xlyCWrXfpi-VQ_z766CgqeVwGOMXh=h310",
        "//lh3.googleusercontent.com/Rr5Zjo89W9s-yh2VbPjovkRvZiq8tAKGb1NGjKPxmByk_clqMGNQD7E_2hTgAOtX-cH9=h310",
        "//lh3.googleusercontent.com/5hmrVXuoE_qYcgdmTqy104w7yz6cuZtiAzItPouei7a1DUBkv-CHbEbnRlRqrVgKGvy_=h310",
        "//lh3.googleusercontent.com/q3vT-hv8kXk7fcKCCdUZChrjK0pci8cSc1Jdr73w-QU_-WDkxml1P7KTnFJ9Yg_4RELS=h310",
        "//lh3.googleusercontent.com/EO_8uzXIX5NIv3j-4R5TJJy3LJVKt-1SwGrlDKQYg3zvghjpef6QPGsM03g0sH36FA=h310",
        "//lh3.googleusercontent.com/3xJV8K02Bva_6sV1ie2cOFcqr3sKKXLk5jRV7bArZLLJ7RmvwZQq8xqOtt6DPElOVfA=h310",
        "//lh3.googleusercontent.com/Ihjes8smlwUGqg9aY99duMylKfp5gVGLFsqZWeCOdLt-geexgkH9pmM1jR3lZFYIhSg=h310",
        "//lh3.googleusercontent.com/s0dnhnaBi6UbysYNq2hgKgtMnt-jJ-ANxmmrzfw6b_LTwlFTFnVxfNDAo-DkwgJdN7k=h310",
        "//lh3.googleusercontent.com/RE8Pxw7T9yWT4yTBg5Nkc_pqIMGH4zw8SmnNW3andMtdq484GI8Ya5gEvdWyvzoLIdSV=h310",
        "//lh3.googleusercontent.com/o0Y26mphTV9roEBQ9JVJbgAnyBiaOUjAMc3ldmt2rxnlStgAXGDKfnzSO_xSo29M49DR=h310"
    ],
    "comments": [
        "Like everyone else I feel cheated when I talk with my friend who has the same app on his iphone. I now have an ipad but they want another $30 bucks from me to get that one. No way.",
        "I have reviewed this app before but after playing 2 new courses in 2 days I cannot rate it too highly. Perfect on my Galaxy S using Juice Defender.",
        "What a shame for me i do not read carefully i bought Samsung S3 (watch) which is not android wear so i cant use it throught my watch please do some in tizen os thanks for a great app",
        "Having problems with accuracy on yardages. Was working rite on and now is 15 yards shorter on (front-center-back)",
        "I have used this app for over 5 years. It has every course I have played across the USA. The best.",
        "Coming from using the iPhone version the last couple of years I am very disappointed.  That version displays much more information which I can't access on this edition. Otherwise it is a decent app."
    ],
    "recentChanges": [
        "Version 4.15.0",
        "- Various bug fixes and improvements",
        "Golfshot supports Android Wear",
        "To view these features:",
        "- Start a new round on your Android device, a notification will appear on your Android Wear device",
        "- Launch the companion app via the 'View Details' action"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.shotzoom.golfshotgps&hl=en&gl=us",
    "appId": "com.shotzoom.golfshotgps"
}