{
    "title": "99 - Taxi and private drivers",
    "summary": "The most complete transportation solution in Brazil.",
    "icon": "//lh3.googleusercontent.com/pYLEGd5bhcWWVBAnQZRMloROI4_WCxao8OBi9D0loXsMBe6FFeGZ_H_e4eOH6IMyKQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.5,
    "reviews": 282962,
    "developer": "99 Tecnologia LTDA",
    "developerId": "99+Tecnologia+LTDA",
    "developerEmail": "passageiro@99taxis.com",
    "developerWebsite": "https://99app.com/?utm_source=play-store",
    "updated": "February 14, 2018",
    "version": "Varies with device",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "size": "Varies with device",
    "description": "99 is the biggest Brazilian e-hailing app. Our mission is to revolutionize mobility and transform people's lives. With few taps, you can request a car or taxi and also decide how you pay for it, whether it's with cash or straight in the app, where you'll have access to exclusive promotions!Why request a 99 ride?Power of choiceWe have several options for you to choose how to move around in your city. Cars with private drivers, taxis or rides billed to your company through our corporate vouchers. Every moment in our day to day asks for a specific solution and it's you who is in control. Where are we going today?Safety first99's partner drivers go through a rigorous selection process. They rely on in-person and online training to ensure all the safety and comfort you deserve. The cars are comfortable and inspected, and of course, we keep a close eye on the passengers' ratings. That reminds us: don't forget to rate your last ride!Fair ratesOur service is the most cost saving option in the city. And since transparency is one of our key values, we will always provide you with an estimate of how much you'll pay before you request your car. And with our newest feature, you can also track your POP ride's price in real time during your ride!Smart-wallet99's coupons are smart! If you have more than one in your wallet, the app itself shows you the best discount before ordering your car and applies it automatically. Keep an eye on your message inbox and do not miss any of them. To enjoy our fantastic discounts, you must register a card or PayPal account in the app.Easy to useJust open the app, choose your destination and you're done! 99 has the best technology in the world to find the right driver for you, and in minutes a car will arrive at your doorstep. Also, talk for free with the driver, by text or audio, using the new feature chat within the app.Feeling like driving with 99? Come join us! Download 99 app for drivers and register here: http://m.onelink.me/85a6df7cWHAT'S NEWThis new version is a totally upgraded experience! Enjoy amazing discounts on your rides and discover all the new facets our service has to offer.",
    "descriptionHTML": "99 is the biggest Brazilian e-hailing app. Our mission is to revolutionize mobility and transform people&apos;s lives. With few taps, you can request a car or taxi and also decide how you pay for it, whether it&apos;s with cash or straight in the app, where you&apos;ll have access to exclusive promotions!<br><br><b>Why request a 99 ride?</b><br><br><b>Power of choice</b><br>We have several options for you to choose how to move around in your city. Cars with private drivers, taxis or rides billed to your company through our corporate vouchers. Every moment in our day to day asks for a specific solution and it&apos;s you who is in control. Where are we going today?<br><br><b>Safety first</b><br>99&apos;s partner drivers go through a rigorous selection process. They rely on in-person and online training to ensure all the safety and comfort you deserve. The cars are comfortable and inspected, and of course, we keep a close eye on the passengers&apos; ratings. That reminds us: don&apos;t forget to rate your last ride!<br><br><b>Fair rates</b><br>Our service is the most cost saving option in the city. And since transparency is one of our key values, we will always provide you with an estimate of how much you&apos;ll pay before you request your car. And with our newest feature, you can also track your POP ride&apos;s price in real time during your ride!<br><br><b>Smart-wallet</b><br>99&apos;s coupons are smart! If you have more than one in your wallet, the app itself shows you the best discount before ordering your car and applies it automatically. Keep an eye on your message inbox and do not miss any of them. To enjoy our fantastic discounts, you must register a card or PayPal account in the app.<br><br><b>Easy to use</b><br>Just open the app, choose your destination and you&apos;re done! 99 has the best technology in the world to find the right driver for you, and in minutes a car will arrive at your doorstep. Also, talk for free with the driver, by text or audio, using the new feature chat within the app.<br><br>Feeling like driving with 99? Come join us! Download 99 app for drivers and register here: http://m.onelink.me/85a6df7c<br><br><b>WHAT&apos;S NEW</b><br><br>This new version is a totally upgraded experience! Enjoy amazing discounts on your rides and discover all the new facets our service has to offer.",
    "histogram": {
        "1": 19634,
        "2": 5840,
        "3": 10135,
        "4": 34227,
        "5": 213126
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/IB6M6oKIVfGJsYxoF38LsYU0TrN1IeXuRXoLXu1wGhvCOPoXmVrxHaOuvpdjBLbHtW0_=h310",
        "//lh3.googleusercontent.com/7D_9dqpExuMa1FK7w2VKooGs08nEj5d4b5IKrmWV5dveMBUqm152JS6dsDAqM4K8I6I_=h310",
        "//lh3.googleusercontent.com/U_wftNims2DNi6CPq32RGpWqbtwYUTLZrh-sKl_xfY5AXUFawjWt8bVflYcvwBG0BA=h310",
        "//lh3.googleusercontent.com/hIGW0lJmC-X7LCFFEJ-dLVDWrCJ1nS10iSTLwnehSmj5OT2v48KDVX0EfowtI_kUk4c=h310",
        "//lh3.googleusercontent.com/1tCky3KOqREaQg8w-Y6Xm9DPUv2qgrb3ycVN_QZtdjapK6ZyTrPAHQxrCbVK0eyjRQ=h310"
    ],
    "video": "https://www.youtube.com/embed/LiJVH_LkSQ4",
    "comments": [
        "Just bad.. my first experience I didn't even get the discount for the first ride. Not to mention, the driver got lost after his GPS froze on his phone and I even ended up pay more for it",
        "I didn't use much on my device because if this app needs the permission to see my photos and files in order to work is because something is wrong. The app literally don't open if i revoke this permission. I check Uber and Cabify and none of them need this permission to work properly. Only the location.",
        "Aplicativo se lança sozinho, sem ser chamado. Adiciona notificações com propaganda. E agora inundou o YouTube com propagandas bossais com volume altíssimo. Não é a toa que serviços alternativos estão destruindo o mercado de Táxi.",
        "2-Isso mesmo...inovem...  1-Nenhum desses aplicativos de transporte tem opção para passageiro escolher motorista bilíngue...em certas cidades isso deveria ser obrigatório... Tanta propaganda em aeroporto pra nada...",
        "Perdi tempo e corridas já (e os motoristas também, por consequência) pois nessa migração para o aplicativo novo, com os dois apps instalados, fica fazendo logoff toda hora, e pedindo senha, etc. Deveria ter sido instruído para desinstalar o app antigo antes de instalar o novo",
        "O aplicativo ficou péssimo e cheio de bugs após a migração. Parece que depois da aquisição pelos chineses a qualidade foi lá para baixo. Vou ser obrigado a retornar para o Easy"
    ],
    "recentChanges": [
        "This version contains a couple bug fixes to enhance your experience.",
        "Want to call your driver? Now all phone numbers contain the local country code for a smooth call connection. How about being more specific on where your pick-up address is? Now passengers can specify their pick-up location by providing the exact street number before ordering their car."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.taxis99&hl=en&gl=us",
    "appId": "com.taxis99"
}