{
    "title": "AIDE- IDE for Android Java C++",
    "summary": "Become an expert Android app developer with AIDE - the IDE for Android",
    "icon": "https://lh5.ggpht.com/0WtsR4_NKcbftR5KvnlQ9YYpkBsfglEKhsvBbe-PSOgWkuDWIw2DIUnkmbuWy7DYFQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 44578,
    "developer": "appfour",
    "developerId": "8815886658662427637",
    "developerEmail": "support@appfour.com",
    "developerWebsite": "http://www.android-ide.com",
    "developerAddress": "appfour GmbH\nMarie-Juchacz-Str 7\n76137 Karlsruhe\nGermany",
    "updated": "October 25, 2017",
    "version": "3.2.171025",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "AIDE is an integrated development environment (IDE) for developing real Android apps directly on your Android device. Follow interactive coding lessons and step-by-step become an expert app developer. Visually design apps, write code with the feature rich editor with code completion, real-time error checking, refactoring and smart code navigation, run your app with a single click and use the Java debugger to find bugs. AIDE features interactive lessons with step-by-step instructions to learn Android app development and Java programming skills. Follow the lessons, become an expert and apply what you've learned in your own app projects.AIDE will turn your Android tablet with keyboard into a real development box. AIDE will turn your Android Phone into a small development computer to browse and touch your code on the go.AIDE supports building apps with Java/Xml and the Android SDK, apps with C/C++ and the Android NDK as well as pure Java console applications. AIDE is fully compatible with Eclipse projects. You can just copy the sourcecode to your device and open the Eclipse project in AIDE to start coding. Alternatively you can keep your sourcecode on your Dropbox - AIDE integrates with Dropbox and allows to easily download from your Dropbox and sync back your changes. AIDE can also open Android Studio projects, which follow the default folder structure. AIDE also supports Git for professional development.Purchasing AIDE Prime, the AIDE Premium Key, the debugger or the UI designer disables all ads in the app.A brief summary of features...Learn-to-code (in-app purchase):- Interactive lessons with step-by-step instructions- Java programming course- Android development course - Game development course- Android Wear courseEdit-compile-run cycle:- Create a sample App with a single click- Build Java/Xml apps- Build C/C++ NDK apps- Build pure Java console applications- Run your App with a single click- No root access required- Incremental compilation for fast build times- Uses Eclipse .classpath project format for compatibility - Open default Android Studio projects- Integrated LogCat viewerDebugger (in-app purchase):- Debug Android Java apps and Java Console apps- Breakpoints- Step-in, step-over, step-out- Inspect thread trace- Inspect local variables- Inspect object fieldsReal-time error checking:- Real time error analyis throughout the whole project as you type- Automatic Quick-Fixes for many errorsUI design:- Preview XML layouts- Jump from view in the designer to the XML elementRefactoring:- Rename- Inline variable - Introduce variable- Extract methodCode:- Code formatter- Organize imports- Out-comment code- Create setters/getters/constructors from fieldsCode navigation:- Goto defintion - Find usages- Goto symbol- Goto classEditor:- Very fast editor even with large files- Code completion for Java and Android XML- Android online help directly from the code- Syntax highlighting for Java and XML- Unlimited Undo/Redo- Pinch zoom- Smart expand selection- Keyboard support with configurable keybindings- UI optimized for small screens to show as much code/content as possibleFilebrowser:- Built-in file manager with the most common features: Rename, delete, create file or folder- Dropbox integration- Git integration with Commit/Dicard/Push/Pull/Branch/Merge and SSH support.To summarize: AIDE offers Java programming for the beginning, intermediate or advanced programmer. Beginners can learn to code, developers can do real development. Using the advanced editor with code completion and syntax highlighting to edit Java and XML files, then compile the software, the use the Compiler to turn it into an app. AIDEs incremental Compiler is blazingly fast. Interoperiability with Android Studio and commandline SDK Tools is provided. Not only does AIDE Support Java development but C and C++ native development is supported as well.",
    "descriptionHTML": "AIDE is an integrated development environment (IDE) for developing real Android apps directly on your Android device. Follow interactive coding lessons and step-by-step become an expert app developer. Visually design apps, write code with the feature rich editor with code completion, real-time error checking, refactoring and smart code navigation, run your app with a single click and use the Java debugger to find bugs. <br><br>AIDE features interactive lessons with step-by-step instructions to learn Android app development and Java programming skills. Follow the lessons, become an expert and apply what you&apos;ve learned in your own app projects.<br><br>AIDE will turn your Android tablet with keyboard into a real development box. AIDE will turn your Android Phone into a small development computer to browse and touch your code on the go.<br><br>AIDE supports building apps with Java/Xml and the Android SDK, apps with C/C++ and the Android NDK as well as pure Java console applications. AIDE is fully compatible with Eclipse projects. You can just copy the sourcecode to your device and open the Eclipse project in AIDE to start coding. Alternatively you can keep your sourcecode on your Dropbox - AIDE integrates with Dropbox and allows to easily download from your Dropbox and sync back your changes. AIDE can also open Android Studio projects, which follow the default folder structure. AIDE also supports Git for professional development.<br><br>Purchasing AIDE Prime, the AIDE Premium Key, the debugger or the UI designer disables all ads in the app.<br><br><b>A brief summary of features...</b><br><br>Learn-to-code (in-app purchase):<br>- Interactive lessons with step-by-step instructions<br>- Java programming course<br>- Android development course <br>- Game development course<br>- Android Wear course<br><br>Edit-compile-run cycle:<br>- Create a sample App with a single click<br>- Build Java/Xml apps<br>- Build C/C++ NDK apps<br>- Build pure Java console applications<br>- Run your App with a single click<br>- No root access required<br>- Incremental compilation for fast build times<br>- Uses Eclipse .classpath project format for compatibility <br>- Open default Android Studio projects<br>- Integrated LogCat viewer<br><br>Debugger (in-app purchase):<br>- Debug Android Java apps and Java Console apps<br>- Breakpoints<br>- Step-in, step-over, step-out<br>- Inspect thread trace<br>- Inspect local variables<br>- Inspect object fields<br><br>Real-time error checking:<br>- Real time error analyis throughout the whole project as you type<br>- Automatic Quick-Fixes for many errors<br><br>UI design:<br>- Preview XML layouts<br>- Jump from view in the designer to the XML element<br><br>Refactoring:<br>- Rename<br>- Inline variable <br>- Introduce variable<br>- Extract method<br><br>Code:<br>- Code formatter<br>- Organize imports<br>- Out-comment code<br>- Create setters/getters/constructors from fields<br><br>Code navigation:<br>- Goto defintion <br>- Find usages<br>- Goto symbol<br>- Goto class<br><br>Editor:<br>- Very fast editor even with large files<br>- Code completion for Java and Android XML<br>- Android online help directly from the code<br>- Syntax highlighting for Java and XML<br>- Unlimited Undo/Redo<br>- Pinch zoom<br>- Smart expand selection<br>- Keyboard support with configurable keybindings<br>- UI optimized for small screens to show as much code/content as possible<br><br>Filebrowser:<br>- Built-in file manager with the most common features: Rename, delete, create file or folder<br>- Dropbox integration<br>- Git integration with Commit/Dicard/Push/Pull/Branch/Merge and SSH support.<br><br><br>To summarize: AIDE offers Java programming for the beginning, intermediate or advanced programmer. Beginners can learn to code, developers can do real development. Using the advanced editor with code completion and syntax highlighting to edit Java and XML files, then compile the software, the use the Compiler to turn it into an app. AIDEs incremental Compiler is blazingly fast. Interoperiability with Android Studio and commandline SDK Tools is provided. Not only does AIDE Support Java development but C and C++ native development is supported as well.",
    "histogram": {
        "1": 3566,
        "2": 1550,
        "3": 3471,
        "4": 7280,
        "5": 28711
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/1b6qDyj4nGlWXfiHtyxgMd2-Rlgo-oirt6hV-w9RrBaBjIK_e1-BgIEALw_G-N2WnqR8=h310",
        "//lh5.ggpht.com/-nAke_Dl-BY1jaZUKQu_HThy3-15W15Dt4p1nVK_rx5nRyDQ8sVmrIcKdddIMT9hhg=h310",
        "//lh4.ggpht.com/Trt_E_M2PUtY_9RFeSyPXlL-CmTbjR1rC_MbUrqakqm2M5So9U4lS_2XDn0xLyO9kOc=h310",
        "//lh6.ggpht.com/N-Bo6DkrnPhrEGIcX1_467l0_Svk4IsDStA5f8-Zvp0CMKYSGTy-fJSy-HGIybUpew=h310",
        "//lh4.ggpht.com/CyUqRe4CucAZgC_XUiyTl9ZiIjcbYIofjuhYFK5MW2fZqJNWoGX2kp94yy6IaIc6fWE=h310",
        "//lh6.ggpht.com/eblFyhl_XdoL7g-p7TINiTx4IdNlzfhytcZYZvWmoyBZNMGLRrdQyxr3UjUhUA5miA=h310",
        "//lh4.ggpht.com/VZmHPhE1UUfOenV-QallEZkAWU-P_NzpjrRJintpbgz_KQPrHgVL6RTJS9wq5GfQcg=h310",
        "//lh3.ggpht.com/4o9i9NYKZdrI2OsbCnLPwRiKhUYbHfwp_4iqQZrv0n4HeTolC6m2HMm7gvHFb6-wzE4=h310",
        "//lh3.googleusercontent.com/qKk8m9Y6uASPR1FxHp0Trl7Ak9D4jQcT1ldKHZ7mBE6zc86LFvELU0Q0zazZLtUrmlM=h310"
    ],
    "video": "https://www.youtube.com/embed/zF7mW1XjjqQ",
    "comments": [
        "I've been using this app for several years now, and I gotta tell you.... best app ever! It has been a lifesaver. If I hadn't been able to do the majority my programming while on the go, there's no way I would have made it through college. There's no question that without AIDE, I would not be the programmer I am today. In fact, I probably would not have been able to pursue programming at all.   Thank you AIDE developers!!",
        "I like being able to learn these concepts in an easy to understand language. However, at some times, the system seems to assume that we know how something not yet taught should be done. I'm also upset that the lesson concerning backgrounds is locked as incomplete because there is no problem it keeps telling me there is. Overall though, pretty neat, I like it.",
        "Cannot handle long lines of code. I paste in a string of only a few hundred characters and the app becomes unusable with visual glitches and unresponsiveness. File type doesn't matter (I tried putting the data in a separate file), the app simply can't handle 'long' lines.",
        "Pretty much a waste of time. It's unable to compile my existing android studio projects, and doesn't give me any error messages. If you want to write a toy 'HelloWorld' I suppose it's adequate.",
        "It's amazing, I'm glad something like this exist. That that being said, I got this weird bug where it crashes after a save when you implement services. If the devs could look into it or at least tell me what's going on I'd appreciate it.",
        "Was once a great app - isn't anymore. This was a very good app a few years ago, but it got so much worse that you can barely use it without buying the premium version (15€). Now you can't even save a file without having to pay. And the popup saying that you should buy the premium version comes up every few seconds. Also the support for this app got much worse over time. In 2014 there were updates nearly every week. Now this app only receives an update every few months. Please stop squeezing this app for money!"
    ],
    "recentChanges": [
        "New: Support NDK development on Android 8.0 (\"Oreo\") devices.",
        "Older changes",
        "Improved: NDK support is now delivered via Google Play",
        "New: Updated Google repository and Android Support Libraries to latest version",
        "New: Support for Multi-Window Mode for Android 7 (Nougat) and above",
        "Improved: Updated Android Support Libraries",
        "Fixed: Problems with Iterator class",
        "New: Support for Android 7.1",
        "Improved: Updated Android support repository and Google repository to latest version"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.aide.ui&hl=en&gl=us",
    "appId": "com.aide.ui"
}