{
    "title": "Meteor Shower Calendar",
    "summary": "Be notified and see a list of upcoming meteor showers and details on each!",
    "icon": "//lh4.ggpht.com/6au9RYzyDwJGT3a3DvtvBN0Rq4a-xGmM7AVCqecQLVQ0ulk8rhkU303RWJykIo8nPwE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.2,
    "reviews": 3813,
    "developer": "ccw",
    "developerId": "8646779439269017842",
    "developerEmail": "dev@ccwilcox.com",
    "developerWebsite": "http://www.ccwilcox.com",
    "developerAddress": "5624 Wingate Ave NW",
    "updated": "September 23, 2017",
    "version": "2.4.1",
    "genre": "Education",
    "genreId": "EDUCATION",
    "description": "Would you like to know when the next meteor shower is? This app will display a list of upcoming meteor showers and the approximate date in which they will peak with specific details on each.Features:• A reminder system to automatically notify you when the next shower is coming up and more details on an Android Wear device!!• Expandable notifications on 4.1+ devices• Share this app with a friend on both Android and iOS• Widget for your home screen to show the number of days until the next shower, your location's sunrise/sunset times, and the current phase of the Moon! • LockScreen widget on 4.2+ devices• Share details about an individual meteor shower• Choose to sort the list of meteor showers by peak, start, or ending dates• Swipe left/right to see next/previous meteor showers when viewing the details page• The upcoming sunrise or sunset time is shown at the top • Enable the \"Auto theme\" feature and the theme will automatically change to day and night mode before and after sunrise/sunset!• Conduct a Google Search within the app to read even more about each meteor shower such as its origins and many, many other details and share it with your friends via SMS, Email, Facebook, Google+, Twitter, or any other social network!• View a Sky Map search to point you approximately where in the sky to look for the meteor shower when it peaks. Compatible with SkEye and Google Sky Map• See current Weather Forecast to get ready for the the upcoming conditions• Shows the Phase of the Moon on the approximate meteor shower peak date!Go out and enjoy looking at the sky!Ad supported. To remove ads and support development, please purchase the Meteor Shower Calendar Key Permissions:- Internet needed to show ads and download weather data - Location needed to calculate sunrise/sunset times and weather data- Automatically start at boot needed for the notification system",
    "descriptionHTML": "Would you like to know when the next meteor shower is? This app will display a list of upcoming meteor showers and the approximate date in which they will peak with specific details on each.<br><br><br><b>Features</b>:<br>&#x2022; A reminder system to automatically notify you when the next shower is coming up and more details on an Android Wear device!!<br>&#x2022; Expandable notifications on 4.1+ devices<br>&#x2022; Share this app with a friend on both Android and iOS<br>&#x2022; Widget for your home screen to show the number of days until the next shower, your location&apos;s sunrise/sunset times, and the current phase of the Moon! <br>&#x2022; LockScreen widget on 4.2+ devices<br>&#x2022; Share details about an individual meteor shower<br>&#x2022; Choose to sort the list of meteor showers by peak, start, or ending dates<br>&#x2022; Swipe left/right to see next/previous meteor showers when viewing the details page<br>&#x2022; The upcoming sunrise or sunset time is shown at the top <br>&#x2022; Enable the &quot;Auto theme&quot; feature and the theme will automatically change to day and night mode before and after sunrise/sunset!<br>&#x2022; Conduct a Google Search within the app to read even more about each meteor shower such as its origins and many, many other details and share it with your friends via SMS, Email, Facebook, Google+, Twitter, or any other social network!<br>&#x2022; View a Sky Map search to point you approximately where in the sky to look for the meteor shower when it peaks. Compatible with SkEye and Google Sky Map<br>&#x2022; See current Weather Forecast to get ready for the the upcoming conditions<br>&#x2022; Shows the Phase of the Moon on the approximate meteor shower peak date!<br><br>Go out and enjoy looking at the sky!<br><br>Ad supported. To remove ads and support development, please purchase the Meteor Shower Calendar Key <br><br>Permissions:<br>- Internet needed to show ads and download weather data <br>- Location needed to calculate sunrise/sunset times and weather data<br>- Automatically start at boot needed for the notification system",
    "histogram": {
        "1": 212,
        "2": 186,
        "3": 359,
        "4": 878,
        "5": 2178
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/VMK9setJHjrDo7B98zxF_ARsHUqhhFAeznxjuIAPl1Lw6KGCZJdabLtmrN685vB52B6g=h310",
        "//lh3.googleusercontent.com/YJASGT2XyyCKWA4AY-O_gKgqTcTJ3Fvw5qBQWEehhCAKhD5z_I-7f9yM7hxy-EtrCD4=h310",
        "//lh3.googleusercontent.com/tQN0I78iixV5XXlnykJ3d0e8d9Gmxc8P8yRA7at8eRMg1wjByKsq-00vZ02Onw6YENU=h310",
        "//lh3.googleusercontent.com/n7bA1MNvdOtz_VP_abZX3BoN9gXUZyvnUxcZ8Re3ymSFGOYYyPf5kVp6j1NV6swLJdyy=h310",
        "//lh3.googleusercontent.com/ZBwg5tK5p8E16mCe55_aFlXCx87iQHSOG9kDAhah7Of3NqGwK4a6GBS7UASclbIi8A=h310",
        "//lh3.googleusercontent.com/uc4PZLsHghs6BVpLcA3PIjImUnGL11d6VxNsHzciReHoeRbKm8DnN-dbVXyf8JafYQg=h310",
        "//lh3.googleusercontent.com/06GJ-zIwmWOvl4r-SdQtmPhSOOuUrnsztov9yvTyWmIKR-izAaWcqE5z_hbimiucAPY=h310",
        "//lh3.googleusercontent.com/ixG4LexkFLPW0JC7CNi04RUs6QXTat2WL54_1KO9HETEsJJ5SgaZokjGebO7IP2S2EM=h310",
        "//lh3.googleusercontent.com/QngR0dspIhbiKnXd2rSGpE-LjvLi_tdt5EAM1Wl49WhvgCowEMHQS5nJNpzfgjYP98Pj=h310"
    ],
    "video": "https://www.youtube.com/embed/swnzSFz9IqI",
    "comments": [
        "This app seems to have an issue with my phone i.e. it won't pick up a location from my GPS (BLU Life One v2) but the app doesn't have any way in it's settings to enter the coordinates manually, and as such it refuses to work properly, and NO, I'm NOT allowing you to get my IP address!  Sorry, uninstalling the app!  L8R",
        "This is a good App! But when it just updated I now get noticed not just in English now but also in Spanish 😠😲 that ticks me off 😤. I didn't Pay now to got noticed in SPANISH .",
        "Love it, keeps me in formed, adds r tiny, and new weather addition is good but the widget doesnt show up on home screen.",
        "SUPERIOR IN MAJOR  ATLASES WORLD RECEPTIONS, EXTREMELY RELIABLE WEATHER FORECASTING. 7☆☆☆☆☆☆☆. GREATNESS PROGRESSIONS TOOLS. LOVE IT.",
        "Loaded with garbage and inappropriate ANNOYING ads",
        "Love this app. I've never had issues with it and it's always accurate and informative. Thanks!"
    ],
    "recentChanges": [
        "v2.4.1",
        "- Fixed color of Navigation Drawer icon in night theme",
        "- Changed weather notifications to be off by default. Weather notifications can be enabled in the app's Settings",
        "v2.4",
        "- New and improved Floating Action Button with more functionality",
        "- New weather notification for current weather information for your current location (This can be disabled in the app's settings)",
        "- Updates to layouts and scrolling features following Material Design guidelines",
        "- Several minor bugs fixed"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ccwilcox.meteorshower&hl=en&gl=us",
    "appId": "com.ccwilcox.meteorshower"
}