{
    "title": "Parrot Voice Recorder",
    "summary": "The world&#39;s most highly configurable voice recorder with hundreds of settings.",
    "icon": "//lh3.googleusercontent.com/eguiiWeD1bTubJt5TPjDY1yUUCG4rY4vwpCcyrsbgIlgzjoIJDRlxnv04XlbWGXYGEc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 4943,
    "developer": "Searing Media Inc.",
    "developerId": "Searing+Media+Inc.",
    "developerEmail": "androidsupport@theparrotapp.com",
    "developerWebsite": "http://www.theparrotapp.com/android/",
    "developerAddress": "2823 MacKay St\nRegina, SK, Canada\nS4N 2T9",
    "updated": "February 27, 2018",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Parrot is a free voice recorder app which allows you to Record, Play and Share voice recordings, all within 3 taps! A simple and beautiful user interface helps you create crisp and balanced voice recordings. Use Parrot as your go-to voice recorder and start recording voices, audio, phone conversations, your singing: anything you like, in high definition!Record yourself or any voice message in high quality with the best dictaphone for Android. Download Parrot, save your first voice memo today, and start being more organized.Parrot Pro (available as in-app purchase) allows you to Record Phone Calls, Schedule Recordings for a specific time and date and synchronize your tracks to the cloud using Google Drive or Dropbox.Parrot is has no time limits or no functionality limits. With over 100 different setting combinations, you can finely tune your recordings and playback.Parrot Basic - All Users• Record: Create voice recording with a live and buttery smooth sound wave graph as you record to help you easily identify when you’re receiving the right levels. You can record using the standard mic, camcorder mic or Bluetooth microphones.• Play: Playback your recordings with a full waveform. Tap, touch and drag the waveform to seek to the perfect time in your recording. Playback your voice recordings with a simple and beautiful list that helps you easily identify tracks with intuitive calendar icons as well as playing and paused animations.• Share: Share your tracks with your favorite apps with two simple taps. Your favorite apps are saved to allow you to quickly share in the future.• Notifications: We’ve included simple and easy notifications in order to allow you to use Parrot and continue to work in the background.• Android Wear: Manage your recording and playback right from your wrist.Parrot Pro - In-app Purchase• Phone Call Recording: Record incoming or outgoing phone calls either automatically or by prompt before or after the call.• Scheduled Recordings: Schedule a recording for a specific date, time and duration. • Cloud Backup: Easily synchronize all your files individually or as a zip to Google Drive, Dropbox or anywhere on your device.Recording Options (Dictaphone options)• Quality: Recording in WAV and MP4 formats. Choose your sample rate and bit rate.• Source: Record your voice from your device mic, camcorder mic or Bluetooth headset.• Effects: Use Android’s built-in recording effects to remove background noise, cancel out echo and automatically control gain. For those situations where more power is needed, set your own custom gain.• Auto Pause (skip silence): Easily skip silence while recording by having the app pause and restart for you based on time and sound sensitivity thresholds.• Alerts: Use both vibration and beeps to help you identify when the recording has started and stopped.Playback Options• Bass Boost: Boost the bass to help amplify low frequencies of the recordings.• Volume Boost: Enhance the volume of the track to help hear even quiet noises.• Preset Reverb: Hear your recording as if it were played in a small room or large hall.App Permissions• Record Audio: We need access to your mic to create voice recordings.• External Storage: We require access to your SD card as this is our preferred location to store your tracks.• Phone Calls: Parrot Pro mode allows users to record phone calls.• Wakelock: Used in Parrot Pro to ensure that your phone wakes up for schedule recordings.• Vibration: We have a setting that allows you to make your device vibrate when you start or stop a recording.For more information, help and support visit http://www.theparrotapp.com",
    "descriptionHTML": "Parrot is a free voice recorder app which allows you to Record, Play and Share voice recordings, all within 3 taps! A simple and beautiful user interface helps you create crisp and balanced voice recordings. Use Parrot as your go-to voice recorder and start recording voices, audio, phone conversations, your singing: anything you like, in high definition!<br><br>Record yourself or any voice message in high quality with the best dictaphone for Android. Download Parrot, save your first voice memo today, and start being more organized.<br><br>Parrot Pro (available as in-app purchase) allows you to Record Phone Calls, Schedule Recordings for a specific time and date and synchronize your tracks to the cloud using Google Drive or Dropbox.<br>Parrot is has no time limits or no functionality limits. With over 100 different setting combinations, you can finely tune your recordings and playback.<br><br>Parrot Basic - All Users<br>&#x2022; Record: Create voice recording with a live and buttery smooth sound wave graph as you record to help you easily identify when you&#x2019;re receiving the right levels. You can record using the standard mic, camcorder mic or Bluetooth microphones.<br>&#x2022; Play: Playback your recordings with a full waveform. Tap, touch and drag the waveform to seek to the perfect time in your recording. Playback your voice recordings with a simple and beautiful list that helps you easily identify tracks with intuitive calendar icons as well as playing and paused animations.<br>&#x2022; Share: Share your tracks with your favorite apps with two simple taps. Your favorite apps are saved to allow you to quickly share in the future.<br>&#x2022; Notifications: We&#x2019;ve included simple and easy notifications in order to allow you to use Parrot and continue to work in the background.<br>&#x2022; Android Wear: Manage your recording and playback right from your wrist.<br><br>Parrot Pro - In-app Purchase<br>&#x2022; Phone Call Recording: Record incoming or outgoing phone calls either automatically or by prompt before or after the call.<br>&#x2022; Scheduled Recordings: Schedule a recording for a specific date, time and duration. <br>&#x2022; Cloud Backup: Easily synchronize all your files individually or as a zip to Google Drive, Dropbox or anywhere on your device.<br><br>Recording Options (Dictaphone options)<br>&#x2022; Quality: Recording in WAV and MP4 formats. Choose your sample rate and bit rate.<br>&#x2022; Source: Record your voice from your device mic, camcorder mic or Bluetooth headset.<br>&#x2022; Effects: Use Android&#x2019;s built-in recording effects to remove background noise, cancel out echo and automatically control gain. For those situations where more power is needed, set your own custom gain.<br>&#x2022; Auto Pause (skip silence): Easily skip silence while recording by having the app pause and restart for you based on time and sound sensitivity thresholds.<br>&#x2022; Alerts: Use both vibration and beeps to help you identify when the recording has started and stopped.<br><br>Playback Options<br>&#x2022; Bass Boost: Boost the bass to help amplify low frequencies of the recordings.<br>&#x2022; Volume Boost: Enhance the volume of the track to help hear even quiet noises.<br>&#x2022; Preset Reverb: Hear your recording as if it were played in a small room or large hall.<br><br>App Permissions<br>&#x2022; Record Audio: We need access to your mic to create voice recordings.<br>&#x2022; External Storage: We require access to your SD card as this is our preferred location to store your tracks.<br>&#x2022; Phone Calls: Parrot Pro mode allows users to record phone calls.<br>&#x2022; Wakelock: Used in Parrot Pro to ensure that your phone wakes up for schedule recordings.<br>&#x2022; Vibration: We have a setting that allows you to make your device vibrate when you start or stop a recording.<br><br>For more information, help and support visit http://www.theparrotapp.com",
    "histogram": {
        "1": 381,
        "2": 140,
        "3": 273,
        "4": 1006,
        "5": 3143
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/6pmb1_KCZtAiRB6PSfBA-iDs-AErdYyAFpztXG8guqJLuktkEUFaFGDngmIIgX520Yg=h310",
        "//lh3.googleusercontent.com/0XvwnUA5RAU5glTaD8O35dgZrxQ0vdCi3JbbqJW9ThNIm-WNhkYc_0BxLAM4niVnVO8=h310",
        "//lh3.googleusercontent.com/tIQKzNs_57fCd_kqak9YjBs5T674KEnR7k6QaZkVUFZbO6_pBKlOORqcKvdkjpLRxlk=h310",
        "//lh3.googleusercontent.com/ottqZzDU2XuAbERSH61n8ikV8nbY9BHYmJSWPQE-EnPpVCB-sMdpuuDihRwamMgXKbpY=h310",
        "//lh3.googleusercontent.com/LimTPnlK8APhFECRT6rXJ15cbEZODULgl8qcDiEy0Po6R-t_jHS_aLZU5jJzwmxLCg=h310",
        "//lh3.googleusercontent.com/JAiSxjXz4rztUzi67w_M6uLDKapE-Jm-cZeJLXbpvnz-ZoFE7yX6tYoTlTez9Y8ASJk=h310",
        "//lh3.googleusercontent.com/2F34EcpHWH-1AtHsj09kMs7SOgSx5w_brwGQc3cS6StKJ_UJBGyMXZk4u37ooEJhJAo=h310",
        "//lh3.googleusercontent.com/pGtzXl4wydKAXJt04JFShh1H9d1NIqw2W46wrcH4YmJ1rIu_UWNypLD_fkd7wvDn7tc=h310"
    ],
    "comments": [
        "Parrot is a very respectful app, it has many features, most of which are turned off by default, it asks for permission only when you try to do something that requires it, and it never asked me for a permission it didn't obviously need. I am confused why bluetooth recording is limited to 8kHz, but given the experience I'm willing to assume that's google's fault",
        "Worth the paid version. I use it for lectures, and recording important phone calls. It's extremely simple to use. Would recommend",
        "Crashes all the time on my new oneplus5t. Very bad app",
        "I would like a refund it doesn't work !!!",
        "It simply does its job",
        "reliable and super ease to use"
    ],
    "recentChanges": [
        "Added adaptive icons for Android Oreo (8.0) devices to allow users to have control over the shape of the app icon. Fixed crashes and reduced app size and footprint."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.SearingMedia.Parrot&hl=en&gl=us",
    "appId": "com.SearingMedia.Parrot"
}