{
    "title": "Contrack - Personal Networking",
    "summary": "Contrack helps you to take care of your personal network.",
    "icon": "//lh5.ggpht.com/v6J2b9pRnqa5-x3-UVqXhYm07A5MRY7csRSo1fD1egzlmU2fNNsNhwN_SkYLpgzRk4g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.1,
    "reviews": 172,
    "developer": "Acquasys",
    "developerId": "7896438756410566003",
    "developerEmail": "contact@acquasys.com",
    "developerWebsite": "http://www.acquasys.com",
    "developerAddress": "Av. Presidente Juscelino Kubitschek, 1600\nSão Paulo, SP - Brasil",
    "updated": "August 3, 2015",
    "version": "Varies with device",
    "genre": "Social",
    "genreId": "SOCIAL",
    "size": "Varies with device",
    "description": "Contrack is a personal networking tool that helps you to stay in touch with professional contacts, friends and relatives by tracking when and how you contacted each person and suggesting who to call next, based on priorities and time limits you define.Using a friendly \"check-in\" system, Contrack rewards you with points for every interaction made with people in your list, based on criteria like contact methods, priorities and initiative, which are then used to track your networking performance over the last months. Contrack also provides valuable statistics about your interactions, like preferred contact methods and most contacted people and groups.Managing your network in Contrack only requires these simple steps:1) Import people from your phone's contact list2) Assign each person a priority level (optional)3) \"Check-in\" whenever you interact with someone in your list4) Let Contrack show you who needs to be contacted next and how active you have been with your network.Features:★ Keeps a separate list of relevant contacts you wish to track, imported from your phone book or social networks and sorted according to priorities and last contact dates★ Contacts can be organized in custom groups, searched and filtered★ A familiar \"check-in\" mechanism makes recording interactions quick and fun★ A check-in history tracks your interaction with each person over time★ Useful statistical charts: points per month, contact diversity, most contacted people, interactions x methods, interactions x groups, initiative and more★ Companion apps for Android Wear and Pebble smartwatches allow checking in and placing calls directly from your watch★ Home screen widgetThe free version is ad-supported. A premium license, available for purchase here on Google Play, offers these additional features:★ Automatic check-ins from call log★ Multiple (group) check-ins (great for events)★ Notifications for time limits exceeded★ Birthday notifications★ Export interaction history to CSV file★ Backup/restore data to storage card★ No adsPlease use the contact e-mail for bug reports, questions or suggestions, so we can respond as necessary. If you like Contrack, please leave your rating here. Thank you!",
    "descriptionHTML": "Contrack is a personal networking tool that helps you to stay in touch with professional contacts, friends and relatives by tracking when and how you contacted each person and suggesting who to call next, based on priorities and time limits you define.<br><br>Using a friendly &quot;check-in&quot; system, Contrack rewards you with points for every interaction made with people in your list, based on criteria like contact methods, priorities and initiative, which are then used to track your networking performance over the last months. Contrack also provides valuable statistics about your interactions, like preferred contact methods and most contacted people and groups.<br><br>Managing your network in Contrack only requires these simple steps:<br><br>1) Import people from your phone&apos;s contact list<br>2) Assign each person a priority level (optional)<br>3) &quot;Check-in&quot; whenever you interact with someone in your list<br>4) Let Contrack show you who needs to be contacted next and how active you have been with your network.<br><br>Features:<br><br>&#x2605; Keeps a separate list of relevant contacts you wish to track, imported from your phone book or social networks and sorted according to priorities and last contact dates<br><br>&#x2605; Contacts can be organized in custom groups, searched and filtered<br><br>&#x2605; A familiar &quot;check-in&quot; mechanism makes recording interactions quick and fun<br><br>&#x2605; A check-in history tracks your interaction with each person over time<br><br>&#x2605; Useful statistical charts: points per month, contact diversity, most contacted people, interactions x methods, interactions x groups, initiative and more<br><br>&#x2605; Companion apps for Android Wear and Pebble smartwatches allow checking in and placing calls directly from your watch<br><br>&#x2605; Home screen widget<br><br>The free version is ad-supported. A premium license, available for purchase here on Google Play, offers these additional features:<br><br>&#x2605; Automatic check-ins from call log<br><br>&#x2605; Multiple (group) check-ins (great for events)<br><br>&#x2605; Notifications for time limits exceeded<br><br>&#x2605; Birthday notifications<br><br>&#x2605; Export interaction history to CSV file<br><br>&#x2605; Backup/restore data to storage card<br><br>&#x2605; No ads<br><br>Please use the contact e-mail for bug reports, questions or suggestions, so we can respond as necessary. If you like Contrack, please leave your rating here. Thank you!",
    "histogram": {
        "1": 17,
        "2": 10,
        "3": 12,
        "4": 38,
        "5": 95
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/sYCY5eTRwciPNp2kxyItVJsPvJpMTrsaRFKe8KcLMJvUX3Wr8wouhzBrFTyl8bixq42C=h310",
        "//lh5.ggpht.com/3TdZTGQOOApYX4KUtOqjZF33BC1zdvma8ZHgnoTqyYqW3IQr7EcL_dZK4iiL1GopHkM=h310",
        "//lh6.ggpht.com/1aDYuqkHtwSMyfZypsLXA1s8VBNVpn0X_6Knh03-rQNdvexmcO9WCoUiyou345DCe-2M=h310",
        "//lh3.ggpht.com/AYogmOFTrZlHik-kr4TSD7DJiOhjJCLZjiFMneMYESysM_cFXNzjeb1kiUortbtYQWg=h310",
        "//lh5.ggpht.com/rwdiXnAU7gB4ysTYZnhi6Sr5lMXlk_XWLol1tF3_gVXo4vV7rNiyK_Mv0T8ijRK3w7s=h310",
        "//lh5.ggpht.com/CN_1ALczvwwbU8Q5DLh9vrLAumqkQ-Spjzafpu6q9Nk622-QhNiZbL8sLSqyrHjCBymD=h310",
        "//lh4.ggpht.com/kupkjYbZ0wsKIMFx2XSd4h6ACBbVclbZrK3CTKGyHcwgzqLYsV1RFg6dAVquEP1Tt9E=h310",
        "//lh3.googleusercontent.com/tcFmof6VR84RZwNeGE2MWE3EUkhbkLPdQd2hYM0Hl7r_uDIOk20Dirdf9dn7IFDTD_4=h310",
        "//lh3.googleusercontent.com/JtPJHBo59mqtfAn-mOjijX8SPqm4I9OpGOhRKYIbFk18P4srn45t-hmj9f1JlTbBL2w=h310"
    ],
    "video": "https://www.youtube.com/embed/Q7qV6VmlvEo",
    "comments": [
        "Love, love, love this app so far. It helps me keep up with my clients and prospects in a timely fashion and with ministry outreach. It's great to be able to see when last I contacted someone and even the content of that interaction. It does not seem to update when I call out from the app but that's not major. This is the first real review I've written for any app.",
        "It was great when it started out years ago, years later until now, it is definitely still the best!",
        "Needs one more thing If I could add contacts directly, not just import them, this would be the perfect app.",
        "I've beeing looking for such app for years Of course, could be further improved and developped.",
        "Great app It is a great app. Can be improved with unlimited customized categories such as relatives,  friends, etc",
        "Great app, and it's something iv been really looking for. I think the user interface needs to be more professional looking ..."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.acquasys.contrack&hl=en&gl=us",
    "appId": "com.acquasys.contrack"
}