{
    "title": "Geotag Photos Pro 2",
    "summary": "Turn your phone into ultimate geotagging solution - Geotag Photos Pro",
    "icon": "//lh3.googleusercontent.com/fgJz18qPFv9WLibgMiwyTB1A3FNWpFhQvcRR9H4cn0-Dg5iUsscQc9cTqHc9qMnLibw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.9,
    "reviews": 376,
    "developer": "TappyTaps s.r.o.",
    "developerId": "7865470206882283925",
    "developerEmail": "support@tappytaps.com",
    "developerWebsite": "http://www.geotagphotos.net",
    "developerAddress": "TappyTaps s.r.o\nČelakovského 1457\nHořice\n508 01\nCzech Republic",
    "updated": "December 20, 2017",
    "version": "1.5.10",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "description": "Geotag Photos Pro is professional geotagging solution - all you need to geotag photos taken by your EXTERNAL camera (DSLR, mirrorless or compact one). It supports JPG & RAW photos and its data can be used also with Lightroom, Aperture, Picasa and other photo apps that supports geotagged photos.Try 3 trips for FREE and then unlock the full app for a one time fee.Geotag Photos Pro is praised by industry experts- Geotagging App of the Year by Macworld- Repeatedly recommended by leading Adobe Lightroom professionals- Recommended in many great books such as Lightroom 4 UnMasked, Lightroom 4 the missing FAQ, Lightroom 4 Roadmap for photographers- Praised by leading photography magazines and websites all over the world (Techradar, Ephotozine, Fotomaf, Xatakafoto, Lightroom Secrets, Digital-Fotografie, Pixelmania.nl, Photoplus...)Best facts about Geotag Photos Pro- Complete solution - mobile app records your position while you’re taking great photos and a desktop app geotags your images using recorded data.- Flawless Lightroom Compatibility - GPX files from the app work flawlessly inside Lightroom’s Map module for geotagging- Dropbox and Google Drive support - automatically export all your trips as GPX files- Smart watch app - dedicated app for Android Wear and Pebble to control app from your wrist ! Automatic trip upload - the app automatically sync all your trips ( you can switch to manual uploads in settings)- Battery usage optimized for whole day of geotagging- Choose the logging interval and accuracy for whatever you need- Organized trips history- Statistics of your trips- Export to GPXFREE desktop geotagging appAdds GPS location to your your JPG or RAW photos quickly and easily! Works both online and offline and there are version for any operating system - Mac OS X, Windows and even LinuxSupported image formats: jpg, nef, cr2, crw, dcr, ciff, erf, orf, k25, kdc, mef, mrw, nrw, pef, raf, tif, tiff, raw, arw, rw2, srf, sr2, srw, x3f, dngVisit our website for more info http://www.geotagphotos.net",
    "descriptionHTML": "Geotag Photos Pro is professional geotagging solution - all you need to geotag photos taken by your EXTERNAL camera (DSLR, mirrorless or compact one). It supports JPG &amp; RAW photos and its data can be used also with Lightroom, Aperture, Picasa and other photo apps that supports geotagged photos.<br><br>Try 3 trips for FREE and then unlock the full app for a one time fee.<br><br><b>Geotag Photos Pro is praised by industry experts</b><br>- Geotagging App of the Year by Macworld<br>- Repeatedly recommended by leading Adobe Lightroom professionals<br>- Recommended in many great books such as Lightroom 4 UnMasked, Lightroom 4 the missing FAQ, Lightroom 4 Roadmap for photographers<br>- Praised by leading photography magazines and websites all over the world (Techradar, Ephotozine, Fotomaf, Xatakafoto, Lightroom Secrets, Digital-Fotografie, Pixelmania.nl, Photoplus...)<br><br><b>Best facts about Geotag Photos Pro</b><br>- Complete solution - mobile app records your position while you&#x2019;re taking great photos and a desktop app geotags your images using recorded data.<br>- Flawless Lightroom Compatibility - GPX files from the app work flawlessly inside Lightroom&#x2019;s Map module for geotagging<br>- Dropbox and Google Drive support - automatically export all your trips as GPX files<br>- Smart watch app - dedicated app for Android Wear and Pebble to control app from your wrist ! Automatic trip upload - the app automatically sync all your trips ( you can switch to manual uploads in settings)<br>- Battery usage optimized for whole day of geotagging<br>- Choose the logging interval and accuracy for whatever you need<br>- Organized trips history<br>- Statistics of your trips<br>- Export to GPX<br><br><b>FREE desktop geotagging app</b><br>Adds GPS location to your your JPG or RAW photos quickly and easily! Works both online and offline and there are version for any operating system - Mac OS X, Windows and even Linux<br><br>Supported image formats: jpg, nef, cr2, crw, dcr, ciff, erf, orf, k25, kdc, mef, mrw, nrw, pef, raf, tif, tiff, raw, arw, rw2, srf, sr2, srw, x3f, dng<br><br>Visit our website for more info http://www.geotagphotos.net",
    "histogram": {
        "1": 50,
        "2": 28,
        "3": 32,
        "4": 70,
        "5": 196
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FhRtJTs1uLY-Wr8rLW5zF-AqzdFL_8Z8XNIYtevjp2jAELwH8roWeTEDu-VkzeoXIOTf=h310",
        "//lh3.googleusercontent.com/gZDjUPME3O0MNZtlyeZsgsSk2ygEJUpEbA-JVjIogaAPjk5Y8iQ1yBnPDhZyYj2sOW3a=h310",
        "//lh3.googleusercontent.com/cJWxiLSCY0p31Vjvv9YcP9K31TokN6OV-gip4d9x30_2CtbUe74MkHhk0zy_uI0UPPY=h310",
        "//lh3.googleusercontent.com/WwLXOitfPXERx_tBPpOAS_a2c2wrKek3iZ_R5UPx3-RsvlSFRXusgHkG6_qjx8SvboEN=h310",
        "//lh3.googleusercontent.com/2wu6gOz9AuZWwrO_OSfzxofaMIozDOdRNyNSd-hTR2-J-vJOLx91pPIFxEC8sZzn2UA=h310",
        "//lh3.googleusercontent.com/nehd_93hB2hiVNcMjKIi98yxlDaMa8sLFnvEmRdktmoPSPwrc_9l8WOYbYnz_2ocGJc=h310"
    ],
    "comments": [
        "I have too many problems with errors in the logs for this to be a proper solution. The app uploads more than one log file for each trip, and splits the trip into several <trkseg> in the gpx files. Usually all the data is there (at least as far as I can see), but I have to manually edit the gpx files every single time to get the desktop app to accept them. I will instead look for another app to log my trips and create the gpx files and use your excellent desktop app to tag the photos. – EDIT: I now realised your desktop app doesn't accept GPX files from other apps than your own. So I'm using GPS Logger for Android and GeoSetter for Windows instead.",
        "I thought I was purchasing a geotag app. Once I paid the small amount it asked for another nine pounds. I paid that and the app doesn't even tag my photos with MGRS coordinates.  Very disappointing and fell ripped off.",
        "Won't geotag existing photos which is the whole reason I downloaded it. Why do I need an app on my phone to geotag photos I take on my phone? Just turn on location services. Waste of time.",
        "Works perfectly.  Not too much power consumption, very quick tagging. Much better than the Panasonic app I used before.",
        "Bit sceptical at first, but it does exactly as described and very accurately.  Wish I knew about it and purchased it sooner.",
        "Google decides to break the KML format and you can't use it in Lightroom now. Lucky I found this app. It is smart and won't deplete battery like other apps."
    ],
    "recentChanges": [
        "v1.5.10",
        "- bugfix version",
        "v1.5.0",
        "- NEW map types (satellite, hybrid and terrain)",
        "- NEW Trip name advisor (based on your location)",
        "- NEW languages (German, Italian, Spanish)",
        "If you like our Geotag Photos Pro, please write us a review on Google Play ;)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tappytaps.android.geotagphotospro2&hl=en&gl=us",
    "appId": "com.tappytaps.android.geotagphotospro2"
}