{
    "title": "8tracks playlist radio",
    "summary": "8tracks playlist radio - Free music app",
    "icon": "//lh3.ggpht.com/LJ5Ow6NQnaEh0lQASlj1893Qz6D1u1JbVXcUDLD5VqLXeVn2OkIvxZJGsoF4BRM56NX2=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.2,
    "reviews": 73774,
    "developer": "8tracks",
    "developerId": "8tracks",
    "developerEmail": "support@8tracks.com",
    "developerWebsite": "http://8tracks.com",
    "updated": "November 22, 2016",
    "version": "3.3.8",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "8tracks is the best playlist radio app for people who care about music to make & discover refreshingly human playlists.Want a music player to help you listen to a playlist for a study, workout, yoga, or dating session? Looking for free music to stream like radio? 8tracks is the top music app to discover independent hip hop, EDM, indie rock, dubstep, jazz and many more genres. Choose from nearly 2 million free playlists, each lovingly handcrafted by a real-life human being who listens to music as much as you. Enjoy millions of free songs curated by people around the world. What’s different:- Free radio app- Audio ad free, pure uninterrupted streaming radio unlike Pandora- Music community sharing and discovering new indie songs - Creative playlists with a “soul” behind the music- Music discovery for every imaginable genre, mood, or activity worldwide- Less repetition- YouTube integrationJoin 8tracks’ global community of 8 million monthly listeners and DJs. Stream for free today.New in 3.3:✓ Mama got a new look, trying to get our sexy on with a slightly new look✓ Told some bugs to get lost and never show their sorry faces in this town againNew in 3.2:✓ Slightly updated material design, slightly sexier app✓ Now displaying artist info so you can learn more about the people behind the music you love✓ Favorite tracks from your notification screen so you don’t even have to go back into the app to show some love✓ Onboarding screens where we lovingly teach you how to lovingly use the app that loves you back✓ Told some bugs to get lost and never show their sorry faces in this town againNew in 3.1:✓ We added Chromecast support, so now you can beam 8tracks playlists to your TV Starship Enterprise-style.✓ Those bugs that were giving you trouble? We told ‘em to scram!✓ You can once again sort by trending, newest, and popular. We’re giving the power back to the people.New in 3.0: ✓ Momma’s beautiful new look ain't nothing to shy away from✓ Animated playlist covers like we’re in Harry Potter or something ✓ 8tracks Timeline: review playlists you’ve heard and upcoming playlists, travel through time and space ✓ New Home screen: automatically shows what you listen to most ✓ Sleep timer: go to sleep whenever the heck you want without leaving the app running ✓ Tumblr sharing, in addition to Facebook, Twitter, text, email, link, Tinder (just kidding…maybe) ✓ Performance improvements and bugs swatted ✓ Sidebar access to your playlist collections",
    "descriptionHTML": "8tracks is the best playlist radio app for people who care about music to make &amp; discover refreshingly human playlists.<br><br>Want a music player to help you listen to a playlist for a study, workout, yoga, or dating session? Looking for free music to stream like radio? 8tracks is the top music app to discover independent hip hop, EDM, indie rock, dubstep, jazz and many more genres. Choose from nearly 2 million free playlists, each lovingly handcrafted by a real-life human being who listens to music as much as you. Enjoy millions of free songs curated by people around the world. <br><br>What&#x2019;s different:<br><br>- Free radio app<br>- Audio ad free, pure uninterrupted streaming radio unlike Pandora<br>- Music community sharing and discovering new indie songs <br>- Creative playlists with a &#x201C;soul&#x201D; behind the music<br>- Music discovery for every imaginable genre, mood, or activity worldwide<br>- Less repetition<br>- YouTube integration<br><br>Join 8tracks&#x2019; global community of 8 million monthly listeners and DJs. Stream for free today.<br><br><br><br>New in 3.3:<br>&#x2713; Mama got a new look, trying to get our sexy on with a slightly new look<br>&#x2713; Told some bugs to get lost and never show their sorry faces in this town again<br><br>New in 3.2:<br>&#x2713; Slightly updated material design, slightly sexier app<br>&#x2713; Now displaying artist info so you can learn more about the people behind the music you love<br>&#x2713; Favorite tracks from your notification screen so you don&#x2019;t even have to go back into the app to show some love<br>&#x2713; Onboarding screens where we lovingly teach you how to lovingly use the app that loves you back<br>&#x2713; Told some bugs to get lost and never show their sorry faces in this town again<br><br>New in 3.1:<br>&#x2713; We added Chromecast support, so now you can beam 8tracks playlists to your TV Starship Enterprise-style.<br>&#x2713; Those bugs that were giving you trouble? We told &#x2018;em to scram!<br>&#x2713; You can once again sort by trending, newest, and popular. We&#x2019;re giving the power back to the people.<br><br>New in 3.0: <br>&#x2713; Momma&#x2019;s beautiful new look ain&apos;t nothing to shy away from<br>&#x2713; Animated playlist covers like we&#x2019;re in Harry Potter or something <br>&#x2713; 8tracks Timeline: review playlists you&#x2019;ve heard and upcoming playlists, travel through time and space <br>&#x2713; New Home screen: automatically shows what you listen to most <br>&#x2713; Sleep timer: go to sleep whenever the heck you want without leaving the app running <br>&#x2713; Tumblr sharing, in addition to Facebook, Twitter, text, email, link, Tinder (just kidding&#x2026;maybe) <br>&#x2713; Performance improvements and bugs swatted <br>&#x2713; Sidebar access to your playlist collections",
    "histogram": {
        "1": 4991,
        "2": 2887,
        "3": 5819,
        "4": 15234,
        "5": 44843
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/PtBQyP6ibeg-CSjXApfoR5PSN4wnwRIIvUB4VcwGlFs5YYBcor_Ijm7zYtj_r65zxg=h310",
        "//lh3.googleusercontent.com/ypMK7BrkKpZf0z2kOPBfuq-iwV7WIC_EPZxyoq6Kp7uZTqga6VIqSV_4HMNEoKfFJlQ=h310",
        "//lh3.googleusercontent.com/49R8JxPUD29c7KhiHZryCUDRIujZW7oH0Nbg1LUU6f30Bes5CnYMBo_qicUHq9J_vA=h310",
        "//lh3.googleusercontent.com/1_bUeyRUEDtiejQfy_8Yy7OcCD3K6dmyLF-sxreFp9G0QRrm0vQcg1WD9l9GgFaTsRnm=h310",
        "//lh3.googleusercontent.com/jh--dWf6RiCzYd4nYdj_mhy6vrCkLLdPQn-b1qiDJ6YlkYCBCLGiEW_-z85HRE9TJQ=h310",
        "//lh3.googleusercontent.com/ZlDzQPZOSTcd2TUJmFaimNZQduoQWsy-VI0f7pQDHu4Z9xfgocoew2hHesi5H82HdJs=h310",
        "//lh5.ggpht.com/Yw7txwUNLjGFsenuBx-fV8KD38lfjqTmKSJk5eWq34trUEUTWCfaXlHJ4lG7okhggQ=h310",
        "//lh4.ggpht.com/8mHIn2wUEcukrPqUVtc6GErQVbGFiLba8OsJL-yd2ERpeaX1baI5M9Gsw84TosRHXmI=h310",
        "//lh3.ggpht.com/UNf8SHkx0tBGLmD2YakC2sdu4LAKd5wlDxTUnK3lUKMufILnH9HRVUzKddrX52AkHL4=h310",
        "//lh3.ggpht.com/qLrY0J4YkySUDLp3sqdgj-tJuwJvqA2QeT9aRqB9B_kPl4QMaSF46Q94KprL5YvaxIo=h310",
        "//lh4.ggpht.com/nxuPSs2ENIrPqwre4pOqX33vdwioeyN0gGx2FH16hDv7wAX_t24J_Qg_mEw97-856kjt=h310",
        "//lh6.ggpht.com/EivcRd7TpyCu3oHX8VUnmw3BEF7uxHubWCKxRIfk8ZgQPBc1EzVN9bWgcDsXB9AeZPM=h310",
        "//lh3.ggpht.com/jlLD7tG9vPzy_a5Ieo5IGcXTgNSKwpXlOF29vnrH3aI_UBk4PKZ8J49_Gfnel5oBpw=h310",
        "//lh6.ggpht.com/fFXeUcmT7tJKkQHFleXPCFMkmwZ5cBgedUIqotgOoq79c7r4J8YJhRWq9_y0x2iXttA=h310",
        "//lh3.googleusercontent.com/70Z5tSNrU-aO6Jlw0eSC335RF3UPVjF1mqhWrw78IoAm24gU-FGWWDMSBzLN6xQK9A=h310",
        "//lh3.googleusercontent.com/YfEtUE8Favfl1g0QrNWW2eGShKt8GnBgrUqnUZto2A4ny4Imjnas8JcO2jBZ0XKcScA=h310",
        "//lh3.googleusercontent.com/iPs1XHYCyf448D9JRjxmJeA_yEL9DuVTIMbkwh3YYkpbqowDYejmrN5ZbKVGhNFhNQ=h310"
    ],
    "comments": [
        "I love 8tracks, but the app isn't so great. I only recently discovered 8tracks, and I love that I can listen to music I can't really listen to on other streaming sites like Pandora and Spotify. However, I feel that the app needs a lot of work. I often can't pause music, or unpause it, without it glitching. Also, there are a lot of limits in the app as compared to the full site. For example, I would like to be able to add play lists to my collection in the app, or search specific users or terms. Overall though, it works well enough, and I'm satisfied.",
        "Used 8tracks for years I have been an avid listener for years, talking it up to people who haven't ever heard of it. I was surprised this morning to find my music was capped to 30 minutes a week unless I upgrade. I was alright with their addition to ads because hey, we all gotta make money. So now I'm switching to another free streaming service.",
        "Is there a limit to how many playlists can go in a collection? I want to clean up my likes, but I tried to put like 75(ish?) In a collection but now it says there's 15 in it. Other than that the app is great! Maybe you can add the \"add to collection option\" next. Its OK if you can't, the app is still good",
        "LOL, isn't 8tracks dead yet? First they banned international users. Then they introduced listening limits. Then they cut those listening limits down like crazy - most people I know only have about 45 mins of listening per week, now.   It's a godd*mn shame, because 8tracks used to be the best streaming service out there, with a vibrant and creative userbase. Now...just go subscribe to Spotify, it's the only playlist service worth having anymore. RIP 8tracks, you got greedy.",
        "Used to love 8tracks. Listen, I get it. Streaming is pretty cashless in the long run. It's understandable, you're a business. But the fact of the matter is, you don't get money out of supporters by reducing what they can do without cash. That is how you drive out a fanbase. I was even considering getting a plus account until you decided to shove limits down our throats...and only an hour of streaming a week? Come on, I did that in a night. I think I'll take my playlists elsewhere.",
        "No more unlimited listening I loved this app, I used it as my primary way of listening to music. But now unless I pay there is only 2 hour a week of listening. There is no way, I use more than that in a day. Especially during finals. I don't want to see 8tracks die, but I'm going to have to get my music somewhere else and I'm guessing a lot of other people will too"
    ],
    "recentChanges": [
        "This is a small update which removes some problematic ads and aims to improve some playback issues in the app. If you are experiencing problems, you can contact us at mobile_support@8tracks.com."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.e8tracks&hl=en&gl=us",
    "appId": "com.e8tracks"
}