{
    "title": "Custom Voice Commands",
    "summary": "Talk to Alexa plus load photos, videos, notes and more from your phone or watch!",
    "icon": "//lh3.googleusercontent.com/5RXdFbbQSrrT57393mzb8axO0aMYABznrACSG5m-RF2YW0GONhGOdwuc8KGhvYkP5VXi=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4,
    "reviews": 1028,
    "developer": "Treycent, Inc.",
    "developerId": "Treycent,+Inc.",
    "developerEmail": "support@treycent.com",
    "developerWebsite": "https://treycent.com",
    "updated": "March 3, 2018",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Custom Voice Commands lets you talk to Alexa plus create custom voice commands to easily place calls, send text messages or emails, load your favorite photos, videos, notes, frequently used websites and apps, plus you can trigger IFTTT events and post to Twitter or Slack. After downloading here are a few things to try saying:• \"good morning\" (Alexa will reply with a greeting)• \"what's the weather today?\" (Alexa will reply with the weather forecast)• \"what's the longest river in Asia\" (Alexa will tell you)• \"add milk to my grocery list\" (add to your grocery list)• \"add go to the grocery store to my to do list\" (add to your todo list)• \"show me the photo of the day\" (a photo slideshow will display)• \"show me the latest news\" (a list of recent news articles will appear)• \"play pop music\" (a pop music playlist will play)• \"enable the Supplement Advisor\" (Alexa will enable the Skill - there are thousands of Skills)• \"ask the Supplement Advisor what supplements are good for energy\" (the Supplement Advisor will reply with the answer)Also create custom voice commands like:• \"call the boss\" (to call your boss)• \"text my baby\" (to text your significant other)• \"show me recent selfies\" (to see a selfie slideshow)• \"what's my locker combination\" • \"show me mom's meatloaf recipe\" • \"open the project XYZ report\" (to view your document on OneDrive, Google Drive, Dropbox, Box, etc.)• \"play my pop music playlist\" (to play your favorite pop music playlist from YouTube, SoundCloud, etc.)• \"show me photos from my baby\" (to see private photos)• \"good morning team post to General Channel\" (to post a greeting to your Slack Channel)• \"computer I am arriving home\" (to trigger 3 IFTTT event linked to that voice command to  turn on lights in your home, set your thermostat temperature, and send a text message - there are hundreds of apps connected with IFTTT) Here are some of Treycent's features:• load photos, videos, notes and websites by voice command• place phone calls, send text message or emails by voice• create voice commands to load your favorite YouTube videos or playlists• load your favorite SoundCloud or 8tracks music playlists by voice• ask questions to the Alexa virtual assistant and invoke Alexa Skills• control your apps and devices by voice command (via IFTTT)• post messages to Twitter or Slack by voice from your phone or watch• view photos and notes by voice command from your smartwatch• share voice commands with friends or co-workersDownload now and let Custom Voice Commands be your truly Personal Virtual Assistant!",
    "descriptionHTML": "Custom Voice Commands lets you talk to Alexa plus create custom voice commands to easily place calls, send text messages or emails, load your favorite photos, videos, notes, frequently used websites and apps, plus you can trigger IFTTT events and post to Twitter or Slack. After downloading here are a few things to try saying:<br><br>&#x2022; &quot;good morning&quot; (Alexa will reply with a greeting)<br><br>&#x2022; &quot;what&apos;s the weather today?&quot; (Alexa will reply with the weather forecast)<br><br>&#x2022; &quot;what&apos;s the longest river in Asia&quot; (Alexa will tell you)<br><br>&#x2022; &quot;add milk to my grocery list&quot; (add to your grocery list)<br><br>&#x2022; &quot;add go to the grocery store to my to do list&quot; (add to your todo list)<br><br>&#x2022; &quot;show me the photo of the day&quot; (a photo slideshow will display)<br><br>&#x2022; &quot;show me the latest news&quot; (a list of recent news articles will appear)<br><br>&#x2022; &quot;play pop music&quot; (a pop music playlist will play)<br><br>&#x2022; &quot;enable the Supplement Advisor&quot; (Alexa will enable the Skill - there are thousands of Skills)<br><br>&#x2022; &quot;ask the Supplement Advisor what supplements are good for energy&quot; (the Supplement Advisor will reply with the answer)<br><br><br>Also create custom voice commands like:<br><br>&#x2022; &quot;call the boss&quot; (to call your boss)<br><br>&#x2022; &quot;text my baby&quot; (to text your significant other)<br><br>&#x2022; &quot;show me recent selfies&quot; (to see a selfie slideshow)<br><br>&#x2022; &quot;what&apos;s my locker combination&quot; <br><br>&#x2022; &quot;show me mom&apos;s meatloaf recipe&quot; <br><br>&#x2022; &quot;open the project XYZ report&quot; (to view your document on OneDrive, Google Drive, Dropbox, Box, etc.)<br><br>&#x2022; &quot;play my pop music playlist&quot; (to play your favorite pop music playlist from YouTube, SoundCloud, etc.)<br><br>&#x2022; &quot;show me photos from my baby&quot; (to see private photos)<br><br>&#x2022; &quot;good morning team post to General Channel&quot; (to post a greeting to your Slack Channel)<br><br>&#x2022; &quot;computer I am arriving home&quot; (to trigger 3 IFTTT event linked to that voice command to  turn on lights in your home, set your thermostat temperature, and send a text message - there are hundreds of apps connected with IFTTT)<br><br><br> Here are some of Treycent&apos;s features:<br><br>&#x2022; load photos, videos, notes and websites by voice command<br><br>&#x2022; place phone calls, send text message or emails by voice<br><br>&#x2022; create voice commands to load your favorite YouTube videos or playlists<br><br>&#x2022; load your favorite SoundCloud or 8tracks music playlists by voice<br><br>&#x2022; ask questions to the Alexa virtual assistant and invoke Alexa Skills<br><br>&#x2022; control your apps and devices by voice command (via IFTTT)<br><br>&#x2022; post messages to Twitter or Slack by voice from your phone or watch<br><br>&#x2022; view photos and notes by voice command from your smartwatch<br><br>&#x2022; share voice commands with friends or co-workers<br><br><br><br>Download now and let Custom Voice Commands be your truly Personal Virtual Assistant!",
    "histogram": {
        "1": 170,
        "2": 33,
        "3": 66,
        "4": 93,
        "5": 666
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/i_TZDsg6P17JJkZ-7bcoBeRbefeg-MX_bzPXTVJ_UnkuyfnQ38CH7UBuKevVmVcJ5fY=h310",
        "//lh3.googleusercontent.com/WAcdBd9Ak7EN4ywfD_rasUmyFowKeTno6RFVBDR6HisVR6nfYpBm9eJkad20309JHixx=h310",
        "//lh3.googleusercontent.com/Zw2QsgERqhkTB3cxUIH8fkHNgiqGwVS2S9WfHF99OoZQ8107JM33wE2yKquEyFbjPgoe=h310",
        "//lh3.googleusercontent.com/Oq7lN0kF7FaQswE1Lzx3wODl6e-PZFSW0htwSuGN50qyJdrxSAHPvY_b7CU2d5LUkXM=h310",
        "//lh3.googleusercontent.com/IKEMak1oX-ukJa9YxhRNfnmxemGzJN6p9blfyO-IwleEStZ1ZEgpbTbQN3-WGExBDAA=h310",
        "//lh3.googleusercontent.com/i6Je6-P_3jsG53v_WM4Udya4JghSeSOMOw6gtf0gcaXmDQLQgKg0ay5FzS9i4gX4=h310",
        "//lh3.googleusercontent.com/6wLaRdBkhua9SjcplVlP8QnQKnPTeFJRwDDNdsOpozm2gkQnof1oZtH7K-nnplvpPQ=h310",
        "//lh3.googleusercontent.com/qlz-CyzkcOVYS7pFbs4ThNz9Koz2pGQsHNHhFN1I9Kw7nAOT8wXZ5roEPQx7Fy_N=h310",
        "//lh3.googleusercontent.com/q_Eo9k0zfqsUOTYqa-t90c1ggWb-4VyAPFZVp7t4Xj7IynceV505pyWryyuURk9fZHHn=h310"
    ],
    "video": "https://www.youtube.com/embed/qLoqf0l7vJo",
    "comments": [
        "This app is amazing. Custom voice commands are a pinch to make and you can make them do almost anything on your phone. I definitely recommend this app",
        "The voice command is very accurate with far range sounds",
        "Not sined",
        "Its a great app that manages our  watch and smart phones. Using this we can do various things like call , text, viewing emails and so on... All in one feature makes it the greatest app in the play store... I just loved it.",
        "I was looking for a voice command app for my Android Wear24 smartwatch so I tried this. Well, don't bother. Every command, including the basic ones, just give an error msg saying \"Error: No answer from server\". Too bad.",
        "I LIKE This app because It is easy to use and Retriving my Photos,message.It's very useful to create my favourite short command."
    ],
    "recentChanges": [
        "Improvements to Alexa and smartwatch features"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.treycent.wearapp&hl=en&gl=us",
    "appId": "com.treycent.wearapp"
}