{
    "title": "OverDrive",
    "summary": "Borrow eBooks, audiobooks, &amp; streaming video from your library using OverDrive.",
    "icon": "//lh3.googleusercontent.com/dr_qIHpWj4Xv0wON0eKPDZQ1HlrANqXpzrHVVKguSSkQ74jbgNVQIlH5lrZZgJP9iOA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 149233,
    "developer": "OverDrive, Inc.",
    "developerId": "OverDrive,+Inc.",
    "developerEmail": "androidcontact@overdrive.com",
    "developerWebsite": "http://app.overdrive.com",
    "updated": "October 5, 2017",
    "version": "3.7.2",
    "genre": "Books & Reference",
    "genreId": "BOOKS_AND_REFERENCE",
    "description": "Borrow eBooks, audiobooks, and streaming video from your library using OverDrive on your Android device. More than 30,000 libraries worldwide offer titles from OverDrive, so download the app and find your next book today!•\tAvailable 24/7, now the library comes to you.•\tNo more late fees. Titles are automatically returned.•\tPlace holds, create wish lists, and return titles easily.•\tSync libraries, bookmarks, and recent positions across mobile devices. •\tA valid account with a participating library, school, or other institution is required.•\tEach library builds its own collection of titles. Contact them directly to let them know that you’re using OverDrive and to share any suggestions for books you would like to see them carry.",
    "descriptionHTML": "Borrow eBooks, audiobooks, and streaming video from your library using OverDrive on your Android device. More than 30,000 libraries worldwide offer titles from OverDrive, so download the app and find your next book today!<br><br>&#x2022;\tAvailable 24/7, now the library comes to you.<br>&#x2022;\tNo more late fees. Titles are automatically returned.<br>&#x2022;\tPlace holds, create wish lists, and return titles easily.<br>&#x2022;\tSync libraries, bookmarks, and recent positions across mobile devices. <br>&#x2022;\tA valid account with a participating library, school, or other institution is required.<br>&#x2022;\tEach library builds its own collection of titles. Contact them directly to let them know that you&#x2019;re using OverDrive and to share any suggestions for books you would like to see them carry.",
    "histogram": {
        "1": 4253,
        "2": 2630,
        "3": 5992,
        "4": 32332,
        "5": 104026
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/f3jv3n1GdVME4XRU8UgEhZ79RGGMDoYFcfRZYGK6P4-6Bg6bwLbDWJEW98ICpKmUbTP7=h310",
        "//lh3.googleusercontent.com/lErwmD5bdnY5nZa1jO8S7sCJ7UhV0oI-3GsGUhK-3yQCVW5bnxC-8fXvpugZzd4Azbs-=h310",
        "//lh3.googleusercontent.com/2AF0lshK0mgISsqroeiskTx23XrvlHNHF7WtNXcQWrO8SbYcRxNgOYXx3d-CYIC4Ew=h310",
        "//lh3.googleusercontent.com/cJlfHqe1zvJh06mURUd_jDP4o71JaMhbKdQYEJtjyEm20fUMvYFCiGwec0hfTdYdhA=h310",
        "//lh3.googleusercontent.com/VuS7OOEUj7euAbe1XPKkKEXp2ZRxJ74dk0j3TF22ANHlHhqO-7rE0sPgmeacGCDzegI=h310",
        "//lh3.googleusercontent.com/SfMmE0tJK_8vCG_yASJQtletv2M0bgNBO4YFIhqRI5bEgWf1qXXgb5FewVO94J6Si7s=h310",
        "//lh3.googleusercontent.com/VufKtkWw41NEyqPXrsaTaIDGconOz4YrQkUlPk6d4a2y5WVmzgsEq_ruGqDZEWi_cw=h310",
        "//lh3.googleusercontent.com/08bvNt5KmeP9LyJ2qI_-SENQlNyaG7vUk0LTSP4kLaNsiHLt12OnptgWtA7-B63Bo8s=h310",
        "//lh3.googleusercontent.com/7nUfeVXMYhS3kOquVwdkeKiHTrYvtsbmw8kKu7QZyDGGubvWT1DuiqIpM2km7tAnUA=h310",
        "//lh3.googleusercontent.com/e_Th-NGiPqC-CT2F2YO6QFlcilKcChRfskDlSiqVUJADrrITY28Ye387l26SSOmA2Hw=h310",
        "//lh3.googleusercontent.com/kr3RgD0zFEV_FULm68yTdGZ7lf6_A7ubV-eNPimf389jeEetzsmB8RB3uehbRqiGTg=h310",
        "//lh3.googleusercontent.com/qd2uRuygJQmaFTaVRM_YDQu1EkSKo-ChXxCnuTpMaY9h3uZ9aJRhWKj16nSHoaSGykE=h310",
        "//lh3.googleusercontent.com/9pjPQszHIY6QFZSGqI6R3tuzHi9p3EJWOwxDMpZwx2ZNNc9NElhqrVpSJhJp18GMf3I=h310",
        "//lh3.googleusercontent.com/aBVxAPvqpW1ybt275iigUsioXL30Kysmp8-XxbNEk5dOuME4dDHfM3lmWV4bz-Yc4Es=h310",
        "//lh3.googleusercontent.com/cONIePlVa-EIUXpistXkm5QWodH1q5W_twtjMkFgaW59q6RtZ8lN00Rv56yW2xIlEVGE=h310",
        "//lh3.googleusercontent.com/KU52sJZFrgFwxIFjqVgyWC0zcQrLXkxlmos69AuF3urApJmH_zXZQczWyXbUmq0ZR0pN=h310",
        "//lh3.googleusercontent.com/8W8xn3_GFqeu8WhOcfdseht5mFSc8EtHbb92v5lGufNSurtN324v7Ym--0Bq-xyA-pQ=h310",
        "//lh3.googleusercontent.com/5XmDLaZ_ZtF6AlnWo7s97CPJas3puOLB53jX-tzWo1a1wuFD6ZQIV4P-0jY2TssU9QU=h310",
        "//lh3.googleusercontent.com/xz6F72RJetknxRAEksFuzITSw9Q8wELb4NTqrhaypi_QRODO8R0XtJwaWEy9zrv3BPKu=h310",
        "//lh3.googleusercontent.com/xePr26L97uc_glkLGlg7kg2BvdhowMQp4SchPimttzYm1F94ww3FBaRRhSPppKTyJ1QY=h310",
        "//lh3.googleusercontent.com/cr8LJbpog00ijpPOF49BC4EjdoTO7tqP_FwCKhdH9cMZli8xDgwfIkJIPu53nzp1nY0=h310",
        "//lh3.googleusercontent.com/pzNlOFCjULCmJkXC5f8TY9YWt4T_eN_mLilqr98SnR2yVqrxuibQ6bc0mDlCqOD7O2Y=h310",
        "//lh3.googleusercontent.com/EIW8T8r77kJm3BETZjfUleGupkssg9tIJzbS2UXMsMEidgKSfcrT36uMs3jwM2v4RLc=h310",
        "//lh3.googleusercontent.com/hiYDKAj0iMiO5SBu04Z_cRWXFmgcKsMotAM3Tl0EGdXqX8ns3AbL12LQvzLmaZ-SsY0=h310"
    ],
    "video": "https://www.youtube.com/embed/M2dLIlmKmr0",
    "comments": [
        "I don't take the time to review apps often, only if one is particularly bad or good and this one falls on the good side of the spectrum. Overdrive makes it really easy to browse and check out library books even if you're busy or on the go. Highly recommend. If you have any trouble syncing books across devices make sure you have logged in the same way on both devices (overdrive account vs library card info)",
        "The latest version works great.  I have not noticed any issues! I could suggest the following. The history only shows 20 books and that list doesn't carry over when you replace your phone.  The cloud account could be better.  I would like the cloud to store and suggest.  The ability to add notes.    I have been using OverDrive for years every day.  It is easy to check out books from the library.  You will need to download an Adobe reader to read books, but after it is set up it is easy to use.",
        "The app is great and works great, except for one issue and there's no information on how to fix it. The books that aren't at my library can be recommended for the library to purchase. However the process doesn't work for me. It opens the page to recommend and the email/hold notification option is given but once I select to either recommend or cancel, and I hit recommend, it doesn't go through and send the recommendation. I even went to the browser site and tried with the same results. I need to know why this isn't working and how it can be fixed. I Would give overdrive 5 stars if not for this VERY frustrating issue. Help?",
        "I use this app daily. They have a wide selection of books,both written and audio. The system works well, and does not crash. I read 3-5 books  a week for entertainment and it is very handy to be able to check out a book any time day or night. I can read books on my phone or tablet, listen to audio books at home or in the car. I can adjust the brightness and size of the print so reading is comfortable. It is easy to carry several books at a time, you can set your checkout periods, and I don't have to worry about misplacing books or have them overdue",
        "I've tried about 90% of the ereaders and this is the best for what I need.  What I needed is the ability to sync across platforms (tablet and phone), ability to borrow books from the local library, and the ability to read open ePub books. This does it all.  I do tend to download the Kindle formats (if available) as Kindle is a better ereader. The built in reader could be better at reproducing the publishers format. Some ePub books don't always render correctly, especially older books.",
        "Generally excellent with one or two quirks. The player is well designed and works great for selecting and playing library audio books. Two details: the pause button doesn't work on the lock screen. I have to log into my phone to pause. Also, audio players should have a selection so that I can choose if it should come on automatically when I start my car."
    ],
    "recentChanges": [
        "v3.7.2",
        "Updated streaming video player.",
        "v3.7.1",
        "Resolves an issue where users couldn't sign in using OverDrive accounts on Android 5.0.1.",
        "Fixes bugs related to opening titles using widgets and the now playing notification.",
        "v3.7.0",
        "Audiobook position syncing improvements.",
        "The app now shows an indication on the bookshelf if all of the parts of a book aren't downloaded.",
        "Support for Android O."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.overdrive.mobile.android.mediaconsole&hl=en&gl=us",
    "appId": "com.overdrive.mobile.android.mediaconsole"
}