{
    "title": "Duolingo: Learn Languages Free",
    "summary": "Learn English, Spanish, French, German, Italian and more languages for free.",
    "icon": "//lh3.googleusercontent.com/Yfps1k5jfeCC6j3ahm1s6dyUrSHusfk_1WDSTRjSNpZA49iYSKd_uljgs9UScBXgISOX=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.7,
    "reviews": 5712982,
    "developer": "Duolingo",
    "developerId": "6957685454452609502",
    "developerEmail": "android@duolingo.com",
    "developerWebsite": "https://www.duolingo.com/",
    "developerAddress": "Duolingo\n5900 Penn Avenue\nPittsburgh PA 15206",
    "updated": "February 19, 2018",
    "version": "Varies with device",
    "genre": "Education",
    "genreId": "EDUCATION",
    "familyGenre": "Education",
    "familyGenreId": "FAMILY_EDUCATION",
    "size": "Varies with device",
    "description": "Learn Spanish, French, German, Italian, Russian, Portuguese, Turkish, Dutch, Irish, Danish, Swedish, Ukrainian, Esperanto, Polish, Greek, Hungarian, Norwegian, Hebrew, Welsh and English. Totally fun and free. New! Swahili and Romanian.  Practice your speaking, reading, listening and writing skills while playing a game! You'll improve your vocabulary and grammar skills by answering questions and completing lessons. Start with basic verbs, phrases, and sentences, and learn new words daily.• Google Play's Editor's Choice and \"Best of the Best\" of 2013 and 2014!• \"Far and away the best language-learning app.\" —The Wall Street Journal• \"Duolingo may hold the secret to the future of education.\" —TIME Magazine• \"Among apps for learning a language, you can't beat Duolingo.\" —PC Magazine.• \"The most productive means of procrastination ever discovered. The short lesson blocks are painless and peppy, and reaching the next level (and then the level after that) becomes addictive.\" —SlateDuolingo is changing the way people learn languages.• It's free, for real.• It's fun. Advance by completing bite-sized lessons, and track your progress with shiny achievements.• It's effective. 34 hours of Duolingo are equivalent to a semester of university-level education.Send any feedback to android@duolingo.comBuy Duolingo gear at https://gear.duolingo.comFacebook: https://www.facebook.com/duolingoTwitter: https://twitter.com/duolingoGoogle+: https://plus.google.com/+duolingoUse Duolingo on the Web at https://www.duolingo.com",
    "descriptionHTML": "Learn Spanish, French, German, Italian, Russian, Portuguese, Turkish, Dutch, Irish, Danish, Swedish, Ukrainian, Esperanto, Polish, Greek, Hungarian, Norwegian, Hebrew, Welsh and English. <br><br>Totally fun and free. New! Swahili and Romanian.  <br><br>Practice your speaking, reading, listening and writing skills while playing a game! You&apos;ll improve your vocabulary and grammar skills by answering questions and completing lessons. Start with basic verbs, phrases, and sentences, and learn new words daily.<br><br>&#x2022; Google Play&apos;s Editor&apos;s Choice and &quot;Best of the Best&quot; of 2013 and 2014!<br><br>&#x2022; &quot;Far and away the best language-learning app.&quot; &#x2014;The Wall Street Journal<br><br>&#x2022; &quot;Duolingo may hold the secret to the future of education.&quot; &#x2014;TIME Magazine<br><br>&#x2022; &quot;Among apps for learning a language, you can&apos;t beat Duolingo.&quot; &#x2014;PC Magazine.<br><br>&#x2022; &quot;The most productive means of procrastination ever discovered. The short lesson blocks are painless and peppy, and reaching the next level (and then the level after that) becomes addictive.&quot; &#x2014;Slate<br><br><br>Duolingo is changing the way people learn languages.<br><br>&#x2022; It&apos;s free, for real.<br><br>&#x2022; It&apos;s fun. Advance by completing bite-sized lessons, and track your progress with shiny achievements.<br><br>&#x2022; It&apos;s effective. 34 hours of Duolingo are equivalent to a semester of university-level education.<br><br><br>Send any feedback to android@duolingo.com<br><br>Buy Duolingo gear at https://gear.duolingo.com<br><br>Facebook: https://www.facebook.com/duolingo<br><br>Twitter: https://twitter.com/duolingo<br><br>Google+: https://plus.google.com/+duolingo<br><br>Use Duolingo on the Web at https://www.duolingo.com",
    "histogram": {
        "1": 69426,
        "2": 41371,
        "3": 146662,
        "4": 946667,
        "5": 4508856
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/7B6YdPz8jECLb_C8dS1obZzAOMDQ6zGDa2aOdkNz-K5B0FIuGdYuI8nL2nt1KtVqfg=h310",
        "//lh3.googleusercontent.com/foqOORRIJfECw5zdpJ19v3OH564bDXk6ALT8SbBcQySpKQFct0mGeLjB2NSya8MW-A=h310",
        "//lh3.googleusercontent.com/VCGAuacaEBtbzuVzGCekj9kTvmCXHcir1c28-_qV7sH7SCS_6kOAKooV2uEOYhXSOA=h310",
        "//lh3.googleusercontent.com/Thr3aJHrB4JpfGAbxTc73F8h3OKEGdprMsvNLBQZWv8icE7rIzSsmOapVaNBMiYb3To=h310",
        "//lh3.googleusercontent.com/RGecU-w8DRocI9HvfcHvItl00hy45LJoIOClmKTzhj3d3HQTQ02QcnVi8ee_3RopSA=h310",
        "//lh3.googleusercontent.com/RcbQvpG0B6EsR8DeMOUBhdpjMf0sKsEL0M71Lrw7RZtrTvtWPov3HKHaRjcb9HL8WUHZ=h310",
        "//lh3.googleusercontent.com/RtEN7t7cImlTcQWkgH9mbHBDOwuQzzYG4zMuVwgqXPwvNWPBZhahh6aZxef7vU-juw=h310",
        "//lh3.googleusercontent.com/XQFzOsUkvhnN5VP9MvixB2AXIGWKN7MoXFaz4FTSSh5gi44Pv7kKV_Zjs8PGCV0-3A=h310",
        "//lh3.googleusercontent.com/zMFQbDEWj8WSsCpyMJB5eWD47-xqv6Mw7rrMdOLCdgccdusZFM07T0hvPJ6REC0uAg=h310",
        "//lh3.googleusercontent.com/1WQ19ihzmfTq1wazehS5yGBjbESbHHF7JKJAO3eI_O_s2rRoVLWCbAwtprmDONEA51U=h310",
        "//lh3.googleusercontent.com/F8_t-KpbJI0out_E9CMVonjyBnSwfFdEF5FKLpN06zxwJ7FmlXCgz6pSphD5X1jLU8I=h310",
        "//lh3.googleusercontent.com/_TanJHqsg95PZftU5k3S46b_ThKgeV71cQO2YybqN_D2k9EF4ph13V3Zba--lpkOV9FH=h310",
        "//lh3.googleusercontent.com/UJQjpgDFDJnhGI5M8b2nAOpavQ79ik_3pcCA2MzdKsqu75KShKpyYhFGYmS4vbfPAA=h310",
        "//lh3.googleusercontent.com/gW6ezxUN-rRZw4gyvg6pkIGu53BPc9yL792Ler-E4qu3KleM5mXodEK9VJA5R2XF3Q=h310",
        "//lh3.googleusercontent.com/AEqip-bcD0eNXRMv_Nc1EOcL127eGLAQAF5l0cq4jrkj0BJ2VYehtL-V1FHfVCheh-Cd=h310"
    ],
    "video": "https://www.youtube.com/embed/qu0ALDUBgjw",
    "comments": [
        "It's a great app it's working... Keeps freezing up on the third question on my HTC u11. Hope it gets sorted soon as I paid for plus and don't actually get to use it, seems that since I paid this hasn't worked at all. Have tried multiple times to sort this out even uninstalling wich brought back the adds I paid to be rid of. Wich kinda sucks.",
        "This app is great for those who need a boost to an already existing class. It doesn't outright teach grammar or sentence structure, but you can learn it through practice. Even so, there are no written resources for someone to use and learn without other sources. In short, it's the perfect assistant for classes and reminding you of a language youre forgetting, but it's not so great for learning outright (though its great for learning basics before starting a class).",
        "Excellent app that is helping me to move forward with Chinese. Dropped one star for points that may be down to the early stage of application development for this language. For example, on going beyond the basic level, Duo gets somewhat confounded by the subtleties of translation. (As may the student also.) User reports should produce a steady improvement. Strong on establishing the basics, maybe less so for higher skills, where supplementary methods may be needed.",
        "I once learned German years ago and son after I forgot it all, but now with this app I have picked it up again. It's very intuitive and it progressed through from very basic words gradually adding more words and tenses. It really is a great app for anyone wanting to casually learn another language. The app doesn't teach you the principles behind the words, only the words. Recommended!!",
        "I have used Duolingo on my Moto X Pure Edition for over a year and have had an amazing time learning languages. Due to a recent update, however, I am now unable to load refresher lessons even though regular lessons load perfectly.   I sent a message to Duolingo customer service 3 days ago and have yet to receive at least a response saying the programming team is working on a fix. I love this app and will continue to support it by return this to a 5 star review when functionality is restored.",
        "Decent overall. Occasional bugs or sketchy translations, nothing major. I'm learning Japanese, and if you're doing the same, I recommend at least some basic knowledge (e.g. Hiragana and Katakana) before you begin; if you don't have the basics down first, it will be extremely difficult for you. The streak system is a great way to make sure you study every day. Not recommended as a sole source of learning a language, but definitely recommended for practice."
    ],
    "recentChanges": [
        "- Show streak in home",
        "- Show fluency score in home",
        "- Challenge correct streak animation and bonus XP",
        "- We're hiring an Android developer: duolingo.com/jobs"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.duolingo&hl=en&gl=us",
    "appId": "com.duolingo"
}