{
    "title": "Ingresse - Ingressos e Eventos",
    "summary": "Discover and buy tickets for the best events in your city!",
    "icon": "//lh4.ggpht.com/BsVQcStNWvj23j84Jgwbmaf9DGUCLSyaO4k8XPvk-DAeUpczoD9o2jUbTnxUk9a8BeM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4,
    "reviews": 2067,
    "developer": "Ingresse",
    "developerId": "8118493981175505689",
    "developerEmail": "contato@ingresse.com",
    "developerWebsite": "http://www.ingresse.com",
    "updated": "February 19, 2018",
    "version": "2.25.4",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "description": "No aplicativo Ingresse você pode descobrir e comprar ingressos para os melhores eventos da sua cidade! Ingressos online para festas, baladas, bloquinhos de carnaval 2017, blocos de rua 2017, camarotes de carnaval 2017, festas universitárias, shows e teatros estão aqui. No aplicativo da Ingresse, além de comprar ingressos online para os eventos da sua cidade e ver tudo o que está está acontecendo, você tem acesso a todas as funcionalidades do site, mas de uma maneira ainda mais prática e rápida. Você pode encontrar os eventos disponíveis separados por estados e categorias; confirmar sua presença e ver quem mais irá ao evento; conferir todos seus detalhes tais como preço, data, local e etc. Confira como melhor usar seu aplicativo.------------------------------------------------►COMPRA DE INGRESSOSComprar ingressos pelo aplicativo é tão fácil quanto no site. Os eventos estão divididos por região e estilo como festas e baladas, festas universitárias, teatro e cultura e, shows e festivais. Ao escolher seu evento e a forma de pagamento, seu ingresso ficará armazenado na carteira de ingressos.------------------------------------------------►CARTEIRA DE INGRESSOSCom esta carteira, os ingressos que você adquirir via celular ou site, ficarão armazenados para que, na hora de utilizá-los, você não precisa estar conectado à internet, sem complicações e sem hora pra usar os seus ingressos. ------------------------------------------------►INTERAÇÃO SOCIALO aplicativo possui a função Lista Ingresse, na qual você confirma presença em um evento, e vê outras pessoas que fizeram o mesmo. Você também pode, de forma muito simples, divulgar um evento para seus amigos, compartilhando o link com redes sociais como Facebook, Twitter e Whatsapp.------------------------------------------------►BUSCA DE EVENTOS COM REGIONALIZAÇÃO AUTOMÁTICAO app também é capaz de detectar sua localização através de um GPS. Assim, quando você estiver na rua e não souber ao certo onde ir, ele pode indicar os eventos que estão acontecendo próximos de você, facilitando ainda mais o processo de compra de ingressos online.------------------------------------------------►DETALHES DO EVENTOAlém de saber quais baladas, festas universitárias, blocos de rua 2017, bloquinhos de Carnaval 2017, shows, festivais, e eventos de teatro e cultura estão próximos de você, o aplicativo também mostra como chegar lá através do mapa do próprio celular.------------------------------------------------►EVENTOS O ANO TODODescubra os principais eventos de em São Paulo, Rio de Janeiro, Goiânia, Manaus, Brasília e no resto do Brasil. Durante todo o ano e no Carnaval 2017 estão disponíveis ingressos para eventos e festivais como festas universitárias, baladas, cervejadas, blocos de rua, shows sem hora para acabar.------------------------------------------------►EVENTOS DE DESTAQUECompre seu ticket para os principais eventos do Carnaval 2017!Em São Paulo grandes labels como Vale Night, Gandaia, Carnavália, Baile do Zé Ruela e Pediu pra Sambar Sambô prometem agitar o pré Carnaval paulistano!Pra quem curte exposições evite filas na bilheteria do eventos, compre ingressos antecipadamente para a exposição do Gaudí e do Lego. Em festas universitárias você encontra eventos das melhores faculdades como FGV, USP, FAAP, ESPM, PUC e MACKENZIE.Além dos bloquinhos de rua 2017, no RJ os destaques vão para as festas de Carnaval 2017 como Esbórnia, Sambinha, Music Motion, Rio Sunset, To Muerto e muito mais!",
    "descriptionHTML": "No aplicativo <b>Ingresse</b> voc&#xEA; pode descobrir e <b>comprar ingressos</b> para os melhores eventos da sua cidade! Ingressos online para <b>festas, baladas, bloquinhos de carnaval 2017, blocos de rua 2017, camarotes de carnaval 2017, festas universit&#xE1;rias, shows e teatros</b> est&#xE3;o aqui. No aplicativo da Ingresse, al&#xE9;m de comprar ingressos online para os eventos da sua cidade e ver tudo o que est&#xE1; est&#xE1; acontecendo, voc&#xEA; tem acesso a todas as funcionalidades do site, mas de uma maneira ainda mais <b>pr&#xE1;tica e r&#xE1;pida</b>. Voc&#xEA; pode encontrar os eventos dispon&#xED;veis separados por estados e categorias; confirmar sua presen&#xE7;a e ver quem mais ir&#xE1; ao evento; conferir todos seus detalhes tais como pre&#xE7;o, data, local e etc. <b>Confira como melhor usar seu aplicativo</b>.<br>------------------------------------------------<br>&#x25BA;<b>COMPRA DE INGRESSOS</b><br>Comprar <b>ingressos</b> pelo aplicativo &#xE9; t&#xE3;o f&#xE1;cil quanto no site. Os eventos est&#xE3;o divididos por <b>regi&#xE3;o</b> e estilo como <b>festas e baladas, festas universit&#xE1;rias, teatro e cultura e, shows e festivais</b>. Ao escolher seu evento e a forma de pagamento, seu ingresso ficar&#xE1; armazenado na carteira de ingressos.<br>------------------------------------------------<br>&#x25BA;<b>CARTEIRA DE INGRESSOS</b><br>Com esta carteira, os <b>ingressos</b> que voc&#xEA; adquirir via celular ou site, ficar&#xE3;o <b>armazenados</b> para que, na hora de utiliz&#xE1;-los, voc&#xEA; <b>n&#xE3;o precisa estar conectado &#xE0; internet</b>, sem complica&#xE7;&#xF5;es e sem hora pra usar os seus ingressos. <br>------------------------------------------------<br>&#x25BA;<b>INTERA&#xC7;&#xC3;O SOCIAL</b><br>O aplicativo possui a fun&#xE7;&#xE3;o <b>Lista Ingresse</b>, na qual voc&#xEA; confirma presen&#xE7;a em um evento, e v&#xEA; outras pessoas que fizeram o mesmo. Voc&#xEA; tamb&#xE9;m pode, de forma muito simples, <b>divulgar um evento</b> para seus amigos, compartilhando o link com redes sociais como Facebook, Twitter e Whatsapp.<br>------------------------------------------------<br>&#x25BA;<b>BUSCA DE EVENTOS COM REGIONALIZA&#xC7;&#xC3;O AUTOM&#xC1;TICA</b><br>O app tamb&#xE9;m &#xE9; capaz de detectar sua localiza&#xE7;&#xE3;o atrav&#xE9;s de um GPS. Assim, quando voc&#xEA; estiver na rua e n&#xE3;o souber ao certo onde ir, ele pode <b>indicar os eventos</b> que est&#xE3;o acontecendo pr&#xF3;ximos de voc&#xEA;, facilitando ainda mais o processo de compra de ingressos online.<br>------------------------------------------------<br>&#x25BA;<b>DETALHES DO EVENTO</b><br>Al&#xE9;m de saber quais baladas, festas universit&#xE1;rias, blocos de rua 2017, bloquinhos de Carnaval 2017, shows, festivais, e eventos de teatro e cultura est&#xE3;o pr&#xF3;ximos de voc&#xEA;, o aplicativo tamb&#xE9;m mostra <b>como chegar</b> l&#xE1; atrav&#xE9;s do mapa do pr&#xF3;prio celular.<br>------------------------------------------------<br>&#x25BA;<b>EVENTOS O ANO TODO</b><br>Descubra os principais eventos de em S&#xE3;o Paulo, Rio de Janeiro, Goi&#xE2;nia, Manaus, Bras&#xED;lia e no resto do Brasil. Durante todo o ano e no Carnaval 2017 est&#xE3;o dispon&#xED;veis ingressos para eventos e festivais como festas universit&#xE1;rias, baladas, cervejadas, blocos de rua, shows sem hora para acabar.<br>------------------------------------------------<br>&#x25BA;<b>EVENTOS DE DESTAQUE</b><br><br>Compre seu ticket para os principais eventos do Carnaval 2017!<br><br>Em S&#xE3;o Paulo grandes labels como Vale Night, Gandaia, Carnav&#xE1;lia, Baile do Z&#xE9; Ruela e Pediu pra Sambar Samb&#xF4; prometem agitar o pr&#xE9; Carnaval paulistano!<br><br>Pra quem curte exposi&#xE7;&#xF5;es evite filas na bilheteria do eventos, compre ingressos antecipadamente para a exposi&#xE7;&#xE3;o do Gaud&#xED; e do Lego. Em festas universit&#xE1;rias voc&#xEA; encontra eventos das melhores faculdades como FGV, USP, FAAP, ESPM, PUC e MACKENZIE.<br><br>Al&#xE9;m dos bloquinhos de rua 2017, no RJ os destaques v&#xE3;o para as festas de Carnaval 2017 como Esb&#xF3;rnia, Sambinha, Music Motion, Rio Sunset, To Muerto e muito mais!",
    "histogram": {
        "1": 302,
        "2": 81,
        "3": 146,
        "4": 318,
        "5": 1220
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/bqkWqneQ9OKm0KWtMgBIyjUIf1pZBaG5C8BFy5JGx9rBJmcoIDQoRAu3RNfd0O2lbg=h310",
        "//lh6.ggpht.com/aztfO0Iar5xYknRjXgemS3iYcOCbbwmlXiSAvw5XDom5nPoESwU8HdT4EdSl8ioBU-E=h310",
        "//lh4.ggpht.com/p4GukytmrWnLbKGxI8Sb-OrOuFk-XAV48Dsk_at7dbneDgw5PFpCyIxhEbhk35rk49NH=h310",
        "//lh6.ggpht.com/vb9h6V8CAh1XAaypPwIp5fIadfh9y3rNiiZIB7f1qb-M7puabMuM70AavDML8n8ChIQW=h310",
        "//lh5.ggpht.com/VvQlh8N7zKbcVjReIIvLBZLCgWrUF1gU13EALS-b_ePv7DlrrESIt1HlSqYKBL19foY=h310"
    ],
    "video": "https://www.youtube.com/embed/O23TgjxY_DI",
    "comments": [
        "É prático e útil!",
        "Lixo de app. Desinstalando. Mais fácil comprar pelo navegador mesmo.",
        "Bosta de aplicativo. Comprei dois ingressos e não consigo nem ver o código do segundo...  Fora que não tinha necessidade de ficar piscando o popup do código QR (dito para aumentar a segurança) se boa parte compra não usa nem SSL...",
        "Obrigação? Sou obrigado a baixar para obter o ingresso? App fraco e tentando crescer de forma erronia.",
        "Como desligar notificação? Pior coisa é app que não respeita a tranquilidade dos usuários, não achei nenhum lugar pra desligar as notificações push do App.",
        "Inconveniente Único sistema de compra de ingressos que já usei em que fui obrigado a baixar o app. Ridículo. Não há porque não oferecer opção de impressão dos ingressos em papel ou geração de PDF... Baixei, usei e desinstalei. Patético."
    ],
    "recentChanges": [
        "Essa atualização é para a galera que curte comprar ingresso para si e para a turma toda. A lista de ingressos dentro do aplicativo possui um indicador de página novo, bem \"estilêra\"."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ingresse.ticketbooth&hl=en&gl=us",
    "appId": "com.ingresse.ticketbooth"
}