{
    "title": "Minuum Keyboard Free + Emoji",
    "summary": "The smaller, smarter keyboard. Now with predictive emoji!",
    "icon": "//lh3.ggpht.com/tPSoOz0rfIjybyNrXbHiqGr6CNaGsWO4UkTB_bINtTA79mGopQoVGfhS4oM13_Xyrw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 3.9,
    "reviews": 19968,
    "developer": "Whirlscape",
    "developerId": "Whirlscape",
    "developerEmail": "support@minuum.com",
    "developerWebsite": "http://minuum.com",
    "developerAddress": "176 John St., Suite 300\nToronto, ON, Canada\nM5T1X5",
    "updated": "February 17, 2017",
    "version": "3.5.2",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Try Minuum for FREE for 30 days. MINUUM™ - The smarter, smaller keyboard that lets you do more with your screen space. It’s the little keyboard for big fingers! *** One of the “12 best Android apps of 2014” - Karissa Bell, Mashable *** Minuum is best known for:★ SLOPPY TYPING — Type surprisingly fast and delightfully sloppy ★ SMART EMOJI — Always have the right emoticon right at your finger tips★ SHAPESHIFTING — Save screen space, enable one-handed typing or reposition your keyboard entirely Spend 15 seconds with the introductory tutorial and you'll be able to start typing with Minuum—instantly. The more you type, the better Minuum gets. MULTI-LANGUAGE CAPABILITYDownload language modules and quickly switch between them. We currently support:• English• Spanish• French• German• Italian• Portuguese-BR• Russian• Dutch• Swedish• Czech• Polish• Portuguese-PT• Turkish BONUS PANELSMinuum is always finding ways for you to enjoy your screen space through brand new bonus panels:★ CURSOR CONTROL — Tweak your texts, emails, and posts with ease★ CLIPBOARD TOOLS — Quickly cut, copy and paste★ SEARCH & SHARE — Instantly access thesaurus, dictionary, search, and share★ EMOJI—Express yourself better with immediate access to all 856 emoticons★ TYPING SPEED — Monitor your typing speed DISCOVER MOREThe Minuum keyboard for touchscreens is the first step toward a \"type anywhere\" future. Soon Minuum will let you type in ways you never imagined. For more information: http://www.minuum.com FEATURES AT A GLANCE• FAST SLOPPY TYPINGType fast without worrying about precision, thanks to ridiculously smart auto-correction that learns as you type.• MORE SCREEN SPACERecover more than half of the touchscreen space you lose when using traditional virtual keyboards.• HELP FOR THE LARGE-FINGEREDUse key magnification for precise letter, number, and punctuation entry—very useful if you have large fingers.• DIFFERENT ALPHABET ARRANGEMENTSChoose from alternate keyboard layouts—such as “QWERTZ,” “AZERTY,” “A-Z.”• EXPANSION TO FULL-SIZED KEYBOARDDrag on the candidates bar to quickly switch between mini and full-size modes (useful for URLs and passwords).• SMART WORD PREDICTIONSpeed up your typing via suggestions from a predictive engine that learns from your word list, word combos, and language use patterns.• SMART EMOJISwipe the word predictions left to find your Smart Emoji suggestions. Learn more about \"the quest for the perfect emoji\" here: http://goo.gl/sxQT9w• VOCABULARY CONTROLMinuum learns from your vocabulary, and lets you delete words from your dictionary though a pop-up display.• RAPID GESTURE SHORTCUTSSlide your fingers to the corners for quick, convenient access to all your features via pop-up keys.• VOICE TYPINGEnter text hands-free via Google Voice Typing for voice-to-text typing when performing other activities.• REAL MULTITASKINGIf you’ve got split-screen capability, multitask more effectively as a result of extra screen space. SUPPORTVisit http://support.minuum.com to:• Share ideas with the Minuum community• Give product feedback• Get help PRIVACYThe Minuum keyboard stores data about your typing tendencies on your device. We do not collect typing data remotely and will not do so without first asking you. Please see our privacy policy: http://www.minuum.com/data ABOUT OUR NAMESome people call us “Minum” or the “Minimum” keyboard but an easy way to remember the Whirlscape™ Minuum™ Keyboard is to think of a continuum of letters taking up minimal space. For updates, join our mailing list at http://eepurl.com/zwd8T",
    "descriptionHTML": "Try Minuum for FREE for 30 days.<br> <br><b>MINUUM&#x2122; - The smarter, smaller keyboard that lets you do more with your screen space. It&#x2019;s the little keyboard for big fingers!</b><br> <br>*** One of the &#x201C;12 best Android apps of 2014&#x201D; - Karissa Bell, Mashable ***<br> <br>Minuum is best known for:<br>&#x2605; SLOPPY TYPING &#x2014; Type surprisingly fast and delightfully sloppy <br>&#x2605; SMART EMOJI &#x2014; Always have the right emoticon right at your finger tips<br>&#x2605; SHAPESHIFTING &#x2014; Save screen space, enable one-handed typing or reposition your keyboard entirely<br> <br>Spend 15 seconds with the introductory tutorial and you&apos;ll be able to start typing with Minuum&#x2014;instantly. The more you type, the better Minuum gets.<br> <br><b>MULTI-LANGUAGE CAPABILITY</b><br>Download language modules and quickly switch between them. We currently support:<br>&#x2022; English<br>&#x2022; Spanish<br>&#x2022; French<br>&#x2022; German<br>&#x2022; Italian<br>&#x2022; Portuguese-BR<br>&#x2022; Russian<br>&#x2022; Dutch<br>&#x2022; Swedish<br>&#x2022; Czech<br>&#x2022; Polish<br>&#x2022; Portuguese-PT<br>&#x2022; Turkish<br> <br><b>BONUS PANELS</b><br>Minuum is always finding ways for you to enjoy your screen space through brand new bonus panels:<br>&#x2605; CURSOR CONTROL &#x2014; Tweak your texts, emails, and posts with ease<br>&#x2605; CLIPBOARD TOOLS &#x2014; Quickly cut, copy and paste<br>&#x2605; SEARCH &amp; SHARE &#x2014; Instantly access thesaurus, dictionary, search, and share<br>&#x2605; EMOJI&#x2014;Express yourself better with immediate access to all 856 emoticons<br>&#x2605; TYPING SPEED &#x2014; Monitor your typing speed<br> <br><b>DISCOVER MORE</b><br>The Minuum keyboard for touchscreens is the first step toward a &quot;type anywhere&quot; future. Soon Minuum will let you type in ways you never imagined. For more information: http://www.minuum.com<br> <br><b>FEATURES AT A GLANCE</b><br>&#x2022; FAST SLOPPY TYPING<br>Type fast without worrying about precision, thanks to ridiculously smart auto-correction that learns as you type.<br>&#x2022; MORE SCREEN SPACE<br>Recover more than half of the touchscreen space you lose when using traditional virtual keyboards.<br>&#x2022; HELP FOR THE LARGE-FINGERED<br>Use key magnification for precise letter, number, and punctuation entry&#x2014;very useful if you have large fingers.<br>&#x2022; DIFFERENT ALPHABET ARRANGEMENTS<br>Choose from alternate keyboard layouts&#x2014;such as &#x201C;QWERTZ,&#x201D; &#x201C;AZERTY,&#x201D; &#x201C;A-Z.&#x201D;<br>&#x2022; EXPANSION TO FULL-SIZED KEYBOARD<br>Drag on the candidates bar to quickly switch between mini and full-size modes (useful for URLs and passwords).<br>&#x2022; SMART WORD PREDICTION<br>Speed up your typing via suggestions from a predictive engine that learns from your word list, word combos, and language use patterns.<br>&#x2022; SMART EMOJI<br>Swipe the word predictions left to find your Smart Emoji suggestions. Learn more about &quot;the quest for the perfect emoji&quot; here: http://goo.gl/sxQT9w<br>&#x2022; VOCABULARY CONTROL<br>Minuum learns from your vocabulary, and lets you delete words from your dictionary though a pop-up display.<br>&#x2022; RAPID GESTURE SHORTCUTS<br>Slide your fingers to the corners for quick, convenient access to all your features via pop-up keys.<br>&#x2022; VOICE TYPING<br>Enter text hands-free via Google Voice Typing for voice-to-text typing when performing other activities.<br>&#x2022; REAL MULTITASKING<br>If you&#x2019;ve got split-screen capability, multitask more effectively as a result of extra screen space.<br> <br><b>SUPPORT</b><br>Visit http://support.minuum.com to:<br>&#x2022; Share ideas with the Minuum community<br>&#x2022; Give product feedback<br>&#x2022; Get help<br> <br><b>PRIVACY</b><br>The Minuum keyboard stores data about your typing tendencies on your device. We do not collect typing data remotely and will not do so without first asking you. Please see our privacy policy: http://www.minuum.com/data<br> <br><b>ABOUT OUR NAME</b><br>Some people call us &#x201C;Minum&#x201D; or the &#x201C;Minimum&#x201D; keyboard but an easy way to remember the Whirlscape&#x2122; Minuum&#x2122; Keyboard is to think of a continuum of letters taking up minimal space.<br> <br>For updates, join our mailing list at http://eepurl.com/zwd8T",
    "histogram": {
        "1": 1799,
        "2": 1293,
        "3": 2679,
        "4": 4992,
        "5": 9205
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/_jDmsvicsfaB5E0-3DDCiI4L2aYp4xlgCumGre_kgIhZ67fZnZ62U7GBGwQXZKbmG7A=h310",
        "//lh5.ggpht.com/yyj9NtrQdtaois7muGAUJrUYwbWWz0Xv4F70Ae7tLBkcj8cw2xyJCVzHpnjSAx1vKw=h310",
        "//lh3.ggpht.com/ZgyJBxFj_P99Ol0IM4iKxqu7eclxerzuh4W1r21v1qf7p71Qzh1B4---e359LnEKQOs=h310",
        "//lh5.ggpht.com/v3zkzSGtzYjZVPLTmU8BwW83-SGxzgW2QLbxvru-CJlg5fVG_4DkSRqRuDSo9Om25Q=h310",
        "//lh3.ggpht.com/jU2rXn9nOhCYhgnV891HvKHrlXfvjAQDS_UnMykTEVvBEE2y7Sgp6Y_eT_U5dRzwy1k=h310",
        "//lh3.ggpht.com/c-CXOczzdNo66uZQ4P5fULtWHXCzU54SUFLqpmYazJYHxPpwJuTVuSm7RPJbIfmVgWI=h310",
        "//lh3.ggpht.com/GS6bMy4Dw2oGBkpydQGBpLYT5JBfxMmKrJDrif0mR72nFBAhLcvAS2vnZH6E2J_625Y=h310",
        "//lh6.ggpht.com/PIbEAnZ2-suu7rn1RIrG9Wg0Q5Oce6G9qTGVFQSLzuuKMOL47OqHaCh4_PMC3UHo=h310"
    ],
    "comments": [
        "I'm kind of a keyboard geek, always looking for a better way. I've trialed Minuum at least three times,  but this latest iteration is psychic.  I've always used swipe style keyboards because I'm so sloppy at hitting keys. Imagine making beautiful music on the piano- using your fists.  That's Minuum.   It's creepy cool.  You just gotta be patient and realize it's just a QWERTY.  Try it for a week. It will blow your gourd. Do it just for the entertainment.",
        "Took about a week to adjust but now I can't do without this keyboard. It really makes a ton of sense when you think about the idea behind it. It just removes the need for vertical tapping, and the predictions are astounding. It even guesses things like my crazy email address. Pro tip: use the clipboard for easy access to passwords.",
        "Let me just say: I love this app, I pay for it and I'm prepared to changr this review once this issue I'm about to describe is fixed.   Other users have made note of this problem. I have recently just changed phone to a galaxy note 8. The note 8 has software nav buttons at the bottom. After a while of short use, the spacebar and bottom of the keyboard becomes hidden under the navbar and the only solution is to use a different keyboard.   Please address this issue in the next update so I can keep enjoying this fantastic app. Thanks and excellent work.",
        "It's OK. Not great. I never use the mini keyboard and I like to have a number row. I also don't like the sloppy typing feature.  When you try to type a password or a name or something like that it tries to autocorrect it into a word. And the word prediction is better on other keyboards. I probably wont download the paid version.",
        "App is so heavy. Why does a keyboard app has to be this big??  I have tried Minuum several times before. App has improved very much. To save several taps the prediction engine has to be improved. Please concentrate on improving predictions, next word predictions and personalised suggestions. Then I will consider buying this app for sure. Don't forget to reduce the app size though. Good luck. 👍",
        "Update: Facing issues on the Samsung Galaxy S8.. overlap with the bag bar.. my space bar and lower buttons are barely visible. Please fix asap.. can't do without my minuum  Love the way it knows what I'm typing..  Prediction accuracy has really increased and makes typing a cinch.  Needs further improvements to remove sluggishness"
    ],
    "recentChanges": [
        "3.5.2",
        "- Stability and bug fixes",
        "3.5",
        "- Support for unicode 8 emoji (Android 6.0.1 only)",
        "3.4.5",
        "-Stability improvement",
        "-Fixed a long standing crash with language and layout selection",
        "3.4.4",
        "-Background optimizations",
        "3.4.3",
        "-Added advanced option to adjust long press delay",
        "-Improve access to special character (pl/sv) in multi-lingual mode",
        "-Better access to _ in spanish",
        "-Better access to <> and _ and other tweaks to the symbols layout",
        "-Small improvements to the adaptive color scheme"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.whirlscape.minuumfree&hl=en&gl=us",
    "appId": "com.whirlscape.minuumfree"
}