{
    "title": "Zinc - Enterprise Messaging",
    "summary": "Zinc is the secure communication app that connects employees outside the office.",
    "icon": "//lh3.googleusercontent.com/mO3MoLAHTbMHm86uZm7Q-3MywVQ582Odhl1e1RJAOgqdCyXs1EpVzTFzIQHix1W9Rhg1=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4,
    "reviews": 365,
    "developer": "Zinc, Inc.",
    "developerId": "Zinc,+Inc.",
    "developerEmail": "support@zinc.it",
    "developerWebsite": "https://www.zinc.it",
    "developerAddress": "55 New Montgomery St Suite 888\nSan Francisco, CA 94107",
    "updated": "February 18, 2018",
    "version": "5.2.0-857",
    "genre": "Business",
    "genreId": "BUSINESS",
    "description": "Zinc is the only All Mode Communication Platform for deskless workforces that enables teams to communicate 1:1 or within groups.  Pick the best mode from Messaging, Voice, Video, Push to Talk and Hands Free to share information, get answers quickly and complete work faster, all from one app. Field teams stay connected with corporate news through Zinc Broadcasts, a streamlined way to deliver company-wide news and critical information, keeping everyone informed and engaged. ● Enterprise Ready: Optionally, Zinc can be managed from one central Admin Console providing user and group administration in addition to  conversation analytics● Secure: Zinc has certified with the most trusted 3rd party security standards across many industries such as  HIPAA, TRUSTe, FIPS 140­2, and SOC 2 for compliance.● Integrated: Zinc integrates with a wide range of systems and applications including Salesforce.com, Sharepoint, Box, Dropbox, Google Drive, ServiceMax in addition to calendars and contacts.Loved by users and trusted by the enterprise, Zinc drives real business results. What do our users say?“Zinc helps us cut through the noise to make sure we get the job done. It’s fast and concise communication” and,“Zinc has given us a competitive advantage because our team is completely aligned.”",
    "descriptionHTML": "Zinc is the only All Mode Communication Platform for deskless workforces that enables teams to communicate 1:1 or within groups.  Pick the best mode from Messaging, Voice, Video, Push to Talk and Hands Free to share information, get answers quickly and complete work faster, all from one app. <br><br>Field teams stay connected with corporate news through Zinc Broadcasts, a streamlined way to deliver company-wide news and critical information, keeping everyone informed and engaged. <br><br>&#x25CF; Enterprise Ready: Optionally, Zinc can be managed from one central Admin Console providing user and group administration in addition to  conversation analytics<br>&#x25CF; Secure: Zinc has certified with the most trusted 3rd party security standards across many industries such as  HIPAA, TRUSTe, FIPS 140&#xAD;2, and SOC 2 for compliance.<br>&#x25CF; Integrated: Zinc integrates with a wide range of systems and applications including Salesforce.com, Sharepoint, Box, Dropbox, Google Drive, ServiceMax in addition to calendars and contacts.<br><br>Loved by users and trusted by the enterprise, Zinc drives real business results. <br><br>What do our users say?<br>&#x201C;Zinc helps us cut through the noise to make sure we get the job done. It&#x2019;s fast and concise communication&#x201D; and,<br>&#x201C;Zinc has given us a competitive advantage because our team is completely aligned.&#x201D;",
    "histogram": {
        "1": 49,
        "2": 13,
        "3": 32,
        "4": 78,
        "5": 193
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ucnyVMrdZi88Nv0nemBxPbcHGAXelnuZiCfNBLlECzGaZwn9QkR1Z5x5BXDTfqkMDFA=h310",
        "//lh3.googleusercontent.com/TyJitD26cKs_d4wSHp04SJlVUXda0lzZk1_P0OEYOPD5a-xA9CVjk1MC_QInjfEQ6A=h310",
        "//lh3.googleusercontent.com/wTBFFEgDm91t0-WqL1s8ce-XWWS5Mk7BcXEToJ7DerDtcU94sSxZhCqncnA1xk-Nas5W=h310",
        "//lh3.googleusercontent.com/zfJWUYeuo6V5yveK7pvoITDLD7-4EVgRhBhISxuDCIdG22RhqLa2piWChiuEid-22Fk=h310",
        "//lh3.googleusercontent.com/zbGwbEwIRVr0u4ixoGngma_ZavSK3lJQDXUR2otljzRwijbtyUuoP6JBx4pQO4gDWf8=h310"
    ],
    "comments": [
        "Love this app. Is the backbone communication of my company",
        "Please fix the app. When I open the app, it keeps break down.",
        "This app is full of bugs and doesn't work properly. I tried to re install and when i am trying to put secuity it starts again n sends me another code so now i cant even sign in",
        "Does not even work in the first place. Cannot sign up at  all.",
        "Easy tool for communication Will go back to 5 stars when it works again. Has not worked since the last update on my android. I've sent multiple bug reports and I'm hoping for a quick fix.",
        "Perfect Best for people out in the world."
    ],
    "recentChanges": [
        "Now you can “at mention” someone in a conversation to get their attention when you need it.  Type the “@” sign then start typing their name and choose them from the list of suggestions. They’ll get a notification for your message even if they have the conversation muted.",
        "Various bug fixes and small enhancements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.cotap.android&hl=en&gl=us",
    "appId": "com.cotap.android"
}