{
    "title": "Ring My Phone(Android Wear)",
    "summary": "Ring my phone(RingMyPhone) from Android wear(Android watch)-Memorial Day Edtion",
    "icon": "//lh5.ggpht.com/Ys2hJmnZPBG1fSdvfHnugP3ZdGhCcDk3f-jU3Qz87EkDXbhZMOC_d-qmfXBRf0v54UVz=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 250,
    "developer": "CallMo",
    "developerId": "CallMo",
    "developerEmail": "askcallmo@gmail.com",
    "developerWebsite": "http://ezbook.org/privacypolicy.html",
    "updated": "February 28, 2015",
    "version": "1.9.1",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Ring my phone (RingMyPhone from Android wear) could help you find you phone easily through Android wear( Android watch)In any time, if you forget where you left your Android phone or Android pad in home, just one click in Android wear, your phone or your pad will ring loudly even it is in silent mode or screen locked until you find it.Ring My Phone(RingMyPhone from Android wear) is a simple Android app that allows you to start your phone ringing using your Android watch. Phone on silent or locked? Do not worry. RingMyPhone will turn your volume to max, turn your screen on, and keep ringing until you tell it to stop. Once you stop it, your ringer volume will be restored to what ever it was previously.Feature:-Ring my phone from android watch if device is out of sight-Stop the ring from either Android phone or Android watch-Ring my phone even Android phone in silent mode-Ring my phone even Android phone is screen locked-Set back the original volume after Alert Ring finished-Support  Android Pad tooHow to use:(1) Pair your watch with your mobile device ( Android phone or Pad)       Ref Google Tutorial https://support.google.com/androidwear/answer/6056630?hl=en(2) Go to your watch, Click screen or speak \"OK Google\"(3) In \"Speak Now \" screen, scroll screen to the bottom and go to start menu of Android wear(4) In start menu, Click Ringmyphone or its icon to launch our app------ Step 1 to Step 4 is general steps for all apps running in Android wear(5) Click the screen to ring your phone(6) Click again to stop the ringing",
    "descriptionHTML": "Ring my phone (RingMyPhone from Android wear) could help you find you phone easily through Android wear( Android watch)<br><br>In any time, if you forget where you left your Android phone or Android pad in home, just one click in Android wear, your phone or your pad will ring loudly even it is in silent mode or screen locked until you find it.<br><br>Ring My Phone(RingMyPhone from Android wear) is a simple Android app that allows you to start your phone ringing using your Android watch. Phone on silent or locked? Do not worry. RingMyPhone will turn your volume to max, turn your screen on, and keep ringing until you tell it to stop. <br><br>Once you stop it, your ringer volume will be restored to what ever it was previously.<br><br>Feature:<br><br>-Ring my phone from android watch if device is out of sight<br>-Stop the ring from either Android phone or Android watch<br>-Ring my phone even Android phone in silent mode<br>-Ring my phone even Android phone is screen locked<br>-Set back the original volume after Alert Ring finished<br>-Support  Android Pad too<br><br>How to use:<br><br>(1) Pair your watch with your mobile device ( Android phone or Pad) <br>      Ref Google Tutorial https://support.google.com/androidwear/answer/6056630?hl=en<br>(2) Go to your watch, Click screen or speak &quot;OK Google&quot;<br>(3) In &quot;Speak Now &quot; screen, scroll screen to the bottom and go to start menu of Android wear<br>(4) In start menu, Click Ringmyphone or its icon to launch our app<br><br>------ Step 1 to Step 4 is general steps for all apps running in Android wear<br><br>(5) Click the screen to ring your phone<br>(6) Click again to stop the ringing",
    "histogram": {
        "1": 20,
        "2": 10,
        "3": 16,
        "4": 46,
        "5": 158
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/rK7C_gNHmvJ69LXchkWRjUxXVJqWSAR7Gd5v8nW9sSxruoWtgmN8Hul35lP9GjFbKw=h310",
        "//lh6.ggpht.com/G0pnyrXzPdSfJaOqUofbjcpUaJQi76wJx4Zh3fqRCX6YeqXEj6J644bz7YkP-HSwKeZE=h310",
        "//lh3.ggpht.com/lfoEeM8TVrL1FwUyVVU4wwaOMb-Jeo6uqJyaEwwnrMhFyRu1eDmr8gTULIon_WdQkJ0=h310",
        "//lh3.ggpht.com/EfAVfH1J3ULIe0Hmd0VdwQiR99dg0du8c9fEcoDKagKXAYqpkMorIg8sKGZcIH0fdQ=h310",
        "//lh6.ggpht.com/UX6Cv8QLus6FGz09JVRUSX2yDntEBu7St9l1Dw626MKqJYC2XTycEX_3SYG-l3XyGh8=h310",
        "//lh3.ggpht.com/5dsnpnD0IZHkXBgkzUAaqxZZg11Ng8rpWG9SRtcitVRo_cTapK31eA-u37TvK_hh3Mw=h310"
    ],
    "comments": [
        "Very useful app! This little android wear app is definitely a big help. I have a Motorola 360 2nd generation smartwatch synced to my Sony Xperia Z3 and they work flawlessly. I use it all the time when I misplace my phone. The sound is an old style ringtone and I thought it was going to be very low but to my surprise it's not. The sound is very loud and you can hear it very clearly. I definitely recommend to everyone.",
        "Disaster. I have Nexus 5x and Moto360 Ver 2 which does this anyway but can't always ring phone for some reason which is why I tried this app, but it has ads you can't get rid of, the phone won't stop ringing once it starts (if it does), and sometimes it can't ring the phone just like the stock app. What could be worse than a third party app doesn't improve anything and only makes matters worse?",
        "What a stupid app. It doesn't ring your phone, it just plays a sound bite.",
        "Amazing I would be lost so much with out this app (well my phone plainly be, not me)  but that's beside the point, this app is sooooo useful!",
        "Yep, it rang my phone Would like better of I could pick my ringtone, but otherwise it does its job.",
        "So awesome Works perfectly. Has saved me an annoying search countless times."
    ],
    "recentChanges": [
        "1.9.1",
        "- Happy mother day!, Send your true love to your mother",
        "- Send mail to us if you would like to contribute the theme( include visual and audio art)",
        "1.8.7",
        "- fix mob fox sdk issue",
        "- Turn on camera flashing while ring my phone",
        "- Fix issue that some device could not initial media player",
        "1.7",
        "- Turn on the screen when phone is ringing, It is will helpful to find my phone in night or dark environment",
        "1.6",
        "- fix screen crash issue in 1.5"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.applandus.ringmyphone.android&hl=en&gl=us",
    "appId": "com.applandus.ringmyphone.android"
}