{
    "title": "Junkers Control",
    "summary": "Junkers Control is a smart WiFi thermostat for heating and hot water control",
    "icon": "//lh3.googleusercontent.com/X5NhClZmUw8K2J5kkIJxfcZEt08p2TeAvaZGSnShBdkCOXpKDWSub5r4kZETU1ypNA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 2.8,
    "reviews": 99,
    "developer": "Bosch Thermotechnik GmbH",
    "developerId": "Bosch+Thermotechnik+GmbH",
    "developerEmail": "bosch.thermotechnik.gmbh@googlemail.com",
    "developerWebsite": "http://www.bosch-thermotechnology.com",
    "developerAddress": "Bosch Thermotechnik GmbH\nSophienstraße 30-32\n35576 Wetzlar",
    "updated": "September 1, 2017",
    "version": "3.6.0",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Junkers Control – smart control for heating and hot waterThe Junkers Control is an internet-connected programmable smart thermostat for heating and hot water system control, which can be operated using this app.Once installing this app, there is the option to run the app in demo mode, without access to the internet, a Junkers Control or a compatible Junkers boiler, to showcase the extensive features and simplicity of use.Simple to useThe Junkers Control’s intuitive operation and modern design ensures it is very simple to operate using either its built-in touch-screen or the app.• Supplied with a pre-set schedule that can then be easily modified to fit your needs.• The Junkers Control features a ‘vacation mode’, requiring just a beginning and end date.• An installation and operation manual is provided with each Junkers Control and there are helpful videos within this app that provide further detail on specific functions.Simply smarterThe Junkers Control’s advanced programming enables it to have an ‘intelligent conversation’ with the boiler to take advantage of features which help improve energy efficiency, such as:• Load and weather compensation which reduce the boiler water temperature to help further increase efficiency, while also increasing user comfort.  • Unlike other smart heating controls, the Junkers Control can also control your domestic hot water settings, helping provide additional energy savings and comfort. • Visual representation of gas usage data can help you easily identify where potential savings could be made.Want a Junkers Control for your home?To take smarter control of your heating, first check if your Junkers boiler is compatible with the Junkers Control by visiting our web site. The Junkers Control only requires a 2- wire connection between the control and the boiler; all other connections are made via the WiFi network.",
    "descriptionHTML": "Junkers Control &#x2013; smart control for heating and hot water<br>The Junkers Control is an internet-connected programmable smart thermostat for heating and hot water system control, which can be operated using this app.<br>Once installing this app, there is the option to run the app in demo mode, without access to the internet, a Junkers Control or a compatible Junkers boiler, to showcase the extensive features and simplicity of use.<br><br>Simple to use<br>The Junkers Control&#x2019;s intuitive operation and modern design ensures it is very simple to operate using either its built-in touch-screen or the app.<br>&#x2022; Supplied with a pre-set schedule that can then be easily modified to fit your needs.<br>&#x2022; The Junkers Control features a &#x2018;vacation mode&#x2019;, requiring just a beginning and end date.<br>&#x2022; An installation and operation manual is provided with each Junkers Control and there are helpful videos within this app that provide further detail on specific functions.<br><br>Simply smarter<br>The Junkers Control&#x2019;s advanced programming enables it to have an &#x2018;intelligent conversation&#x2019; with the boiler to take advantage of features which help improve energy efficiency, such as:<br>&#x2022; Load and weather compensation which reduce the boiler water temperature to help further increase efficiency, while also increasing user comfort.  <br>&#x2022; Unlike other smart heating controls, the Junkers Control can also control your domestic hot water settings, helping provide additional energy savings and comfort. <br>&#x2022; Visual representation of gas usage data can help you easily identify where potential savings could be made.<br><br>Want a Junkers Control for your home?<br>To take smarter control of your heating, first check if your Junkers boiler is compatible with the Junkers Control by visiting our web site. <br>The Junkers Control only requires a 2- wire connection between the control and the boiler; all other connections are made via the WiFi network.",
    "histogram": {
        "1": 39,
        "2": 8,
        "3": 12,
        "4": 16,
        "5": 24
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/y-K18HoQL3aLvAEoDa_vd-UDSG7p9gjadCcyRG7-xf7HsNq-DxbP-fL2UvzNwRO3P1I=h310",
        "//lh3.googleusercontent.com/eVCLftEJiG4WsLyD5ov3mMBilzQIUFdwd2tbYMkglrqUwk4HD1AI9-EwnLcF2iGb1-0D=h310",
        "//lh3.googleusercontent.com/PJ1cAzEhsrOk4VZEdkVavnXrn1GvALG3bKrdGMDQVFbRIH5aetUQ2FEx9grRxV4tjQ=h310",
        "//lh3.googleusercontent.com/1tw_blt7-fdJTiMfW-HORsMunTxj8u3AXQILFYNjh41GXEkgmWgDaVceZ7iYfcjnhjRR=h310",
        "//lh3.googleusercontent.com/P4c2xSzNiShUgJJbXOUKuZxPBYt3PXiJBQylvlbffIcrqh79UFTQcUzMv-sULc4w0Q=h310",
        "//lh3.googleusercontent.com/j0uMBtl0Ny0mY6DY-M-4nBOhDGeHGy-31-rmvGn3mWnK_ijLcSuFmGHXkKVr5KHMBwiR=h310",
        "//lh3.googleusercontent.com/xjv5ImJs-bODAU05aNvojWhrHAT0VskeihmUYIPIVQIziASRoggJC-znx2yvGTo0kD8=h310",
        "//lh3.googleusercontent.com/e-CqdKtByjI6pn9l05MyJnC-oO_1r_bD2c0XuoLFZpd7DcBL0TfQKPEisCV2Dl9WSVST=h310",
        "//lh3.googleusercontent.com/7eK8dOapKP7SQzM2Pq90SKaD5NpVGjpal16Cm4DUQ_6WJHofy4mcGbtMJLzmYlOqTtg=h310",
        "//lh3.googleusercontent.com/Bvck5C7WULeoUnaPoPOC9brV4Ac6HKi1oKxdBxmCLsjQK2MWsZqGA0A5p-tsufk5wG48=h310",
        "//lh3.googleusercontent.com/649bFjf7q4riCKdx1ME9aOosuDYY5qh5I_zKVx_Up3XGbWJ6TWwZZlz3mAinYH2asFkr=h310",
        "//lh3.googleusercontent.com/5Q68_OtWjg79_rGRIMilC7_HC6z3qJMjkuBUcZRZmKcl6Kb8P_QxJmdP4fR9yYHdGA=h310",
        "//lh3.googleusercontent.com/MC9HLawvJozlhTEX5dj8A7qZIQHzcJBnLfBHvbxH1xYNShdj1t7JfbU0kzmvqJkRiPM=h310",
        "//lh3.googleusercontent.com/1xwOa6S6gC9oNfQrTV4EfejJfvUrXyfnq5Lk1c0Hy2Q2Yf0QP25ZWuKqqszlphgCaNXi=h310",
        "//lh3.googleusercontent.com/zBTtHjKM2RL1ssat2H_R_oj9lgujUfAXlZBnx6em873skmjW1MVQDnaV9jY_BeA3Duzw=h310",
        "//lh3.googleusercontent.com/9F7EgA-GCcGK1Qvkjcsi9VpdAiDA40Ngt5ljl5N3kC23xrJvMrnEXKyDVRyDv8sh4pI=h310",
        "//lh3.googleusercontent.com/I2xJbjNgJb6LTmwvKUnSNXgw1KFyAsNwPkRunWRn55U-IAKamiAOXeUFZzKYbAsNn4L8=h310"
    ],
    "comments": [
        "After 2 days I get the message that my country or language is not supported. How come it worked at first?",
        "Error message lqnguage or country not supported  what a mesd",
        "Language not supported Dutch language is not supported! I got an error message every time when my default language off the phone is in dutch... English UK works fine.... Please fix this a soon as possible... I read other reviews to and i'm not the only one who has this problem...",
        "Works on my wife's Iphone but not on my Xiaomi MI3... It says country or language not supported, however both phones are in Dutch??",
        "Time please! Please display the time when idle or make it an option. All other models and brands show the time and it was a habit to check the time on the display.",
        "It would be nice if the app could allow to control more than one thermostat!"
    ],
    "recentChanges": [
        "* Improved App stability",
        "* Support of latest platforms"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bosch.tt.junkers.control&hl=en&gl=us",
    "appId": "com.bosch.tt.junkers.control"
}