{
    "title": "Presenter Wear",
    "summary": "The tool for professional presenters",
    "icon": "//lh3.googleusercontent.com/cnYCYdvAVo1OU6S6_F4Bhkz19cdJa93Bgyu7VwT7c5rSnie8RSIsGwm7ZiDvwQs5iwc=w300",
    "price": "$2.49",
    "free": false,
    "minInstalls": 10,
    "maxInstalls": 50,
    "score": 5,
    "reviews": 6,
    "developer": "Presenter Wear",
    "developerId": "Presenter+Wear",
    "developerEmail": "info@presenterwear.com",
    "developerWebsite": "https://presenterwear.com",
    "developerAddress": "1096 Budapest, Thaly Kálmán utca 20.",
    "updated": "June 23, 2017",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "Do you want to get the most out of your presentation? Do you hate messing around with different presenter remotes?Install our app on your device, and have a professional presenter tool always by hand.By Presenters for PresentersBased on several corporate and private presentations, we have collected the most wanted features, and created a simple app.Phone Features• SHOWS YOU WHAT’S NEXTCorporate presentations may require presenting others’ slides, while a great story line cannot break. This is why we show you what is on the next slide.• NOTES IN YOUR HANDSIf your story is in your notes, you can simply view them on a separate tab.• SMART LASER POINTERLaser pointers can be hard to see in certain light conditions. This why we added a virtual pointer into our app.• EASY TO SWITCHMost presenters have a small button for changing slides. With this app you may swipe anywhere on your screen to switch to the next one. You can also use the volume keys if you still need the physical thing.• KNOW YOUR PACEView the clock, or start a stopwatch to always know how much time is left of your presentation.Watch Features• SWITCH WITH GESTURESTurn your wrist to change slides. Your hands can be free, so nothing will interfere with your non-verbal communication.• NEXT SLIDE TITLETo make sure you know what comes next even when you are walking around.• SWIPE TO CHANGEYou can also swipe to change slides, or use hardware buttons if available.• LASER FROM WATCHThe virtual laser pointer is also available from the watch.• SHOWS YOU THE TIMETo make sure your presentation keeps on schedule, we show you the local time or the stopwatch.• SUPPORTED DEVICESAll Android Wear devices are supported.The installation of a companion PC application is required, which you can download at presenterwear.com/latest. For more information, see presenterwear.com/faq.Feel free to try out every feature of our app in the ad-supported demo version.",
    "descriptionHTML": "Do you want to get the most out of your presentation? Do you hate messing around with different presenter remotes?<br><br>Install our app on your device, and have a professional presenter tool always by hand.<br><br><b>By Presenters for Presenters</b><br><br>Based on several corporate and private presentations, we have collected the most wanted features, and created a simple app.<br><br><b>Phone Features</b><br><br>&#x2022; SHOWS YOU WHAT&#x2019;S NEXT<br>Corporate presentations may require presenting others&#x2019; slides, while a great story line cannot break. This is why we show you what is on the next slide.<br><br>&#x2022; NOTES IN YOUR HANDS<br>If your story is in your notes, you can simply view them on a separate tab.<br><br>&#x2022; SMART LASER POINTER<br>Laser pointers can be hard to see in certain light conditions. This why we added a virtual pointer into our app.<br><br>&#x2022; EASY TO SWITCH<br>Most presenters have a small button for changing slides. With this app you may swipe anywhere on your screen to switch to the next one. You can also use the volume keys if you still need the physical thing.<br><br>&#x2022; KNOW YOUR PACE<br>View the clock, or start a stopwatch to always know how much time is left of your presentation.<br><br><b>Watch Features</b><br><br>&#x2022; SWITCH WITH GESTURES<br>Turn your wrist to change slides. Your hands can be free, so nothing will interfere with your non-verbal communication.<br><br>&#x2022; NEXT SLIDE TITLE<br>To make sure you know what comes next even when you are walking around.<br><br>&#x2022; SWIPE TO CHANGE<br>You can also swipe to change slides, or use hardware buttons if available.<br><br>&#x2022; LASER FROM WATCH<br>The virtual laser pointer is also available from the watch.<br><br>&#x2022; SHOWS YOU THE TIME<br>To make sure your presentation keeps on schedule, we show you the local time or the stopwatch.<br><br>&#x2022; SUPPORTED DEVICES<br>All Android Wear devices are supported.<br><br><b>The installation of a companion PC application is required, which you can download at <a href=\"https://www.google.com/url?q=https://www.google.com/url?q%3Dhttps%253A%252F%252Fpresenterwear.com%252Flatest%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNEotBaIenv0kZFwRaIHkGRq4o5x3g&amp;sa=D&amp;usg=AFQjCNGrFNra2pmYIZDL5MROaNLR8fkDdg\" target=\"_blank\">presenterwear.com/latest</a>. For more information, see <a href=\"https://www.google.com/url?q=https://www.google.com/url?q%3Dhttps%253A%252F%252Fpresenterwear.com%252Ffaq%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNF7B-jwYaCwKS64aM_KkFDwnH4xcw&amp;sa=D&amp;usg=AFQjCNF9-r_Ly_ZoGi3gT-R20kbTML-HDQ\" target=\"_blank\">presenterwear.com/faq</a>.</b><br><br>Feel free to try out every feature of our app in the ad-supported <a href=\"https://play.google.com/store/apps/details?id=com.presenterwear.presenterwear.demo\">demo version</a>.",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 6
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/k58MshXLhqwMaWlbbYFVFnunKmCd3gMCwaoBIqMjOnFHrOsttwW5o9w5emQENLSNjYE=h310",
        "//lh3.googleusercontent.com/6IOg-qff_yF_OxuMpv4nKAdHNzxiicp3Lr9X64iNMFoF8p0yvxIZjCHDVQFkXapXBs8=h310",
        "//lh3.googleusercontent.com/7RWKZ7lWqwOne1pCDUTIs6czGk10ylCusgJc9ckOhL7kCEfAnTP9sDLfKHLlbmPbVQ=h310",
        "//lh3.googleusercontent.com/T-qmmQsfNI6B8w2DZjq2Zo-X0PVVW6FURoOivQ9vPu7_CrBgCCyyu646noaaqrNhHg=h310",
        "//lh3.googleusercontent.com/L5k91HlYnQ5gCAZaBNU8afrOFpWEwwoRQhxGfNylKwhiV6Rp5j2-X1Sjdg_sAcNtUsA=h310"
    ],
    "comments": [],
    "recentChanges": [
        "Initial release."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.presenterwear.presenterwear&hl=en&gl=us",
    "appId": "com.presenterwear.presenterwear"
}