{
    "title": "Groupon - Shop Deals, Discounts & Coupons",
    "summary": "Own the Experience.  Save everyday on thousands of things to do, see, try &amp; buy.",
    "icon": "//lh3.googleusercontent.com/i93nI0wKn_VBPCG0v6ZmJFBqnTw461--nEcFUAZSREhPLExrh8TNILijPFKEvMcWP9c=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000000,
    "maxInstalls": 100000000,
    "score": 4.5,
    "reviews": 1313701,
    "developer": "Groupon, Inc.",
    "developerId": "Groupon,+Inc.",
    "developerEmail": "support+android@groupon.com",
    "developerWebsite": "https://www.groupon.com/privacy",
    "updated": "February 26, 2018",
    "version": "Varies with device",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "size": "Varies with device",
    "description": "Download Groupon and save up to 70% on the things you need every day. Find great deals on all the best stuff to eat, see, and do near you and around the world.Buy and save on everything you’re looking for. Whether you’re shopping for the latest fashion trends, craving a new restaurant in town, or daydreaming about tropical travel, a daily replenishment of deals delivers all the discounts you like.Every deal is available to use immediately, so you’re never more than a few taps away from a relaxing massage, tickets to the night’s hottest event, or a great pizza joint.With the Groupon app you can:•  Get promo codes and special savings alerts for deals near you, instantly on your mobile device•  Buy and redeem Groupon deals directly from your mobile device, no need to print vouchers or clip coupons•  Read customer reviews and write your own•  Share deals with friends and familyAnd there’s more:•  Instantly redeem on-demand deals on food, fun, fashion, and wellness, without having to print a voucher•  Use Groupon Goods to enjoy low prices without settling for bargain products•  Travel to exotic destinations and stay at the fanciest hotels with Groupon Getaways•  Shop for fun themed collections for holidays and eventsPut down the coupon book and pick up the Groupon Android app—your ticket to explore the best your city has to offer at savings of up to 70% off.Need help? Contact us at https://www.groupon.com/customer_support",
    "descriptionHTML": "Download Groupon and save up to 70% on the things you need every day. Find great deals on all the best stuff to eat, see, and do near you and around the world.<br><br>Buy and save on everything you&#x2019;re looking for. Whether you&#x2019;re shopping for the latest fashion trends, craving a new restaurant in town, or daydreaming about tropical travel, a daily replenishment of deals delivers all the discounts you like.<br><br>Every deal is available to use immediately, so you&#x2019;re never more than a few taps away from a relaxing massage, tickets to the night&#x2019;s hottest event, or a great pizza joint.<br><br>With the Groupon app you can:<br>&#x2022;  Get promo codes and special savings alerts for deals near you, instantly on your mobile device<br>&#x2022;  Buy and redeem Groupon deals directly from your mobile device, no need to print vouchers or clip coupons<br>&#x2022;  Read customer reviews and write your own<br>&#x2022;  Share deals with friends and family<br><br>And there&#x2019;s more:<br>&#x2022;  Instantly redeem on-demand deals on food, fun, fashion, and wellness, without having to print a voucher<br>&#x2022;  Use Groupon Goods to enjoy low prices without settling for bargain products<br>&#x2022;  Travel to exotic destinations and stay at the fanciest hotels with Groupon Getaways<br>&#x2022;  Shop for fun themed collections for holidays and events<br><br>Put down the coupon book and pick up the Groupon Android app&#x2014;your ticket to explore the best your city has to offer at savings of up to 70% off.<br><br>Need help? Contact us at https://www.groupon.com/customer_support",
    "histogram": {
        "1": 34924,
        "2": 19148,
        "3": 56939,
        "4": 281760,
        "5": 920930
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/A32-AOXllsswZ5dkkkZJdFID9BkUKM3CtN1eTcKAd7B4Zi-5E6MdeQYg4lTMNtso2_M=h310",
        "//lh3.googleusercontent.com/hpZ28nbojnFenR868nKr-_cyCjscOfo-9bV91ZboKhQeln_PQ2kwRLLPSoBuh2JtoCI=h310",
        "//lh3.googleusercontent.com/6UoAOTE21Wz7HupRU28qi-cRxIAIQvwfThuxAcukMqncDHRxZAcGU3Y6tWldET8QcFY=h310",
        "//lh3.googleusercontent.com/k-pKNK14jjeRF_CHf6BOYkEiA-wzzXsjF-QqBkWFtM4fbo2pWoENOIs8ohXLnVHNUCU=h310",
        "//lh3.googleusercontent.com/guwY6CTs3dk7jhiqrMVo_dGH9IbUmN77QlPH6xapplvjCLyDWZWyXUnu_K_5REjfYw=h310"
    ],
    "video": "https://www.youtube.com/embed/GM1QDBvzm1Y",
    "comments": [
        "I recently purchased a Groupon for a massage and by the time I  scheduled my treatment it was fraudulently redeemed by another person. Groupon was unwilling to help I  any way and the the spa,  Spavia, was unwilling to help. The refused to refund, credit, or unredeem the voucher. Very disappointed in the customer service. Groupon is not secure and others have access to your information.",
        "Generally happy with Groupon and the app however had an issue with a cell phone battery that my phone would not accept. It was from a second party supplier and could not get a refund or replacement. I tried multiple times and got nowhere. Money down the drain for a useless battery.",
        "This app really gave me hope because many beauty thing cost so much in comestic. This helped me get one worth 1500 for only 161 dollars. It's amazing. I finally had hope n my self esteem felt better ever since",
        "I love this app has great deals. What I hate is that all the travel discounts are flying out of US destinations in US dollar on Groupon Canada, why do we never get the opportunity for these deals?? Super annoying if it doesn't fly out of my country or in CND dollars then I don't want to see it, remove it from Groupon Canada.",
        "Ive received tons of amazing deals. Be 100% on what you would like to order because reaching out or receiving a reply from groupon is nearly impossible. Overall experience has been positive one.",
        "I think I should be able to return an item that does not fit.  I was actually out of the country and when I received the items the didn't fit. I'm not happy with the policy I should be refunded cuz it was not my fault manufacturer sizes were inaccurate"
    ],
    "recentChanges": [
        "Thanks for using the Groupon app! Here at Groupon, we strive to deliver the best deals to you by improving your experience every time we release a new version of our app. Our updates include many new features, improvements and bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.groupon&hl=en&gl=us",
    "appId": "com.groupon"
}