{
    "title": "Lifesum - Diet Plan, Calorie Counter & Food Diary",
    "summary": "Food tracker: meal planner, keto recipes &amp; diet tips. Eat healthy &amp; lose weight!",
    "icon": "//lh3.googleusercontent.com/Pp_aWGJzsuj_bYTZD-9k8z4cjDC-qYzNOPG6WTGWz6geRz4hDe7OCkOVvGVPmYRsvA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.4,
    "reviews": 144439,
    "developer": "Lifesum",
    "developerId": "Lifesum",
    "developerEmail": "support@lifesum.com",
    "developerWebsite": "http://www.lifesum.com",
    "developerAddress": "Lifesum AB\nKlarabergsviadukten 90\nBox 162\n101 23 Stockholm\nSweden",
    "updated": "February 27, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Diet plan, food diary, calorie counter & healthy recipes, all in one convenient place. Reach your weight loss goals with food tracker Lifesum!Keto diet, low carb or high protein? We’ll help you find a diet plan best suited to you. Need a health tracker to keep you going? Fear not. We’ve got an intuitive food diary, macro calculator & diet tips to give you a helping hand.Food planner & macro tracker - TOP Lifesum features: ●\tDiet plan & diet tips for any goal - lose weight & eat healthy●\tCalorie counter & food tracker with barcode scanner for easy logging●\tMacro calculator - see your daily macros, nutrition & calories●\tMeal planner - eat healthy food from delicious recipes for any plan●\tHealth tracker - stay on top of your fitness & healthWEIGHT LOSS & DIET PLANLose weight with your personal diet plan. Take our test to discover which food planner is the right one for you. From keto diet to low carb and everything in between, we have the right plan & diet tips for your weight loss goals.RECIPES & MEAL PLANNERHealthy recipes help you stick to your plan. Stuck in a keto diet rut? Explore keto recipes to beat the sugar cravings or search keto recipes for snacks to eat. Can’t decide what to eat? Check out the meal planner for ideas. HEALTH TRACKER & FOOD PLANNERCalorie counter & food tracker functions help you see your daily nutritional values at a glance. Did a workout today? Go premium & sync Lifesum with FitBit, Runkeeper, Moves and other fitness apps. FOOD DIARY & MACRO TRACKERMacros mythbusting. It’s easy with our macro tracker - make sure you reach the right type of energy composition with the macro calculator. Simply scan barcodes for macros and nutritional information, or enter manually. Discover how tracking small habits can make a big difference & join millions on their journey to a healthier, happier you.*Editors' Choice 2016**Top Developer 2016**Android Excellence Apps 2017*Download Lifesum now and get healthier today! You also get daily feedback to keep you in the right mindset and help you lose weight. Lifesum integrates with Google Fit and S Health, so you can export nutrition and exercise data from Lifesum to Google Fit and S Health, and import fitness data and weight and body measurements back to Lifesum.For extended features such as specialized diets and detailed nutrition information, and to sync with fitness apps such as Moves, Nokia Health, FitBit, Jawbone, Endomondo and Runkeeper, get the Lifesum Premium membership.http://api.lifesum.com/mobile-terms",
    "descriptionHTML": "Diet plan, food diary, calorie counter &amp; healthy recipes, all in one convenient place. Reach your weight loss goals with food tracker Lifesum!<br><br>Keto diet, low carb or high protein? We&#x2019;ll help you find a diet plan best suited to you. Need a health tracker to keep you going? Fear not. We&#x2019;ve got an intuitive food diary, macro calculator &amp; diet tips to give you a helping hand.<br><br>Food planner &amp; macro tracker - TOP Lifesum features: <br>&#x25CF;\tDiet plan &amp; diet tips for any goal - lose weight &amp; eat healthy<br>&#x25CF;\tCalorie counter &amp; food tracker with barcode scanner for easy logging<br>&#x25CF;\tMacro calculator - see your daily macros, nutrition &amp; calories<br>&#x25CF;\tMeal planner - eat healthy food from delicious recipes for any plan<br>&#x25CF;\tHealth tracker - stay on top of your fitness &amp; health<br><br>WEIGHT LOSS &amp; DIET PLAN<br>Lose weight with your personal diet plan. Take our test to discover which food planner is the right one for you. From keto diet to low carb and everything in between, we have the right plan &amp; diet tips for your weight loss goals.<br><br>RECIPES &amp; MEAL PLANNER<br>Healthy recipes help you stick to your plan. Stuck in a keto diet rut? Explore keto recipes to beat the sugar cravings or search keto recipes for snacks to eat. Can&#x2019;t decide what to eat? Check out the meal planner for ideas. <br><br>HEALTH TRACKER &amp; FOOD PLANNER<br>Calorie counter &amp; food tracker functions help you see your daily nutritional values at a glance. Did a workout today? Go premium &amp; sync Lifesum with FitBit, Runkeeper, Moves and other fitness apps. <br><br>FOOD DIARY &amp; MACRO TRACKER<br>Macros mythbusting. It&#x2019;s easy with our macro tracker - make sure you reach the right type of energy composition with the macro calculator. Simply scan barcodes for macros and nutritional information, or enter manually. <br><br>Discover how tracking small habits can make a big difference &amp; join millions on their journey to a healthier, happier you.<br><br>*Editors&apos; Choice 2016*<br>*Top Developer 2016*<br>*Android Excellence Apps 2017*<br><br>Download Lifesum now and get healthier today! You also get daily feedback to keep you in the right mindset and help you lose weight. <br><br>Lifesum integrates with Google Fit and S Health, so you can export nutrition and exercise data from Lifesum to Google Fit and S Health, and import fitness data and weight and body measurements back to Lifesum.<br><br>For extended features such as specialized diets and detailed nutrition information, and to sync with fitness apps such as Moves, Nokia Health, FitBit, Jawbone, Endomondo and Runkeeper, get the Lifesum Premium membership.<br><br>http://api.lifesum.com/mobile-terms",
    "histogram": {
        "1": 5147,
        "2": 2864,
        "3": 7936,
        "4": 39048,
        "5": 89444
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/zw9DhhmyPBNgNs840QeEDQMVVtfLsCv71wkEpe-SX5Lr2V7c17dj93Sb0j6sJ6KLpXA=h310",
        "//lh3.googleusercontent.com/K0MVzQV6mqpfvBv9Rwi0JxWEzfokMz3c9v2nqgJfl0ztKVPzyrMyxeg0sfAsc0VaCKk=h310",
        "//lh3.googleusercontent.com/Rxd69IlgyBNVyG9eXTEi5jaNh2PGFjhUo1tpbjPsFGzNw7ErAM1RX80XFOYwYPN_t4Mq=h310",
        "//lh3.googleusercontent.com/lugkyCRe5DWlfQniAWsfn8FwJLLnxWih7qhaTDNM5utN-udRyYwQwm9MWAVvQxcmVH-p=h310",
        "//lh3.googleusercontent.com/DZu1waE6v2MDIxGefDueu3xy_cjh_6jOcrTBnXCnbtBbppqlFerZIKPmagAMWtdljHJ6=h310",
        "//lh3.googleusercontent.com/Kk93sldZdJpeL0YIQgOAZUiMaXQhNYrdNOpobWjt3fLJWOGODxz2pKnyRTAZTiuYgg=h310",
        "//lh3.googleusercontent.com/eliDaQp-jpG-8O3RzmEmVYM0GcGPoZWRq6BXIk-diy-IYAIm50ofJ2ag8aSALBa6posR=h310",
        "//lh3.googleusercontent.com/_gxS7AKLrD70s3VqYPJA-zbC7VLY4ep43VY3skk1xwDkhB0MzBuwFobCP1obuKYoDYyO=h310",
        "//lh3.googleusercontent.com/iMH-qmxKMP1oKvJrFTo46UkJNRndKy0J6VnEyL7_0I2Aa-KNVnnKgZK-SZdzazxIhbwz=h310",
        "//lh3.googleusercontent.com/ccRRMLXrxIZNY-nRDbSeYU4yyU5BYyU72ey8BV6-AxPiNxdRu5gGfcq8ogojCwnYS3Uv=h310",
        "//lh3.googleusercontent.com/YzVfz_mNL1fiT-kfHTnOUWEgtlJ6en4vvfkkxHgjOWFNsw1N5mGcHRH64J184QFdai4=h310",
        "//lh3.googleusercontent.com/MpIbPgSqaBcCeMt3T31Di_Uw3fXW5phNC1Y2Q4_kYRSknl91OI2Tz52sG9aW5OIUa3o=h310",
        "//lh3.googleusercontent.com/pcxT5gsjjdtOs_1vD3vQrEFyZD9njb5do_tRFus1e7QTzCSRhMwcY1xfcfakm4b1CTkp=h310",
        "//lh3.googleusercontent.com/RsrxxaC3aTd5oBvfXEWTCARc6NhRnkBj4R40T65yLzP3RpaQEeNMDKrNxYAWnNvgjA=h310",
        "//lh3.googleusercontent.com/IAE9-a4u2WEjkOXgtn7Lcx0ogFL2GGUam6plIF5S7RBXYu-Bi9gOdTKeKmT-_Sgl3mM=h310"
    ],
    "comments": [
        "Great app. The only issue I have had is some on the foods I scan show up with improper Marco counts. But other that that I cant track the calories pretty close and my exercise very well. The app allows you to really focus on other stuff while it keeps focused on informing you when you need more food or more fat or more carbs or protein. Thank you life sum...",
        "I like this app but I think the work out section is too simplified. For example: I worked out on the treadmill for 30 minutes, going 3.5mph on average, and a total distance of 1.6 miles. But, when you search treadmill on he app to add your work out, it just asks for the time spent on the treadmill, but distance is just as important. I love every other aspect but I'm not sure how to keep track or how many calories I am truly burning on my work outs",
        "Slightly disappointed. I chose to pay for premium after selecting to do the 3 week challenge. I wanted to start with that to change up my habits, but after I paid it took that option away and selected the keto strict option. Now it won't even give me the option for the 3 week challenge and I feel I just wasted a bunch of money.",
        "great app however I think your premium is lacking for it's price. A few things I would like you to add are: •vitamin tracking and information  •More of a social aspect like Samsung health has •Cost information on foods and diet plans  •More customisation in terms of the colour of charts and maybe add some themes",
        "Great interface overall, easy to add foods. Database is large enough I haven't encountered any issues.   *Edit* a bit challenging to fix incorrect calories or info on food, have found a few more errors than when I first rated. Social tab is sorta worthless as it just reposts your foods which isn't really appealing. Notifications are encouraging and great though I wish you could edit time for regular meals as I'm a late riser and it always asks about lunch when I get up . Water tracking is great and adaptive with exercise. *edit*",
        "I ABSOLUTELY AM IN LOVE WITH THIS!!! It's easy, fun, and helpful! Out of all 7 apps I downloaded this is the BEST!!! O habe one problem thought I don't know where the diary is..so that's my only problem with this app! Amazing 10/10!!  😍😆😋"
    ],
    "recentChanges": [
        "We've done some work on the diary to give you more insights into your health journey. Now there's more details, more graphs, more colors, and it shows what diet plan you're on. In short, it's more you.",
        "We hope you'll like it! If you have any questions, please drop us a line: contact@lifesum.com",
        "Stay golden!",
        "Lifesum crew"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sillens.shapeupclub&hl=en&gl=us",
    "appId": "com.sillens.shapeupclub"
}