{
    "title": "Lowe's",
    "summary": "Shop, read reviews, access your MyLowe’s account, find savings &amp; locate stores.",
    "icon": "//lh3.googleusercontent.com/HHuucfK99kudKljkoIlyzBuCEIEhS7hL3JOq75wSYFzEh74Bc6oD5ch-SUZaqJ4JbgA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4,
    "reviews": 15669,
    "developer": "Lowe's Companies Inc.",
    "developerId": "Lowe's+Companies+Inc.",
    "developerEmail": "customercare@lowes.com",
    "developerWebsite": "http://www.lowes.com",
    "updated": "February 5, 2018",
    "version": "Varies with device",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "size": "Varies with device",
    "description": "LOWE'S HAS REINVENTED ITS ANDROID POWER TOOL!Get more done on your next DIY or home improvement project with the totally redesigned app for Lowe’s – your best shopping companion.•\tNow with bigger and better product image galleries including zoom, video, annotated images, and 360-degree spins.•\tDo your shopping from home - browse an endless aisle of products, or limit your search to items currently available in-store for pick-up or immediate delivery.•\tPick up where you left off with recently viewed items and smart search history.•\tNo more paper receipts. Just scan your digital MyLowe’s card at checkout and see your purchase history right on the phone.•\tCheck for deals and discounts anytime with the always-current weekly ad.* Be sure to allow location services to get the best Lowe’s app experience. This will help you locate your local store and offer the most accurate inventory, in-store product locations and pricing.FIND WHAT YOU NEED IN THE STORE – FAST•\tCheck the “In-Stock” button to display items available now at your local store.•\tGet aisle information right in the search results and then tap to open a store map with pinpoint accuracy.•\tNeed it now, but it’s not in stock at your store? Just tap “Other Stores” to check inventory at nearby Lowe’s locations.VIEW YOUR WEEKLY AD•\tSee what home improvement products are on sale now at your local Lowe’s.•\tView by flyer page or by department to find savings for your next DIY or remodeling project.INSTANTLY ADD ITEMS TO YOUR SHOPPING LIST•\tTap the heart on any product to add it to your Quick List.  With your app as a shopping companion you’ll never forget what you need for your next home improvement project.•\tAdd products, departments, or notes to your Quick List to keep things top of mind while shopping.•\tAdd products from the app or scan them in-store — from tools to appliances and more.•\tNo sign-in required.ANDROID WEAR SUPPORT•\tAccess your Quick List from your Android Wear device. Simply raise your wrist and say “OK Google, start Quick List.”•\tNow your saved lists, store map and product aisle locations are just a glance away.CUSTOM WIDGETS•\tSave your Quick List and MyLowe’s card to your phone screen using the widget and never have to open the app for shopping or checkout.•\tTo add a widget, long press on your device’s home screen and select “Widgets.” Scroll through the list to find the Lowe’s Widgets and select the placement location.VIEW CUSTOMER RATINGS AND REVIEWS•\tSee what everyone else is saying about our tools, appliances, DIY supplies and more before you buy.•\tGet the inside scoop on our home improvement products and see how others use them to accomplish their DIY and remodeling dreams.MAKE MYLOWE’S WORK FOR YOU•\tNever lose a receipt again with MyLowe’s purchase history – just show your card at checkout (a digital version is available in the app) or enter previous purchases by scanning the receipt barcode.•\tAdd Quick List items to your MyLowe’s lists and they’ll be available from any device when you log into your MyLowe’s account.•\tGet timely reminders for recurring purchases when you tell MyLowe’s to keep track.",
    "descriptionHTML": "LOWE&apos;S HAS REINVENTED ITS ANDROID POWER TOOL!<br><br>Get more done on your next DIY or home improvement project with the totally redesigned app for Lowe&#x2019;s &#x2013; your best shopping companion.<br><br>&#x2022;\tNow with bigger and better product image galleries including zoom, video, annotated images, and 360-degree spins.<br>&#x2022;\tDo your shopping from home - browse an endless aisle of products, or limit your search to items currently available in-store for pick-up or immediate delivery.<br>&#x2022;\tPick up where you left off with recently viewed items and smart search history.<br>&#x2022;\tNo more paper receipts. Just scan your digital MyLowe&#x2019;s card at checkout and see your purchase history right on the phone.<br>&#x2022;\tCheck for deals and discounts anytime with the always-current weekly ad.<br><br>* Be sure to allow location services to get the best Lowe&#x2019;s app experience. This will help you locate your local store and offer the most accurate inventory, in-store product locations and pricing.<br><br><br>FIND WHAT YOU NEED IN THE STORE &#x2013; FAST<br>&#x2022;\tCheck the &#x201C;In-Stock&#x201D; button to display items available now at your local store.<br>&#x2022;\tGet aisle information right in the search results and then tap to open a store map with pinpoint accuracy.<br>&#x2022;\tNeed it now, but it&#x2019;s not in stock at your store? Just tap &#x201C;Other Stores&#x201D; to check inventory at nearby Lowe&#x2019;s locations.<br><br><br>VIEW YOUR WEEKLY AD<br>&#x2022;\tSee what home improvement products are on sale now at your local Lowe&#x2019;s.<br>&#x2022;\tView by flyer page or by department to find savings for your next DIY or remodeling project.<br><br><br>INSTANTLY ADD ITEMS TO YOUR SHOPPING LIST<br>&#x2022;\tTap the heart on any product to add it to your Quick List.  With your app as a shopping companion you&#x2019;ll never forget what you need for your next home improvement project.<br>&#x2022;\tAdd products, departments, or notes to your Quick List to keep things top of mind while shopping.<br>&#x2022;\tAdd products from the app or scan them in-store &#x2014; from tools to appliances and more.<br>&#x2022;\tNo sign-in required.<br><br><br>ANDROID WEAR SUPPORT<br>&#x2022;\tAccess your Quick List from your Android Wear device. Simply raise your wrist and say &#x201C;OK Google, start Quick List.&#x201D;<br>&#x2022;\tNow your saved lists, store map and product aisle locations are just a glance away.<br><br><br>CUSTOM WIDGETS<br>&#x2022;\tSave your Quick List and MyLowe&#x2019;s card to your phone screen using the widget and never have to open the app for shopping or checkout.<br>&#x2022;\tTo add a widget, long press on your device&#x2019;s home screen and select &#x201C;Widgets.&#x201D; Scroll through the list to find the Lowe&#x2019;s Widgets and select the placement location.<br><br><br>VIEW CUSTOMER RATINGS AND REVIEWS<br>&#x2022;\tSee what everyone else is saying about our tools, appliances, DIY supplies and more before you buy.<br>&#x2022;\tGet the inside scoop on our home improvement products and see how others use them to accomplish their DIY and remodeling dreams.<br><br><br>MAKE MYLOWE&#x2019;S WORK FOR YOU<br>&#x2022;\tNever lose a receipt again with MyLowe&#x2019;s purchase history &#x2013; just show your card at checkout (a digital version is available in the app) or enter previous purchases by scanning the receipt barcode.<br>&#x2022;\tAdd Quick List items to your MyLowe&#x2019;s lists and they&#x2019;ll be available from any device when you log into your MyLowe&#x2019;s account.<br>&#x2022;\tGet timely reminders for recurring purchases when you tell MyLowe&#x2019;s to keep track.",
    "histogram": {
        "1": 1512,
        "2": 811,
        "3": 1518,
        "4": 3502,
        "5": 8326
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/27hfqwiw2udbKWO_aLSWvzC2GJB-j558OYRQT4Gas8SpVWrJNPJ0UOHvFekxLCe8VaY=h310",
        "//lh3.googleusercontent.com/t1-btobbRfPzNY8ogDZ2EEbKpG8XKqADFu42Lq4LpbG09B1-Hnq3myNHWXtS1AIssas=h310",
        "//lh3.googleusercontent.com/R8e6Sy_6AfUTDls3Hp6E8yT73z1NMvvd9_RyBRrAOAYYrUgZBX1VP-hGlbDky5OtkJw=h310",
        "//lh3.googleusercontent.com/9GH1ekdp1JZ0WAPOj7hlaPZxEIqbl39ORpQZK74B8h5-UYB96DoBFtRvTg5v4BVohcM=h310",
        "//lh3.googleusercontent.com/H4coxI9wjTp95WT4vsI5xnMLSCJEK6C2GC28Xq9XTyp1OWZcmWNOmOJycpRHvtfq8w=h310",
        "//lh3.googleusercontent.com/HUd_O0wpqvEo1PRKh6cWgoA6LMPpwvTvyEK1vz7AqywNBWk1hiRnL4Sjupd6VO4haHML=h310",
        "//lh3.googleusercontent.com/K4CalKx8jJ1FZO4lj7RyNbX9--Cc4AJsjCknmouYVoz1-ef5oflEAKAyvdoWenr43g=h310",
        "//lh3.googleusercontent.com/VLw1Bdw4NJCRYCHs24IND0f8n53yfZ_Bk3yaEAqWhE1cdmzfP1cHBKAknR4fkur15ns=h310",
        "//lh3.googleusercontent.com/o6KZ57DxCEgtCwBjTDDk3Ev8inV5WCuAy-dH-X9o8Uf4y6CEWlhEDZcwMvaA8xFVFA=h310",
        "//lh3.googleusercontent.com/LPP0bBXajEWgl71VSbwnj5O54K2HTnFIcqYONUJzkZ5r4zZNUlBNTqEjhln5a6yq0Yc=h310",
        "//lh3.googleusercontent.com/H6gpCDpomijjjA8pD1Cpw4cWQ5pLLAbwlExdR-afg76Uv6SFeqFyaEmPsFtTYI3pyciX=h310",
        "//lh3.googleusercontent.com/8vg44KvyM7N1LCVir8RzRLnHMV-nEyuut0oP89BmOG2hAffD36fo6crjqoO303r1Yw=h310",
        "//lh3.googleusercontent.com/jL8RvbnSR2649zvoaj6LJn2yZ-1rjbGLZ05Il70mMcIeSDT94qrnGSYE-HyUXs8eNpIO=h310"
    ],
    "video": "https://www.youtube.com/embed/JPeouA6qoaY",
    "comments": [
        "Store map gone and store location feature more difficult to find but I found it!  1. Menu icon in upper left 2. My account  3. My Lowe's list 4. App quick list  ~Finally~ Ta Da!! The list with the aisle and bay number. Not always accurate but it's a place to start.  However still NO STORE MAP!  Lowe's is not the kind of place I go for a leisurely stroll.  I'm usually grabbing what I need quickly. I need app features to be convenient.  Much less helpful with out the map. Nice that the My Lowe's code is easy to access but not really sure what it does since I've been told by employees that I still need a receipt for returns and I'm not earning points or anything when I use it. So is it just a list of my purchases?",
        "Search is pretty bad (compared to home depot app for example).   While comparing to home depot app, store maps would be a great feature to add.   I've also encountered an annoying bug. Tried to order online via the app and the checkout button does not actually check out. No errors given. Just says \"verifying address\" then returns to the payment input page.",
        "This app is ok to check on stuff, but buying things from it is useless. I've tried twice and both times and my order was nowhere to be found. So much for free next day delivery because of the app, it will be here in three days. Go to stores and shop around its less hassle!!!",
        "App search is great. Love that I can find things easily. But I can't stand the login/password system. I entered my password and it said it was wrong. After multiple attempts I reset my password and entered my same password, but it said I already used it... I knew that was my password but it wouldn't let me continue to use it!",
        "I used to love this App, but all of a sudden it does not show product location anymore ie: aisle or bay product is in, and the map is also missing now. Store is to big for me to wander around looking for things. Disappointed",
        "Still *Unable to save to quick list *When viewing some products, the suggested products are cutoff at the bottom when scrolling down.  *My quick list should NEVER be deleted if I uninstall the app for troubleshooting. My online profile should remain untouched and be able to access quick list items online as well."
    ],
    "recentChanges": [
        "WEEKLY AD: Your local Lowe’s Weekly Ad is now viewable again within the app!",
        "UI Adjustments, Bug Fixes, and Performance Improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.lowes.android&hl=en&gl=us",
    "appId": "com.lowes.android"
}