{
    "title": "Golf GPS by SwingxSwing",
    "summary": "+ Scorecard, Stats &amp; Handicap",
    "icon": "//lh3.googleusercontent.com/xRCphP2m12rErR2TxdXk4MKBuJz8Sxrd5W5IFutxawQ5_cXfvpnWnVRuvXYaUP3b4yI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 34836,
    "developer": "Swing by Swing Golf GPS",
    "developerId": "Swing+by+Swing+Golf+GPS",
    "developerEmail": "support@swingbyswing.com",
    "developerWebsite": "http://www.swingbyswing.com",
    "developerAddress": "80 Statehouse Square #158\nHartford, Conn. 06123",
    "updated": "January 29, 2018",
    "version": "5.0.61",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "SwingxSwing is the top-performing, free golf GPS rangefinder & scorecard app in the world, with 4 million registered users around the globe!This is not a \"trial\" version with \"limited functionality\" -- it is FREE FOR LIFE and extremely accurate, reliable, and battery-efficient, rivaling any other golf GPS app or expensive golf GPS handheld or watch on the market!WHAT YOU GET WHEN YOU DOWNLOAD* GPS rangefinder that works on every course in the world with distance to center of green and every obstacle on the course* Digital scorecard that easily tracks your score & putts and automatically advances from hole-to-hole* Free handicap after posting scores for three rounds* On-the-course gaming including stroke play and skins gaming* Tee time booking with our integrated partner, TeeOff by PGA Tour, with NO booking fees* Personalized online account to enter past scores, share with your friends, and view recent scores, your path around the course, stats, graphs, uploaded photos and more* Apple Watch, Android Wear and Pebble integrations - beam distances from the app to your wrist and keep score and track shots too! WHY WE WERE THE MOST DOWNLOADED GPS APP IN THE WORLD IN 2016* Reliable and easy to use - one tap and you’re playing* Constantly improving with updates, new functionality, and new technology* Commitment to user satisfaction with quick, reliable customer service via email or web* 100% dedication by the developers who created the first version of the app years ago* Community-built course database: the app works on every course in the world, but if a course is not mapped for play, the user can add or edit it easily onlineOWN YOUR GAME AND UPGRADE TO LOOPERFor only $4.99 per month or $19.99 per year, you can upgrade to Looper, our on-the-course virtual caddie.  With additional technology and functionality, you can truly own your game with Looper, which includes the following stroke-saving features:* Real-time wind speed, elevation and “plays like” distance* Club tracking to measure distance for every club in your bag with club recommendations during your round* Improved distances to green with five distances across each green from front-to-back* Enhanced scorecards with score, putts, driver accuracy, bunker play, and penalty tracking* Additional on-the-course games with handicap-adjusted matches & competitions such as Stableford, Match Play, Nassau, and Syndicates* NEW Looper benefits from SwingxSwing’s premium partners like PGA TOUR Live, Carl’s Golfland, TeeOff by PGA TOUR, and Gary Gilchrist Golf Academy!  Annual subscribers will receive more than 3x their money back in coupons and benefits for subscribing!  Monthly subscribers who subscribe for 6 months or more also will be receive these new benefits! OTHER INFOPayment for in-app Looper subscriptions will be charged to your Google Play Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period. Your Google Play Account will be charged for renewal within 24 hours prior to the end of the current period. Subscriptions may be managed by you, and auto-renewal may be turned off by going to your Google Play Account Settings after purchase. No cancellation of the current subscription is allowed during an active subscription period. Any unused portion of a free trial period will be forfeited when you purchase a subscription.Please visit our website at http://www.swingbyswing.com for our Privacy Policy and Terms of Service.",
    "descriptionHTML": "SwingxSwing is the top-performing, free golf GPS rangefinder &amp; scorecard app in the world, with 4 million registered users around the globe!<br><br>This is not a &quot;trial&quot; version with &quot;limited functionality&quot; -- it is FREE FOR LIFE and extremely accurate, reliable, and battery-efficient, rivaling any other golf GPS app or expensive golf GPS handheld or watch on the market!<br><br>WHAT YOU GET WHEN YOU DOWNLOAD<br><br>* GPS rangefinder that works on every course in the world with distance to center of green and every obstacle on the course<br><br>* Digital scorecard that easily tracks your score &amp; putts and automatically advances from hole-to-hole<br><br>* Free handicap after posting scores for three rounds<br><br>* On-the-course gaming including stroke play and skins gaming<br><br>* Tee time booking with our integrated partner, TeeOff by PGA Tour, with NO booking fees<br><br>* Personalized online account to enter past scores, share with your friends, and view recent scores, your path around the course, stats, graphs, uploaded photos and more<br><br>* Apple Watch, Android Wear and Pebble integrations - beam distances from the app to your wrist and keep score and track shots too! <br><br><br>WHY WE WERE THE MOST DOWNLOADED GPS APP IN THE WORLD IN 2016<br><br>* Reliable and easy to use - one tap and you&#x2019;re playing<br><br>* Constantly improving with updates, new functionality, and new technology<br><br>* Commitment to user satisfaction with quick, reliable customer service via email or web<br><br>* 100% dedication by the developers who created the first version of the app years ago<br><br>* Community-built course database: the app works on every course in the world, but if a course is not mapped for play, the user can add or edit it easily online<br><br><br>OWN YOUR GAME AND UPGRADE TO LOOPER<br><br>For only $4.99 per month or $19.99 per year, you can upgrade to Looper, our on-the-course virtual caddie.  With additional technology and functionality, you can truly own your game with Looper, which includes the following stroke-saving features:<br><br>* Real-time wind speed, elevation and &#x201C;plays like&#x201D; distance<br><br>* Club tracking to measure distance for every club in your bag with club recommendations during your round<br><br>* Improved distances to green with five distances across each green from front-to-back<br><br>* Enhanced scorecards with score, putts, driver accuracy, bunker play, and penalty tracking<br><br>* Additional on-the-course games with handicap-adjusted matches &amp; competitions such as Stableford, Match Play, Nassau, and Syndicates<br><br>* NEW Looper benefits from SwingxSwing&#x2019;s premium partners like PGA TOUR Live, Carl&#x2019;s Golfland, TeeOff by PGA TOUR, and Gary Gilchrist Golf Academy!  Annual subscribers will receive more than 3x their money back in coupons and benefits for subscribing!  Monthly subscribers who subscribe for 6 months or more also will be receive these new benefits! <br><br><br>OTHER INFO<br><br>Payment for in-app Looper subscriptions will be charged to your Google Play Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period. Your Google Play Account will be charged for renewal within 24 hours prior to the end of the current period. Subscriptions may be managed by you, and auto-renewal may be turned off by going to your Google Play Account Settings after purchase. No cancellation of the current subscription is allowed during an active subscription period. Any unused portion of a free trial period will be forfeited when you purchase a subscription.<br><br>Please visit our website at http://www.swingbyswing.com for our Privacy Policy and Terms of Service.",
    "histogram": {
        "1": 721,
        "2": 377,
        "3": 1137,
        "4": 7807,
        "5": 24794
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/06Rt2uCOYd3170x1PCM5YhFBCY-hTX_mBWdn-Yvy4eja1N6VxBF4Y8Dna2ugXh3kNq5M=h310",
        "//lh3.googleusercontent.com/H-rma1TVqwZYQq8ljGbCz79V9UEGXIGhTUZ96TDVAdFo1CwZJW_FUeatjkVKp_YyLA=h310",
        "//lh3.googleusercontent.com/rxFL4iwV0DMesxV7Itvf-Fi-JdRdO7vRF_4bo1nOqbNbo3OgTQWqO0xVKZq-kQtfJA=h310",
        "//lh3.googleusercontent.com/992CyaZxQ9b-mabysBaU-nzHXiR-IELJlE1OmXcBKcJHYMX6ZxYl3cMvPv_w0SWVerc=h310",
        "//lh3.googleusercontent.com/C7sX0M-GRJbFVK5B4mHfF0gyucg_cWBrHeT1o_DC0Nrs0V-LZOCo2mfrNjDQgp1GjoI=h310",
        "//lh3.googleusercontent.com/e3uEo2K5zaSm7ux7alHSSAZZCUpwbv_K-uGLJiX2qOyNkAHZ2aggcSpjIR1vtxZa_g=h310",
        "//lh3.googleusercontent.com/v1O_Unutay8vKQM2FcmnqAd2eVZFBV10HXO4MR9Vk55myOSP_OUqs0GfwoWz5fYGXpE=h310",
        "//lh3.googleusercontent.com/B6jXHZCHegYVexG9VO9d9-xUyUD17Yzc2DHtjbp9bzFkt53O1OUKbxzVn-OKgClsyw=h310"
    ],
    "comments": [
        "Now I have had looper since it started and it's gone up to 20 dollars a year. Any thought being given to lifetime looper benefits? I would rather pay 100 one time than have to pay 20 per year. Even if it is a limited time offer. Looper is not necessary for a high handicapper but for a 10 or below it's a very useful tool. That guy who said it cut ten strokes wouldn't lie and I would love to play him for a looper membership.",
        "Great app, and its cheap to upgrade, you have so much information at the end of each round. Best golf GPS app by far. My only problem is ive upgraded phone and now i can't track my shots, please help. Sony Xperia XZ1.",
        "Love the score card feature and the stats that you get from it. The shot tracker is kind of a fun tool but is a little time consuming to use,  not overly so just more than i find really useful. The range finder is ok, not great.  EDIT: Cancelled my Looper subscription because it got too expensive. Also it kept asking for a review every time even though I'd left one. (dropped my score from 5 to 3 stars)",
        "Great app. Used it for first time. On 17th and 18th holes, it was telling me distance was in the 600 yard range. I don't know where they got that information but it was way way off!!",
        "My GPS has stopped working. Google maps tells me where I am and my other golf app. is correct but this app.l tells me I am not on the tee so distances are not shown. Why?????",
        "I love this app and when t hey get the tee time set up with more golf courses it will be even better but I don't think I will ever use another app"
    ],
    "recentChanges": [
        "* 5.0.60 - Removed expired Looper benefits",
        "* 5.0.55 - Crushing bugs which users have reported since mid December",
        "* 5.0.45 - Front and back of green distances are now displayed with center of green distance.  Check your course at http://swingbyswing.com to make sure it is fully mapped.",
        "* 5.0.41 - Android O compatibility + tweaks to distance data",
        "* 5.0.38 - Fix wonky secondary distance display",
        "* 5.0.36 - Small fix for NFC setup bugs."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.swingbyswing&hl=en&gl=us",
    "appId": "com.swingbyswing"
}