{
    "title": "Muzzley - Smart Home",
    "summary": "Create and Enjoy your Smart Home!",
    "icon": "//lh3.ggpht.com/R6dHHy6wQ1OH6mgwKKuu5mU6JLDRh3KgLD4vWJS0gqhTU2Kofp6bgU7MRuUFC9ETrH8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.9,
    "reviews": 712,
    "developer": "muzzley",
    "developerId": "muzzley",
    "developerEmail": "support@muzzley.com",
    "developerWebsite": "http://www.muzzley.com",
    "updated": "December 4, 2017",
    "version": "2.12.5",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Create and enjoy your Smart Home with Muzzley!Muzzley allows you to connect with and manage all your smart devices in the same app! Through a wifi or 4G connection, you can control them anytime, from anywhere!With our new behavioural intelligence feature, Muzzley is able to learn from you, suggesting useful use cases for your devices, as well as new devices for your home, helping you to create the perfect smart home! You don’t need to adjust to your home anymore… now your home adjusts to you! Create your own set of automation rules (we call them “Agents”) & connect your devices according to your needs, without even having to open the app! \tWhen you go to bed at night, do you want to turn on the alarm? EASY!\tWhen you come home, do you want your living room lights to turn on? CONSIDER IT DONE!\tWant to set your home’s thermostat to the right temperature right after you leave work? YOU GOT IT!With so many devices available, automation options and suggestions, Muzzley takes care of the boring tasks, making easy for you to enjoy your Smart Home.FEATURES* Wide range of compatible devices, including: Cloogy Power Plug, Wink Hub (Lights added through the Wink Hub: Hampton, Connected Cree, Commercial Electric, TCP LED, OSRAM, GE Link, Philips Hue ; Locks added through the Wink Hub: Kwikset, Schlage), Nest Thermostat, Nest Smoke Detector, Withings Scale, Koubachi Plant Sensor, Milight and Easybulb, TCP lighting, Rachio Iro Sprinkler, Insteon Hub V2 (model 2245-222), iHealth, Beurer, Misfit, FitBit, Jawbone, Lockitron, GreenIQ, Automatic, Egardia, LIFX* Behavioural based Suggestions* Shortcuts In-app with Widget feature* Home Automation* Security & Surveillance* Health Tracking* Manual/Remote Control* Location and Time based Agents, and much more!We are here to help! If you have any questions and/or suggestions, please email us at support@muzzley.com. We are always available for our users!",
    "descriptionHTML": "Create and enjoy your Smart Home with Muzzley!<br><br>Muzzley allows you to connect with and manage all your smart devices in the same app! Through a wifi or 4G connection, you can control them anytime, from anywhere!<br><br>With our new behavioural intelligence feature, Muzzley is able to learn from you, suggesting useful use cases for your devices, as well as new devices for your home, helping you to create the perfect smart home! You don&#x2019;t need to adjust to your home anymore&#x2026; now your home adjusts to you! <br><br>Create your own set of automation rules (we call them &#x201C;Agents&#x201D;) &amp; connect your devices according to your needs, without even having to open the app! <br><br>\tWhen you go to bed at night, do you want to turn on the alarm? EASY!<br><br>\tWhen you come home, do you want your living room lights to turn on? CONSIDER IT DONE!<br><br>\tWant to set your home&#x2019;s thermostat to the right temperature right after you leave work? YOU GOT IT!<br><br>With so many devices available, automation options and suggestions, Muzzley takes care of the boring tasks, making easy for you to enjoy your Smart Home.<br><br>FEATURES<br><br>* Wide range of compatible devices, including: Cloogy Power Plug, Wink Hub (Lights added through the Wink Hub: Hampton, Connected Cree, Commercial Electric, TCP LED, OSRAM, GE Link, Philips Hue ; Locks added through the Wink Hub: Kwikset, Schlage), Nest Thermostat, Nest Smoke Detector, Withings Scale, Koubachi Plant Sensor, Milight and Easybulb, TCP lighting, Rachio Iro Sprinkler, Insteon Hub V2 (model 2245-222), iHealth, Beurer, Misfit, FitBit, Jawbone, Lockitron, GreenIQ, Automatic, Egardia, LIFX<br>* Behavioural based Suggestions<br>* Shortcuts In-app with Widget feature<br>* Home Automation<br>* Security &amp; Surveillance<br>* Health Tracking<br>* Manual/Remote Control<br>* Location and Time based Agents, and much more!<br><br>We are here to help! If you have any questions and/or suggestions, please email us at support@muzzley.com. <br><br>We are always available for our users!",
    "histogram": {
        "1": 80,
        "2": 48,
        "3": 92,
        "4": 131,
        "5": 361
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ucEiS5Q1gwu5Ms0KmNIWTqGaHynXplNXPvIXBsVSYwXG_xdR7XZtJKQFf_Tp45Q22vIs=h310",
        "//lh3.googleusercontent.com/_Bi4okMHqm8GB7sqIFa37dqfw-YCk7-IUboJKP0miRSK5Qp-vigXy-DpdYEesHvQRvs=h310",
        "//lh3.googleusercontent.com/nN5ShQpGTOYJaOKS3HF_3dC4tOWatHh1yRjE7reu3hAoL4o-Yd66UXCJcfbJC9GACkku=h310",
        "//lh3.googleusercontent.com/ViBJVm1uguMcVygCbLe90NoVmH6-xFCTJ2AG2dHevBuTjphEflRcXaD1olm1buZaQ_Ik=h310",
        "//lh3.googleusercontent.com/G95dDw5VSDQdm93onodUr8_Pi4F0STn-EuA5kSb3mtaa315QGCyMRaYV4u_TORFv1Lc=h310"
    ],
    "comments": [
        "This app is actually very good. However I gave it 3 stars because it is missing smart home devices that should be there. For example. Nest is there but no camera set up. No August smart Lock. No voice assistant like Google home. No tp link etc. The app has so much potential if more devices are added. The interface is very nice. Add those devices and I would pay for the app if it was not free. But in meantime I've uninstalled. Will check in periodically.. keep up the good work",
        "Won't load if connected to WiFi.",
        "App won't even load. Spinning circle on white background.",
        "Happy that this seems to be the only system to work with an Egardia Alarm, however I successfully linked the app to the Egardia alarm  and set up some agents to notify me when the alarm is disabled or enabled at home, but sadly no notifications are generated when the alarm is toggled on/off  :-(",
        "Getting better and better and more device are being added.",
        "Add NouLins and Sonoff devices."
    ],
    "recentChanges": [
        "- Smart watch fix",
        "- Various other fixes for user reported issues",
        "We'd love to hear what you think of Muzzley! Just go to your User Profile, click on Feedback, and share your thoughts with us!</en-US>"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.muzzley&hl=en&gl=us",
    "appId": "com.muzzley"
}