{
    "title": "CommBank",
    "summary": "A secure and easy way to manage your money on the go",
    "icon": "//lh6.ggpht.com/4XCF6-CyKE-mEkZXF0vWWi3pjhPc3VgeRRQJg1JeuhnUzFte9yD8dshDF9GYjB1NIik=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.1,
    "reviews": 36547,
    "developer": "Commonwealth Bank of Australia",
    "developerId": "Commonwealth+Bank+of+Australia",
    "developerEmail": "mobilequestions@cba.com.au",
    "developerWebsite": "https://www.commbank.com.au/commbankapp",
    "developerAddress": "Commonwealth Bank Place,\n1 Harbour St,\nSydney NSW 2000",
    "updated": "February 15, 2018",
    "version": "Varies with device",
    "genre": "Finance",
    "genreId": "FINANCE",
    "size": "Varies with device",
    "description": "The CommBank app is Australia’s number 1 banking app with over 4 million users. CommBank brings you the best in mobile banking, giving you a secure and easy way to manage your money on the go. Top features• See your balance, access your accounts, transfer money and pay bills • Get cash without your card using Cardless Cash • Stay in control of your credit card using Transaction Notifications (not available if you have an additional cardholder) and Spend Tracker• Pay someone using a mobile number, account or BPAY® details• Make Tap & Pay purchases using a compatible NFC enabled phone (Android 4.4 or above)• Instantly activate, lock, cancel or replace a card and change your PIN• Store all your loyalty cards in one place • Easily send money overseas• Manage your credit card repayments, change your limit, lock payments or set a spending cap • Get a better view of your net worth by tracking your assets and liabilities• Open new accounts in minutes and apply for products and offers• Set a 4-digit PIN or log on with your fingerprint (compatible phones with Android 6.0+)• Use your Android watch to check balances, find your nearest ATM or make Cardless Cash withdrawals* To discover all the CommBank app features you’ll need to already bank with us or open an account.Don’t bank with us? You can open an account instantly when you get the app. 100% Security GuaranteeThe CommBank app is covered by our 100% Security Guarantee, which means we’ll cover any loss should someone make an unauthorised transaction on your account  using the app, provided you protect your phone and PIN and immediately notify us of their loss, theft or misuse, and of any suspicious activity on your accounts. If you’re on an Android Operating System below 6, before you can start using the app we’ll need access to a few permissions. We’ll need permissions for things like:• Contacts so you can pay to a mobile number• Location to help us find the nearest ATM • Camera so you can scan your loyalty cards• Phone status and identity to generate a phone ID• SMS so the app can read and auto-fill the NetCode we send to you during registrationTo use the app you’ll need a phone with Android OS 4.1 or above and have the language set to English & region to Australia. ® registered to BPAY Pty Ltd. ABN 69 079 137 518* The watch must be running Android Wear and be paired with an Android phone with Android 4.3 or aboveCommonwealth Bank of Australia ABN 48 123 123 124",
    "descriptionHTML": "The CommBank app is Australia&#x2019;s number 1 banking app with over 4 million users. <br><br>CommBank brings you the best in mobile banking, giving you a secure and easy way to manage your money on the go. <br><br>Top features<br>&#x2022; See your balance, access your accounts, transfer money and pay bills <br>&#x2022; Get cash without your card using Cardless Cash <br>&#x2022; Stay in control of your credit card using Transaction Notifications (not available if you have an additional cardholder) and Spend Tracker<br>&#x2022; Pay someone using a mobile number, account or BPAY&#xAE; details<br>&#x2022; Make Tap &amp; Pay purchases using a compatible NFC enabled phone (Android 4.4 or above)<br>&#x2022; Instantly activate, lock, cancel or replace a card and change your PIN<br>&#x2022; Store all your loyalty cards in one place <br>&#x2022; Easily send money overseas<br>&#x2022; Manage your credit card repayments, change your limit, lock payments or set a spending cap <br>&#x2022; Get a better view of your net worth by tracking your assets and liabilities<br>&#x2022; Open new accounts in minutes and apply for products and offers<br>&#x2022; Set a 4-digit PIN or log on with your fingerprint (compatible phones with Android 6.0+)<br>&#x2022; Use your Android watch to check balances, find your nearest ATM or make Cardless Cash withdrawals* <br><br>To discover all the CommBank app features you&#x2019;ll need to already bank with us or open an account.<br><br>Don&#x2019;t bank with us? You can open an account instantly when you get the app. <br><br>100% Security Guarantee<br>The CommBank app is covered by our 100% Security Guarantee, which means we&#x2019;ll cover any loss should someone make an unauthorised transaction on your account  using the app, provided you protect your phone and PIN and immediately notify us of their loss, theft or misuse, and of any suspicious activity on your accounts. <br><br>If you&#x2019;re on an Android Operating System below 6, before you can start using the app we&#x2019;ll need access to a few permissions. We&#x2019;ll need permissions for things like:<br>&#x2022; Contacts so you can pay to a mobile number<br>&#x2022; Location to help us find the nearest ATM <br>&#x2022; Camera so you can scan your loyalty cards<br>&#x2022; Phone status and identity to generate a phone ID<br>&#x2022; SMS so the app can read and auto-fill the NetCode we send to you during registration<br><br>To use the app you&#x2019;ll need a phone with Android OS 4.1 or above and have the language set to English &amp; region to Australia. <br><br>&#xAE; registered to BPAY Pty Ltd. ABN 69 079 137 518<br><br>* The watch must be running Android Wear and be paired with an Android phone with Android 4.3 or above<br><br>Commonwealth Bank of Australia ABN 48 123 123 124",
    "histogram": {
        "1": 4154,
        "2": 1554,
        "3": 2671,
        "4": 6702,
        "5": 21466
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/lnBQGzi4JRC1nOu_WAXx8tFG2heZFN-j2Ov20SRR4NljC8HGP_wbCEGfL1LoL5t9sQ=h310",
        "//lh3.googleusercontent.com/L1FHxyymZKJF6BY7sZd7nMwRT7P1L4dtJNSfqXK0Mw5R8vtcHuRgoY_TdIOueJ3sdg=h310",
        "//lh3.googleusercontent.com/vNj-3t-yHqnynPhiD_35MTfEFm91SyMOfMqZuM4ipP1ujxRPnwrWSutqaalDGBueHpU=h310",
        "//lh3.googleusercontent.com/R8TBMwwZu-l2ek1RBoUAePX5p3a3e-Wn1l5hwxt4dHFCESo9VLUDEerXnBo8fliw4w=h310",
        "//lh3.googleusercontent.com/3nOWwTIye8p2GUSTI_J6hSNXBOObgiy2UyJvH3v4UiKCaS_z49g3e9jRf6tuvyusaQy9=h310",
        "//lh3.googleusercontent.com/KzmDbqGwoIoOCZEQHNk4CMHy2Nm3vkqmLl6-ZJUuDtcIhAzCpFLTOWucL-uqwomMfg=h310",
        "//lh3.googleusercontent.com/3OOzTzO9n4UgeejVKrg0wzR8Ajdfxw-mpP0nRWDHtAxzQUSt9XRZkSrV032-0TDDZn4=h310"
    ],
    "comments": [
        "I have been a member with commonwealth for a long time & I use this app alot. It's easy-to-use & track money. It be very nice if the commbank youthsaver app was able to be used on samsung mobile/tablet not just apple, so my child can keep track of her dollarmites account she has with her school 😟",
        "Pretty great app. But can still be improved upon. You should still be able to logon without an internet connection. Set it up so that it still shows up your money and have the app update every hour. That way when your in an emergency situation and have no internet you can still see how much you had recently",
        "Solid banking app and the best I've used among the big banks. Tap & pay works well. Only small niggle is that a recent update changed the icon to an adaptive one that is just the old logo in a square now also in a white circle, looks a bit lazy and ugly.",
        "Hi CBA, the new spending tracker is a great feature, eliminates the need to use a seperate tracking app. One feedback would be to have credit expenses track against the actual date the expense was incurred instead of when it clears. Thanks!",
        "Worked fine until the stupid girl in one of the branches recommended I reinstall it. Only then did I find out I can't use the app any more because I have a net code token. Train your staff  to get it right cba. Now the app is junk because I can't log in without ditching the security token.",
        "I DID work on my S8+ but after an update 2 weeks ago it hasn't work since... i have reinstalled and restarted my phone... eftpos machine says invalid transaction... before this it was an awesome app"
    ],
    "recentChanges": [
        "Quickly split & share expenses with your friends",
        "Improved fingerprint log on for Galaxy Note8",
        "Minor enhancements & bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.commbank.netbank&hl=en&gl=us",
    "appId": "com.commbank.netbank"
}