{
    "title": "Exact Online",
    "summary": "Your online business software",
    "icon": "//lh5.ggpht.com/NqzoZmPRYc5d-JIyBqUy6Uy6ueWOhV5VHLufSYzovOTIpLLTGx1ROJMDxfEQznpiDL0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.7,
    "reviews": 158,
    "developer": "Exact",
    "developerId": "Exact",
    "developerEmail": "info@exactonline.nl",
    "developerWebsite": "http://www.exactonline.com",
    "updated": "January 17, 2018",
    "version": "5.14.0",
    "genre": "Business",
    "genreId": "BUSINESS",
    "description": "Exact Online Wholesale Distribution and Exact Online Manufacturing are cloud-based software solutions for small to mid-sized businesses. Now with Exact Online for Android, you’ll enjoy even more value from your subscription with your key customer information and sales data at hand anywhere, anytime. Convenience & Insight•\tManage all sales processes and customer interactions on the fly•\tInstantly view and report on inventory and stock availability •\tKeep your remote staff in tune with up to the moment business conditions•\tInteract with vendor data for instant quotes•\tQuote and place orders on the roadRequirementsIn order to use Exact Online for Android, you require an Exact Online subscription. Visit www.exactonline.com for more information and sign up for a free trial.We’d love to hear your feedback on Exact Online for Android. Do you have questions, comments or problems? Send an email to info@exactonline.com",
    "descriptionHTML": "Exact Online Wholesale Distribution and Exact Online Manufacturing are cloud-based software solutions for small to mid-sized businesses. Now with Exact Online for Android, you&#x2019;ll enjoy even more value from your subscription with your key customer information and sales data at hand anywhere, anytime. <br><br>Convenience &amp; Insight<br>&#x2022;\tManage all sales processes and customer interactions on the fly<br>&#x2022;\tInstantly view and report on inventory and stock availability <br>&#x2022;\tKeep your remote staff in tune with up to the moment business conditions<br>&#x2022;\tInteract with vendor data for instant quotes<br>&#x2022;\tQuote and place orders on the road<br><br>Requirements<br>In order to use Exact Online for Android, you require an Exact Online subscription. Visit www.exactonline.com for more information and sign up for a free trial.<br>We&#x2019;d love to hear your feedback on Exact Online for Android. Do you have questions, comments or problems? Send an email to info@exactonline.com",
    "histogram": {
        "1": 26,
        "2": 14,
        "3": 20,
        "4": 24,
        "5": 74
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/BMapfvxxEaY2HBOSjPdeKgR1Nm9VUWAwse9C1OOq5bqDCa1atAs-mLR0aJFut5W-ih1i=h310",
        "//lh3.googleusercontent.com/CdWABidgAmMjkk2M-hUdvHgjhddLdltrAfxT9d5ZtyvcFtdbs14zhUrC0koyFqSKfA=h310",
        "//lh3.googleusercontent.com/Mn4g4nsOqZsIbVGFeniuJ0tJ-qvLZxas9RLWz-pxLUw0JiraXWQDi9f3m9fbRXBWxVU=h310",
        "//lh3.googleusercontent.com/NTWpO03EHemQHnz6atDZ5gnM8N2_x2Ddaaj8UxjA86GbPb6k2yB2npertx15I7VPDQ=h310",
        "//lh3.googleusercontent.com/3aGJx0TJBFnOVFKYAm7CybdaYCMd1Ah6D6soFnZUi8FVQIWN5o9-99hKJa7Z8KaI6pA=h310",
        "//lh3.googleusercontent.com/RUKnTBuPRCQ1h4d_cDKzzm5jSBCmblxzjWoD9_8mpkxD4a0ECt9psKsu847wLv6oH_BK=h310"
    ],
    "video": "https://www.youtube.com/embed/krf3Tb6VMQ0",
    "comments": [
        "Hele app toont een wit scherm na het inloggen",
        "Exact is niet voor dummies Zelden een app gezien die zo weinig rekening houdt met non-boekhouders.",
        "Mooie app, blij dat het nu ook voor Android beschikbaar is!",
        "You're great",
        "Good"
    ],
    "recentChanges": [
        "Some bug fixes related to:",
        "* Crash when uploading expenses",
        "* Service activity was displayed as Other at the list",
        "* More option at total outstanding items overview does not retrieve all data (same data is displayed)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.exact&hl=en&gl=us",
    "appId": "com.exact"
}