{
    "title": "Agenday Smart Calendar",
    "summary": "Mobile Conference Call and One-touch Dialing tool",
    "icon": "//lh3.googleusercontent.com/orb6u1Cwew2ACIAGU9sV4ypXlyzkH-jrXE8ICIpO-TMQyQ8O1iP4r4ukiT2Wc6dug1WV=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.2,
    "reviews": 262,
    "developer": "Premiere Global Services, Inc.",
    "developerId": "4683993447113685820",
    "developerEmail": "help@agenday.com",
    "developerWebsite": "http://www.agenday.com",
    "developerAddress": "2300 Lakeview Parkway, Suite 300. Alpharetta, GA",
    "updated": "July 14, 2017",
    "version": "3.3",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Agenday enables you to join your mobile conference call with one touch.  The smart business calendar app integrates with your calendar and contacts, giving you meeting notifications, useful content and allows you to easily connect to any web of audio conference call with just one touch. Download Agenday today for free. Features:•Easy One-Touch Mobile Conference Call Dialing: Say goodbye to ever-changing dial-in numbers and long passcodes. Agenday automatically pulls the details of your web meeting or audio conference call. With just one touch you enter the meeting.•Free/Busy Polling: Send up to five date and time options to invitees, monitor their responses and schedule events for the date and time that works best for everyone. Agenday sends you an alert when everyone has responded. After all invitees weigh in on scheduling options, send the invite with a single tap. •People profiles: See relevant information about the people you’re meeting with. Also, take action: contact them quickly via email or text, or schedule a meeting on the fly.•All Your Meetings in One Place: Agenday presents all of your calendar items in a clean, simple interface. It works with Outlook, iCal and other common calendars so you’ll never miss a conference or meeting.•Lower Cost Conference Calls: Spending too much on conference calls? Agenday saves you and your company money by automatically choosing the lowest-cost dialing option based on your location.•Schedule your Meetings: Agenday lets you schedule meetings right from the app. You can also cancel and reschedule them if you need to. •Useful Information: Agenday gets to know you and serves up useful information to help throughout your day.  Everything from local weather to presentation tips. •Messaging to Meeting Attendees: Running late to your conference call? With one touch, Agenday will send smart messaging to attendees letting them know your status. •Meet Now: Quickly and easily orchestrate meetings and calls on the fly.•Turn-by-Turn Directions: If you’re driving to your meeting, the app will give you turn-by-turn directions to get to your location. • Agenday for Android Wear:  Choose between two custom Agenday watch faces — one showing your free vs. booked time, or show the Agenday weather watch face. Also, send a running-late message to meeting attendees right from your wrist.Agenday now also offers an Enterprise version featuring a host of premium features, including custom content shown right in the agenda list, group calling features, easy web-based dashboard control of subscribers and premium support. Learn more at www.agenday.com/enterprise.The Agenday app is developed by PGi, a leading global provider of web conferencing and collaboration software and services for over 20 years.*** Platinum Award Winner of Best Mobile Calendar 2014 – Best Mobile App Awards ****** Winner of a 2014 Good Design Award from the Chicago Athenaeum Museum of Architecture and Design ******Winner of the first-ever 2015 Appy Award for Wearables",
    "descriptionHTML": "Agenday enables you to join your mobile conference call with one touch.  The smart business calendar app integrates with your calendar and contacts, giving you meeting notifications, useful content and allows you to easily connect to any web of audio conference call with just one touch. <br><br>Download Agenday today for free. <br>Features:<br><br>&#x2022;Easy One-Touch Mobile Conference Call Dialing: Say goodbye to ever-changing dial-in numbers and long passcodes. Agenday automatically pulls the details of your web meeting or audio conference call. With just one touch you enter the meeting.<br><br>&#x2022;Free/Busy Polling: Send up to five date and time options to invitees, monitor their responses and schedule events for the date and time that works best for everyone. Agenday sends you an alert when everyone has responded. After all invitees weigh in on scheduling options, send the invite with a single tap. <br><br>&#x2022;People profiles: See relevant information about the people you&#x2019;re meeting with. Also, take action: contact them quickly via email or text, or schedule a meeting on the fly.<br><br>&#x2022;All Your Meetings in One Place: Agenday presents all of your calendar items in a clean, simple interface. It works with Outlook, iCal and other common calendars so you&#x2019;ll never miss a conference or meeting.<br><br>&#x2022;Lower Cost Conference Calls: Spending too much on conference calls? Agenday saves you and your company money by automatically choosing the lowest-cost dialing option based on your location.<br><br>&#x2022;Schedule your Meetings: Agenday lets you schedule meetings right from the app. You can also cancel and reschedule them if you need to. <br><br>&#x2022;Useful Information: Agenday gets to know you and serves up useful information to help throughout your day.  Everything from local weather to presentation tips. <br><br>&#x2022;Messaging to Meeting Attendees: Running late to your conference call? With one touch, Agenday will send smart messaging to attendees letting them know your status. <br><br>&#x2022;Meet Now: Quickly and easily orchestrate meetings and calls on the fly.<br><br>&#x2022;Turn-by-Turn Directions: If you&#x2019;re driving to your meeting, the app will give you turn-by-turn directions to get to your location. <br><br>&#x2022; Agenday for Android Wear:  Choose between two custom Agenday watch faces &#x2014; one showing your free vs. booked time, or show the Agenday weather watch face. Also, send a running-late message to meeting attendees right from your wrist.<br><br>Agenday now also offers an Enterprise version featuring a host of premium features, including custom content shown right in the agenda list, group calling features, easy web-based dashboard control of subscribers and premium support. Learn more at www.agenday.com/enterprise.<br><br>The Agenday app is developed by PGi, a leading global provider of web conferencing and collaboration software and services for over 20 years.<br><br>*** Platinum Award Winner of Best Mobile Calendar 2014 &#x2013; Best Mobile App Awards ***<br>*** Winner of a 2014 Good Design Award from the Chicago Athenaeum Museum of Architecture and Design ***<br>***Winner of the first-ever 2015 Appy Award for Wearables",
    "histogram": {
        "1": 13,
        "2": 17,
        "3": 22,
        "4": 51,
        "5": 159
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/2vOWyG_95napHe1VRH1rpd907p-diJxZTQsrRmVFkcF21TXg73iV_DtgjUOY11h_wd6j=h310",
        "//lh3.googleusercontent.com/2x9Ub_snXAGTTkzhw69LWMYdHiO5zYckZUMKJMyz8VFpt11sMMLuTMGWJMs16ZHIU2o=h310",
        "//lh3.googleusercontent.com/xpmCHiZx_S3t7d9F1zRE22s9Ae2OJzv7CdxeIvgIXaJ884qzUSyowGUfwlBr_0-mjjk=h310",
        "//lh3.googleusercontent.com/ijM7GpkUY1ODGHQ9qiYPislbTpfjof8EtEZJn6KhPs2nQSPtsApmznUIttqDBa-t=h310",
        "//lh3.googleusercontent.com/NJFjAOwvA1MdNMEP1Pg_5_zoiTUy7xeyxlOWDbeiAQyg6X935BQYYQZ3vB3LiHFZtA=h310",
        "//lh3.googleusercontent.com/XfFXjtLJOOp5IRt5xNcOCOcwqqLxNcwgadFhS4BUcjhY-l_gjF9CU6HyvDLm9z4-kMc=h310",
        "//lh3.googleusercontent.com/bxezhi6E_rkfeE-B7Wj7HUlXoFsoaSF10Hxbl_DSSxwJedUjMAZBfYNzz2JWAlqvlg=h310",
        "//lh3.googleusercontent.com/537g60HGVLtb_1oVLsN8CU7jDWzkgXX_5BTVQc9hQ2uhsil-7W6geBmODCDEvvPv2Fk=h310",
        "//lh3.googleusercontent.com/KWC2RpXNfMJDBccsnfFgr01YRt92dxn-NY2tP9TeG944stNHjvIId0mR8yDSN9kja9E3=h310",
        "//lh3.googleusercontent.com/-Q7rUilqCOUvTMNUEXWAoZ8_z-yuEMLOokgV8dAysfMQDAjA68J4ZY0UzJDyd46x1iDF=h310",
        "//lh3.googleusercontent.com/BDSEzbtTggEk7jhtet5Tb9zvtRRFTUmgkUUBV3dGuG8qVSRLfisqbz1cA3UeDl87mg=h310"
    ],
    "comments": [
        "Nice looking app.  Doesn't play well if you are using a Calendar/Email app that is not the phone's default.  Use it mostly for setting up conference calls and web meetings.",
        "Saves time and money while keeping you on track!!",
        "So far think this will be a great tool!",
        "Great application that removes the pain of dialing in to conference calls.  1 touch dialing and an editor to choose the correct numbers when the calendar invite has multiple listed.",
        "Great app for conference call management.",
        "Great app for mobile conference calls! So easy to use for calls-keeps track of all appointments, call in numbers, locations. Can help sync personal and business appointments to keep my calendar straight."
    ],
    "recentChanges": [
        "Improvements",
        "- The schedule event feature now offers improved usability when changing the default calendar",
        "Bug Fixes",
        "- Fixed an issue where Skype® for Business icon was not appearing for Microsoft® Exchange Online users",
        "Please write to us at help@agenday.com with suggestions on making the iMeet Agenday experience better."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pgi.agenday&hl=en&gl=us",
    "appId": "com.pgi.agenday"
}