{
    "title": "AccuWeather Platinum",
    "summary": "Get Ad free weather forecast, temperature, snow alerts, news, radar maps, widget",
    "icon": "//lh3.googleusercontent.com/UpPFil2w8qVaqC2cW2eE92syTsgwcCz0X05LX-G3h49SyiWd5Qine2m6lMC5LO9LNX0=w300",
    "price": "$3.99",
    "free": false,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.3,
    "reviews": 90653,
    "developer": "AccuWeather",
    "developerId": "AccuWeather",
    "developerEmail": "support@accuweather.com",
    "developerWebsite": "http://www.AccuWeather.com",
    "developerAddress": "385 Science Park Road\nState College, PA 16803",
    "updated": "February 27, 2018",
    "version": "5.2.1-paid",
    "genre": "Weather",
    "genreId": "WEATHER",
    "description": "Stay connected to the latest weather conditions with AccuWeather. Now supporting Android Wear™, this free app features the new AccuWeather MinuteCast®, the leading minute-by-minute precipitation forecast, hyper-localized to your exact street address. AccuWeather offers the same Superior Accuracy™ and great experience across all Android smartphones and tablets, and Android Wear.  \tWeatherproof your day for free with these features: •\tAccuWeather MinuteCast® – minute-by-minute precipitation forecasts for the next two hours hyper-localized to your exact street address or GPS location. Includes precipitation type and intensity, and start and end times for precipitation. Available for the contiguous United States, Canada, Sweden, Denmark, United Kingdom, Ireland, Japan, France, Spain, Germany, Belgium, Andorra, Norway, Finland, Estonia, Switzerland, Netherlands, Luxembourg, Gibraltar, Liechtenstein and a growing list of global locations.•\tFor worldwide locations, when AccuWeather forecasts snow, ice, rain, wind, or the probability of thunderstorms, you’ll see an orange card with an exclamation point displayed within the location’s current conditions with a brief summary of the alert(s) in effect. •\tPush notifications for severe weather alerts in the United States. •\tRadar for all of North America and Europe, and worldwide satellite overlaying interactive Google Maps™ with a snapshot view of the maps for your saved locations.   •\tCurrent news and weather videos, with many available in both English and Spanish.You also get the accurate, local weather forecasts and customization you expect from AccuWeather:•\tAccurate and local forecasts for every latitude/longitude on Earth. Forecasts update every 15 minutes with information for the next 15 days – all in 33 languages and dialects.•\tCurrent weather conditions update every 15 minutes with the very latest humidity and precipitation percentages, dew point, visibility, UV index, wind speed gusts and direction, times for sunrise and sunset, and RealFeel® – AccuWeather’s exclusive weather forecasting system that analyzes multiple weather factors to determine how the local temperature actually feels. •\tLocal weather forecast summaries that provide an overview of the next five days’ weather forecast along with a description of the most dramatic weather event expected during the five days.•\tStatus bar on the homescreen displaying the current temperature for your current or home location. •\tAbility to store an unlimited amount of locations.  •\tChoice between metric or imperial units, 12-hour or 24-hour time display, and portrait or landscape view.Please note: Sunrise and sunset times are found in Daily Details which can be viewed by tapping on daily forecast. Download AccuWeather for free and experience the Superior Accuracy™ that comes from high-quality weather forecasting.",
    "descriptionHTML": "Stay connected to the latest weather conditions with AccuWeather. Now supporting Android Wear&#x2122;, this free app features the new AccuWeather MinuteCast&#xAE;, the leading minute-by-minute precipitation forecast, hyper-localized to your exact street address. AccuWeather offers the same Superior Accuracy&#x2122; and great experience across all Android smartphones and tablets, and Android Wear.  <br>\t<br>Weatherproof your day for free with these features: <br><br>&#x2022;\tAccuWeather MinuteCast&#xAE; &#x2013; minute-by-minute precipitation forecasts for the next two hours hyper-localized to your exact street address or GPS location. Includes precipitation type and intensity, and start and end times for precipitation. Available for the contiguous United States, Canada, Sweden, Denmark, United Kingdom, Ireland, Japan, France, Spain, Germany, Belgium, Andorra, Norway, Finland, Estonia, Switzerland, Netherlands, Luxembourg, Gibraltar, Liechtenstein and a growing list of global locations.<br>&#x2022;\tFor worldwide locations, when AccuWeather forecasts snow, ice, rain, wind, or the probability of thunderstorms, you&#x2019;ll see an orange card with an exclamation point displayed within the location&#x2019;s current conditions with a brief summary of the alert(s) in effect. <br>&#x2022;\tPush notifications for severe weather alerts in the United States. <br>&#x2022;\tRadar for all of North America and Europe, and worldwide satellite overlaying interactive Google Maps&#x2122; with a snapshot view of the maps for your saved locations.   <br>&#x2022;\tCurrent news and weather videos, with many available in both English and Spanish.<br><br>You also get the accurate, local weather forecasts and customization you expect from AccuWeather:<br>&#x2022;\tAccurate and local forecasts for every latitude/longitude on Earth. Forecasts update every 15 minutes with information for the next 15 days &#x2013; all in 33 languages and dialects.<br>&#x2022;\tCurrent weather conditions update every 15 minutes with the very latest humidity and precipitation percentages, dew point, visibility, UV index, wind speed gusts and direction, times for sunrise and sunset, and RealFeel&#xAE; &#x2013; AccuWeather&#x2019;s exclusive weather forecasting system that analyzes multiple weather factors to determine how the local temperature actually feels. <br>&#x2022;\tLocal weather forecast summaries that provide an overview of the next five days&#x2019; weather forecast along with a description of the most dramatic weather event expected during the five days.<br>&#x2022;\tStatus bar on the homescreen displaying the current temperature for your current or home location. <br>&#x2022;\tAbility to store an unlimited amount of locations.  <br>&#x2022;\tChoice between metric or imperial units, 12-hour or 24-hour time display, and portrait or landscape view.<br><br>Please note: Sunrise and sunset times are found in Daily Details which can be viewed by tapping on daily forecast. <br><br>Download AccuWeather for free and experience the Superior Accuracy&#x2122; that comes from high-quality weather forecasting.",
    "histogram": {
        "1": 4928,
        "2": 3518,
        "3": 6683,
        "4": 23909,
        "5": 51615
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/XP3JbuVF3QVWFRPTMetCVGIdZ1iT75rlFiAA6P4CHmSJFxG0PoDsOjPRL_hkh5p0CAA=h310",
        "//lh3.googleusercontent.com/2x6LToE71PUB0N2lUIex1AbTvd3E-FzOwzT8dJC5qX2NTLwNyDzR6OXxfZm7bGBNblc=h310",
        "//lh3.googleusercontent.com/_tSe3hRKUdfr9Tj1cW59YBlsOC9HWzB37T_j7n3fZE_FWOXTzodEYw7NSyU3honaz2M=h310",
        "//lh3.googleusercontent.com/QTKMJdAX1FmwWN_Iz_lM3WHzQ_8O-qOYtPGOCILhRWDnCe0SS17EloJ54Sh3qG4e9x1p=h310",
        "//lh3.googleusercontent.com/1PvDIBfCbUZxz8osgNYd_uI4H3wq5QBSL6IyzfBBONkQeYSC4ugp-Dfur6Ml8owRSg=h310",
        "//lh3.googleusercontent.com/KZyoum7p7zB_lBP4Nw4iVPLK1UoXZu300IuVWKuJUK0EX-faj9oJg6QAR-5-rptbW3c=h310",
        "//lh3.googleusercontent.com/5cGKL0CqRNrKDV0yd7B3MgdBN7XVEtlKo8_6mTNcBJVuZvUmxyvQryeduPOgzVr_Mwc=h310",
        "//lh3.googleusercontent.com/-5q_O4nSWHxW0xtLL4NLvcAxBPAJBzGps-W5vi5oBD8I8IOUv64cS2aCNvwaJSs9pQ=h310",
        "//lh3.googleusercontent.com/XcO5Axnd3_7UKZ5F-VLsZmR0_6i8usNUJVIj8oe_sWH5hV1Tc_yovEty6NtHuWKzrw=h310",
        "//lh3.googleusercontent.com/Z_D1u2i-poPeNwM7gh43lT7c1OfEfMxYrKaMyHCC29TVTkDO1UQefHXgqwnmkW8rXXt0=h310",
        "//lh3.googleusercontent.com/qqqbHwSI1kVdNGTRvz9OROcsNbyJntFTFb7gHHxmUQzgTouMTkkYzU_Q7sfSC3MoOHM=h310",
        "//lh3.googleusercontent.com/wmIBdKybk1LDLyzaMaQ2NE4PNyfPFcK4KfXgAHwZxR79Idrnp3lSk7omm6p3bU_EwQ=h310",
        "//lh3.googleusercontent.com/OEcsDxqaK1aKDq-vHlUSXlHN3bi7AFwzCxxu1Tx9A0fZh_Fsu9yW6Niu4GrRiMPSdQ=h310",
        "//lh3.googleusercontent.com/bdryt7YPpMkXGWOJRL-XfNLGkjgLqZFjoaOidT6Fx5tiYgWShP88U8YjBAbjJifJA2sV=h310",
        "//lh3.googleusercontent.com/C1wTkDP30M7_N-HoDfTDFjkKQIHmSrY4iP_vHITmYsx2OKnxNKzZHEP-wNXI9MW4c3A=h310",
        "//lh3.googleusercontent.com/Qfzrbu57N3_90A80vReJ33ExoUNe3285ewz2I3qdX_-WIe7uYJ5f8gduRbiKBZbD3l0=h310",
        "//lh3.googleusercontent.com/Y6S4Y0VprHYKw3gYlXaTGibU9GCCSWqpoLdcO6id6FYwv6LoeGcXj6Y0kyMkRGDuhcE=h310",
        "//lh3.googleusercontent.com/dh2wMxzja6nBhJBfy4GYXvLAnhGjoQ55fqmbZsKbCBdhEisGq5XOFuAm-zC_p66OYu0=h310",
        "//lh3.googleusercontent.com/avpBiiD8f3jA94VesngnSdLeDGy4bdTInQ7sRkfJaplxlB7fKFRbvQfKZSeWSF3wDA=h310",
        "//lh3.googleusercontent.com/a98qGGN71DEHs229gBYRSAlTRnXUwN6bWoiW3FyoZyWfe-2JY0mAxZe2CI-yXpB3GImM=h310",
        "//lh3.googleusercontent.com/8OZD7nEKKKVEVB1nbgKNyvg-ykb1X9BwRyaMIk7GVb-rkNmF-gdgBhPotf7zRlb7DbOv=h310",
        "//lh3.googleusercontent.com/30ZW1HAOeTcT_naV9RH-6WSPWafcmoWMMka_Wf6VjoL34tKYuNqPsBuQDgsr34OHz7c=h310",
        "//lh3.googleusercontent.com/ETMUHNTOD1heivRZLV7-_88sZr60Ft8mbOycBhwur3e0J_ePMZxr6THYH1s7tX_DS4-K=h310",
        "//lh3.googleusercontent.com/wTtxNTe6wDBmhasEKzp-DjRZFKEZRn6FQMSscyobOuMMd5VPNkIViG9vj9ZduLPUykQ=h310"
    ],
    "video": "https://www.youtube.com/embed/BaFFIm0oomM",
    "comments": [
        "Latest update says there should be a dialogue explaining how to migrate platinum into main. I didn't get this dialogue when I opened the app after the update.",
        "I have always thought Accuweather was better than most of the  weather forecasting apps, and after using every one of them for awhile, my opinion is Accuweather is by far the most comprehensive and accurate of the many apps to choose from.  The Accuweather team don't just appear to give their forecast out in a randomly condensed fashion, as I have felt most of the other weather station's do.  Instead, they have always been more concerned about giving out reliable & accurate forecasts!",
        "Im a hitchhiker. Which means i travel a lot and often sleep outside.that being said, its good to know the forecast at night. That way i know if i need to seek cover or not. However it would get 5*s from me if you added an auto location option. It would also be nice if it was more accurate. I just got a wind advisory alert and its as calm as the air in a deep underground cave with no ventilation.",
        "Lots of great features, display options & pollen forecasts. I have super bad allergies. This is very useful for travel to know how to prepare. Lots of options for how the info is displayed & delivered, what alerts u want, and background displays. And NO ADS!! Just weather. I haven't had any compatibility issues w/my Samsung Galaxy S5. Very happy.",
        "Good accuracy in Europe and Belgium too. Times of expected forecast for rain or snow are mostly correct. Stable app in general and not demanding on system.  Very nice design too. Nice features like Real Feel. Widgets are nice too. Minor remark here - check text frame about \"Time of Update\". On a full 1080 normal HD on a 5,2 Moto G5, for me, it feels a bit in the way or a bit misaligned perhaps? I would either drop it, move it to a full width horizontal frame at bottom or top, or make it smaller or use shorter description... Along those lines. Talking about biggest widget. Thanks for a very good app and Keep updating and extending the reach and access to measuring stations for Europe.",
        "I can not figure out how to delete locations. When I open the map portion of this particular app, I can't seem to be able to pin my location on the weather map. Yes I can use the find my location with the GPS. Option however, that is not going to show my location on the weather map. Other weather apps allow one to do so. Make a few changes and I will update my rating. Keep up the good work and I will keep buying this app every year."
    ],
    "recentChanges": [
        "• Enjoy enhanced hourly forecast with visibility and cloud cover added to the details screen.",
        "• How much is it going to snow? Get the snowfall probability on looking ahead details screen.",
        "• Dangerous Thunderstorm Alerts map can show the impact area quickly.",
        "• State boundaries are now visible in Dark theme maps too.",
        "• Bug Fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.accuweather.paid.android&hl=en&gl=us",
    "appId": "com.accuweather.paid.android"
}