{
    "title": "Cinch Weight Loss and Fitness",
    "summary": "Track your weight loss progress. Stay motivated. Get fit.",
    "icon": "//lh5.ggpht.com/C4uQlo2vKEynTe4lcLfOxCuW-ljwXoRmhqPAqy7-k2_dtW0ftEO7g00hFzrkNhhqDL4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.1,
    "reviews": 201,
    "developer": "Ryan Steckler",
    "developerId": "Ryan+Steckler",
    "developerEmail": "gotcode+cinch@gmail.com",
    "developerWebsite": "http://www.perfectcinch.com",
    "developerAddress": "800 The Mark Ln Unit 2202\nSan Diego, Ca 92101",
    "updated": "March 30, 2015",
    "version": "1.0.20",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Cinch is a new way to meet your weight loss, health and fitness goals.  Track your progress, stay motivated, and become a leaner, sexier you!  Cinch uses a combination of motivations that keep you on track towards your goals.Features:- An innovative weight loss tracker that shows your progress.  Instead of just showing you how much further you have to go, Cinch also shows you how far you've come!- Motivation right when you need it most.  Cinch shows you a feed of hand-picked motivators to get you away from temptation and keep you on track.- An automatic heart rate tracker* that works with Android Wear devices to track your heart rate throughout the day and during workout sessions. - An integrated step tracker that shows your history, and your progress toward your step goals.- A unique calorie tracker that shows how many calories you've burned and shows you how your steps and exercise impact your calorie burn.  The exercise tracker works with any application that reports your workouts to Google Fit, including RunKeeper and Endomondo.- A reminder for when you've been sitting too long and need to get up and take some steps.- A beautiful design that makes sticking to your goals a beautiful experience!* Heart rate tracking requires an Android Wear device with a heart rate monitor (e.g. Moto 360, LG G Watch R, Asus ZenWatch, Gear Live, Huawei Watch)",
    "descriptionHTML": "Cinch is a new way to meet your weight loss, health and fitness goals.  Track your progress, stay motivated, and become a leaner, sexier you!  Cinch uses a combination of motivations that keep you on track towards your goals.<br><br>Features:<br>- An innovative weight loss tracker that shows your progress.  Instead of just showing you how much further you have to go, Cinch also shows you how far you&apos;ve come!<br>- Motivation right when you need it most.  Cinch shows you a feed of hand-picked motivators to get you away from temptation and keep you on track.<br>- An automatic heart rate tracker* that works with Android Wear devices to track your heart rate throughout the day and during workout sessions. <br>- An integrated step tracker that shows your history, and your progress toward your step goals.<br>- A unique calorie tracker that shows how many calories you&apos;ve burned and shows you how your steps and exercise impact your calorie burn.  The exercise tracker works with any application that reports your workouts to Google Fit, including RunKeeper and Endomondo.<br>- A reminder for when you&apos;ve been sitting too long and need to get up and take some steps.<br>- A beautiful design that makes sticking to your goals a beautiful experience!<br><br>* Heart rate tracking requires an Android Wear device with a heart rate monitor (e.g. Moto 360, LG G Watch R, Asus ZenWatch, Gear Live, Huawei Watch)",
    "histogram": {
        "1": 56,
        "2": 19,
        "3": 31,
        "4": 47,
        "5": 48
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/jE6DK7ozE2NuCuvHmKhY1PtIc4WSy5wMrtc7qDwnU5NNEOzGY5CFV9k9ZtiVzva72A=h310",
        "//lh5.ggpht.com/zuvlpR04-Dejki-O9j7HLDi-Q6JyHiXE_L1j7yHcc6q0pizvEObPoGTRHF7kV82TAQ=h310",
        "//lh5.ggpht.com/uY0q-b_lfgDEE_jk-zfU6WZPTdZ7dK3kNR2HP52cx7rgxFZXgaNo1IX2DbKTLEqku1UI=h310",
        "//lh5.ggpht.com/gSjy6qQ-C_DQiSsm_4UdpH0DDl2_kgEuZpf5RgKbESiFVvHijo5YARAtg1vx5b_Thw=h310",
        "//lh3.ggpht.com/e4o-688U2_c8ehy1PVohn4IyOXfQ6sCsmBJ5vFvwHXLGkwtE4OWtGDmJOfeS3AoRZkEE=h310",
        "//lh6.ggpht.com/UD367MHWuBtRO2bMufzuCdKdJnp-mqgUDxPeUl3GQiaYkFD2pD0uZdHFJEDFtbxquxoi=h310",
        "//lh4.ggpht.com/6z5z-qi_vdFROK1EnNoh5Tmm6tEHez42AfgbsGTpmMUk4yhvBi3IqqJ9xmOqfHIEbXu3=h310",
        "//lh5.ggpht.com/L-j0eLUFJUMvrz_vAsPGtCdmIIvf4iRjM8-uRpatnA0bPrdfcrnhqQwjLCAHQ5pS1hw=h310",
        "//lh6.ggpht.com/YRxjAXIDKc2UcjhA4Tkcv_j3Jm5J_Qh45OE_t-wt9f_A7UJJJNiA6xdfKXdRCyJNF5R5=h310",
        "//lh4.ggpht.com/B7njPsykL1GLyen0dsgaFN2_bD-TLWKPSJ-0w7HFik71AvIYuBsJnGRnVv-fe-SmkA=h310"
    ],
    "comments": [
        "Really good... Just what I was looking for Nexus 5 and moto 360. Continuous heart rate monitoring is absolutely brilliant and the app is well designed. I personally don't use that motivation stuff and so wouldn't mind seeing an option to disable it. EDIT: I had some queries about some things and they have been answered very quickly and usefully. Thanks.  PS. I also find the step counter on Cinch to be more accurate.",
        "Overall Great App. Heart rate tracking works on Huawei watch.  Need to improve (must) - Once heart rate tracking is on we cannot turn it off. Even if I set the tracking to \"never\" green light will still be ' active ' on the watch.  Good to have (optional):  - By default app shows average heart rate per hour. It would be great to have 2nd screen like table with last XX heart rates.  - Need zones for heart rate, so the watch will vibrate if we have to high heart beat on \"workout mode\".   Once it done, 5 stars  app !",
        "Great app I like it, but the step history page has a few issues. The older history chart's window doesn't accurately show what fays you are viewing. It is like half a frame off. Also if I try and swipe fast to go back to a date a while a go it switches pages. It would take way to long to swipe slow and get to that date. Would be nice to click the bottom, older history chart and have the top on automatically go to the date in the top chart.",
        "Love the app! It's the only app that I can find with a dedicated HR workout mode.  Question though, how do you stop the workout mode on an Android Wear device? (Huawei watch) That's the only issue I have is the fact that it will keep the HR monitor running long after I'm done with my workout. Tapping on the Android Wear app doesn't stop it, Tapping on the app \"check HR\" doesn't stop it.   Please let me know, other than that great job!",
        "Workout mode is nice. Open the Cinch app on your smartwatch (I have the Huawei watch) and tap to start workout mode, and off it goes. Problem is, how the heck to you get it OUT of workout mode after your workout is done? Because it keeps the heartrate lights on the watch turned on and keeps chewing up the battery.",
        "Three major issues Was hopeful, but ... 1. It's reading my \"heart rate\" as 120 all night while my watch sits on the charger (Moto 360).  2. It's basically doubling my calorie count data in Google Fit.  Adds a full day of calories burned on top of Fit's own calculation.  3. Heart and step history don't show.  Sticks at \"refreshing\", then fails.  Worked first two days only."
    ],
    "recentChanges": [
        "Added notification on phone and watch if you've been sitting too long."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ryansteckler.perfectcinch&hl=en&gl=us",
    "appId": "com.ryansteckler.perfectcinch"
}