{
    "title": "Banjo",
    "summary": "Discover More!",
    "icon": "//lh4.ggpht.com/7AwtaXW7md9t5dxpr5M0it6FefE7WK46mqToe5shxNQOHgDkACYvVUNP-Xk8vVxzjjc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.2,
    "reviews": 58382,
    "developer": "Banjo Inc",
    "developerId": "Banjo+Inc",
    "developerEmail": "info@teambanjo.com",
    "developerWebsite": "http://ban.jo",
    "updated": "July 25, 2015",
    "version": "4.6.2.0",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Banjo is your all-access pass to live events and breaking news around the world. We discover social posts from your favorite networks, sort them by location, and show you what it’s like to be anywhere in the world, right now. Browse music, sports, breaking news, and so much more to explore real-time posts from the people who are there. Banjo provides an on-the-ground view at any place or event. Banjo: Step Into The Live Internet.",
    "descriptionHTML": "Banjo is your all-access pass to live events and breaking news around the world. We discover social posts from your favorite networks, sort them by location, and show you what it&#x2019;s like to be anywhere in the world, right now. <br><br>Browse music, sports, breaking news, and so much more to explore real-time posts from the people who are there. Banjo provides an on-the-ground view at any place or event. <br><br>Banjo: Step Into The Live Internet.",
    "histogram": {
        "1": 4268,
        "2": 1990,
        "3": 5265,
        "4": 11149,
        "5": 35710
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/dES6pOi6RwBzH7HbvrCsBb8RJZrNzRIpC9nzwE_OK8kjX7OH0n3KEcohYs2qi4UQKKo=h310",
        "//lh5.ggpht.com/cVjEKidcd-k6XUA2hvLQx5hmKA0MPkcg2UiNeESgxqZcjyVDw1lGDOknRPvL1ZY1aC0U=h310",
        "//lh3.ggpht.com/yCcy0qf8NUmqcj4O9uWztOhDwqP1PKyJsAwyFFFEDbsCDrkGlOPL0uvorwxdN6hqUg=h310",
        "//lh5.ggpht.com/byfLrWpZCrhhVjJqXEbJUFzfQCshN05nU8DIuvytM5pMeRjAw8qKo1OBvprn0-SJgg=h310",
        "//lh3.ggpht.com/d2dGUxzXQi1wvwSaSlLkzxQNRLKuvGiFvwJOyEpceyPPj9ki8AEVUORmnAirmREcxnA=h310",
        "//lh6.ggpht.com/V-v5cGorQDDD2bH4IANuzW78Ua0kqqAv0qDqj5vVajTiowp7MrFDwTU-NwtyxpOV3w=h310",
        "//lh4.ggpht.com/iVMcSUZE8mz4h2N7B2CvdQ2D-WkBuu67MoJiYeLcIaFjTQXrPaQKQPksc68lNEkchWo=h310",
        "//lh6.ggpht.com/pDEJwsQItW0WgF5TekR3jMO-CgE7Mgu3RRgz_3oHr-4uT3JcO32F60T7nf5gK0Cjk_w=h310",
        "//lh3.ggpht.com/jdAdd_NcgV4mQwRBkGtDcwMS5oAvVHzLFtYevEjLzVZcxQUoDDJqpO3iQxhGDdGliQY=h310",
        "//lh3.ggpht.com/Nsl81ueFsg_W26nTITQ2o53irR0LF0PQXVgj9VwJDbmg9IzxhLnwUborXQoQGW15iVc=h310",
        "//lh4.ggpht.com/XvjTxIdGIRVJghDT3UvmL6JT7683M3p17mpueHbD7LP4cjMPfUOflht50U_Af8pdju0=h310",
        "//lh3.ggpht.com/Ekd7TULkdsMilKfdxvQqoE1QAQeGR_KEfB1mPOR3wYTRNQnr3GkJMMhrAzbw3vVQew=h310",
        "//lh3.ggpht.com/aEMS-S1QgH6G6jZxcoo8SW1dIa-Z33IHc8yyBEJM1dCJOh-7-J90mozHK5G6Pyc86g=h310"
    ],
    "comments": [
        "Excellent location based data mining Based on my location (or areas I have interest) I see real time events tailored to where I am... Everything from traffic, to events, to emergencies and social posts.  The app mines social media, it's always getting more thorough and is easily accessible.  It also follows topics I want.  Really good app... Does not such my phone dry either.  Yay",
        "Awesome app Great for those incident you did not hear about yet. Live social media feeds from people at the scene of almost all major incidents. It helps me with my scanner news page.  It help fill in the gaps of details.",
        "Mixed feelings I have mixed feelings on this app. On one hand the app is well laid out, fast and modern. On the other hand I am  not sure what it is trying to achieve. There doesn't seem to be anything displayed that is relevant to me.",
        "The SUPER info app of apps Gone are the days of having to troll through multiple Twitter, FB, etc, feeds to get the latest news.  This app aggregates all of the info and has an awesome interface.",
        "Create an account? I'm not creating an account to use this app. I enjoyed the old app. These appholes don't need to have us connected to every other social media platform. RIDICULOUS.",
        "Failing. Abandonware. I see the last app update was over a year ago. Maybe that cessation in development explains the app often failing to load pics and vids now. Uninstalling given it's becoming iffy and frequently useless."
    ],
    "recentChanges": [
        "What's New in Version 4.6",
        "- Translate social posts into your language",
        "- Create and share memes",
        "- More ways to share content and events with your friends"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.banjo.android&hl=en&gl=us",
    "appId": "com.banjo.android"
}