{
    "title": "Trigger - Task Launcher",
    "summary": "Automating the tasks you do daily. Launch applications, conserve battery &amp; more.",
    "icon": "//lh4.ggpht.com/hObtJbLg3G_PWVgA1OnVVvPqdMoWAEMXYG2eSq73Gca-iTKEbJFfvmalEaO056izGLY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 21974,
    "developer": "Coleridge Apps LLC",
    "developerId": "Coleridge+Apps+LLC",
    "developerEmail": "help@coleridgeapps.com",
    "developerWebsite": "http://gettrigger.com/",
    "developerAddress": "1010 16th Street Apt 562\nSan Francisco,\nCA 94107",
    "updated": "February 13, 2017",
    "version": "9.3.1",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Bored of putting your phone on silent every time you get into the office? Tired of turning off Bluetooth to conserve battery every time juice gets low?This app interacts with your surroundings to configure settings on your phone automatically. Combine triggers and actions to create tasks, then activate the tasks that you create with conditions that you set!Here are examples of what you can do:In your car: Use Bluetooth as a trigger to open GPS and launch your favorite music appOn your nightstand: Program an NFC tag to set your ringer to vibrate, dim your display and set an alarmIn your house: Use WiFi as a trigger to silence your phone, connect to bluetooth, and play your favorite songs.The current free triggers are as follows:-NFC-Bluetooth-WifiAnd as part of our Pro-Upgrade we also have these additional triggers: -Battery Level-Location-Time triggers-Charging-Calendar Events-Agent-HeadsetAnd here are a few examples of the actions that you can perform with Trigger task launcher:- Change WiFi, Bluetooth, mobile hotspot, airplane mode (root users in Jelly Bean and up), auto-sync, GPS and mobile data settings (root users).- Change your volumes or notification tones.- Change your display brightness, timeout, auto-rotation, or notification light settings- Check in on social media like Foursquare or Google Places- Send messages using Twitter, SMS, Email, or Glympse- Start or stop Applications (root required for stopping most applications), dock modes, open URLs, speak text, or navigate to an address- Set Alarms or create calendar events- MORE!Trigger is a task launcher that allows you to easily program your device to do the actions you do regularly.So go ahead and create your own combinations to automate your life. The only limit is what you can come up with! The Wall Street Journal calls it \"living in the future.\"Additional actions can be found when experimental features are enabled in advanced settings. Auto lock screen and airplane mode are restricted by Android but we've created some work around solutions for these actions. (Note: They aren't 100% reliable which is why they're classed as \"experimental features\").Some demos can be viewed on the application websiteNote: When using NFC Tags you can create a Switch task that will toggle between two tasks with each tap.We're always working on adding new actions to Tasks.  Please get in touch if there's something you'd like to do that's not currently offered.This application supports NFC Forum Type 1, Type 2, Type 3 and Type 4 Tags as well as third party NFC Enabled tags like the MIFARE Classic, DESFire, Ultralight and Ultralight C. Now supporting read-only tags & allowing you to write any amount of data to any tag using Tagstand's cloud service. This allows you to use your tags just as you would any writable tag without worrying about size. All permissions are listed and explained here: https://sites.google.com/site/triggerwiki/permissions This app uses Google Analytics for aggregate, anonymous data collection, which can be opted out of from the settings page.",
    "descriptionHTML": "Bored of putting your phone on silent every time you get into the office? Tired of turning off Bluetooth to conserve battery every time juice gets low?<br><br>This app interacts with your surroundings to configure settings on your phone automatically. Combine triggers and actions to create tasks, then activate the tasks that you create with conditions that you set!<br><br>Here are examples of what you can do:<br><br>In your car: Use Bluetooth as a trigger to open GPS and launch your favorite music app<br><br>On your nightstand: Program an NFC tag to set your ringer to vibrate, dim your display and set an alarm<br><br>In your house: Use WiFi as a trigger to silence your phone, connect to bluetooth, and play your favorite songs.<br><br>The current free triggers are as follows:<br><br>-NFC<br>-Bluetooth<br>-Wifi<br><br>And as part of our Pro-Upgrade we also have these additional triggers: <br><br>-Battery Level<br>-Location<br>-Time triggers<br>-Charging<br>-Calendar Events<br>-Agent<br>-Headset<br><br>And here are a few examples of the actions that you can perform with Trigger task launcher:<br><br>- Change WiFi, Bluetooth, mobile hotspot, airplane mode (root users in Jelly Bean and up), auto-sync, GPS and mobile data settings (root users).<br>- Change your volumes or notification tones.<br>- Change your display brightness, timeout, auto-rotation, or notification light settings<br>- Check in on social media like Foursquare or Google Places<br>- Send messages using Twitter, SMS, Email, or Glympse<br>- Start or stop Applications (root required for stopping most applications), dock modes, open URLs, speak text, or navigate to an address<br>- Set Alarms or create calendar events<br>- MORE!<br><br>Trigger is a task launcher that allows you to easily program your device to do the actions you do regularly.<br><br>So go ahead and create your own combinations to automate your life. The only limit is what you can come up with! <br><br>The Wall Street Journal calls it &quot;living in the future.&quot;<br><br>Additional actions can be found when experimental features are enabled in advanced settings. Auto lock screen and airplane mode are restricted by Android but we&apos;ve created some work around solutions for these actions. (Note: They aren&apos;t 100% reliable which is why they&apos;re classed as &quot;experimental features&quot;).<br><br>Some demos can be viewed on the application website<br><br>Note: When using NFC Tags you can create a Switch task that will toggle between two tasks with each tap.<br><br>We&apos;re always working on adding new actions to Tasks.  Please get in touch if there&apos;s something you&apos;d like to do that&apos;s not currently offered.<br><br>This application supports NFC Forum Type 1, Type 2, Type 3 and Type 4 Tags as well as third party NFC Enabled tags like the MIFARE Classic, DESFire, Ultralight and Ultralight C. Now supporting read-only tags &amp; allowing you to write any amount of data to any tag using Tagstand&apos;s cloud service. This allows you to use your tags just as you would any writable tag without worrying about size.<br> <br>All permissions are listed and explained here: https://sites.google.com/site/triggerwiki/permissions<br> <br>This app uses Google Analytics for aggregate, anonymous data collection, which can be opted out of from the settings page.",
    "histogram": {
        "1": 1640,
        "2": 980,
        "3": 2114,
        "4": 5208,
        "5": 12032
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/3pRM2leMUwlxGhk3_-GDPKOapxdsOakyH4fRN2gpi34xqB1GIk_m_PeB0vPuMzLvlVw=h310",
        "//lh3.googleusercontent.com/4tbENY4WnlxC5F7K4BhpaGJEudS9XI9OTwPs8wnXG1o0tAJ4DxnK1BvSzShtXy9Cgogi=h310",
        "//lh3.googleusercontent.com/IRDJfeRX3FlfOQ1mWawBg9mTE_Ub3KFtt19BnugF3exiuVxC7vAxMmfzb8rXZXulg8w=h310",
        "//lh3.googleusercontent.com/XEO0Z7NgIc8U-nyJM-lcaLe0jg-q4mBpcU_SCfosecumYrNas2zfv4_m1Okn7RRI5g=h310",
        "//lh3.googleusercontent.com/iEfb1xDPPXZcz_Po_4WXiSMATQOMKKoZLdCX9g6Pn_BqVqdDBW_plqBr8K6Vfb8dvg=h310",
        "//lh3.googleusercontent.com/WRaK-j_K3K2-agduxHG1Xbe1xjJZrThEFluwVGL8tl0erMoHgrJTRZkdRa1QjmoO3_A=h310",
        "//lh3.googleusercontent.com/RdfW__vjKH_Uo7iUtP0nXkCDgycbwtGZp24O4yFb06Wfhjc8mX5jcgEInYIDq6g7N6XB=h310",
        "//lh3.googleusercontent.com/XELgvukFbQSYN9_wYDL8HBkDZlq7A0DiXB8sUiwrFgPZdAyT1qTPcHhonYkw0unYC6qu=h310",
        "//lh6.ggpht.com/XCgfZwLJDb75E3DsacXHEIGNMhMX0gtpejaICGEEFkqoyV_E1qZhxagsn1mxaeg-uaCk=h310",
        "//lh3.ggpht.com/3kH7dql1sCc9B5nw1YfgC9jF78-GofUJX8Edf3CeUMFoaOILUJSY1TnXgjrbQMLJkvI=h310",
        "//lh3.ggpht.com/XWjfSfMe9QNYePGgAhogYazN25cy27BcNYIsFAaNRGslPw7kh0xRCQfneucYLg2bQQ=h310",
        "//lh5.ggpht.com/H5_3qLg03r0Rr7PnnTj0tRfeWMTRFLycXStxX0RtaoYR_MpWQKS9g0AZjfjmFLmB6k4=h310",
        "//lh3.ggpht.com/2hkd4RnM6Bt7_QwbQ2dbyDjLG6wyNEiZZXIDQ3TKtcN5P3AWNwyDKrX06XwsM734hbeT=h310",
        "//lh3.ggpht.com/dt_T8omis1dNQrfUgaAVCeuDF_tsi1lYr7aRcRiOqClQE-7Pm5KNLXxQ9_oZAeIFZiI=h310",
        "//lh3.ggpht.com/9fGHuTi_WAzwSlpK2JLCurReLCopTqbyJaJ5PZx85prwce4-d4S7dAdgnkFSDVizoQ=h310",
        "//lh6.ggpht.com/AaZRdQFlStpxFX7F4Oke7A115K1dHQfeNvHlq5_B-f3BPFaiXDR6_RzoYpE-TSm58Gw=h310"
    ],
    "comments": [
        "Great tool! Works really well and doesn't drain your battery. A new phone is always faster, which doesn't feel like a real upgrade. But this app makes my phone a device from the future! When I leave home and disconnect from my WiFi, all tasks are run to connect to my Bluetooth car, launches the right traffic apps. When I leave my car, disconnect Bluetooth, enable WiFi, disable screen rotation, etc. Great! Keep it up!",
        "Have been using this app for 5+ years. At the beginning it was great, but slowly it has become obsolete. No major updates (new features) have been released for a long time. It is easy to use and the UI is great, but it lacks support of a lot of controls that other apps can manage (look at Automate for example.) The big disappointment here is the geo location feature, which has never worked for me. I paid for this application when it was the best out there; today I would put my money somewhere else.",
        "Sucks. Does anyone actually work on this thing anymore or what!? Get this fixed! Update - For whatever reason, it changes my \"Display Timeout\" to \"after 72 hours of inactivity\" instead of \"30 seconds\" when triggering the iHeartRadio App.  A year or two ago it was fantastic.  Now it does (or doesn't) do whatever it wants. It decides what triggers (and parts of triggers) it feels like triggering, or it changes part of them entirely, regardless of my settings.  Here's hoping it returns to its formerly awesome app soon.  In the event it is phone related (I've uninstalled, reinstalled, cleared cache everyway possible, and factory reset (😠) my device). I have a Samsung Galaxy Note 5 on Sprint.  Hopefully that will help.",
        "I needed something fairly simple: turn off WiFi when my tablet disconnects from my home network to save battery. It seemed to do it once, but then it wouldn't do it again the next day. The Automate app can do that pretty well, and has TONS more capabilities.",
        "I used to use the app just fine previously and loved it's functionality. However, recently, I'm noticing the app doesn't allow me to play a sound when a task runs. I used to have this enabled so as to notify me when a task ran while the phone was in my pocket. Now when I try to add a sound to a task, the app gets stuck in a loop, asking me to add more triggers. Would appreciate this issue being looked at. I'm using a Samsung Galaxy S7 with Android 7.0 in Canada.",
        "Purchased this app, as it does real magic. Starts navigation and music when I step in my car, and when car-bluetooth disconnects it switches on my Wifi. And when Wifi connects, it will enable-AutoSync. And now it knows by date/time also if I navigate home or to work ;)  Try the free version, and support if you like it like me."
    ],
    "recentChanges": [
        "Improved UX by fixing crashes and bugs.",
        "If you have any issues please reach out to us at help+trigger@coleridgeapps.com."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.jwsoft.nfcactionlauncher&hl=en&gl=us",
    "appId": "com.jwsoft.nfcactionlauncher"
}