{
    "title": "American Airlines",
    "summary": "Get the app that knows where you’re going - view your flight, check in &amp; more",
    "icon": "//lh3.googleusercontent.com/LgrZL84ydVu55EP0Vs0PfHIknH5X9XKo4YG-HM_TVwzMoctId97Ge7u3HpFydq1regg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 3.8,
    "reviews": 15821,
    "developer": "American Airlines, Inc.",
    "developerId": "American+Airlines,+Inc.",
    "developerEmail": "aa.mobile@aa.com",
    "developerWebsite": "http://www.aa.com/app",
    "updated": "February 14, 2018",
    "version": "5.5.1.3",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "With the American Airlines app, you’re covered with the information you need exactly when you need it. Need a mobile boarding pass? Wondering where the closest Admirals Club® lounge is located? All of this info, and more, is available at your fingertips. -Dynamic home screen: Knows where you are in your travel journey and gives you easy access to the right tools at the right time.-Mobile boarding pass: Check in for your trip and retrieve your mobile boarding pass. No need to print, and it’s updated along the way.-Flight updates:  Get the latest ﬂight updates by simply retrieving your reservation and allowing American Airlines to send notiﬁcations to your mobile device.-Interactive terminal maps: Navigating airports is a breeze with our interactive terminal maps. Find the closest Admirals Club lounge or get directions to your connecting gate. -AAdvantage® account details: Review all the details of your AAdvantage account right from the app. Not an AAdvantage member? Sign up today.-Upgrade your seat: Request and purchase upgrades with ease. Want to see where you are on the list? The app displays the upgrade standby list within four hours of your scheduled departure. -Seat selection: Select or change your seat within the app. Just pick the one you’d like and change it on the spot. -Track your bag: Know exactly where your bag is from the time it leaves your hands to when you extend the handle at your ﬁnal destination. -Save your reservation: Your recently viewed reservations are automatically saved in the app so you can easily grab the details for your next ﬂight in seconds.-Quick interactions: The American app utilizes 3D touch and is Apple watch compatible, giving you quick access to the most important info.  -Wi-Fi access in the air: Don’t forget on flights with Wi-Fi, you can use the American app and aa.com to check flight information and watch movies and TV shows at no cost. Contact Us: 800-222-2377Why we need the permissions:BluetoothWe will be adding location assistance to mapping (see our new terminal maps) that uses BLELocationYour location helps us give you relevant information tailored to where you are at the time. Photos/Media/FilesAccess to photos is required to store parking reminders. CameraThe camera allows the app to scan credit cards and expedite the checkout process. Wi-Fi connection informationThis allows the app to understand when connectivity exists to give you the data you need.   OtherOther various permissions allow the app to: receive google notifications, process notifications while the device is trying to sleep, access American’s web services, and vibrate for important messages.",
    "descriptionHTML": "With the American Airlines app, you&#x2019;re covered with the information you need exactly when you need it. Need a mobile boarding pass? Wondering where the closest Admirals Club&#xAE; lounge is located? All of this info, and more, is available at your fingertips. <br><br>-Dynamic home screen: Knows where you are in your travel journey and gives you easy access to the right tools at the right time.<br><br>-Mobile boarding pass: Check in for your trip and retrieve your mobile boarding pass. No need to print, and it&#x2019;s updated along the way.<br><br>-Flight updates:  Get the latest &#xFB02;ight updates by simply retrieving your reservation and allowing American Airlines to send noti&#xFB01;cations to your mobile device.<br><br>-Interactive terminal maps: Navigating airports is a breeze with our interactive terminal maps. Find the closest Admirals Club lounge or get directions to your connecting gate. <br><br>-AAdvantage&#xAE; account details: Review all the details of your AAdvantage account right from the app. Not an AAdvantage member? Sign up today.<br><br>-Upgrade your seat: Request and purchase upgrades with ease. Want to see where you are on the list? The app displays the upgrade standby list within four hours of your scheduled departure. <br><br>-Seat selection: Select or change your seat within the app. Just pick the one you&#x2019;d like and change it on the spot. <br><br>-Track your bag: Know exactly where your bag is from the time it leaves your hands to when you extend the handle at your &#xFB01;nal destination. <br><br>-Save your reservation: Your recently viewed reservations are automatically saved in the app so you can easily grab the details for your next &#xFB02;ight in seconds.<br><br>-Quick interactions: The American app utilizes 3D touch and is Apple watch compatible, giving you quick access to the most important info.  <br><br>-Wi-Fi access in the air: Don&#x2019;t forget on flights with Wi-Fi, you can use the American app and aa.com to check flight information and watch movies and TV shows at no cost. <br><br>Contact Us: 800-222-2377<br><br>Why we need the permissions:<br><br>Bluetooth<br>We will be adding location assistance to mapping (see our new terminal maps) that uses BLE<br><br>Location<br>Your location helps us give you relevant information tailored to where you are at the time.<br> <br>Photos/Media/Files<br>Access to photos is required to store parking reminders.<br> <br>Camera<br>The camera allows the app to scan credit cards and expedite the checkout process.<br> <br>Wi-Fi connection information<br>This allows the app to understand when connectivity exists to give you the data you need.  <br> <br>Other<br>Other various permissions allow the app to: receive google notifications, process notifications while the device is trying to sleep, access American&#x2019;s web services, and vibrate for important messages.",
    "histogram": {
        "1": 2201,
        "2": 1051,
        "3": 1761,
        "4": 3476,
        "5": 7332
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ckMWvSLw-lZNnP6iuMQqCClEbYExV19b_UcB8ezKOh7fVCNuLoAjwgfn2K2HoQvAtgWi=h310",
        "//lh3.googleusercontent.com/DSM0rl1i1SZIHnLRdH_RlCKqFrLCmofwTJmefSUW4DICSCaj2RYNk2LRhjNepqtmQQ=h310",
        "//lh3.googleusercontent.com/RCqIfgKIx-joZCsEvift7IPdEN077mWVV61OYGS5zpKiF3KPCWBbrP_DxOGfER3Hw2s=h310",
        "//lh3.googleusercontent.com/N9JRxU-VC0uG_iCokkau4IOb5JT4qhi_UeK1ONXo3qPnT74gIAJjimhHBNJYoSUY_Ag=h310",
        "//lh3.googleusercontent.com/xbBIJ1T6k8PpOlb1AxP4TSeq6-f-wb8GDKmCn_X6WGo7b_4W5aOj7qS2JU6TZLG5jA=h310",
        "//lh3.googleusercontent.com/5DFHF-Y_JaSImBATDFBQubZ1jxC41_EWAbAqNMxTd0HJgA1KWUPSg9XphCJsfx4egw=h310",
        "//lh3.ggpht.com/mjyfKXM0csgtsC3nl2r9lI6-KR3bMGe15YOY6CqDhFsXGQQI4-m5qPOQGf63qtES_4g=h310",
        "//lh3.googleusercontent.com/YiC4aYWGiNpyRTYrLr55eCWFnt2PDlAcqLxkiiMEKe51seLiyWIq9utMQds-pn_non4=h310",
        "//lh3.googleusercontent.com/me72ZeIzR_cju2QXkpd30xvpq3rbscuSjc8Xm8CVwZq9N3ysVVwhi7lP2IvBZ3PdHvo=h310",
        "//lh3.googleusercontent.com/nVj3JgrY2tcUXebYLjjaEKPzxFenM9JjCqajLj7DmjLmgPbeWDFYReOS4YOq7n3hr8EU=h310"
    ],
    "comments": [
        "Why can't I see any information offline? This app freaks out and blocks seeing itineraries without internet access... Which happens sometimes (like on a plane), and you just want to see your connection information",
        "The UX on this app is terrible. How do you have an app that doesn't have the words \"Check In\" somewhere in it. Also why the hell is it almost 100mb. What are you doing that requires that size?  Sincerely,  Sorrynotsorry",
        "The latest UI is a good improvement... it probably looks better than most airline apps but the function is still severely lacking.  Upgrade list (is hidden except within a widow of time), standby list Indy there  (big miss), seat map and more is missing or really hard to get to.",
        "My flight got delayed and moved and I couldn't see the update on the app because it couldn't connect to the server. Therefore I had to call someone and write it down myself so that I would know",
        "I don't know what some of the other people are complaining about. I just loaded this to my Moto G4 and it works just fine. Maybe it's not the app but the phone.",
        "The AA app has always had minor bugs but the recent update removed the ability to change seats. My company always books the cheapest seat so I regularly use the app to change. A big disappointment... Why remove features? Hopefully the \"upgrade\" feature works now. In years past I would request an upgrade through the app but when I got to my gate i was never on the list. Irritating, I am almost ready to give up on AA for business travel."
    ],
    "recentChanges": [
        "To make our app better for you, we make ongoing updates to improve your experience. Thanks for choosing American Airlines."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.aa.android&hl=en&gl=us",
    "appId": "com.aa.android"
}