{
    "title": "o2 Protect",
    "summary": "The ultimate protection for your data, identity and privacy",
    "icon": "//lh6.ggpht.com/i3wE8MYuksl2bTP69aK0Iy9d9RLHd-dR3dfysUe6X65lt0PEttq-xQPux4vr8pY_uTo=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.3,
    "reviews": 768,
    "developer": "Telefónica Germany GmbH & Co. OHG",
    "developerId": "Telef%C3%B3nica+Germany+GmbH+%26+Co.+OHG",
    "developerEmail": "o2-apps-de@telefonica.com",
    "developerWebsite": "http://www.o2.de/",
    "developerAddress": "Georg-Brauchle-Ring 23-25\n80992 München",
    "updated": "July 21, 2016",
    "version": "4.6.1.1247",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Schütze dich vor Gefahren aus dem Internet. Mit o2 Protect erhältst du den ultimativen Schutz für deine Daten, Identität und Privatsphäre. o2 Protect Mobile - der ultimative Schutz für dein mobiles Leben:Privates bleibt wirklich privat. Dein Android-Smartphone oder Tablet ist vor Gefahren aus dem Internet und gegen Diebstahl oder Verlust geschützt.o2 Protect Complete - ultimativer Viren-, Identitäts-und Datenschutz für alle deine PCs, Macs, Smartphones und Tablets:Damit kannst du bis zu 5 Geräte schützen - egal ob Smartphone oder Tablet, PC oder Mac - damit du sicher und sorglos online surfen, einkaufen und Bankgeschäfte erledigen kannst. Mit o2 Protect Complete erhältst du sogar zusätzlich 5 Lizenzen für True Key, die Kennwortverwaltung per Gesichtserkennung oder Fingerabdruck von McAfee (als separate App erhältlich).Weitere Informationen zu o2 Protect und den Konditionen findest Du unter http://o2.de/protect.Wichtig: Bitte buche o2 Protect vor der Installation unter http://o2.de/protect. Du erhältst danach einen personalisierten Installationslink für eine einfache Registrierung.Funktionen der o2 Protect App:✔ Diebstahlschutz – Über dein o2 Protect Konto kannst du ein verlorenes Smartphone orten, sperren und einen Alarm per Fernzugriff auslösen ✔ CaptureCam – Lässt dich ein Foto der Person machen, die dein verlorenes Smartphone in der Hand hält✔ Datenschutz – Verwalte alle Sicherheitsfunktionen per Fernzugriff über dein o2 Protect Konto und sichere deine Kontakte, SMS und Medien als Back-Up in der Cloud✔ Deinstallationsschutz – Verhindere unbefugtes Deinstallieren von Apps durch Dritte✔ Antivirus und App-Schutz – Scanne dein Gerät um deine Privatsphäre vor Datenmissbrauch zu schützen und entferne bedrohliche Apps✔ Echtzeit-Schutz – Surfe und shoppe sicher, während o2 Protect dein Smartphone im Hintergrund vor Phishing und böswilligen Installationen schützt✔ Leistungsoptimierung – Beschleunige dein Gerät und verbessere die Akkulaufzeit, indem du den Arbeitsspeicher (RAM) aufräumst✔ Anruf- und SMS-Filter – Unterbinden von Spam, indem du unerwünschte Anrufe, Nummern und SMS blockierstDiese App verwendet die Berechtigung des Garäteadministrators zum Schutz deines Geräts und deiner Privatsphäre.",
    "descriptionHTML": "Sch&#xFC;tze dich vor Gefahren aus dem Internet. <br><br>Mit o2 Protect erh&#xE4;ltst du den ultimativen Schutz f&#xFC;r deine Daten, Identit&#xE4;t und Privatsph&#xE4;re. <br><br>o2 Protect Mobile - der ultimative Schutz f&#xFC;r dein mobiles Leben:<br>Privates bleibt wirklich privat. Dein Android-Smartphone oder Tablet ist vor Gefahren aus dem Internet und gegen Diebstahl oder Verlust gesch&#xFC;tzt.<br><br>o2 Protect Complete - ultimativer Viren-, Identit&#xE4;ts-und Datenschutz f&#xFC;r alle deine PCs, Macs, Smartphones und Tablets:<br>Damit kannst du bis zu 5 Ger&#xE4;te sch&#xFC;tzen - egal ob Smartphone oder Tablet, PC oder Mac - damit du sicher und sorglos online surfen, einkaufen und Bankgesch&#xE4;fte erledigen kannst. Mit o2 Protect Complete erh&#xE4;ltst du sogar zus&#xE4;tzlich 5 Lizenzen f&#xFC;r True Key, die Kennwortverwaltung per Gesichtserkennung oder Fingerabdruck von McAfee (als separate App erh&#xE4;ltlich).<br><br>Weitere Informationen zu o2 Protect und den Konditionen findest Du unter http://o2.de/protect.<br><br>Wichtig: Bitte buche o2 Protect vor der Installation unter http://o2.de/protect. Du erh&#xE4;ltst danach einen personalisierten Installationslink f&#xFC;r eine einfache Registrierung.<br><br><br>Funktionen der o2 Protect App:<br><br>&#x2714; Diebstahlschutz &#x2013; &#xDC;ber dein o2 Protect Konto kannst du ein verlorenes Smartphone orten, sperren und einen Alarm per Fernzugriff ausl&#xF6;sen <br><br>&#x2714; CaptureCam &#x2013; L&#xE4;sst dich ein Foto der Person machen, die dein verlorenes Smartphone in der Hand h&#xE4;lt<br><br>&#x2714; Datenschutz &#x2013; Verwalte alle Sicherheitsfunktionen per Fernzugriff &#xFC;ber dein o2 Protect Konto und sichere deine Kontakte, SMS und Medien als Back-Up in der Cloud<br><br>&#x2714; Deinstallationsschutz &#x2013; Verhindere unbefugtes Deinstallieren von Apps durch Dritte<br><br>&#x2714; Antivirus und App-Schutz &#x2013; Scanne dein Ger&#xE4;t um deine Privatsph&#xE4;re vor Datenmissbrauch zu sch&#xFC;tzen und entferne bedrohliche Apps<br><br>&#x2714; Echtzeit-Schutz &#x2013; Surfe und shoppe sicher, w&#xE4;hrend o2 Protect dein Smartphone im Hintergrund vor Phishing und b&#xF6;swilligen Installationen sch&#xFC;tzt<br><br>&#x2714; Leistungsoptimierung &#x2013; Beschleunige dein Ger&#xE4;t und verbessere die Akkulaufzeit, indem du den Arbeitsspeicher (RAM) aufr&#xE4;umst<br><br>&#x2714; Anruf- und SMS-Filter &#x2013; Unterbinden von Spam, indem du unerw&#xFC;nschte Anrufe, Nummern und SMS blockierst<br><br><br>Diese App verwendet die Berechtigung des Gar&#xE4;teadministrators zum Schutz deines Ger&#xE4;ts und deiner Privatsph&#xE4;re.",
    "histogram": {
        "1": 233,
        "2": 45,
        "3": 78,
        "4": 115,
        "5": 297
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/-0jvj0X2k9b-rCi-o7f_kbhCTMwlpbMBRbpHBnvvwwle3o547TBv1A4ztUchLd2sZgN-=h310",
        "//lh4.ggpht.com/-zERQd-CmdPwBV2cWOEVXWz_ty2kbEACANT6GLT9B3cwWtN8BQ1ymRR-KI7zO3G_Tg=h310",
        "//lh5.ggpht.com/bjj9oOaKVm9cbCyEm-LjewfzSRvNThA0EUXlxps0dy_uQhu37E_9dvdonwmlVSuPTQ=h310",
        "//lh4.ggpht.com/GrFXZFRaYVNQHS62a0OjWr7uI_AxfVZ64v4KnEYkArIusNduYee-4_T2E-EzH40sTlo=h310",
        "//lh6.ggpht.com/r4pjE1yGxz_G1hOAlvnPOCSXkxSmfF88dHl_rNxhv4S04cE98zzWN0q-BiUpu3K3WTc=h310",
        "//lh3.ggpht.com/w70zU82mnKDlWu0YZ_HnWAa2dkkPgzXdG9D6BXP2BsTiWHY3IxV1Ep_hHF_FYU9Z7rsS=h310"
    ],
    "video": "https://www.youtube.com/embed/IHD7W0motF0",
    "comments": [
        "App description is a key for the thief!  When u describe u can take a cam snap or on the lockscreen after trying many wrong temptations to unlock device, then u gave the thief a chance to simply cover the front cam with a sticker as long as we can disable GPS tracking even when the device still locked ( naugat).  Pls do it the smartest ! we are living smarter ! Respect for the team.",
        "Utter RUBBISH. Why do I keep getting German prompts on my English phone and why can't I uninstall this app?",
        "Cannot uninstall! I don't understand. This app cannot be removed! Get it off my phone :-/",
        "Get it off my phone"
    ],
    "recentChanges": [
        "- App-Sprache jetzt komplett auf Deutsch",
        "- Einfache Registrierung",
        "- Verbindung mit Android-Smartwatches möglich"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.wsandroid.suite.o2de&hl=en&gl=us",
    "appId": "com.wsandroid.suite.o2de"
}