{
    "title": "SKOUT - Meet, Chat, Friend",
    "summary": "SKOUT is the largest social network for meeting people based on your location!",
    "icon": "//lh3.googleusercontent.com/NRiI7pniA7kkkbDnxg1EnQMgxydZuFNE28IBSBpFu_gwM522lD6nLnbMHP0OMXT5Ig=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000000,
    "maxInstalls": 100000000,
    "score": 4.2,
    "reviews": 1041878,
    "developer": "Skout Inc.",
    "developerId": "Skout+Inc.",
    "developerEmail": "support@skout.com",
    "developerWebsite": "http://www.skout.com",
    "developerAddress": "301 Howard St, San Francisco, CA, USA",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Social",
    "genreId": "SOCIAL",
    "size": "Varies with device",
    "description": "SKOUT connects you with new people nearby or all over the world! Download the free SKOUT app to meet and chat with men and women based on search parameters that YOU set. Chat with new friends, give gifts, share photos and more! Skout matches you with people you want to chat with, whether they’re nearby or in a city you want to visit. Download the largest app for finding new friends nearby!",
    "descriptionHTML": "SKOUT connects you with new people nearby or all over the world! Download the free SKOUT app to meet and chat with men and women based on search parameters that YOU set. Chat with new friends, give gifts, share photos and more! Skout matches you with people you want to chat with, whether they&#x2019;re nearby or in a city you want to visit. <br><br>Download the largest app for finding new friends nearby!",
    "histogram": {
        "1": 78586,
        "2": 36405,
        "3": 101351,
        "4": 159405,
        "5": 666131
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/_13JOtNUVAvbQwZZrEYMs1CyZZXeXHJiMq_nRsMJVfzIv2nvwU5qTJQ-Im9d7lNOs9UF=h310",
        "//lh3.googleusercontent.com/eeUYl1d0oAr8d3rgsELCoucLg43nIVu0LKt1boQ-4-_ZJrFQcmQ2JqO3u8_Jux0wBDg=h310",
        "//lh3.googleusercontent.com/gnchJ8wO2saGs-qEEjPNzBEkl1HBoRGshygBkjoEoh_DpIf76P9ElfCppZQ_9rJq-VvR=h310",
        "//lh3.googleusercontent.com/I-25uTAbEr-P4p8F4_pGCubmO_jEU-lz3Ybo_W6YQIfhWUJEKJzMUywruy9M56Lm5ck=h310",
        "//lh3.googleusercontent.com/KL6ANWQDS_ET6bz4W8mKIawoU_p60_Cjxqsw-tgtbn67MpYJCCZs_a8pRk5Uqd0OyFdG=h310"
    ],
    "comments": [
        "Well it blocked me for supposed multiple login attempts. Now I can't even delete my account because it won't go past the blocked message page. I never even logged in but once.",
        "I loved it,,fun and enjoying meeting people around the world,,but i have one complain,,i have a team in live stream we work hard in our diamonds,why all of sudden our leader that she's the one got 500k diamonds on her account is blocked and her diamonds is gone,,can u explain us what happen?we want to get back our diamonds on her account together her account as well..as of now were all upset and disappointed,,please Skout can you give back her account and diamonds..thanks...",
        "So nice to see people \"near\" me... 1000 km away in fact! With my location access given, of course.",
        "Meet me was much better compared with the UI and stuff... When Searching for people Nearby you get people who are miles away from you... but to mention that it's the same as meet me. People never take a step to reply back... I would prefer meet rather then this but still chances of meeting or texting a person is as same as this you'll probably get one to chat...",
        "This app is garbage. You will get reported and banned if your profile says anything about being trans. Also the guys are like abusive animals and if they give you a gift they expect you to talk to them all evening.",
        "I have actually met and connected here. It can be alot of fun if you are a fun person."
    ],
    "recentChanges": [
        "Skout is the global network to meet and chat with new people and do fun things!",
        "*Stability and speed improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.skout.android&hl=en&gl=us",
    "appId": "com.skout.android"
}