{
    "title": "Amazon Shopping",
    "summary": "Browse, search &amp; buy millions of products right from your Android device.",
    "icon": "//lh3.googleusercontent.com/Pzhl8z9sJAQk8e1ZiL_XnX3WZPEminhbw5I0S5nrqmTtzdbzb1TCydGZJ9FoUmlD_WjO=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.3,
    "reviews": 846961,
    "developer": "Amazon Mobile LLC",
    "developerId": "Amazon+Mobile+LLC",
    "developerEmail": "feedback-amazon-app-android@amazon.com",
    "developerWebsite": "http://www.amazon.co.jp",
    "developerAddress": "Amazon Mobile LLC\n500 9th Avenue N,\nSeattle, WA 98109",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "size": "Varies with device",
    "description": "Product Features* Customers are able to shop millions of products on any of Amazon's sites around the world from a single app*Use Alexa to help you shop—just use your voice to search for products on Amazon, track your orders, and reorder your favorite items. Tap the microphone icon and say “where’s my stuff?” to access open orders. Reorder products by saying “reorder paper towels” or “buy more batteries”.* Take advantage of 1-Click ordering, customer support, Wish Lists, create or find a baby or wedding registry, order tracking, and more* Scan product barcodes and images to compare prices and check availability using Scan It * Check out Gold Box Deals - including the Deal of the Day and Lightning Deals, and get automatically notified when new deals become available* Send and share links to products via email, SMS, Facebook, Twitter, and more* Sign-up for automatic shipment notifications to know when your order ships and arrives* Buy with confidence, knowing that all transactions are securely processedProduct DescriptionThe Amazon Shopping app lets you shop millions of products and manage your Amazon orders from anywhere. Browse, shop by department, compare prices, read reviews, share products with friends, and check the status of your orders. Compare prices and availability by typing in your search, scanning a barcode or an image with your camera, or using your voice. Never miss a deal with easy access to Lightning Deals and the Deal of the Day. You can also sign-up for shipment notifications to know when your order ships and arrives. You have full access to your Shopping Cart, Wish Lists, payment and Prime shipping options, Subscribe & Save order history, and 1-Click settings, just like on the full Amazon.com site. All Amazon Shopping app purchases are routed through Amazon's secure servers to encrypt and safeguard your personal information.Important Note Regarding PermissionsPlease note that the Amazon Shopping app requires access to the following services to operate properly:* Contacts: This permission is used to so that you can access your phone contacts from the Amazon app for the purposes of sending Amazon gift cards and inviting friends to use the Amazon app.  * SMS: This permission is used to simplify the process of phone number verification when creating an Amazon account registered to your mobile phone number.* Camera: This permission is for Scan It, a new way to search for items quickly by scanning them with your camera.* Flashlight: This permission is used to turn on the flash when using Scan It in low light conditions.* Microphone: This permissions is used to support Voice Search and Voice Shopping Assistant features.  * Location: Location permissions are used to assist customers in searching for Amazon Lockers near their current location.* Account: This permission is used for integration with Facebook and other social networks you have connected to your device to allow you to share products with friends and family.* Phone: This permission is used to pre-populate and dial the Amazon Customer Service number.* Storage: This permission is required to support notifications in China.* Wifi: This permissions is used when setting up either a Dash Button or Dash Wand using the Amazon Shopping app.OS Requirements: Requires Android OS 4.1or higher and a rear-facing camera. The Amazon App for Tablets is available on Google Play. Search for \"Amazon Tablet\" to install the app and begin shopping.",
    "descriptionHTML": "Product Features<br><br>* Customers are able to shop millions of products on any of Amazon&apos;s sites around the world from a single app<br>*Use Alexa to help you shop&#x2014;just use your voice to search for products on Amazon, track your orders, and reorder your favorite items. Tap the microphone icon and say &#x201C;where&#x2019;s my stuff?&#x201D; to access open orders. Reorder products by saying &#x201C;reorder paper towels&#x201D; or &#x201C;buy more batteries&#x201D;.<br>* Take advantage of 1-Click ordering, customer support, Wish Lists, create or find a baby or wedding registry, order tracking, and more<br>* Scan product barcodes and images to compare prices and check availability using Scan It <br>* Check out Gold Box Deals - including the Deal of the Day and Lightning Deals, and get automatically notified when new deals become available<br>* Send and share links to products via email, SMS, Facebook, Twitter, and more<br>* Sign-up for automatic shipment notifications to know when your order ships and arrives<br>* Buy with confidence, knowing that all transactions are securely processed<br><br><br>Product Description<br><br>The Amazon Shopping app lets you shop millions of products and manage your Amazon orders from anywhere. Browse, shop by department, compare prices, read reviews, share products with friends, and check the status of your orders. <br>Compare prices and availability by typing in your search, scanning a barcode or an image with your camera, or using your voice. Never miss a deal with easy access to Lightning Deals and the Deal of the Day. You can also sign-up for shipment notifications to know when your order ships and arrives. You have full access to your Shopping Cart, Wish Lists, payment and Prime shipping options, Subscribe &amp; Save order history, and 1-Click settings, just like on the full Amazon.com site. All Amazon Shopping app purchases are routed through Amazon&apos;s secure servers to encrypt and safeguard your personal information.<br><br><br>Important Note Regarding Permissions<br><br>Please note that the Amazon Shopping app requires access to the following services to operate properly:<br>* Contacts: This permission is used to so that you can access your phone contacts from the Amazon app for the purposes of sending Amazon gift cards and inviting friends to use the Amazon app.  <br>* SMS: This permission is used to simplify the process of phone number verification when creating an Amazon account registered to your mobile phone number.<br>* Camera: This permission is for Scan It, a new way to search for items quickly by scanning them with your camera.<br>* Flashlight: This permission is used to turn on the flash when using Scan It in low light conditions.<br>* Microphone: This permissions is used to support Voice Search and Voice Shopping Assistant features.  <br>* Location: Location permissions are used to assist customers in searching for Amazon Lockers near their current location.<br>* Account: This permission is used for integration with Facebook and other social networks you have connected to your device to allow you to share products with friends and family.<br>* Phone: This permission is used to pre-populate and dial the Amazon Customer Service number.<br>* Storage: This permission is required to support notifications in China.<br>* Wifi: This permissions is used when setting up either a Dash Button or Dash Wand using the Amazon Shopping app.<br><br><br>OS Requirements: Requires Android OS 4.1or higher and a rear-facing camera. The Amazon App for Tablets is available on Google Play. Search for &quot;Amazon Tablet&quot; to install the app and begin shopping.",
    "histogram": {
        "1": 66503,
        "2": 24408,
        "3": 57241,
        "4": 146503,
        "5": 552306
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/fOz6gmBXOl23HXaLAgenKAanQRiPsh4DlcuP6jLpLs5nlkUotF7qBou4eMD87b7Pcrby=h310",
        "//lh3.googleusercontent.com/DNDzjtYCdvn-7ruGyxn1ubUFXNT_MsIvyQyRorYecPnSDbW68oR0g4FuKD4lMlEjkA=h310",
        "//lh3.googleusercontent.com/ga0SZ7Vm6wkrZbWxbJGkjqi11crMzE3l8gSh6fJXrXoZioYbupuw4hTSpZ_P88L-rLk=h310",
        "//lh3.googleusercontent.com/aTr4Wt6T1LYXzYVOXSmjMEJsi6WfxooHSOIdT1O_EGPqKE4IKgu6J5Xpq5oYhWG7iHM=h310",
        "//lh3.googleusercontent.com/xAprmroXPVlum0ilvBo0ugIrgzrlNIojMXQLKTQY2Ot90xtGvgJ3jWPRSwRQ74HhXQ=h310",
        "//lh3.googleusercontent.com/4RgQ1s16DAUbxr7J5p9NyQXxivzfhNpB8uCb4ehjMwS4TGih-jHqFcDQcCMWiRXqzTI=h310",
        "//lh3.googleusercontent.com/FnE9pZxakdZ-2rrDYcgMiLu7bRMu8XH-ywDHsuZOt_f5BnN-xhhj5hCxO1jZxgkeCQ=h310",
        "//lh3.googleusercontent.com/7aBx7urODD8OfAqrubDw9B3rzQw9128rW1OocowDocOQTs5e4tpsDV5PdoZowDB4jw=h310"
    ],
    "comments": [
        "really sucks at creating a new shipping address. switching to another app to copy then paste in the address fields will completely erase everything you typed so far in the entire page so its impossible to paste the address bits into each field. very annoying and surprised the team didn't look into this.",
        "You shouldn't offer next day delivery if you can't follow through with it! Next time I'll buy locally for $40 more but at least I'll have my part and not lose out on $2000 of income due to your incompetence! Ordered on time Friday, paid for Saturday delivery, and now I won't get it until Tuesday! Oh well, I'm sure Amazon could care less. I did get a refund on shipping and a $40 shopping credit so...... There's that I suppose!",
        "Ever since the update before the last one, I have not been able to use the app on my Wi-Fi. I can use it on my phone data but as soon as I switch to Wi-Fi it immediately stops working. I don't know why my Wi-Fi would be a problem considering I can use everything in my house that needs Wi-Fi to work.",
        "I don't like how Prime is very easy to accidentally sign up to but a right pain to get out of. Seems like Amazon are being kinda tricky. A good company would act more professionally.",
        "Galaxy S8. Fine since January, last two weeks its freezing and logging out constantly. Have to use web browser to shop Amazon. Extremely uncool for mega Corp, espesh as a new Prime member. Cannot uninstall cuz comes on phone. Have updated several times.",
        "App is useless after update cant select size, still useless after 2 more updates, why cant we use the old version that worked properly?, come on amazon get ur act together!!!  Glad to see uv'e went back to the old version for size\\colours, so back up to 5 stars"
    ],
    "recentChanges": [
        "AR View is now available on Android. AR View helps you make better shopping decisions by allowing you to visualize the products in your own living space, so you can make sure they fit your style. Simply open the Amazon App, tap on the camera icon and choose AR View. To use AR view on Android devices, you will first have to download the Google ARCore App from the Play store. AR View is only available for customers using Pixel, Pixel +, Pixel 2, Pixel 2+, S7, S8, Note 8 on Android 7.0 and up."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.amazon.mShop.android.shopping&hl=en&gl=us",
    "appId": "com.amazon.mShop.android.shopping"
}