{
    "title": "Citizens Bank Mobile Banking",
    "summary": "Bank from anywhere with the Citizens Bank Mobile Banking App",
    "icon": "//lh6.ggpht.com/48DcPiXatWDOFG6mx78Gr1wn733HBRPynuo8fm5jXO4BZ7Avpg2jS5oNP14I7pJnNL8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 14810,
    "developer": "Citizens Bank, N.A.",
    "developerId": "Citizens+Bank,+N.A.",
    "developerEmail": "mobilesupport@citizensbank.com",
    "developerWebsite": "http://www.citizensbank.com/online-and-mobile-banking/apps.aspx",
    "developerAddress": "Citizens Bank\n100 Sockanosset Cross Rd\nCranston, RI 02920",
    "updated": "January 24, 2018",
    "version": "4.1.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "The Citizens Bank FREE Mobile Banking app allows you to check available balances and activity, transfer funds, pay bills, manage your billers, Send Money with Zelle, deposit checks, and locate ATMs and branches – all on your schedule, at your convenience. The Citizens Bank Mobile Banking app is available to all Citizens Bank Online Banking customers. Accessing the app is easy – simply use the same Online User ID and Password you have established for Citizens Bank Online Banking. FEATURES Access the bank accounts you manage at Citizens Bank Online BankingView account balances See recent activity Pay BillsSend Money with Zelle®Transfer money between accounts Deposit checksQuickly see selected balances without logging in with Fast BalanceReceive account alerts SECURITY AND PRIVACY Our Citizens Bank Online Guarantee® protects you from fraud with 100% Online and Mobile fraud protection. The technical security measures Citizens Bank employs--including state-of-the-art encryption technology, firewalls and secure logon--protect your accounts from unauthorized users. Just like most major credit cards, you are protected 100% against unauthorized online and mobile transactions, visit www.citizensbank.com/security to learn more. We are committed to protecting the privacy of your financial information. See our online Privacy Policy on our web site at www.citizensbank.com/privacy CONTACT US Get help when you need it - Find ATMs and branches near your current location or search by city, state or zip code with our built in branch locator. Contact Customer Service 24/7 with our click to call right from your Android.¹ To receive funds or request money, the recipient’s email address or U.S. mobile number must already be enrolled with Zelle. \"Within Minutes\" payments require an active Visa® Debit Card. You do not need a Visa® Debit Card for Standard (3-day) payment delivery. Debit card transaction and point-of-sale limits apply to Zelle transactions.²At this time, customers cannot receive funds sent or request money from an account with a financial institution that has not partnered with Zelle.  Work is underway to implement a solution quickly.  In the meantime, the sender can explore other alternatives with their financial institution to send funds.Zelle and the Zelle related marks are wholly owned by Early Warning Services, LLC and are used herein under license.©2017 Citizens Financial Group, Inc. All rights reserved.Citizens Bank is a brand name of Citizens Bank, N.A. and Citizens Bank of Pennsylvania.Member FDIC",
    "descriptionHTML": "The Citizens Bank FREE Mobile Banking app allows you to check available balances and activity, transfer funds, pay bills, manage your billers, Send Money with Zelle, deposit checks, and locate ATMs and branches &#x2013; all on your schedule, at your convenience. <br><br>The Citizens Bank Mobile Banking app is available to all Citizens Bank Online Banking customers. Accessing the app is easy &#x2013; simply use the same Online User ID and Password you have established for Citizens Bank Online Banking. <br><br>FEATURES <br>Access the bank accounts you manage at Citizens Bank Online Banking<br>View account balances <br>See recent activity <br>Pay Bills<br>Send Money with Zelle&#xAE;<br>Transfer money between accounts <br>Deposit checks<br>Quickly see selected balances without logging in with Fast Balance<br><br>Receive account alerts <br><br>SECURITY AND PRIVACY <br>Our Citizens Bank Online Guarantee&#xAE; protects you from fraud with 100% Online and Mobile fraud protection. The technical security measures Citizens Bank employs--including state-of-the-art encryption technology, firewalls and secure logon--protect your accounts from unauthorized users. Just like most major credit cards, you are protected 100% against unauthorized online and mobile transactions, visit www.citizensbank.com/security to learn more. <br><br>We are committed to protecting the privacy of your financial information. See our online Privacy Policy on our web site at www.citizensbank.com/privacy <br><br>CONTACT US <br>Get help when you need it - Find ATMs and branches near your current location or search by city, state or zip code with our built in branch locator. Contact Customer Service 24/7 with our click to call right from your Android.<br><br>&#xB9; To receive funds or request money, the recipient&#x2019;s email address or U.S. mobile number must already be enrolled with Zelle. &quot;Within Minutes&quot; payments require an active Visa&#xAE; Debit Card. You do not need a Visa&#xAE; Debit Card for Standard (3-day) payment delivery. Debit card transaction and point-of-sale limits apply to Zelle transactions.<br><br>&#xB2;At this time, customers cannot receive funds sent or request money from an account with a financial institution that has not partnered with Zelle.  Work is underway to implement a solution quickly.  In the meantime, the sender can explore other alternatives with their financial institution to send funds.<br><br>Zelle and the Zelle related marks are wholly owned by Early Warning Services, LLC and are used herein under license.<br><br>&#xA9;2017 Citizens Financial Group, Inc. All rights reserved.<br>Citizens Bank is a brand name of Citizens Bank, N.A. and Citizens Bank of Pennsylvania.<br>Member FDIC",
    "histogram": {
        "1": 1579,
        "2": 661,
        "3": 1083,
        "4": 3042,
        "5": 8445
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/9BOCmll_CsTF4Uwhg77T8Pl8MHXwphMWnonBNGkKQCGmloYdaffAcSJYkF9pN-LpT-I=h310",
        "//lh3.googleusercontent.com/AQfjw-OWto6TWXBER2qr7BxpyNHVpeUFrjPNhFHrVGwh7YKA1wTurBon47l7p09nng=h310",
        "//lh3.googleusercontent.com/YvAqs73B85l3n-7lqIoEUrEoUBUBxI0b1Pq7S1nq2ybyIRbwNvNd2-wsDvMteWqnqQ=h310",
        "//lh3.googleusercontent.com/5vhYaWjwIHe5noZY4pS1qBIzJJp6dfFtSX8cuMRk7LyMSoVQk__be-R9hAM8CxD_asJJ=h310",
        "//lh3.googleusercontent.com/uctmap8BxloVbdZgPnoaWNzsWreTQjLXHTUpsu22__BeBM28we9uUIozyNMZ6CoRgK8=h310",
        "//lh3.ggpht.com/3I_73ZZY5G46Gl9l6Zr74DTjQYgtoH1HijdM208uygZGJadUeY4wWtKV0gS5AivAyTw=h310",
        "//lh3.googleusercontent.com/yShkE2rBBKYPi3k-8kSExFV8Sru5qSScBc7xUhalCoLFTe63IQo0_PhW9QsrbRLyixo=h310",
        "//lh3.googleusercontent.com/Qfoar6YzyJf8de1yBBzeJ9ZHHBpuUQCcc3hPEwNKTk2HAi3LI_6leC9aZhwWGDDRd_Y=h310"
    ],
    "comments": [
        "This app is a Joke. I thought that TD Bank had an ugly UI... And then I saw this. The Apple one looks okay. But this, eww. You couldn't find an uglier set up for the PIN to sing in? And then no finger print scanner? Do you guys need an Android Developer? When should I expect an update on this app? Jesus!  Update:02/26/18  New update, and the same ugly UI. It hurts my eyes.",
        "Would love to know what tech company your using for app development. .Could you have possibly made this app any worse?..Oh Yea let's update it !..Straight up stuck on stupid..This reflects so poorly on your company it'd embarrassing",
        "The Android implementation is terrible. I'm on the cleanest form of Android and it always has trouble logging me in. It just loads and loads. In contrast, my iPhone app works great. Get it together CB, the millions of ppl using Android deserve better, including Google(Android) Pay support.",
        "App has always been great and reliable. But for the past week it no longer remembers the 4 digit PIN you set up. Not a big deal but a little frustrating when all other banking apps I use have also made the transition to fingerprint log in! Three weeks later still no fix.",
        "Have used this app for a long as they've had one without major issues. Just recently updated it, won't even open. Even uninstalled and reinstalled, still won't work. I've been contemplating switching banks, this just gave me more reason. Totally useless.",
        "I love the app csuse its easy for me to check my balances also pay bills with. I gave it a four only because I set it up so I could use a pin to get on instead of my long password and it worked for a little bit then wouldn't work again."
    ],
    "recentChanges": [
        "• Updates to mobile deposit limits.",
        "• Enhancements to the enrollment process."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.citizensbank.androidapp&hl=en&gl=us",
    "appId": "com.citizensbank.androidapp"
}