{
    "title": "No Blood",
    "summary": "A program to help Jehovah&#39;s Witnesses on emergency situations.",
    "icon": "//lh5.ggpht.com/g8t-Nq5lNguT1ULxb_jh2UEZtGH3G5D-1ICJ85tAtHeQMjsQCGsSz3jDTXJDt9qq0A=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.4,
    "reviews": 198,
    "developer": "Ruben Reis",
    "developerId": "5475969422065599966",
    "developerEmail": "info@rrproducoes.com",
    "developerWebsite": "http://csssounds.com/",
    "updated": "October 8, 2014",
    "version": "1.0.3.1",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "A program to help Jehovah's Witnesses on emergency situations. It provides multiple information on the device to alert the founder of his treatment will, as to the use of blood.MAIN FEATURES-Two widgets (with time and weather)-Notification icon-Personal information-Medical information-Useful links-Possibility to add a widget to the Lock Screen-Includes Google Wear WidgetIMPORTANTThis program does NOT replace the original DPA or a Will Testament. LANGUAGESPortuguese,EnglishINFORMATIONThis software is NOT official from Watchtower Bible and Tract Society or any other official representative of Jehovah's Witnesses.",
    "descriptionHTML": "A program to help Jehovah&apos;s Witnesses on emergency situations. It provides multiple information on the device to alert the founder of his treatment will, as to the use of blood.<br><br>MAIN FEATURES<br>-Two widgets (with time and weather)<br>-Notification icon<br>-Personal information<br>-Medical information<br>-Useful links<br>-Possibility to add a widget to the Lock Screen<br>-Includes Google Wear Widget<br><br><br>IMPORTANT<br>This program does NOT replace the original DPA or a Will Testament. <br><br><br>LANGUAGES<br>Portuguese,English<br><br><br>INFORMATION<br>This software is NOT official from Watchtower Bible and Tract Society or any other official representative of Jehovah&apos;s Witnesses.",
    "histogram": {
        "1": 9,
        "2": 8,
        "3": 11,
        "4": 41,
        "5": 129
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/Vn_XLpaJIQqcWO2k-2iMARNRo2EIMCYLVJhe4X2Hg5OIoA2CqtCNsTG4yOIrQ7zhZEY=h310",
        "//lh6.ggpht.com/pDYZmRSMKCIRJVM7Uyq9PIZ-HpsX2pSUQsPkuaBECAL7GBFlqT8OCGbDoG40Vh-UlzGl=h310",
        "//lh5.ggpht.com/dxYUxy3iP_zrF28o5Cc6w0-DrOiOu8q55kh_WXQDPAgzkyS9lRPA2n8KGzFy3cbwS3Sa=h310",
        "//lh3.ggpht.com/ZeOdWPD7oynq3cf3NQGxWIiwGH0wIJBzPefCfHACman0cfzqqPtv8v3dTLtFQznjpQ=h310"
    ],
    "comments": [
        "Need some instructions How does one install this to show in the lock screen. Seems this is the true value of this app. That it would alert one to look for your DPA card. Note that some Phone cases have a place to store cards. A way to point to its location seems pertinent. I don't mind beta testing it for you on my Samsung Note II.",
        "It is a work in progress Great idea needs a few adjustments made. Like more space to write medication surgery and so on",
        "Great if any emergencies arise This app is very useful in giving medical professionals the information that they need to treat witnesses.",
        "Very important app to have on your phone. Thank you. This is essential for all JW's. I love the function where they can just click \"Call Proxy\" and your health care agent will be called immediately.",
        "This app is great. I love how you can still see it on the lock screen.",
        "I love the app just wish you would let us know how to put it on the lockscreen so it'll open up"
    ],
    "recentChanges": [
        "More text allowed on the information"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.csssounds.noblood&hl=en&gl=us",
    "appId": "com.csssounds.noblood"
}