{
    "title": "Viper SmartStart",
    "summary": "Start your car from virtually anywhere with your Android phone or smart watch!",
    "icon": "//lh3.googleusercontent.com/iG4Ga0YfhkQ5n348WRH084QilSw-YRMw-IPxpV6XoR19P2g35YDh5u54WLc5kILp_g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 3.9,
    "reviews": 6694,
    "developer": "Directed Electronics",
    "developerId": "Directed+Electronics",
    "developerEmail": "support@mysmartstart.com",
    "developerWebsite": "http://mysmartstart.com",
    "developerAddress": "1 Viper Way\nVista, CA  92081",
    "updated": "November 29, 2017",
    "version": "4.3.4",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Start, locate and control your car from virtually anywhere with your Android phone or Android Wear device!“Making the cloud-connected car a reality” - Edmunds.com\"Without a doubt, one of the coolest apps I've ever seen\"- GIZMODOWith the release of its all-new 4th generation Viper SmartStart app, connecting with and controlling your vehicle is easier than ever – including control via your Android Wear smart watch! - Add a Viper SmartStart module to the Viper remote start or security system in your car so you can start, lock and unlock your car from virtually anywhere.- Add a Viper SmartStart GPS module instead, and you can also locate your car, share activity on Facebook (because your car needs friends, too), and set safety notifications if your car is speeding or goes where it's not supposed to go. - For the ultimate connected car experience, install a complete Viper SmartStart Digital System and you’ll also get notified if your vehicle sets a diagnostic code, along with direct feedback from the car databus for feature status. Check out the 60 Day Free Trial GPS Premium service that’s included at no extra cost with these systems!- For even more convenience, add a Viper SmartKey module and your car will unlock when it detects you approaching, and lock again automatically when you walk away. Now you can securely remote start, lock/unlock, or find your car using your Android device, with the exciting new 4.0 SmartStart app from Viper.The sleek, modern dashboard of Viper SmartStart 4.0 gives you fingertip control over the following features of your installed Viper remote start or security/remote start system: - Lock/arm - Unlock/disarm - Remote car starter - Trunk release - Panic - Aux channelsFollow these three simple steps to get Viper SmartStart: 1) Download the free Viper SmartStart app 2) Get a SmartStart system installed in your vehicle 3) Set up your account, and start using your SmartStart systemViper SmartStart 4.0 also includes Viper Motor Club, providing convenient flat rate 24/7 access to our nationwide roadside assistance network. Just press a button in the app to get connected for towing due to breakdown or accidents, or assistance with a dead battery or flat tire. No hardware or service purchase required. Latest features:- Convenient widget added for one-touch command execution from your home screen- Two new dashboards added that allow you to pick the layout and features most important to you- Enhanced remote start feedback: Ever started your car from your smartphone, but weren’t sure afterwards if the car was actually running? No problem with v4.2, the app confirms the command and then follows it up a few moments later to let you know if the engine is running, or stopped (digital systems only). The details are providedright on the dashboard too, no need to check the status page.- Enhanced command feedback: Now when you send a command to your SmartStart system, the app provides the details for the command right on the dashboard and keeps them there in case you forget and want to check back later to confirm what happened. Doors locked at 8:30AM? Check! (all systems)- Last command sent: Tired of having to refresh the Status page and wait for it to update just so you could check on whether you remembered to lock the doors? Now you can simply open the Status page and your last command sent is displayed at the top.- Push Notification: All of your important vehicle alerts will now be delivered through push notification.4.0 features:- New swipe to start feature eliminates accidental remote start commands (modern dashboard)- Four user-selectable dashboards and launch page settings – now you can customize the app for the way you use it- Map page now integrates GPS and SmartPark features seamlessly- Start, lock or unlock your car using your Android Wear smart watch, or send other commands. - Receive alert notifications on your phone and Android Wear smart watch",
    "descriptionHTML": "Start, locate and control your car from virtually anywhere with your Android phone or Android Wear device!<br><br>&#x201C;Making the cloud-connected car a reality&#x201D; <br>- Edmunds.com<br><br>&quot;Without a doubt, one of the coolest apps I&apos;ve ever seen&quot;<br>- GIZMODO<br><br>With the release of its all-new 4th generation Viper SmartStart app, connecting with and controlling your vehicle is easier than ever &#x2013; including control via your Android Wear smart watch! <br><br>- Add a Viper SmartStart module to the Viper remote start or security system in your car so you can start, lock and unlock your car from virtually anywhere.<br><br>- Add a Viper SmartStart GPS module instead, and you can also locate your car, share activity on Facebook (because your car needs friends, too), and set safety notifications if your car is speeding or goes where it&apos;s not supposed to go. <br><br>- For the ultimate connected car experience, install a complete Viper SmartStart Digital System and you&#x2019;ll also get notified if your vehicle sets a diagnostic code, along with direct feedback from the car databus for feature status. Check out the 60 Day Free Trial GPS Premium service that&#x2019;s included at no extra cost with these systems!<br><br>- For even more convenience, add a Viper SmartKey module and your car will unlock when it detects you approaching, and lock again automatically when you walk away. <br><br>Now you can securely remote start, lock/unlock, or find your car using your Android device, with the exciting new 4.0 SmartStart app from Viper.<br>The sleek, modern dashboard of Viper SmartStart 4.0 gives you fingertip control over the following features of your installed Viper remote start or security/remote start system:<br> - Lock/arm<br> - Unlock/disarm<br> - Remote car starter<br> - Trunk release<br> - Panic<br> - Aux channels<br><br>Follow these three simple steps to get Viper SmartStart:<br> 1) Download the free Viper SmartStart app<br> 2) Get a SmartStart system installed in your vehicle<br> 3) Set up your account, and start using your SmartStart system<br><br>Viper SmartStart 4.0 also includes Viper Motor Club, providing convenient flat rate 24/7 access to our nationwide roadside assistance network. Just press a button in the app to get connected for towing due to breakdown or accidents, or assistance with a dead battery or flat tire. No hardware or service purchase required. <br><br>Latest features:<br><br>- Convenient widget added for one-touch command execution from your home screen<br><br>- Two new dashboards added that allow you to pick the layout and features most important to you<br><br>- Enhanced remote start feedback: Ever started your car from your smartphone, but weren&#x2019;t sure afterwards if the car was actually running? No problem with v4.2, the app confirms the command and then follows it up a few moments later to let you know if the engine is running, or stopped (digital systems only). The details are provided<br>right on the dashboard too, no need to check the status page.<br><br>- Enhanced command feedback: Now when you send a command to your SmartStart system, the app provides the details for the command right on the dashboard and keeps them there in case you forget and want to check back later to confirm what happened. Doors locked at 8:30AM? Check! (all systems)<br><br>- Last command sent: Tired of having to refresh the Status page and wait for it to update just so you could check on whether you remembered to lock the doors? Now you can simply open the Status page and your last command sent is displayed at the top.<br><br>- Push Notification: All of your important vehicle alerts will now be delivered through push notification.<br><br>4.0 features:<br><br>- New swipe to start feature eliminates accidental remote start commands (modern dashboard)<br><br>- Four user-selectable dashboards and launch page settings &#x2013; now you can customize the app for the way you use it<br><br>- Map page now integrates GPS and SmartPark features seamlessly<br><br>- Start, lock or unlock your car using your Android Wear smart watch, or send other commands. <br><br>- Receive alert notifications on your phone and Android Wear smart watch",
    "histogram": {
        "1": 1117,
        "2": 343,
        "3": 512,
        "4": 1125,
        "5": 3597
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/6RQj2BlP-AHSz1CyTEB8PbFPHYfq2uWALS6QsF8ydcii9htzPQQyiWBgSaPuD0OOkEIK=h310",
        "//lh3.googleusercontent.com/Ia4u5_qxEB77dUcYqJZjsLYIhAY0j6pI_vhqATy7lnXCBF23jFtMqJCv193_bSVqiDo=h310",
        "//lh3.googleusercontent.com/4Z-PP1oyqbtbo6jlxygoaQ0zSy3EMIDEsHi0yKf584YegjfwmrYxAdZU4IjYVDe2BA=h310",
        "//lh3.googleusercontent.com/YgmKHh9PnWcJC6gJP7WUgx8QbVrcf3LWdccFjJd4fp5okxbqC9O_zdh7hKBNh82JU-w=h310",
        "//lh3.googleusercontent.com/snese0Yz_zJdZNtCoAjlL3-JfRpSCW7ST3B1-bychvePyfg25h52B4enCq3uBRQl4jT8=h310",
        "//lh3.googleusercontent.com/ZOHQ0GG6-VIevloh-vT2tXE5ER2qQgN72BUk7d3x_08lT32K1PzoloW1MybKJhPqR8Fh=h310",
        "//lh3.googleusercontent.com/GJaUMf9sJ4CF6LjuyDotuDMe4zzkkEiatV9AJgMQch25F3_OPXa9M8X0xKSaslLxdUQY=h310",
        "//lh3.googleusercontent.com/4mleLa--W9rRxb6yi2e01jWUO07szsLONTIfoRMbQgDA7_B0J2Fu8qpfCRE4sXv-yic=h310",
        "//lh3.googleusercontent.com/EQ_oAxfLiRP8FB47UPKgEoBxkYfa46RY94o0iD3kAQBZO2lKyPrzMcnJAHPUNQTzkQ=h310",
        "//lh3.googleusercontent.com/tD8oqjbHV9_la2-vPd2wA3AibXFWGnr70mvGxbCo0z_eyByeC9Iqtw0NuMEEhB9JIFNK=h310",
        "//lh3.googleusercontent.com/kSmiOCea5YeJPiBon_KOHStdpB_HmsZHJGJpXxE0WOqsMp96ZVsIRIhljHR3sxe_7A=h310",
        "//lh3.googleusercontent.com/bmcWoXUBA0z_ILVbWJ0yV_Gk5bQXrbYQVytT4Wj2VGbYLS74LSKMJxio35lhohiiT4Cb=h310",
        "//lh3.googleusercontent.com/JeVSwVZo-vENBitpJ5AhUPehF--kqw4suULPeWKYNYUZBQbCgjtnbRzl92JFEkfmfFo=h310",
        "//lh3.googleusercontent.com/Qd20VqCPUi1Kd3q35_CA6gBMe-KK0a11JTo_PN_4zM8Jv8gqdVqfkOlAOh_COj-LBJvs=h310"
    ],
    "video": "https://www.youtube.com/embed/H0ZH1HLN5WE",
    "comments": [
        "It's better then the previous versions!! I wish they would make an app for my Samsung Gear S watches that's one of the most popular smart watches on the market it's been out 3 years and they haven't made it app for the times and system how ridiculous I wish they would do it please somebody make the app....  1-3-18  I have bought the Samsung Gear S3, and its still NOT supported!!! COME ON VIPER!! GET WITH THE PROGRAM... Samsung doesn't have an android wear platform for it's watches.... please update your software",
        "Voice actions don't work at all. Claims to support them on website, but I have confirmed permissions and everything I can think of but nothing will allow it to work. All I can do is open app with voice. It's also really slow to connect to the car and start it. It would be nice if it was faster.",
        "So far the app is working well but seems to have a short fall that I concidering pretty big. It will send you a notification when an alarm trips but does not show you what the alarm was for (ie door, Hood, shock sensor, etc). Would be nice to know how urgent the matter is.",
        "App works well. On the Android Wear app, would love to be able to customize the placement of screens. Remote Start is the first window but I would rather have the lock/unlock screen first. There's also a bit of a lag before my car unlocks.",
        "Great app, especially for those verrrry cold Chicago mornings.  Has nevet failed.  One of the really cool things is the ability to remotely start from any location, even from another city, it really freaked my friends out. The only minor draw back is I wish there wad some type of animation to show engine is really on, i.e. fan, exhaust smoke, etc. Absolutely love it!!!",
        "For some reason this new update is going through battery percentage consistently. The other thing i find interesting is how you get it for car security and you have to give up your phone security and privacy for it.  It demands access  to your camera and files which have nothing to do with a car alarm. .. I've had it for almost 3 years, works great for the alarm but the privacy and battery issue are a draw back"
    ],
    "recentChanges": [
        "- Improved SmartFence and Speed Alert Scheduling feature",
        "- Support for 48 hour grace period",
        "- Various bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.directed.android.viper&hl=en&gl=us",
    "appId": "com.directed.android.viper"
}