{
    "title": "EvolveSMS (Text Messaging)",
    "summary": "The future of messaging: smooth - fast - fun - evolved.",
    "icon": "//lh5.ggpht.com/SH0GFeQzs7w6RZoQ5PIxndvUPvoB1PB8eW_p28oeiRzw8P0MOThX_n_6H0iuJ1LKD9FT=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4,
    "reviews": 28712,
    "developer": "Luke Klinker",
    "developerId": "6337185423976596164",
    "developerEmail": "luke@klinkerapps.com",
    "developerWebsite": "http://www.klinkerapps.com",
    "developerAddress": "1218 NE 49th St\nAnkeny, IA 50021",
    "updated": "December 26, 2017",
    "version": "5.1.7",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "EvolveSMS is a powerful texting replacement app that makes talking to your friends quick, fun and easy! It’s been designed from the bottom up with the newest Android design guidelines in mind to look beautiful and function just as well.Ultimate CustomizationBetween downloadable add-on themes, the vast number of built in Material Design themes, and the wealth of notification customization, you are guaranteed to never get bored with this app!Fast and Unique• Everything is a swipe away. Our smooth and beautiful, single page, interface makes keeping up with your friends a breeze!• No compromises on the quick replies. Get a full version of the app, as a popup, wherever you are and over anything you are working on!Powerful Media SupportQuickly send GIFs, videos, audio, contact cards, and pictures to any of your contacts! Oh, and did I mention the vast library of GIFs that can be searched without leaving the app? Find the perfect animation, for any occasion.And that is just an overview of what makes EvolveSMS so special. There are also features like archives, batch delete, password protection, a private inbox, dual-SIM support, a stand-alone Android Wear app, plus so much more!Please note: The app is completely free to download and enjoy for everyone! There are 2 different in-app purchases to expand on the functionality of the app with things like theming, scheduling SMS, a private inbox, sending GIFs, and more. If you like the app or want more features, feel free to show it and buy the in-app purchases in the settings menu :)",
    "descriptionHTML": "<b>EvolveSMS</b> is a powerful texting replacement app that makes talking to your friends quick, fun and easy! It&#x2019;s been designed from the bottom up with the newest Android design guidelines in mind to look beautiful and function just as well.<br><br><b>Ultimate Customization</b><br>Between downloadable add-on themes, the vast number of built in <i>Material Design</i> themes, and the wealth of notification customization, you are guaranteed to never get bored with this app!<br><br><b>Fast and Unique</b><br>&#x2022; Everything is a swipe away. Our smooth and beautiful, single page, interface makes keeping up with your friends a breeze!<br>&#x2022; No compromises on the quick replies. Get a full version of the app, as a popup, wherever you are and over anything you are working on!<br><br><b>Powerful Media Support</b><br>Quickly send GIFs, videos, audio, contact cards, and pictures to any of your contacts! Oh, and did I mention the vast library of GIFs that can be searched without leaving the app? Find the perfect animation, for any occasion.<br><br>And that is just an overview of what makes <i>EvolveSMS</i> so special. There are also features like archives, batch delete, password protection, a private inbox, dual-SIM support, a stand-alone <b>Android Wear</b> app, plus <i>so much more!</i><br><br>Please note: The app is completely free to download and enjoy for everyone! There are 2 different in-app purchases to expand on the functionality of the app with things like theming, scheduling SMS, a private inbox, sending GIFs, and more. If you like the app or want more features, feel free to show it and buy the in-app purchases in the settings menu :)",
    "histogram": {
        "1": 2117,
        "2": 1904,
        "3": 3581,
        "4": 7328,
        "5": 13782
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/qnx70U-yp5wDtu31ans0nQzNa63kkGAIDQvuBk2M3ox8NElK9p6tZoGcwvh2d9_mEIs=h310",
        "//lh3.googleusercontent.com/gu82k9eXWawuM8S0YVALpxivDLc5emScKUF3LOVwQAW6M-NZyaKCaTeBKQLixL4k8LY=h310",
        "//lh3.googleusercontent.com/OJ_p82c5uXDYGBHOTgjqNC1K_r9pbk72E7rGD3fhBajSwih-OT6bBkFWDZc4eXfTpE3G=h310",
        "//lh3.googleusercontent.com/-2ruChcLQA9jdvSIfOq_N0E8Jxpxsx7VKia1B_namABMuKECX76BtAnVng2m1He-rQ=h310",
        "//lh3.googleusercontent.com/vaGUGHWiQRFVp6mChQFrzaSIsZHWSRbOiYYaDdcjWz9f6ZrbENt_eyihR-Be2a6YVQ=h310",
        "//lh3.googleusercontent.com/i762CA_Q1BXBDv3-fLfa3LhDebVAWsNU-raCTgfXfD3XjRYKtIfwE9wGulzWhryto10=h310"
    ],
    "video": "https://www.youtube.com/embed/v-uVi9MU_MI",
    "comments": [
        "I've always loved evolve sms but I just got a new XZ premium and it has improved on this phone.. I know you have to pay for themeing but it's worth it!! Looks fantastic, feels great.. And if you're too tight to pay the nice developers for there hard work, then you lose out!!! You get what you pay for.. No adverts or anything that pesters you to spend more money.. I love it!! Thank you 😁👍",
        "When it works it's great, but when it doesn't, well why have it if it doesn't work, right. Not sure why it just stops receiving texts, sometimes it's because I forget to turn off VPN, stock app works with VPN. But other times it just doesn't work.  Was using it on One Plus 5 stock Hydrogen. Latest is Hydrogen updated to Oreo. Seems to be OK so far with most things, but not changing rating because can't set ringtones. Can select them, but they don't take, at all. Back to stock messaging app for now.",
        "Just about perfect. I love the dark theming.  The live preview widgit is awesome. General UI layout it the best ever. I love swiping between conversations and having the list on the left in portait mode. Powerful tools  I wish this would be able to integrate Facebook messenger where it combines SMS and fb conversations in line like Windows phone 7 used to. That was powerful but fb broke it.  Small UI suggestions: Use parallaxing on elements to give a subtle 3d look. Squish bounce the screen when you scroll to the bottom.  Small usability issues: Sometimes it splits my conversations into two conversations with the same contact. Sometimes it loads photos a little clunky, lag where it has to reload. Textra feels a bit snappier the evolve  By far the cleanest, best overall app on the market! Well worth the money.",
        "On the Moto X4, MMS messages repeatedly get sent to the wrong person, and sending messages disables wifi until I go into Android's settings and turn it back on.   Worked great on my old phone though...",
        "Thank you soon much! I have been having problems with text messages coming in split and out of order. I tried every SMS app imaginable trying to fix . Reset my phone, tried SMS timestamp fix apps. You name it and I tried it! This is the only thing that worked! Forever grateful! You can manually put your carrier info in advance settings. Thanks!",
        "Dec 26 2017 update...  large images send at 161kb?.. just wish the Android Wear Reply would work correctly.. ( only responds to last message conversation.. it just acts like it sends for previous messages )"
    ],
    "recentChanges": [
        "This version adds the ability to access the archive from the three dot overflow menu on the conversation list, and it allows you to directly schedule an SMS from the three dot overflow menu when viewing a conversation."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.klinker.android.evolve_sms&hl=en&gl=us",
    "appId": "com.klinker.android.evolve_sms"
}