{
    "title": "Every3 - Meal Reminder",
    "summary": "Every3 will remind you to eat every 3 hours and monitor your meals.",
    "icon": "//lh3.googleusercontent.com/IL9buonRz5czoewlAvhZmUguHcM9DqZUylGv59nCUE8jf2cDA9w1euYAMA9GrJvHag=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.3,
    "reviews": 1209,
    "developer": "Nir Benjano",
    "developerId": "Nir+Benjano",
    "developerEmail": "nir4benjano@gmail.com",
    "developerWebsite": "http://www.every3hours.com",
    "updated": "February 15, 2015",
    "version": "1.431",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "According to \"The 3-Hours Diet\" you should eat every 3 hours. However, many people forget eating meals during the days.  Every3  will help you remember when to eat on time.Eating every 3 hours will boost your body fat burning, prevent low-blood sugar (Hypoglycemia) and help you lose weight.How does it work? The app is designed to be as simple as possible. All you have to do is download and enter the app once. That's it!Every3 features: Monitor your meals by marking them as eaten or not, statistics (Month, Days in month, specific day) and a full screen alarm.So you want a healthier life and monitor your daily meals  Every3  is the app for you!  Did you like the app? Have some good ideas how to improve it? Let us know!  ",
    "descriptionHTML": "According to &quot;The 3-Hours Diet&quot; you should eat every <b>3 hours</b>. However, many people forget eating meals during the days. <b> Every3 </b> will help you remember when to eat on time.<br><br>Eating every 3 hours will boost your body fat burning, prevent low-blood sugar (Hypoglycemia) and help you lose weight.<br><br>How does it work? The app is designed to be as simple as possible. All you have to do is download and enter the app once. That&apos;s it!<br><br>Every3 features: Monitor your meals by marking them as eaten or not, statistics (Month, Days in month, specific day) and a full screen alarm.<br><br><br>So you want a healthier life and monitor your daily meals <b> Every3 </b> is the app for you!<br><br><br><u> <b> Did you like the app? Have some good ideas how to improve it? Let us know! </b> </u>",
    "histogram": {
        "1": 42,
        "2": 30,
        "3": 94,
        "4": 356,
        "5": 687
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ypk86Y7MHC7uMGS5EKIWpRTAC06qf9myF9ijyST8mUG8yrbA2bzVCSU0rNNNtg2S_FBL=h310",
        "//lh3.googleusercontent.com/LSxQJ-73gMva2KsTNQFeqEfl9vU3t6nyosYVRDrouOLS3wVdQwyLXReaUyYWx6OZxwM=h310",
        "//lh3.googleusercontent.com/ZhyanTLafjbUQfuN9H7gqeunz_DD9_GSG0aC0CWqhrdxdt8d40DwcgwzfmMUZM5IvQ=h310",
        "//lh3.googleusercontent.com/9gc-39a_Cyes3cQcNWTZXpESKOB57cjd2YkYBGHvCJlO_tfmuI8o-n9kfy-0tYs7q7aL=h310",
        "//lh3.googleusercontent.com/fqGXr2YIg7G0FkeOhyhQK2Yry82t6pbwvzhAGihxCtHQN9_7pw_8J5C32Dlan4fyqa-t=h310",
        "//lh3.googleusercontent.com/Jrt62IadZIwwMqbziYP1zRawpunis3PluxKFX-srnI3iB1ytPmtzVb5AB2cnJaBFR6I=h310",
        "//lh3.googleusercontent.com/T39jV_TPgT3kVXl4CW0e_2ym_h7MI_kJYEtMObAncuILsubTBbr7UhRtSDz_Oeg2IPE=h310",
        "//lh3.ggpht.com/__atELLypASNHe910fgQLX8QIVuMHFb6SqEsZ1QOmchWI7MvfqMJ5bThBkDmYJAqgg=h310"
    ],
    "comments": [
        "Needs some changes... This app is perfect for what it's intended for. However, I would like to be able to delete certain sections like for instance I eat breakfast, lunch, snack and dinner so I would like to be able to set it up this way. Also when it rings(notification) there should be a text box pop up that lets me write in what food I had... Maybe have it as an upgrade. I'd pay about 2 bucks for this upgrade! It's worth it to me!",
        "First rating:  App is great reminder when to eat and also helps me not to eat until its time! Great customer support. I emailed question & got an immediate response. Keep up the good work and when updating please continue to keep it simple. Second rating:  Boo! Last year I sent a message saying the times were off when you enter manually. I actually uninstalled it a couple months ago and was hoping it would have been fixed. I entered 645 and it shows 825. I entered 915 and it shows 1015",
        "Overall a nice, very helpful app But, my metabolism has picked up so much I'm snacking every 1 1/2 hrs. There's no \"add\" option so I can include those snacks. Mind you, they're healthy snacks so I want to take credit for them. Not being able to add them, it can throw off my times.",
        "This is exactly what I have been looking for! I forget to eat or skip meals all together. My weight has gained since being so sporadic with meals, not decreased. So I needed somthing to remind me since starting Trim Healthy Mama! Thank you so much for all your hard work on this app!",
        "Great Reminder for When to Eat I love this app for help in keeping my eating on track.  I like how the reminder bell pops up but doesn't cover the whole screen & it's cute.  It's also easy to indicate whether you've eaten or want to delay or skip a meal.",
        "Great app Simple and does exactly what it's supposed  to. Keeps me on top of eating  every 3 no matter how busy i get. I just  would like to have a log or be able to look back at previous  days.  I keep track of every single thing i do in training."
    ],
    "recentChanges": [
        "1.431",
        "- Bug fix for small devices.",
        "- 12h for english users.",
        "- PLEASE NOTE: your setting might be restored to the default sorry for the inconvenience.",
        "1.43",
        "- New Design!",
        "- Navigation Drawer for switching between screens.",
        "- Contact us",
        "- New Day view.",
        "- Fixed time for vibrating alerts so it won't bother you.",
        "- Faster and Better.",
        "- note: some bugs might occur since we did many changes in the app. Please be patient and let us know if you encounter a bug and we will fix it ASAP."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.benjano.every3&hl=en&gl=us",
    "appId": "com.benjano.every3"
}