{
    "title": "Golfshot: Golf GPS + Tee Times",
    "summary": "Enjoy a whole new golf experience with Golfshot&#39;s game-improving features.",
    "icon": "//lh6.ggpht.com/VuUFNfP-V30w8U2eloUbOV9a7xG_J2X5nMiYSPSHAaCVLUfmPioPJPuzjy8ZwHiKBE--=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.3,
    "reviews": 7464,
    "developer": "Shotzoom Software",
    "developerId": "5427737915563914060",
    "developerEmail": "info@golfshot.com",
    "developerWebsite": "http://golfshotgps.com",
    "developerAddress": "11101 W 120th Ave.\nSuite 300\nBroomfield, CO, 80021",
    "updated": "January 31, 2018",
    "version": "1.28.0",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "Improve your game and master the course while enjoying a whole, new golf experience with Golfshot. Over 2 million members of the Golfshot community rely on our golf GPS apps to save time, money, and strokes. Get the best golf GPS features right on your wrist with Android Wear™.ALL Golfshot members enjoy these accurate and innovative free features:- Distances to the center of the green - Easy-to-use scorecard for yourself or your foursome - Ability to zoom in on detailed satellite imagery of each course- Insightful statistics of your game, covering fairways hit, greens in regulation (GIR), and putts per hole for in-depth analysis- Android Wear support- Up to 80% off tee times provided by GolfNow when booked through Golfshot - The latest golf news, both in your app and in our monthly member newsletter- FREE one-week trial of Golfshot ProWant even more? Upgrade to Golfshot Pro and you’ll get:- Interactive, real-time distances to all hazards and targets- Premium Android Wear features including real-time GPS distances, scoring and shot tracking - Dynamic 3D flyover previews of each hole to help with golf course strategy- Personalized club recommendations based on your statistics- Save an extra $20 off a Hot Deal tee time provided by GolfNow- Integrated Handicap Index® tracking for existing GHIN® members- Zoom in on targets for better shot planning and saved strokes- Scoring for Skins, Nassau, Match play and other games- Over $200 in savings on golf equipment, tee times, golf magazine subscriptions, golf travel, golf instruction and moreGolfshot GPS requires a GPS-enabled Android phone or tablet. Android Wear™ requires an Android wearable device and watch app. For battery-saving tips, FAQs and all of the amazing features of Golfshot visit golfshotgps.com. If you don’t see your course in Golfshot, email us at support@golfshot.com to request a course update or send us your feedback!Created by Shotzoom LLC",
    "descriptionHTML": "Improve your game and master the course while enjoying a whole, new golf experience with Golfshot. Over 2 million members of the Golfshot community rely on our golf GPS apps to save time, money, and strokes. Get the best golf GPS features right on your wrist with Android Wear&#x2122;.<br><br>ALL Golfshot members enjoy these accurate and innovative free features:<br>- Distances to the center of the green <br>- Easy-to-use scorecard for yourself or your foursome <br>- Ability to zoom in on detailed satellite imagery of each course<br>- Insightful statistics of your game, covering fairways hit, greens in regulation (GIR), and putts per hole for in-depth analysis<br>- Android Wear support<br>- Up to 80% off tee times provided by GolfNow when booked through Golfshot <br>- The latest golf news, both in your app and in our monthly member newsletter<br>- FREE one-week trial of Golfshot Pro<br><br>Want even more? Upgrade to Golfshot Pro and you&#x2019;ll get:<br>- Interactive, real-time distances to all hazards and targets<br>- Premium Android Wear features including real-time GPS distances, scoring and shot tracking <br>- Dynamic 3D flyover previews of each hole to help with golf course strategy<br>- Personalized club recommendations based on your statistics<br>- Save an extra $20 off a Hot Deal tee time provided by GolfNow<br>- Integrated Handicap Index&#xAE; tracking for existing GHIN&#xAE; members<br>- Zoom in on targets for better shot planning and saved strokes<br>- Scoring for Skins, Nassau, Match play and other games<br>- Over $200 in savings on golf equipment, tee times, golf magazine subscriptions, golf travel, golf instruction and more<br><br>Golfshot GPS requires a GPS-enabled Android phone or tablet. Android Wear&#x2122; requires an Android wearable device and watch app. For battery-saving tips, FAQs and all of the amazing features of Golfshot visit golfshotgps.com. If you don&#x2019;t see your course in Golfshot, email us at support@golfshot.com to request a course update or send us your feedback!<br>Created by Shotzoom LLC",
    "histogram": {
        "1": 497,
        "2": 228,
        "3": 496,
        "4": 1876,
        "5": 4367
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/wm9cxEl8ZX1j8zKxgD2FnuF4E7Zx8vup5E8pjOVcLIHJz-XNYvegGUHt3TwSNayhiQ=h310",
        "//lh3.googleusercontent.com/3dHQ5Y3oUepehltSOJDxaRT9CuvDzr9Oy8GVb3AOCzmWv2WctVBVOO3RHCfG-5Ggvw=h310",
        "//lh3.googleusercontent.com/80ABouU8LC-5Pd5xTkqlPJ1NdUHQ1aN8fiHujkC9x8Xsqtt_vGXxiPME_QNlgQAtf8P8=h310",
        "//lh3.googleusercontent.com/Xyw6RsklWFJDw8nCGyFeFHchMEVpflBYMRBdR2xFXRASVFfPDii3vPfRU-rwRWQyaMU=h310",
        "//lh3.googleusercontent.com/yinzYFri-xR7JnA1OMjv-zmSIVOg30-ZY7hXaFNAOgv2Kr5NKE-ueKJtLVjDvPR9esez=h310",
        "//lh3.googleusercontent.com/f79493TyEfVgTXTz8n7KYeDmOC6fPpk6_zQvmTwa7tKEzQBqxjNp5rSEG_xp-Fc6hyc=h310",
        "//lh3.googleusercontent.com/y9Jb5V52sx9YKXXZrI0vp5s9UgV8Rz1GQJY5x-1lMj07YzsDbmvYPGikxLB8pegsJOk=h310",
        "//lh3.googleusercontent.com/-MjQjQffLl0BcR993G4nmqM9lK8kjvX2NPPhqT68pbXH3FgNc-sjZI053_edWk_n0Yc=h310",
        "//lh3.googleusercontent.com/N4wUpVV1DDzHFedPmzCUVCsP7lbAmDI0cTfqPED1ASv8DYQ0pNKrUmTk3C9JUMGvA3w=h310",
        "//lh3.googleusercontent.com/Jbta20OoxS60yfiv6fP8wd5xMJYCwKb9GZyGJNww-XBxadRYrqTu9V1alFAom3n5frA=h310",
        "//lh3.googleusercontent.com/sFequUnbsmia96dA0on7uiYjxT7YV762xxeXrXdIuSYElNuDlZ8TKtinnaLSDd0Ekx0=h310"
    ],
    "video": "https://www.youtube.com/embed/4b__N01DD5o",
    "comments": [
        "It's ok.. but after using the iPhone version in the past, this Android version is a joke. Good for basic stat keeping but nothing else. It's been long enough now that this Android version should have been fixed.",
        "I always use this apps everytime I play golf to record my scores and check the distance. But there is a course with no network do the gps cannot work. Comparwd to other apps this is more easier to use and most recommeded. I already shared this apps to my golf buddies and they start using it as well.",
        "I really like the layout of this app. I've been using it for several years now and of all the gps apps available this one has the best overall feel. It updates quickly and is fairly accurate. I just wish they had a Samsung app so I could use it on my Gear S3.",
        "Great app has many courses around the world. Truly great for a golfer.",
        "Great for mapping tournament rounds before getting to an unknown course",
        "The only golf app you need on your phone"
    ],
    "recentChanges": [
        "Version 1.28.0",
        "- Various bug fixes and improvements",
        "Golfshot supports Android Wear",
        "To view these features:",
        "- Start a new round on your Android device, a notification will appear on your Android Wear device",
        "- Launch the companion app via the 'View Details' action"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.shotzoom.golfshot2&hl=en&gl=us",
    "appId": "com.shotzoom.golfshot2"
}