{
    "title": "Couch to 5K by RunDouble",
    "summary": "Train for 5K with the Couch to 5K training program.",
    "icon": "https://lh6.ggpht.com/9yoKjGhX_PB-rq-gWnA5Xyf2PBGE9j6tNPe6i-rxgAUn792FM3Bobhv7zLxRgJw1jr2U=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.7,
    "reviews": 15472,
    "developer": "RunDouble C25K",
    "developerId": "RunDouble+C25K",
    "developerEmail": "help@rundouble.com",
    "developerWebsite": "http://www.rundouble.com/",
    "developerAddress": "123 South View Road\nCarlton\nNottingham\nNG4 3QX",
    "updated": "February 6, 2017",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "RunDouble Couch to 5K goes way beyond any other Couch to 5K app! It is a complete training companion, starting with the Couch to 5K plan, and taking you right through to half marathon.Couch to 5K by RunDouble is the easiest way to meet your goal, of running 5K in just 9 weeks, but don't feel daunted, you can take longer if you need. It follows the popular Couch to 5K plan, (not to be confused with the alternative C25K plan), written by Josh Clark.You choose the pace - from a gentle jog to a quick run, and progress through the weeks at your leisure. Run three times a week, taking rest days between, and soon you'll be calling yourself a runner. Put your headphones on, choose your own music, and just follow the prompts. Starting with just 1 minute of running at a time, it couldn't be easier. Couch to 5K is growing as fast as popular as workouts like Zumba, simply because of the number of people who are turning their lives around. No gym fees, no expensive equipment, no special diet. You just you, your phone, and the road. Get out there, get Couch to 5K and get yourself fit. RunDouble now supports Android Wear, meaning you have your stats right there on your wrist - no more bulky phone holders. Rundouble Couch to 5K includes these programs: - Couch to 5K - Zero to 10K - Five to 10K - 5K improver - Interval training - 10K event training - Half marathon event training - Varying length \"Fun Runs\", from 1 km to 10 milesAll plans are free to try for the first two weeks, then you can upgrade for less than the cost of a coffee. The fun runs are completely free. Features: - The only Couch to 5K training app to feature MyFitnessPal integration, and post to your workout diary. - Runs in the background, unlike some other apps which stop when you switch off the screen. - Prompts you to change pace while working through the Couch to 5K training program.  - Tracks your time, distance and pace, announcing these to you at the end of each interval. - Plays a playlist of your choosing, from your personal music selection. Or alternatively, use another app to play music.- View your previous runs on your phone or on our website- Additional pace updates at set intervals- Half way marker- Programmable pace warning (target pace)- Support for heart rate monitor- Web service:    + Track your progress    + View your route on a map    + View detailed statistics about your workout    + Post to Facebook, and share your successes with friends",
    "descriptionHTML": "RunDouble Couch to 5K goes way beyond any other Couch to 5K app! It is a complete training companion, starting with the Couch to 5K plan, and taking you right through to half marathon.<br><br>Couch to 5K by RunDouble is the easiest way to meet your goal, of running 5K in just 9 weeks, but don&apos;t feel daunted, you can take longer if you need. It follows the popular Couch to 5K plan, (not to be confused with the alternative C25K plan), written by Josh Clark.<br><br>You choose the pace - from a gentle jog to a quick run, and progress through the weeks at your leisure. Run three times a week, taking rest days between, and soon you&apos;ll be calling yourself a runner. Put your headphones on, choose your own music, and just follow the prompts. Starting with just 1 minute of running at a time, it couldn&apos;t be easier. <br><br>Couch to 5K is growing as fast as popular as workouts like Zumba, simply because of the number of people who are turning their lives around. No gym fees, no expensive equipment, no special diet. You just you, your phone, and the road. Get out there, get Couch to 5K and get yourself fit. <br><br>RunDouble now supports Android Wear, meaning you have your stats right there on your wrist - no more bulky phone holders. <br><br>Rundouble Couch to 5K includes these programs:<br> - Couch to 5K<br> - Zero to 10K<br> - Five to 10K<br> - 5K improver - Interval training<br> - 10K event training<br> - Half marathon event training<br> - Varying length &quot;Fun Runs&quot;, from 1 km to 10 miles<br><br>All plans are free to try for the first two weeks, then you can upgrade for less than the cost of a coffee. The fun runs are completely free. <br><br>Features:<br> - The only Couch to 5K training app to feature MyFitnessPal integration, and post to your workout diary.<br> - Runs in the background, unlike some other apps which stop when you switch off the screen.<br> - Prompts you to change pace while working through the Couch to 5K training program. <br> - Tracks your time, distance and pace, announcing these to you at the end of each interval. <br>- Plays a playlist of your choosing, from your personal music selection. Or alternatively, use another app to play music.<br>- View your previous runs on your phone or on our website<br>- Additional pace updates at set intervals<br>- Half way marker<br>- Programmable pace warning (target pace)<br>- Support for heart rate monitor<br>- Web service:<br>    + Track your progress<br>    + View your route on a map<br>    + View detailed statistics about your workout<br>    + Post to Facebook, and share your successes with friends",
    "histogram": {
        "1": 433,
        "2": 223,
        "3": 346,
        "4": 1521,
        "5": 12949
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/S6HSbNEw-cJgGQTb48TB33kRisLpKScn7M4rqZIuTtb4fCDSUvo4jEc5YGCrhqM35d0=h310",
        "//lh3.ggpht.com/nzMoQxNMOTmdQDH6qc2zn21KBBDHli8tZ9xTsTKHk_Rtomo8DqZt6uw5ryjGiI5iWxo=h310",
        "//lh3.ggpht.com/Pj7MHQ4UeJtxALIMtjBSy0w4_4SkzuqNGTr6KAx6ShYTDkcSuh8d2tMLczULWRU_wtM=h310"
    ],
    "comments": [
        "Best app for C25K, makes the job done but sadly no updates since 2014. + voice announcements tell what to do, and even when to turn around on half distance! also automatically lowers the music volume + detailed stats after the run + heart rate monitor support - doesn't handle loss of gps signal well. any underground passage leaves a dip on the pace plot - there's a webpage generated for each run. it contains a GPX download link but always returns empty file",
        "Easy to use. Starts out at a pace that's not too easy but not too hard especially for someone like me who can walk for long periods of time but never ran for more than a minute straight. I also like that it syncs with Myfitnesspal.  UPDATE: The app doesn't seem to have a constant connection to GPS so you don't get full credit for your hard work. At first I thought it was my phone but nike and map my run kept up with the GPS perfectly. I love the simple design of this app along with the options for interval training but teleporting me on the map and giving credit for 0.5 miles when I've done 1.5 miles sucks.",
        "I was very skeptical about being able to do the C25K training as it is detailed out, especially with the jump to running 20 mins straight in week 5 after never running more than 8 mins. I have been pleasantly surprised! The controls are very easy to use. The only time I have had issues w/ GPS is when running on a track in the local YMCA. Can switch between KM/Miles, can change how often the voice updates you on your pace (or whatever stats you choose for it to announce). I'm now at the end of week 6 and can say that the C25K program is the real deal and this app is a pretty decent app to assist with it. Having it log to MyFitnessPal automatically is also a very nice bonus.",
        "Your results will be as good as your dedication and diet.  This app does exactly what it's meant to do.  Guide you to become a better runner.  I've had nike+, addidas micoach, cardiotrainer (when it was active), and endomondo. I wish the interface was more \"up to date\". But the functionality is hands down the best right now.  2018 update.  I'm retiring this app in favor of S Health and my nike+ training apps. They've come a long way.  This one is great for specific training of races... But the others have more usefullness to me right now.  Last update for this app was a year ago, i hope they didn't abandon this.",
        "This app helped me recondition after having shin splints for over a year! And even passed a PT Test 2 mile run after a week and a half of using this and only this. Only used the run walk intervals to train and ran the whole 2 miles in 15:36. Great music integration, especially using my 175-180 beats per minute playlist. Polar Bluetooth HR Monitor works perfectly.  SGalaxy S7",
        "This is the best running app have tried.  I love the simple and easy to navigate menus.  I have gone from a fat slob who had never been able to run a continuous mile in 29 years of living to being able to run 2 miles in a row which is crazy for me and I'm not even done with the first program yet. I cant reccomend this app enough."
    ],
    "recentChanges": [
        "Full changelog: http://bit.ly/HQQGSo"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.rundouble.companion&hl=en&gl=us",
    "appId": "com.rundouble.companion"
}