{
    "title": "Music Center for Wear",
    "summary": "Customizable music control for Wear devices with support for hardware buttons.",
    "icon": "//lh3.googleusercontent.com/BNmnZ6ljPfi96AnaamI4-cERqKMCBve3Tv3liH7a-eAxKlF673qWFwKKAKBjhVNQWqE6=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.8,
    "reviews": 53,
    "developer": "matejdro",
    "developerId": "matejdro",
    "developerEmail": "matejdro+support@gmail.com",
    "developerWebsite": "https://github.com/matejdro/WearMusicCenter",
    "updated": "January 22, 2018",
    "version": "Varies with device",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "size": "Varies with device",
    "description": "Music Center completely revamps music control from your watch. Instead of persistent notification that you have to find every time you want to pause or change track, app devotes full screen to the music control. That screen stays open and easily accessible until you manually decide to close it.Screen is divided into four big touchable sections that allow very easy control even without looking at the watch or even in difficult situations, for example, when riding a bike.All extra hardware buttons on the watches are fully supported and remappable, as is rotary crown, which controls the volume of the music.In addition to simple playback control, app can also start playback, either by resuming playback for any specific app or by starting your favorite playlist/artist/album etc. via tasker tasks.If the four full-screen actions are not enough, you can access extra action list by swiping upwards, which gives you unlimited amount of actions, to cover all your music apps and playlists. All actions are completely customizable, including their icons and text.",
    "descriptionHTML": "Music Center completely revamps music control from your watch. <br><br>Instead of persistent notification that you have to find every time you want to pause or change track, app devotes full screen to the music control. That screen stays open and easily accessible until you manually decide to close it.<br><br>Screen is divided into four big touchable sections that allow very easy control even without looking at the watch or even in difficult situations, for example, when riding a bike.<br><br>All extra hardware buttons on the watches are fully supported and remappable, as is rotary crown, which controls the volume of the music.<br><br>In addition to simple playback control, app can also start playback, either by resuming playback for any specific app or by starting your favorite playlist/artist/album etc. via tasker tasks.<br><br>If the four full-screen actions are not enough, you can access extra action list by swiping upwards, which gives you unlimited amount of actions, to cover all your music apps and playlists. All actions are completely customizable, including their icons and text.",
    "histogram": {
        "1": 12,
        "2": 2,
        "3": 3,
        "4": 6,
        "5": 30
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/0JWE9RmHP3C_5Z8kWSr2knm3x62jXXHvM4QuTKVrfKOfj3RU65wy1K7GnaTBxCmhBw=h310",
        "//lh3.googleusercontent.com/8-v4VlYechkfubZf5CY0I1Nczp7PHmY_Sy3_fMUn9gcSCaO0BHw05PLFBHpKWDUMhw=h310",
        "//lh3.googleusercontent.com/QonAUvwk5Muv_xBFv73HJYtvumNScxhTaTzRYe5EA_a38XUasQ2vKa0TjfLUGEABwcrI=h310",
        "//lh3.googleusercontent.com/pJBBH5oc0HFeY1R87SB4jGgi6ypsG87HOfHtrhFLtCNBSrJXQ3S3eMYRcDpZT70Ikw=h310",
        "//lh3.googleusercontent.com/pso08Y2hzVsTtTfUyXjnIKn4bkNo6oQEb2tK9FFbRuse5kkXOZdxB0OSOD2KUCfc6fSm=h310",
        "//lh3.googleusercontent.com/kNRvkgKud48UKqAlbtN6niEtlP4NymgC_tIlOuuTIEa_TnTmTdY5iE4vgQixh1DdiHE=h310",
        "//lh3.googleusercontent.com/UrpsnEszcv3StlMWTpWZ0EY3eS1Vx8tCd0Y8fw3NU_pDm4s3CKUnUgnbzhsEhPEuSB4=h310",
        "//lh3.googleusercontent.com/7gBj80IV02COIgypkXvmharEC41fiOpJNIbS5XvH_FQ6nQGK-qQIiRz7O0tiEiOZqjk=h310",
        "//lh3.googleusercontent.com/fXyN_QPeD33lKPWeTSLiF1VJXyrxsw6joAqsRAiCIBiYgeaRZct_ztfCQ34QtNfc9mo-=h310",
        "//lh3.googleusercontent.com/HwNECi3Pj3RE5amJW1_FefmEfP-0MYMg_Yb_wSYFOOCBetpsIdJutPJiaVd2aMwzaH8=h310"
    ],
    "video": "https://www.youtube.com/embed/vgr624u9IKQ",
    "comments": [
        "This is the most important app you can get for Android Wear 2. Hands down. Why? Too many reasons. First off the music controls are MONUMENTALLY better then the default. You can actually HIT THE BUTTONS. I don't think I need to tell anyone using Android Wear 2 that the default screen controller is extremely hard to hit, especially while driving. This brings me to my next point, physical button support. Why have so few apps integrated this?? It's true there's a lot of watches that only have the one button, which isn't really rebindable since it's needed for critical wear navigation. But what about those of us who saw the value of a second bindable physical button and went out of our way to buy one that did? We were left with a mediocre means of customization, one app, single click. Music center answers that problem too, not only does it finally allow us to CONTEXTUALLY bind single, double and even LONG press as a physical button for music controls, a must while driving. It also allows us to bind Tasker or other apps as well. All while within the app on the watch. Because the best part is, once we leave the app, it goes back to our original default, just like you'd imagine. This has completely remade my Android Wear experience and I may have to donate money to this dev because he is my hero. 😀  Sorry, I'm just genuinely excited how much this fixes for me.",
        "Great and beautiful way to easily see and control what you're listening to. Dev is communicative and addressed the two major issues I had with the latest release!",
        "Great app. And great developer. Responded to my email next day and fixed issue.",
        "Awesome app!! Had some bugs but the developer updated the code on git hub the same day. Waiting for an update now! Make sure to report bugs in settings!",
        "Ad-free, open source, perfect! You should have this in order to take the full advantage of your Android Wear.",
        "This app is amazing... Like no kidding would strongly recomend"
    ],
    "recentChanges": [
        "* Fixed weird physical button behavior (pressing one button could trigger actions on another one)",
        "* Added auto-start app blacklist",
        "* Added long press action",
        "* Added option to disable double press for physical buttons in ambient mode (fixes glitches on some watches)",
        "* Improved music refresh reliability",
        "* Various bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.matejdro.wearmusiccenter&hl=en&gl=us",
    "appId": "com.matejdro.wearmusiccenter"
}