{
    "title": "Domino's Pizza USA",
    "summary": "Order your Domino&#39;s favorites then follow the progress with Domino&#39;s Tracker®!",
    "icon": "https://lh3.ggpht.com/1qMAenQQmSAlTGuAU12gb2L6Ka6aX7XP3f3crKg3Sduwed_Lo1wV5taMLih3C0i-mFOs=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.7,
    "reviews": 965074,
    "developer": "Domino's Pizza LLC",
    "developerId": "Domino's+Pizza+LLC",
    "developerEmail": "androidsupport@dominos.com",
    "developerWebsite": "http://www.dominos.com",
    "updated": "February 23, 2018",
    "version": "Varies with device",
    "genre": "Food & Drink",
    "genreId": "FOOD_AND_DRINK",
    "size": "Varies with device",
    "description": "Conveniently order Domino’s from anywhere on your Android phone or tablet. Build your pizza just the way you like it or choose one of our specialty pizzas. Add items from the rest of our oven-baked menu including chicken, pasta, sandwiches, bread, drinks and desserts. And with the Domino’s Tracker ® you can follow your order from the moment you place it until it’s out for delivery or ready for pickup!Use the Domino’s app to order from locations in the United States, not including Puerto Rico. To place an order in Puerto Rico, visit www.DominosPR.com.¡Pide Domino’s en inglés o en español! Nuestro app se configura automáticamente con el idioma que has escogido para tu smartphone o tableta.Utilice la aplicación de Domino a la orden de localidades en los Estados Unidos, sin incluir Puerto Rico. Para realizar un pedido en Puerto Rico, visite www.DominosPR.com.FEATURES:· Create a Pizza Profile to easily access to your saved info and recent orders (not required)· Order faster than ever by creating an Easy Order!· Sign up for Domino’s Piece of the Pie Rewards™ and earn points toward free pizza!· Pay with cash, credit card, debit card or Domino’s gift card· Use our voice ordering assistant, Dom, to add items to your cart and to select a coupon· Connect with Ford Sync to track orders, or place an Easy Order or a Recent Order while on the go· Use Android Wear or Pebble watch to track orders, or place an Easy Order or Recent Order right from your wrist· Use Domino’s Tracker notifications to follow your order until it’s out for delivery or ready for pickup!APP PERMISSIONS:Location· Precise location/GPS – identifies your closest stores for easier carryout orderingPhone· Directly call phone numbers – makes it possible for you to call your local store with a single tap within the appCamera· Take pictures and videos – used to quickly capture debit or credit card information at checkoutPhotos/Media/Files· USB Storage – required for upgraded Google MapsMicrophone· Record audio – needed to enable Dom, our voice ordering assistantBluetooth connection information· Needed for integration with Ford Sync, Android Wear and Pebble watchDevice ID & call information· Read phone status and identity – required as part of the Ford Sync feature, this is used if you want to call your store through Sync while your phone screen is lockedOther· Full network access – this allows us to communicate with the Domino’s systems to provide you with the latest store menus and coupons and it is needed to place orders from the app· View network connections - required by Google Maps, which we use to show store locations· Network communication - enables push notifications, giving you access to app exclusives, coupons and deals· Control vibration – helps alert you to updates, like changes in order status as it progresses through the Tracker· Prevent phone from sleeping – if you are using your voice to order, the app will prevent the phone from going to sleep (which would otherwise happen because you aren’t tapping the phone)",
    "descriptionHTML": "Conveniently order Domino&#x2019;s from anywhere on your Android phone or tablet. Build your pizza just the way you like it or choose one of our specialty pizzas. Add items from the rest of our oven-baked menu including chicken, pasta, sandwiches, bread, drinks and desserts. And with the Domino&#x2019;s Tracker &#xAE; you can follow your order from the moment you place it until it&#x2019;s out for delivery or ready for pickup!<br><br>Use the Domino&#x2019;s app to order from locations in the United States, not including Puerto Rico. To place an order in Puerto Rico, visit www.DominosPR.com.<br><br>&#xA1;Pide Domino&#x2019;s en ingl&#xE9;s o en espa&#xF1;ol! Nuestro app se configura autom&#xE1;ticamente con el idioma que has escogido para tu smartphone o tableta.<br><br>Utilice la aplicaci&#xF3;n de Domino a la orden de localidades en los Estados Unidos, sin incluir Puerto Rico. Para realizar un pedido en Puerto Rico, visite www.DominosPR.com.<br><br>FEATURES:<br><br>&#xB7; Create a Pizza Profile to easily access to your saved info and recent orders (not required)<br><br>&#xB7; Order faster than ever by creating an Easy Order!<br><br>&#xB7; Sign up for Domino&#x2019;s Piece of the Pie Rewards&#x2122; and earn points toward free pizza!<br><br>&#xB7; Pay with cash, credit card, debit card or Domino&#x2019;s gift card<br><br>&#xB7; Use our voice ordering assistant, Dom, to add items to your cart and to select a coupon<br><br>&#xB7; Connect with Ford Sync to track orders, or place an Easy Order or a Recent Order while on the go<br><br>&#xB7; Use Android Wear or Pebble watch to track orders, or place an Easy Order or Recent Order right from your wrist<br><br>&#xB7; Use Domino&#x2019;s Tracker notifications to follow your order until it&#x2019;s out for delivery or ready for pickup!<br><br>APP PERMISSIONS:<br><br>Location<br>&#xB7; Precise location/GPS &#x2013; identifies your closest stores for easier carryout ordering<br><br>Phone<br>&#xB7; Directly call phone numbers &#x2013; makes it possible for you to call your local store with a single tap within the app<br><br>Camera<br>&#xB7; Take pictures and videos &#x2013; used to quickly capture debit or credit card information at checkout<br><br>Photos/Media/Files<br>&#xB7; USB Storage &#x2013; required for upgraded Google Maps<br><br>Microphone<br>&#xB7; Record audio &#x2013; needed to enable Dom, our voice ordering assistant<br><br>Bluetooth connection information<br>&#xB7; Needed for integration with Ford Sync, Android Wear and Pebble watch<br><br>Device ID &amp; call information<br>&#xB7; Read phone status and identity &#x2013; required as part of the Ford Sync feature, this is used if you want to call your store through Sync while your phone screen is locked<br><br>Other<br>&#xB7; Full network access &#x2013; this allows us to communicate with the Domino&#x2019;s systems to provide you with the latest store menus and coupons and it is needed to place orders from the app<br><br>&#xB7; View network connections - required by Google Maps, which we use to show store locations<br><br>&#xB7; Network communication - enables push notifications, giving you access to app exclusives, coupons and deals<br><br>&#xB7; Control vibration &#x2013; helps alert you to updates, like changes in order status as it progresses through the Tracker<br><br>&#xB7; Prevent phone from sleeping &#x2013; if you are using your voice to order, the app will prevent the phone from going to sleep (which would otherwise happen because you aren&#x2019;t tapping the phone)",
    "histogram": {
        "1": 10686,
        "2": 6369,
        "3": 22143,
        "4": 151332,
        "5": 774544
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/684kfLSboror1PIWYY8_M8W1IlYJfkq0gHitK_oZ6haqLUj5umlbfM21a4KuWVillhU=h310",
        "//lh3.googleusercontent.com/jl4N9jAElqD791yFYltKKHn-2SyW3pU-4gmWeHtG6LVPJ6r8YASqzdqJCYMBhReJYIMn=h310",
        "//lh3.googleusercontent.com/13ygYV3BMHn_CmUJtkxp03v00Szj0Iqn2mk6regrb2XX3f8_lkDgzTRyQ1iZ556qpb6j=h310",
        "//lh3.googleusercontent.com/iuINdniGeBA-uGQke_krfHiw9AbbFJQkPMbFwJ5dNMFbVnWtfolh6EhDhUqd5MksTw=h310",
        "//lh3.googleusercontent.com/2VvHM2Q37rIHSTzIV9k0X0IRU7g0ty7ZSqzPnFnF1kx6HZYwTr07sTEGhJl8E_PV4vc=h310",
        "//lh3.googleusercontent.com/1D8nttYFCsPP1_KnHbo7a_nMrYEYGW7GzhKxvhrg2q4uJb-lFPbuTMDONm-PXnuT-u8=h310",
        "//lh3.googleusercontent.com/9-jRJunCKaKnvbQZhdUNDP10VazOIkoImHeTalKWZKbYz1s9knCvJb3i53YeP7V0uQ=h310",
        "//lh3.googleusercontent.com/218IlZCSdKURqisP0YeXeT3PKeLMtjH4FOG6Na5Aabrm37BLMf5ujHb4EiMQk5diUZs=h310"
    ],
    "comments": [
        "The only thing I would change would be.... Every 10 pizzas get a free large not every 6 times you use the app for a medium that's like a free medium every 24 pizzas. I don't order a lot of pizza, but when I do I usually order two at a time I think this type of Kickback for app users only would benefit tremendously I know the developer doesn't work exclusively with Domino's but it would be nice to at least get a recommendation for this change to them. Thank you for your time. You have a wonderful day! Chad",
        "My favorite online/mobile pizza ordering app. Easy to use, love the delivery ETA / countdown after order is submitted. Only issue is that the \"Special Instructions\" section doesn't let you type more than a few words. My house is difficult to find so I wish I could type more for the delivery driver to see.",
        "This app let's you look for active coupons and shows you what on the menu you can use the coupons on, super convenient if you don't want to look for a coupon code. And if you make an account you can get points for a free medium pizza! It's pretty awesome. The app even tells you what is happening at the shop so you know when to go pick it up",
        "It's easy to use. The only complaints I have are that the codes for the local school fundraiser does not work when applied on the nights of the fundraiser (about once a month) so I have to call in and am not able to get my points on the app, and I get a message on my phone saying that the app has stopped when I'm not even using the app. I have to force stop the app when this happens or the message will continue popping up every hour or so if I don't.",
        "2+ years later, still no in app tipping!!! ;( Now beyond ridiculous! Works fantastic and would be 5 star when I can tip on the app. Makes no sense not to have that feature. More convenient for the customer, safer for the driver. Whats the problem??",
        "The app is responsive and doesn't feel clunky.  The layout is intuitive which makes for quick and easy navigation.   The ability to reorder a saved selection is great especially since you can just start with it and modify it from there if you want anything different, and it saves whatever coupon you were using. The pizza tracker is extremely useful (even if it feels like a timer that automatically transitions between states without someone actually triggering it manually), particularly for when it tells you when the driver left the store with your pizza, you can get the feel for how long it should take. The only change I would recommend would be a map which shows the driver's general location to get an even better idea of when they will be arriving, which us great if you don't plan to be hanging around within earshot of your front door (e.g. upstairs/downstairs or outside)."
    ],
    "recentChanges": [
        "- Bug fix for Android 8.0 and 8.1 Oreo"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.dominospizza&hl=en&gl=us",
    "appId": "com.dominospizza"
}