{
    "title": "Weather Live",
    "summary": "Weather Live: detailed forecasts and live weather conditions",
    "icon": "//lh3.googleusercontent.com/4sMtbaCmQVjZ58dvt0JPgYFn8BRzA9BlbKNGnfAj9yo9mrmje0pcQylsRlnAJd-Ki56-=w300",
    "price": "$5.99",
    "free": false,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.5,
    "reviews": 74486,
    "developer": "Apalon Apps",
    "developerId": "7148047194848561719",
    "developerEmail": "support@apalon.com",
    "developerWebsite": "http://www.apalon.com/weather_live_android.html",
    "developerAddress": "Unit 1, Digiweb Building,\nCollege Business and Technology Park\nBlanchardstown North Road\nDublin 15",
    "updated": "November 21, 2017",
    "version": "Varies with device",
    "genre": "Weather",
    "genreId": "WEATHER",
    "size": "Varies with device",
    "description": "Meet Weather Live. The most beautiful weather app. Ever.Don't let bad weather take you by surprise! Set the gorgeous animated wallpapers with live weather conditions on your home screen and be aware of any weather that is coming your way. Whether it is cloudy, rainy, snowy or even stormy outside, Weather Live will provide you with current weather conditions and forecast in your city and multiple locations all around the world. Cold or warm weather, it will magically come alive on the crisp screen of your device. You won’t even have to look out the window as Weather Live will make you feel like you are already outside! With an innovative technology Weather Live™ implemented into the app, we made it possible! • Weather forecasts for multiple locations all around the world• Live weather scenes reflecting real-time weather conditions• Beautiful weather widgets• Fabulous animated wallpaper with live weather conditions right on your home screen• Cloud, satellite, rain maps• Animated weather radar for any location in the USA• Bad weather warnings and alerts to warn you about severe weather in your area. Data provided by National Weather Service• Customizable layout. Choose weather parameters you want to be displayed in the layout settings• Local time in 12 or 24-hour format• 7-day and 24-hour weather forecast• \"Feels Like\" temperature. Today’s Min and Max• Wind direction and speed. Visibility details• Humidity and precipitation information. Pressure in inches, mm or mbar• Fahrenheit or Celsius and Miles or Kilometers• Easy navigation between cities: swipe either to the left or to the right to switch between locations• New York, Los Angeles, Chicago or any other location worldwide – get accurate weather forecasts wherever you are!Compatible with Android Wear: tested on Moto 360, Sony Smartwatch 3, Samsung Gear Live, LG G Watch.Get Weather Live and be prepared for any weather!Privacy Policy: http://apalon.com/privacy_policy.htmlEULA: http://www.apalon.com/terms_of_use.htmlAdChoices: http://www.apalon.com/privacy_policy.html#4",
    "descriptionHTML": "Meet Weather Live. The most beautiful weather app. Ever.<br><br>Don&apos;t let bad weather take you by surprise! Set the gorgeous animated wallpapers with live weather conditions on your home screen and be aware of any weather that is coming your way. Whether it is cloudy, rainy, snowy or even stormy outside, Weather Live will provide you with current weather conditions and forecast in your city and multiple locations all around the world. <br><br>Cold or warm weather, it will magically come alive on the crisp screen of your device. You won&#x2019;t even have to look out the window as Weather Live will make you feel like you are already outside! With an innovative technology Weather Live&#x2122; implemented into the app, we made it possible! <br><br>&#x2022; Weather forecasts for multiple locations all around the world<br>&#x2022; Live weather scenes reflecting real-time weather conditions<br>&#x2022; Beautiful weather widgets<br>&#x2022; Fabulous animated wallpaper with live weather conditions right on your home screen<br>&#x2022; Cloud, satellite, rain maps<br>&#x2022; Animated weather radar for any location in the USA<br>&#x2022; Bad weather warnings and alerts to warn you about severe weather in your area. Data provided by National Weather Service<br>&#x2022; Customizable layout. Choose weather parameters you want to be displayed in the layout settings<br>&#x2022; Local time in 12 or 24-hour format<br>&#x2022; 7-day and 24-hour weather forecast<br>&#x2022; &quot;Feels Like&quot; temperature. Today&#x2019;s Min and Max<br>&#x2022; Wind direction and speed. Visibility details<br>&#x2022; Humidity and precipitation information. Pressure in inches, mm or mbar<br>&#x2022; Fahrenheit or Celsius and Miles or Kilometers<br>&#x2022; Easy navigation between cities: swipe either to the left or to the right to switch between locations<br>&#x2022; New York, Los Angeles, Chicago or any other location worldwide &#x2013; get accurate weather forecasts wherever you are!<br><br>Compatible with Android Wear: tested on Moto 360, Sony Smartwatch 3, Samsung Gear Live, LG G Watch.<br><br><b>Get Weather Live and be prepared for any weather!</b><br><br>Privacy Policy: http://apalon.com/privacy_policy.html<br>EULA: http://www.apalon.com/terms_of_use.html<br>AdChoices: http://www.apalon.com/privacy_policy.html#4",
    "histogram": {
        "1": 1885,
        "2": 1526,
        "3": 3682,
        "4": 18200,
        "5": 49193
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/uNWrJWl0E41oVwQ5OEYB_9TDvnOcs-FpTFFxNafF7SQiGCj2XAqO05wiubX8usikp6s=h310",
        "//lh3.googleusercontent.com/8tuSFzCr2oaOXZg9JbWFwx1uMSAcb0MEMmqKZVtPFZLNBE0GWwazXwAXTp_fVMPcL3w=h310",
        "//lh3.googleusercontent.com/8gq8WWjGtA_ovHHkUylHPZmz7JsWQcfJMBw9UVWaUq3PVzAJfz9a5H6Hr7R0hXCe3qs=h310",
        "//lh3.googleusercontent.com/81Hk4PDuLbfopeed3io2A7_pA4-yf-25e20G-59SxGQwbW9Q-ean202OODLbaRP2xw=h310",
        "//lh3.googleusercontent.com/rmlGxYZ8bBHy0uw4j3iwW_iHl5ZgK9Ud1h6Jn2IOSOqObs0ojxIXwlX33py14Nc0vvA=h310",
        "//lh3.googleusercontent.com/YrSDGUIW2mKberpWvxLtx4fk0xudBdbhWMxizxTM15BECn7-IKvhMwPpEf5GrPKtdyoo=h310",
        "//lh3.googleusercontent.com/2Xbnu0gDHdUzEbRv63KfQQZJXJ9_Qu_5P9v0QjyF_YGDjG6JbAnCvb0k0abfsX4ayyQ=h310",
        "//lh3.googleusercontent.com/K4dzVm8e7OBr_S0Td-ltVQJdmXuS-_qZPZkOhYBS5nUDmIIhPZeczd7yDAKt4tj_Mv4D=h310",
        "//lh3.googleusercontent.com/o1CIPE_SpkTYwnOdGUGeTGkJoiq-uVWgaA2OFduloOjmnXVaWo95DM5OWnGBXxG8Jn7I=h310",
        "//lh6.ggpht.com/ViOLdXmm0UHe32pj2B4-gjb1jQ4A0kxaaFZsikusF-n34aSx-M5lM1p5rfHg0gbxysen=h310",
        "//lh3.googleusercontent.com/RUvBvhIwXHCrFeb7XNXQWMVcs_0kBkbWvwQ_7v_wzdST-V8pZ4QUu0cAeNbnPIB2sDQ=h310",
        "//lh3.googleusercontent.com/Kvn75417eN_H-sK6lzeUWyl29Zm_hwECsa6VWn1Er3zkuThXRhql5sSegkREUqD-FN0=h310",
        "//lh3.googleusercontent.com/tOR_ElGIEspNGDJTWI2VVVy_g_-WP2p3CjJ5yJ5K7K2mFAOoL2uYJ_pdyEuTbPLmPY0=h310",
        "//lh3.googleusercontent.com/h9eO1GiLQnJMpQzs4SsNmMoT8Ve-Hiuin_J9m39cZ4yyKyl9FTC4CbJNQGIE6UqmJ2sS=h310",
        "//lh3.googleusercontent.com/8sUST6f-fGd4AJu0yGUY-NYt0gOumohRi7NOkzHVHANQZtI5iwuqYLwO9RngFRx5heA=h310",
        "//lh3.googleusercontent.com/bSnZLu4I3HXgqKF1yFBKNE7XecKGkXrpst68S_DiZ3P--btK2-htEkItSCU2FHYIE6M=h310",
        "//lh3.googleusercontent.com/MUV4-x79HyUbWRhrAiGzrb8cNteoO8v1rGRGPb6xB9JGCOOBXx_-ANuGXAtsx-2Lsool=h310",
        "//lh5.ggpht.com/y1fJKbqDPw3kqAH5OCuz2HvG4DfBD2BY8XqovxJFe-mq0GQtn7u406fJn_eyELWGJCkD=h310",
        "//lh3.googleusercontent.com/trIJYn-77zbx_nUwWLwWwT4BKxDsvCVV1iHFRo9R3v1buysDnwbznaxBFVCoIN9c5g=h310",
        "//lh3.googleusercontent.com/Xrhv0p4yYbUPQQnIvJ6VyTFVWi0kF2DxSCoQqzMyAaDMBxmkinLvIHdGAseAUn0UKrY=h310"
    ],
    "video": "https://www.youtube.com/embed/Nu2a5JR9ve0",
    "comments": [
        "Great app, love the details. However. The radar could use some tweaks. Id like it if you could slow it down, and instead of two hour increments, make it half hour so it's more detailed and useful. At the moment the radar doesn't show my information I can use. Also, the background pictures of the weather need to be formatted for the Galaxy S8 screens.",
        "Since providing initial feedback and response by provider i have updated to five stars. Accuracy is now spot on and layout and other information is great. Thanks. I like the look and functionality but unfortunately the accuracy is not great. Often shows to expect rain on rainless days. Temperature and and cloud cover reasonably accurate. If forecast was consistently accurate I would give 5 stars. I'm using the paid version. Thank you.",
        "The widgets don't work for me. They'll be fine for a few days and then they'll go blank and never show anything until I replace them on my home screen. The clock only updates when the weather does, so you can't use it as a clock either. It looks pretty when it does work, though",
        "PERFECTION!! I HAD UNINSTALLED THIS APP A WHILE BACK DUE TO THE MY PHONE PROBLEMS, THAT HAS SINCE BEEN FIXED AND I HAVE NOW GOT MY WEATHER LIVE BACK ON BOARD!! ITS A VERY INFORMATIVE AND EASY TO USE, GREAT WORK DEV TEAM 👍 ❤️ ❤️ ❤️",
        "What did you Do to this APP?  I can no longer send Corrections when it's Wrong?   Do you Mean even when I don't WANT to use the \"Live Wallpaper,  I have no Choice?  And have Less Functionality than with your Less expensive version of only. 99¢,  to just Remove Ads?  Why did I pay for More,  but get less?  About to ININSTALL and Return to the Junky Stock app run by so-called AccuWeather",
        "Great, accurate weather app This app gives you accurate, official warnings from the national weather services. I've tried it with the Belgian and German weather services. You also get a warning for example half an hour before rain begins. So far I did not experience any errors in such warnings. Keep up your good work!"
    ],
    "recentChanges": [
        "★ This update brings new features that make your entire weather watching experience even better!",
        "★ Introducing social weather. From now and on Weather Live allows anyone to be a weather reporter. Confirm the weather or report your weather conditions to us and we’ll use the information to improve the forecast for your location.",
        "★ Sun and Moon section with a current position of the sun and the moon in the sky, moon phases, and the sunrise\\sunset and moonrise\\moonset times for the day."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.apalon.weatherlive&hl=en&gl=us",
    "appId": "com.apalon.weatherlive"
}