{
    "title": "Belly",
    "summary": "Earn points and get rewards for doing what you do best: being a loyal customer",
    "icon": "//lh3.ggpht.com/6_Jtu8cvKrGSENTCiS1MgKgkZbiGgHVEGN5FSt57uHFGk35oPkZKLOjvTASo5sT03Vo=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.4,
    "reviews": 11499,
    "developer": "Belly",
    "developerId": "Belly",
    "developerEmail": "support@bellycard.com",
    "developerWebsite": "http://www.bellycard.com",
    "updated": "October 17, 2016",
    "version": "Varies with device",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "size": "Varies with device",
    "description": "Belly is a universal loyalty program that offers one-of-a-kind rewards at the businesses you love, replacing boring \"Buy 10, Get 1 Free\" punch cards with free stuff you actually want. Belly Members scan their BellyCard or app at the in-store tablet, earning points that are redeemable for rewards unique to each Belly Business. With Belly, we offer one customer loyalty card to replace the rest. Link the mobile app to your physical BellyCard which can be picked up at any Belly Business. Use the app's \"Nearby Places\" feature to find locations to Belly when you're out and about on the town. Earn a free cup of coffee at the donut shop down the street. Name the Sandwich of the Month at your local deli. For the first time, you can have your cake and eat it too, or at least have the option of shoving it into your baker's face. Use your Google+ account to register with Belly! Keep your accounts connected for an easier user experience.Add the Belly widget to your Homescreen or Lockscreen for instant access! (The Lockscreen widget is only available on devices running Android 4.2+) Belly when you’re jet setting across the country. Major markets include:• Chicago• Austin• New York• Washington, D.C.• Miami• San FranciscoAnd more at bellycard.com/locationsPermissions Descriptions All information collected via the permissions below are used to enhance the app experience and allow us to continue to make it better than the best:Storage: Used to cache images and other data to make the app load and function better.Your Location (GPS & Network): Allows us to determine your location so we can find Businesses near you when you only when the app is open.Network Communications: Used to gather nearby businesses, account information and other data needed for the application to function.View Network/Wifi State: We can ensure you have an active internet connection before trying to download assets or information.Your Accounts: Used for Google Cloud Messaging notifications (optional in settings), and for an auto-complete email field on login/registrationVibrate: Used for Push Notification alert behavior (optional in settings)Wake Lock: Used for Google Cloud Messaging (push) notifications (optional in settings)Read Google Services Configurations: Required for the Google Maps v2 API. Camera: Used ONLY during setup for signing in with a physical Belly Card (optional)Review our Privacy Policy for additional security questions or feel free to contact us.",
    "descriptionHTML": "Belly is a universal loyalty program that offers one-of-a-kind rewards at the businesses you love, replacing boring &quot;Buy 10, Get 1 Free&quot; punch cards with free stuff you actually want. Belly Members scan their BellyCard or app at the in-store tablet, earning points that are redeemable for rewards unique to each Belly Business. <br><br><br><br><br>With Belly, we offer one customer loyalty card to replace the rest. Link the mobile app to your physical BellyCard which can be picked up at any Belly Business. Use the app&apos;s &quot;Nearby Places&quot; feature to find locations to Belly when you&apos;re out and about on the town. Earn a free cup of coffee at the donut shop down the street. Name the Sandwich of the Month at your local deli. For the first time, you can have your cake and eat it too, or at least have the option of shoving it into your baker&apos;s face. <br><br>Use your Google+ account to register with Belly! Keep your accounts connected for an easier user experience.<br><br>Add the Belly widget to your Homescreen or Lockscreen for instant access! (The Lockscreen widget is only available on devices running Android 4.2+) <br><br>Belly when you&#x2019;re jet setting across the country. Major markets include:<br>&#x2022; Chicago<br>&#x2022; Austin<br>&#x2022; New York<br>&#x2022; Washington, D.C.<br>&#x2022; Miami<br>&#x2022; San Francisco<br>And more at bellycard.com/locations<br><br>Permissions Descriptions <br>All information collected via the permissions below are used to enhance the app experience and allow us to continue to make it better than the best:<br><br>Storage: Used to cache images and other data to make the app load and function better.<br>Your Location (GPS &amp; Network): Allows us to determine your location so we can find Businesses near you when you only when the app is open.<br>Network Communications: Used to gather nearby businesses, account information and other data needed for the application to function.<br>View Network/Wifi State: We can ensure you have an active internet connection before trying to download assets or information.<br>Your Accounts: Used for Google Cloud Messaging notifications (optional in settings), and for an auto-complete email field on login/registration<br>Vibrate: Used for Push Notification alert behavior (optional in settings)<br>Wake Lock: Used for Google Cloud Messaging (push) notifications (optional in settings)<br>Read Google Services Configurations: Required for the Google Maps v2 API. <br>Camera: Used ONLY during setup for signing in with a physical Belly Card (optional)<br><br>Review our Privacy Policy for additional security questions or feel free to contact us.",
    "histogram": {
        "1": 411,
        "2": 274,
        "3": 864,
        "4": 2766,
        "5": 7184
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/8HHVbdfwqKJQEbD489-fEchUbsXN4B5Z1ZDSs99SlquQEJRig3-JgL-WMGU01DG-LQ=h310",
        "//lh3.googleusercontent.com/Dpvsj3jkY_cNAlm_4r4_PBHsPlfNJZczR6cIlLIO-0xSzOrvdWvnaePttnrhnJrOwA=h310",
        "//lh3.googleusercontent.com/mGu0e2F9QKNeZheL-TvpqaI5znOML-30FpvolXbh6iMm5PwHLIlH1ABHn0vdR97APZOb=h310",
        "//lh3.googleusercontent.com/Lw97XBtUoN1zxjWf99O3o507x1w2dYvFEn_rgFRROqiD5d0ZExcyxSM3LAHVuOOHvkbp=h310",
        "//lh3.googleusercontent.com/zOg2LTBU9YGdDa5zQw3CbKy2Y2_sXD5FkZVNVpfXZZIQx-dyRiaT-2i-N1FjCuLqMw=h310",
        "//lh3.googleusercontent.com/RPTQhjMlrPFsSa9xqbtyHu2lSPltvzxkeMWhYFuQdshnvrQ6sVneHUQjr1tt4HlpZSOq=h310",
        "//lh3.googleusercontent.com/XJKNFB8QXbEHhJm5Z_u-JosCTrsS8lCVmRDh534aD-2LInuWVYlMEwDZpsRTvr4-ij8=h310"
    ],
    "comments": [
        "We use metric over here. What is 0.41 miles??? No fingerprint identification? The information on the map is plain stupid. Why not showing business category on the map, just blue and red pointers? Why not showing the business name when clicking the blue marker? Anyway, I think this reward plan is dead. List of businesses constantly dwindling.",
        "Equipment Issues I would rate this higher but the readers in the stores are usually not working when I try to scan. But app works like a champ when the equipment in the stores work!",
        "Loved this app but It doesn't even let me sign on. Just says something went wrong, no matter if I try to sign in through Facebook, Google or email.",
        "Storefront issue (Urban Pets) Had to get this program after my local pet store switched reward programs for the third time, having lost all my previous points. My mother went into the store to pick something up for me and the owner rigidly refused to let her use it since it was my name on the account. Very frustrated by this.  policy and won't shop there again. Thanks, Belly. Because of your ridiculous rules you have alienated a local business from me.",
        "Not a fan of using location. Causes phone to suck up more data and battery. Also can't do anything with having to use data. Should be able to type in a location or address or the name of the restraunt and find it Even while off line like several other apps like this have. Also app does not say how many mbs it plans on installing. Also not much use for it around my area did a zip code search only 4 places have it. Also checked other areas around me all I have total is 9 places between 4 diffrent zip codes.",
        "Constantly crashing This app crashes even when I'm not trying to open it. Back when it would open, it was fine."
    ],
    "recentChanges": [
        "Version 4.6.3a:",
        "+ Introducing the new Mobile Checkin Feature - checkin from your phone without having to scan at an iPad! Open the QR code from your Home Feed to check it out!",
        "+ Various under the hood improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.bellyflop.android&hl=en&gl=us",
    "appId": "com.bellyflop.android"
}