{
    "title": "Diabetes:M",
    "summary": "Track, analyze and keep the diabetes under control!",
    "icon": "//lh3.ggpht.com/aMkPFTtGHdW550VQYpD0Q0_X2eNPApCgpTo1Z5rEpHN0aJyc8u8HOpBK5un7l-1-f4E=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.6,
    "reviews": 14465,
    "developer": "Sirma Medical Systems",
    "developerId": "Sirma+Medical+Systems",
    "developerEmail": "support@diabetes-m.com",
    "developerWebsite": "http://www.diabetes-m.com",
    "developerAddress": "135 Tzarigradsko shosse Blvd., Floor 3\nSofia 1784\nBulgaria",
    "updated": "February 16, 2018",
    "version": "Varies with device",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "size": "Varies with device",
    "description": "Designed for both smart phones and tablets, this application will help you manage your diabetes better and keep it under control. Whether you are Type 1 or Type 2, have Gestational Diabetes or just want to help and monitor a family member, this is the logbook app for you.The application tracks almost all aspects of the diabetes treatment and provides you and with detailed reports, charts and statistics. You can send the reports to your supervising physician via email. Diabetes:M also gives you various tools, so you can find the trends in blood glucose levels and allows you to calculate normal and prolonged insulin boluses using its highly effective, top-notch bolus calculator.It also has a vast nutrition database, to help you keep track of your food intake and nutrition information, as well as exercise time. Never forget another check with our simple but powerful reminders system.Diabetes:M can analyze the values from the imported data from various glucometers and insulin pumps via the exported files from their respective diabetes management software systems.Supports Android Wear smart watches.PREMIUM SUBSCRIPTION FEATURESIf you’re really serious about your health, our subscription plan includes:+ No Ads – Subscribing removes all advertising from the app, so you can concentrate on what is important.+ 2 Additional Profiles – You can set up to two additional, fully featured profiles. This allows you to keep track of your loved ones (or even pets). + Additional lab result records - Add a comprehensive metabolic panel, kidney function tests and much more...+ Expanded Food Database – This will allow greater access to server food database, as well as an option to save selected food as Meals and Dishes + Synchronization – Automatically sync multiple devices on data change. Allows you to use any of your available mobile devices to keep track effortlessly.+ Reports - Get your reports in PDF or XLS format",
    "descriptionHTML": "Designed for both smart phones and tablets, this application will help you manage your diabetes better and keep it under control. Whether you are Type 1 or Type 2, have Gestational Diabetes or just want to help and monitor a family member, this is the logbook app for you.<br><br>The application tracks almost all aspects of the diabetes treatment and provides you and with detailed reports, charts and statistics. You can send the reports to your supervising physician via email. Diabetes:M also gives you various tools, so you can find the trends in blood glucose levels and allows you to calculate normal and prolonged insulin boluses using its highly effective, top-notch bolus calculator.<br><br>It also has a vast nutrition database, to help you keep track of your food intake and nutrition information, as well as exercise time. Never forget another check with our simple but powerful reminders system.<br><br>Diabetes:M can analyze the values from the imported data from various glucometers and insulin pumps via the exported files from their respective diabetes management software systems.<br><br>Supports Android Wear smart watches.<br><br>PREMIUM SUBSCRIPTION FEATURES<br>If you&#x2019;re really serious about your health, our subscription plan includes:<br><br>+ No Ads &#x2013; Subscribing removes all advertising from the app, so you can concentrate on what is important.<br>+ 2 Additional Profiles &#x2013; You can set up to two additional, fully featured profiles. This allows you to keep track of your loved ones (or even pets). <br>+ Additional lab result records - Add a comprehensive metabolic panel, kidney function tests and much more...<br>+ Expanded Food Database &#x2013; This will allow greater access to server food database, as well as an option to save selected food as Meals and Dishes <br>+ Synchronization &#x2013; Automatically sync multiple devices on data change. Allows you to use any of your available mobile devices to keep track effortlessly.<br>+ Reports - Get your reports in PDF or XLS format",
    "histogram": {
        "1": 245,
        "2": 158,
        "3": 454,
        "4": 3308,
        "5": 10300
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/c3aloWgqr2uNj1D89RJeVXv-B1IYv0gSwVKBkKLu632LFxVIQh3Q71Thfi2JxlTfVho=h310",
        "//lh3.googleusercontent.com/SS8aM9fYrF4VM6mDgypW3Z0MctdUUZ4YDTytZ1-QA-ZkAmHKeP9C8A2nOTOBqP1FOKI=h310",
        "//lh3.googleusercontent.com/7cikFJvryb6EESr-Z11tEhRboxph6krubx-kYtDTzXioYeMA2KmwYKwCe4HeMSOgeAw=h310",
        "//lh3.googleusercontent.com/iu8s_dVymZYKpo7Hrmat8ikj1hxodGBna0tn2dUvz0lSAofAGUkd6tmQbUYqBS359lo=h310",
        "//lh3.googleusercontent.com/8nhN7_WqdLxeKeoBYdgFZrgb6-fmXVcBXqjSijR_-PTcjAhs-7WbJRZPUKKObdIiBtlH=h310",
        "//lh3.googleusercontent.com/6UaJ2XSj9SDAqY67H4isyDiQRyCmR7wOr5xDH05-jmjRAcgljjuQkBbaDJWBVj1Elhs=h310",
        "//lh3.googleusercontent.com/s5BHfClDZCfL-4NyLK1DwNRwfwPMsHZ-IWy5iKU0e1T7PV1602ljk8KWTxIoYgq0h9Eg=h310",
        "//lh3.googleusercontent.com/voW_x0W5QJi2MvpqZtOyvyT3jW0N__2WGruHIq1Gle4KaZIKcloOfjR-xK7ab55w2A=h310",
        "//lh3.googleusercontent.com/ZqvU4Y9EMi6kHlZ8bVW8O1l0EXO8LmdOhSpoGC7Glin0SfWh7ZWOOSJ2Aa00gN2jdFmh=h310",
        "//lh3.googleusercontent.com/i7cvI-uULXVku1FPTZXsL_D74y-VJNSgiO3lLqtwwir97JdyDWxf4MAPjbvBptClcnI=h310",
        "//lh3.googleusercontent.com/0kn-VOjlfW9kZ2jzzYIP-4P1nctgR1LSqWbA3GcMwnEX232n2Imxxz8u5aG3myq9T8nc=h310"
    ],
    "video": "https://www.youtube.com/embed/UlwJkPG-zZI",
    "comments": [
        "I have tried several blood glucose tracking apps, and have been disappointed by all of them until now. Diabetes: M has an East to use interface and lets me track food, blood glucose, and medication all in the same log. Also the food database makes finding and entering accurate information easy. There are charts and graphs that present the data from your log in a meaningful formats so that you can better control your diabetes.",
        "It is a great app provides useful data and is easy to input your information. The only thing is it's a bit pricy for the paid version and I wish the free version still let you save and look up foods like it used to.",
        "UPDATE 2/25/18: Locked out. Can't reach dev. Thinking of canc subscription anyway. ########## 9/23/17: Latest vers still ROCKING! Had issue w/acct, dev was very helpful. Using S8+.  ********************************** Glad it has no-ad vers, however lil spendy. Quick response from dev, always good sign. UPDATE 12/17/16: New UI vers is much better & easier to use. Using SG5.",
        "To say this app helps me manage my diabetes is a major understatement! I'd be completely lost without it now. I started-off only using it for basic functions such as logging my blood sugar. Now I've dived deeper into what it offers i find I'm taking the guess work out of how much glucose to take to treat a hypo or how much bolus is required to bring BG levels back down to target. Seriously considering subscribing to paid version. 5 stars guys!",
        "The app is supposed to work with glimp.  Unfortunately that only happens about one third of the time.  I have tried numerous times to contact the developer but have yet to get a response.  The app has great potential of it would properly sync glucose readings.",
        "I've always struggled with logging. This app has made it much easier for me to do it, and the graphs & statistics have made it easier to spot glucose trends."
    ],
    "recentChanges": [
        "• Fixed empty Patterns view."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mydiabetes&hl=en&gl=us",
    "appId": "com.mydiabetes"
}