{
    "title": "Android Updates, Tips & Best Apps - Drippler",
    "summary": "💧 Discover things you never knew your phone could do!",
    "icon": "//lh3.googleusercontent.com/s9b3m4o33d4sWYE5S-rpGI5Z59hiuwLRM7jyNXDk1Cyup3BaYEEI4DetT6fTXHIETw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 302669,
    "developer": "Drippler",
    "developerId": "8299886820505837913",
    "developerEmail": "support@drippler.com",
    "developerWebsite": "http://drippler.com",
    "developerAddress": "550 S California Ave.\nPalo Alto, CA 94306",
    "updated": "February 7, 2018",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Discover tips, tricks and apps for your Android. Get the latest app reviews, secret hacks, tech news, and new updates for your phone or tablet.Upgrade Your Android✓ Pro smartphone tips & tricks✓ Breaking tech news and app reviews✓ New apps & utilities for Android✓ Nougat 7.0 tricks & shortcuts✓ Useful hacks and secret menus✓ Software and firmware upgrades✓ Phone guides and manuals✓ Best widgets & launchers✓ Device setup tips and settingsBest Android Tools, Apps and Widgets Looking for the best productivity apps? want to discover new watch widgets or recommended launchers? Drippler will keep you updated with anything from the newest productivity tools, workout apps and personalized widgets to utilities, camera apps, cool Nougat tricks & tips, and tech news for your Droid.Top Reviews★ \"Try Drippler. It’s like a Flipboard edition for your mobile device\" - GigaOm★ Recommended App by Samsung, Amazon, Verizon and AT&TTop Technology News Sources- Lifehacker, Digital Trends, Make Use Of- The Next Web, AppsZoom, Ubergizmo- The Smartphone App Review, Ting- Unlockr, Wonder How To, Let's talk techFor more information about Facebook Native Ads click here: https://m.facebook.com/ads/ad_choices✓ Drippler’s reviews and tips help millions of users worldwide to become more productive with their smartphones, gadgets, and mobile technology. We support the latest Android Nougat update as well as Marshmallow 6.0, Lollipop 5.0, KitKat 4.4 and prior OS versions (2.3+).",
    "descriptionHTML": "Discover <b>tips, tricks and apps</b> for your Android. Get the latest app reviews, secret hacks, tech news, and new updates for your phone or tablet.<br><br><b>Upgrade Your Android</b><br>&#x2713; Pro smartphone tips &amp; tricks<br>&#x2713; Breaking tech news and app reviews<br>&#x2713; New apps &amp; utilities for Android<br>&#x2713; Nougat 7.0 tricks &amp; shortcuts<br>&#x2713; Useful hacks and secret menus<br>&#x2713; Software and firmware upgrades<br>&#x2713; Phone guides and manuals<br>&#x2713; Best widgets &amp; launchers<br>&#x2713; Device setup tips and settings<br><br><b>Best Android Tools, Apps and Widgets</b> <br>Looking for the best productivity apps? want to discover new watch widgets or recommended launchers? Drippler will keep you updated with anything from the newest productivity tools, workout apps and personalized widgets to utilities, camera apps, cool Nougat tricks &amp; tips, and tech news for your Droid.<br><br><b>Top Reviews</b><br>&#x2605; <i>&quot;Try Drippler. It&#x2019;s like a Flipboard edition for your mobile device&quot;</i> - GigaOm<br>&#x2605; <i>Recommended App by Samsung, Amazon, Verizon and AT&amp;T</i><br><br><b>Top Technology News Sources</b><br>- Lifehacker, Digital Trends, Make Use Of<br>- The Next Web, AppsZoom, Ubergizmo<br>- The Smartphone App Review, Ting<br>- Unlockr, Wonder How To, Let&apos;s talk tech<br><br>For more information about Facebook Native Ads click here: https://m.facebook.com/ads/ad_choices<br><br>&#x2713; Drippler&#x2019;s reviews and tips help millions of users worldwide to become more productive with their smartphones, gadgets, and mobile technology. We support the latest Android Nougat update as well as Marshmallow 6.0, Lollipop 5.0, KitKat 4.4 and prior OS versions (2.3+).",
    "histogram": {
        "1": 8872,
        "2": 5825,
        "3": 16534,
        "4": 64268,
        "5": 207170
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/q4dE_CU0NPh0V0tzt1Ezh7vsDAAKLWU8h7vraOFUFUBeV3M3j82AHdyslo8RQOYmmUKd=h310",
        "//lh3.googleusercontent.com/bEqnJlUzdKV1xRzJra6Aqcb6FBThfpACzUXcCWg8USRHNkDNtXJFg8KEw-Yp1UCBNqpG=h310",
        "//lh3.googleusercontent.com/oFPQ74vfuAIEsA2bxcH2CuDpV8HXtbeqZ_QeOV2UwSxOVw7DWsExkmkW-WSw7iTZwA=h310",
        "//lh3.googleusercontent.com/mslEJrt89e5akqYWtXRDVnBoMhdsBw9EzORA4UFJD6FQvXizr-zMKfg5-mCXR6FEuAw=h310"
    ],
    "comments": [
        "I really like this app but as of today i have a real problem with it! I've been seeing this guy popping up on all kinds of apps in their feeds named Tom Steyer and he's trying to get people to sign a petition for people to impeach president Trump! I don't think people want to see this political garbage he's putting out there on our feeds in our apps! I sure don't and if it continues I'll be forced to uninstall this app or any others i see this trash in! 😒",
        "A lot of the same stuff over and over. You frequently say how great an app is and yet many of them are rated garbage. It's more ads these days than useful information. What happened to you?",
        "This is a must have. Gives me great tips, ideas, and info for my specific phone. Plus teaches me how to do things i never even knew i could do on it. Like i said AMAZING!!",
        "Same old stuff over and over. Hyperbolic praise for apps that get poor ratings on the Play Store. I know it's only an aggregator, but a little editorial oversight might be useful.",
        "New phone recently and I look to Drippler for tips and the best apps. I have made the most of the last 2 phones this way but I changed the brand this year and it has already been of help setting up the new phone. I look forward to their articles and ideas. I've been with them for years now.",
        "The share menu inside the news is totally messed up. I cannot share them in major apps like WhatsApp, Telegram; because they are not present. And in the case of the selected app, it opens another application to share :-O."
    ],
    "recentChanges": [
        "Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.drippler.android.updates&hl=en&gl=us",
    "appId": "com.drippler.android.updates"
}