{
    "title": "Galaxy Universal Remote",
    "summary": "Turn your phone into a universal remote control! No internet connection required",
    "icon": "//lh4.ggpht.com/VHRFzrqYZUDhzXyvpyMDzMwGhptOIaeVjDVMb7BpmoN-TX_E5l6gKpONEs_UgzggBw=w300",
    "price": "$3.99",
    "free": false,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 6573,
    "developer": "Moletag",
    "developerId": "7191353336399169728",
    "developerEmail": "support@moletag.com",
    "developerWebsite": "http://www.moletag.com",
    "developerAddress": "Moletag Ltd\n27 Old Gloucester Street\nLondon, WC1N 3AX\nUnited Kingdom",
    "updated": "August 9, 2017",
    "version": "4.1.6",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "** Constantly updating to add more devices. If you can't find your device please send us your device info and we will add it for you! **Turn your phone into a universal remote control using your phone's built-in IR transmitter. No external hardware required. No network connection required. No permissions required. Lifetime return policy!Control your TV, your Set-top Box, your Audio Video Receiver, your Sound System, your Amplifier, your DVD Player, your Blu-ray Player, your Media or Streaming Player, your Air Conditioner, your Projector, your DSLR camera, your PS3, your Xbox, and more! Prank your friends, anything you'd like with this user-friendly remote control!Additional features:· Save each one of your devices so that you can easily access them later.· Build your own personalized remote and control all your devices from a single screen, in a free-form layout, where you can add the buttons you need anywhere you like, and customize them with your preferred size, shape, icon, color, and more.· Save a sequence of actions (macro) to be executed one by one. For example you can turn on your TV, turn on your cable box, wait 1 second, go to channel 100 and turn up the volume. All of these actions saved in a single button.· Send your own custom IR code and save it to a button.· If your device is not listed in the app, you can use the scan mode to automatically test all brands and models in order to find a compatible one.· Back up and restore all your saved devices and remotes so that you can easily transfer them to another phone.· Add widgets at your home screen to control your devices without even opening the app.Note:This application works only with phones or tablets that have an IR blaster (infrared blaster) embedded:· Samsung Galaxy S6 / S6 Edge / S5 / S5 Active / S5 Mini / S5 Duos / S4 / S4 Active / S4 Mini / S4 ZoomGalaxy Note 4 / Note 3 / Note Edge / Note 8.0 / Note 10.1 / Note ProGalaxy Tab 4 / Tab 3 / Tab 2 / Tab Pro / Tab S / Tab 7.0 Plus / Galaxy J / Galaxy Mega· HTC One M9+ / M9 / M8 / M7 / HTC One Max / HTC One Dual Sim / HTC Butterfly 2 / Butterfly S / HTC Desire 600 / Desire 200· LG G5 / G4 / G3 / G2 / G Flex2 / V20 / V10· Xiaomi Mi 5 / 5s / 5s Plus / Mi 4 / 4c / Mi Max / Redmi Note 4 / 3 / 2 / Redmi 3 / 3 Pro / 3s / 3s PrimeIn case you need anything simply send us an email at support@moletag.com. Our friendly team is always here to assist you.In addition, if you are not happy with the app or if the app doesn't work with your device just send us your order number and we will instantly refund you. We offer a lifetime return policy.----------------------------Currently supporting over 800,000 devices",
    "descriptionHTML": "** Constantly updating to add more devices. If you can&apos;t find your device please send us your device info and we will add it for you! **<br><br><br><b>Turn your phone into a universal remote control</b> using your phone&apos;s built-in IR transmitter. No external hardware required. No network connection required. No permissions required. Lifetime return policy!<br><br><br>Control your TV, your Set-top Box, your Audio Video Receiver, your Sound System, your Amplifier, your DVD Player, your Blu-ray Player, your Media or Streaming Player, your Air Conditioner, your Projector, your DSLR camera, your PS3, your Xbox, and more! Prank your friends, anything you&apos;d like with this user-friendly remote control!<br><br><br><b>Additional features:</b><br>&#xB7; Save each one of your devices so that you can easily access them later.<br>&#xB7; Build your own personalized remote and control all your devices from a single screen, in a free-form layout, where you can add the buttons you need anywhere you like, and customize them with your preferred size, shape, icon, color, and more.<br>&#xB7; Save a sequence of actions (macro) to be executed one by one. For example you can turn on your TV, turn on your cable box, wait 1 second, go to channel 100 and turn up the volume. All of these actions saved in a single button.<br>&#xB7; Send your own custom IR code and save it to a button.<br>&#xB7; If your device is not listed in the app, you can use the scan mode to automatically test all brands and models in order to find a compatible one.<br>&#xB7; Back up and restore all your saved devices and remotes so that you can easily transfer them to another phone.<br>&#xB7; Add widgets at your home screen to control your devices without even opening the app.<br><br><br><b>Note:</b><br>This application works only with phones or tablets that have an IR blaster (infrared blaster) embedded:<br>&#xB7; Samsung Galaxy S6 / S6 Edge / S5 / S5 Active / S5 Mini / S5 Duos / S4 / S4 Active / S4 Mini / S4 Zoom<br>Galaxy Note 4 / Note 3 / Note Edge / Note 8.0 / Note 10.1 / Note Pro<br>Galaxy Tab 4 / Tab 3 / Tab 2 / Tab Pro / Tab S / Tab 7.0 Plus / Galaxy J / Galaxy Mega<br>&#xB7; HTC One M9+ / M9 / M8 / M7 / HTC One Max / HTC One Dual Sim / HTC Butterfly 2 / Butterfly S / HTC Desire 600 / Desire 200<br>&#xB7; LG G5 / G4 / G3 / G2 / G Flex2 / V20 / V10<br>&#xB7; Xiaomi Mi 5 / 5s / 5s Plus / Mi 4 / 4c / Mi Max / Redmi Note 4 / 3 / 2 / Redmi 3 / 3 Pro / 3s / 3s Prime<br><br><br>In case you need anything simply send us an email at support@moletag.com. Our friendly team is always here to assist you.<br><br>In addition, if you are not happy with the app or if the app doesn&apos;t work with your device just send us your order number and we will instantly refund you. <b>We offer a lifetime return policy.</b><br><br><br>----------------------------<br>Currently supporting over 800,000 devices",
    "histogram": {
        "1": 509,
        "2": 206,
        "3": 325,
        "4": 984,
        "5": 4549
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/6v-vqQduavOC5-eSNBzmUuWHAPibw3VMs8erBUBYS909rUgnGrv1LBsqDn6BlDHru4fz=h310",
        "//lh3.googleusercontent.com/YuA8LDwM4gxAt2oQvwS5Li3mjjmbj_mYgiK5LDW14ArIShpSagt7LlHxbGf9IeSKIB0E=h310",
        "//lh3.googleusercontent.com/0e4wktop0zTnp-L8KwrK7NgKb4UbwY9I6jOgBBixN84NMDnxW0BmnkBQwi5cuG2XRQ=h310",
        "//lh3.googleusercontent.com/SyIuWzSTdqZsizrGCk7KCxLkOn-5MY6FkOdvUsilP5aHIjwD31N_VOtkDG-hVtB3pfY=h310",
        "//lh3.googleusercontent.com/1wB8VJpA98UDteTScHJRgnhGSW1r8IDFZDuqVnsacjdCP-ORSb_-SDfeLHcMacwdsniQ=h310",
        "//lh3.googleusercontent.com/6wVwc8GpOquSJQoLr_qX_vxUJpgQeiWMLwqrqYop5po3V5464ZHHeAQWi-rNfokkbi3V=h310",
        "//lh3.googleusercontent.com/xBTcx29ItH5BbHpeqW7hJVObmb1hx0QzvzlI9S7qef0METL0MUDpQOQ2hjh8hveesDc=h310",
        "//lh3.googleusercontent.com/s-a5OsvPacIJhINWiDkOGHjnWi0q5bfdPIKbeLZTYcofTMkZugx-1KP6UQILsIjX=h310",
        "//lh3.googleusercontent.com/zsUPAhpXWUA4gHAsKWVL9AiRfUKbmPftIDRgvSsv14AQ54oCtz1HPb-ggkaOI1Dl8Q=h310",
        "//lh3.googleusercontent.com/jzVjGWF4D-v1eILdQMeCy5rrg0BsxNHI1Z2MHrTjNQ38MmaxqHcQkW6r8DRwmVisfl7y=h310"
    ],
    "video": "https://www.youtube.com/embed/h1uFpUkG2LE",
    "comments": [
        "Galaxy remote is a massive evolution from the days when you had to build your devices using a bit of code on devices whose IR ports were not designed to be used as remotes. It has an almost limitless selection of devices using the scan mode. So far I have not met a device it has not worked with. However if the ability to learn codes from the original remote can be added it will be worthy of 5 stars.",
        "This is the best universal remote control app i have used. It was well worth spending the few dollars for somthing that does the job well. Its easy to use and has worked on every device i have tried so far. My only problem is not having all the functionality of a device when needing to manually scan for the remote frequency.",
        "This app is much simpler to use and has more brands that Peel Smart Remote. It also has a useful scan mode to help find a compatible device. The new advanced mode for the custom remote works well. Excellent customer service. They reply to emails within at least a day! Great app!",
        "One of the bst apps I use on my phone. It's great when staying in a hotel with no access to inputs using hotel remote. Has been so useful to me lost count the number of times it's saved me. Great app 10 out of 10. Shame s8 dropped IR port.",
        "Only owned the app a short while but after adding my television in a half asleep panic when my remote batteries died... I'm now looking for anything else I can add to this app. Very well made and worth the money.  Who needs an expensive universal remote when you have this app?",
        "My LG Projector wasn't listed, but this app is phenomenal. Macros(great for entering service menus), letting you use your Android smart watch, programmable , and very user friendly. Well worth the purchase price."
    ],
    "recentChanges": [
        "Version 4.1.6",
        "· Added support for Android O",
        "· Added more brands and models upon users requests",
        "· Various bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.moletag.galaxy.s4.remote&hl=en&gl=us",
    "appId": "com.moletag.galaxy.s4.remote"
}