{
    "title": "Snapdeal Online Shopping App for Quality Products",
    "summary": "Shop for top brands, fashion, electronics, home essentials &amp; more",
    "icon": "//lh3.googleusercontent.com/pOmvDB5NZbz0fnNnrbztRzLacLhcTA9ZulXAY5DEvXz38S0ByjCGpXVSxOIjVkXBle0X=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000000,
    "maxInstalls": 100000000,
    "score": 4.1,
    "reviews": 1402806,
    "developer": "Snapdeal.com",
    "developerId": "Snapdeal.com",
    "developerEmail": "apphelp@snapdeal.com",
    "developerWebsite": "https://www.snapdeal.com",
    "updated": "March 1, 2018",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "Snapdeal is your personal gateway to first-class online shopping for clothing, fashion, electronics, home & kitchen essentials, gadgets and more.Discover the latest offers on women’s and men’s clothing, mobile phones and mobile accessories, electronics, home & kitchen essentials and over 65 million other items. Snapdeal is India’s largest marketplace, giving you access to not just what you need, but to all that you desire. Deals and offers get you the best price on the items you’ve been dreaming of.Upgrade your life with Snapdeal!==Snapdeal Online Shopping Features==Online Shopping with the Latest Brands• Shop for the latest brands like Vero Moda, Hidesign, Nike, Woodland, Acer, Apple, Samsung on Snapdeal - India’s largest online marketplace• Online Shopping recommendations lets you personalize the app to fit your tastes• Online shopping for clothes, electronics, books, gadgets and daily essentials• Clothing, home design and other necessities are all available in one convenient online shopping appFashion to Fit Your Lifestyle• Men’s clothing – Discover clothes, shoes, ties, belts, Perfumes, Sunglasses and more• Women’s clothing – Shop for tops, jeans, shoes, dresses, Sarees and more• Clothing from the world’s top brands is just a tap awayElectronics and Gadgets• Buy the latest mobile phones, televisions, projectors and more• Phone cases, chargers, headphones, Tempered glasses and everything else you need on the goSales and Deals – Get the Best Price on Your Dream Item• Snapdeal always offers the best price and gets you exclusive access to great deals• Daily deals & deals of the day give you even more ways to save while shopping• Sales notifications give you instant access to offers, discounts and dealsDiscover and Search• Search for new offers with a catalog of over 35 million products• View product images, item details and price specifications• Search for the best price by reading customer reviews and ratingsDelivery Updates and Advanced Security for Every Order• Delivery offers free shipping to more than 6000 cities in India• Order safely, with a 100% payment protection guarantee via TrustPay• Complete transactions via credit/debit, EMI, NetBanking, Cash-on-Delivery• Order tracking is also available for added security• 7-day easy returnsSnapdeal unboxes a new world of possibilities, with fast, easy and secure online shopping. The boxes we send to our customers don't just contain orders - they contain the fuel that powers your aspirations. We love the anticipation and the delight that we see on our customer's faces when they receive a box from Snapdeal. That’s why our new red-box inspires our all-new brand mark - a modern & stylised design that represents the joy of unboxing.At Snapdeal we love competition, and in order to beat it we are constantly trying to bring the latest products under the sun to our online shopping app. Discover everything you need from fashion to daily needs, and pay for it all in one secure and easy mobile application.So give Snapdeal a shot and let us know what you think at apphelp@snapdeal.com. Our Help Centre feature is always there to answers all your queries._____________Things to note:We seek permission to access your:Media Files, Camera & Photos to enable sharing of the product image. We’d love to hear your feedback with product selfies.SMS access to send you a one-time password.Location: To provide location specific personalisation.Microphone: To exchange old electronic products with brand new ones.*The Snapdeal app is supported on Ice Cream Sandwich (4.0) and above.",
    "descriptionHTML": "Snapdeal is your personal gateway to first-class online shopping for clothing, fashion, electronics, home &amp; kitchen essentials, gadgets and more.<br><br>Discover the latest offers on women&#x2019;s and men&#x2019;s clothing, mobile phones and mobile accessories, electronics, home &amp; kitchen essentials and over 65 million other items. Snapdeal is India&#x2019;s largest marketplace, giving you access to not just what you need, but to all that you desire. Deals and offers get you the best price on the items you&#x2019;ve been dreaming of.<br><br>Upgrade your life with Snapdeal!<br><br>==Snapdeal Online Shopping Features==<br><br>Online Shopping with the Latest Brands<br>&#x2022; Shop for the latest brands like Vero Moda, Hidesign, Nike, Woodland, Acer, Apple, Samsung on Snapdeal - India&#x2019;s largest online marketplace<br>&#x2022; Online Shopping recommendations lets you personalize the app to fit your tastes<br>&#x2022; Online shopping for clothes, electronics, books, gadgets and daily essentials<br>&#x2022; Clothing, home design and other necessities are all available in one convenient online shopping app<br><br>Fashion to Fit Your Lifestyle<br>&#x2022; Men&#x2019;s clothing &#x2013; Discover clothes, shoes, ties, belts, Perfumes, Sunglasses and more<br>&#x2022; Women&#x2019;s clothing &#x2013; Shop for tops, jeans, shoes, dresses, Sarees and more<br>&#x2022; Clothing from the world&#x2019;s top brands is just a tap away<br><br>Electronics and Gadgets<br>&#x2022; Buy the latest mobile phones, televisions, projectors and more<br>&#x2022; Phone cases, chargers, headphones, Tempered glasses and everything else you need on the go<br><br>Sales and Deals &#x2013; Get the Best Price on Your Dream Item<br>&#x2022; Snapdeal always offers the best price and gets you exclusive access to great deals<br>&#x2022; Daily deals &amp; deals of the day give you even more ways to save while shopping<br>&#x2022; Sales notifications give you instant access to offers, discounts and deals<br><br>Discover and Search<br>&#x2022; Search for new offers with a catalog of over 35 million products<br>&#x2022; View product images, item details and price specifications<br>&#x2022; Search for the best price by reading customer reviews and ratings<br><br>Delivery Updates and Advanced Security for Every Order<br>&#x2022; Delivery offers free shipping to more than 6000 cities in India<br>&#x2022; Order safely, with a 100% payment protection guarantee via TrustPay<br>&#x2022; Complete transactions via credit/debit, EMI, NetBanking, Cash-on-Delivery<br>&#x2022; Order tracking is also available for added security<br>&#x2022; 7-day easy returns<br><br><br>Snapdeal unboxes a new world of possibilities, with fast, easy and secure online shopping. The boxes we send to our customers don&apos;t just contain orders - they contain the fuel that powers your aspirations. We love the anticipation and the delight that we see on our customer&apos;s faces when they receive a box from Snapdeal. That&#x2019;s why our new red-box inspires our all-new brand mark - a modern &amp; stylised design that represents the joy of unboxing.<br><br>At Snapdeal we love competition, and in order to beat it we are constantly trying to bring the latest products under the sun to our online shopping app. Discover everything you need from fashion to daily needs, and pay for it all in one secure and easy mobile application.<br><br>So give Snapdeal a shot and let us know what you think at apphelp@snapdeal.com. Our Help Centre feature is always there to answers all your queries.<br>_____________<br>Things to note:<br>We seek permission to access your:<br>Media Files, Camera &amp; Photos to enable sharing of the product image. We&#x2019;d love to hear your feedback with product selfies.<br>SMS access to send you a one-time password.<br>Location: To provide location specific personalisation.<br>Microphone: To exchange old electronic products with brand new ones.<br>*The Snapdeal app is supported on Ice Cream Sandwich (4.0) and above.",
    "histogram": {
        "1": 138700,
        "2": 48443,
        "3": 125563,
        "4": 316390,
        "5": 773710
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/T6KMmR7zBC1Kk0v4h1wsO2TdOdv_cPGzlOgog0rjh5KPems5L1EhiNXMuV4RiJR6pQ=h310",
        "//lh3.googleusercontent.com/SvROfLZWt8BIUi75z7wupmnaVad_eK6dn4YON25cAQK__GwIH-wN--cAY0ISTKhfZDE=h310",
        "//lh3.googleusercontent.com/AHuY5nXLE0Z1_s8KfEs5A1YaL3PbejfAdKN98DY-TYi8pYAw4heYsdkcrJ_5fFOAuRw=h310",
        "//lh3.googleusercontent.com/zWblQ1tDMjMZ3yqtTfFHGvITgFW5oVvCiW7gm8HVnhmHPca_z_GQ7OJY3J_q247YkBM=h310"
    ],
    "video": "https://www.youtube.com/embed/H-75wRNuqh0",
    "comments": [
        "Everything is good but it's delivery charges are so high so product became so costly..I suggest delivery charges should be not taken from customer when they ordered more than product amount  thousand or above...",
        "Worst experience with Snapdeal",
        "In these competition Snapdeal is a lot behind from Amazon,Flipkart.. prices are also costly of the product and a pathetic no returns option makes Snapdeal miserable...",
        "Very Great Snapdeal. I always trust you. 😀 But Please pack anything in box when we buy on Cash On Delivery.",
        "Worst customer care experience even if Amazon far better than snapdeal don't buy product they just bluffing with customer.",
        "Very slow and always hang out"
    ],
    "recentChanges": [
        "- We have revamped our product detail page to help you decide better",
        "- Squashed few bugs making your experience smooth"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.snapdeal.main&hl=en&gl=us",
    "appId": "com.snapdeal.main"
}