{
    "title": "The Mission",
    "summary": "The Mission by Nixon",
    "icon": "//lh3.googleusercontent.com/9taU6gtKYJU9YBV8Yx8slp1NKcpPlfaVi-VFB0OBYMk-VpUxHK_4XW46SusXZ4wvLx4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 2.9,
    "reviews": 298,
    "developer": "NIXON, INC",
    "developerId": "NIXON,+INC",
    "developerEmail": "support@nixon.com",
    "developerWebsite": "http://www.nixon.com",
    "developerAddress": "701 S. Coast Hwy\nEncinitas, CA\n92024",
    "updated": "November 7, 2017",
    "version": "Varies with device",
    "genre": "Sports",
    "genreId": "SPORTS",
    "size": "Varies with device",
    "description": "Official Companion App for The Mission, by Nixon Built smart and built tough, the Mission can withstand the elements so you can take it with you anywhere: in the water, on the hill, off road and beyond. Powered by Android Wear™ and working hand in hand with Surfline®, the world’s largest and most credible source for surf conditions reporting, and Snocountry, the authority in mountain conditions, the Mission is equipped with a preloaded app and streamlines real-time surf and snow shred alerts to your wrist, so you’ll never-not-know. Welcome to the next generation of smartwatch. Welcome The Mission.  www.nixon.com",
    "descriptionHTML": "Official Companion App for The Mission, by Nixon<br> <br>Built smart and built tough, the Mission can withstand the elements so you can take it with you anywhere: in the water, on the hill, off road and beyond. Powered by Android Wear&#x2122; and working hand in hand with Surfline&#xAE;, the world&#x2019;s largest and most credible source for surf conditions reporting, and Snocountry, the authority in mountain conditions, the Mission is equipped with a preloaded app and streamlines real-time surf and snow shred alerts to your wrist, so you&#x2019;ll never-not-know. Welcome to the next generation of smartwatch. Welcome The Mission.  www.nixon.com",
    "histogram": {
        "1": 93,
        "2": 51,
        "3": 41,
        "4": 31,
        "5": 82
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/UBOW-VgIqf0JoM9obfRXiGdHIJ-6UDYZb04Fcc_Mp8XMTxOcgaCQoDdRRSRvLsPwWBY=h310",
        "//lh3.googleusercontent.com/26nWjUNp2cXg1kioeJjm3_eX5at9wKi3hJTQ6aHCQ3LP9OYfWKAHnYWL2QMKL7PI-bA=h310",
        "//lh3.googleusercontent.com/9SDPxwcIjWK8e6BEi-cFghemN5r5bR2VX3c2ot5XFSHiakp9wPvTE5UyepnBSpHNCw=h310",
        "//lh3.googleusercontent.com/o6FRbhEAzM02V2WmQWNE1YhUv19e8pdGg01P4WF-HoP2MoNJzkOVkihPOH6cY3M8lQ=h310",
        "//lh3.googleusercontent.com/XJyk5ritOL0NW5BGpKryV-4JEPoXC1G4nJzEEeovzvtF90C-eZsqJeI4mBROO2SampOW=h310"
    ],
    "video": "https://www.youtube.com/embed/gFYbczK5D4k",
    "comments": [
        "I have many issues connecting my Nixson to my S8+ the app is completely bugged I can not even add my favorite summits because it fails to find the device location everything does not work in the app.",
        "Ok i have had over 5 conversations with both Nixon Europe and Nixon UK they simply do not appreciate that the IOS app is buggy and also when installed on the Mission Watch the information does not update its very sporadic to ask Us to drop over £340 or $400 depending wherever You purchased the watch from,that this level of ignoring Your customers is not on i urge other Nixon Mission owners suffering the same levels of frustration to force Nixon to do something about this work in progress app.Very,very disappointing. UPDATE!!!!!!!!The App on the iPhone 6S simply doesn't work on the Surf spots but as before the Snow spots all load fine just doesn't make any sense has anyone managed to resolve this issue?",
        "I'm submitting an updated review because you guys have really stepped it up recently. I had to return my watch for a few weeks for service and when I got it back, it's working way better than it has in the past. The recent updates to all of your faces make them more usable, and the usability of the app itself and how that info displays on the watch is more stable. Only thing I can request is that there is additional information displayed on watch faces when they are in ambient mode. Other than that, keep up the good work!",
        "The watch finally accepts calls to be rejected or accepted.   Just wish more watch faces would be available otherwise the app is a cool.   not sure if is the os but I miss the swipe to left for apps instead of using the side button to access apps would be nice if they switched the change watch face that way.",
        "Would love to give it more stars but it keeps making me reset to pull the latest tides. And then the app will bug out and not pull the latest data. As the only face out there to give a nice tide graph on the home screen I love it. But I wish is would work consistently",
        "Love the watch, but recently it has become a regular occurrence where it loses the connection to my phone, but doesn't tell me it did. Restarting brings it back, but I shouldn't have to do this. Problem fixed."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.nixon.insider&hl=en&gl=us",
    "appId": "com.nixon.insider"
}