{
    "title": "Simple - Better Banking",
    "summary": "Simple is fee-free online banking that helps you easily budget and save.",
    "icon": "//lh3.googleusercontent.com/wsWEfq0doeJHc2YNds295GzcYhj51K9RgD5nSXAKQ-qbQB4Urq-T6btr3j2_9dHuRyQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 7484,
    "developer": "Simple Finance Technology Corp.",
    "developerId": "Simple+Finance+Technology+Corp.",
    "developerEmail": "support@simple.com",
    "developerWebsite": "https://www.simple.com",
    "developerAddress": "Simple Finance Technology Corp.\nPO Box 28462\nPortland, OR 97228",
    "updated": "March 1, 2018",
    "version": "2.42.5",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Bank beautifully. Easily budget and save. This is Simple: a checking account with built-in tools to help you with budget planning and saving money. It’s the whole idea of online banking, remade with beautiful design, no fees (we don’t charge those), and genuine human goodness.Switching is EasyWhen you sign up for Simple, you’ll get a personal checking account (FDIC-insured* of course), a Visa® Debit Card, our built-in saving and budgeting tools, and more.Always know how much of your money is Safe-to-Spend.Simple’s Safe-to-Spend® shows you how much money you have to spend after bills and scheduled expenses are accounted for (that means less on-the-spot math, hooray!). Enjoy your money without worrying that you’ll derail your budget and upcoming bills.This intuitive and reactive version of your “Available Balance” gives you an accurate picture of your finances down to the penny. Safe-to-Spend and Goals are built-in to every Simple checking account.Set Goals to save automatically, every day. Stash money away in digital envelopes for budget planning, or set a Goal to save for a long-term dream (or do both!). Create Goals for monthly expenses like rent, utilities, groceries, donuts… With Goals, your savings are categorized separately from your Safe-to-Spend (you can still spend from them at any time, though), keeping you up to date and on track without the need for a separate savings account. Every day, your account automatically sets aside what you need to save into custom Goals categories, helping your big dreams come true, a little bit each day. Stop, start, or change your mind any time. We said goodbye to fees.We don’t charge fees. Seriously. Transfer, monthly maintenance, or stop check fees? Nope. You deserve better than that. Since we don't offer overdraft services, we don't charge overdraft fees, either. Simple exists to help you feel confident about your finances, which is why we’re so happy to be fee-free.Mobile banking means Simple is always with you.No branches means no more trips to the bank. With Simple, you can deposit most checks anywhere by just taking a photo on your phone. Set up direct deposit and get your paychecks sent straight to your Simple account. Pay your bills right then and there. No more writing checks.Block and unblock your card right on your phone.If you lose your debit card (or it’s just found a clever hiding spot), lock it with just a tap. Unlock it with another tap as soon as you find it. Your actual Simple account stays open, so there’s no risk in playing it safe.Not a fan of paragraphs? Here’s a quick list of Simple’s lovely features:• A beautiful Simple Visa Card that’s compatible with Apple Pay and Android Pay• Real, friendly, human support• Shared accounts to help you plan, save, and grow together• We don’t charge fees for anything• Access your money at thousands of free ATMs nationwide• Photo check deposits• Built-in spending tracker with visual reports• Free instant transfers to other Simple customersSave more. Worry less. Get things done. Go places. Simple is how banking should be.You deserve that, right? Of course. Everyone does.*Banking Services provided by The Bancorp Bank, Member FDIC. The Simple Visa® Card is issued by The Bancorp Bank pursuant to a license from Visa U.S.A. Inc. and may be used everywhere Visa debit cards are accepted.*Banking Services provided by Compass Bank, Member FDIC. The Simple Visa® Card is issued by Compass Bank pursuant to a license from Visa U.S.A. Inc. and may be used everywhere Visa debit cards are accepted.",
    "descriptionHTML": "Bank beautifully. Easily budget and save. This is Simple: a checking account with built-in tools to help you with budget planning and saving money. It&#x2019;s the whole idea of online banking, remade with beautiful design, no fees (we don&#x2019;t charge those), and genuine human goodness.<br><br>Switching is Easy<br><br>When you sign up for Simple, you&#x2019;ll get a personal checking account (FDIC-insured* of course), a Visa&#xAE; Debit Card, our built-in saving and budgeting tools, and more.<br><br>Always know how much of your money is Safe-to-Spend.<br><br>Simple&#x2019;s Safe-to-Spend&#xAE; shows you how much money you have to spend after bills and scheduled expenses are accounted for (that means less on-the-spot math, hooray!). Enjoy your money without worrying that you&#x2019;ll derail your budget and upcoming bills.<br><br>This intuitive and reactive version of your &#x201C;Available Balance&#x201D; gives you an accurate picture of your finances down to the penny. Safe-to-Spend and Goals are built-in to every Simple checking account.<br><br>Set Goals to save automatically, every day. <br><br>Stash money away in digital envelopes for budget planning, or set a Goal to save for a long-term dream (or do both!). <br><br>Create Goals for monthly expenses like rent, utilities, groceries, donuts&#x2026; With Goals, your savings are categorized separately from your Safe-to-Spend (you can still spend from them at any time, though), keeping you up to date and on track without the need for a separate savings account. <br><br>Every day, your account automatically sets aside what you need to save into custom Goals categories, helping your big dreams come true, a little bit each day. Stop, start, or change your mind any time. <br><br>We said goodbye to fees.<br><br>We don&#x2019;t charge fees. Seriously. Transfer, monthly maintenance, or stop check fees? Nope. You deserve better than that. Since we don&apos;t offer overdraft services, we don&apos;t charge overdraft fees, either. Simple exists to help you feel confident about your finances, which is why we&#x2019;re so happy to be fee-free.<br><br>Mobile banking means Simple is always with you.<br><br>No branches means no more trips to the bank. With Simple, you can deposit most checks anywhere by just taking a photo on your phone. Set up direct deposit and get your paychecks sent straight to your Simple account. Pay your bills right then and there. No more writing checks.<br><br>Block and unblock your card right on your phone.<br><br>If you lose your debit card (or it&#x2019;s just found a clever hiding spot), lock it with just a tap. Unlock it with another tap as soon as you find it. Your actual Simple account stays open, so there&#x2019;s no risk in playing it safe.<br><br>Not a fan of paragraphs? Here&#x2019;s a quick list of Simple&#x2019;s lovely features:<br>&#x2022; A beautiful Simple Visa Card that&#x2019;s compatible with Apple Pay and Android Pay<br>&#x2022; Real, friendly, human support<br>&#x2022; Shared accounts to help you plan, save, and grow together<br>&#x2022; We don&#x2019;t charge fees for anything<br>&#x2022; Access your money at thousands of free ATMs nationwide<br>&#x2022; Photo check deposits<br>&#x2022; Built-in spending tracker with visual reports<br>&#x2022; Free instant transfers to other Simple customers<br><br>Save more. Worry less. Get things done. Go places. Simple is how banking should be.<br><br>You deserve that, right? Of course. Everyone does.<br><br>*Banking Services provided by The Bancorp Bank, Member FDIC. The Simple Visa&#xAE; Card is issued by The Bancorp Bank pursuant to a license from Visa U.S.A. Inc. and may be used everywhere Visa debit cards are accepted.<br>*Banking Services provided by Compass Bank, Member FDIC. The Simple Visa&#xAE; Card is issued by Compass Bank pursuant to a license from Visa U.S.A. Inc. and may be used everywhere Visa debit cards are accepted.",
    "histogram": {
        "1": 526,
        "2": 187,
        "3": 293,
        "4": 889,
        "5": 5589
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/aVxv_6_Yo2SLScAKf73nmstSKHqwqFIkYZ7L6KOCDvBx3lptbYDvZAEvQCiF_n9LQi-c=h310",
        "//lh3.googleusercontent.com/ZpEq-QkyOHdIxGHHQNyEXskJoEk_LkfvmrKNhKyE5spo4I_dS-prQIuLm2RQSXwToxU=h310",
        "//lh3.googleusercontent.com/tPkbA-Vi4UaQ1wt1YX0nxuDfrZ839Ou-KH8hddv3H-aRmmClv64m_HuHauN7xNszSO9m=h310",
        "//lh3.googleusercontent.com/m17i8ova6fpZ_3OoWZ5Ta0PyZxW6cz9r7jDxLHk5_8g9Jn8YWuXLLeg9yHq39idL-lo=h310",
        "//lh3.googleusercontent.com/5eyRQCbh6zHNR1zC6sF9J4Rszqnq5fGhuyyNx1OKKPlncvl2BRFEnRLrvTl-4ug4K6UL=h310"
    ],
    "video": "https://www.youtube.com/embed/0zPA36Ub7P4",
    "comments": [
        "Love the simplistic nature of the app. LOVE the fee-free nature of Simple, but suspect that will disappear when the bank grows. For now I'm loving you, Simple. I'm happy with you. I do wish there was a way to speed up delays with newly opened accounts. Maybe its a law? But its fine.",
        "What's the point in having customer service number if nobody ever answers??? I've called 4 times a day the past 3 days during your phone lines open hours and not a single person answers and I'll let the phone ring for 15 mins. Invest in better customer service",
        "Fixed! Thank you! Awesome app as always, simple to use (hah) and really straight forward!",
        "New client, submitted a few support inquiries via the mobile app and 4 days later have not yet had a response.",
        "Contact me i emailed several times and no one answered i want to know what you did with my 3000 dollars",
        "Best bank I ever used just wish y'all would come out with a black card 😍"
    ],
    "recentChanges": [
        "Hey Simple friends, this update contains tweaks, fixes, and lots of good cheer. Hello smooth(er) sailing!",
        "Bug Fixes:",
        "Fixed: A pesky 2FA bug that was causing crashes in the scheduled payment flow.",
        "Tweaks:",
        "Renamed: Android Pay to Google Pay."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.banksimple&hl=en&gl=us",
    "appId": "com.banksimple"
}