{
    "title": "CIC",
    "summary": "CIC, access your accounts and make transfers via your mobile.",
    "icon": "https://lh3.ggpht.com/Q6bnXvN-RsXNOvJ2XPW9aLjfkxWq1H-SbYnkJQdKfnbvJd1He8cPCILg_uOnWMfL9vI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 6664,
    "developer": "Euro Information",
    "developerId": "Euro+Information",
    "developerEmail": "filbanque@cic.fr",
    "developerWebsite": "https://www.cic.fr",
    "developerAddress": "EURO INFORMATION\n34 RUE DU WACKEN\n67000 STRASBOURG",
    "updated": "January 22, 2018",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Depuis votre Android, accédez aux fonctionnalités de la Banque à Distance au creux de la main. Les fonctionnalités les plus utilisées (consultation de comptes, virements, ...) sont intégrées dans l'application dédiée en toute confidentialité et simplicité. L'application est gratuite et l'accès à vos comptes se fait avec vos identifiant et mot de passe habituels utilisés notamment sur www.cic.fr. Elle vous permet : - de consulter le solde de vos comptes et vos dernières opérations, - d'effectuer des virements de compte à compte, - d'effectuer des virements externes vers les bénéficiaires enregistrés,- d'effectuer des devis complémentaire santé, de consulter vos remboursements en ligne, de simuler les remboursements de certains actes médicaux et de profiter des services Intégral Optic et Carte Avance Santé,- de consulter vos portefeuilles titres, passer des ordres sur les valeurs Euronext et suivre vos ordres, - de consulter les cours de la Bourse et autres informations financières (palmarès, indices, dépêches, vidéos)- de consulter, copier et envoyer par mail et SMS vos RIB et IBAN, - de contacter votre conseiller et de gérer vos messages grâce à la messagerie, - de prendre rendez-vous avec votre conseiller, et de consulter les rendez-vous prévus,- de consulter vos documents et contrats au format électronique,- de trouver les coordonnées de votre Agence locale, - de géolocaliser les Agences CIC et les distributeurs de billets CIC/CM, - d'accéder à l'annuaire des numéros de téléphone utiles, - et via \"Autres applications\", d'accéder à toutes les fonctionnalités du site internet mobile http://mobi.cic.fr sans avoir besoin de vous identifier à nouveau : les extraits de compte pdf, autres virements, P@ywebCard, votre situation assurances... Pour mémoire, en cas de problème, n'hésitez pas à nous contacter: - Par Mail : filbanque@cic.fr en décrivant le problème et en précisant qu'il s'agit de l'application Android, - Par Téléphone : 09 69 39 00 22 (Appel non surtaxé)L’application utilise les autorisations suivantes :- Caméra : utilisée pour afficher la vue en réalité augmentée dans la recherche agences et GAB- Position : utilisée pour rechercher de manière précise les agences et distributeurs les plus proches de vous- Contacts : utilisée pour partager un RIB avec l’un de vos contacts- Photos/Contenus multimédias/Fichiers : utilisée par Google Maps pour optimiser le chargement des cartes en conservant celles précédemment chargées (uniquement sur Android 5.1 et inférieur)- Identifiant d'appareil et infos appel : utilisée par Confirmation Mobile pour authentifier l’appareil autorisé à valider vos opérationsLes données ainsi collectées ne seront ni conservées ni transmises à d’autres fins.",
    "descriptionHTML": "Depuis votre Android, acc&#xE9;dez aux fonctionnalit&#xE9;s de la Banque &#xE0; Distance au creux de la main. Les fonctionnalit&#xE9;s les plus utilis&#xE9;es (consultation de comptes, virements, ...) sont int&#xE9;gr&#xE9;es dans l&apos;application d&#xE9;di&#xE9;e en toute confidentialit&#xE9; et simplicit&#xE9;. <br><br>L&apos;application est gratuite et l&apos;acc&#xE8;s &#xE0; vos comptes se fait avec vos identifiant et mot de passe habituels utilis&#xE9;s notamment sur www.cic.fr. <br><br><br>Elle vous permet : <br><br>- de consulter le solde de vos comptes et vos derni&#xE8;res op&#xE9;rations, <br>- d&apos;effectuer des virements de compte &#xE0; compte, <br>- d&apos;effectuer des virements externes vers les b&#xE9;n&#xE9;ficiaires enregistr&#xE9;s,<br>- d&apos;effectuer des devis compl&#xE9;mentaire sant&#xE9;, de consulter vos remboursements en ligne, de simuler les remboursements de certains actes m&#xE9;dicaux et de profiter des services Int&#xE9;gral Optic et Carte Avance Sant&#xE9;,<br>- de consulter vos portefeuilles titres, passer des ordres sur les valeurs Euronext et suivre vos ordres, <br>- de consulter les cours de la Bourse et autres informations financi&#xE8;res (palmar&#xE8;s, indices, d&#xE9;p&#xEA;ches, vid&#xE9;os)<br>- de consulter, copier et envoyer par mail et SMS vos RIB et IBAN, <br>- de contacter votre conseiller et de g&#xE9;rer vos messages gr&#xE2;ce &#xE0; la messagerie, <br>- de prendre rendez-vous avec votre conseiller, et de consulter les rendez-vous pr&#xE9;vus,<br>- de consulter vos documents et contrats au format &#xE9;lectronique,<br>- de trouver les coordonn&#xE9;es de votre Agence locale, <br>- de g&#xE9;olocaliser les Agences CIC et les distributeurs de billets CIC/CM, <br>- d&apos;acc&#xE9;der &#xE0; l&apos;annuaire des num&#xE9;ros de t&#xE9;l&#xE9;phone utiles, <br>- et via &quot;Autres applications&quot;, d&apos;acc&#xE9;der &#xE0; toutes les fonctionnalit&#xE9;s du site internet mobile http://mobi.cic.fr sans avoir besoin de vous identifier &#xE0; nouveau : les extraits de compte pdf, autres virements, P@ywebCard, votre situation assurances... <br><br>Pour m&#xE9;moire, en cas de probl&#xE8;me, n&apos;h&#xE9;sitez pas &#xE0; nous contacter: <br>- Par Mail : filbanque@cic.fr en d&#xE9;crivant le probl&#xE8;me et en pr&#xE9;cisant qu&apos;il s&apos;agit de l&apos;application Android, <br>- Par T&#xE9;l&#xE9;phone : 09 69 39 00 22 (Appel non surtax&#xE9;)<br><br>L&#x2019;application utilise les autorisations suivantes :<br>- Cam&#xE9;ra : utilis&#xE9;e pour afficher la vue en r&#xE9;alit&#xE9; augment&#xE9;e dans la recherche agences et GAB<br>- Position : utilis&#xE9;e pour rechercher de mani&#xE8;re pr&#xE9;cise les agences et distributeurs les plus proches de vous<br>- Contacts : utilis&#xE9;e pour partager un RIB avec l&#x2019;un de vos contacts<br>- Photos/Contenus multim&#xE9;dias/Fichiers : utilis&#xE9;e par Google Maps pour optimiser le chargement des cartes en conservant celles pr&#xE9;c&#xE9;demment charg&#xE9;es (uniquement sur Android 5.1 et inf&#xE9;rieur)<br>- Identifiant d&apos;appareil et infos appel : utilis&#xE9;e par Confirmation Mobile pour authentifier l&#x2019;appareil autoris&#xE9; &#xE0; valider vos op&#xE9;rations<br>Les donn&#xE9;es ainsi collect&#xE9;es ne seront ni conserv&#xE9;es ni transmises &#xE0; d&#x2019;autres fins.",
    "histogram": {
        "1": 358,
        "2": 195,
        "3": 516,
        "4": 1577,
        "5": 4018
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/eEd5gJ0v2lPvDBNRDPvOijLJFfNpfkitsfhXCV0a7yBsODTXjdVbzXah_-WTMqOOua1q=h310",
        "//lh3.googleusercontent.com/ktbwfnu6CkDFl1xVCHUn27fWPu0tj8Ok9eupL0rShHZn2vRYlgL0ZaqBriuWtHr5f-U=h310",
        "//lh3.googleusercontent.com/3tcj1g77F_RpsPbKeqIBThdfQSc7izHROH6arzUnKBQKTFlNE3MTdnJfTw26qt2Wurur=h310",
        "//lh3.googleusercontent.com/ggXZx9Tixw4GRfKYgdK89913nRioOm8bwZ-5FdggyVYJPg7fT4XakhBqrYfad11pAw=h310",
        "//lh3.googleusercontent.com/TpLzZ2N3tRSvAZ3RvsIo30gMiAeVblTPHQgra95vjglN_rKUR3akPbxQRIlPuqYWnvk=h310",
        "//lh3.googleusercontent.com/Pxdz9aPzsZ6Ws55XBmRdCw5E2sDUn1vELDRHyzgeTUwYoYzlVPH8CdYsJHv2D_IAV7L-=h310"
    ],
    "comments": [
        "Sécurités surdevelopees. Demande d'un code donné il y a 3 ans pour paiement en ligne, différent de tout autres, critères du mot de passe trop pointilleux, rendant le dit mot de passe impossible à retenir, compte bloqué sans avertissement au préalable, à chier.",
        "Excellent and very complete app.",
        "Ça serais bien que vous ajoutez une possibilité de payement sans fil avec NFC",
        "Very good app with highly useful features (print detection, operation confirmation via app). Definitely one of the bank apps I've ever tried",
        "Good banking app with up-to-date features. You can log in with a fingerprint and use it to contact your branch or clerk directly via messaging or telephone.",
        "Parfaite !"
    ],
    "recentChanges": [
        "Nous vous remercions d’utiliser l’application CIC !",
        "Pour l'améliorer, nous vous proposons régulièrement de nouvelles mises à jour.",
        "Téléchargez la dernière version pour en profiter."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.cic_prod.bad&hl=en&gl=us",
    "appId": "com.cic_prod.bad"
}