{
    "title": "8sms (Stock Messaging, KitKat)",
    "summary": "Android 4.4 / CyanogenMod 10.2 stock messaging app with improvements &amp; extras",
    "icon": "//lh5.ggpht.com/6nAv9M21Z-cXKR78tdrrQzWnKgXgd_AMdfbC-OIgFJvaWDJAeuXo2LbZAObuWqC-Hko=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.3,
    "reviews": 12109,
    "developer": "ThinkLeft",
    "developerId": "ThinkLeft",
    "developerEmail": "support@8s.ms",
    "developerWebsite": "http://8s.ms",
    "developerAddress": "PO Box 1181\nBooragoon\nAustralia 6954",
    "updated": "November 26, 2014",
    "version": "1.48",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "** An update of 8sms to the new Material theme from Android Lollipop is planned. Please be patient with us. **** 8sms is \"trial ware\". The \"trial\" period is 14 days. **** After the \"trial\" period, ads will appear (but you can continue to use 8sms for as long as you like). You can remove the ads by making an in-app donation: http://8s.ms/removing-ads **Stock messaging app with useful updates and enhancements.The latest and best from Android and CyanogenMod.No bloat. No fuss. Just a better stock app. 8sms is a port of the Android stock messaging (sms and mms) app with a few extra useful features then added on. The current version is ported from Android 4.4.4 and CyanogenMod 10.2 M1. Notable features• Quick reply pop-ups• Emoji support• Optional dark theme• Clean and no bloat• Most robust \"out-of-the-box\" mms supportPaid app and \"trial\" periodDue to problems with financial viability as a free app, 8sms has now effectively become a \"premium\" app (via in-app donations) with a free \"trial\" period. There is a 14 day trial period for new installs. In the trial period, ads do not appear. After the trial period, ads will appear but if you donate, you can disable the ads: http://8s.ms/removing-adsDonating the minimum amount listed in \"In-app purchases\" below is sufficient to disable the ads.Donations are \"remembered\" across upgrades and reinstalls. If you update to a future version of 8sms or uninstall and reinstall, 8sms will remember that you have donated. You only need to donate ONCE. If you ever have a problem with donations not being remembered, please email us for assistance. In-app purchasesThe in-app billing permission is used for in-app donations. Usage (Android 4.3 and earlier)8sms has two modes: default and Stand-alone mode. In default mode, please do not disable or remove the messaging app that came with your device as that is still required to receive sms and mms messages. Instead, Turn off notifications for the messaging app that came with your device. Then you won't get two sets of notifications. In Stand-alone mode, please disable or remove the messaging app that came with your device otherwise every new message will be stored twice. Usage (Android 4.4 and later)Please install and make 8sms your default sms app. If you have a lot of old sms messages, it may take a few minutes for 8sms to load conversations the first time. SupportIf you have issues using this app, please see http://8s.ms/info for helpful information and possible solutions. Sample topics include, for example: Removing ads: http://8s.ms/removing-adsDuplicate notifications or messages: http://8s.ms/duplicate-notifications-or-messagesMissing notifications or messages: http://8s.ms/missing-notifications-or-messagesCan't send or receive mms: http://8s.ms/cant-send-or-receive-mmsDual SIM support: http://8s.ms/dual-sim-supportThen, if you still have issues, please ask for help. Forum di supporto italiano (Italian language support)http://www.tuttoandroid.net/forum/applicazioni-multimedia-giochi/29936-thread-ufficiale-supporto-italiano-per-lapp-8sms.htmlPermissionsThis app requires a wide range of permissions because it is a port of a system app. System apps use a lot of permissions. Full network access is required in order to send (or download) mms using your phone's cellular data (mms) connection.The \"approximate location\" permission is used for serving ads. It is not used if ads are disabled.Compatibility and FeedbackIf you install this app on your phone and it does not work, please try the links above. If they don't help, then please email us via the registered email address of this app. Please be sure to specify your phone model and Android version number, and the version of 8sms you have installed. Thank you.",
    "descriptionHTML": "<b>** An update of 8sms to the new Material theme from Android Lollipop is planned. Please be patient with us. **</b><br><br><b>** 8sms is &quot;trial ware&quot;. The &quot;trial&quot; period is 14 days. **</b><br><br><b>** After the &quot;trial&quot; period, ads will appear (but you can continue to use 8sms for as long as you like). You can remove the ads by making an in-app donation: http://8s.ms/removing-ads **</b><br><br><b>Stock messaging app with useful updates and enhancements.</b><br>The latest and best from Android and CyanogenMod.<br>No bloat. No fuss. <br>Just a better stock app. <br><br>8sms is a port of the Android stock messaging (sms and mms) app with a few extra useful features then added on. The current version is ported from Android 4.4.4 and CyanogenMod 10.2 M1. <br><br><b>Notable features</b><br><br>&#x2022; Quick reply pop-ups<br>&#x2022; Emoji support<br>&#x2022; Optional dark theme<br>&#x2022; Clean and no bloat<br>&#x2022; Most robust &quot;out-of-the-box&quot; mms support<br><br><b>Paid app and &quot;trial&quot; period</b><br><br>Due to problems with financial viability as a free app, 8sms has now effectively become a &quot;premium&quot; app (via in-app donations) with a free &quot;trial&quot; period. <br><br>There is a 14 day trial period for new installs. In the trial period, ads do not appear. After the trial period, ads will appear but if you donate, you can disable the ads: http://8s.ms/removing-ads<br><br>Donating the minimum amount listed in &quot;In-app purchases&quot; below is sufficient to disable the ads.<br><br>Donations are &quot;remembered&quot; across upgrades and reinstalls. If you update to a future version of 8sms or uninstall and reinstall, 8sms will remember that you have donated. <br><br>You only need to donate ONCE. If you ever have a problem with donations not being remembered, please email us for assistance. <br><br><b>In-app purchases</b><br><br>The in-app billing permission is used for in-app donations. <br><br><b>Usage (Android 4.3 and earlier)</b><br><br>8sms has two modes: default and Stand-alone mode. <br><br>In default mode, please do not disable or remove the messaging app that came with your device as that is still required to receive sms and mms messages. Instead, Turn off notifications for the messaging app that came with your device. Then you won&apos;t get two sets of notifications. <br><br>In Stand-alone mode, please disable or remove the messaging app that came with your device otherwise every new message will be stored twice. <br><br><b>Usage (Android 4.4 and later)</b><br><br>Please install and make 8sms your default sms app. <br><br>If you have a lot of old sms messages, it may take a few minutes for 8sms to load conversations the first time. <br><br><b>Support</b><br><br>If you have issues using this app, please see http://8s.ms/info for helpful information and possible solutions. Sample topics include, for example: <br><br>Removing ads: http://8s.ms/removing-ads<br>Duplicate notifications or messages: http://8s.ms/duplicate-notifications-or-messages<br>Missing notifications or messages: http://8s.ms/missing-notifications-or-messages<br>Can&apos;t send or receive mms: http://8s.ms/cant-send-or-receive-mms<br>Dual SIM support: http://8s.ms/dual-sim-support<br><br>Then, if you still have issues, please ask for help. <br><br><b>Forum di supporto italiano</b> (Italian language support)<br><br>http://www.tuttoandroid.net/forum/applicazioni-multimedia-giochi/29936-thread-ufficiale-supporto-italiano-per-lapp-8sms.html<br><br><b>Permissions</b><br><br>This app requires a wide range of permissions because it is a port of a system app. System apps use a lot of permissions. Full network access is required in order to send (or download) mms using your phone&apos;s cellular data (mms) connection.<br><br>The &quot;approximate location&quot; permission is used for serving ads. It is not used if ads are disabled.<br><br><b>Compatibility and Feedback</b><br><br>If you install this app on your phone and it does not work, please try the links above. <br><br>If they don&apos;t help, then please email us via the registered email address of this app. Please be sure to specify your phone model and Android version number, and the version of 8sms you have installed. <br><br>Thank you.",
    "histogram": {
        "1": 751,
        "2": 393,
        "3": 902,
        "4": 2556,
        "5": 7507
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/WbY1fxTw1RUGznVzzDpdV7NuuwtYe_1WhCHqrd9tLeu0-qE25Lbo8xA9xyclnQRYQC4=h310",
        "//lh3.ggpht.com/Q8ikL8GS-33xR4gIsB8xXH1PFuL7fBRdwiigoR8oP4ShAuwTvhC9a8lRl2nRCDlggB5t=h310",
        "//lh5.ggpht.com/sG0UBSJEJxpvR0xU4QDi3o2aSJHhKy1ZoCkZhkNyRQZSJ8g5_d9rPcZtkB676kvGcw=h310",
        "//lh3.ggpht.com/HK5OQE_4NClyBH394rpo76qKf-AOFF9AAeaCV5_scLH4iHTBOUMUOqCSQuezx0mBm3g=h310",
        "//lh6.ggpht.com/zFvtocJcTKHZL5SCnVkYTmkP_8Um8TKQ-fGPjFYT1XbBOsCT62Isi2XsL8OBwDGedTc=h310"
    ],
    "comments": [
        "I used to love it But in the past week people haven't gotten my texts until hours to days later and vice versa. Used to be fine. It's not my carrier, as all my friends who have Verizon have no issues. This will go back to 5 stars once I can fix this issue. Any advice?                                                                         EDIT: CLEARED DATA AND CACHE SEEMS TO BE OK NOW",
        "Perfect! But... Please support dual sim phones. Not on sending but please put sim indicator where the message has been sent or received (sim1/sim2) that would be a big help, since dual sim can set the default sim for sending in the main Setting so no need for it. Just help us not to be confused where the msg rcvd or sent like the stock Messaging app. and this is perfect plus elegant! And please add Signature too but a signature like what Textra does wherein you can create multiple, and choose separate it from text editor!",
        "Best for Android Wear There may be others that work, but so far 8sms is the only messaging app I have found that allows you to mark a text as \"read\" from your Smartwatch.  Most texting apps will let you clear the notification, but it still shows as unread in the app.  8sms lets you clear the notification with a swipe or mark it as read.  Only missing feature is scheduled text.  I would also like to see a little number displayed on the icon when I have unread text.  Many other messaging apps do this and gmail does now as well.",
        "Very clean and fast. Offers what other messaging apps don't, which is the ability to have the app turn on and off your mobile data when group messaging or receiving pictures or videos. If you are like me and don't often have your data on,  this feature is very important. That feature alone drifted me towards this app,  but it is also easy to use. It would be nice for this app to have a little more customizability when it comes to the interface, and I wish it displayed unread messages number on the home screen, but other than that,  it is a great app.",
        "Worth every penny This functions immensely better than my standard messaging app. I don't mind forking over a couple bucks for a quality product and that's exactly what this is. Not only is the set up relatively simple but, with the trouble shooting guide, any questions I might have had were already answered. Will continue to use as long as I can!",
        "Awesome app with great functionality but one thing... Great look, feel, layout... Love the dark theme, and ability to delete all texts at once... but all my incoming mms picture messages are compressed before receiving them, coming in at very low quality (video as well) even after raising the mms size in settings. Outgoing mms my recipients have no issue with quality but sent from them to me its an issue; I cant even read the grocery list my old lady sends me... This is not an issue when I revert back to the stock messaging app"
    ],
    "recentChanges": [
        "MATERIAL DESIGN BETA: See http://8s.ms/material-theme-for-8sms",
        "\"Approximate location\" permission is for ad targeting.",
        "If ads are disabled (http://8s.ms/removing-ads), location AND analytics are not used.",
        "1.46,1.47,1.48 (also with -googlefix) - 27/11/2014",
        "o Compatibility fixes for crashes and bugs on Android Lollipop.",
        "o Add Google Analytics for non-donated users.",
        "o Various bugfixes.",
        "Full change log at http://8s.ms/changelog"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.thinkleft.eightyeightsms.mms&hl=en&gl=us",
    "appId": "com.thinkleft.eightyeightsms.mms"
}