{
    "title": "Wallet - Money, Budget, Finance Tracker, Bank Sync",
    "summary": "💵 Save money &amp; track budget. Manage your finances with bank sync or import.",
    "icon": "//lh3.googleusercontent.com/LBIyqZbsxXWWQWjsWD5moPJhQQ5L0OKUFNNEbNfUAyJR8vBhPTNll4m2Z2-Lu6reuU4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 71653,
    "developer": "BudgetBakers.com",
    "developerId": "6437300643703400451",
    "developerEmail": "support@budgetbakers.com",
    "developerWebsite": "http://www.budgetbakers.com",
    "developerAddress": "U sladovny 196\nPraha 5, 154 00\nCzech republic",
    "updated": "March 1, 2018",
    "version": "5.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Wallet is your finance planner that helps you flexibly plan your budget and track spending, so you stay in control and achieve your goals. Actively plan, manage and get a report concerning your finances, together with the people you trust, across multiple currencies, banks and financial institutions. Upload your Loyalty or Reward cards too. Get and keep full control of your finances. Tracking your money just got easier. Do you have something that you need to save up for? DOWNLOAD NOW!WHY PEOPLE LOVE WALLET BY BUDGETBAKERS “Wallet is a personal finance tool of mine as it’s one of the most polished options out there for Android.” - Talk Android“If you are in the market for a clean and simple budget app for Android, then Wallet is one of the best ones around.” - Joy of Android“Wallet rules! If you’ve been looking for a safe place to store your financial documents online, Wallet is the perfect tool for you. Expense tracking is also available so you can save money.” - PloymintWHO SHOULD USE WALLETChuck your notebooks as well as spreadsheets and budget for clear, tangible goals that are easy to track in real time. It may be for your holiday travel,education, family, car expenses, small business expenses or any other expenses you might have. Wallet by BudgetBakers is not just a finance expense tracker, report or budgeting app. It’s all about getting things under control now, so that you can make wise decisions and plan for the future - a month, a year or 10 years down the line. You can easily control your spending & save more using finance tracker.Wallet is designed to be your personal manager which helps you get your finances under control from day 1, giving you continuous insight into your financial situation and helping you stay in control for the long-term. It’s your personal expense report.WHAT MAKES WALLET UNIQUE:Automatic Bank Updates - Transactions are automatically and securely synced with your bank, smartly categorized and factored into your budget. With 3,500 participating banks worldwide, you’ll save loads of time not having to track every penny.Imports or Manual Bank Updates - You can now import all your transaction data from sources of your choice to Wallet so you will get a full report. Be it from your bank or your own spreadsheets.Flexible Budgets - Budgets help you to plan & save money for the future. Whatever it is you need to accomplish, from paying off debts to buying a car or saving for retirement, Wallet offers the flexibility to meet your goals and cleverly react to any changing financial circumstances. Insightful reports - Easy-to-understand graphs and financial overviews give you actionable finance insights about the state of your finances, across bank accounts, credit and debit cards, debts and cash. You can get your income & expense report.Sharing selected accounts - Selected accounts can be shared with family, friends or colleagues who need to cooperate on a budget. Everyone can contribute from any platform, whether it be Android, iPhone or the Web. Loyalty and Reward cards - Upload all your plastic cards with bar-codes to Wallet to get rid of all the unnecessary junk which make your wallet extremely big and heavy. You can even share your cards with family members and collect points all in one account. Make your life lighter.List of other features: Multiple currency support, Automatic cloud sync, Receipt and warranty tracking, Categories and templates, geo-mapping transactions, hash-tagging, Shopping lists, Exports to CSV/XLS/PDF, debt management, PIN security, Standing orders, notifications, money tracker,  report and more.HOW TO START USING WALLET1. Download the app2. Sign In Via Facebook or Google3. Get going: budget and track expenses like a master! DOWNLOAD NOW FOR FREE!Wallet is certified with eTrust ",
    "descriptionHTML": "<b>Wallet is your finance planner that helps you flexibly plan your budget and track spending, so you stay in control and achieve your goals.</b> Actively plan, manage and get a report concerning your finances, together with the people you trust, across multiple currencies, banks and financial institutions. Upload your Loyalty or Reward cards too. Get and keep full control of your finances. Tracking your money just got easier. <br><br>Do you have something that you need to save up for? <u><b>DOWNLOAD NOW!</b></u><br><br><b>WHY PEOPLE LOVE WALLET BY BUDGETBAKERS</b><br><br><i> &#x201C;Wallet is a personal finance tool of mine as it&#x2019;s one of the most polished options out there for Android.&#x201D;</i> - Talk Android<br><br><i>&#x201C;If you are in the market for a clean and simple budget app for Android, then Wallet is one of the best ones around.&#x201D;</i> - Joy of Android<br><br><i>&#x201C;Wallet rules! If you&#x2019;ve been looking for a safe place to store your financial documents online, Wallet is the perfect tool for you. Expense tracking is also available so you can save money.&#x201D;</i> - Ploymint<br><br><b>WHO SHOULD USE WALLET</b><br><br>Chuck your notebooks as well as spreadsheets and budget for clear, tangible goals that are easy to track in real time. It may be for your holiday travel,education, family, car expenses, small business expenses or any other expenses you might have. Wallet by BudgetBakers is not just a finance expense tracker, report or budgeting app. It&#x2019;s all about getting things under control now, so that you can make wise decisions and plan for the future - a month, a year or 10 years down the line. <br><br>You can easily control your spending &amp; save more using finance tracker.<br><br>Wallet is designed to be your personal manager which helps you get your finances under control from day 1, giving you continuous insight into your financial situation and helping you stay in control for the long-term. It&#x2019;s your personal expense report.<br><br><b>WHAT MAKES WALLET UNIQUE:</b><br><br><b>Automatic Bank Updates</b> - Transactions are automatically and securely synced with your bank, smartly categorized and factored into your budget. With 3,500 participating banks worldwide, you&#x2019;ll save loads of time not having to track every penny.<br><br><b>Imports or Manual Bank Updates</b> - You can now import all your transaction data from sources of your choice to Wallet so you will get a full report. Be it from your bank or your own spreadsheets.<br><br><b>Flexible Budgets</b> - Budgets help you to plan &amp; save money for the future. Whatever it is you need to accomplish, from paying off debts to buying a car or saving for retirement, Wallet offers the flexibility to meet your goals and cleverly react to any changing financial circumstances. <br><br><b>Insightful reports</b> - Easy-to-understand graphs and financial overviews give you actionable finance insights about the state of your finances, across bank accounts, credit and debit cards, debts and cash. You can get your income &amp; expense report.<br><br><b>Sharing selected accounts</b> - Selected accounts can be shared with family, friends or colleagues who need to cooperate on a budget. Everyone can contribute from any platform, whether it be Android, iPhone or the Web. <br><br><b>Loyalty and Reward cards</b> - Upload all your plastic cards with bar-codes to Wallet to get rid of all the unnecessary junk which make your wallet extremely big and heavy. You can even share your cards with family members and collect points all in one account. Make your life lighter.<br><br>List of other features: Multiple currency support, Automatic cloud sync, Receipt and warranty tracking, Categories and templates, geo-mapping transactions, hash-tagging, Shopping lists, Exports to CSV/XLS/PDF, debt management, PIN security, Standing orders, notifications, money tracker,  report and more.<br><br><br><b>HOW TO START USING WALLET</b><br>1. Download the app<br>2. Sign In Via Facebook or Google<br>3. Get going: budget and track expenses like a master! <br><br><u><b>DOWNLOAD NOW FOR FREE!</b></u><br><br><i><b>Wallet is certified with eTrust </b></i>",
    "histogram": {
        "1": 2632,
        "2": 1386,
        "3": 3020,
        "4": 14499,
        "5": 50116
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/4msBHtCO0lhwHUyWaT4e9Layqj9J5HEizr8E298jWjEurMNcHmv5rxZNH1f3t9AWLOM=h310",
        "//lh3.googleusercontent.com/5GUr9ByNciibPhtEE_EuCTKwE_Jfo8ZCSn-EhuVNUj-T93c3EPqP0LwSHJxzT7rqlg=h310",
        "//lh3.googleusercontent.com/kPwiFRkSrdv6LKwQ4oU1BXslbvQYirsZLcM54DUcYeEmZnCTF_YHTGJPy9EUozV4g7k=h310",
        "//lh3.googleusercontent.com/UZjhtB3GrFdwzRjw9D8n65Jw-j5cMaRqxbrcKkuMDQlsAZWzL3srsF2xgJ4I8P_8E-YR=h310",
        "//lh3.googleusercontent.com/9WToNhnJOD--sTNDaR24jPfgIEURo2mt2k2zOhkwsQHk1G601KktsX1XMl-rLf5Dweg=h310",
        "//lh3.googleusercontent.com/HIhPdVEc1qfs_VnEzEXnZCS1JShwdTqfAOTQasrr__V8ofs8B8aUfA2iVYm77gyWLhA=h310",
        "//lh3.googleusercontent.com/6-b1nhAjd-CSAfOcX15KPF_crr4cqmVh8A24FMEbgCIHF7RRxcb3eljxSw9IKDor8g=h310",
        "//lh3.googleusercontent.com/JOkERNOLpXLuGrFLIuF5YLDQqUjWG5h-PJ63vHfVh3KXg8bX03fAmfqPKoKFIwj3yzI=h310",
        "//lh3.googleusercontent.com/zzGl2OdVAVIQ8s-GM9OGp6C2N3MLEgrI0CKrY2QtbiQQ4eTym7dSfV_B66U0gOJTCbc=h310",
        "//lh3.googleusercontent.com/sz5MeSBdRm0doDDqtp_8HEouTgHImyAemJvnj5TO2nd46f9PjaIiCF1ExFQqXpzjQdY=h310",
        "//lh3.googleusercontent.com/dwOQLsCmbDk9cSDYNw7rwoS-LpKmXhvDSPmy7VT7e8sfxldi2v2bNaDPQG_0MjT0bmo=h310",
        "//lh3.googleusercontent.com/h_QrsoIfDak5ks3urS0U_cTWj5_zTq0YfQtKj5LH6a1mbdYmyb5iivxYvYrsDqokEt4=h310",
        "//lh3.googleusercontent.com/lwl71k1ffflbN_EGjBProGM1Sdz7V6Fytu8cpmkfSnWVcXpeyi3VKa_xEevmdRkf2w=h310"
    ],
    "video": "https://www.youtube.com/embed/kAI9yu0U7Gw",
    "comments": [
        "Was a 5.  Ugh. UX was better before. I used different charts for different accounts as it made sense. As a paying customer this was important.  A possible fix could be the option to apply certain charts we select to only certain accounts... Or having the option to use the old UI.  Also... If I do select an account at the top to do a reconcile (switching transactions from cleared to reconciled) it works but then deselects the account and I have to go up to the top and select it again to do the next transaction.  I guess I can try going to \"Records\" and screwing with the filters a bit.",
        "The new ui scheme is better but it has strange decisions: why is the 'add a person to your group sharing' button so easily accessible on top? A user needs that button maybe once or twice in a lifetime. Other such decisions make me think this app needs a ux overhaul, especially since it has too many features, a classic case of can't see the forest for the trees...",
        "pretty much a great app. but sometimes it crashes ever so gratefully and duplicates the transfer records messing the balance. also a real (not crypto) currency rate widget would be nice!  also please make a setting to change the default account input from notification",
        "this is a very good app. it just the latest update is very bad. i think the swiping method made this app very convenient, but now it is gone.  besides, the values shown in color grid is incorrect. i thought i lost all my data, luckily after checked with the balance widget, i still have it. it just the color grid is not right.   please rectify this problems.",
        "Latest Update is awful. I have seen someone has already commented to say this and there has been a response.  Frankly that response is not good enough as the app is now not suitable for propose and has drastically reduced functionality. Unless this latest update is removed I would avoid installing. It's not what it was.",
        "Hate the new update... Common widgets for all account is awful... I customized the widgets according to the account but now I cannot do so. Please remove the common view and rollback to different dashboard for different accounts."
    ],
    "recentChanges": [
        "Add Fiat Currency card",
        "Add Labels to Smart Assistant Form",
        "Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.droid4you.application.wallet&hl=en&gl=us",
    "appId": "com.droid4you.application.wallet"
}