{
    "title": "Minuum Keyboard + Smart Emoji",
    "summary": "The smaller, smarter keyboard. Now with predictive Emoji!",
    "icon": "//lh5.ggpht.com/H7ugAHmEopnLMb51rSCVy_t_MuLTbpjl2lHYQ_Mh-RebgkSDovwCkjtQF_cxvA-I1Jg=w300",
    "price": "$3.99",
    "free": false,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.3,
    "reviews": 10069,
    "developer": "Whirlscape",
    "developerId": "Whirlscape",
    "developerEmail": "support@minuum.com",
    "developerWebsite": "http://minuum.com",
    "developerAddress": "176 John St., Suite 300\nToronto, ON, Canada\nM5T1X5",
    "updated": "February 17, 2017",
    "version": "3.5.2",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "MINUUM™ - The smarter, smaller keyboard that lets you do more with your screen space. It’s the little keyboard for big fingers! *** One of the “12 best Android apps of 2014” - Karissa Bell, Mashable *** Minuum is best known for:★ SLOPPY TYPING — Type surprisingly fast and delightfully sloppy ★ SMART EMOJI — Always have the right emoticon right at your finger tips★ SHAPESHIFTING — Save screen space, enable one-handed typing or reposition your keyboard entirely Spend 15 seconds with the introductory tutorial and you'll be able to start typing with Minuum—instantly. The more you type, the better Minuum gets. MULTI-LANGUAGE CAPABILITYDownload language modules and quickly switch between them. We currently support:• English• Spanish• French• German• Italian• Portuguese-BR• Russian• Dutch• Swedish• Czech• Polish• Portuguese-PT• Turkish BONUS PANELSMinuum is always finding ways for you to enjoy your screen space through brand new bonus panels:★ CURSOR CONTROL — Tweak your texts, emails, and posts with ease★ CLIPBOARD TOOLS — Quickly cut, copy and paste★ SEARCH & SHARE — Instantly access thesaurus, dictionary, search, and share★ EMOJI—Express yourself better with immediate access to all 856 emoticons★ TYPING SPEED — Monitor your typing speed DISCOVER MOREThe Minuum keyboard for touchscreens is the first step toward a \"type anywhere\" future. Soon Minuum will let you type in ways you never imagined. For more information: http://www.minuum.com FEATURES AT A GLANCE• FAST SLOPPY TYPINGType fast without worrying about precision, thanks to ridiculously smart auto-correction that learns as you type.• MORE SCREEN SPACERecover more than half of the touchscreen space you lose when using traditional virtual keyboards.• HELP FOR THE LARGE-FINGEREDUse key magnification for precise letter, number, and punctuation entry—very useful if you have large fingers.• DIFFERENT ALPHABET ARRANGEMENTSChoose from alternate keyboard layouts—such as “QWERTZ,” “AZERTY,” “A-Z.”• EXPANSION TO FULL-SIZED KEYBOARDDrag on the candidates bar to quickly switch between mini and full-size modes (useful for URLs and passwords).• SMART WORD PREDICTIONSpeed up your typing via suggestions from a predictive engine that learns from your word list, word combos, and language use patterns.• SMART EMOJISwipe the word predictions left to find your Smart Emoji suggestions. Learn more about \"the quest for the perfect emoji\" here: http://goo.gl/sxQT9w• VOCABULARY CONTROLMinuum learns from your vocabulary, and lets you delete words from your dictionary though a pop-up display.• RAPID GESTURE SHORTCUTSSlide your fingers to the corners for quick, convenient access to all your features via pop-up keys.• VOICE TYPINGEnter text hands-free via Google Voice Typing for voice-to-text typing when performing other activities.• REAL MULTITASKINGIf you’ve got split-screen capability, multitask more effectively as a result of extra screen space. SUPPORTVisit http://support.minuum.com to:• Share ideas with the Minuum community• Give product feedback• Get help PRIVACYThe Minuum keyboard stores data about your typing tendencies on your device. We do not collect typing data remotely and will not do so without first asking you. Please see our privacy policy: http://www.minuum.com/data ABOUT OUR NAMESome people call us “Minum” or the “Minimum” keyboard but an easy way to remember the Whirlscape™ Minuum™ Keyboard is to think of a continuum of letters taking up minimal space. For updates, join our mailing list at http://eepurl.com/zwd8T",
    "descriptionHTML": "<b>MINUUM&#x2122; - The smarter, smaller keyboard that lets you do more with your screen space. It&#x2019;s the little keyboard for big fingers!</b><br> <br>*** One of the &#x201C;12 best Android apps of 2014&#x201D; - Karissa Bell, Mashable ***<br> <br>Minuum is best known for:<br>&#x2605; SLOPPY TYPING &#x2014; Type surprisingly fast and delightfully sloppy <br>&#x2605; SMART EMOJI &#x2014; Always have the right emoticon right at your finger tips<br>&#x2605; SHAPESHIFTING &#x2014; Save screen space, enable one-handed typing or reposition your keyboard entirely<br> <br>Spend 15 seconds with the introductory tutorial and you&apos;ll be able to start typing with Minuum&#x2014;instantly. The more you type, the better Minuum gets.<br> <br><b>MULTI-LANGUAGE CAPABILITY</b><br>Download language modules and quickly switch between them. We currently support:<br>&#x2022; English<br>&#x2022; Spanish<br>&#x2022; French<br>&#x2022; German<br>&#x2022; Italian<br>&#x2022; Portuguese-BR<br>&#x2022; Russian<br>&#x2022; Dutch<br>&#x2022; Swedish<br>&#x2022; Czech<br>&#x2022; Polish<br>&#x2022; Portuguese-PT<br>&#x2022; Turkish<br> <br><b>BONUS PANELS</b><br>Minuum is always finding ways for you to enjoy your screen space through brand new bonus panels:<br>&#x2605; CURSOR CONTROL &#x2014; Tweak your texts, emails, and posts with ease<br>&#x2605; CLIPBOARD TOOLS &#x2014; Quickly cut, copy and paste<br>&#x2605; SEARCH &amp; SHARE &#x2014; Instantly access thesaurus, dictionary, search, and share<br>&#x2605; EMOJI&#x2014;Express yourself better with immediate access to all 856 emoticons<br>&#x2605; TYPING SPEED &#x2014; Monitor your typing speed<br> <br><b>DISCOVER MORE</b><br>The Minuum keyboard for touchscreens is the first step toward a &quot;type anywhere&quot; future. Soon Minuum will let you type in ways you never imagined. For more information: http://www.minuum.com<br> <br><b>FEATURES AT A GLANCE</b><br>&#x2022; FAST SLOPPY TYPING<br>Type fast without worrying about precision, thanks to ridiculously smart auto-correction that learns as you type.<br><br>&#x2022; MORE SCREEN SPACE<br>Recover more than half of the touchscreen space you lose when using traditional virtual keyboards.<br>&#x2022; HELP FOR THE LARGE-FINGERED<br>Use key magnification for precise letter, number, and punctuation entry&#x2014;very useful if you have large fingers.<br>&#x2022; DIFFERENT ALPHABET ARRANGEMENTS<br>Choose from alternate keyboard layouts&#x2014;such as &#x201C;QWERTZ,&#x201D; &#x201C;AZERTY,&#x201D; &#x201C;A-Z.&#x201D;<br>&#x2022; EXPANSION TO FULL-SIZED KEYBOARD<br>Drag on the candidates bar to quickly switch between mini and full-size modes (useful for URLs and passwords).<br>&#x2022; SMART WORD PREDICTION<br>Speed up your typing via suggestions from a predictive engine that learns from your word list, word combos, and language use patterns.<br>&#x2022; SMART EMOJI<br>Swipe the word predictions left to find your Smart Emoji suggestions. Learn more about &quot;the quest for the perfect emoji&quot; here: http://goo.gl/sxQT9w<br>&#x2022; VOCABULARY CONTROL<br>Minuum learns from your vocabulary, and lets you delete words from your dictionary though a pop-up display.<br>&#x2022; RAPID GESTURE SHORTCUTS<br>Slide your fingers to the corners for quick, convenient access to all your features via pop-up keys.<br>&#x2022; VOICE TYPING<br>Enter text hands-free via Google Voice Typing for voice-to-text typing when performing other activities.<br>&#x2022; REAL MULTITASKING<br>If you&#x2019;ve got split-screen capability, multitask more effectively as a result of extra screen space.<br> <br><b>SUPPORT</b><br>Visit http://support.minuum.com to:<br>&#x2022; Share ideas with the Minuum community<br>&#x2022; Give product feedback<br>&#x2022; Get help<br> <br><b>PRIVACY</b><br>The Minuum keyboard stores data about your typing tendencies on your device. We do not collect typing data remotely and will not do so without first asking you. Please see our privacy policy: http://www.minuum.com/data<br> <br><b>ABOUT OUR NAME</b><br>Some people call us &#x201C;Minum&#x201D; or the &#x201C;Minimum&#x201D; keyboard but an easy way to remember the Whirlscape&#x2122; Minuum&#x2122; Keyboard is to think of a continuum of letters taking up minimal space.<br> <br>For updates, join our mailing list at http://eepurl.com/zwd8T",
    "histogram": {
        "1": 295,
        "2": 349,
        "3": 927,
        "4": 2907,
        "5": 5591
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/CNEfT3b8mll0leS5QMcdjS3Byb9f1p6o4bzixzpWGUZVZLhsMAd29pIAIQ7uq67dwlE=h310",
        "//lh5.ggpht.com/CHG0FtnvoBmC9vCMrk4ZseCKJZOzckSildDjiJlsZMfP-CSvLYjCZvBD-GbJgFOL6Go=h310",
        "//lh5.ggpht.com/jgPOcx4Ks7sJ-M3H2FdcOaWOvCpXxfRZeYkWTm0TvQ-wSoN2rvID43r3aEiitS8sy6oT=h310",
        "//lh6.ggpht.com/hPMsQlSCC7kJG_Ugn0g3Xvb6h6JO9YAbXbgky09yeOxs8GUM0AJwYAT6E4xf-WdLs4U=h310",
        "//lh4.ggpht.com/zpzLTTF-RxYSlVPUHK35BBabqy4H6R1n6KCJpgz93UW2AMfumztRPa68_osGZmuooRM=h310",
        "//lh4.ggpht.com/yCuRybblN91BTHcn6agxeZmB5R3OkO1U4GUx3SdEKoZWoDOSoflbhDSNJDbWeeEK94w=h310",
        "//lh4.ggpht.com/gj5lNldYe-ByEuNaWUk8JqVkcIMZjbk2Epd6qQhPXELeB7WRW_743Y-VD2kau3u3zQ=h310",
        "//lh3.ggpht.com/yfVYRVsQUke_9IdGOKRtsqMLLU5LILF7_OOGVM65mPKBOcflSi5WgwVa_f3G7EtaOQ=h310"
    ],
    "comments": [
        "Why does this keyboard app was not updating frequently? It would have been better if this app supports more language because this keyboard depends on autocorrect function so countries like in the Philippines where we cannot fully used this app because it doesn't have tagalog.. We can only depend on inputting our own languages so it takes more time in the few months I think before you can be comfortable on using this keyboard.. So it takes so long.. This app has so much potential.. I've been following minuum since it started here i think that was 3-4 yrs ago but since last year im not using it because I was waiting for more support of languages..",
        "I really like the concept of this keyboard. The prediction works very well and once you get used to typing on it you can type at a pretty decent speed. The main issue I have is not being able to move the cursor with the spacebar. While the amazing prediction removes some of the need for this feature, if you want to go back and correct a word it can be hard to get the cursor positioned correctly without this. Otherwise this is an excellent keyboard,  especially if you use split window and hate how the top window is almost completely off screen while typing.",
        "(one year later) Punctuation and capitalization issues in Evernote and starting to see same in other apps. (One month later: still using and it's a good keyboard. Don't be afraid to expand it if speed and accuracy are paramount or using esoteric terminology - which I did NOT for this edit.)  Not bad. I assume most reviewers are giving feedback in same day as purchasing. I say give it time and it will become easier.",
        "I sadly have to change the rating from 5 to 3 stars. Devs don't respond. Navigation bar has replaced physical buttons for a while now, but the Minuum keyboard hasn't been updated to resolve it. As of now, expect everything in your spacebar row to be completely covered by the navigation bar. Sucks because I loved this keyboard.",
        "Refreshing new take on a keyboard and surprisingly beneficial to have more screen estate available to you while typing. However, one huge caveat is the lack of different languages. I would love to start using this keyboard, but until Danish (and Icelandic) is supported, it is a no go. I bought this app before it was out of beta solely on its promise, so I hope these two languages finds their way onto the roadmap soon.",
        "Great! Drunk typing is dope, hard to switch back. Predictive/synonymous emojis are terrific too. Backspace by left swipe is great. Customization is good. Only thing I hate is doing the damn tutorial whenever I reinstall it.  happy to pay for the pro version tho, this is a terrific, fast keyboard. Trying the Spanglish feature and hoping it works."
    ],
    "recentChanges": [
        "3.5.2",
        "- Stability and bug fixes",
        "3.5",
        "- Support for unicode 8 emoji (Android 6.0.1 only)",
        "3.4.5",
        "-Stability improvement",
        "-Fixed a long standing crash with language and layout selection",
        "3.4.4",
        "-Background optimizations",
        "3.4.3",
        "-Added advanced option to adjust long press delay",
        "-Improve access to special character (pl/sv) in multi-lingual mode",
        "-Better access to _ in spanish",
        "-Better access to <> and _ and other tweaks to the symbols layout",
        "-Small improvements to the adaptive color scheme"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.whirlscape.minuumkeyboard&hl=en&gl=us",
    "appId": "com.whirlscape.minuumkeyboard"
}