{
    "title": "Wear Bible",
    "summary": "Read the Bible on your Android Wear compatible smartwatch and mobile devices.",
    "icon": "//lh3.googleusercontent.com/3bAPeGh2qB4DEP7_BI30El1GGAcR1mqwjRFkj9scxTBUWA33-UxdU09PZd01ndLfDb8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.8,
    "reviews": 37,
    "developer": "MEF Applications",
    "developerId": "MEF+Applications",
    "developerEmail": "mefapps@gmail.com",
    "developerWebsite": "https://plus.google.com/u/0/communities/100089055289593256392",
    "updated": "October 31, 2016",
    "version": "1.3",
    "genre": "Books & Reference",
    "genreId": "BOOKS_AND_REFERENCE",
    "description": "✝️📖 The Most Complete Bible App Available for Android Wear📖✝️Read the Bible on your Android Wear compatible smartwatch. There’s an app for Android mobile devices too. Bible content comes from free online service providers so you need to remain connected to your paired mobile device. Your mobile device also needs to be connected to the internet. There are several online Bible translations to choose from and multiple language support is coming next (English only at the moment).Key Features of Wear Bible:🆕 - Set the font size, font type, and line spacing to your liking!🆕 - Improved selectors for Section, Book, Chapter, and Verse!▶️ - Choose from several Bible translations including: ASV, BBE, ESV, KJV, NAS, NIV, and WEB▶️ - Select a single verse or multiple verses which easy navigation from chapter to chapter▶️ - Get a inspirational Verse of the Day notification on your mobile and wearable deviceMore features planned for Wear Bible:➡️ - Additional languages➡️ - Additional Bible translations﻿➡️ - Save your favorite verses for quick recall➡️ - Randomly select verses to read➡️ - Bible memorization card notifications➡️ - Bible devotional card notifications➡️ - Offline supportI love reading God’s Word and Wear Bible provides a quick and easy way to do it anytime, anywhere. Plus it’s very novel to be able to read it on your smartwatch. Keep in mind that extensive reading of the Bible on your smartwatch, while great for your spirit, may not be so good for your wearable device’s battery life.If you have any comments, questions, or suggestions, please visit the Wear Bible Google+ Community: [https://plus.google.com/u/0/communities/100089055289593256392]Please note:🗒 Wear Bible is only compatible with smartwatches that run Android Wear. If your smartwatch doesn’t support Android Wear, this app won't work on your device.🗒 Make sure your smartwatch is paired and connected to your phone to install the wearable app on your smartwatch and wait a few minutes after the initial install or update on your phone before attempting to access Wear Bible on your watch.🗒 If Wear Bible has any trouble communicating with your paired mobile device try opening the Wear Bible app on your phone, then close and reopen the app on your smartwatch.Permissions Requested:❗️Full Network Access: used to retrieve Bible verses from online service providers❗️View Network Connections: used to verify your internet connection❗️Run At Startup: used to restart the VOD notification after reboot if desiredSpecial Thanks:👏 ibibles.net - online Bible service provider👏 Digital Bible Platform - online Bible service provider👏 OurManna.com - online Verse of the Day provider",
    "descriptionHTML": "<b>&#x271D;&#xFE0F;&#x1F4D6; The Most Complete Bible App Available for Android Wear&#x1F4D6;&#x271D;&#xFE0F;</b><br><br>Read the Bible on your Android Wear compatible smartwatch. There&#x2019;s an app for Android mobile devices too. Bible content comes from free online service providers so you need to remain connected to your paired mobile device. Your mobile device also needs to be connected to the internet. There are several online Bible translations to choose from and multiple language support is coming next (English only at the moment).<br><br><b><u>Key Features of Wear Bible:</u></b><br><br>&#x1F195; - Set the font size, font type, and line spacing to your liking!<br>&#x1F195; - Improved selectors for Section, Book, Chapter, and Verse!<br>&#x25B6;&#xFE0F; - Choose from several Bible translations including: ASV, BBE, ESV, KJV, NAS, NIV, and WEB<br>&#x25B6;&#xFE0F; - Select a single verse or multiple verses which easy navigation from chapter to chapter<br>&#x25B6;&#xFE0F; - Get a inspirational Verse of the Day notification on your mobile and wearable device<br><br><b><u>More features planned for Wear Bible:</u></b><br><br>&#x27A1;&#xFE0F; - Additional languages<br>&#x27A1;&#xFE0F; - Additional Bible translations&#xFEFF;<br>&#x27A1;&#xFE0F; - Save your favorite verses for quick recall<br>&#x27A1;&#xFE0F; - Randomly select verses to read<br>&#x27A1;&#xFE0F; - Bible memorization card notifications<br>&#x27A1;&#xFE0F; - Bible devotional card notifications<br>&#x27A1;&#xFE0F; - Offline support<br><br>I love reading God&#x2019;s Word and Wear Bible provides a quick and easy way to do it anytime, anywhere. Plus it&#x2019;s very novel to be able to read it on your smartwatch. Keep in mind that extensive reading of the Bible on your smartwatch, while great for your spirit, may not be so good for your wearable device&#x2019;s battery life.<br><br>If you have any comments, questions, or suggestions, please visit the <br><a href=\"https://www.google.com/url?q=https://plus.google.com/u/0/communities/100089055289593256392&amp;sa=D&amp;usg=AFQjCNEMrxw_6aRF-o2AYJ6s-SCX1EuhIw\" target=\"_blank\">Wear Bible Google+ Community:</a> [https://plus.google.com/u/0/communities/100089055289593256392]<br><br><b><u>Please note:</u></b><br><br>&#x1F5D2; <b>Wear Bible is only compatible with smartwatches that run Android Wear.</b> If your smartwatch doesn&#x2019;t support Android Wear, this app won&apos;t work on your device.<br>&#x1F5D2; Make sure your smartwatch is paired and connected to your phone to install the wearable app on your smartwatch and wait a few minutes after the initial install or update on your phone before attempting to access Wear Bible on your watch.<br>&#x1F5D2; If Wear Bible has any trouble communicating with your paired mobile device try opening the Wear Bible app on your phone, then close and reopen the app on your smartwatch.<br><br><b><u>Permissions Requested:</u></b><br>&#x2757;&#xFE0F;<b>Full Network Access:</b> used to retrieve Bible verses from online service providers<br>&#x2757;&#xFE0F;<b>View Network Connections:</b> used to verify your internet connection<br>&#x2757;&#xFE0F;<b>Run At Startup:</b> used to restart the VOD notification after reboot if desired<br><br><b><u>Special Thanks:</u></b><br>&#x1F44F; <b>ibibles.net</b> - online Bible service provider<br>&#x1F44F; <b>Digital Bible Platform</b> - online Bible service provider<br>&#x1F44F; <b>OurManna.com</b> - online Verse of the Day provider",
    "histogram": {
        "1": 4,
        "2": 2,
        "3": 7,
        "4": 9,
        "5": 15
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/u0DWdogfJnccwKA5Orazv2T2gXWrdCuLeHp3TE_O8vXH8nkitwmCGED87LYTrZVoSYHe=h310",
        "//lh3.googleusercontent.com/HcBKchkBdRofrNnvcuhUEDsKahO_0v9U30_An4Hw1kQkj_t1AwJB0lKNvVqFWKKO8ADV=h310",
        "//lh3.googleusercontent.com/VpnZ6gEe7VAq7eSJ0ZpAbPtMOFKcQozZcs8b0MAqIIOSsDcE5iYFNVu5DW8rrB-ydw=h310",
        "//lh3.googleusercontent.com/Ny7kBHf9lU7mfqSLI9NiySAqwPKTNW7RtCXMVPExqjjLuEInKHdJzkrgECuUtGKqmQ=h310",
        "//lh3.googleusercontent.com/l7pq78oK0peT8RqW7_RXOWu-fsQeX8NJgjfhplLo7UAsvCdx3rcoWD-lFbj0-HYuzg=h310",
        "//lh3.googleusercontent.com/W_6ebjIHij30RWjIRY53iTBkjoNKEDQ-X_G1Qe9tRsgi7nFSlGzRBR6MUxNWhSKsPQ=h310",
        "//lh3.googleusercontent.com/0lCobl3wtrFJqt_WYc8x6BQjtrit40a7VazKrSHHVeqtjy8bqZJs3SG16YVLWAZ1K-c=h310",
        "//lh3.googleusercontent.com/_Pzn9g83mZ4xrYWWeRloWJ2mMu38OBdPaja1L1xHw18-yNitkU4UY_q2bP5EzE7YLTA5=h310",
        "//lh3.googleusercontent.com/KqB40zR77S_RfV14HKOtAYMJWom1jEGQ61bfeMOP-YH3dqtAc0UYS8uK9T1kNdxLl2A=h310",
        "//lh3.googleusercontent.com/i5gwwr_NGMcg0E2K34z7IVD12Uh8t0dbZR-qr0JCSc47B5a3y7V0OtNCTSdo64e-fg=h310",
        "//lh3.googleusercontent.com/8gG_8n3MZBbhnuvpVO4WbRsgxW0V5wDF5bvU3zx_tRKbhK_TVoGmso2WFDRqotQkhlMi=h310",
        "//lh3.googleusercontent.com/Ij6nxaMdhOBcaVDA8XYtdSnVihnF5HVy-9_LDYdJMwYjjACe0_tiMi94Aml1ddw2Kuw=h310",
        "//lh3.googleusercontent.com/1_iVUROkSLZ9ic4yR25raZngNhjdzvktSM8z8XrBqqxxfbNS_uwp9pP9CCPPoetSRHc=h310",
        "//lh3.googleusercontent.com/1CmkQjhAcfVObJ4EKYn5Vc5tHQyJua4I4dUtP110PHF94-VWsUtpotaLtKNJo9vgTG4=h310",
        "//lh3.googleusercontent.com/wdV0M4-gvPDm8J8bbXEqDOz-t9zo2gftGtDjASXvXKBjTb1xOc_UGmmBUlynEbDK8Q=h310",
        "//lh3.googleusercontent.com/--MTmOHNmiSQWH3ZwoSExEzLUI3O0voHlisu3Y2NPN-B3Lwptr_iNTfZvO3n0yRJ5Dk=h310"
    ],
    "comments": [
        "Would be nice if it worked better.",
        "Storage. I'll update my review when you allow me to download the entire bible for when I don't have Internet connection.  Other than that, love it.",
        "Best Wear App Works perfectly! Such a good idea and it's designed well and easy to use! Thanks",
        "I really like this app. But, it has stopped working.  It works on the phone, but the watch doesn't bring up the verses anymore.  Edit... Accessing on the watch is spotty.  Sometimes the verses come and sometimes they don't.  I'm keeping it, but I certainly wouldn't pay for it until the issue gets fixed.",
        "Wrong scriptures I'm not sure which other books are affected but Jude 1-25 is actually Judges 1:1-25. Please update. God Bless!",
        "Nice and also free, BUT Wish you could change the font size, and also would be great to have a daily scripture quote for the day popup on the Watch screen with option to read the entire chapter on the watch or open on the phone. Great app though👏"
    ],
    "recentChanges": [
        "🆕 - Added a new Settings tab on the wearable device. Swipe left to access.",
        "🆕 - Customize the font size, font type, and line spacing for the verse text in the Settings tab on both the mobile and wearable.",
        "🆕 - New selectors for Get Verse tab on the wearable device and Get Verse and Setting tabs on the mobile device."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.applications.mef.wearbible&hl=en&gl=us",
    "appId": "com.applications.mef.wearbible"
}