{
    "title": "Atlas Workout Tracker for Wear",
    "summary": "The only tracker that learns any exercise, now available on Android Wear.",
    "icon": "//lh3.googleusercontent.com/jrVhQfTVhdFcXfo0DEgfN4c6fz5r_IHMG7vw7eKvf4KTbhSpyTLq5y2eqUmwxWx0NQw=w300",
    "price": "$9.99",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 2.7,
    "reviews": 18,
    "developer": "Atlas Wearables, Inc.",
    "developerId": "5524386978117995381",
    "developerEmail": "mike@atlaswearables.com",
    "developerWebsite": "http://www.atlaswearables.com",
    "developerAddress": "7101 Easy Wind Dr UNIT 3103, Austin, TX 78752\nUSA",
    "updated": "December 10, 2016",
    "version": "1.0.20",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "NEW! ATLAS SMARTWATCH APP. Get the the ultimate workout tracker experience on your Android Wear smartwatch. The Atlas smartwatch app automatically recognizes nearly every exercise to optimize your routine. It automatically tracks your form on any exercise to get in you the right burn, tone, or bulk Training Zone. Atlas gives you the freedom to train without a phone, tracking heart rate (when applicable), caloric burn, muscle group activation to sync with your phone later. No other app can compete with Atlas.Automatically recognizes the exercise you’re doing then logs your rep count and analyzes your form. Use this app to view your workout journal, dive deeper into your data, and get feedback on calories burned, heart-rate zones, form score and more. Atlas Workout Tracker for Android Wear uses 360 degree sensors and the most advanced exercise database and machine-learning. WORKOUT JOURNAL. Whether you’re interested in cross-fitness, Body-building, weight loss, gym activities or anything in between, Atlas Workout Tracker for Android Wear is perfect for those looking to automatically record workouts and track progress toward fitness goals.STRENGTH IN NUMBERS. Sync your workout journal effortlessly from the Atlas Workout Tracker for Android Wear with this Atlas Wearables app. In this app you can dive deeper into advanced fitness analytics when you need it most. View muscle focus, heart rate data, calories burned, form evaluation and tunable metrics such as power, stability and velocity. There’s no magic bullet for health and fitness, and you deserve feedback and guidance on what matters to you. GUIDED WORKOUTS. Sync guided workout programs from the app to your Atlas Workout Tracker for Android Wear to navigate your workouts like a pro. Atlas Coach gives you turn-by-turn fitness helping you hit every muscle group and optimize your workout efficiency.SYNC WIRELESSLY: Atlas Workout Tracker for Android Wear syncs your hard-earned stats with your phone to give you complete access to your progress without plugging in.*Premium Heart Rate tracking only available when applicable.",
    "descriptionHTML": "NEW! ATLAS SMARTWATCH APP. Get the the ultimate workout tracker experience on your Android Wear smartwatch. The Atlas smartwatch app automatically recognizes nearly every exercise to optimize your routine. It automatically tracks your form on any exercise to get in you the right burn, tone, or bulk Training Zone. Atlas gives you the freedom to train without a phone, tracking heart rate (when applicable), caloric burn, muscle group activation to sync with your phone later. No other app can compete with Atlas.<br><br>Automatically recognizes the exercise you&#x2019;re doing then logs your rep count and analyzes your form. <br><br>Use this app to view your workout journal, dive deeper into your data, and get feedback on calories burned, heart-rate zones, form score and more. Atlas Workout Tracker for Android Wear uses 360 degree sensors and the most advanced exercise database and machine-learning. <br><br>WORKOUT JOURNAL. Whether you&#x2019;re interested in cross-fitness, Body-building, weight loss, gym activities or anything in between, Atlas Workout Tracker for Android Wear is perfect for those looking to automatically record workouts and track progress toward fitness goals.<br><br>STRENGTH IN NUMBERS. Sync your workout journal effortlessly from the Atlas Workout Tracker for Android Wear with this Atlas Wearables app. In this app you can dive deeper into advanced fitness analytics when you need it most. View muscle focus, heart rate data, calories burned, form evaluation and tunable metrics such as power, stability and velocity. There&#x2019;s no magic bullet for health and fitness, and you deserve feedback and guidance on what matters to you. <br><br>GUIDED WORKOUTS. Sync guided workout programs from the app to your Atlas Workout Tracker for Android Wear to navigate your workouts like a pro. Atlas Coach gives you turn-by-turn fitness helping you hit every muscle group and optimize your workout efficiency.<br><br>SYNC WIRELESSLY: Atlas Workout Tracker for Android Wear syncs your hard-earned stats with your phone to give you complete access to your progress without plugging in.<br><br>*Premium Heart Rate tracking only available when applicable.",
    "histogram": {
        "1": 8,
        "2": 2,
        "3": 0,
        "4": 3,
        "5": 5
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/WO8xD7JXnPY4dz-jMMA9n4xkG_mc7SgVCGadXLo7qKTEfySOhRXrLWEuIja58jSbXC-7=h310",
        "//lh3.googleusercontent.com/X7R4BsIlbmof8HUS0XNmOClJJ4rED00Exq4DArb_Zp5o1pQTerUUKAy4XvDi4mQ8WTO6=h310",
        "//lh3.googleusercontent.com/mV0d_JqxINBdOBIXoulL0_LNjXvt59E8272Issm-dOVRLweUiDFE_KzyOlkKZZE6Cn9u=h310",
        "//lh3.googleusercontent.com/UWpa-Vm5gPbC3LEClC1tFRWrnex253JgwHZFSE0cmdR_B7SQXuRN3rmnkoSNGfXW7HUn=h310",
        "//lh3.googleusercontent.com/-oRlHFS_n1NFdLYetKvXXbBAKfn7oyuBqEfYFm2DvCJmKoPoWTdevsmui6BQizllJ6cT=h310",
        "//lh3.googleusercontent.com/E7nuc4ywfvFX15NcSmtatlKD9DqjKMLj7LgHw1sCCPxoLh4OTPnleNavt16J3HRnVA=h310",
        "//lh3.googleusercontent.com/E53VSTRNRqQ2CtKkjnohTd1hT0a3LuacEGLxIOlUlxvCjFZY5lF96zSAXNibgmQwaq0=h310",
        "//lh3.googleusercontent.com/Pf5YoWXWgnngNyy6aqT8MSW3NNArmTw-0RQ67mfFkG39eNHOGRUWhiXukLNkwLMotA=h310",
        "//lh3.googleusercontent.com/fhzbTEntUIE91j8mczgd4dzXPjBenXXJUjTz2NtOJx1qlkSnM_UYQFyTMKIKdvJFrxc=h310"
    ],
    "comments": [
        "Atlas doesn’t track exercises regardless of claims. Training exercises works most of the time by the exercise cannot be determined even when a custom workout has been laid out. Any notification will Freeze/ Crash the app during a workout. Used the app for 3+ months and it’s never tracked an exercise correctly during the exercise used the app for mostly tracking what exercises I had planned to perform.  I’ve also been in contact with their support because the directions on setting up the app and training exercises were poor. I’m using the LG Watch Urbane. I cannot recommend the app",
        "Horrible ui, can't add sets only exercises and reps, can't add exercises that you don't want auto tracking but want rest counter and manual rep and weight input. Cant modify number of reps and weight used on the fly either, only add missing. Long way to go on this app, 'exercise tracker' is much better, atlas could do with following its ui and usability.",
        "Promising but needs a lot more polish. Frequent crashes on my moto 360 gen 2 watch. Improperly identifying exercise, not recognizing an exercise at all, and complete app crashing happens regularly.",
        "Love it, but... I really like this application. Unlike the one other app that claims to be able to recognize movements, this one really does. I even bought the full version. However, while the website states that the app supports heart rate monitors, this is the case only for those built into watches, not for chest straps. This should be properly stated. Thus only 4 stars from me for now.",
        "needs to be updated, almost a year out of date",
        "UPDATE 11/2/16 - The developer has been very responsive and is working with me on the issues I was experiencing.  I'm happy to report the crashing has gone away on my LG Urbane 2nd Edition LTE, but there are still some issues with duplicate entries and reps not being recognized.  I will try some tips from Atlas on how to improve the detection.    I'm very excited about this app since there really isn't any other app like it on Android Wear.  There are a lot of workout trackers for phones, but for the growin"
    ],
    "recentChanges": [
        "- New! Activity summary",
        "- New! Coach feature - Atlas Coach will help you find the right workout for your goals",
        "- New! Workout Journal - now you can rename your workouts, log exhaustion, and add notes",
        "- Smarter workout names, Atlas automatically names your workout based off of your muscles worked"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.atlaswearables.ionic.androidwear&hl=en&gl=us",
    "appId": "com.atlaswearables.ionic.androidwear"
}