{
    "title": "McAfee Mobile Security & Lock",
    "summary": "Free antivirus app with security lock, lost phone finder, and contacts backup",
    "icon": "//lh3.googleusercontent.com/5GpHN9UUvrw3_EVkXEWKLPb1etOocZoUhQcxD0okLwYTakA3xPFhMiIymh0uB4QPbh8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.4,
    "reviews": 551903,
    "developer": "McAfee LLC",
    "developerId": "McAfee+LLC",
    "developerEmail": "Mobile_Support@mcafee.com",
    "developerWebsite": "https://www.McAfeeMobileSecurity.com",
    "developerAddress": "McAfee Inc., Headquarters\n2821 Mission College Blvd.\nSanta Clara, CA 95054\nUSA",
    "updated": "February 8, 2018",
    "version": "4.9.5.1944",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "McAfee Mobile Security, a free virus cleaner, protects and enhances your Android phone or tablet’s performance with award-winning Anti-Theft, Lost Phone Finder, App Privacy Protection, Antivirus, Anti-Spyware, Anti-Malware, Virus Removal, Performance Optimization, SMS Backup, Contacts Backup, and Security features.*McAfee LiveSafe and McAfee All Access users will automatically receive the premium version of our free antivirus app.Lost Your Device? Log in to https://www.mcafeemobilesecurity.com/ with your registered email to find your phone and access your backed-up info. Tracking a phone has never been so simple.Questions? Contact us: https://service.mcafee.com/ or find answers: https://www.mcafeemobilesecurity.com/support/FREE FEATURES🛡️ANTI-THEFT & SECURITY▪ Security Lock and CaptureCam: Locks your device and takes a snapshot of the person holding it▪ Anti-Spyware: Stops thieves from gaining access to your personal information▪ Remotely Wipe Data: Wipe select data or revert to factory settings with our anti-theft features▪ SMS Backup, Contacts Backup, and Restore Data*▪ Locate, Track, and Alarm: Find your phone, locate it on the map, sound a remote alarm, or get step-by-step help for tracking a phone▪ Anti-theft Uninstall Protection: Keep a thief from uninstalling the app on your  device▪ Remotely manage your mobile security antivirus app from the web portal @ https://www.mcafeemobilesecurity.com/ or via SMS using any smartphone or tabletOther features: Pair Your Android Wear, S.O.S.🔒PRIVACY▪ Multi-User App Profiles: Control which apps other people see on your device**▪ App Lock: Lock apps with sensitive content **▪ App Protection: Know which apps may put your personal data at risk▪ Call Blocker and SMS Filter *🚀PERFORMANCE OPTIMIZATION▪ Widget: Stay up to date on your antivirus security status and fix issues with one tap**▪ Battery Optimizer:  Make your device last longer▪ Memory Cleanup: Free up memory (RAM) of background apps and speed up your device▪ Storage Cleanup: Remove unwanted files and apps▪ Track Data Usage: Set data limits and monitor usage💎ANTIVIRUS & WEB PROTECTION▪ Mobile security antivirus and virus removal: Scans for malicious code from files, SMS, SD card, apps and internet downloads using state-of-the-art antivirus software. Anti-malware provides real-time detection of malware▪ Safe Web Surfing: Blocks access to risky sites ▪ Wi-Fi Security: Protects from ARP spoofing attacks and unsecured Wi-Fi networks▪ Free Virus Cleaner: Finds and removes infections on your mobile deviceNOTE*Call, SMS Blocker, and SMS restore are not available for devices with Android version 4.4 (KitKat) and above.There are local or International SMS fees when you use certain antivirus security features**Android 5.1.1 and/or Android 6.0 users must grant accessibility for McAfee Mobile Security to enable Widget, App Lock, App ProfileThis app uses the Device Administrator permissionThis app uses Accessibility servicesPREMIUM FEATURES▪ Phone Support▪ Media Upload▪ No Ads",
    "descriptionHTML": "McAfee Mobile Security, a free virus cleaner, protects and enhances your Android phone or tablet&#x2019;s performance with award-winning Anti-Theft, Lost Phone Finder, App Privacy Protection, Antivirus, Anti-Spyware, Anti-Malware, Virus Removal, Performance Optimization, SMS Backup, Contacts Backup, and Security features.<br><br>*McAfee LiveSafe and McAfee All Access users will automatically receive the premium version of our free antivirus app.<br><br>Lost Your Device? Log in to https://www.mcafeemobilesecurity.com/ with your registered email to find your phone and access your backed-up info. Tracking a phone has never been so simple.<br><br>Questions? Contact us: https://service.mcafee.com/ or find answers: https://www.mcafeemobilesecurity.com/support/<br><br><br>FREE FEATURES<br>&#x1F6E1;&#xFE0F;ANTI-THEFT &amp; SECURITY<br>&#x25AA; Security Lock and CaptureCam: Locks your device and takes a snapshot of the person holding it<br>&#x25AA; Anti-Spyware: Stops thieves from gaining access to your personal information<br>&#x25AA; Remotely Wipe Data: Wipe select data or revert to factory settings with our anti-theft features<br>&#x25AA; SMS Backup, Contacts Backup, and Restore Data*<br>&#x25AA; Locate, Track, and Alarm: Find your phone, locate it on the map, sound a remote alarm, or get step-by-step help for tracking a phone<br>&#x25AA; Anti-theft Uninstall Protection: Keep a thief from uninstalling the app on your  device<br>&#x25AA; Remotely manage your mobile security antivirus app from the web portal @ https://www.mcafeemobilesecurity.com/ or via SMS using any smartphone or tablet<br>Other features: Pair Your Android Wear, S.O.S.<br><br>&#x1F512;PRIVACY<br>&#x25AA; Multi-User App Profiles: Control which apps other people see on your device**<br>&#x25AA; App Lock: Lock apps with sensitive content **<br>&#x25AA; App Protection: Know which apps may put your personal data at risk<br>&#x25AA; Call Blocker and SMS Filter *<br><br>&#x1F680;PERFORMANCE OPTIMIZATION<br>&#x25AA; Widget: Stay up to date on your antivirus security status and fix issues with one tap**<br>&#x25AA; Battery Optimizer:  Make your device last longer<br>&#x25AA; Memory Cleanup: Free up memory (RAM) of background apps and speed up your device&#x25AA; Storage Cleanup: Remove unwanted files and apps<br>&#x25AA; Track Data Usage: Set data limits and monitor usage<br><br>&#x1F48E;ANTIVIRUS &amp; WEB PROTECTION<br>&#x25AA; Mobile security antivirus and virus removal: Scans for malicious code from files, SMS, SD card, apps and internet downloads using state-of-the-art antivirus software. Anti-malware provides real-time detection of malware<br>&#x25AA; Safe Web Surfing: Blocks access to risky sites &#x25AA; Wi-Fi Security: Protects from ARP spoofing attacks and unsecured Wi-Fi networks<br>&#x25AA; Free Virus Cleaner: Finds and removes infections on your mobile device<br><br>NOTE<br>*Call, SMS Blocker, and SMS restore are not available for devices with Android version 4.4 (KitKat) and above.<br>There are local or International SMS fees when you use certain antivirus security features<br>**Android 5.1.1 and/or Android 6.0 users must grant accessibility for McAfee Mobile Security to enable Widget, App Lock, App Profile<br>This app uses the Device Administrator permission<br>This app uses Accessibility services<br><br>PREMIUM FEATURES<br>&#x25AA; Phone Support<br>&#x25AA; Media Upload<br>&#x25AA; No Ads",
    "histogram": {
        "1": 27227,
        "2": 13409,
        "3": 34478,
        "4": 112265,
        "5": 364524
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/kXW04NplQu0-o8aNKguV2bEXUeTAX5L9Z1hRbD4pWYBxl8q4V2zx2yx5-qityqfYhfI=h310",
        "//lh3.googleusercontent.com/VR6XDsdsEfwuq5smdBnlIoteI5KMk6sTkPdQTmThvEhHVVpLPPmOTHSUwDWQ4wbQ1gqh=h310",
        "//lh3.googleusercontent.com/6NWJF7w-0w-IvvsKA9uS-5EMhCgMo5gawoCt67pNvkrg2PlFCrsguJ4f3Z0_z44141U=h310",
        "//lh3.googleusercontent.com/o_KlXZrTeZgvAQeUVP5h_oS6x6iOmnm4Y2u8GEgSry6hN1JSu-Fd4S3zqUL__ssKSre-=h310",
        "//lh3.googleusercontent.com/ujttfVZBRgYDPfcjwUysMvRNc6s-Mb2Ri91stN_qOcQK6j4YH93ahFXkJvhIfV0mzkTk=h310",
        "//lh3.googleusercontent.com/akIq3nUPjkpv8F9kTCX24vvv8ZPrJfmUl5nJ6EvIOej48ETzRdu87a5T7dB0hF0KWyY=h310"
    ],
    "comments": [
        "I have used McAfee Mobile Security free for for my phone for over 2 years now and am very satisfied. Notice it doesn't have a firewall like my PC Total Protection. Had to use another app. for firewall which allows  me to pick which continents I can block. This would be a great feature to be added to McAfee Mobile. Also noticed you can restore  contacts but nothing else. Instead of paying for Mobile it would also be great to combine with the  PC Total Protection. Love my McAfee products!",
        "I purchased McAFee Security Software for our family. To be honest, I wasn't expecting much security for the price I paid for the McAfee 10, which was at as a Prime Deal on Amazon & even though I had used McAfee before at a much smaller level, it wasn't anything special, if you know what I mean. Man, was & have I been totally shocked. McAfee is unbelievable how it protects our family. Excellent purchase on my part!!",
        "I like it but using so much ram memory This apps using a lot memory make my budget 1gb ram phone slow and lag. I really like that concept shows my phone performance on right screen this should be every 7 minutes to tell your phone performances.              Thanks. Regards, Sam",
        "This app is great at protecting all of my devices with the exception of my huawei mate 10 pro... As it keeps switching McAfee security off not sure why this is?UPDATE 25/2/18 problem seems to have resolved by deleting a duplicate network provider app thanks for the response McAfee",
        "Bells and whistles,ahh,no.that's for kids! 100 percent detection of newest and oldest viruses by AV-Test?...YES. McAfee keeps me from having to buy a new phone and keeps me safe on the web. One of the very best in the security business  and they are known for it...I NEVER HAVE TO WORRY WITH McAfee. They are only rated low because of people wrongly wanting fluff instead of realizing this is TOP SECURITY. PUT McAfee on your phone and play and go to sleep with peace!",
        "Was a great product for a smartphone. The latest updates now don't allow anything to be done other than optimise all. Other options are still available but you can't access them. This is on annual Xperia and same issue on Samsung S7. Please fix!"
    ],
    "recentChanges": [
        "✏️ Optimized Wi-Fi Security feature",
        "✏️ Improved device lock",
        "✏️ Bug Fixes",
        "If you love McAfee Mobile Security, please leave us a review and rate us 5 stars!! (5 Stars = Good)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.wsandroid.suite&hl=en&gl=us",
    "appId": "com.wsandroid.suite"
}