{
    "title": "WAVE Calendar",
    "summary": "Free calendar app, which has free tasks and other amazing features!",
    "icon": "//lh3.googleusercontent.com/p8eJaLHPQ6YyiUMNJknHBfm47RexX0CmKQxFyvWfPLsLRJ3UFcR4hy-vNbf67J_186w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 2932,
    "developer": "Calendar Apps by E-sites",
    "developerId": "5521395450590997905",
    "developerEmail": "hello@wavecalendarapp.com",
    "developerWebsite": "http://www.wavecalendarapp.com/",
    "developerAddress": "Reduitlaan 29\n4814DC Breda\nThe Netherlands",
    "updated": "August 11, 2015",
    "version": "2.1.13",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Featured in VentureBeat, Forbes, Sony and iCulture. WAVE Calendar is a free calendar app with a beautiful UI and a smooth navigation. The app includes free tasks and additional calendars to enrich your calendar. To make your calendar experience even better you can download three widgets, add the local weather, add attachments, and add special tags to appointments. Besides this, the app includes all the standard features you would expect from a calendar app! Also available for iPhone 6, 6+ and wearables. Check out our social media pages for the latest updates and news!Facebook: https://www.facebook.com/WAVEcalendarTwitter: @WAVECalendarapp Do you have a question or feedback for us? Email us at support@wavecalendarapp.com. Tags: Calendar, Agenda, Kalender, Google Tasks, Free",
    "descriptionHTML": "Featured in VentureBeat, Forbes, Sony and iCulture.<br> <br>WAVE Calendar is a free calendar app with a beautiful UI and a smooth navigation. The app includes free tasks and additional calendars to enrich your calendar. To make your calendar experience even better you can download three widgets, add the local weather, add attachments, and add special tags to appointments. Besides this, the app includes all the standard features you would expect from a calendar app!<br> <br>Also available for iPhone 6, 6+ and wearables.<br> <br>Check out our social media pages for the latest updates and news!<br>Facebook: https://www.facebook.com/WAVEcalendar<br>Twitter: @WAVECalendarapp<br> <br>Do you have a question or feedback for us? Email us at support@wavecalendarapp.com.<br> <br>Tags: Calendar, Agenda, Kalender, Google Tasks, Free",
    "histogram": {
        "1": 126,
        "2": 147,
        "3": 370,
        "4": 941,
        "5": 1348
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Kt2CQNLx4WBiXkyhbMmdgmei9gluIR77UjlHDL0FgVXIt0RZXWsDbYM1iOXJDK0IaukZ=h310",
        "//lh3.googleusercontent.com/YHD3st4hkPXlC6dmVexp90j0FseDPHNIvBJ_9_Eigo1G4AqEekUZbnmktN5ctt-aEw=h310",
        "//lh3.googleusercontent.com/ZuWyuEQcPT3tlH7kCrqFcC0AezbjJFEYt2QoMDpybb8Rf7ZsbowSNxOJYMLgWVAbKg=h310",
        "//lh4.ggpht.com/RyqQWhxkJNSbxA6jU9aVMt3UI5KD1PKmGFtThv-TQKQHQCcTHUBsLWZ5pGEmgWPEMUqP=h310",
        "//lh3.googleusercontent.com/NpcpxhPkUxPXENNXFPW1nOwluSjwSOQkXLsybta1OXsubzB_w1CvGstXpbGSxh6eVQ=h310",
        "//lh3.googleusercontent.com/GGbv98A9ADs7FXUzKmYEPjU6XjnnMLz-yiokqvS13jLDNttTxZDnkx7LeyD1-VjUag=h310",
        "//lh3.googleusercontent.com/upSTs6NwZqJ3IK2dfBZFcIfgRNF15t-EbXKcj7J6G4meT-1GHNI3apIgrXa7IaVF5xI=h310",
        "//lh3.googleusercontent.com/EhWSmVJRzk5kEyyv-rXvsxtTl-5ZncUaBUfNYlrkqJNDFnyEL8w3_beQUj_UTpKjoZE=h310",
        "//lh3.googleusercontent.com/XltizO2txpzYrBQub-TiqL5_NR5B2rZVGFPzg1pF5-jtTpZ3wTOWwp0N2WrYe2_KMwdA=h310",
        "//lh3.googleusercontent.com/aTJE3KznPLSK0IHW9GNn2EW-8pAAmhltuOBkHvB-ml-qKXME6KM9YSmMTWWgdLDeow=h310",
        "//lh3.googleusercontent.com/yW6bObou0PygZUzuHw8oYi5Yx54mgQtmn-ripHhnTekW_XkdFRbkunmsuiud87ZClUI=h310",
        "//lh3.googleusercontent.com/VuJ8i54mJj0TSfQq1dZNcaXcdjI32-oDIMtnQ1ywRnHmjDgtj1yKoBmLKTSNHstU3FVg=h310",
        "//lh3.googleusercontent.com/Nox9BacjriwONdYIT6uP2GcxJxSkl5uhLCSUtjoE5mgstBChbNPfKuC7GqlQTnrtjOY=h310",
        "//lh3.googleusercontent.com/6JdVhmiXMGUyQ0On898TbsudOY1C20gQbA_BZgkjqywupG4SPitJxS-scr0uNhJvZN4=h310",
        "//lh3.googleusercontent.com/6c1gIR9mx2F0i6ga6YdlFFFjfTgtFt4StFkAwAbw_ccxfc9NyKvIg75BDiluThdLU4E=h310",
        "//lh3.googleusercontent.com/_bGRFPCC24zZM9w2WtpCWgL4P2-7CLpYI2GS-jOSAMYYKHkosa9V5x_BEUr8i4s0b3c=h310",
        "//lh3.googleusercontent.com/GtLNywcLW_VEEV449XfLPrU4i0jvq-lu3Rq3VNuod1CDuK-8agx7CX_Uf0ueXR6REWGF=h310"
    ],
    "video": "https://www.youtube.com/embed/KJeDaZ075pM",
    "comments": [
        "Great app It works very well for all my scheduling needs, unlike other apps I've tried. The only complaint I have is that the weekly schedule widget doesn't update until late in the day so it'll say yesterday's date. Removed a star because now the widget doesn't work at all, it just says loading. Will give more stars when fixed",
        "Pretty good One week used, like the simplicity. 2 small possible improvements: when I tried to edit a time, the app crashed today. And instead of having 3 choices when placing something new, maybe a default could be for normal activities, and a special button for tasks. This way could increase speed for putting new entry. Besides this, it s the 4th app I ve tested this week and I m going to stick to it because it s as simple, clean and practical as I d like it to be. Thanks!",
        "Clean, simple, and one of the few calendar apps I have found able to integrate Google tasks. All plusses in my book. One minor issue is the inability to change the font size especially in the Month and Week Agenda views. Would be much easier on this old man's eyes. Also would like to see option to integrate use Google calendar colors. Add these and you will have 5 star app.",
        "One of the best I've used a lot of calendar apps but never found one that ticked all boxes for me. This comes very close though. Clean, intuitive, gorgeous to view and use. Very happy with it. UPDATE So I've been using this calendar now for a while and at first it was exceptional. However over the past 2 weeks I get warning messages (I have a Samsung S6 Edge) that Wave is slowing my device down whilst accessing network. This warning is occurring 2 or 3 times a day. Maybe a bug update is needed?",
        "I think this app is great. I happen to like the simplicity (and the color!). There was two issues that I encountered:  1st: Yahoo calendar is currently not supported (thank you for the fast reply to my e-mail!). I currently use it and would like that service. 2nd: The NFL (American Football) schedule add-on for three teams I picked did not work.  The feature to utilize this app with the wearable devices is great, which is a strong selling point for me!  I will uninstall for now and hope that at least one of these issues is fixed in the future. I will reinstall then.",
        "Will be absolutely amazing with tweaks! This is the solution for all those trying to get Google tasks on your Android. @Devs Would love a way to choose to launch the app straight to the Tasks sections that way I can tick things off and close. Also I am sure you are aware the widgets need a lot of work. The scales are way off as of right now. Would love a widget that resembles the Tasks screen. Keep up the great work. This is the one app I am really interested in its development."
    ],
    "recentChanges": [
        "- Bug fixes",
        "- More coming up."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.esites.ecal&hl=en&gl=us",
    "appId": "com.esites.ecal"
}