{
    "title": "DUBAI POLICE",
    "summary": "Official Dubai Police App. Futuristic Police for a Smart City.",
    "icon": "//lh3.googleusercontent.com/Ub_BkYzFVGrjT7kuojYI_mWsPBkOabFyfm0KaRQb3mlFDqkIslSW94dvKGxMichL1TE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.4,
    "reviews": 9018,
    "developer": "DUBAI POLICE",
    "developerId": "DUBAI+POLICE",
    "developerEmail": "smartservices@dubaipolice.gov.ae",
    "developerWebsite": "http://www.dubaipolice.gov.ae",
    "updated": "January 20, 2018",
    "version": "Varies with device",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "size": "Varies with device",
    "description": "The official Dubai Police App is your access to all our smart services. Our app just got more intuitive with the newly added Drive Mode and Police Station Mode to enhance usability. Our new Drive Mode feature allows for faster and safer commute in Dubai. We have also made your visit to our police stations much smarter with the Police Station mode. Download NOW! And be an effective part of the community by contributing toward safety & security through the newly added Police Eye service.Awards# WINNER OF BEST M-GOVERNMENT SERVICE AWARD 2014, 2015, 2016 , 2017# WINNER OF WORLD SUMMIT AWARD–M-GOVERNMENT 2014# WINNER OF HAMDAN BIN MOHAMMED AWARD – SMART GOVERNMENT 2013, 2014, 2015 , 2016Main Features:- Police Station Mode - Allows you to check the number of customers waiting at each police station including the average waiting time. You can also issue a ticket before reaching the station to avoid standing in line.- Drive Mode – Drive smart by receiving instant traffic accidents information including the traffic status. - Police Eye - Report any suspicious activity with ease and anonymity..- My Map – Interactive map with information about traffic accidents, police station locations, 24/7 pharmacies and more. - Report Traffic Violation in Dubai via \"We Are All Police\"- Report Traffic Accidents - Fill a simple accident form in just 3 minutes, take pictures of damaged areas and receive your report via email or SMS.- Activity Feeds – View all your transactions timeline in one view.- MYID - Sign-in using your MYID account and access your profile assets. Bring all your assets under one screen & view all your vehicles, pay all your fines, view cases status & application request.- Interactive Messaging Center which is a new interactive channel to easily apply for our services by text or voice chatting.- Business Mode: if you are an owner or PRO of any company you can now apply for our services for many employees one time.- Smart Reporting Camera: which makes reporting more easily, all what you need to do is capture anything and send it to us using proper service (Police Eye, We Are All Police and Feedback).\"From a Smart Police to a Smart User.\" Dubai Police TeamCopyright © 2017 All Rights Reserved, Dubai Police General HQ* Continued use of GPS running in the background can dramatically decrease battery life.",
    "descriptionHTML": "The official Dubai Police App is your access to all our smart services. Our app just got more intuitive with the newly added Drive Mode and Police Station Mode to enhance usability. Our new Drive Mode feature allows for faster and safer commute in Dubai. We have also made your visit to our police stations much smarter with the Police Station mode. <br><br>Download NOW! And be an effective part of the community by contributing toward safety &amp; security through the newly added Police Eye service.<br><br><br><br>Awards<br><br># WINNER OF BEST M-GOVERNMENT SERVICE AWARD 2014, 2015, 2016 , 2017<br><br># WINNER OF WORLD SUMMIT AWARD&#x2013;M-GOVERNMENT 2014<br><br># WINNER OF HAMDAN BIN MOHAMMED AWARD &#x2013; SMART GOVERNMENT 2013, 2014, 2015 , 2016<br><br><br><br>Main Features:<br><br><br><br>- Police Station Mode - Allows you to check the number of customers waiting at each police station including the average waiting time. You can also issue a ticket before reaching the station to avoid standing in line.<br><br>- Drive Mode &#x2013; Drive smart by receiving instant traffic accidents information including the traffic status. <br><br>- Police Eye - Report any suspicious activity with ease and anonymity..<br><br>- My Map &#x2013; Interactive map with information about traffic accidents, police station locations, 24/7 pharmacies and more. <br><br>- Report Traffic Violation in Dubai via &quot;We Are All Police&quot;<br><br>- Report Traffic Accidents - Fill a simple accident form in just 3 minutes, take pictures of damaged areas and receive your report via email or SMS.<br><br>- Activity Feeds &#x2013; View all your transactions timeline in one view.<br><br>- MYID - Sign-in using your MYID account and access your profile assets. Bring all your assets under one screen &amp; view all your vehicles, pay all your fines, view cases status &amp; application request.<br><br>- Interactive Messaging Center which is a new interactive channel to easily apply for our services by text or voice chatting.<br><br>- Business Mode: if you are an owner or PRO of any company you can now apply for our services for many employees one time.<br><br>- Smart Reporting Camera: which makes reporting more easily, all what you need to do is capture anything and send it to us using proper service (Police Eye, We Are All Police and Feedback).<br><br><br><br>&quot;From a Smart Police to a Smart User.&quot; Dubai Police Team<br><br>Copyright &#xA9; 2017 All Rights Reserved, Dubai Police General HQ<br><br><br><br>* Continued use of GPS running in the background can dramatically decrease battery life.",
    "histogram": {
        "1": 576,
        "2": 303,
        "3": 440,
        "4": 950,
        "5": 6749
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/gsCpVx6KMhHdb2CmoHp195OZnnnaStPn6UcWusyfNbWkj0QXIANsqzwpWZeiAJbw7Ys=h310",
        "//lh3.googleusercontent.com/bpZitmptqneG50rDa_8I9MfdOBABkiBOGbi61dzVnid59AeXW13huelGDkIqmYZ3wOYx=h310",
        "//lh3.googleusercontent.com/3RPH1rbsmcNyCjOU-KpMy1CMcgfASjod9dsT_9GoydEl6im3Fz6su0ID96uFhrYPYNO4=h310",
        "//lh3.googleusercontent.com/y3LvMkA9tZdJ5LysBeS8tiS8pt7McaXUOUQ3etP_U2vJ-yBb-ToAdJVD9m2N3-FZVFY=h310",
        "//lh3.googleusercontent.com/LKuQ2VSz2UF0s4fsCUG4hSQGcu0CH2E9p_9s2WbmCwdOHIlVBcdqVla_uy0EkvE9nA=h310"
    ],
    "comments": [
        "Most of the features don't work. Trying to inform about something but server down. Every time using the we are police, have to register it, meanwhile the incident finishes off. Dubai is technically far superior in terms of police but don't neglect the application as well",
        "Thank You So Much Dubai Police To Make This Application Very Helpfull. I've Advice When Someone Save Car Number And When Fine Come Plz Make Sure Notification Alerts So We Can Know Directly When Notification Come We Have Fine Come.   Thanks And Regards",
        "Frustrating! Not working.. Shows police station not enabled! Have to go to PS now!",
        "Doesn't work at all. Very frustrating seen as there are now things you can only deal with on the app and now can't even do that",
        "not working .. waiting solution police team best police in world .. masha'Allah",
        "Downloaded the app for one thing and it is not working at all. The app freezes and I couldn't get anything done on it."
    ],
    "recentChanges": [
        "* New Design and Experience.",
        "* Esaad Service Enhancement.",
        "* Adding Vehicle Obstruction Service Under traffic services which enable you to report about any vehicle obstructing you.",
        "* Login using Emirates ID only.",
        "* Happy To Pay new feature integrated with Fine Payment Service which allow you to share your opinion about where and how to spend paid amounts.",
        "* Bug fixing and performance enhancement."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.dubaipolice.app&hl=en&gl=us",
    "appId": "com.dubaipolice.app"
}