{
    "title": "Contractions",
    "summary": "Easily track your contractions!  Tracks starting time, length, and intensity!",
    "icon": "//lh4.ggpht.com/xqn60W7hnCWcxx6sfGg43vBcF6Ga6xM6FwXVqbRawkGHzxohu8whT0CTSMufunO85w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.1,
    "reviews": 10,
    "developer": "Altus Apps",
    "developerId": "Altus+Apps",
    "developerEmail": "support@altusapps.com",
    "developerWebsite": "http://altusapps.com",
    "developerAddress": "316 Essex Rd 18\nLeamington, ON  N8H 3V5\nCanada",
    "updated": "July 31, 2014",
    "version": "1.0.3",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "When you start having contractions, this is the app you need to have!Contractions is the easiest, simple to use, most beautiful app for recording your contractions, their length, and even intensity!  The last thing you want to worry about when you start having contractions is how to measure them for when you should go to the hospital! Contractions is the first Wear compatible app for recording contractions.  You can record everything right from your watch, without even taking your phone out of your pocket!",
    "descriptionHTML": "When you start having contractions, this is the app you need to have!<br><br>Contractions is the easiest, simple to use, most beautiful app for recording your contractions, their length, and even intensity!  The last thing you want to worry about when you start having contractions is how to measure them for when you should go to the hospital! <br><br>Contractions is the first Wear compatible app for recording contractions.  You can record everything right from your watch, without even taking your phone out of your pocket!",
    "histogram": {
        "1": 0,
        "2": 2,
        "3": 1,
        "4": 1,
        "5": 6
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh5.ggpht.com/R7mlHj_A0BPewWBG5EsIcJZanYOOuRevsJ0NoXIwZUL9VBCICuqwxxB0RutqhBEr8sI=h310",
        "//lh5.ggpht.com/IfNhWWoUtc6BRr7UG5asINrnTGBi0cJ2qA7q7E7rkEr66mE1BonpVu9bRriJCRqTYoA=h310",
        "//lh6.ggpht.com/1Ub322XlQS8BxhATe52QIdG2sh5MjVyVplFMJyrhgBTa8wT56jKIPluzY_lq9ZubtuU=h310",
        "//lh6.ggpht.com/C57H4_qaIs_U4sRv-sXRiwTytHbuh-ofGJd1T-VqtdGGtIW9U7pwZYhAdv2qOVlztw=h310",
        "//lh3.ggpht.com/s-9GEnQJz8K2-mIbJrhdJcXMVyzaCaThceSFVYbCgm229Gj0plOnz5oPf_6QrJW3LAx1=h310"
    ],
    "comments": [
        "Works great, simple & efficient. If you're planning on timing on an Android Wear device, note that you have to keep the app running (not enough just to have it installed) on a connected device (e.g. phone), otherwise you'll get a \"Connection failed\"-notification. Might be nice to have it start / stop the app on a connected device from your Android Wear device if it isn't running yet..?",
        "Lol Lol this is a good way to get a fist to the head by a screaming wife. Being on your watch while she's contracting.... Good luck folks.",
        "Perfect Great app. Nice UI design, works on multiple devices, including watches... Perfect app for tracking the most important minutes of your life. :)"
    ],
    "recentChanges": [
        "Fixed Wearable App"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.altusapps.contractions&hl=en&gl=us",
    "appId": "com.altusapps.contractions"
}