{
    "title": "Cookpad",
    "summary": "Find and share great recipes and chat about your daily cooking in real time",
    "icon": "//lh3.googleusercontent.com/EKKI-Yd_7nQHMfEo9o4sTnUG9Uv-AGuHF2j3exarqQcg8xYyHg4eCCOY2Jw3SvY9ekI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.4,
    "reviews": 115712,
    "developer": "Cookpad Limited",
    "developerId": "Cookpad+Limited",
    "developerEmail": "help@cookpad.com",
    "developerWebsite": "https://cookpad.com/us",
    "developerAddress": "7-10 Chandos Street, London, W1G 9DQ",
    "updated": "March 1, 2018",
    "version": "2.57.0.0-android",
    "genre": "Food & Drink",
    "genreId": "FOOD_AND_DRINK",
    "description": "Best place to share and find recipes made and shared by home cooks like you. Cookpad provides a unique social and safe environment for people to search for and save recipes, publish recipes and photos, or share privately with friends and family in our new chat. Cooking is no longer lonely with Cookpad*Looking for a recipe?* Cookpad has tons to choose from, including main dishes, appetizers, drinks, side dishes, desserts, ethnic recipes, soups, stews and diet recipes. Recipes for everyday cooking and recipes for special occasions like Thanksgiving or Christmas. Search by ingredients you have at home or dish you want to make and start cooking at home! When you make the recipe, you can share the photo of your dish with the recipe author and so recommend it to other Cookpad users.*Cooking diary*. If you give Cookpad access to your phone pics, you'll see your cooking photos from the past 3 years in the App, next to your saved and published recipes. You can see what you cooked this time in previous years, share the photo with family or friends on the chat and plan what to make this week!! *Publish recipes*. Users can publish their own recipes on Cookpad.The recipes themselves don't need to be anything fancy, and that’s another reason why Cookpad is unique. Recipes are published by real people cooking at home with clear steps and helpful photos.*Private recipes*. Always have your recipes at hand. If you don’t want to publish your recipes but do want to have them all in one place, that’s fine. Just click save, but not publish. You’ll be able to share with friends and family on the Cookpad chat. But other Cookpad users won’t see them. *Chat and share*. Cookpad takes the loneliness out  of cooking. You can share recipes, cooking moments, memories, photos, advice and questions in real time on Cookpad Chat. Chat one-to-one or create a group. Your private space to talk about cooking. Cookpad is the World's largest homemade recipe-sharing app and is currently available in English, Español, Indonesia, العربية, Việt Nam, ไทย. Choose your preferred language the first time you start the app. When you want to switch languages and explore homemade dishes from other countries, go to settings, log out, choose another language and repeat registration process. We have helped many people to live healthier and discover the taste of real food. Join us!App Features:- Publish and share recipes in public or private- Search for recipes by title, ingredients, meal-type or other- Share my recipe photo with the recipe author after preparing it- Chat with family and friends about what’s cooking or what to cook- Have all my cooking photos in one place - cooking diary- Timeline to see what my friends are cooking and sharing.- Bookmark recipes for quick access. - Find seasonal recipes for Halloween, Thanksgiving and Christmas dinners. Contact us at help@cookpad.com",
    "descriptionHTML": "Best place to share and find recipes made and shared by home cooks like you. Cookpad provides a unique social and safe environment for people to search for and save recipes, publish recipes and photos, or share privately with friends and family in our new chat. Cooking is no longer lonely with Cookpad<br><br>*Looking for a recipe?* Cookpad has tons to choose from, including main dishes, appetizers, drinks, side dishes, desserts, ethnic recipes, soups, stews and diet recipes. Recipes for everyday cooking and recipes for special occasions like Thanksgiving or Christmas. Search by ingredients you have at home or dish you want to make and start cooking at home! When you make the recipe, you can share the photo of your dish with the recipe author and so recommend it to other Cookpad users.<br><br>*Cooking diary*. If you give Cookpad access to your phone pics, you&apos;ll see your cooking photos from the past 3 years in the App, next to your saved and published recipes. You can see what you cooked this time in previous years, share the photo with family or friends on the chat and plan what to make this week!! <br><br>*Publish recipes*. Users can publish their own recipes on Cookpad.The recipes themselves don&apos;t need to be anything fancy, and that&#x2019;s another reason why Cookpad is unique. Recipes are published by real people cooking at home with clear steps and helpful photos.<br><br>*Private recipes*. Always have your recipes at hand. If you don&#x2019;t want to publish your recipes but do want to have them all in one place, that&#x2019;s fine. Just click save, but not publish. You&#x2019;ll be able to share with friends and family on the Cookpad chat. But other Cookpad users won&#x2019;t see them. <br><br>*Chat and share*. Cookpad takes the loneliness out  of cooking. You can share recipes, cooking moments, memories, photos, advice and questions in real time on Cookpad Chat. Chat one-to-one or create a group. Your private space to talk about cooking. <br><br>Cookpad is the World&apos;s largest homemade recipe-sharing app and is currently available in English, Espa&#xF1;ol, Indonesia, &#x627;&#x644;&#x639;&#x631;&#x628;&#x64A;&#x629;, Vi&#x1EC7;t Nam, &#xE44;&#xE17;&#xE22;. Choose your preferred language the first time you start the app. When you want to switch languages and explore homemade dishes from other countries, go to settings, log out, choose another language and repeat registration process. We have helped many people to live healthier and discover the taste of real food. Join us!<br><br>App Features:<br>- Publish and share recipes in public or private<br>- Search for recipes by title, ingredients, meal-type or other<br>- Share my recipe photo with the recipe author after preparing it<br>- Chat with family and friends about what&#x2019;s cooking or what to cook<br>- Have all my cooking photos in one place - cooking diary<br>- Timeline to see what my friends are cooking and sharing.<br>- Bookmark recipes for quick access. <br>- Find seasonal recipes for Halloween, Thanksgiving and Christmas dinners. <br>Contact us at help@cookpad.com",
    "histogram": {
        "1": 5228,
        "2": 2639,
        "3": 7854,
        "4": 22801,
        "5": 77190
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/_RH3ftKIOPi3OiZVG905zbb_hg3fMm4bzjAdUsAOW7nX_XFw2G0lgnyx9UqUzLmN5w=h310",
        "//lh3.googleusercontent.com/lPI9KDKca9UO_C6IQ05rm7eYxAN2Bl_1fCrhnG8guaU6AWsTGFS85NLluct-C4ET3V1q=h310",
        "//lh3.googleusercontent.com/NrAUS2H7cqnNw0_OTq2pVYIrI2vtm4OU8p-74A65Pa73vM-RxP-XAg3rUKM8x-fRGw=h310",
        "//lh3.googleusercontent.com/YOIWhR9unesa9iu2gy7FWxEGp8ZJqbYsQsf72LlNaH8eQqGyuyxvmDlWrRdtTTIfda9D=h310",
        "//lh3.googleusercontent.com/WdGSFkQroVFnrHlkhHV5GffwEul7dhbD8iAWxfr1jTwk2Z2zb4OAOM1t7U8K1_SVww=h310",
        "//lh3.googleusercontent.com/Lf732snMnz68FZDRYFrJtSGu57JdmS9DZttzs4dzOal6WRExfi4t1xt62Z9fDyCKAxUn=h310",
        "//lh3.googleusercontent.com/ZrkStWh7gLhd4Bl4erEHJN15Vd3bDBa6e32Yenh0TsZVZuBldGdO0OeOYH36kAU_QNE=h310",
        "//lh3.googleusercontent.com/xeNNgg26EjN5yxWFQwKoT9cGtcemzJwGvgiakiFn-ZI1NNOkoXlffFFia9AXuf0BBSI=h310"
    ],
    "comments": [
        "اعتمد عليه كثيراً",
        "كتيير حلو",
        "Great app for finding recipes!",
        "Love it. Gives you a lot of results and neat recipes",
        "The wife and I both love this app",
        "This app is such a hero 👩‍🍳"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mufumbo.android.recipe.search&hl=en&gl=us",
    "appId": "com.mufumbo.android.recipe.search"
}