{
    "title": "Viber Messenger",
    "summary": "Viber Messenger: Text Messages, Free Phone Calls, Live Video Chats and more!",
    "icon": "//lh3.googleusercontent.com/8WsuI2NpvYJljZshzCgLXKRLnFLzz3q4I3JGw3L0vfintPGEiTChOXDIrnoXFFfme58=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000000,
    "maxInstalls": 1000000000,
    "score": 4.3,
    "reviews": 10987101,
    "developer": "Viber Media S.à r.l.",
    "developerId": "7446565317689230946",
    "developerEmail": "support@viber.com",
    "developerWebsite": "http://www.viber.com/",
    "developerAddress": "Viber Media, S.à r.l.,\n2, rue des Fossé, L-1536 Luxembourg, Grand Duchy of Luxembourg.",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Viber Free Messenger and Phone Calls: Connecting millions worldwide! Write a text message, call, chat and share with anyone, anywhere!Viber is your go-to free messenger, allowing you to message or call anyone in the world through your Internet connection*. Send a text message to friends and family with Viber Messenger. Call your loved ones using Viber’s live video chat or voice call, all part of Viber’s free and high-quality phone calls. Express yourself with cool stickers and emoji icons, share photos, and send your favorite videos. The free messenger also lets you make international phone calls for free.Connect with friends and family using instant messaging, voice calls, or live video chatsChoose a contact from your phone book or simply enter a phone number to add a new contact on Viber messenger. Send a text message, or take advantage of the other amazing features that Viber offers beyond just free messages! Share photos and videos, enjoy emoji icons and cool stickers, record audio messages, and even send files.Group chat with up to 250 people!With Viber messenger, it’s easy to create and join group chats - with up to 250 people at once! Chat with your favorite people, ‘like’ any user’s voice, or text message.Why users worldwide are choosing Viber Free Messenger:★Hassle-free, long-distance calls- Viber Messenger is your free international calling app! No need for a username or login information, simply activate by entering your phone number.★ Voice or video - Make your free phone call now! - Choose between the basic voice call or go with our live video chat if you need a face-to-face! Whether you make a phone call domestically or have international calls to make, all phone calls boast HD quality sound.★ Instant video messages - Tap and hold the instant video icon to capture the moment with 30-second videos, release to send.★Secured communications - Viber messenger automatically encrypts text messages, video and voice calls, photos, videos, and group chats.★Express yourself with stickers - Bring your text message to life by sending playful emoji icons and cool stickers.★Your personal messenger with “damage control” - Delete a text message or voice message even after it was sent.★‘Hidden Chats’ feature - Choose to hide specific chats from your messaging screen and access them later.Install Viber Free Messenger Now - Start Connecting!Facebook - http://facebook.com/viberTwitter - http://twitter.com/viber(*) Wi-Fi or data plan - network data charges may apply.Viber is part of the Rakuten Group, a world leader in e-commerce and financial services.",
    "descriptionHTML": "<b>Viber Free Messenger and Phone Calls: Connecting millions worldwide! Write a text message, call, chat and share with anyone, anywhere!</b><br>Viber is your go-to free messenger, allowing you to message or call anyone in the world through your Internet connection*. Send a text message to friends and family with Viber Messenger. Call your loved ones using Viber&#x2019;s live video chat or voice call, all part of Viber&#x2019;s free and high-quality phone calls. Express yourself with cool stickers and emoji icons, share photos, and send your favorite videos. The free messenger also lets you make international phone calls for free.<br><b>Connect with friends and family using instant messaging, voice calls, or live video chats</b><br>Choose a contact from your phone book or simply enter a phone number to add a new contact on Viber messenger. Send a text message, or take advantage of the other amazing features that Viber offers beyond just free messages! Share photos and videos, enjoy emoji icons and cool stickers, record audio messages, and even send files.<br><b>Group chat with up to 250 people!</b><br>With Viber messenger, it&#x2019;s easy to create and join group chats - with up to 250 people at once! Chat with your favorite people, &#x2018;like&#x2019; any user&#x2019;s voice, or text message.<br><b>Why users worldwide are choosing Viber Free Messenger:</b><br><b>&#x2605;Hassle-free, long-distance calls</b>- Viber Messenger is your free international calling app! No need for a username or login information, simply activate by entering your phone number.<br><b>&#x2605; Voice or video - Make your free phone call now!</b> - Choose between the basic voice call or go with our live video chat if you need a face-to-face! Whether you make a phone call domestically or have international calls to make, all phone calls boast HD quality sound.<br><b>&#x2605; Instant video messages</b> - Tap and hold the instant video icon to capture the moment with 30-second videos, release to send.<br><b>&#x2605;Secured communications</b> - Viber messenger automatically encrypts text messages, video and voice calls, photos, videos, and group chats.<br><b>&#x2605;Express yourself with stickers</b> - Bring your text message to life by sending playful emoji icons and cool stickers.<br><b>&#x2605;Your personal messenger with &#x201C;damage control&#x201D;</b> - Delete a text message or voice message even after it was sent.<br><b>&#x2605;&#x2018;Hidden Chats&#x2019; feature</b> - Choose to hide specific chats from your messaging screen and access them later.<br><br><b>Install Viber Free Messenger Now - Start Connecting!</b><br>Facebook - http://facebook.com/viber<br>Twitter - http://twitter.com/viber<br><br><br>(*) Wi-Fi or data plan - network data charges may apply.<br><br><br>Viber is part of the Rakuten Group, a world leader in e-commerce and financial services.",
    "histogram": {
        "1": 700620,
        "2": 364692,
        "3": 805091,
        "4": 1790553,
        "5": 7326145
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/QZ2q8rTnCyB5J6aINQh-stDf2_FID8e0aPQwO6VmqD8pXPpOqMg5CkS55Mh-UjYoIpUE=h310",
        "//lh3.googleusercontent.com/KAT60bQzz4CzFm2znz_1_m-yDJweJyP1RaKdQCDmoOpr0nMzc9-6YVvlna3hRH5gtzI=h310",
        "//lh3.googleusercontent.com/XMV9-gkjZSdoDRgJX3brIrFkPz8DTGfx3AAbjmUaqsS6X874wMOkJsLvMqulfTVMDA=h310",
        "//lh3.googleusercontent.com/AL3Z3-bSVRdxPvweIi028YBVAuWVpVF4Rfe6Jbzn1gvGREj_Dxm5L3mGdmhsbnw-5EQ=h310",
        "//lh3.googleusercontent.com/_0Q-PwXKKtw8qlqW6Li7mMjG-8U0OmSnQHKTzJQf9uKIepgBGHY8ArpJmKnTT-4a8A=h310",
        "//lh3.googleusercontent.com/G6wMpigdrKdgaTapmjItk0OxQHnzXx3sK9R0L0PIfkW789hKklbQfiJd6-Rtd8gaqNdR=h310",
        "//lh3.googleusercontent.com/aDuaysk6suNJQlL7HhQ5AJt2BOc22e5krVmAP8XlZ_j0n-Qf8Vmu3rXIaQIZAepCqg=h310",
        "//lh3.googleusercontent.com/A93tHp20R934H3gB2cKrsSh7Kdsvxy3zsK86I6y7Wyb8FpLdDmXo9GABZY2gMcy9NgZS=h310",
        "//lh3.googleusercontent.com/PHF4xQNOglR9uxHbcIr44y-G6a-aWeIq8zWc9X_19izdp4gPjvpACMIpxUH-_7bSjfE=h310",
        "//lh3.googleusercontent.com/JfZWp9yj6XHi6XNwvvMu5FgcgyVZ2nND1saJ1TTMWgT-XEfq_broWjop8spbnXYLduw=h310",
        "//lh3.googleusercontent.com/1W6tob5Z1YOwdnZp2g_NB0TQLJGVj1wmUfyYGgE6HXHh-dorBLFX42oD6poo0dKrdw=h310",
        "//lh3.googleusercontent.com/3FaTy3hElC49Vdn6NXK3WUQa43npdNR34zfARBnQWHTVtKzSnxsXUtUxjSIcmuSjHA=h310",
        "//lh3.googleusercontent.com/a7M0CD8n6m42Z-sz3_oZc3kIVReuVYzTAkLHYdUITO7lNvmFARkAgTiK2LBBr3l-LHs=h310",
        "//lh3.googleusercontent.com/pn-qp-7hqLdWZSeS19D6JwizDmLrG5UPww_3wYl9w5sn2skQFuK1m_oAYfYMRvQkS00=h310",
        "//lh3.googleusercontent.com/DilkeIlptgZ87cWFGzXkn6BBRTmZhWQeoq4pkmQFGgu4s_sJ-f8S9eVwv1ysY93mTGo=h310",
        "//lh3.googleusercontent.com/FrOlxuTz9DRNMYzAFs3BA4JB2APzUOvsdiPVBsxlK7zkbwxbtE0_N6I6ei6cKb5vJQ=h310",
        "//lh3.googleusercontent.com/gQ6Df3z_LT3nSuM8urTYc56llqjCZCpVnHzA8wQRwsxuFjtPw34rrQWit2zys8ebWX8=h310",
        "//lh3.googleusercontent.com/gJMTX8i_a7i2qgehlxzNhrFZ7YjfYwpfAjKAxX2RoEQhOaobBOh43cm-uSKPClc2eog=h310"
    ],
    "comments": [
        "I came into contact with this app, over 5 years ago, from a close friend who's Australian. It was the best and cheapest form of communication to us and it worked effectively. Some time afterwards, I came off to use WhatsApp and that was it ever since then. However I have returned because I desire to be away from WhatsApp for good; too many distractions and nuisances.  I must say that Viber is even better than it was at last and I am really enjoying it. There are less folks here, that I know from my contact list who uses this and it's what the been looking for. The video calling could be better and the voice notes shouldn't be limited: that all that I have concerns with, but overall I'm rating it better than WhatsApp and that's according to my standards. It is really a good and stable app and the voice calls are much better than WhatsApp from my experience and in my books.   Kudos and thanks to the developers for such a great and stable app, that has been out for years and is still working towards improvements, for a better and more enjoyable experience. Keep at it, you've been doing well ever since!",
        "Viber backups text messages only. No photos, no media... So, after restoring from backup you have text messages only (hi, I'm sending you a great shot!) but photos are missing, only ugly black squares, broken thumbnails links, etc... a complete mess! WhatsApp makes FULL chat backup on GDrive from years! So, I'm disappointed, no more than 3 points...",
        "After a few years not using Viber, I'm back, and Viber is still as bad. Not enough emoji to use, can't search history in my conversation. This app is worst than whatsapp or wechat.",
        "After new update, version 8.3.0, battery vibrates on every received Viber message which cause my battery to drain very fast. Please fix the problem. HTC ONE M8",
        "why can't i disable vibration for messages? pls fix it. ps even after 2/3/18 update still vibration working. star rating decreased to 1",
        "After updating I can no longer use it on my tablet. It says I have to authenticate my android to use it. But it doesn't tell me how. Rhe app hangs and stays suspended."
    ],
    "recentChanges": [
        "Performance improvements and bug fixes to bring you the very best Viber experience"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.viber.voip&hl=en&gl=us",
    "appId": "com.viber.voip"
}