{
    "title": "Talon for Twitter",
    "summary": "Smooth, fast, powerful, custom. An ad-free Twitter like never before.",
    "icon": "//lh3.googleusercontent.com/x_cQuFmFKZvTWxQjBOZoyDDVeQVqs9tduHdxanOYyW0yajwS8MEx5ery4g_YmKpSge4=w300",
    "price": "$2.99",
    "free": false,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.6,
    "reviews": 15544,
    "developer": "Luke Klinker",
    "developerId": "6337185423976596164",
    "developerEmail": "luke@klinkerapps.com",
    "developerWebsite": "http://www.klinkerapps.com",
    "developerAddress": "1218 NE 49th St\nAnkeny, IA 50021",
    "updated": "March 1, 2018",
    "version": "7.1.1",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Created with Material Design at its core, Talon for Twitter includes stunning layouts, eye catching animations, and that buttery smoothness you should expect from the latest and greatest apps. On top of that, Talon takes the ads out of Twitter so that you can focus on the content!Talon gives you everything you could ever need to experience Twitter. Oh, and did I mention: it is the highest rated Twitter app on the Play Store! Here's what makes it so special:Custom•  Materialized theme engine for fine-grained color control.•  Completely custom swipe-able pages for the main screen. Want a list or saved search for easy access? No problem! Don't use direct messages? Go ahead and take them out. Choose what you want to see and where you want to see it.•  Night Mode and Do Not Disturb Mode.•  Compact Timeline Layout option to get the most out of your screen space.Dynamic•  Follow threads and view replies to any tweet!•  Have favorite users? See only their tweets or have options to get notified whenever they post a new tweet!•  Powerful mute options for users, retweets, hashtags, Twitter clients, and expressions.•  Support for 2 accounts.•  Easily see who has quoted, liked, or retweeted any tweet!•  Use TweetMarker to keep your timeline position between multiple devices!Media Ready•  Use our awesome readability-style browser for the best web experience of any app.•  Play Twitter videos and GIFs without leaving your timeline!•  Search for the perfect GIF from Giphy.•  Crop, rotate, and zoom to get the perfect photo before you post it!•  Native YouTube, Twitter GIF, and Twitter video playback.Powerfully Quick and Integrated•  Advanced - and unique - tweet filtering on profiles, so you can choose what type of tweets you want to see, from that user!•  Android Wear app to view, like, retweet, and reply to new tweets on your timeline, without having to take out your phone.•  Widgets to view the home timeline, mentions, and unread counts.All this, plus so much more. This is Twitter and Material Design like you've never seen. Bold and beautiful. All material, all speed.Try it today! I am sure you will never go back.Feel free to reach out with any questions or concerns - I am @lukeklinker on Twitter, and love to hear from my users!",
    "descriptionHTML": "Created with <i>Material Design</i> at its core, <i>Talon for Twitter</i> includes stunning layouts, eye catching animations, and that buttery smoothness you should expect from the latest and greatest apps. On top of that, <b>Talon takes the ads out of Twitter</b> so that you can focus on the content!<br><br><i>Talon</i> gives you everything you could ever need to experience <i>Twitter</i>. Oh, and did I mention: it is the highest rated <i>Twitter</i> app on the Play Store! Here&apos;s what makes it so special:<br><br><br><b>Custom</b><br>&#x2022;&#x2003; <i>Materialized</i> theme engine for fine-grained color control.<br>&#x2022;&#x2003; Completely custom swipe-able pages for the main screen. Want a list or saved search for easy access? No problem! Don&apos;t use direct messages? Go ahead and take them out. Choose what you want to see and where you want to see it.<br>&#x2022;&#x2003; <i>Night Mode</i> and <i>Do Not Disturb Mode</i>.<br>&#x2022;&#x2003; <i>Compact Timeline Layout</i> option to get the most out of your screen space.<br><br><br><b>Dynamic</b><br>&#x2022;&#x2003; Follow threads and view replies to any tweet!<br>&#x2022;&#x2003; Have favorite users? See only their tweets or have options to get notified whenever they post a new tweet!<br>&#x2022;&#x2003; Powerful mute options for users, retweets, hashtags, <i>Twitter</i> clients, and expressions.<br>&#x2022;&#x2003; Support for 2 accounts.<br>&#x2022;&#x2003; Easily see who has quoted, liked, or retweeted any tweet!<br>&#x2022;&#x2003; Use <i>TweetMarker</i> to keep your timeline position between multiple devices!<br><br><br><b>Media Ready</b><br>&#x2022;&#x2003; Use our awesome readability-style browser for the best web experience of any app.<br>&#x2022;&#x2003; Play <i>Twitter</i> videos and GIFs without leaving your timeline!<br>&#x2022;&#x2003; Search for the perfect GIF from <i>Giphy</i>.<br>&#x2022;&#x2003; Crop, rotate, and zoom to get the perfect photo before you post it!<br>&#x2022;&#x2003; Native <i>YouTube</i>, <i>Twitter</i> GIF, and <i>Twitter</i> video playback.<br><br><br><b>Powerfully Quick and Integrated</b><br>&#x2022;&#x2003; Advanced - and <i>unique</i> - tweet filtering on profiles, so you can choose what type of tweets you want to see, from that user!<br>&#x2022;&#x2003; <i>Android Wear</i> app to view, like, retweet, and reply to new tweets on your timeline, without having to take out your phone.<br>&#x2022;&#x2003; Widgets to view the home timeline, mentions, and unread counts.<br><br><br>All this, plus so much more. This is <i>Twitter</i> and <i>Material Design</i> like you&apos;ve never seen. Bold and beautiful. All material, all speed.<br><br>Try it today! I am sure you will never go back.<br><br><br><br>Feel free to reach out with any questions or concerns - I am @lukeklinker on Twitter, and love to hear from my users!",
    "histogram": {
        "1": 324,
        "2": 315,
        "3": 669,
        "4": 2850,
        "5": 11386
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/K9kQYgjV23KURsOJzhZEtVf4t4Zfq5I_utYlUIifNJ992XMAeP3-TmckLlBzJ2Nd-g=h310",
        "//lh3.googleusercontent.com/gPgar7VZQ-FpgeUZ1er2pPLgaP0Cm80IUQN9QiWTt-uecOW2671e5IsXyuYV4VxF5fo=h310",
        "//lh3.googleusercontent.com/CyzWNDBe1zvV71pyh30ni4__qCEu5Vw_ELyCWNJEgrzGHbv-6EQSZiYH3PC8HwNwv3A=h310",
        "//lh3.googleusercontent.com/ZXLcX9ATjEZfAv0SnlVmIRFmYodCZlwRK38XxstJhDjuZRkEiV1qA817utrkP8-Bsg=h310",
        "//lh3.googleusercontent.com/9qW_TRjo-VYvHBSa9kcIsKNAxzmu0lhFPLAzC0HmzSjfAWeZagj2DpmLTBSN-gqbn24=h310",
        "//lh3.googleusercontent.com/Mq94g_LtgDxVBd-zqCyLf6HtGssT4izj_T64H24VR4dr_dJHMMBnGIe2k1PzW4Qa2A=h310",
        "//lh3.googleusercontent.com/JHmikqfmtMuv2QizqecMpEfVSOar9xHZlyOUK9qtsWCaZgW6sNmcXOUYf-eId0l_QUnN=h310",
        "//lh3.googleusercontent.com/BhI63ejGLJYmF3H5FMzJ4F1_eIXbimFhXOHv0L1Vdryojhr1isc3JX8w1cguwai3RvY=h310",
        "//lh3.googleusercontent.com/ItH2oeIyfHTLgBPH5GyDNEO6YWr7TcLbVP3nUG2ZHOZAaiZ3eLzqnySG4ldBjhH5JDc=h310",
        "//lh3.googleusercontent.com/AKro68HGi9XtrfIGKodcStmLdnMTfaYuNMA5AfMdEsNsbPml0iComQ_FR6GgNHVkx30=h310",
        "//lh3.googleusercontent.com/40phTY3jJL2e3kh62WU8HAUiEvXoDtAk-48LPiOWtskCfNiqvkLF8yGPRKQ8GV2IaYQ=h310",
        "//lh3.googleusercontent.com/ecVHwMIjTPQ-jkARVLQnYGZo-Z9NumR-OmW13ToAzQYQhVfn0vA9I0hqT9dnnhIzRi0=h310",
        "//lh3.googleusercontent.com/q7O2Dc0GL_mp4QTuzxKD9FCI64sDodGWF_M30YWOc17uSDHbGUmVzzuyBPrjpXzIxD4i=h310",
        "//lh3.googleusercontent.com/j4idc00FYzs1tOHuozDgsf6OGGZsNAPRpogZo1pWgp8li-omL2uWlj2pYh--5M6z0w=h310",
        "//lh3.googleusercontent.com/kLTa_AW8aEzefbWVnZUgCw0oJi0wla0FaqtHYVCirZyb1NxYB5oIabSmW6uk7TQK5HM=h310",
        "//lh3.googleusercontent.com/QgS96MM_MbeCaGud7jihYt7MgKS2-Khv0_iK4bBI_FoF2P91C_m70LSlxjmpF6oDJA=h310",
        "//lh3.googleusercontent.com/P_EV9yUERiScToC9zr0knqTH5jCk1aiW6AtwVUgkKX80rdVmg8HsHI2Ssv1Zsr9iUKM=h310"
    ],
    "comments": [
        "Good app, but be very careful and monitor your data usage. This app drains data like mad if you let it run in the background. Ran it side-by-side with the official Twitter app and the results were shocking. Would have gotten more stars otherwise...",
        "The ability to like a Tweet from both my accounts with one tap has been removed. Why.",
        "Favorite Twitter app.",
        "Hey Luke. Just bought this yesterday. Things I love: Save Tweets for Later, Internal seamless browser.  Things I don't like: Doesn't show vote/polls, Don't know why but don't come across highly retweeted tweets anymore. Is it because of the order in which it appears?  Suggestions: Please make the verified tick prominent and visible without having to click on the profile to check it.",
        "Seems to be getting slower with each update. I quite often have to manual sync because auto sync doesn't work. Going to links in tweets is very slow no matter if I use internal or external browser.",
        "Nice design.  Still figuring it out.  Only complaint is that it is a bit slow to transfer the latest tweets."
    ],
    "recentChanges": [
        "This update adds a new feature: you can now save tweets for later, within Talon!",
        "Don't want to publicly like a tweet, but you want to remember to come back to it later? Save any tweet by opening that tweet and hitting the three dot overflow menu. To view those saved tweets, you can add the \"Saved Tweets\" swipable page through Talon's settings menu."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.klinker.android.twitter_l&hl=en&gl=us",
    "appId": "com.klinker.android.twitter_l"
}