{
    "title": "Citymapper - Transit Navigation",
    "summary": "&quot;The single best app for finding your way in the city&quot; The New York Times",
    "icon": "//lh6.ggpht.com/Imb9kzIzJPanYvoMhRzT04AemnqlYzS2RmU4rHX-Hoy3WONLzRhUo3j9bIJJi1N7we8F=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 62050,
    "developer": "Citymapper Limited",
    "developerId": "7691438629453514158",
    "developerEmail": "support@citymapper.com",
    "developerWebsite": "http://citymapper.com",
    "updated": "March 1, 2018",
    "version": "Varies with device",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "size": "Varies with device",
    "description": "★ EDITORS’ CHOICE ★ Citymapper is the ultimate transit app, making cities easier to use!+ Check nearby departures in real-time+ Find the fastest route combining bus, subway, train, ferry, taxi, car share, bike share and walk+ Follow step by step directions, including the best subway exit to reach the platform+ Receive alerts when your favourite lines are disrupted ★ \"Citymapper is, quite simply, the best travel app\" - New York Times★ Nominated for Best App 2017 - Google Play Awards★ #1 Grand Prize Winner - MTA New York App Quest★ Grand Prix Award - TechCrunch THE SMART TRIP PLANNERFIND THE BEST ROUTE - Our trip planner combines all transport modes in your city to find the fastest route: bus, subway, train, ferry, cab (Uber, Lyft, taxi), car share, bike share and walk. REAL TIME DEPARTURES - Live bus and train times for MTA, NJ Transit, LIRR, Metro North, SF BART, MUNI, Caltrain, Chicago CTA, Boston MBTA, and more. ALERTS - Be notified of delays and disruptions for your favorite lines of the NYC subway, LRR, Washington Metro, Chicago L, MBTA subway, BART, Metra. STEP-BY-STEP DIRECTIONS - Follow your trip in real-time with step-by-step directions, including live bus times and an alarm when it's time to get off the bus. OFFLINE MAPS - Official NYC subway map, Manhattan bus map, Brooklyn bus map, Queens bus map, DC metro map, Muni Metro map and more. MULTIMODAL - Combine cab with transit to create new routes you never knew existed.  + Real-time bike share availability for Citi Bike, Bay Area Bike Share, Divvy, Hubway, CaBi, Breeze, Metro Bike Share, Indego+ Real-time car share availability with Car2go in NYC, DC and Seattle+ Get directed to the best pick up spots for your cab Uber or Lyft+ Bus tracker for MTA, MBTA and more.+ Includes NYC transit fares and SF transit fares  CITIESUS: NYC, Chicago, SF Bay Area, Washington DC / Baltimore, Los Angeles, Philadelphia, Boston, SeattleCanada: Toronto, Montreal, VancouverLatin America: Mexico City, São PauloEurope: London, Manchester, Birmingham, Paris, Lyon, Berlin, Cologne, Düsseldorf, Hamburg, Brussels, Amsterdam, Randstad, Copenhagen, Stockholm, Madrid, Barcelona, Milan, Rome, Lisbon, St Petersburg, Moscow, IstanbulAsia: Hong Kong, Singapore, Seoul, TokyoAustralia: Sydney, MelbourneVote for more at https://citymapper.com/cities  TRANSIT AGENCIESNew York City: Subway (MTA), LIRR, Metro North, NJ Transit, PATH, Bee Line, NICE, CTtransit, NY Waterway, Citi BikesJersey City, Long Island, Newark, Hoboken, Stamford, New Haven, Connecticut, New Jersey SF Bay Area: SFMTA, MUNI, BART, CalTrain, VTA, AC Transit, Golden Gate Bus, Marin Transit, Santa Cruz METRO, Stanford Marguerite Shuttle, SamTrans, Santa Rosa CityBus, Soltrans, Sonoma County Transit, Tri Delta Transit, Vine Transit, WestCAT, Bay Area Bike ShareSan Francisco, San Jose, Oakland, Fremont, Berkeley, Sunnyvale Boston: MBTA, MASSDOT, HubwayCambridge Washington DC / Baltimore: WMATA, MARC Train, Annapolis Transit, CMRT, DASH, Fairfax Connector, PRTC, Ride On, CaBiArlington, Alexandria, Maryland, Virginia Chicago: L, CTA, METRA, Pace, RTA, DivvyAurora Seattle King County Metro Transit, Sound Transit, Pierce TransitBellevue, Olympia, Redmond, Tacoma Philadelphia: SEPTA, PATCO, IndegoAtlantic City, Princeton, Trenton Los Angeles: Metrorail, Metrobus, Metrolink, Big Blue Bus, DASH, LADOT, Foothill Transit, Gold Coast Transit, ART, Long Beach Transit, OCTA, Omnitrans, RTA, Breeze, Metro Bike ShareLong Beach, Orange County, Santa Monica, Venice  KEEP IN TOUCHIf you have questions, feedback or something we may have missed in your city, please email us at support@citymapper.com. + Facebook+ Twitter+ Google Plus",
    "descriptionHTML": "<b>&#x2605; EDITORS&#x2019; CHOICE &#x2605;</b><br> <br>Citymapper is the ultimate transit app, making cities easier to use!<br>+ Check nearby departures in real-time<br>+ Find the fastest route combining bus, subway, train, ferry, taxi, car share, bike share and walk<br>+ Follow step by step directions, including the best subway exit to reach the platform<br>+ Receive alerts when your favourite lines are disrupted<br> <br>&#x2605; &quot;Citymapper is, quite simply, the best travel app&quot; - New York Times<br>&#x2605; Nominated for Best App 2017 - Google Play Awards<br>&#x2605; #1 Grand Prize Winner - MTA New York App Quest<br>&#x2605; Grand Prix Award - TechCrunch<br> <br><b>THE SMART TRIP PLANNER</b><br>FIND THE BEST ROUTE - Our trip planner combines all transport modes in your city to find the fastest route: bus, subway, train, ferry, cab (Uber, Lyft, taxi), car share, bike share and walk.<br> <br>REAL TIME DEPARTURES - Live bus and train times for MTA, NJ Transit, LIRR, Metro North, SF BART, MUNI, Caltrain, Chicago CTA, Boston MBTA, and more.<br> <br>ALERTS - Be notified of delays and disruptions for your favorite lines of the NYC subway, LRR, Washington Metro, Chicago L, MBTA subway, BART, Metra.<br> <br>STEP-BY-STEP DIRECTIONS - Follow your trip in real-time with step-by-step directions, including live bus times and an alarm when it&apos;s time to get off the bus.<br> <br>OFFLINE MAPS - Official NYC subway map, Manhattan bus map, Brooklyn bus map, Queens bus map, DC metro map, Muni Metro map and more.<br> <br>MULTIMODAL - Combine cab with transit to create new routes you never knew existed. <br> <br>+ Real-time bike share availability for Citi Bike, Bay Area Bike Share, Divvy, Hubway, CaBi, Breeze, Metro Bike Share, Indego<br>+ Real-time car share availability with Car2go in NYC, DC and Seattle<br>+ Get directed to the best pick up spots for your cab Uber or Lyft<br>+ Bus tracker for MTA, MBTA and more.<br>+ Includes NYC transit fares and SF transit fares<br> <br> <br><b>CITIES</b><br>US: NYC, Chicago, SF Bay Area, Washington DC / Baltimore, Los Angeles, Philadelphia, Boston, Seattle<br>Canada: Toronto, Montreal, Vancouver<br>Latin America: Mexico City, S&#xE3;o Paulo<br>Europe: London, Manchester, Birmingham, Paris, Lyon, Berlin, Cologne, D&#xFC;sseldorf, Hamburg, Brussels, Amsterdam, Randstad, Copenhagen, Stockholm, Madrid, Barcelona, Milan, Rome, Lisbon, St Petersburg, Moscow, Istanbul<br>Asia: Hong Kong, Singapore, Seoul, Tokyo<br>Australia: Sydney, Melbourne<br>Vote for more at https://citymapper.com/cities<br> <br> <br><b>TRANSIT AGENCIES</b><br><b>New York City:</b> <a href=\"https://www.google.com/url?q=http://www.google.com/url?q%3Dhttp%253A%252F%252Fwww.mta.info%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNEWeRZkKYqseEaLR1qRPW_k7-LrFg&amp;sa=D&amp;usg=AFQjCNF7bXrFPFgFkZLjmlLxVESjUl-FUg\" target=\"_blank\">Subway (MTA)</a>, LIRR, Metro North, NJ Transit, PATH, Bee Line, NICE, CTtransit, NY Waterway, Citi Bikes<br>Jersey City, Long Island, Newark, Hoboken, Stamford, New Haven, Connecticut, New Jersey<br> <br><b>SF Bay Area:</b> SFMTA, MUNI, BART, CalTrain, VTA, AC Transit, Golden Gate Bus, Marin Transit, Santa Cruz METRO, Stanford Marguerite Shuttle, SamTrans, Santa Rosa CityBus, Soltrans, Sonoma County Transit, Tri Delta Transit, Vine Transit, WestCAT, Bay Area Bike Share<br>San Francisco, San Jose, Oakland, Fremont, Berkeley, Sunnyvale<br> <br><b>Boston:</b> MBTA, MASSDOT, Hubway<br>Cambridge<br> <br><b>Washington DC / Baltimore:</b> WMATA, MARC Train, Annapolis Transit, CMRT, DASH, Fairfax Connector, PRTC, Ride On, CaBi<br>Arlington, Alexandria, Maryland, Virginia<br> <br><b>Chicago:</b> L, CTA, METRA, Pace, RTA, Divvy<br>Aurora<br> <br><b>Seattle</b> King County Metro Transit, Sound Transit, Pierce Transit<br>Bellevue, Olympia, Redmond, Tacoma<br> <br><b>Philadelphia:</b> SEPTA, PATCO, Indego<br>Atlantic City, Princeton, Trenton<br> <br><b>Los Angeles:</b> Metrorail, Metrobus, Metrolink, Big Blue Bus, DASH, LADOT, Foothill Transit, Gold Coast Transit, ART, Long Beach Transit, OCTA, Omnitrans, RTA, Breeze, Metro Bike Share<br>Long Beach, Orange County, Santa Monica, Venice<br> <br> <br><b>KEEP IN TOUCH</b><br>If you have questions, feedback or something we may have missed in your city, please email us at support@citymapper.com.<br> <br>+ <a href=\"https://www.google.com/url?q=http://www.google.com/url?q%3Dhttp%253A%252F%252Ffacebook.com%252Fthecitymapper%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNHb83o-SavI2ArOpsxzGKL4JwZXxg&amp;sa=D&amp;usg=AFQjCNGoVJ0JXGeC1-MWv7Pzc108Ph4A0A\" target=\"_blank\">Facebook</a><br>+ <a href=\"https://www.google.com/url?q=http://www.google.com/url?q%3Dhttp%253A%252F%252Ftwitter.com%252FCitymapper%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNGH1PFm-TxgEQZxJTdK2r6C45d__A&amp;sa=D&amp;usg=AFQjCNEH5dNFlmubepWTJHCrCdngQMM1dw\" target=\"_blank\">Twitter</a><br>+ <a href=\"https://www.google.com/url?q=http://google.com/%2BCitymapper&amp;sa=D&amp;usg=AFQjCNGK6oC_yqqb8j3TAuMWBIgMDa4s-g\" target=\"_blank\">Google Plus</a>",
    "histogram": {
        "1": 2669,
        "2": 1352,
        "3": 2602,
        "4": 8980,
        "5": 46447
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/wsxQ7JuYbJnAVXURfpUh4U0U2w58KqljtOBV5j-fZa2FaleRflnykoe5wHS-94Wz0A=h310",
        "//lh3.googleusercontent.com/6tIzn4jpn_lhdn4qKuiWjGTiIQKujBKAfpqwqsf7srVcpJvwgjORHIWIjO3gutXMGw=h310",
        "//lh3.googleusercontent.com/OhGDdL_CQvwC3o4Lm6Jw2pVSuRBRR6q2QDdgcf3Q-uDuHhVWgdZG-Lsrl7uPVtHUqQ=h310",
        "//lh3.googleusercontent.com/nByZT5zsZ0HZMVZoiwOz1KLg6_CtoHiS3BFBGYRmpshmQplfJTblC183FiBkrXK5i8OQ=h310",
        "//lh3.googleusercontent.com/6I2yorpNVPUrO51iNBNbESEBwrAdgOoIaewRzGmiAuJTvJ4pwEXs1sDspQ-OI4og54g=h310",
        "//lh3.googleusercontent.com/R0A1Z9bExJHnDKN8O3YsXiq1IMM6JOJEoWyVQjbiaCihTVXg1kpHYJZYrx26xaFoZw4=h310",
        "//lh3.googleusercontent.com/8Wab7VpFEN9Z5IG3L_TYX_5DAEnQ5W-qDHXpuTXc5UEF5ogmx7bjDq2OmAIDKupJm9k=h310",
        "//lh3.googleusercontent.com/4729cVpi2Io6jNJyaRR4fp7KA_HP124Bokzl_Kmm3QI0yKNNnybnsC-aoDKzr63REn5W=h310",
        "//lh3.googleusercontent.com/szLAilP3tyrcK-BimI0fYbH6Q7wkzyxsV4m_d1MpBnIuaEMFOSYgBtTJjPwD1uDvVSo=h310"
    ],
    "comments": [
        "Tube guides brilliant 10/10. My issues with it were, id plan a journey (kings x to adelphi say) it gave me tube lines,direction,stops etc... but.. when i exit the tube it doesnt the tell me on the walk to bit, which direction to walk and i ended up the wrong way :-( was hoping it would be a bit more sat nav style for the actual walking app.",
        "Amazing App! Last weekendI was in Berlin for the first time and this app really helped me with the different kinds of transportations and finding the places I wanted to go to! Saved me from potentially getting lost... XD I really can recommend this app to get around (in bigger cities)!",
        "Amazing. Sent from heaven... 😂 This app should be a must for any city tourism department to push to their visitors! I have been in Lisbon now for three months - and managed my way around the public transport with the weirdest and worst tools imaginable! This app solved all my problems and brings lots od unexpected extras - love it! The only complaint i have is that it took me so long to find it... 😂",
        "[edit] It could use a button for \"I've arrived\". Many times I have to close the app without the ticket because it won't accept that I have already arrived.   Very good app to help with public transport (better than the one my city provides lol).",
        "You're beginning to complicate too much. Don't forget what is primary purpose of your app. Keep simple.",
        "Just about the best, most comprehensive, app of this nature I have come across so far. Highly recommended."
    ],
    "recentChanges": [
        "This update brings improvements to future trip planning—soon you'll see better departure times in future trips.",
        "Meanwhile, in London we've launched Citymapper SMART RIDE, a new way to get around town, now available in the app."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.citymapper.app.release&hl=en&gl=us",
    "appId": "com.citymapper.app.release"
}