{
    "title": "OneNote",
    "summary": "Microsoft OneNote is your notebook for capturing what&#39;s important in your life",
    "icon": "//lh3.googleusercontent.com/JYk-zTlx8PYPNaoV4wx3Z5JlkrleNKU57S_ho-bQcQi8tdAVQzk4fufcPobAOsMRo9c=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.3,
    "reviews": 419803,
    "developer": "Microsoft Corporation",
    "developerId": "6720847872553662727",
    "developerEmail": "omaonfb@microsoft.com",
    "developerWebsite": "http://www.onenote.com",
    "developerAddress": "One Microsoft Way",
    "updated": "February 26, 2018",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "CREATE YOUR WAYType, hand write, draw, and clip things from the web to get down your thoughts into your notebook. Use OneNote's flexible canvas to place content anywhere you want. You can even scan hand written notes or pages straight into OneNote then make them searchable.  GET ORGANIZEDOneNote is set up like a notebook to bring the familiar physical 3-ring binder to the digital era. Easily use sections and pages to separate out thoughts by theme at school, home or work. Not sure where you categorized something? Use our powerful search to look across all of your notebooks or just the page you're on to find what you're looking for, even words on pages you scanned into your notes. You can use tags to label to-do lists, follow up items, mark what's important or make custom labels. Use OneNote as a notebook, journal or a notepad. Organize in one place, from anyplace.   COLLABORATE WITH ANYONEShare your notebook with whomever you want, such as your colleagues or family, and work on your projects together. OneNote syncs your notes across all devices and lets multiple people work on the content together, at the same time. Leave comments or tags to people to ask follow up questions, draw up your ideas, plan and journal the family vacation or check off the to-do list.  ACCOMPLISH MORE AT WORKOneNote is great on your own or when you share with a team. Use it as a notepad for team meetings, brainstorming projects, draw attention to important points or organize key resources to never lose track of what you need. Work together in real time to stay in sync and on the same page. You can log in with 2 accounts at the same time to seamlessly move from work to personal and back. OneNote is available across your favorite devices, no matter what your team likes to use --Android, Apple or Windows-- you can still work together to get more done.   ACHIEVE MORE IN SCHOOLOneNote is great for school for both students and teachers. Take your notes during class with ease, mixing in text, ink, and web clippings. Use OneNote to organize your brainstorms, draw mind maps and develop your ideas for your next school assignment. As a teacher, plan your lessons and have all the information you need right in your pocket and on the go.   BETTER TOGETHER WITH OFFICEOneNote is part of the Office family and works great with your favorite apps, such as Excel or Word to help you do more.   NOTES AT THE SPEED OF LIGHTUse the OneNote badge as a notepad to list your thoughts down no matter when something crosses your mind. The badge hovers on screen and lets you quickly write your thoughts down during a phone call, while on the web or wherever else your mind takes you. In addition to the badge you can launch OneNote from a home screen widget or pin a notebook or page straight to the home screen helping you dive in faster, right where you want.  You can find answers to Frequently Asked Questions about OneNote for Android at http://aka.ms/OnenoteAndroidFAQ  Requirements:  • Requires Android OS 4.1 or later.  • A free Microsoft account is required to use OneNote.  • OneNote opens existing notebooks created in Microsoft OneNote 2010 format or later. • To sync your notes to OneDrive for Business, sign in with your organization's Office 365 or SharePoint account. Like us on Facebook, follow us on Twitter, or visit the blog for the latest news:  http://facebook.com/MicrosoftOneNote https://twitter.com/msonenote https://plus.google.com/102199506601015331367/ http://blogs.office.com/b/microsoft-onenote http://OneNote.com https://plus.google.com/communities/113633281646135322395/ ",
    "descriptionHTML": "CREATE YOUR WAY<br>Type, hand write, draw, and clip things from the web to get down your thoughts into your notebook. Use OneNote&apos;s flexible canvas to place content anywhere you want. You can even scan hand written notes or pages straight into OneNote then make them searchable. <br> <br>GET ORGANIZED<br>OneNote is set up like a notebook to bring the familiar physical 3-ring binder to the digital era. Easily use sections and pages to separate out thoughts by theme at school, home or work. Not sure where you categorized something? Use our powerful search to look across all of your notebooks or just the page you&apos;re on to find what you&apos;re looking for, even words on pages you scanned into your notes. You can use tags to label to-do lists, follow up items, mark what&apos;s important or make custom labels. Use OneNote as a notebook, journal or a notepad. Organize in one place, from anyplace.  <br> <br>COLLABORATE WITH ANYONE<br>Share your notebook with whomever you want, such as your colleagues or family, and work on your projects together. OneNote syncs your notes across all devices and lets multiple people work on the content together, at the same time. Leave comments or tags to people to ask follow up questions, draw up your ideas, plan and journal the family vacation or check off the to-do list. <br> <br>ACCOMPLISH MORE AT WORK<br>OneNote is great on your own or when you share with a team. Use it as a notepad for team meetings, brainstorming projects, draw attention to important points or organize key resources to never lose track of what you need. Work together in real time to stay in sync and on the same page. You can log in with 2 accounts at the same time to seamlessly move from work to personal and back. OneNote is available across your favorite devices, no matter what your team likes to use --Android, Apple or Windows-- you can still work together to get more done.  <br> <br>ACHIEVE MORE IN SCHOOL<br>OneNote is great for school for both students and teachers. Take your notes during class with ease, mixing in text, ink, and web clippings. Use OneNote to organize your brainstorms, draw mind maps and develop your ideas for your next school assignment. As a teacher, plan your lessons and have all the information you need right in your pocket and on the go.  <br> <br>BETTER TOGETHER WITH OFFICE<br>OneNote is part of the Office family and works great with your favorite apps, such as Excel or Word to help you do more.  <br> <br>NOTES AT THE SPEED OF LIGHT<br>Use the OneNote badge as a notepad to list your thoughts down no matter when something crosses your mind. The badge hovers on screen and lets you quickly write your thoughts down during a phone call, while on the web or wherever else your mind takes you. In addition to the badge you can launch OneNote from a home screen widget or pin a notebook or page straight to the home screen helping you dive in faster, right where you want.  <br><br>You can find answers to Frequently Asked Questions about OneNote for Android at http://aka.ms/OnenoteAndroidFAQ&#xA0;&#xA0;<br><br>Requirements:&#xA0;&#xA0;<br>&#x2022; Requires Android OS 4.1 or later.&#xA0;&#xA0;<br>&#x2022; A free Microsoft account is required to use OneNote.&#xA0;&#xA0;<br>&#x2022; OneNote opens existing notebooks created in Microsoft OneNote 2010 format or later.&#xA0;<br>&#x2022; To sync your notes to OneDrive for Business, sign in with your organization&apos;s Office 365 or SharePoint account.&#xA0;<br>Like us on Facebook, follow us on Twitter, or visit the blog for the latest news:&#xA0;&#xA0;<br>http://facebook.com/MicrosoftOneNote&#xA0;<br>https://twitter.com/msonenote&#xA0;<br>https://plus.google.com/102199506601015331367/&#xA0;<br>http://blogs.office.com/b/microsoft-onenote&#xA0;<br>http://OneNote.com&#xA0;<br>https://plus.google.com/communities/113633281646135322395/&#xA0;",
    "histogram": {
        "1": 23797,
        "2": 11387,
        "3": 27578,
        "4": 89343,
        "5": 267698
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/hNRjIAP0CLJkQsdXR_5dQpfmhSsWAyPwJn-NDO6TxrGz8nqVWeGTkcD7jFGxa9gkmZU=h310",
        "//lh3.googleusercontent.com/Rv7Lc7kDqOju2OelZIdLYW-Tt4GpfEsgpOPmYC7Xv94lZA8LBOAjCNC0zJsnfb8FYTNU=h310",
        "//lh3.googleusercontent.com/bsQ_we6V3NZjYvucDe_yfJuhLetsNY0oKbRTB8wBVUx7u7tV59lNtlJoXF9xSTr-NuY=h310",
        "//lh3.googleusercontent.com/oikAeU72T4D_8H16UGK24Qlwl_4JnMZRtcSyeMFHKV8d6l1KE2qFQKJD0m2frH5BWT4=h310",
        "//lh3.googleusercontent.com/hBp865282Nt0f9xlPjdWSX8eXKnKOgGjeMVbAYyc5KHV3lNljKWRr41SBDXm7vriJRg=h310",
        "//lh3.googleusercontent.com/p5gZ4SkB3cbRt5LIvzTGwWsdO8Uq6SShUkPcApOuxGwACncsciqvxzwYfqgWOGaSAPk=h310",
        "//lh3.googleusercontent.com/exFLDZwl4-KB4iL0-eI6qAbdG0sQCFBYc-H277MHhnD97DrmAMU_0gma_okD-ibxxow=h310",
        "//lh3.googleusercontent.com/7ohGx530H1HM3_1LPedLbKeASrj5H2SwePdNKjqd0Jo9a5zVydO1Z3k1NDpZK87UMQ4=h310",
        "//lh3.googleusercontent.com/dy4aKr9L9E3zkcRmM05iBdGErU6zSqGTOky2Jx9bmKHTqvsxZFhPIAC1hwqZH19wykiv=h310",
        "//lh3.googleusercontent.com/F7UV98skhbFXLE-EZ1_XRaKxAIb7ARQ3P2UinU8CQZe2HFSuNVzwpqPbxJ3MLTPWuf4=h310",
        "//lh3.googleusercontent.com/2z-PpKiO79yFdrWSOQO81FVYP6RozKcSaKqM-hGu37SIezi8L4sALbU3bh_ukpMkk6I=h310",
        "//lh3.googleusercontent.com/MQtRcL4C30F0lmYINAgLbK6YzgUHgHDk5Qirr1wKJ77RVMuWKpYnmzCLrQRupkajhw=h310",
        "//lh3.googleusercontent.com/f6hKLrrhLub0BAlGENczfopc1LEBdSsd1wckxb_SIfKY3GGM_scj_3WcQaWcmxeDAmE=h310",
        "//lh3.googleusercontent.com/_uDIbA5vNzHpBbzflbjOS8MTTbIzmfsqktT3IeoBE8T7i_tOU7uOqVWGmekCsljKGcs=h310",
        "//lh3.googleusercontent.com/KsCx4ahbwBlGZ2DlGGHkYk-yfWIJ-30NciCYByeZ6A5VLrjOd3LcjFJLBKK3L9r35o8=h310"
    ],
    "comments": [
        "This is what I needed in a long time! This helps me with my homework! For example if my dad is using computer, OneNote is here to help! I can sit and do my work on my phone and then when the computer is free I can print off the same work that I have done! But one thing that I think you should improve is to add more editing details for example a letter size or font of it on the phones please!!! Thank you for the work that you are doing! I really appropriate it!",
        "The newest update makes it impossible to type on my phone without the app returning my cursor to the top of a paragraph. Pressing the backspace key deletes entire paragraphs. This used to be the sole mobile app from Microsoft that wasn't entirely unusable due to bugs but it now joins the club. Will change my review once this issue is resolved.",
        "It's a great app! I've started using it for professional reasons, as a personal/work diary. It works like a physical notebook when you have different tabs, only here you can have sub-tabs, which is great. I would suggest adding a few more sub-tabs in case one needs to expand their notes, the way a tree branch grows. I love the yellow text highlighting function, very helpful to make your notes stand out, and it's great you can underline, change to writing to bold or italics. I would just maybe also add the ability to change the font size and type. It's great as a personal diary too. You can upload pictures (from your gallery or you can take one there and then) and write underneath them. You can title your tabs, and the date and time is recorded automatically. Great job to the team who developed it. Would also be great to see the changes suggested above maybe. Thanks!",
        "(1) We really need \"find on page\" search functionality   (2) OneDrive has a feature that provides a choice of requiring a passcode every time the OneDrive app is opened...can you do the same for OneNote? (3) When you hit enter at the end of a line, often the last word gets pasted to the previous line.  I have seen other users cite this issue in their feedback.  Hoping you will consider addressing these points.",
        "Not Bad for a Free App Everything runs fine on this app. Tools for editting are simply designed and are intuitive for even new users to get used to. Especially, if you have a wide homescreen, you can make good use of its widget function. The only drawback I have realized so far is that there is no way this version and the PC's one can synchronize, and I hope this would be fixed in a near future. Thanks for a wonderful app.",
        "I really love the app. My only concern is that the way it types is kind of weird, because the letters themselves appear just slightly after you type them. I don't know, it's just kind of disorienting for me. Also, I've been having difficulties copy and pasting lists, and can only copy one number at a time."
    ],
    "recentChanges": [
        "1. When you reopen OneNote, it will remember the notes you were working on and open right to that place.",
        "2. Bug fixes and performance improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.microsoft.office.onenote&hl=en&gl=us",
    "appId": "com.microsoft.office.onenote"
}