{
    "title": "Insiders",
    "summary": "The ultimate library of lifestyle recommendations.",
    "icon": "//lh3.googleusercontent.com/Xki-UT5YfEW9AxTRnz_bZhUGexuF6fek65gX6KwdApESuCWoweu6SvFFBTf6R6S7Nu0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.5,
    "reviews": 15,
    "developer": "Insiders",
    "developerId": "Insiders",
    "developerEmail": "contact@myinsiders.com",
    "developerWebsite": "https://www.myinsiders.com",
    "updated": "March 23, 2016",
    "version": "1.6",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "The ultimate lifestyle companion for the traveller in the know, Insiders is an incredible library of the best places to go and things to do, wherever you are in the world, at your fingertips - curated by you, and the friends, influencers, brands and publications you trust. Many of us are faced with a perennial problem…how do you find out where you should be dining, staying, drinking, shopping, playing and exploring? Experiences make us happy, and Insiders helps you seek out and discover those unforgettable experiences…the ones best tailored to your passions and interests. Insiders is the place where enlightened and adventure-seeking individuals, and their friends, go to share tips from around the world, and follow recommendations from the world’s most desired brands, well known faces from the worlds of fashion, music, business and entertainment, and the best tastemaker publications. Furthermore, via the integration of many of the world’s largest privilege and reward programme providers, including major credit cards, banks, airline flying clubs, hotel loyalty schemes and concierges, users can benefit from a wealth of seamlessly integrated, personalised privileges - real time, in situ upgrades, offers and incentives directly linked to places and destinations. In most cases, users are already entitled to these privileges, but don’t realise they have them.",
    "descriptionHTML": "The ultimate lifestyle companion for the traveller in the know, Insiders is an incredible library of the best places to go and things to do, wherever you are in the world, at your fingertips - curated by you, and the friends, influencers, brands and publications you trust.<br> <br>Many of us are faced with a perennial problem&#x2026;how do you find out where you should be dining, staying, drinking, shopping, playing and exploring? Experiences make us happy, and Insiders helps you seek out and discover those unforgettable experiences&#x2026;the ones best tailored to your passions and interests.<br> <br>Insiders is the place where enlightened and adventure-seeking individuals, and their friends, go to share tips from around the world, and follow recommendations from the world&#x2019;s most desired brands, well known faces from the worlds of fashion, music, business and entertainment, and the best tastemaker publications.<br> <br>Furthermore, via the integration of many of the world&#x2019;s largest privilege and reward programme providers, including major credit cards, banks, airline flying clubs, hotel loyalty schemes and concierges, users can benefit from a wealth of seamlessly integrated, personalised privileges - real time, in situ upgrades, offers and incentives directly linked to places and destinations. In most cases, users are already entitled to these privileges, but don&#x2019;t realise they have them.",
    "histogram": {
        "1": 4,
        "2": 0,
        "3": 3,
        "4": 0,
        "5": 8
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/MeeQoTU37eIzP9b9TyHTQlvxKUkVDPltxzgsCYni6Q8dvTSkTTbrDIas8Chdw17Wxw=h310",
        "//lh3.googleusercontent.com/ToWb4Jswu6lAtSMuu5VDXbp6p7L7msxfoxFJsdLezAM6bw_USbNrV-xXHsOVw1HOsbk=h310",
        "//lh3.googleusercontent.com/DwYXNrp0bti_jKW8ky1s7tczYLEGb3iO1YMDVp-Gep6JLEeJ2FYAH9mfuvZmh2CsND8=h310",
        "//lh3.googleusercontent.com/6380hNnAo6w8IeJcY_S8jVCuySn_tKJfEdp1_VxAtXK0r5OU99jpiGHXQzW6aCi_6pP-=h310",
        "//lh3.googleusercontent.com/LJo7rIGiwJHHqYFSvPbs8UeDXITZCo5DvbwDc0DMFt7e9wfgVweyyYQW39i9DktPVNk=h310",
        "//lh3.googleusercontent.com/x5Lily-hhsshuH2v4c4uP79DW-TeRpUrQXZYCCgS7kB0oGmqRDLlhoY4JP97y9vphHYD=h310",
        "//lh3.googleusercontent.com/zv8Ta5YVWc5RgtnURx1TyGT8sEu-ppCnwgdH0OrvP7AzxRpNpPHbKqhVi9a_o6lyBQ=h310"
    ],
    "comments": [
        "Oh Dear As an app Tag promo on their site I am surprised Tag have not checked it out. Doesnt load properly..... and always freezes and cuts off. Come on Tag.... Give me some really good Apps for the connected.",
        "Great app."
    ],
    "recentChanges": [
        "Insiders now allows new users to join more easily, with open access to all features of the app for the first time. The sign up and registration process has been improved, and a new, simpler tutorial has been added. Other small refinements include better prompts, helping you to learn how to make the most of Insiders and other design and presentation refinements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.myinsiders.droid&hl=en&gl=us",
    "appId": "com.myinsiders.droid"
}