{
    "title": "Web Browser for Android Wear",
    "summary": "The internet, less than an arm&#39;s length away! Web browser for Android Wear.",
    "icon": "//lh3.googleusercontent.com/j2cFCXRYkvTWX6Gfr74468A1jes-Qv47YRSW7axJtNCajW6ZzaKueoEBAIciAAf2-w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 3.6,
    "reviews": 9121,
    "developer": "appfour",
    "developerId": "8815886658662427637",
    "developerEmail": "support@appfour.com",
    "developerWebsite": "http://gplus.to/WIB",
    "developerAddress": "appfour GmbH\nMarie-Juchacz-Str 7\n76137 Karlsruhe\nGermany",
    "updated": "January 22, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "The internet, less than an arm's length away!  WIB, the Android Wear Internet Browser, is a full fledged web browser running on your Android Wear smartwatch. Bookmarks can easily be added directly from your watch. WIB works even when your phone is off if you have a smartwatch with Android Wear 5.1 and WiFi! One of the must have tools for wearables.Works standalone on Android Wear 2 watches paired with iOS or Android phones. For standalone support install the app from the play store on the watch only.NOTE: The Full Version in-app purchase is required for more than demo use.Features:- Quickly search the web with voice or text search- Open links in the Wear Internet Browser from your phone via Share...- Voice search by tapping on the Google icon- Mini keyboard for entering text on the Android Wear smartwatch- TouchOne keyboard support- English, French, Russian, Spanish, Italian and German keyboards- Selectable language for keyboard and search- Voice text input in the keyboard- HTTP and HTTPS support- Android 5.1: Browse faster using watch WiFi- Android 5.1: Browse using watch WiFi even if your phone is off- Action to open website on phone- Actions to add/clear bookmarks- Smooth touch scrolling- Connection indicator- Back and forward button- Pinch zoom- Low footprintThings you can do with a web browser on your smartwatch include:- Visit social websites- Check the weather forecast- Search for travel and local sites options- Search for transportation optionsThe Wear Internet Browser is compatible with all Android Wear smart watches:- Motorola Moto 360- Sony Smartwatch 3- LG G Watch- LG G Watch R- LG Watch Urbane- LG Watch Urbane 2nd Edition- ASUS ZenWatch- ASUS ZenWatch 2- Huawei Watch- Samsung Gear Live- Fossil Q Founder- TAG Heuer ConnectedSummary: WIB is a web browser for Android Wear smartwatches and works for browsing all websites.",
    "descriptionHTML": "The internet, less than an arm&apos;s length away!  <b>WIB</b>, the Android Wear Internet Browser, is a full fledged web browser running on your Android Wear smartwatch. Bookmarks can easily be added directly from your watch. WIB works even when your phone is off if you have a smartwatch with Android Wear 5.1 and WiFi! One of the must have tools for wearables.<br><br>Works standalone on Android Wear 2 watches paired with iOS or Android phones. For standalone support install the app from the play store on the watch only.<br><br><b>NOTE:</b> The Full Version in-app purchase is required for more than demo use.<br><br>Features:<br>- Quickly search the web with voice or text search<br>- Open links in the Wear Internet Browser from your phone via Share...<br>- Voice search by tapping on the Google icon<br>- Mini keyboard for entering text on the Android Wear smartwatch<br>- TouchOne keyboard support<br>- English, French, Russian, Spanish, Italian and German keyboards<br>- Selectable language for keyboard and search<br>- Voice text input in the keyboard<br>- HTTP and HTTPS support<br>- Android 5.1: Browse faster using watch WiFi<br>- Android 5.1: Browse using watch WiFi even if your phone is off<br>- Action to open website on phone<br>- Actions to add/clear bookmarks<br>- Smooth touch scrolling<br>- Connection indicator<br>- Back and forward button<br>- Pinch zoom<br>- Low footprint<br><br>Things you can do with a web browser on your smartwatch include:<br>- Visit social websites<br>- Check the weather forecast<br>- Search for travel and local sites options<br>- Search for transportation options<br><br>The Wear Internet Browser is compatible with all Android Wear smart watches:<br>- Motorola Moto 360<br>- Sony Smartwatch 3<br>- LG G Watch<br>- LG G Watch R<br>- LG Watch Urbane<br>- LG Watch Urbane 2nd Edition<br>- ASUS ZenWatch<br>- ASUS ZenWatch 2<br>- Huawei Watch<br>- Samsung Gear Live<br>- Fossil Q Founder<br>- TAG Heuer Connected<br><br>Summary: WIB is a web browser for Android Wear smartwatches and works for browsing all websites.",
    "histogram": {
        "1": 1797,
        "2": 513,
        "3": 943,
        "4": 2067,
        "5": 3801
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/IqOdlbQ_VhFueh_c4L310Cgz6WfvWywgYQIr15Kux0ugmoTayhenGogSmSN8sLMw070=h310",
        "//lh3.googleusercontent.com/EWEHuPLbBT9B66I5V7_Akda_W4wfLXWnKfIVqcgNx28f55iRabY5RfB_8z68YOycNq8=h310",
        "//lh3.googleusercontent.com/b6FaowgtfAlsLglw9H9gedIALqlKfPL5SIHFpu9JYYGcCAad6tQI2EUMh7U0FSu7y7LV=h310",
        "//lh3.googleusercontent.com/YrNZBGYJhIxcb50EPfh5cf0poapBQC467PYUJyOr0IVtjV6Qcwlxn97Afqh_DR2a_A=h310",
        "//lh3.googleusercontent.com/rugcAfjryKzFKpJxg9wLJMss5P4mbIoYlArV4DeyQr3eJt23pE8P_x2f1flrJbEMaQ=h310",
        "//lh3.googleusercontent.com/BjBnpNzycyp6VUpwVa-Vi77VIVHExvtV1wLsyYyh5oXy4eJKu4DuHTEKruYr-29Ykz0=h310",
        "//lh3.googleusercontent.com/bfUTW5hA7jWweOs-x548vyC2QckletXTWwkbx9dfWvX62bTEpbMAhxujeLJsg50S8wc=h310",
        "//lh3.googleusercontent.com/osddYVDK4_irKPENMo4IeuvkTZoQqKpopQZ5ZcV8ppMMWbWm2R6js-rrkfAYeLUGBXk=h310"
    ],
    "video": "https://www.youtube.com/embed/OYdHeYstZas",
    "comments": [
        "It's a browser that's very buggy, but it does have potential. It takes forever for pages to load up, but it gets the job done, it does load up most pages for the most part and videos do work on pages so good job on that. But my biggest issue with this is that the \"free\" version is always pushing adds on you to buy the premium version of this. I ended up coughing up a few dollars to get the premium, but guess what, when you buy the premium version it doesn't save to your Google account. So if you were to reset your watch or get a new smart watch and sign in, you'd have to pay for it again! Not sure what the policies were, but I definitely feel like I shouldn't have to buy it again.",
        "I installed the app on an LG Urbane 2 watch. The app has potential and I definitely had high hopes for it. The problem I encountered is that when the keyboard comes up to enter website logon credentials it clips half of the leftmost and rightmost character of the top line. You can still type in the characters though using a stylus. When attempting to enter a password using the special characters button,  the leftmost and rightmost numbers 1 and 0, on the first keyboard line are not visible. They are totally clipped.",
        "Really love the app. Having my Twitter feed available in a pinch is great. Would love to scroll with the scroll wheel on my Fossil Q Explorist. It is really awkward being able to scroll through everything on my watch besides this app.",
        "Buggy ad implementation makes it impossible to use. Might be good if I paid to remove ads, but the free experience is so poor, that feels like a risk and a potential waste of money!",
        "Terrible app in the free version.  Cannot even go to one site.  Why not just make it a paid app from the start?",
        "You are just stupid. Making me pay to see a website make you a total di@$"
    ],
    "recentChanges": [
        "New: Swipe down to refresh favorites data",
        "Older changes",
        "New: Settings activity on watch",
        "Fixed: Non-WLAN connection problems",
        "Fixed: Crash on Fossil Q Founder",
        "New: appfour facebook page",
        "New: Open Wi-Fi manager action",
        "New: Sign in support with  Wear Wi-Fi manager app",
        "New: Material user interface with action bar",
        "New: Forward button",
        "New: Paste clipboard content from phone on the watch"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.appfour.wearbrowser&hl=en&gl=us",
    "appId": "com.appfour.wearbrowser"
}