{
    "title": "Break Timer: Type strain free",
    "summary": "Android watch / wear app reminds you to take breaks if you type for too long",
    "icon": "//lh6.ggpht.com/bL80vDdSPb3jxzeoDpqAKbVnfZOUyEG_nRl-bSq9EDangTRxukDZbfmsGHCX0KUp5A=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.6,
    "reviews": 28,
    "developer": "2359 Media",
    "developerId": "2359+Media",
    "developerEmail": "enquiries@2359media.com",
    "developerWebsite": "http://2359media.com/",
    "developerAddress": "2359 Media Singapore",
    "updated": "September 28, 2014",
    "version": "1.1.1",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Break Timer uses Smart Analysis to detect your typing motion and alerts you to take a break when you have been typing continuously for 30 minutes. It lowers the risk of Repetitive Strain Injury (RSI) and keeps you more productive. The app’s behavior is fully customizable; you can set the typing duration after which you want to be reminded to take a break. The app suggests you fun exercises for the break that you can easily follow in office to keep yourself strain and injury free.Break Timer’s Smart Analysis algorithm uses the watch accelerometer to monitor minute movements of the wrists to see if you are typing. If the hands are totally in resting position or the amplitude of movements is too high, it is not considered as typing. Break Timer is a watch app because phones cannot measure the moment of your hands. Only a watch can and that is what makes break timer such an innovative watch app that can alleviate the concerns of injury or strain on your wrist. The most frequent injury caused by continuous typing without a break is RSI. A repetitive strain injury (RSI) is an \"injury to the musculoskeletal and nervous systems that may be caused by repetitive tasks, forceful exertions, vibrations, mechanical compression, or sustained or awkward positions.\"[1] RSIs are also known as cumulative trauma disorders, repetitive stress injuries, repetitive motion injuries or disorders, musculoskeletal disorders, and occupational or sports overuse syndromes.Break Timer is an Android Watch - Wear App so you will need an Android Wear Watch. The application is currently built for widely available square android-wear watches i.e. LG G Watch and Samsung Gear Live. Keywords:  Breaktimer, keyboard, typing, strain, injury, RSI, watch, wear, pain, android-wear",
    "descriptionHTML": "Break Timer uses Smart Analysis to detect your typing motion and alerts you to take a break when you have been typing continuously for 30 minutes. It lowers the risk of Repetitive Strain Injury (RSI) and keeps you more productive. <br>The app&#x2019;s behavior is fully customizable; you can set the typing duration after which you want to be reminded to take a break. The app suggests you fun exercises for the break that you can easily follow in office to keep yourself strain and injury free.<br>Break Timer&#x2019;s Smart Analysis algorithm uses the watch accelerometer to monitor minute movements of the wrists to see if you are typing. If the hands are totally in resting position or the amplitude of movements is too high, it is not considered as typing. Break Timer is a watch app because phones cannot measure the moment of your hands. Only a watch can and that is what makes break timer such an innovative watch app that can alleviate the concerns of injury or strain on your wrist.<br> <br>The most frequent injury caused by continuous typing without a break is RSI. A repetitive strain injury (RSI) is an &quot;injury to the musculoskeletal and nervous systems that may be caused by repetitive tasks, forceful exertions, vibrations, mechanical compression, or sustained or awkward positions.&quot;[1] RSIs are also known as cumulative trauma disorders, repetitive stress injuries, repetitive motion injuries or disorders, musculoskeletal disorders, and occupational or sports overuse syndromes.<br>Break Timer is an Android Watch - Wear App so you will need an Android Wear Watch. The application is currently built for widely available square android-wear watches i.e. LG G Watch and Samsung Gear Live. <br><br>Keywords:  Breaktimer, keyboard, typing, strain, injury, RSI, watch, wear, pain, android-wear",
    "histogram": {
        "1": 5,
        "2": 2,
        "3": 4,
        "4": 6,
        "5": 11
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh3.ggpht.com/fWo8m1pcgsJrg4PPycLgVOMjZx7LsxiArf7kRyUlKReIyZw6m8h5B0O2SYDW1HCxjGo=h310",
        "//lh5.ggpht.com/YMi-Y3Q3P2yk813KOEA-WfQEVR_jLjqxc4sTF0t3iCVAQiRupdxu_W1rtRwUu5GXB8o=h310",
        "//lh5.ggpht.com/d5RxkXWTAHZ36PmNwXE3YmxLe7_Fsky4_Iw0NuiKn9Jf-mvmymTnOq0SV-XmRXU2LA=h310",
        "//lh4.ggpht.com/W1Qig5T08SCHy0nt5_ddh1NiFiPx-ss1VvOHwSweQ7kX85l4fBnlr7_7esksrZHVQQ=h310",
        "//lh3.ggpht.com/tMSugrZ6SCSFYtWrKFKM6drSo0Ha01b6fxpXMuA_U_JyTrPifJ9peUoWbTR4rak3T94=h310"
    ],
    "comments": [
        "Persistent notification. I don't really like the persistent notification...at all. Even when I'm not typing it shows up.  It bugs me enough and gets in the way of my other notifications that I'll probably remove the app.",
        "Great idea but... I should be able to schedule when it should be active or turn it on our off. When I'm driving it's constantly telling me to take a break or look out the window.....",
        "App crashes On my moto 360. It crashes out of the blue.  Not sure why. I look at my watch and twice the app has crashed and not responding.",
        "After a restart, the watch keeps vibrating for unlimited notifications and the app page on my phone stuck at the green page and the timer flashes between 3:00 and 2:59",
        "Work well If you have to use keyboard continously for long period of time, must try. It usually reminds me to take break at the correct timing."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.media2359.breaktimer&hl=en&gl=us",
    "appId": "com.media2359.breaktimer"
}