{
    "title": "HalalGuide:Mosques,Salat,Quran",
    "summary": "Islam Guide of halal restaurants and mosques, prayer times, read Quran, radio",
    "icon": "//lh3.googleusercontent.com/i5y89nfxIjCG2GRAX-PMeuSUJR_HhwUXIOA3iZQcQR0Vh91xLLteKDrRfShp6lTWYLMg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.8,
    "reviews": 1917,
    "developer": "Halal Guide, ltd",
    "developerId": "Halal+Guide,+ltd",
    "developerEmail": "info@halalguide.me",
    "developerWebsite": "http://halalguide.me",
    "developerAddress": "Город Казань, ул. Петербургская 52",
    "updated": "January 9, 2018",
    "version": "1.4.2.0.0",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "HalalGuide is an authentic digital directory guide that aims to enhance online search for Islamic products, places or services. We are bound to transform online search for Halal places: not only does HalalGuide lead you to your favourite halal destinations, it is a large digital platform that aims to create a close-knit community. Download HalalGuide now to access all Halal places in one app and join our budding vibrant community.  What do you get with this app?- A directory of mosques and prayer rooms;- A directory of Halal restaurants and takeaways, along with table booking and order delivery services;- A directory for Halal food groceries, clothing stores and Islamic bookshops;- A directory of Islamic organisations (educational, medical, charity, banks) - Prayer time alarm worldwide,- Quran, Ask the Imam feature- Islamic events and Muslim meetups- Ability to earn points by buying products and services within our network and spending these points on new purchasesThis app is great for both, locals and travelers. We have rich databases in the United Kingdom, UAE, Ukraine, Belarus, Azerbaijan, Russia and few other countries, and the list is constantly growing.Languages currently available: English, French, Arabic, Turkish, Tatar and Russian. More than 30,000 points are now marked on an interactive map throughout the world.What sets us apart:- We have a comprehensive and up-to date database as ‘halal’ sign in restaurants are often outdated;- We work closely with Halal certification authorities, which we use as our primary source of data;- We offer a great user experience;- We are a community-driven product: any user can add a new place, leave a review and suggest a new feature to our app. We have 11 various products due to our productive collaboration with the community.Wearable app functionality:- Prayer times- Direction to the nearest Halal place- Ask the Imam feature- Tasbeeh - Built-in GreenBonus QR-code",
    "descriptionHTML": "HalalGuide is an authentic digital directory guide that aims to enhance online search for Islamic products, places or services. We are bound to transform online search for Halal places: not only does HalalGuide lead you to your favourite halal destinations, it is a large digital platform that aims to create a close-knit community. Download HalalGuide now to access all Halal places in one app and join our budding vibrant community.  <br><br>What do you get with this app?<br>- A directory of mosques and prayer rooms;<br>- A directory of Halal restaurants and takeaways, along with table booking and order delivery services;<br>- A directory for Halal food groceries, clothing stores and Islamic bookshops;<br>- A directory of Islamic organisations (educational, medical, charity, banks) <br>- Prayer time alarm worldwide,<br>- Quran, Ask the Imam feature<br>- Islamic events and Muslim meetups<br>- Ability to earn points by buying products and services within our network and spending these points on new purchases<br><br>This app is great for both, locals and travelers. We have rich databases in the United Kingdom, UAE, Ukraine, Belarus, Azerbaijan, Russia and few other countries, and the list is constantly growing.<br><br>Languages currently available: English, French, Arabic, Turkish, Tatar and Russian. <br><br>More than 30,000 points are now marked on an interactive map throughout the world.<br><br>What sets us apart:<br>- We have a comprehensive and up-to date database as &#x2018;halal&#x2019; sign in restaurants are often outdated;<br>- We work closely with Halal certification authorities, which we use as our primary source of data;<br>- We offer a great user experience;<br>- We are a community-driven product: any user can add a new place, leave a review and suggest a new feature to our app. We have 11 various products due to our productive collaboration with the community.<br><br>Wearable app functionality:<br>- Prayer times<br>- Direction to the nearest Halal place<br>- Ask the Imam feature<br>- Tasbeeh <br>- Built-in GreenBonus QR-code",
    "histogram": {
        "1": 33,
        "2": 25,
        "3": 39,
        "4": 128,
        "5": 1692
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/D7c85ujSWjc7LH5JuUMfaWE8fOA52L5bG7mLrhImgyP8YR7e8X-8lXgsGa7_7Ko5F7w=h310",
        "//lh3.googleusercontent.com/erAZVdmp2Mxs5JhYX67khHNSyZzr2ih1Tfh-e7rXG08MjM-g6dBOzVq9y1-nt4Gb3Nc=h310",
        "//lh3.googleusercontent.com/YmFbqq0zXlGeV-Bnz_-INB04m_5WenBzPbttERFwKpKsi1gllU1_6hhN4IaLXmJiSFxt=h310",
        "//lh3.googleusercontent.com/UB4joCHUMwflR-2zpK9oaJfzH5sl97yBIAPDJQE3os7FPzJC2ot2gwjTLdDMr4sl8KE=h310",
        "//lh3.googleusercontent.com/X0eCuhJ4p1DWUGdRu53dAPk8Hrnsyp1HhMWKAikCDl9OnsaLk3qoXQ7xCdKhK9NrE3g=h310",
        "//lh3.googleusercontent.com/Zo59-9jhPDvyCJ9S7-tesX8yeQX38H92G0-ajSzqm1GYjw4occ0qQNOpE5J6bV-UpkA=h310",
        "//lh3.googleusercontent.com/y3TMcr9VCJksitZ1zJdiF5sBu0ZQOaTJjLgL1c6RxeAP_jnF1ON9P4SBAHvyLw3FkWA=h310",
        "//lh3.googleusercontent.com/a4G1ZMvl2iJTJJsBc1GUhsKb5yjTxhKIe7JzHsExvfZ033mii9ewVyB4mMNVOOBBHb4=h310",
        "//lh3.googleusercontent.com/rTvomLxgnViml6HFs1adE6hNSaovmOUWP86Z9P4jbtbcQTXBH5235npJoQy70CrTl5o=h310",
        "//lh3.googleusercontent.com/GxYr04LoEzDdMoKONJ4BQjdZ3LDIoF8tLMcRAbmToZFKiP4n4Y5JgRVlV_a60zjcz4A=h310",
        "//lh3.googleusercontent.com/cM1Kr9RCZnOOzWmJbcHKndn0K069MXUpmeMb34sUuERnoSbKpRz04hE7Ds0hxLFe6XU=h310",
        "//lh3.googleusercontent.com/VvxWPMBSyX5p6URkVhQUfdOqHziDi3hvRqZ1ra9X3LpfenGjcF4s-aHjLLCW8DjF-Xc=h310"
    ],
    "comments": [
        "Спасибо. Заслуживает экстра лайк 👍",
        "thanks",
        "Very good app in terms of what it allows you to do but the locations are very inaccurate. I live in Crawley which is in South East England and the app tells me I live in Sutton which is in Surrey. This then renders most of the app's functions useless as none of the 'nearest places' are anywhere in the nearby vicinity. Please fix this!!",
        "11 out of 10 !! Truly unique and mastered this corner of the market. By far the best app,  functions and user friendly options; can set to my own unique look and config. Would recommend to all; especially to anyone inquisitive as App inspiring and unique, not just mainstream mediocrity, but merging you directly in to Storefronts, Platforms or Venues. A conglomerate of businesses, helpfull and not always profit driven, with like-minded friends. I gurantee satisfaction, so much to do, play with  and try... Truly Great....I really cant put my phone down :-)",
        "Helps me with all I need to know",
        "Helpful..please explore more for Indonesia"
    ],
    "recentChanges": [
        "Add new features:",
        "- starter payment",
        "- qurban payment"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.unated&hl=en&gl=us",
    "appId": "com.unated"
}