{
    "title": "Bright Weather",
    "summary": "Your beautiful weather app for weather forecast, summary, radar and alerts.",
    "icon": "//lh6.ggpht.com/8uVlRqMILACgr92BleY7WEpC4Z1Y122s2y-7NhO5RZD5kSeWQ0ZhYuuzeOTqH7Ns1I3N=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.1,
    "reviews": 17013,
    "developer": "LevelUp Studio",
    "developerId": "LevelUp+Studio",
    "developerEmail": "support@levelupstudio.zendesk.com",
    "developerWebsite": "http://levelupstudio.com",
    "developerAddress": "530 Rue de Tanseput\n82600 Verdun Sur Garonne",
    "updated": "October 26, 2015",
    "version": "1.4.1",
    "genre": "Weather",
    "genreId": "WEATHER",
    "description": "Bright Weather makes the daily weather summary essentials easily available and a simple access to deeper information while presenting it in a tasteful, lightweight experience that makes checking the weather forecast enjoyable.LifeHacker: \"Overall it's a solid weather app, and a good competitor to Yahoo\"Android Police: \"If you're into informative, yet minimal apps, then the company's newest offering, Bright Weather, should be right up your alley.tested.com: \"Right out of the gate it's probably one of the best looking Android weather apps, and it has some cool widgets (obviously).PCMag: \"Bright Weather is a Lovely New Android Weather App from LevelUp StudioThe beautiful design mixes stunning photography with minimalistic graphics as it tries to balance information, functionnality, simplicity and attractivity for your personal weather interests.Sure you can just look outside to get an idea of whether it is cold, rainy or windy. But can you be sure not to get heavy rain later without checking the comprehensive weather forecast included in Bright Weather?Bright Weather features many information and functionalities efficiently accessible:- Android Wear support- Simple weather overview with 24 hours forecast with temperatures and conditions- Advanced weather conditions with todays hourly forecast, sunset and sunrise- Six days weather forecast with details for the day and night- Weather almanac enclosing temperature records- Current Moon phase, UV Index- Interactive Weather Radar Map featuring clouds, rain, snow, pressure, temperature and wind using data from OpenWeatherMap- Take a picture and share your weather using the integrated camera feature- Beautiful Widgets with an optional clock- Daily updated background picture- Get even more information with a direct access to Weather Underground website for you locationSmart notifications allows you to get notified for the weather before the weekend, or to create your own custom notifications like being alerted of a temperature change.Bright Weather is brought to you by the creators of Beautiful Widgets and Plume, the awards winning applications available on Android.Please let us know what you think, you can follow us on twitter http://twitter.com/levelupstudio",
    "descriptionHTML": "<b>Bright Weather makes the daily weather summary essentials easily available and a simple access to deeper information while presenting it in a tasteful, lightweight experience that makes checking the weather forecast enjoyable.</b><br><br>LifeHacker: &quot;<i>Overall it&apos;s a solid weather app, and a good competitor to Yahoo</i>&quot;<br><br>Android Police: &quot;<i>If you&apos;re into informative, yet minimal apps, then the company&apos;s newest offering, Bright Weather, should be right up your alley.</i><br><br>tested.com: &quot;<i>Right out of the gate it&apos;s probably one of the best looking Android weather apps, and it has some cool widgets (obviously).</i><br><br>PCMag: &quot;<i>Bright Weather is a Lovely New Android Weather App from LevelUp Studio</i><br><br>The beautiful design mixes stunning photography with minimalistic graphics as it tries to balance information, functionnality, simplicity and attractivity for your personal weather interests.<br><br>Sure you can just look outside to get an idea of whether it is cold, rainy or windy. But can you be sure not to get heavy rain later without checking the comprehensive weather forecast included in Bright Weather?<br><br>Bright Weather features many information and functionalities efficiently accessible:<br><br>- Android Wear support<br>- Simple weather overview with 24 hours forecast with temperatures and conditions<br>- Advanced weather conditions with todays hourly forecast, sunset and sunrise<br>- Six days weather forecast with details for the day and night<br>- Weather almanac enclosing temperature records<br>- Current Moon phase, UV Index<br>- Interactive Weather Radar Map featuring clouds, rain, snow, pressure, temperature and wind using data from OpenWeatherMap<br>- Take a picture and share your weather using the integrated camera feature<br>- Beautiful Widgets with an optional clock<br>- Daily updated background picture<br>- Get even more information with a direct access to Weather Underground website for you location<br><br>Smart notifications allows you to get notified for the weather before the weekend, or to create your own custom notifications like being alerted of a temperature change.<br><br>Bright Weather is brought to you by the creators of Beautiful Widgets and Plume, the awards winning applications available on Android.<br><br>Please let us know what you think, you can follow us on twitter http://twitter.com/levelupstudio",
    "histogram": {
        "1": 1054,
        "2": 874,
        "3": 2050,
        "4": 4791,
        "5": 8244
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/0qz3eIOWaOgvG0V0iFhMbNBCoh3R1miEhjhpm6XbPHTdbO7bJ5SFpYrXW_mUSROOiMk=h310",
        "//lh5.ggpht.com/WjpVhC4YPlKpLj3hEV-Jl37SrYD5WP7YXy-MF6ib8TXT8uPkXmcZO1YalMFTR56O9w=h310",
        "//lh5.ggpht.com/BMafzuPDmtbHYQHyp7KdbRb-u81fpWg_TV5rMd91V4I5KtKwlHTyH6kaLeIbqa9E2H8=h310",
        "//lh5.ggpht.com/ayiDKcJj9m21dkbUsghiRDfsGzfkcDYKmD9-lmROUi4GT4D_pPhqlGf1Pl2qhrhCJA=h310",
        "//lh3.ggpht.com/cWCIDTP3XmR967bYp_eKeCU4nNl0f5sMAW6Lgo4JB_QSsMDbbk9MPldIH-FLh906-jM=h310",
        "//lh5.ggpht.com/LOIsRDcb0n2QLXaS7ZEbCw-9XV5VRAdDHdWi5vHvq10tbfxloDHwPE6q5zhIr8Em2Jc=h310",
        "//lh5.ggpht.com/_ZNw8OrdH3BuXyXTBqvH-Luz1SHAl44Ernqp9xDxJAGjlvzI320LB1XCMN-6pKUxCQ=h310",
        "//lh5.ggpht.com/1FYkzcQ0WOZXP6NK1SsySsFPBdH7LDGuNx8ky6ZI9q7LMuohio8Kzbnw7BcVxcdfSw=h310",
        "//lh5.ggpht.com/q3P_zax27KD1H2Epzdu69YLQcRcRPAnpgU_oJ2hWObDTQHLqUD_9NLrc8qq6pYf26p0=h310",
        "//lh3.ggpht.com/PE-b-lEXM9BzDXCnts4eJBys7XRU6iE4ldypWBlAky94FZHQ1JEJt0RBpZHcFNrmlHJ-=h310",
        "//lh3.ggpht.com/YnGo_3ISNp4bfwSIRJo_qxNjET3y67FMViKspSgjRtdv2d_OHQY5F6QqkO3P1EqimPc=h310",
        "//lh3.ggpht.com/BKXfqroCAathRbILQvLT-nf5df1nrnwlQw5R5maBtv3DO333YfNWr1rnt4fYuyZHBM0=h310",
        "//lh3.ggpht.com/LsdOtcqI37lXpfQFWLy8ubnz2n5tbwQLhfg3JmVxHH9UNG3xlohQyyFNt9ZHIav0e-a9=h310",
        "//lh6.ggpht.com/xX6xI6v-qliHTSm4k1VKxgAO0Py8KyLorX1w666tBW_Bd9_Gi9tqTcjL97sXLcGDZRs=h310"
    ],
    "video": "https://www.youtube.com/embed/jGp3_d-EdH0",
    "comments": [
        "Autoplaying Video Adverts!!! Use it for the notifications. Very useful. The app is gorgeous, but main use case is for the notifications.  Which are mostly great.  The Weather Alert notification is a bit annoying though, as it always states Bright Weather as the notification (which is the app name) but it doesn't display the alert reason.... so it just reads as WEATHER ALERT: BRIGHT WEATHER. The other notifications are more informative, would be great if you can summarise the weather alert to fit in the notification title too.",
        "Updating? It seems to take a while to refresh. I usually turn off my phone and when I turn it back on the next day the weather stays on the day prior. It's like that for both my nexus 5 and 10. It doesn't correct itself on its own like other apps. Is there something going on that I can correct other than manually refreshing it? At times even a manual refresh doesn't work. Thanks for your time.",
        "Nice I downloaded it for the widget but the actual app is clean and classy.  I would however like a clear indication of where I am on the graph at the moment as it shows a 24 hour period and it doesn't seem I am at the same spot all the time.  It looks nice but it needs to be more clear. It has also been freezing up on me lately but not too often.  Also it is seems a bit slow to update.",
        "I have a few weather apps on my phone and Bright Weather is absolutely my favourite.  I don't know where Bright Weather gets its data from but the forecasts are always more accurate then the other apps I use, and accuracy is what its all about in my opinion. Add  to that a great user experience and I give this app 5 stars.  One thing I would like is to get a more detailed description for today's weather without being redirected to a website, would prefer it was embedded within the app.",
        "Beautiful but buggy The app looks great altogether and the weather display is precise and accurate. It is a pity though that German umlaut signs cannot be displayed correctly, these weather texts will bring up cryptic signs which are impossible to read. Unfortunately bright weather does not offer any language options. I hope that there will be a fix for these problems which I would gladly honour with five stars. 😊",
        "Good but I love the look of this,  clean,  clear and has a good widget.  However I do have some problems with updating (it doesn't sometimes and I need to force quit and restart) and I've noticed that the weather prediction itself can sometimes be incorrect but I believe this not to be the fault of the app."
    ],
    "recentChanges": [
        "Bugfixes",
        "Allow Nexus 5x"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.levelup.brightweather&hl=en&gl=us",
    "appId": "com.levelup.brightweather"
}