{
    "title": "ally mobility app",
    "summary": "Your app for city transport",
    "icon": "//lh3.googleusercontent.com/OOeeZGWZ1N7hxsqyVbEPBm4TeIr_GmFz_nytomGFk-oflDVHnnLBKIux9r-UP47mi_E=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 2335,
    "developer": "door2door",
    "developerId": "door2door",
    "developerEmail": "help@allyapp.com",
    "developerWebsite": "http://www.allyapp.com",
    "updated": "February 27, 2018",
    "version": "Varies with device",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "size": "Varies with device",
    "description": "ally combines all your transport information together one app, allowing you to save time and money by comparing the price and length of travel for various modes of transportation like walking, by car, the subway, public buses, train, ferry, bike, cab, Uber, and many more! We give you a clear and easy overview of all the available transportation options to get you to your destination as smoothly and smartly as possible!Never get lost again - ally will navigate cities’ complex transport systems for you. All you have to do is sit back and enjoy the ride!FEATURES - Departures monitor - Check the exact departure times for various transportation options near you, including walking, by car, the subway, public buses, train, ferry, bike, cab, Uber, and many more!- Route Search - the fastest way to get from A to B, including time of departure. Compare price and length of travel for different options! Find the best bus or train connections in your city, pull out your Uber app, or just call a regular cab.- Plan your journey in advance - choose a departure or arrival time ahead of time and see the best commuting options for you.CITIES IN GERMANYBerlin, Düsseldorf, Dortmund, Duisburg, MünchenSUPPORTAnd if you have any problems, feedback or ideas for ally, just drop us an email at help@allyapp.com!",
    "descriptionHTML": "ally combines all your transport information together one app, allowing you to save time and money by comparing the price and length of travel for various modes of transportation like walking, by car, the subway, public buses, train, ferry, bike, cab, Uber, and many more! We give you a clear and easy overview of all the available transportation options to get you to your destination as smoothly and smartly as possible!<br>Never get lost again - ally will navigate cities&#x2019; complex transport systems for you. All you have to do is sit back and enjoy the ride!<br><b>FEATURES</b><br> <br>- Departures monitor - Check the exact departure times for various transportation options near you, including walking, by car, the subway, public buses, train, ferry, bike, cab, Uber, and many more!<br>- Route Search - the fastest way to get from A to B, including time of departure. Compare price and length of travel for different options! Find the best bus or train connections in your city, pull out your Uber app, or just call a regular cab.<br>- Plan your journey in advance - choose a departure or arrival time ahead of time and see the best commuting options for you.<br><br><b>CITIES IN GERMANY</b><br>Berlin, D&#xFC;sseldorf, Dortmund, Duisburg, M&#xFC;nchen<br><br><b>SUPPORT</b><br>And if you have any problems, feedback or ideas for ally, just drop us an email at help@allyapp.com!",
    "histogram": {
        "1": 218,
        "2": 94,
        "3": 212,
        "4": 471,
        "5": 1340
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/XlL2bUeWKeNdTP1uDulacPyCO1mVlGTSBXP20QPPk3tB-IufENtTpA6JgExbq7ZbzQ=h310",
        "//lh3.googleusercontent.com/OwDVAB1KW25CSpJVzwFvEX9NPDSo_TslP6NHho4OGuUt4mlQMpKKcqarGJGSXHQXcfg=h310",
        "//lh3.googleusercontent.com/bOhc2MpGjJLO6RdqxdcTUF5gpSziOiRVtKsJ9ytrEG-tVIbSBom7ZmzRLwFTRbM4-lw=h310",
        "//lh3.googleusercontent.com/BEgOxirhLvITGbC9_md4PFelBK2oDCPK4jdMGcdKNzYVU2uEKFdYYWhAhWuH2ybQ6H8=h310"
    ],
    "comments": [
        "The only App, which can show me the route with train changes which. It helps me very much, but I wish me a Desktop Version. I have found a website from you, but without a webview of Ally.",
        "Used it for a week and it was great then it abruptly stopped working saying 'outside covered area', for all searches. Can't figure out why.",
        "All results show \"outside of covered area\" doesn't work anymore...",
        "Nothing found Why...",
        "Not the best Tried this around Berlin, the app worked ok but didn't always find the most direct routes and also displayed routes/services that weren't available. Ended up using a public transport map combined with Google maps instead.",
        "Just the thing i needed I take different types of transportation depending on my mood and weather conditions and this is exactly what I needed. Suggestion: add more local services e.g. Hailo in London"
    ],
    "recentChanges": [
        "We are constantly working on improving your app experience, so make sure you update to benefit from our latest features!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.allryder.android&hl=en&gl=us",
    "appId": "com.allryder.android"
}