{
    "title": "rShopping List - Grocery List",
    "summary": "★ Flexible Shopping List right on your phone or tablet ★",
    "icon": "//lh3.googleusercontent.com/psWeO99C9_Crd7R52w8qLZQlVU-92CQiDrS9Rx68fh7FQ1ZPAQXU6Nc6unyfevYUoHAg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.4,
    "reviews": 1382,
    "developer": "((RayDar)) Connected",
    "developerId": "((RayDar))+Connected",
    "developerEmail": "rShopping@RayDarLLC.com",
    "developerWebsite": "https://plus.google.com/100085900206049233981",
    "developerAddress": "1122 E. Pike Street #1318\nSeattle, WA, 98122",
    "updated": "January 11, 2018",
    "version": "2.3.28",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "Flexible yet EasyAre you looking for a powerful yet easy to use grocery list on your phone? With rShopping Grocery List, the more you use it, the better it gets.Fully LoadedrShopping Grocery List includes a sample shopping list of over 300 commonly purchased products but can be used for other types of shopping as well. You can add your own stores and items, or replace the built in list entirely.Android Wear SupportWhen you are near a store and you need some items, your watch will show a notification.Send Shopping List by E-mail or SMSCheck off the items needed while at home and then send an e-mail or SMS of that list to a shopping companion for their trip home. The list can even be arranged by aisle, so that your buddy can complete the task quickly.Remembers PricesThe last price entered at each store is remembered. rShopping Grocery List has a warning when you are about to purchase an item that was less expensive at another store. Eventually, rShopping Grocery List can predict the total cost of your next shopping trip.Arrange Lists EfficientlyExtensive sorting options are available. You can arrange stores and labels by up to three different options, each ascending or descending. rShopping Grocery List remembers the arrangement used for each store and label. You can even save a set of sort options for later.In-Store BasketAn optional \"Basket\" may be used while shopping to keep a running total of the items you have selected so far. Check off items while in the store and when you are done shopping, use the \"Checkout\" menu item to quickly mark all of the items in your basket as purchased.Item DetailsItems may have barcodes, pictures, prices (for each store), aisles (for each store), priorities (for each store) and more. Items may also be tagged with any number of \"Labels\" defined by you.Barcode ScanningrShopping Grocery List is compatible with several barcode scanning apps, including:● ZXing http://goo.gl/uJXPH● ixMat http://goo.gl/8Sbbn● Goggles http://goo.gl/BctQA● Pic2Shop http://goo.gl/vQlbL1● QuickMark Barcode http://goo.gl/TawVi● Barcode Scanner http://goo.gl/JtNxo● QR Barcode Reader http://goo.gl/p4x9IN● and moreBarcodes may be assigned to more than one item and multiple barcodes may be assigned to each item. Scan a barcode and the item(s) with that barcode instantly appear(s).Quickly Make a ListPress the button to the left of an item's name to indicate whether it is needed (a red X), purchased (a green check), or in the basket (a yellow basket).Powerful SearchFor fast searching when a list of items is displayed, tap the Search Here button at the top of the screen or slide out your physical keyboard (on some Android phones).Hide the Clutter, See only Needed ItemsTabs at the top of the item list show and hide items that are needed, in the basket, and/or purchased. More than one of these tabs may be chosen at any time. See this video: http://goo.gl/NojfeLHandy Shopper ReplacementrShopping Grocery List is a good choice for those who miss HandyShopper.Android ExclusiveThis is a native Android application. It is not one of those ported-from-a-fruit-named-company apps. It is responsive and supports many Android specific features including an action bar, the back button, shortcuts, widgets, gestures, and powerful search.Additional Features:★ Homescreen widgets★ Homescreen shortcuts★ Scan a product to add to/remove from a list★ Price calculator with conversions★ Coupon indicator★ Multiple stores★ Attach labels to stores★ Re-useable items★ AD FREE!",
    "descriptionHTML": "<b>Flexible yet Easy</b><br>Are you looking for a powerful yet easy to use grocery list on your phone? With <b>rShopping Grocery List</b>, the more you use it, the better it gets.<br><br><b>Fully Loaded</b><br>rShopping Grocery List includes a sample shopping list of over 300 commonly purchased products but can be used for other types of shopping as well. You can add your own stores and items, or replace the built in list entirely.<br><br><b>Android Wear Support</b><br>When you are near a store and you need some items, your watch will show a notification.<br><br><b>Send Shopping List by E-mail or SMS</b><br>Check off the items needed while at home and then send an e-mail or SMS of that list to a shopping companion for their trip home. The list can even be arranged by aisle, so that your buddy can complete the task quickly.<br><br><b>Remembers Prices</b><br>The last price entered at each store is remembered. <b>rShopping Grocery List</b> has a warning when you are about to purchase an item that was less expensive at another store. Eventually, <b>rShopping Grocery List</b> can predict the total cost of your next shopping trip.<br><br><b>Arrange Lists Efficiently</b><br>Extensive sorting options are available. You can arrange stores and labels by up to three different options, each ascending or descending. <b>rShopping Grocery List</b> remembers the arrangement used for each store and label. You can even save a set of sort options for later.<br><br><b>In-Store Basket</b><br>An optional &quot;Basket&quot; may be used while shopping to keep a running total of the items you have selected so far. Check off items while in the store and when you are done shopping, use the &quot;Checkout&quot; menu item to quickly mark all of the items in your basket as purchased.<br><br><b>Item Details</b><br>Items may have barcodes, pictures, prices (for each store), aisles (for each store), priorities (for each store) and more. Items may also be tagged with any number of &quot;Labels&quot; defined by you.<br><br><b>Barcode Scanning</b><br>rShopping Grocery List is compatible with several barcode scanning apps, including:<br>&#x25CF; <b>ZXing</b> http://goo.gl/uJXPH<br>&#x25CF; <b>ixMat</b> http://goo.gl/8Sbbn<br>&#x25CF; <b>Goggles</b> http://goo.gl/BctQA<br>&#x25CF; <b>Pic2Shop</b> http://goo.gl/vQlbL1<br>&#x25CF; <b>QuickMark Barcode</b> http://goo.gl/TawVi<br>&#x25CF; <b>Barcode Scanner</b> http://goo.gl/JtNxo<br>&#x25CF; <b>QR Barcode Reader</b> http://goo.gl/p4x9IN<br>&#x25CF; and more<br>Barcodes may be assigned to more than one item and multiple barcodes may be assigned to each item. Scan a barcode and the item(s) with that barcode instantly appear(s).<br><br><b>Quickly Make a List</b><br>Press the button to the left of an item&apos;s name to indicate whether it is needed (a red X), purchased (a green check), or in the basket (a yellow basket).<br><br><b>Powerful Search</b><br>For fast searching when a list of items is displayed, tap the <i>Search Here</i> button at the top of the screen or slide out your physical keyboard (on some Android phones).<br><br><b>Hide the Clutter, See only Needed Items</b><br>Tabs at the top of the item list show and hide items that are needed, in the basket, and/or purchased. More than one of these tabs may be chosen at any time. See this video: http://goo.gl/NojfeL<br><br><b>Handy Shopper Replacement</b><br>rShopping Grocery List is a good choice for those who miss HandyShopper.<br><br><b>Android Exclusive</b><br>This is a native Android application. It is not one of those ported-from-a-fruit-named-company apps. It is responsive and supports many Android specific features including an action bar, the back button, shortcuts, widgets, gestures, and powerful search.<br><br><b>Additional Features:</b><br>&#x2605; Homescreen widgets<br>&#x2605; Homescreen shortcuts<br>&#x2605; Scan a product to add to/remove from a list<br>&#x2605; Price calculator with conversions<br>&#x2605; Coupon indicator<br>&#x2605; Multiple stores<br>&#x2605; Attach labels to stores<br>&#x2605; Re-useable items<br>&#x2605; AD FREE!",
    "histogram": {
        "1": 51,
        "2": 42,
        "3": 99,
        "4": 261,
        "5": 929
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "3.1 and up",
    "androidVersion": "3.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/KXgJfNRkBlWfq1bAR_2vjZO3yScCImL4k2Iw4a1uZI22WVUDO5Djl1GmJfjZOlbpUlXE=h310",
        "//lh3.googleusercontent.com/ZaAtc56F20uOiZFdmhDWT8H9EyJSBvYkZc_RT_WPcZlEZBdgkeHj7LBWwKrnDn9nug=h310",
        "//lh3.googleusercontent.com/MPg_z8wrW3Xjeye517JtqGFSHQKGc4xyOM5s7_qwQ_oJn4vZ_gJMmt7h4eBx-Ni12Qw=h310",
        "//lh3.googleusercontent.com/4b2xtAey-coW9aT81Na1zy99aP8cpz1XyX6bJ3sXCyezCkDtjNh0sQ23J9ndtjSurQ=h310",
        "//lh3.googleusercontent.com/PeB95lIVqHg_21uVrILI4fSQT2_vTnZssZoJltvrEtoTbC5zbQrydNUr3sV6ePf7CQ=h310",
        "//lh3.googleusercontent.com/aUbODu3Fa2vbPte8qeeGRtNDOGZ1qGfWmjuVNDy4QaCFl_tXfbYqLJl7cn3GOR7Tq3A=h310"
    ],
    "video": "https://www.youtube.com/embed/dq1beN9Gkr0",
    "comments": [
        "If you are looking for just a simple list, this feature rich app might be not for you.  If you're looking for a shopping list that allows you to have a different list for every store you go to, while adding (and removing) an item to/from every store's list, having the ability to sort your list by (custom) aisles, then this should be your pick. Of course it takes some time to set up (adding all possible stores to an item, and adding a different aisle for each store). When you set up a list of aisles for each store, each aisle preceded by a 'sorting' number, according to the order in which they are present in the store, shopping can be very fast.",
        "Nothing else like it, best shopping app out there--period! If you are looking for an app like the long gone HandyShopper from the Palm-Pilot days...this is it.",
        "This app has many postive features. It does everything I need it to do. I've tried many other grocery store, buying lists and haven't found a better one. Give it a try.",
        "Excellent app.  Very flexible and extremely useful to me.  I've tried a few and this wins hands down.",
        "Absolutely Great shopping list app. Love the cloud sync. My wife and I just add whatever's needed and whoever goes to the store has the whole list available. Fabulous! Takes a little upfront work to identify which aisles products are in but, once done, the store visit can be arranged by aisle, so it's a quick matter of going only to the necessary aisles and its done. Even if we're both there shopping, we just knock off each item as we get it and the sync let's the other know it's done. So damn handy. EXACTLY what I was looking for!",
        "Love this! However, is there a way to move it to my SD card? The photos are taking up way to much space in my phone storage. Update: nevermind I figured it out!"
    ],
    "recentChanges": [
        "V 2.3.28",
        "● Calculator improvements",
        "● Added option to remove English units from calculator",
        "● User Interface improvements",
        ".",
        "V 2.3.26",
        "● Cloud based List Synchronization across multiple devices with the Shop With... subscription service",
        "● Added a 'Share Play Store Link' option to the Settings->About",
        "● Added a Privacy Policy to Settings->About",
        ".",
        "V 2.2.41",
        "● Workaround for a lockscreen bug on Samsung devices",
        "● Widget works better on Nova Launcher",
        "● Improved Spanish translation (thanks Fernando)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.RayDarLLC.rShopping&hl=en&gl=us",
    "appId": "com.RayDarLLC.rShopping"
}