{
    "title": "MyHyundai with Blue Link",
    "summary": "Connect to your Blue Link equipped Hyundai vehicle from your smartphone.",
    "icon": "//lh3.googleusercontent.com/1ZY2SMLy-gvD8Q62O9-jjXM88PS9lQLC1sb0aqQbU9NCCGaQmENaAXsC8_m7mLwcT7Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 2.8,
    "reviews": 3010,
    "developer": "Hyundai Motor America",
    "developerId": "Hyundai+Motor+America",
    "developerEmail": "customercare@hyundaibluelink.com",
    "developerWebsite": "http://www.HyundaiUSA.com",
    "updated": "March 6, 2017",
    "version": "3.9.6",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "The MyHyundai app makes getting information about your Hyundai vehicle easier than ever. Simply select your vehicle and a world of Car Care information is at your fingertips. The MyHyundai app also allows you to connect to your Blue Link enabled car from your phone. Blue Link technology enables and empowers you while you are on the go, giving you access to your Blue Link features in your office, at home, or just about anywhere.Log into the app with your MyHyundai.com ID, Password and PIN to take advantage of Blue Link’s remote access features. An active Blue Link subscription is required to use Blue Link features in the app. To renew or upgrade to either Remote or Guidance, please visit MyHyundai.com.An active Remote Package (R) or Guidance Package (G) subscription is required to access select features.With the Myhyundai app you can:1. Remotely start your vehicle (R)2. Remotely unlock or lock the door (R)3. Remotely activate the horn and lights (R)4. Search and send Points of Interest to your vehicle (G)5. Access saved POI History (G)6. Make a Car Care service appointment7. Access Blue Link Customer Care8. Car Finder (R)9. Access maintenance information and other convenient features.10. Vehicle Status (if equipped) ***Select 2015MY+ vehicles***11. Four widgets for Remote Features, Parking Meter, POI search, and AE EV vehicleMyHyundai app now supports Android Wear Smartwatch features. Use voice command or Smartwatch menu to access select features.With the Hyundai Blue Link Android Wear App you can:1. Remotely start your vehicle (R)2. Remotely unlock or lock the door (R)3. Remotely activate the horn and lights (R)4. Car Finder (R)5. Call Blue Link (Smartphone)6. Call Roadside (Smartphone)*Note: Active Blue Link subscription and Blue Link equipped vehicle with capabilities required.For technical assistance contact: www.hyundaiusa.com/loginhelpFor Blue Link information: www.hyundaiusa.com/bluelink",
    "descriptionHTML": "The MyHyundai app makes getting information about your Hyundai vehicle easier than ever. Simply select your vehicle and a world of Car Care information is at your fingertips.<br> <br>The MyHyundai app also allows you to connect to your Blue Link enabled car from your phone. Blue Link technology enables and empowers you while you are on the go, giving you access to your Blue Link features in your office, at home, or just about anywhere.<br><br>Log into the app with your MyHyundai.com ID, Password and PIN to take advantage of Blue Link&#x2019;s remote access features. An active Blue Link subscription is required to use Blue Link features in the app. To renew or upgrade to either Remote or Guidance, please visit MyHyundai.com.<br><br>An active Remote Package (R) or Guidance Package (G) subscription is required to access select features.<br><br>With the Myhyundai app you can:<br>1. Remotely start your vehicle (R)<br>2. Remotely unlock or lock the door (R)<br>3. Remotely activate the horn and lights (R)<br>4. Search and send Points of Interest to your vehicle (G)<br>5. Access saved POI History (G)<br>6. Make a Car Care service appointment<br>7. Access Blue Link Customer Care<br>8. Car Finder (R)<br>9. Access maintenance information and other convenient features.<br>10. Vehicle Status (if equipped) ***Select 2015MY+ vehicles***<br>11. Four widgets for Remote Features, Parking Meter, POI search, and AE EV vehicle<br><br>MyHyundai app now supports Android Wear Smartwatch features. Use voice command or Smartwatch menu to access select features.<br><br>With the Hyundai Blue Link Android Wear App you can:<br>1. Remotely start your vehicle (R)<br>2. Remotely unlock or lock the door (R)<br>3. Remotely activate the horn and lights (R)<br>4. Car Finder (R)<br>5. Call Blue Link (Smartphone)<br>6. Call Roadside (Smartphone)<br><br>*Note: Active Blue Link subscription and Blue Link equipped vehicle with capabilities required.<br><br>For technical assistance contact: www.hyundaiusa.com/loginhelp<br>For Blue Link information: www.hyundaiusa.com/bluelink",
    "histogram": {
        "1": 1096,
        "2": 449,
        "3": 322,
        "4": 383,
        "5": 760
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/iM4Lvb5O5A8GJ96rJFynd7jrLRNtxZ9-0wfwQ_ZEV1eo1CsGB2aRnNcRGzJh4j952uE=h310",
        "//lh3.googleusercontent.com/HP8r7FXwt4C_YSvLyNj-LvxDlw84ZcOwJrh55RwkH8cRSSzB17m_T25Gyv4wDwBK-U4=h310",
        "//lh3.googleusercontent.com/RXthxmz4DA65lJ_NWNUsjEilRsRD9c50Xt-a7XgiqYa01ZlCNvYoQkpTNj2NAN0wSw=h310",
        "//lh3.googleusercontent.com/En-5TQGMIa9b8c5y0_DOXcw4KExLkAObR7V1luAQkzkUVA1PseN9jK9OzvDjerEZ0bU=h310",
        "//lh3.googleusercontent.com/KjI0Jq6nRbgzJdqNADcKhBS8ckDddyzqsrjBMxvAPJIQydyilBeESrTpqp1FZDYLEA=h310",
        "//lh3.googleusercontent.com/U-4YPDenbUE8iocYTUGeZMmDRiUa9TEiSlsXdJ2IwBzC_uKcCyaWqtyvCcdDYU3gYRlU=h310",
        "//lh3.googleusercontent.com/sP47H6OO_YVLPURYrFctFC1JgSpMTILsZsjnq2cS9pis7dTNuVVcavDt3w7t3cowrvY=h310",
        "//lh3.googleusercontent.com/x_GP49Gtp6ws6CLPZKCgYc-Xt9yftD4mGgCbO5MRpRhog9cS1Mp40aA9SRDxi0n62LqR=h310"
    ],
    "comments": [
        "It does precisely what it says on the tin, and then some. There is some lag between sending commands and the car responding, though that is likely due to the time it takes for a command to traverse the network to BlueLink, then make its way out through the network to the car. Smartwatch support was a pleasant surprise, and it works brilliantly. I love being able to remote-start my car from my watch!",
        "Doesn't even let me log in anymore. Checked my subscription, still good. I think I'll just end my subscriptions if this keeps up. UPDATE 3.13.17 It's been three months in the cold winter season I haven't used this app. Reinstalled it again and logs me back in quite smoothly. They need to make this app more reliable.",
        "HELP needed: I have had the app for a few years and loved it until a few months ago. I am encountering issues when trying to use it. I install the app, use it for a few weeks and them I get an error saying \"device invalid\". I them uninstall and reinstall the app and it works fine (for a few days) then I have to do it all over again. This has happened on 2  phones, the Nexus 6P and now the new GOOGLE Pixel 2. Please fix so I can get this back to 5 stars.  When it works:The APP for the parking meter is great downtown. Auto star with temp control works and is great for a hot day at a baseball game and having the car cool before making it to the car after the game.",
        "The features never worked. I let Blue Link know but they never helped to fix it. I wanted to take it in for repair at the dealer but Hyundai was clueless as to how to fix it and wanted me to pay high diagnostic fees even though the car as a whole and the Blue link system were still under warranty. In addition, Blue Link accidentally cancelled my free trial and I would have had to pay a subscription fee to be able to take it to Hyundai for diagnostic. Wasn't worth it given it may have never worked after all that.",
        "Purchased both packages and unable to use BlueLink.  When I call for support I wait at least a 1/2 hour to have a tech answer.  Than, they can't fix and I'm told that it would be 3-5 days for someone to contact me to fix the problem.  Bad customer support.",
        "I had to submit a review since I was a previous hater of this app. I recently upgraded to galaxy s8 and all of a sudden this app works perfect. No more repeated logins, request gets sent immediately. Car starts in 5 seconds versus 40 or more. It might be nougat that fixed app but it works great now!"
    ],
    "recentChanges": [
        "What’s New:",
        "- Bug fixes and enhancements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.stationdm.bluelink&hl=en&gl=us",
    "appId": "com.stationdm.bluelink"
}