{
    "title": "ABC – Live TV & Full Episodes",
    "summary": "Watch live TV and stream full episodes of your favorite shows with the ABC app!",
    "icon": "//lh3.googleusercontent.com/1CHJKQIQzxbpeF_kTMefJJZwIFtmycnUOIv5E-Jkv-AOVJ3zkIZijQBEvYN9Znx-ij2Y=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 3.2,
    "reviews": 48035,
    "developer": "ABC Digital",
    "developerId": "ABC+Digital",
    "developerEmail": "support@abcsupport.zendesk.com",
    "developerWebsite": "http://abc.go.com/faq",
    "developerAddress": "925 4th Ave Seattle WA",
    "updated": "February 20, 2018",
    "version": "Varies with device",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "size": "Varies with device",
    "description": "Watch The Oscars® LIVE SUNDAY at 8e|5p! Don't miss a moment with the ABC live stream* kicking off the night with red carpet arrivals starting at 6:30e | 3:30p.Your ABC shows. On YOUR schedule. Catch the latest episodes of your favorites like The Good Doctor and Scandal, watch TV on-the-go, and stream live events all with the ABC app. LATEST EPISODES* OF HIT ABC SHOWS:The Good DoctorGeneral HospitalGrey’s AnatomyScandalOnce Upon a Timeblack-ish...and many more! BINGE WATCH THROWBACKS - NO SIGN IN REQUIREDEnjoy full seasons of classic ABC shows like:Body of ProofArmy WivesBrothers & SistersUgly BettyFelicity...and dozens more! WATCH FROM ANYWHEREWhether you’re on the treadmill or on the train, stream your favorite shows and enjoy live TV** right from your device. Download and start watching today from a supported Android device. COMMENTS OR QUESTIONS?Please contact us at http://abc.com/feedback or through the feedback form in the app. For more information visit: http://abc.go.com/faq. * The most recent full episodes require a participating TV provider account. Show and episode availability are subject to change.** The ABC TV live stream is available with a participating TV provider in Chicago, Fresno, Houston, Los Angeles, New York City, Philadelphia, Raleigh-Durham and San Francisco. Customers with a DirecTV subscription in the following markets will also be able to watch the ABC live stream: Albuquerque, Boston, Ft. Smith/Fayetteville, Jackson (Mississippi), Kansas City, Milwaukee, Monterey-Salinas, Oklahoma City, Omaha, Pittsburgh, Portland-Auburn (Maine), Savannah and West Palm Beach. Before you download this app, please consider that this app includes advertising for some third parties, as well as advertising for The Walt Disney Family of Companies, and may include advertising targeted to your interests. You may choose to control targeted advertising within our applications by using your Android device settings (for example, by re-setting your device’s advertising identifier and/or opting out of interest based ads). Before you download this experience, please consider that this app contains• social media links to connect with others• location-based services• advertising for some third parties• as well as advertising for The Walt Disney Family of Companies Please note: This app features Nielsen’s proprietary measurement software, which will allow you to contribute to market research, like Nielsen’s TV Ratings. Terms of Use: http://abc.com/termsPrivacy Policy: http://abc.com/privacyChildren’s Privacy Policy: https://disneyprivacycenter.com/kids-privacy-policy",
    "descriptionHTML": "Watch The Oscars&#xAE; LIVE SUNDAY at 8e|5p! Don&apos;t miss a moment with the ABC live stream* kicking off the night with red carpet arrivals starting at 6:30e | 3:30p.<br><br>Your ABC shows. On YOUR schedule. Catch the latest episodes of your favorites like The Good Doctor and Scandal, watch TV on-the-go, and stream live events all with the ABC app.<br> <br>LATEST EPISODES* OF HIT ABC SHOWS:<br>The Good Doctor<br>General Hospital<br>Grey&#x2019;s Anatomy<br>Scandal<br>Once Upon a Time<br>black-ish<br>...and many more!<br> <br>BINGE WATCH THROWBACKS - NO SIGN IN REQUIRED<br>Enjoy full seasons of classic ABC shows like:<br>Body of Proof<br>Army Wives<br>Brothers &amp; Sisters<br>Ugly Betty<br>Felicity<br>...and dozens more!<br> <br>WATCH FROM ANYWHERE<br>Whether you&#x2019;re on the treadmill or on the train, stream your favorite shows and enjoy live TV** right from your device.<br> <br>Download and start watching today from a supported Android device.<br> <br>COMMENTS OR QUESTIONS?<br>Please contact us at http://abc.com/feedback or through the feedback form in the app. For more information visit: http://abc.go.com/faq.<br> <br>* The most recent full episodes require a participating TV provider account. Show and episode availability are subject to change.<br>** The ABC TV live stream is available with a participating TV provider in Chicago, Fresno, Houston, Los Angeles, New York City, Philadelphia, Raleigh-Durham and San Francisco. Customers with a DirecTV subscription in the following markets will also be able to watch the ABC live stream: Albuquerque, Boston, Ft. Smith/Fayetteville, Jackson (Mississippi), Kansas City, Milwaukee, Monterey-Salinas, Oklahoma City, Omaha, Pittsburgh, Portland-Auburn (Maine), Savannah and West Palm Beach.<br> <br>Before you download this app, please consider that this app includes advertising for some third parties, as well as advertising for The Walt Disney Family of Companies, and may include advertising targeted to your interests. You may choose to control targeted advertising within our applications by using your Android device settings (for example, by re-setting your device&#x2019;s advertising identifier and/or opting out of interest based ads).<br> <br>Before you download this experience, please consider that this app contains<br>&#x2022; social media links to connect with others<br>&#x2022; location-based services<br>&#x2022; advertising for some third parties<br>&#x2022; as well as advertising for The Walt Disney Family of Companies<br> <br>Please note: This app features Nielsen&#x2019;s proprietary measurement software, which will allow you to contribute to market research, like Nielsen&#x2019;s TV Ratings.<br> <br>Terms of Use: http://abc.com/terms<br>Privacy Policy: http://abc.com/privacy<br>Children&#x2019;s Privacy Policy: https://disneyprivacycenter.com/kids-privacy-policy",
    "histogram": {
        "1": 15876,
        "2": 3436,
        "3": 3831,
        "4": 5892,
        "5": 19000
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/X1wX3d48BGrKyW5kxMRBq72D39_-dyk4o3Atmn1SuvwN97NW41jOEdYPNsS1X3AYiQ=h310",
        "//lh3.googleusercontent.com/PpbqrtZqcr9zv5rgljb5v5SoEwtzQ46AXoIb9S0ihS-66Ipa4OowWrt2h9pibz8xuIK5=h310",
        "//lh3.googleusercontent.com/G4Yo6enlDUkn_UBdAikHAtIx-V9UnuO7hsupDGKyS_kK3U8p-SSpBwYS2hLgRrb8_8E=h310",
        "//lh3.googleusercontent.com/RXpgkxnMm2YYjz0lsT6uRPsEdS-o8Q_guR_z9Jn-bnOwXlRpzDHAkuhbZXeJO2z4gXdl=h310",
        "//lh3.googleusercontent.com/hUPej7lLLNl9ZyXB6LE28F2OzImM0oK6CHpMrhUpTfSM7DJ1medtFF7CT80Fl7_KysQ=h310",
        "//lh3.googleusercontent.com/Or4Etyj4616aMVPaPyu_7TI4zqiDJdHSISP66AmFsdWd1a-ZuU3rm3kbk6WDbEzdeQ=h310",
        "//lh3.googleusercontent.com/H8E8FbIJ-nfaj6rJ-E1EnjJJgLr2KQHpVlAHGE2slZupSQD1et5XvsRW9NHBTLFZ9g=h310",
        "//lh3.googleusercontent.com/2-EZMkX3KhZagvrySNqJMuWqpbzziZ8VipZqWxxnZHzwpBFxeZoq6BOCe4--2PKHdDQ=h310",
        "//lh3.googleusercontent.com/81JEKFOvEsM1O2pCKxdMjuLU4EkJRWpMQi7ZuHeXqbo5Hnnvp2cIsoJcrD2svT0vOw=h310",
        "//lh3.googleusercontent.com/xZgcQS59CguhLUyEDBzk8F12IJMZPxTED_R080Jk2o8j1KNTnuYhJ0ZdolQW_pno0OE=h310"
    ],
    "comments": [
        "It astounds me that such a large great network can't seem to get the coding right to play their ads. I completely understand the need for ads and am more than willing to watch them but when it takes me 2 hours to watch a 1 hour program because it keeps freezing when the ads start...unacceptable. Ads are how you get paid if you get anything right don't you think that should be it",
        "ITS REALLY irritating when your watching a show and the app decides it wants to show an ad and then go to that ads site and not resume whatever it was you were watching! most the time i have to restart the app and then wherever i was in the episode i cant go to it, either i start from the beginning or its a pain to do but try n find your closest spot manually.",
        "So i haven't fully reviewed the app but just downloading this and trying to watch one show is ridiculous.  There are so many adds in between which wouldn't be as much of a big deal if they didn't keep freezing.  I can't even make it halfway through one episode without the adds freezing it up 100 times and having to restart it.",
        "Not only are there absurd amounts of ads, but half the time the ads glitch and you have to close out of the app and rewatch all the ads (minutes worth) only for the last ad to glitch again. I'd rather just stop watching ABC shows than go through that anymore.",
        "Still isn't meeting the bar.  I don't mind the ads, but the app freezes everytime the ads come on.  Ive sat through 30 ads to get past one section.  It's frustrating.   I'll watch the 6 ads required, as long as they work, don't freeze and you get back to the show after.  After all these years of issues, you think it would have been worked through by now.  Response- the app is fully updated and I'm still having issues",
        "I spent 90% of the time sitting through ads and a lot of lagging. I was desperate to watch a certain show, but it's ridiculous how awful this app is.  I'll be uninstalling as soon as I finish writing this review.  Don't waste your time unless you're very, very, VERY patient. Also the viewing was blurry, I wanna say...95% of the time.  It needs A LOT of work."
    ],
    "recentChanges": [
        "Continuous improvements so you can easily watch your favorites!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.disney.datg.videoplatforms.android.abc&hl=en&gl=us",
    "appId": "com.disney.datg.videoplatforms.android.abc"
}