{
    "title": "GolfNow – Book Golf Tee Times",
    "summary": "Search for golf courses and find the best tee time at more than 6,000 courses",
    "icon": "//lh5.ggpht.com/bRDHjkLIgrsUVypI15HQID7kDwbjCiMxufflP-g1yatrevpzlkfyL4-Jq3aBKieaxV0Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 24126,
    "developer": "GolfNow - Mobile Development Team",
    "developerId": "GolfNow+-+Mobile+Development+Team",
    "developerEmail": "golfnowmobile@gmail.com",
    "developerWebsite": "http://www.golfnow.com",
    "developerAddress": "7580 Golf Channel Drive\nOrlando, Florida 32819",
    "updated": "December 12, 2017",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "The official GolfNow Mobile App is the best way to book a tee time, utilize GPS golf course layouts, keep score for your group and get analysis of your golf game after each round, plus it's FREE to download.Easily search for golf courses, find the best tee time rates at more than 6,000 courses, golf clubs and resorts in the U.S. or internationally and sign up to become a GolfNow VIP with the new-and-improved, FREE GolfNow mobile app.GolfNow’s mobile app includes GPS layouts and rangefinder for more than 30,000 golf courses, convenient scorekeeping while you play, post-game analysis features and more are now free for everyone.Plus, introducing the all-new GolfNow VIP annual membership, featuring waived convenience fees, 25% more Rewards points and more. Join today for just $99 a year. •\tApp features include: •\tFind the best rate and book tee times 24/7 at more than 6,000 golf courses worldwide•\tEasily search Hot Deals tee times near you for incredible savings and discounts and the best rate on each tee time (Save up to 80%)•\tEnhanced search capabilities let golfers find tee times and make tee time reservations near cities, landmarks and more•\tNo calling or waiting - book instantly anytime, anywhere•\tAutomatically earn points toward GolfNow Rewards with every player in every round •\tGolfNow's new VIP membership offers waived convenience fees and exclusive benefits for VIP members•\tUse your device GPS or search by area to quickly find golf courses near home or on the road•\tSave your credit card info for secure, easy, convenient booking at the tap of a finger•\tGet directions to the golf course near you using the GolfNow map view•\tChoose the right golf club with accurate distance yardages and GPS tracking at more than 30,000 courses•\tKeep score for each player in your foursome with several game play formats•\tPost-round analysis and in-depth statistics to improve your game and track your handicap",
    "descriptionHTML": "The official GolfNow Mobile App is the best way to book a tee time, utilize GPS golf course layouts, keep score for your group and get analysis of your golf game after each round, plus it&apos;s FREE to download.<br><br>Easily search for golf courses, find the best tee time rates at more than 6,000 courses, golf clubs and resorts in the U.S. or internationally and sign up to become a GolfNow VIP with the new-and-improved, FREE GolfNow mobile app.<br><br>GolfNow&#x2019;s mobile app includes GPS layouts and rangefinder for more than 30,000 golf courses, convenient scorekeeping while you play, post-game analysis features and more are now free for everyone.<br><br>Plus, introducing the all-new GolfNow VIP annual membership, featuring waived convenience fees, 25% more Rewards points and more. Join today for just $99 a year.<br> <br>&#x2022;\tApp features include: <br>&#x2022;\tFind the best rate and book tee times 24/7 at more than 6,000 golf courses worldwide<br>&#x2022;\tEasily search Hot Deals tee times near you for incredible savings and discounts and the best rate on each tee time (Save up to 80%)<br>&#x2022;\tEnhanced search capabilities let golfers find tee times and make tee time reservations near cities, landmarks and more<br>&#x2022;\tNo calling or waiting - book instantly anytime, anywhere<br>&#x2022;\tAutomatically earn points toward GolfNow Rewards with every player in every round <br>&#x2022;\tGolfNow&apos;s new VIP membership offers waived convenience fees and exclusive benefits for VIP members<br>&#x2022;\tUse your device GPS or search by area to quickly find golf courses near home or on the road<br>&#x2022;\tSave your credit card info for secure, easy, convenient booking at the tap of a finger<br>&#x2022;\tGet directions to the golf course near you using the GolfNow map view<br>&#x2022;\tChoose the right golf club with accurate distance yardages and GPS tracking at more than 30,000 courses<br>&#x2022;\tKeep score for each player in your foursome with several game play formats<br>&#x2022;\tPost-round analysis and in-depth statistics to improve your game and track your handicap",
    "histogram": {
        "1": 977,
        "2": 397,
        "3": 935,
        "4": 6038,
        "5": 15779
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/T91NXJBtCRh2-btx0ZEanhBVjHvlLuZpaobbciWaq87paIY1i9e05a6IwDQ2MytuwNM=h310",
        "//lh3.googleusercontent.com/x0y065nka7XXoA5AWdvgcfz4DPIKdCVN0Hz8NtyIuAsW-vYXhLtACfs6saHIC2zwymk=h310",
        "//lh3.googleusercontent.com/e2JK2YhKmvaYLycQeIBBjjrGDoHNThcPjafC2R5P2WFFUQ8lD6XQEpmNJRx7kViDGg=h310",
        "//lh3.googleusercontent.com/WJDOwHWGSQSm8sdhQN5MPX7RoNRQoxZKcXi7Fk1A-RXzZeBsrkUAJa5uCAChjmMZC28=h310",
        "//lh3.googleusercontent.com/Ra8KBQWayrhQDrnY6nnvwqOOxqlIxO-HsvqaITghKuJnpIucmn7nM3v3ZKXQjZQasQ=h310",
        "//lh3.googleusercontent.com/GNg2IfSQUL1KIHFSeDe1CtBOUBDjKItgmPWmIeWFDBtM2jDtxjkQM5WR8McLpyFiK1M=h310",
        "//lh3.googleusercontent.com/E7El0fx-uiBU4AV2UI8JLB-EY0nOO5lXO027NQbEtcRCoEedTQCaSerUPe-2u-8xUYM=h310",
        "//lh3.googleusercontent.com/temW0HkpoG3KHjWrGVpNg9_eH0BkO7pZ52App4zz7GdVMr3hbGwlzYv9Wv0oefYW-A=h310",
        "//lh3.googleusercontent.com/qBifSuYKx3YRo-EvNmO1YARAXrAZUry-TWxuQ-xAL51b0zeA1rr5RaaIoaX06hLjyQY=h310",
        "//lh3.googleusercontent.com/_n6cbUbUTfNPckm9jmCsyJdh3gTE217tjHdCOkGagrQa-wkMJP2leiuw6LNOJdQuYNe-=h310",
        "//lh3.googleusercontent.com/QrQFq8qI2MM78VcsrcnshSTb2HDN-UbICb4Gw4aEYHZ4eJlKkWQNX_kQyArrPtjbY4I=h310",
        "//lh3.googleusercontent.com/-v9HlEWAJyT8twWH9p365_YJgkVm6JwXfOMc6lj2AaGn4q5-zoZyqBtdJpzc1Ss9IQ=h310",
        "//lh3.googleusercontent.com/1IgTiaHDW6ckDFuKjTPbsqG3zPMIB2Bi2iMG3PhfD6hOfLOsHH7zGZPMLp7LPGkGLd0=h310",
        "//lh3.googleusercontent.com/M2P0kOOvgQcAzq5dGlxDzyRDwE8exLvh5BpIvw0d7gLSUUWdUHnPdivkQ_HgU2EBRmfZ=h310",
        "//lh3.googleusercontent.com/7wHCS9zfDXiWO28cWCBJy4BIFEAB7krHElNmUuJYKe-18-FwRAT9NLhSXvR5sTsolpw=h310",
        "//lh3.googleusercontent.com/3fjR8ylbYmFEYYGHZLlhnhmTheE01vSlb9LeJ_GFivhZoxrDC9Kh7KZhDFgCCw9BalQ=h310",
        "//lh3.googleusercontent.com/7-yMmkYFUDlkvrKrVwY4LzLVrGUKfSvNlXfbuOUDXQSlV0qjvUFoH4QSiRaV2heELw=h310",
        "//lh3.googleusercontent.com/5sPKql-BVS-c0E6JvyqqkKrY2ctOryxBLN-gdyHYCm-XSy0xFsOB1TvFgUNAl-zwbiIm=h310",
        "//lh3.googleusercontent.com/YHhsgPIRKg3r2iK7zg7rYJFvwaIEdR5YamaQ7otDpOn2mOg0SSuZKuUAIHG63YddOw=h310",
        "//lh3.googleusercontent.com/KMKInXWqtH4k2BNn5zdVZcb0x-kVQEhdfL3Bk-ktvI9BepiHcz_jUzxQNTNU1QNLXA=h310",
        "//lh3.googleusercontent.com/ipdqit5PWnrEjKF54nJdxdOoi2SnjOQRAZ5MOz1OzXTqgqHqvATgDoz5qeUlEJ_OsQ8=h310",
        "//lh3.googleusercontent.com/fWO8gkqc-yYlDySa9ijhGvUI2KVu9H56_0PwfAscefZJ9J3R-JvaHXrKb8AXmSUcueo=h310",
        "//lh3.googleusercontent.com/i2Ga3ZAI6F_tBltpIuLswnQcoH92Wp8Z9d1B_yL5dHBbGokzj5c7WkPuIISvrJB-DlY=h310",
        "//lh3.googleusercontent.com/hVRX-VH54egLN-XFiZQylRAmnTMq6Sz2dvjeNDUXm0I-fngKC4PIJbK54uXTSz55BzE=h310"
    ],
    "comments": [
        "My only issue with this app is that I can't get my promo codes from the app. I can see how many rewards I have accrued but have to log into my account from a PC to actually retrieve the codes to use. I also don't like the fact that you have to book a rewards tee time 3 days in advance as I often decide to play a round last minute. Other than that I like the interface etc. so I gave it 4 stars.",
        "What happened to the GOLF BIDS APP ?  I guess it was shut down, bad idea. GOLF NOW fees and pricing are never the real price. I have been called a few times by their call center saying sorry the tee time you booked was taken. I have had enough of GN and their other apps. I will use a few other apps that have not been sucked up by GN.. Stay away from all GOLF NOW apps.  1/1/2018",
        "Downloaded app and rec'd a very nice price quote, went thru all the steps to finalize booking and was told the low rate was no longer available. Seems like a scam to me, a little bait and switch.",
        "It used to work great. Now it stinks, and so does their customer service! I get an error any time I try to book. I've uninstalled and reinstalled but it still doesn't work. I reported it to them 3 times and have been ignored. Totally unacceptable!",
        "I had an account through Amazon and I went to log in and it wouldn't allow it and then that whole feature disappeared. And then I received some type of message saying if I buy one hot deal today I would get 3 free and I look in mind rewards and I have 0 points and I don't even have a way to contact their system for help",
        "Every freaking day when I finish a round of golf, I go to GolfNow, and book the next day's golf. ALL the best courses...I never leave home without this app. Shame on you if your are paying full price. I became a VIP member."
    ],
    "recentChanges": [
        "Bug fixes and performance enhancements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.golfnow.android.teetimes&hl=en&gl=us",
    "appId": "com.golfnow.android.teetimes"
}