{
    "title": "Voice Recorder",
    "summary": "Record voice memos, vocals, talks, music and songs in high quality",
    "icon": "//lh3.googleusercontent.com/x3foA5WvWf1kVpazd5w8sjRiNCT_zj5KlEF_kDX_Ez_6kagrFcWUSt_5NCU9yGQOS04=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 3.9,
    "reviews": 4714,
    "developer": "Smart Mobi Tools",
    "developerId": "9057099465402833906",
    "developerEmail": "jakub.first@gmail.com",
    "developerWebsite": "http://mobileboostapp.com/recorder/",
    "developerAddress": "Dębowa 3\n32-641 Przeciszów",
    "updated": "February 23, 2018",
    "version": "2.6.0",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Voice Recorder is a one of best audio recorders in Google Play with over half a million users and thousand positive feedbacks. Mostly known as professional, easy voice and call recorder for Android devices. Use it for record voice memos, talks, music and songs in high quality. Designed for everybody, especially students, journalists and musicians. Audio recorder also supports call recording and external bluetooth microphone. Tags can be easily added to any part of the recording. Voice recorder recording quality is limited by the quality device's microphone. Fully compatible with Android Wear devices. Group recordingGroup all your vocal recordings into defined categories. Mark your favourite talks and memos. Place recording tags, choose colors and icons.High quality recorderWith two simple taps configure all recording options. Choose your sample rate. Enable stereo recorder and silence remover. Use Android’s built-in effects to remove noise, cancel echo and control gain. Record your voice from external bluetooth microphone or one of built-in microphones.Wireless TransferUse Wi-Fi transfer to export data to your computer fast and easy without any additional software. Just make sure that you are connected to the same network and you can start transferring.Google Drive IntegrationWith integrated google drive module your audio recordings will be automatically synced with your drive account. It allows you access from all your devices. You can use it to create extra copies of data in case the original is lost or damaged.All Features: - Android Wear support - Smooth playback - Wifi voice memos transferring - Display content from Google Drive - Export to and import from Google Drive and DropBox - Bluetooth recording - Android App Shortcuts support - Support stereo recording - Recording in background - Integration with widget - Silence skip, gain reduction, echo cancelerIf there are any problems, please contact me via e mail.Feel free to leave a review",
    "descriptionHTML": "Voice Recorder is a one of best audio recorders in Google Play with over half a million users and thousand positive feedbacks. Mostly known as professional, easy voice and call recorder for Android devices. Use it for record voice memos, talks, music and songs in high quality. Designed for everybody, especially students, journalists and musicians. Audio recorder also supports call recording and external bluetooth microphone. Tags can be easily added to any part of the recording. Voice recorder recording quality is limited by the quality device&apos;s microphone. Fully compatible with Android Wear devices. <br><br><b>Group recording</b><br>Group all your vocal recordings into defined categories. Mark your favourite talks and memos. Place recording tags, choose colors and icons.<br><br><b>High quality recorder</b><br>With two simple taps configure all recording options. Choose your sample rate. Enable stereo recorder and silence remover. Use Android&#x2019;s built-in effects to remove noise, cancel echo and control gain. Record your voice from external bluetooth microphone or one of built-in microphones.<br><br><b>Wireless Transfer</b><br>Use Wi-Fi transfer to export data to your computer fast and easy without any additional software. Just make sure that you are connected to the same network and you can start transferring.<br><br><b>Google Drive Integration</b><br>With integrated google drive module your audio recordings will be automatically synced with your drive account. It allows you access from all your devices. You can use it to create extra copies of data in case the original is lost or damaged.<br><br><b>All Features:</b><br> - Android Wear support<br> - Smooth playback<br> - Wifi voice memos transferring<br> - Display content from Google Drive<br> - Export to and import from Google Drive and DropBox<br> - Bluetooth recording<br> - Android App Shortcuts support<br> - Support stereo recording<br> - Recording in background<br> - Integration with widget<br> - Silence skip, gain reduction, echo canceler<br><br>If there are any problems, please contact me via e mail.<br>Feel free to leave a review",
    "histogram": {
        "1": 629,
        "2": 290,
        "3": 536,
        "4": 928,
        "5": 2331
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/SE8IdmmfFvrBZ-WPyjevUu4nUZVbdH99E4horY1Qqbystd9FXy8aHaq5VNLNXqJlMUM=h310",
        "//lh3.googleusercontent.com/8YsD_U5DkhuHprLuNRB5txmGl7RWKd3KA1JLdsKHD-bTs3RtrPG-pLTI_19Z7UK7-Z3O=h310",
        "//lh3.googleusercontent.com/eLJylsV0nbEag6oK5wtV4hIZk774EiBbRBqxmqZq68EywQNjk63VN8c4gPPk9LwjU-w=h310",
        "//lh3.googleusercontent.com/rVqjpn11Sca-fzzTecbysO99G91YPy0oDgJkZd9QSoC4uk3IvkQI8SzwwVO5gX6q1jI=h310",
        "//lh3.googleusercontent.com/ucoQjihF2ul2PvBYqbaAnYIxU5Ho1O9Frd_pp5-gEHmD77fS95UspYxQFqrY37Dgp6U=h310",
        "//lh3.googleusercontent.com/py6abGB9VacTMSiAZ_1TUc66e9VvwNyyKx4EfgR1SMO8-Hcsuh6zm8KtG3ZfSVyTCWUB=h310"
    ],
    "comments": [
        "Does what i need it to do!",
        "Lovely aap",
        "Love it",
        "This app deleted all my recordings without letting me know two times now. Always waits a couple months when I have alot of good recordings. Never backed up my files to my drive even when the selection was on",
        "I'm getting a notification that says \"this app consumes too much battery\" during recording and than crushes and no record in the record list....",
        "The update made it much more intuitive and I really like how clean the UI is. All the functions are good.!"
    ],
    "recentChanges": [
        "Thanks for using Voice Recorder. We update app regularly so we can make it better. To make sure you don't miss a thing, just keep your Updates turned on.",
        "- Cut feature is now available after watching video",
        "- Now you can include location to your recordings",
        "- Long press on recording display quick actions",
        "- Performance improvements",
        "- Improvements for Android 8.0 Oreo devices",
        "- Added new category icons",
        "- Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.first75.voicerecorder2&hl=en&gl=us",
    "appId": "com.first75.voicerecorder2"
}