{
    "title": "Chaos Control Premium - GTD Task Lists & Calendar",
    "summary": "Manage your personal goals, tasks and To-Do lists using the proven GTD method",
    "icon": "//lh3.googleusercontent.com/0Rv34CjP15QGflnJszjzuzMhEB6eVBNHDlLE91MlhKMhWrD99HzjcuvlereUOIDMwA=w300",
    "price": "$4.99",
    "free": false,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.5,
    "reviews": 949,
    "developer": "Chaos Control",
    "developerId": "7602978102231839745",
    "developerEmail": "cc@tarasov-mobile.com",
    "developerWebsite": "http://chaos-control.mobi/",
    "developerAddress": "143989, Russia, Moscowskaya oblast, Zheleznodorogniy, Granichnaya st., 20",
    "updated": "February 1, 2017",
    "version": "1.8",
    "genre": "Business",
    "genreId": "BUSINESS",
    "description": "Chaos Control Premium was created to help you manage your goals, to-do lists and tasks in both your business and personal life. People don't usually achieve impressive results simply by being good at task management. It's the ability to set legitimate goals that makes the difference. Just write down your desired outcomes to make them real. This simple technique helps you to prioritize your goals before acting on them. Chaos Control is a task manager based on the best ideas of GTD (Getting Things Done) methodology created by David Allen. Whether you are running a business, launching an app, working on a project or simply planning your holiday trip, Chaos Control is a perfect tool to manage your goals, juggle your priorities, and organize your tasks to get things done. And the best part is, you can handle both heavyweight project planning and simple daily routine like shopping list management in one flexible app. Also, Chaos Control is available across all major mobile and desktop platforms with seamless sync. HERE IS HOW IT WORKS: 1) MANAGE YOUR PROJECTSProject is a goal combined with a set of tasks you need to complete in order to achieve it. Create as many projects as you like to write down all the desired outcomes you have 2) ORGANIZE YOUR GOALSCreate unlimited number of projects and group them by category using Folders 3) USE GTD CONTEXTSOrganize tasks from different projects using flexible context lists. If you are familiar with GTD you would just love this feature 4) PLAN YOUR DAYSet due dates for tasks and make plans for any particular day 5) USE CHAOS BOXPut all the incoming tasks, notes and ideas into Chaos Box in order to process them later. It works similar to GTD inbox, but you can use it as a simple to-do list 6) SYNC YOUR DATAChaos Control works on both desktop and mobile devices. Setup an account and sync your projects across all of your devices This app is designed with creative people in mind. Designers, writers, developers, startup founders, entrepreneurs of all kinds and pretty much anyone with ideas and desire to make them happen. We combined the power of GTD with the convenient interface to help you with:☆ personal goal setting☆ task management☆ time management☆ planning your business and personal activities☆ building your routine☆ handling simple to do lists, checklists and shopping lists☆ catching your ideas and thoughts to process them later KEY FEATURES☆ Seamless cloud sync across all major mobile and desktop platforms☆ GTD-inspired Projects and Contexts supplemented with Folders, sub-folders and sub-contexts☆ Recurring tasks (daily, weekly, monthly and chosen days of the week)☆ Chaos Box - Inbox for your unstructured tasks, notes, memos, ideas and thoughts. Great tool for staying on track inspired by GTD ideas☆ Notes for tasks, projects, folders and contexts☆ Fast and smart searchPREMIUM FEATURES:★ Seamless sync across all your devices running pretty much any major mobile or desktop platform★ Cloud data backup★ Recurring tasks for managing activities that happen regularly★ Nested folders and contexts for better projects and tasks structuring★ App pin-code: secure your data with a secure passcodeHave a productive day!",
    "descriptionHTML": "Chaos Control Premium was created to help you manage your goals, to-do lists and tasks in both your business and personal life.<br> <br>People don&apos;t usually achieve impressive results simply by being good at task management. It&apos;s the ability to set legitimate goals that makes the difference. Just write down your desired outcomes to make them real. This simple technique helps you to prioritize your goals before acting on them.<br> <br>Chaos Control is a task manager based on the best ideas of <b>GTD (Getting Things Done)</b> methodology created by David Allen. Whether you are running a business, launching an app, working on a project or simply planning your holiday trip, Chaos Control is a perfect tool to manage your goals, juggle your priorities, and organize your tasks to get things done. And the best part is, you can handle both heavyweight project planning and simple daily routine like shopping list management in one flexible app. Also, Chaos Control is available across all major mobile and desktop platforms with seamless sync.<br> <br><b>HERE IS HOW IT WORKS:</b><br> <br><b>1) MANAGE YOUR PROJECTS</b><br>Project is a goal combined with a set of tasks you need to complete in order to achieve it. Create as many projects as you like to write down all the desired outcomes you have<br> <br><b>2) ORGANIZE YOUR GOALS</b><br>Create unlimited number of projects and group them by category using Folders<br> <br><b>3) USE GTD CONTEXTS</b><br>Organize tasks from different projects using flexible context lists. If you are familiar with GTD you would just love this feature<br> <br><b>4) PLAN YOUR DAY</b><br>Set due dates for tasks and make plans for any particular day<br> <br><b>5) USE CHAOS BOX</b><br>Put all the incoming tasks, notes and ideas into Chaos Box in order to process them later. It works similar to GTD inbox, but you can use it as a simple to-do list<br> <br><b>6) SYNC YOUR DATA</b><br>Chaos Control works on both desktop and mobile devices. Setup an account and sync your projects across all of your devices<br> <br>This app is designed with creative people in mind. Designers, writers, developers, startup founders, entrepreneurs of all kinds and pretty much anyone with ideas and desire to make them happen. We combined the power of GTD with the convenient interface to help you with:<br>&#x2606; personal goal setting<br>&#x2606; task management<br>&#x2606; time management<br>&#x2606; planning your business and personal activities<br>&#x2606; building your routine<br>&#x2606; handling simple to do lists, checklists and shopping lists<br>&#x2606; catching your ideas and thoughts to process them later<br> <br><b>KEY FEATURES</b><br>&#x2606; Seamless cloud sync across all major mobile and desktop platforms<br>&#x2606; GTD-inspired Projects and Contexts supplemented with Folders, sub-folders and sub-contexts<br>&#x2606; Recurring tasks (daily, weekly, monthly and chosen days of the week)<br>&#x2606; Chaos Box - Inbox for your unstructured tasks, notes, memos, ideas and thoughts. Great tool for staying on track inspired by GTD ideas<br>&#x2606; Notes for tasks, projects, folders and contexts<br>&#x2606; Fast and smart search<br><br><strong>PREMIUM FEATURES:</strong><br>&#x2605; Seamless sync across all your devices running pretty much any major mobile or desktop platform<br>&#x2605; Cloud data backup<br>&#x2605; Recurring tasks for managing activities that happen regularly<br>&#x2605; Nested folders and contexts for better projects and tasks structuring<br>&#x2605; App pin-code: secure your data with a secure passcode<br><br>Have a productive day!",
    "histogram": {
        "1": 21,
        "2": 21,
        "3": 45,
        "4": 209,
        "5": 653
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Aey4i_77mPltiIML8IdsM8PD45yV7MaXEvqCBooWJqIEXfRIT8MDUvixwktPJwKi5JU=h310",
        "//lh3.googleusercontent.com/je5meuFz3I6v2-EFDR7cPjC8zPkOe4tMTlHIVyax4nSwTjLx5-dCvz2rBVjW_WdijjQ=h310",
        "//lh3.googleusercontent.com/2K62o-OMWvMXrzWlQpG0oNt8qBE8N57tz1rHP9pmR5XOm38BbcCdtIaNKtYP7Uhoqpc=h310",
        "//lh3.googleusercontent.com/TX0N38HTASNr6JtBltpngyX-8o9j15H2OfkignKf4zQSBh1hE99wsbc_5jM4SPX5joI=h310",
        "//lh3.googleusercontent.com/_cCUXUlFy67zcAnOI4vUia7pQs_IiZfdalmW1G1pcorkfLCQ46WOwksVATKhSaHUbg=h310",
        "//lh3.googleusercontent.com/ly96jPQyGGuMZx8N-pE34JE1uWky7nfRkYPg6MwA6hJ1V3NtL-3dW5Vl00pFTjqf3pE=h310",
        "//lh3.googleusercontent.com/52BVCITEXsb9sCxohhC-Saf4zboPUMreOZl3vRDmsA2lE94keybmyClcbA_mcTmyu6U=h310",
        "//lh3.googleusercontent.com/GEqWrhqjVcBMy5QRlm0z9ESn6JbNHMXr4QQDvaXpUHQHl99HBYig3ozHi8-nJZTrbiE=h310",
        "//lh3.googleusercontent.com/nsh0gF1u06RNMM-fuQtT7NPVY1Nbo-9dr_DCsTC948HLAyrTUjm9Qpg1BL6lF7y-Jg=h310",
        "//lh3.googleusercontent.com/n6OmwwjW9hOrc1jJgwtTM2piyeieEHPjks6s0lPmx-zOodBG9WQ5M6xJ8Lo-ThRUmWY=h310",
        "//lh3.googleusercontent.com/zHYwP7Oa--EeT3odbdwcqKxyKwABZkFH4yJU8b3j132056nkN_rM22maWX78P9U597Q=h310",
        "//lh3.googleusercontent.com/yBijreAojSzjI7CwDXuRXALOPV2H_Kat1UaxCydeS2zxQAwlM2jgiXAcyya5uxjQ2i0=h310",
        "//lh3.googleusercontent.com/ThmO2ZeEDwmvKl_BwKoc-oeC7yXIbvrTb42Fngt1Gb0cmgIbfueZ0WvgvUXP5RjNQlI=h310",
        "//lh3.googleusercontent.com/NoCQ2XkO2M2bdi73Kk_04sAnHIR59DEABurGqXig2Qdz6eaa9qD8xoh2ZF5KPV9JIyI=h310",
        "//lh3.googleusercontent.com/d9e-X_hE-9PGThOgVVRhFlG1f4mgLEE-_osUL7vLkn-UtEmrAEV1Vjn1YazdtsECVAI=h310",
        "//lh3.googleusercontent.com/fjr0FYch5z0Yql0RVyLuBNlPrXusvfJDQVKoo5m2rP4ZWRTiKTFvyafmAYCWSoAUsA=h310",
        "//lh3.googleusercontent.com/2jbR8tKnKKx6e572CvuJBppZ59sDjd-Nnnvy1J10ljpV2bcotfYgrPlpr18-10WWJUE=h310",
        "//lh3.googleusercontent.com/Tf_NCD3mI_vepBQ5sdMhBIgvWqeuxH3nNM9EF_UP_UX1OUXH0yctLpp4MBukd4I0Ew=h310",
        "//lh3.googleusercontent.com/LRykhLlrnbZvT4yPaNKkE0CBpGd7Qdbb582LcMtAFz_bxBPCxJ4aPgYF42ESg-FIrg=h310",
        "//lh3.googleusercontent.com/ZsYUFPiIeKMBvmjaRPcJvWhLGB4X5iGbgp51755ytoYZGGBrr5KIw22VAcUoSRNpJCo=h310",
        "//lh3.googleusercontent.com/qDDyv5EJ0gvTMUOppksLxIBilpwQO6jrlfLhMFg_rjcIfxdNlOfnZSSeOgLDW7IRld_B=h310",
        "//lh3.googleusercontent.com/p2jbX3iw14sHY8J06HclA9-z0u4EIuFRM5DScBuLqcS0QrdVHOpXAefPYUS9KH0gZ0YZ=h310",
        "//lh3.googleusercontent.com/MomWRhxvvjfCS6vsu54SHkpe2HyBXGWIKeB2omykHTjCUKMXJAkr0GqAzlGkzAgizaM=h310",
        "//lh3.googleusercontent.com/QkwmAsJltP1lilQGw8_3ip3mUwQjP2-i479-949OYH-zjdNBLsa6vz0uhov08Vx3kHeV=h310"
    ],
    "video": "https://www.youtube.com/embed/IxkGeNxO-pw",
    "comments": [
        "This is not even close to GTD. Just well-made TODO list. No next action. No delegation. Can't convert an action item to project. Project is not a category, it is some actions which can be broken to small actions. You need to benchmark Everytask app. It is very old app and not user friendly UX, but it has every thing about gtd.",
        "So far so good. A few minor quirks/bugs, but nothing serious. I'm sure it will only get better with time.",
        "Great for managing your projects etc. I have all the versions would be great uf you could sync with ms outlook tasks and calendar, without exchange of course keep updating it with features will only get better cheers",
        "Works great, but there are 2 things I love about this app and make it my favourite: First is that you can use the same app on all your Android, Ios and Windows devices and the sync is instant and second there is a great customer support available.",
        "Task reminder is not working.. i get reminders very late and simultaneously... i already missed couple meetings becoz of that.. plz fix soon.. otherwise app wont be useful to any..",
        "The Best of the best I have tried several different task list and goal setting apps and this one combines both seamlessly. I got this app before reading the GTD book but I found reading it really maximizes the benefit of this app."
    ],
    "recentChanges": [
        "Further improvements for Android 7.0."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tarasovmobile.gtd.premium&hl=en&gl=us",
    "appId": "com.tarasovmobile.gtd.premium"
}