{
    "title": "LFconnect",
    "summary": "Life Fitness LFconnect helps you stay on track and reach your fitness goals!",
    "icon": "//lh4.ggpht.com/-dP3ksgIxZjKp9SJPIteEQcXhan7WEvwxGmzxXyPD-k3u5GZZ-otlRY57eHTyuh_MzzA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.7,
    "reviews": 4055,
    "developer": "Life Fitness",
    "developerId": "Life+Fitness",
    "developerEmail": "developers@lifefitness.com",
    "developerWebsite": "https://www.lfconnect.com/",
    "updated": "December 26, 2017",
    "version": "2.14.1",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "LFconnect tracks your cardio workouts and strength workouts and helps you reach your fitness goals!Life Fitness, the largest maker of fitness equipment in the world, has developed an on-the-go fitness app that makes exercise tracking easy.Connect your device to a compatible Life Fitness cardio machine and go! Real-time fitness tracking shows you how close you are to achieving a weekly Calories Burned goal. Seamless interaction between the LFconnect app, LFconnect.com, and compatible cardio machines provides quick, convenient access to your exercise results, personalized workouts, workout plans and more.You can also track strength training workouts by scanning a QR code on compatible Life Fitness selectorized strength equipment.Learn More● A new in-workout mode turns your device into a secondary display that shows workout duration, speed and a choice of heart rate, distance, incline/level, distance climbed, Watts or calories burned● Compatibility icon shows you when you’re connected to compatible cardio equipment and alerts you when you’re not● The LFconnect fitness app interacts with Discover and Engage consoles at the gym, and the Track+ console on home cardio equipment● Fitness tracking with a calorie counting dashboard that combines results from on-product, outdoor and manually entered workouts● Automatically log outdoor walking, running or biking workouts using GPS tracking● Access your library of personalized workout programs for Life Fitness cardio equipment created on LFconnect.com● Strength training tracking with QRcodes decals counts calories, shows proper form with instructional videos, and suggests seat height and set up based on the exerciser’s profile● View scheduled workouts and update your exercise plans on the go● Manually entered workouts are saved for easy future entryDownload the LFconnect app and connect with your active lifestyle in a whole new way!",
    "descriptionHTML": "LFconnect tracks your cardio workouts and strength workouts and helps you reach your fitness goals!<br><br>Life Fitness, the largest maker of fitness equipment in the world, has developed an on-the-go fitness app that makes exercise tracking easy.<br><br>Connect your device to a compatible Life Fitness cardio machine and go! Real-time fitness tracking shows you how close you are to achieving a weekly Calories Burned goal. Seamless interaction between the LFconnect app, LFconnect.com, and compatible cardio machines provides quick, convenient access to your exercise results, personalized workouts, workout plans and more.<br>You can also track strength training workouts by scanning a QR code on compatible Life Fitness selectorized strength equipment.<br><br>Learn More<br>&#x25CF; A new in-workout mode turns your device into a secondary display that shows workout duration, speed and a choice of heart rate, distance, incline/level, distance climbed, Watts or calories burned<br>&#x25CF; Compatibility icon shows you when you&#x2019;re connected to compatible cardio equipment and alerts you when you&#x2019;re not<br>&#x25CF; The LFconnect fitness app interacts with Discover and Engage consoles at the gym, and the Track+ console on home cardio equipment<br>&#x25CF; Fitness tracking with a calorie counting dashboard that combines results from on-product, outdoor and manually entered workouts<br>&#x25CF; Automatically log outdoor walking, running or biking workouts using GPS tracking<br>&#x25CF; Access your library of personalized workout programs for Life Fitness cardio equipment created on LFconnect.com<br>&#x25CF; Strength training tracking with QRcodes decals counts calories, shows proper form with instructional videos, and suggests seat height and set up based on the exerciser&#x2019;s profile<br>&#x25CF; View scheduled workouts and update your exercise plans on the go<br>&#x25CF; Manually entered workouts are saved for easy future entry<br><br>Download the LFconnect app and connect with your active lifestyle in a whole new way!",
    "histogram": {
        "1": 534,
        "2": 346,
        "3": 590,
        "4": 1068,
        "5": 1517
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/jo53P7tQDdh6rAW9bVbYqevlOcYmLDv934wfrbDZPi1O8YGpa258piYeM4yuklm_f5E=h310",
        "//lh6.ggpht.com/Zg01FDbB2FN8w_ndJpConI0jIWIoeBmKKZZ7rB6tdGjcE_h0pDnCXhlP73Ylox2ny-M=h310",
        "//lh4.ggpht.com/BpM2s5b7oQU7dpETL_xyozuZEm3v64mgkqGR5-HTxbFfAfz9Np7jv2OAWSMSwjPHwg=h310",
        "//lh4.ggpht.com/JkLzGN-T3zYbD8CjCBM4x6EcSG--zu88OErY3eMjOeu_Daptv1pIEHj1voJhZm5_s8E=h310",
        "//lh5.ggpht.com/fks4CNyAYLBDlXa-lpMRJEz-tnRf84UGRYoKnscf5sBuj5CQmFeCtLBfRSs6qXwclg=h310"
    ],
    "video": "https://www.youtube.com/embed/6ASOu8ByvrY",
    "comments": [
        "The application worked well mainly. When connected to a leg press machine the weight option for my workout input started at 1to999 and only scrolled by 1 pound. So to get to my 205 weight i used it would've taken forever to get to 205. I saw on another machine it went by 25 increments. Just small bugs but overall helpful and organized. I would like to see a trainers version to track workouts with clients especially when they have cardio to do on off days.",
        "I was excited to have this app for help in tracking my workouts with using a pen and paper log. While it recognizes some qrc codes I have to manually enter the data. The majority of the time when I scan the codes,  I receive a message stating the code is invalid. Help please! Thank you!",
        "This app has a ton of potential. I really want to use it and stick to it but I am finding a few issues. It would be great to be able to enter pounds or kilograms because the equipment is in kg and the freeweights are in lbs. The app has been crashing a ton for me lately since the most recent update whenever doing a save of a manual log.   One of my biggest problems is it isn't intuitive, its actually confusing to use unless you want to put time into figuring it out, this may sway other users from ever even touching the app.  The app has a ton going for, and I really want to get behind it, but it needs polish.",
        "Each time I had this app connected to a machine that I was working out on, it would only record 25% of the calories burned. And that is every single time. And if I wanted to try at the end of the workout to scan my workout it just simply won't scan the HUGE scannable icon. I do not recommend this app. It's beyond frustrating. I gave it 2 stars because the idea is good however the functionality is horrible.",
        "One thing bugs me, when I use the qf code to do some weights I have to activate location, if I forget to deactivate it it'll run my battery flat and I really don't know why it wants my location anyway.  Other than that I love this little app mainly because it sticks to doing just what it needs to and does it well  Following the latest update not only does it mandate having location services but now wants access to camera, funnily enough I don't want to take pictures when I am in the gym. Plus several times after a treadmill workout it has failed to appear on my account so it looks like quality is going downhill",
        "Clumsy interface, not intuitive. Won't connect via Bluetooth with treadmill; errors that it's not on internet. Spent more time in app than working out."
    ],
    "recentChanges": [
        "Version 2.14.1:",
        "* New Results UI with charts",
        "* Latest Life Fitness console support",
        "* Various bug fixes and usability improvements",
        "Previous updates:",
        "* Simplified Chinese support",
        "* Ability to create cardio workout in Workout Library. Cardio workout works with supported Life Fitness consoles",
        "* Proximity Login using Bluetooth",
        "* Discover SE3 and SE3HD support",
        "* Track Connect, Explore™ Console, Connect Module and Rower GX support"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.lf.lfvtandroid&hl=en&gl=us",
    "appId": "com.lf.lfvtandroid"
}