{
    "title": "NHK Easy Japanese News - Simple, Fast and Useful",
    "summary": "Read and listen to NHK News with Furigana &amp; Multilingual Dictionaries for FREE",
    "icon": "//lh3.googleusercontent.com/2CQfccUAMi-Zcy_6A2Lh6blLs7diKs0pMc6ymAva2k7-CBhHEmstlVDAQeT7syHTVSA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.7,
    "reviews": 7722,
    "developer": "AOVILL TEAM",
    "developerId": "AOVILL+TEAM",
    "developerEmail": "aovillteam@gmail.com",
    "developerWebsite": "http://aovill.com",
    "developerAddress": "179-0081, Tokyo, Nerima-ku",
    "updated": "November 14, 2017",
    "version": "11.5",
    "genre": "Education",
    "genreId": "EDUCATION",
    "description": "This apps will suite with JLPT N4, N3 level.This app lets you read and listen to daily news provided by NHK NEWS WEB EASY in a very simple Japanese.It also show the reading (furigana) of Kanji as well as contains a list of new words with meanings in each news, or it will link to multiple dictionaries like English, Japanese, Chinese and Korean.It now includes the movies which come along with the news.With this app you can adjust font size for reading and setting to automatically play next/previous news when finish listening to once.NEW FEATURES:- Add normal version of the news (more difficult Japanese)- Hide Furigana for each articles- Link to dictionary of English, Chinese and Korean- Favorite and download tabKEY FEATURES:*****************************************- Easy to understand Japanese News- Furigana for Kanji words in the news- New words and meanings for each news- Auto-play next/previous news- Adjust Font Size for better reading- Native reading voice- Share the app with your friend- Simple and Easy to use User Interface- Support landscape mode- Play in backgroundFEATURES in FULL VERSION:- OFFLINE VIEW MODE: you can now download preferred article for offline view (without internet connection).     -> Reduce cost on 3G/4G connection- Free of ads*****************************************Leave your comments and we will bring more convenience!!!Thanks,",
    "descriptionHTML": "This apps will suite with JLPT N4, N3 level.<br><br>This app lets you read and listen to daily news provided by NHK NEWS WEB EASY in a very simple Japanese.<br>It also show the reading (furigana) of Kanji as well as contains a list of new words with meanings in each news, or it will link to multiple dictionaries like English, Japanese, Chinese and Korean.<br><br>It now includes the movies which come along with the news.<br><br>With this app you can adjust font size for reading and setting to automatically play next/previous news when finish listening to once.<br><br>NEW FEATURES:<br>- Add normal version of the news (more difficult Japanese)<br>- Hide Furigana for each articles<br>- Link to dictionary of English, Chinese and Korean<br>- Favorite and download tab<br><br>KEY FEATURES:<br>*****************************************<br>- Easy to understand Japanese News<br><br>- Furigana for Kanji words in the news<br><br>- New words and meanings for each news<br><br>- Auto-play next/previous news<br><br>- Adjust Font Size for better reading<br><br>- Native reading voice<br><br>- Share the app with your friend<br><br>- Simple and Easy to use User Interface<br><br>- Support landscape mode<br><br>- Play in background<br><br>FEATURES in FULL VERSION:<br><br>- OFFLINE VIEW MODE: you can now download preferred article for offline view (without internet connection).<br>     -&gt; Reduce cost on 3G/4G connection<br>- Free of ads<br>*****************************************<br><br>Leave your comments and we will bring more convenience!!!<br><br>Thanks,",
    "histogram": {
        "1": 51,
        "2": 25,
        "3": 156,
        "4": 1406,
        "5": 6084
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/iAOgaqA2iIYmnwMdB9TUOA-Az1Y-gXnp8emWt-28xbog9tBYtoC8tfJNl6iMSShGsgo=h310",
        "//lh3.googleusercontent.com/3GyRQj0MHA44W2eSjXWdfnOnzsg74hA96W3rgc685O4O5QsU1h3UJK5f81CsLmBUzw=h310",
        "//lh3.googleusercontent.com/rGKLoI9_N3OApIl_14qB39UNvnXuEA_foZN9pSddglTN-8NQsDTOeo7HfUL3LiVjJ6Y=h310",
        "//lh3.googleusercontent.com/gaKeKf7HOKWoMny9CqW89NBtdHrB_VtFzKQhVgh3imQj8SwUlQiDxNiZJmDgcYGZstI=h310",
        "//lh3.googleusercontent.com/Fh_aKt5NBG5LFkITSWpKPyIZW7zKZ1Fj4kZ7HoF6l3kYzdSoNS9hTHVd3Uea3FoVIWHB=h310",
        "//lh3.googleusercontent.com/UaP5SyZaRVsiqqS5ofW0jTn4PdRjRx-p5kbDSEBXTxJLarlMJmvOw6eOc5tvJ-7GYw=h310",
        "//lh3.googleusercontent.com/-X9Nx-Gy1eBNWH05Kg4_Kle2yYMnIkAlv_NOX2lsnXpWjm4fBb7vBRy-vKTJJilxn2Q=h310",
        "//lh3.googleusercontent.com/INRnPUuOAPmKkUvsqAZfP1RDh2N2XNUWmg_Phh9rhqag0J6DlCgoKORiL2Q1ydCxzhY=h310",
        "//lh5.ggpht.com/-rzALuJa4pQ2BhF41edZVrfKMhpQmDJ8Tth-cBbxdeO75depqYZz1nOMCTTYdJX5qw=h310",
        "//lh4.ggpht.com/STTVls8jnOWmaat-EqBJEPAVB3cu9lRqE43UzucVbEjephUQ9yk9j_Hz5mS0E11ugA=h310"
    ],
    "comments": [
        "Everytime I click a word for dictionary i have to scroll down so much to see the dictionary, because of some random java script texts appear first.   Also, at least 1/3 of the articles fail to load its image/video, and it's annoying because when I click for furigana it tries to load again and it randomly scrolls down so i have to look for where i was reading each time i use the furigana button.  Would be 5stars for me if these issues were fixed.",
        "Looks like a great app. But one feature that I would really like to see is the ability to adjust the distance between the lines. As it is right now, it is a little cramped for my eyes to read comfortably, especially with furigana enabled.   I would be a loyal subscriber if this feature is added.",
        "Great app!  I wish there was an English translation so I can check my understanding.   When I try to follow links to the dictionary I get some kind of java script msg that I can't understand yet.  Also, I like the previous idea about difficulty levels.",
        "Hi, I must say your app is fantastic and it helps me greatly in studying japanese (I have purchased pro version). Only some minor issues prevent me give the app 5 star: Can you add a quick button to show/hide furigana along the article instead of settings? I used this feature many times when read articles (study purpose) and it's quite annoying to go back and forth of the screens. Also a tab for downloaded articles and another tab for online articles is better than going into settings to toggle the option.",
        "Full of Ads, including interstitials, unnecessary notifications and the app itself is mediocre. When you tap on unknown vocabulary you have to scroll past some JavaScript warning before actually seeing the definition. Could be better. Removing Ads only available via subscribtion and for that it's not good enough in my opinion.",
        "This app is so helpful for Japanese learners! Listening can be very helpful to train your ear, and hearing the pronunciation of words helps your speaking skills. So far the only minor issue I have found with this app is that you can't rewind or fastfoward the audio while it is paused. Other than that, this is app is amazing!"
    ],
    "recentChanges": [
        "- Fix minor issues",
        "- Add dictionary for all words"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.aovill.language.e2l.ejn&hl=en&gl=us",
    "appId": "com.aovill.language.e2l.ejn"
}