{
    "title": "Messenger for SMS",
    "summary": "#1 Messages &amp; call ID app used by millions, with lots of great custom options",
    "icon": "//lh3.googleusercontent.com/hMgJmwJnXEmoXifsXAOzLLkP6moV42k35k8iFUwLNdjA6-ZdOym203tDdtn-0Fd-XaWN=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.3,
    "reviews": 92642,
    "developer": "SMS & MMS Team",
    "developerId": "SMS+%26+MMS+Team",
    "developerEmail": "smsmessagefeedback@gmail.com",
    "developerWebsite": "https://www.facebook.com/MessagesSMS ",
    "updated": "January 22, 2018",
    "version": "1.8.7",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Messages - the best custom Messages & call app with countless themes, fonts, wallpapers, ringtones, call features and everything you want. Fully customizable by you!  Send 3000+ new emojis, lenny faces, stickers, GIFs & text messages via SMS messages. Sending funny text messages, SMS, MMS, GIFs and emoji messages. A funny SMS messages app to replace stock messages app!Messages – Send text messages safely with private box, SMS blocker, even SMS backup & restore and schedule SMS! Won’t worry about losing private messages, won’t worry about missing big moments, and won’t worry about spam messages waste phone storage by blocking text messages. Sending text messeages has never been so great with countless emoji, GIF, sticker, theme, private box, SMS blocker, SMS backup &restore and schedule SMS! Enjoy sending & blocking text messages with funny SMS messages.Messages Key Features- SMS BACKUP & RESTORE✔ Backup SMS & MMS messages to cloud, messages never get lost✔ Restore deleted or lost SMS & MMS message whenever- Caller ID✔ Identify numbers in real time - even those not in your contact list✔ Get warnings for more than 1 million spam numbers worldwide- Connect calls with Messages✔ One click text a contact after each call. No need to input number again✔ Access other Messages features directly from caller ID screen- SCHEDULE SMS✔ Delayed SMS message give opportunity to correct the wrong message✔ Never miss any big moment with schedule SMS Messages- PRIVATE BOX✔ Encrypt messages or contacts & lock down with private box✔ Hide private box icon to protect privacy from being snooped- SMS BLOCKER✔ No worry about spam messages consume storage space with blocker✔ Block text messages via adding to SMS blocker- FREE FUNNY SMS COLLECTION✔10+ categories SMS messages you can choose✔ Love SMS, flirt SMS, romantic SMS, friendship SMS, greeting SMS and more- FUNNY EMOJI MESSAGE✔ Fast text 3000+ lenny face, emoji & emoticons from messages directly✔ Great display of lenny face, emoji & emoticons in text message- FUNNY EMOJI STYLE IN Messages✔ Messages support all new funny emoji & lenny face in SMS✔ Support update emoji from Twitter and Emoji One in SMS✔ Support Unicorn, Middle Finger, Taco Rainbow and more funny emoji- FREE ANIMATED GIF & EMOJI ART✔ Share thousands of trending hot GIFs MMS via MMS✔ Share unique Emoji Art & lenny face with friends via SMS- CUSTOMIZE SMS THEMES✔ Tons of amazing messaging themes✔ Customize SMS background as you wish- AWESOME MESSAGES CUSTOMIZATION✔ Customize texting bubble, SMS bubble, color, font & wallpaper✔ Take photo as wallpaper or choose wallpaper from photo gallery- DRIVING MODE & AUTO REPLY✔ Driving Mode disable message notifications from messages or stock messages except phone call✔ Auto Reply when Driving Mode is turned on, keep distractions to a minimum- ANDROID WEAR COMPATIBLE✔ SMS Messages works perfectly on Android Wear✔ Get wear SMS Messages on your android wear- MORE FEATURES✔ Send picture, audio, video MMS messages to more than one friends for once time✔ Clipboard for multiple fast copy and paste text messages✔ Pop up new message for a quick view and quick reply✔ Quick search to find exactly what you are looking for in free text messages❤Contact UsFacebook: https://www.facebook.com/MessagesSMSEmail: messagescontact@gmail.comWe are constantly working hard on making the “Messages” more perfect for your SMS & MMS Texting needs. Please feel free to email us for any queries/suggestions/problems or just say hello. We would love to hear from you. If you have enjoyed any feature of ‘Messages’, do rate us ★★★★★ on play store. Tell your friends if you are enjoying free funny SMS & MMS Messages.Thanks for your supportYour Messages",
    "descriptionHTML": "Messages - the best custom Messages &amp; call app with <b>countless themes, fonts, wallpapers, ringtones, call features and everything you want. Fully customizable by you! </b> Send <b>3000+ new emojis, lenny faces, stickers, GIFs</b> &amp; text messages via SMS messages. Sending funny text messages, SMS, MMS, GIFs and emoji messages. A funny SMS messages app to replace stock messages app!<br><br>Messages &#x2013; Send text messages safely with <b>private box, SMS blocker, even SMS backup &amp; restore and schedule SMS</b>! Won&#x2019;t worry about losing private messages, won&#x2019;t worry about missing big moments, and won&#x2019;t worry about spam messages waste phone storage by blocking text messages. Sending text messeages has never been so great with <b>countless emoji, GIF, sticker, theme, private box, SMS blocker, SMS backup &amp;<br>restore and schedule SMS</b>! Enjoy sending &amp; blocking text messages with funny SMS messages.<br><br><b>Messages Key Features</b><br><br>-<b> SMS BACKUP &amp; RESTORE</b><br>&#x2714; Backup SMS &amp; MMS messages to cloud, messages never get lost<br>&#x2714; Restore deleted or lost SMS &amp; MMS message whenever<br><br>-<b> Caller ID</b><br>&#x2714; Identify numbers in real time - even those not in your contact list<br>&#x2714; Get warnings for more than 1 million spam numbers worldwide<br><br>-<b> Connect calls with Messages</b><br>&#x2714; One click text a contact after each call. No need to input number again<br>&#x2714; Access other Messages features directly from caller ID screen<br><br>-<b> SCHEDULE SMS</b><br>&#x2714; Delayed SMS message give opportunity to correct the wrong message<br>&#x2714; Never miss any big moment with schedule SMS Messages<br><br>-<b> PRIVATE BOX</b><br>&#x2714; Encrypt messages or contacts &amp; lock down with private box<br>&#x2714; Hide private box icon to protect privacy from being snooped<br><br>-<b> SMS BLOCKER</b><br>&#x2714; No worry about spam messages consume storage space with blocker<br>&#x2714; Block text messages via adding to SMS blocker<br><br>-<b> FREE FUNNY SMS COLLECTION</b><br>&#x2714;10+ categories SMS messages you can choose<br>&#x2714; Love SMS, flirt SMS, romantic SMS, friendship SMS, greeting SMS and more<br><br>-<b> FUNNY EMOJI MESSAGE</b><br>&#x2714; Fast text 3000+ lenny face, emoji &amp; emoticons from messages directly<br>&#x2714; Great display of lenny face, emoji &amp; emoticons in text message<br><br>-<b> FUNNY EMOJI STYLE IN Messages</b><br>&#x2714; Messages support all new funny emoji &amp; lenny face in SMS<br>&#x2714; Support update emoji from Twitter and Emoji One in SMS<br>&#x2714; Support Unicorn, Middle Finger, Taco Rainbow and more funny emoji<br><br>-<b> FREE ANIMATED GIF &amp; EMOJI ART</b><br>&#x2714; Share thousands of trending hot GIFs MMS via MMS<br>&#x2714; Share unique Emoji Art &amp; lenny face with friends via SMS<br><br>-<b> CUSTOMIZE SMS THEMES</b><br>&#x2714; Tons of amazing messaging themes<br>&#x2714; Customize SMS background as you wish<br><br>-<b> AWESOME MESSAGES CUSTOMIZATION</b><br>&#x2714; Customize texting bubble, SMS bubble, color, font &amp; wallpaper<br>&#x2714; Take photo as wallpaper or choose wallpaper from photo gallery<br><br>-<b> DRIVING MODE &amp; AUTO REPLY</b><br>&#x2714; Driving Mode disable message notifications from messages or stock messages except phone call<br>&#x2714; Auto Reply when Driving Mode is turned on, keep distractions to a minimum<br><br>-<b> ANDROID WEAR COMPATIBLE</b><br>&#x2714; SMS Messages works perfectly on Android Wear<br>&#x2714; Get wear SMS Messages on your android wear<br><br>-<b> MORE FEATURES</b><br>&#x2714; Send picture, audio, video MMS messages to more than one friends for once time<br>&#x2714; Clipboard for multiple fast copy and paste text messages<br>&#x2714; Pop up new message for a quick view and quick reply<br>&#x2714; Quick search to find exactly what you are looking for in free text messages<br><br>&#x2764;<b>Contact Us</b><br>Facebook: https://www.facebook.com/MessagesSMS<br>Email: messagescontact@gmail.com<br>We are constantly working hard on making the &#x201C;Messages&#x201D; more perfect for your SMS &amp; MMS Texting needs. Please feel free to email us for any queries/suggestions/problems or just say hello. We would love to hear from you. If you have enjoyed any feature of &#x2018;Messages&#x2019;, do rate us &#x2605;&#x2605;&#x2605;&#x2605;&#x2605; on play store. Tell your friends if you are enjoying free funny SMS &amp; MMS Messages.<br><br>Thanks for your support<br>Your Messages",
    "histogram": {
        "1": 5170,
        "2": 2668,
        "3": 9524,
        "4": 13645,
        "5": 61635
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/nzQYS0gb-JIXStg-dvpABIek7AFMnpotKcN0ArNnynGWMTJnc2-epOmg_Z0iZ6L8lotL=h310",
        "//lh3.googleusercontent.com/bELtpqjkJZH7iFU_vRAY9f8e9Ob3p-GJcyy0GKuT4lktHTlDytoZtsUSjGe_9cKgt5lb=h310",
        "//lh3.googleusercontent.com/Kowzhf_RgxyUXFWE3Lg1Jgjpso-p7vgLGhVDAN43s43P2Hh2Qsaf-mKgiKSTE1Mnh20=h310",
        "//lh3.googleusercontent.com/K4I6yX4by4_sxd3uyg9ssac8NCOD272532xWzu8-25Srh3cTa5n5KmZQJKSN2IBSBQ0=h310",
        "//lh3.googleusercontent.com/77wYfR0MxbiNKeseTfjN6eAbFJ41wJVZ23pqDENX71SA2C8i6r91CrRkpRz6qfo4cA=h310",
        "//lh3.googleusercontent.com/ZTpUANCqXgiUK6v2I25NkhuFbSl_qxtlexuPKn1l9LmhbU7hVqfpECf19zCTII1X4Dw=h310",
        "//lh3.googleusercontent.com/uZjZDyzszy3ioq9qenOCW-0hezQc3vCCNhpdE22ArK-ckwUSXrqVREGaEMGR__WAG3bS=h310",
        "//lh3.googleusercontent.com/d-EmSGh1cnrzP4g88OgBMFkmGOKdX6P4OCD_HclG0xDb1fmm2xHw60_i1trHu8tbU8SH=h310"
    ],
    "comments": [
        "Updt... Ive paid for full features & I now have an issue of a permanent notification saying i have a failed msg, i have had this now four times, and every time had to uninstalland reinstall, this is the last time I do this then i go to another msngr..... I've paid for the app because I liked it..  Big issue is I can't send multimedia objects, this is a big deal to me and my wife,  and yes every other Msgr I use does,  other than that This is a great Msgr App and I love it lol",
        "Seriously.  It's one thing to have ads in the app but then you take over my home screen.  Forget it.  Textra is way better and no stupid adds.  I am glad I did not pay for the pro version",
        "Every single theme says not available after I paid for the stupid pro version… waste of money.   Download one that works!!!  If they start to work I'll change my rating!!",
        "I'm only writing this review because I felt obligated to do so. I just installed this app a few days ago since my default sms is on the fritz. I understand there are going to be a lot of ads etc. However, it tried to take over other functions of my phone. Such as lock screen settings. I was asked to review the app and I selected to do so later. Immediately after rejecting to review/rate the app I am being bombarded with \"failed message\" notifications to messages that do not exist. For this very reason I selected to have notifications for every message delivered. This continues to happen. I just haven't deleted the app because I need to use my sms until I find a better app.",
        "This needs to be fixed and inproved nothing works right on it themes is a complete mess too this needs a lot of work purchased full version still add what wrong with these people",
        "Way too many ads.... Jeez even opening up a message creates an ad."
    ],
    "recentChanges": [
        "1.Fixed some bugs."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.link.messages.sms&hl=en&gl=us",
    "appId": "com.link.messages.sms"
}