{
    "title": "MobileDay One-Touch Dial App",
    "summary": "Conference call app that dials into meetings for you. Free conference bridge.",
    "icon": "//lh3.ggpht.com/lUreSCZq1dowitD80Cda5jQqTappGq6NsoVEPNa3Oqn1_zWtQhgnHMFrEJD89rYHUg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4,
    "reviews": 682,
    "developer": "Twine Holdings",
    "developerId": "Twine+Holdings",
    "developerEmail": "info@mobileday.com",
    "developerWebsite": "https://mobileday.com",
    "developerAddress": "2040 14th St.\nSuite 200\nBoulder, CO 80302",
    "updated": "July 28, 2016",
    "version": "2.6.0",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "MobileDay® is the fastest, most reliable way to dial into any conference call or online meeting from your smartphone.Works with any type of phone, any calendar, any conference call bridge—and if you don't have one you can use a MobileDay Bridge for free.  This is the most reliable dialing app out there—a real person tests and validates each dial-in sequence, ensuring that you have dependable access to every call made with MobileDay.> How One-Touch Dialing Works:1. MobileDay syncs with your Android calendar.2. MobileDay detects your conference calls and online meetings and allows you to dial in with one simple tap—no need to remember call-in numbers, PINs, or passcodes.> Pricing:MobileDay is a free app. If you want some special additional features, you can purchase MobileDay Business which gives you the ability to Push a call to any phone and use WiFi. > Features:• Auto-detect scheduled events in your calendar.- Free conference bridge included, or use your own. • Receive notifications of upcoming meetings.• Get dependable one-tap access to any conference call or online meeting.• Rely on MobileDay to get you into every call accurately using human validated dial-in sequences.• Rejoin dropped calls with one tap.• Notify attendees when you are running late via text or email with a pre-populated, customizable message.• Use quick call options to dial anyone in your contacts, or call using the MobileDay keypad.• Schedule meetings from within the app with your conference dial-in information pre-populated.• Join conference calls and online meetings on any platform, including WebEx®, GoToMeeting®, Google+ Hangouts, Lync, and more.> Why use MobileDay?• The app’s simple, uncluttered, and easy-to-use interface. • MobileDay complies with the strictest mobile app security standards, so private data such as your location, calendar, and contacts never leaves your device.• A real person tests and validates each dial-in sequence so you can rely on MobileDay to successfully get you into every call, every time.> AWARDS AND PRESS:Time - 10 Must-Have Mobile Apps - #1 MobileDayForbes - Free Mobile Apps Every Entrepreneur Should UseEntrepreneur Magazine - 2013 Business Travel Awards - Best New Travel AppWant to get MobileDay for your team at work? Learn more about MobileDay Business at: www.mobileday.com.",
    "descriptionHTML": "MobileDay&#xAE; is the fastest, most reliable way to dial into any conference call or online meeting from your smartphone.<br><br>Works with any type of phone, any calendar, any conference call bridge&#x2014;and if you don&apos;t have one you can use a MobileDay Bridge for free.  <br><br>This is the most reliable dialing app out there&#x2014;a real person tests and validates each dial-in sequence, ensuring that you have dependable access to every call made with MobileDay.<br><br>&gt; How One-Touch Dialing Works:<br><br>1. MobileDay syncs with your Android calendar.<br>2. MobileDay detects your conference calls and online meetings and allows you to dial in with one simple tap&#x2014;no need to remember call-in numbers, PINs, or passcodes.<br><br>&gt; Pricing:<br><br>MobileDay is a free app. <br><br>If you want some special additional features, you can purchase MobileDay Business which gives you the ability to Push a call to any phone and use WiFi. <br><br>&gt; Features:<br><br>&#x2022; Auto-detect scheduled events in your calendar.<br>- Free conference bridge included, or use your own. <br>&#x2022; Receive notifications of upcoming meetings.<br>&#x2022; Get dependable one-tap access to any conference call or online meeting.<br>&#x2022; Rely on MobileDay to get you into every call accurately using human validated dial-in sequences.<br>&#x2022; Rejoin dropped calls with one tap.<br>&#x2022; Notify attendees when you are running late via text or email with a pre-populated, customizable message.<br>&#x2022; Use quick call options to dial anyone in your contacts, or call using the MobileDay keypad.<br>&#x2022; Schedule meetings from within the app with your conference dial-in information pre-populated.<br>&#x2022; Join conference calls and online meetings on any platform, including WebEx&#xAE;, GoToMeeting&#xAE;, Google+ Hangouts, Lync, and more.<br><br>&gt; Why use MobileDay?<br><br>&#x2022; The app&#x2019;s simple, uncluttered, and easy-to-use interface. <br>&#x2022; MobileDay complies with the strictest mobile app security standards, so private data such as your location, calendar, and contacts never leaves your device.<br>&#x2022; A real person tests and validates each dial-in sequence so you can rely on MobileDay to successfully get you into every call, every time.<br><br>&gt; AWARDS AND PRESS:<br><br>Time - 10 Must-Have Mobile Apps - #1 MobileDay<br>Forbes - Free Mobile Apps Every Entrepreneur Should Use<br>Entrepreneur Magazine - 2013 Business Travel Awards - Best New Travel App<br><br>Want to get MobileDay for your team at work? Learn more about MobileDay Business at: www.mobileday.com.",
    "histogram": {
        "1": 89,
        "2": 35,
        "3": 51,
        "4": 128,
        "5": 379
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/HTHgIH4ZE1RIUsPxW4pd7VZ5sc63HLkJMlPZcUvxlz2QeAV-0JsRsGnlzTIgMHp5j84=h310",
        "//lh4.ggpht.com/rVoH_BWBFuE5ecmBqpm5T6dgl5OsHs4pPCcOFopaAXWa7v2uT1UJ40QwzgYuwDD6tT8=h310",
        "//lh3.ggpht.com/wOFiLEWRvPxIFFbno0V4QSqM0bCl_CZz8dLOS3eBJeNdExleLUbRAIUFumHgpw8uVw=h310",
        "//lh4.ggpht.com/M_wfGbU7YLAHmCtvzR_yXK0fdABKQJfqBvw6j-jPBtNjI8MEg3bFJ68H8XM7C-ADHQ=h310",
        "//lh3.ggpht.com/hPOb8WPa-PW_MQXp5XDa_BFPvMPW3JKr_adb0XtSU6QZHz8pw5kySFiRxaa_sfIT6kBy=h310",
        "//lh3.ggpht.com/HP3vEsFjfHg_pjv88-XrW20HCfChJIVWpRHCS55z9_rTJyq1D6HtWvSxvB3gI_MwoA=h310",
        "//lh3.ggpht.com/lKQOHgLuMMh_xoNRfZCL6iT7jk3RvcRvzmSinyS56xWizuIlBWlOBmQVp_aNVRs1ze1d=h310",
        "//lh6.ggpht.com/zhNQ5nXkZdl8T2J52QKzEe0DkoURW_AyQl-ORACBnN4bJK0fXcHc6t1OXshiuUP_bUk=h310",
        "//lh3.googleusercontent.com/qe5x74tsgQH9nX3rGil8QNHv_F9-VpptF_9UTwYXEI21aG4rjvrdAo8RftOoKy0wZgE=h310",
        "//lh3.googleusercontent.com/h8Ufi4I2Wd6_Cm81IRJ9hMDKCZd285HvLfidea62WtNREMdXmzBwt1-ZHIhBsZ0HFA=h310",
        "//lh3.googleusercontent.com/EhkjFEWRknnXs0poDdHJ71rl9cqKOQC1CVeD8s8xyXxOJvhZE4KcREey5jjnEi_4JDs=h310",
        "//lh3.googleusercontent.com/mTGLpGP5z2RMx-tKWH7NDli1KTAAtxIpi5jwrEuqB3XeRpBCMVMYwNYIBBQfvhj2rDU=h310",
        "//lh3.googleusercontent.com/mmS9rzlt1davYvggjyNvRUaA4i1R8akllwTk974seV1cNSELGOT6xRoBfILmigjz0qE=h310"
    ],
    "comments": [
        "I like this app, in fact couldn't live without it.  But now I'm forced to use Outlook for other reasons.  It doesn't work with Outlook so I can't use it now.  I don't believe that it's the fault of MobileDay, Outlook doesn't work with any other app that I know of.  Sometimes I really hate Microsoft, but I've got no choice for now.    So, if you use pretty much any calendar app other than Outlook, and it works with other apps MobileDay is highly recommended.    If you use Outlook as your calendar MobileDay will work as long as you also connect the standard Android calendar to your Exchange server.  I did this for some time, but Microsoft Outlook 365 no longer works with the Android mail or calendar so this is no longer an option, at least for me.",
        "This app is sketchy. It dials a 3rd party number to connect you to your conference bridge. Maybe it's not a big deal, or maybe calls are recorded or eavesdropped on. My calls are sensitive, and this is concerning. If information was to be disclosed, my employer would hold me responsible for using an unapproved service to route my calls over. Needs an option to dial directly.   Also, quality is much worse than dialing the bridge directly.",
        "This app used to work perfectly for me for years. it was the best for making conference calls via a mobile phone as it found all the conference dial-in and passcode information automatically in your invite and dialed it for you. hugely convenient if you were driving or unable to search for a conference information. However a recent update or some other change has now prevented mobile day from displaying any of my calendar information or any of my conference calls.  It is useless to me now.  PLEASE GO BACK TO HOW IT WAS BEFORE AND I WILL GIVE IT 5 STARS!",
        "Dials into some random number and then... The app used to work perfectly but lately it started dialing into some random number and then requiring me to put in the pin and password that was already set up. Kinda defeats the purpose.",
        "The app dials out as advertised however quality of calls is horrendous. I am constantly being disconnected. I can conclude that the app is fine but the service behind it is garbage.",
        "This app was absolutely my go-to app for a year. I happily paid the subscription fee. I loved the fact that it included all of the conference call numbers and codes in one push of a button. Unfortunately, it no longer works on my Android phone. Despite the fact that I can open the app and see appointments, it never notifies me. Without notification, the app is useless to me, so I uninstalled it."
    ],
    "recentChanges": [
        "- Fixed bug where sequence wasn't dialed from notifications and homescreen widget",
        "- Fixed bug where edited sequences for events were lost",
        "- Reliability improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mobileday&hl=en&gl=us",
    "appId": "com.mobileday"
}