{
    "title": "Strava: Track Running, Cycling & Swimming With GPS",
    "summary": "GPS activity tracker – Track running &amp; cycling, map training &amp; record your route",
    "icon": "//lh3.googleusercontent.com/yqd-l5DbIPp2-ZWOymVUGppLI2DFcz_Utf9L94asNHm6xQOSvgvJVwXY-dvjtyeAVXM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.5,
    "reviews": 309446,
    "developer": "Strava Inc.",
    "developerId": "Strava+Inc.",
    "developerEmail": "support@strava.com",
    "developerWebsite": "http://www.strava.com/",
    "developerAddress": "Strava, Inc\n500 Third Street, Suite 110\nSan Francisco, CA 94107",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Track your run, map a cycling route and analyze your training with all the stats – for free! Record your fitness with activity tracker Strava.Training for a triathlon or simply love taking your bike out for a ride? Turn your smartphone into a sophisticated cycle or running tracker with Strava. Join millions of active people and reach your fitness goals! ACTIVITY TRACKER STRAVA: TOP 5 FEATURES• GPS distance tracker and mile counter: See your key stats at a glance• Run, ride or swim: Map and track your favorite activity• Challenge yourself or compete with others• Triathlon and marathon training: Go Premium and set your goals for 2018• Run, cycle or swim Clubs: Join brands, teams and friendsDISTANCE TRACKER & MILE COUNTER• Running, cycling and swimming: Compare your performance over time• Track distance, pace, speed, elevation gained and calories burned• Mile counter: Use your Android device or pretty much every GPS device out thereROUTE & TRAIL MAP• Running and cycling: Access the world’s largest road and trail network • Route ideas: Discover new routes for your run or bike ride• Upload routes to your phone or GPS device for easy navigationCHALLENGE & COMPETE• Activity tracker: Track your progress and analyze your performance• Challenge yourself and push yourself even further• Leaderboard: See how you fare on popular stretches of road or trailCONNECT & SHARE• Record an activity on your Strava feed, where friends and followers can give kudos, comments and share their own performances• Show off your cycle route or group and share photos of your bike adventures• Join Clubs of brands, teams and friends for activities and growing communitiesUNLOCK PREMIUM• Set your fitness goals and get customizable training plans. Set your own distance, time or segment goals• Get live features to help you train safer and perform better• Dive deep into your data with advanced analysis and extensive performance metricsRUNNING TRACKER and TRAINING• Marathon training hit a plateau? Boost your performance with distance tracker Strava and access tailored plans with Premium• Turn your running tracker into a personal coach for triathlon or marathon trainingIt doesn’t stop at running and cycling, you can use Strava for a whole range of sports:• Swim• Alpine Ski• Hike• Crossfit• Kayak• Rock Climb• Surf• Yoga• Indoor running• Indoor cycling• Gym workouts...and many more!NOTE ON GPS SUPPORT:Strava depends on GPS for recording activities. In some devices, the GPS does not work properly and Strava will not record effectively. If your Strava recordings show poor location estimation behavior, please try to update the operating system to the most recent version. There are some devices which have consistently poor performance with no known remedies. On these devices we restrict installation of Strava, for example the Samsung Galaxy Ace 3 and the Galaxy Express 2. See our support site for more information:  https://strava.zendesk.com/entries/27141334-Does-Strava-4-x-run-on-my-Android-device-",
    "descriptionHTML": "Track your run, map a cycling route and analyze your training with all the stats &#x2013; for free! Record your fitness with activity tracker Strava.<br><br>Training for a triathlon or simply love taking your bike out for a ride? Turn your smartphone into a sophisticated cycle or running tracker with Strava. Join millions of active people and reach your fitness goals! <br><br><b><u>ACTIVITY TRACKER STRAVA: TOP 5 FEATURES</u></b><br>&#x2022; <b>GPS distance tracker and mile counter:</b> See your key stats at a glance<br>&#x2022; <b>Run, ride or swim:</b> Map and track your favorite activity<br>&#x2022; <b>Challenge</b> yourself or compete with others<br>&#x2022; <b>Triathlon and marathon training:</b> Go Premium and set your goals for 2018<br>&#x2022; <b>Run, cycle or swim Clubs:</b> Join brands, teams and friends<br><br><b><u>DISTANCE TRACKER &amp; MILE COUNTER</u></b><br>&#x2022; Running, cycling and swimming: Compare your performance over time<br>&#x2022; Track distance, pace, speed, elevation gained and calories burned<br>&#x2022; Mile counter: Use your Android device or pretty much every GPS device out there<br><br><b><u>ROUTE &amp; TRAIL MAP</u></b><br>&#x2022; Running and cycling: Access the world&#x2019;s largest road and trail network <br>&#x2022; Route ideas: Discover new routes for your run or bike ride<br>&#x2022; Upload routes to your phone or GPS device for easy navigation<br><br><b><u>CHALLENGE &amp; COMPETE</u></b><br>&#x2022; Activity tracker: Track your progress and analyze your performance<br>&#x2022; Challenge yourself and push yourself even further<br>&#x2022; Leaderboard: See how you fare on popular stretches of road or trail<br><br><b><u>CONNECT &amp; SHARE</u></b><br>&#x2022; Record an activity on your Strava feed, where friends and followers can give kudos, comments and share their own performances<br>&#x2022; Show off your cycle route or group and share photos of your bike adventures<br>&#x2022; Join Clubs of brands, teams and friends for activities and growing communities<br><br><b><u>UNLOCK PREMIUM</u></b><br>&#x2022; Set your fitness goals and get customizable training plans. Set your own distance, time or segment goals<br>&#x2022; Get live features to help you train safer and perform better<br>&#x2022; Dive deep into your data with advanced analysis and extensive performance metrics<br><br><b><u>RUNNING TRACKER and TRAINING</u></b><br>&#x2022; Marathon training hit a plateau? Boost your performance with distance tracker Strava and access tailored plans with Premium<br>&#x2022; Turn your running tracker into a personal coach for triathlon or marathon training<br><br>It doesn&#x2019;t stop at running and cycling, you can use Strava for a whole range of sports:<br>&#x2022; Swim<br>&#x2022; Alpine Ski<br>&#x2022; Hike<br>&#x2022; Crossfit<br>&#x2022; Kayak<br>&#x2022; Rock Climb<br>&#x2022; Surf<br>&#x2022; Yoga<br>&#x2022; Indoor running<br>&#x2022; Indoor cycling<br>&#x2022; Gym workouts<br>...and many more!<br><br><b>NOTE ON GPS SUPPORT:</b><br>Strava depends on GPS for recording activities. In some devices, the GPS does not work properly and Strava will not record effectively. If your Strava recordings show poor location estimation behavior, please try to update the operating system to the most recent version. There are some devices which have consistently poor performance with no known remedies. On these devices we restrict installation of Strava, for example the Samsung Galaxy Ace 3 and the Galaxy Express 2. <br><br>See our support site for more information:  https://strava.zendesk.com/entries/27141334-Does-Strava-4-x-run-on-my-Android-device-",
    "histogram": {
        "1": 10358,
        "2": 6261,
        "3": 12557,
        "4": 58305,
        "5": 221965
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/V3JpeQAev77UdJCs1QKULkJDfkXAbEFkAH8LKCavGWqKCxPvScYuohoas2gZXntbug=h310",
        "//lh3.googleusercontent.com/apuHw35IWPWVF2W0u-PpAj44pQnYMU6-Pj0VrpeMw-eSBL1XKdBJR0LUxb2qIiLsRyE=h310",
        "//lh3.googleusercontent.com/R9NIjc87Ebitx57n4uZhZ1HNC2TA5SY36tmqj9CU7tqyoA_rRcsoQ-zlo9ALgzG8--sS=h310",
        "//lh3.googleusercontent.com/LOqlhy-QSlhbPEdzh1qdp2JdEfV-h1NSN4hve6tOBlf8z0K_kGc7L3C8tMigXSpQmV4=h310",
        "//lh3.googleusercontent.com/Fv248C9YOPlCZe8JkAYC0AUjW8IVWOMipxsYr9sFYoNuW55YanExN3S8lMH6Ok8PXsw1=h310"
    ],
    "comments": [
        "Luv this app! The only improvement I can see is that sharing to Instagram Direct seams a waste of time, why not make it so we can share directly to our profile.  We also need a way to post our shoes for cycling in the Gear section, we can do our bikes and addons to that but no shoes. How do you stop automatic upload of our rides?",
        "Good app, but more sports should be added to the weekly and global statistics such as walking and hiking. A great number of people ask for it and Strava does not say anything about it.  Also, the community is asking for a long time to have MiBand 2 support and they don't care enough to provide it.",
        "Need to revert to chronological view please.  Ive had to unfollow a few people because their activities dominate the top of the feed despite being weeks old. Good that the \"suggested follows\" section is much less frequent now. Good to see they got rid of the PR on first attempt as well.",
        "Only ever had one problem with this app, the beacon wouldn't work. It sent the link absolutely fine but there was no data to go with it. A quick exchange of e-mails later and it's sorted (my phone was connected to Wi-Fi when attempting to send the beacon, disconnect that and connect to mobile data instead and it works fine). The premium membership has helped with my motivation to go out on the rides I don't really fancy because of the targets you can set.",
        "I like this app, but it would be nice if you could track a few more activities: walking, for example. I do a lot of walking and kayaking. You can log such activities manually, but that's not as accurate as if you were to track properly. Surely it can't be that hard to put in some more options?",
        "Hey people, keep on working out and keep sweating. You don't need this app to tell you how far u went only to find out it didn't capture your effort. Just go out n do it. Strava is inaccurate and unreliable. Not for me I guess."
    ],
    "recentChanges": [
        "Run, ride or swim with Strava. Just like your personal best, we’re continuously improving our app - so you get the best out of your training.",
        "With this version, we are releasing minor bug fixes.",
        "Leave a review & let us know how we can improve Strava to suit your fitness."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.strava&hl=en&gl=us",
    "appId": "com.strava"
}