{
    "title": "Match™ Dating - Meet Singles",
    "summary": "Match is the dating app to meet singles.Discover someone near you today",
    "icon": "//lh3.googleusercontent.com/NibKtv1ZlIMBpnKmsTjSd7Hlgqq1pmnJEBzv26aTrKvWDaZTJc9vTNytuFxKm57M0CHt=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 3.7,
    "reviews": 73756,
    "developer": "Match.com LLC",
    "developerId": "Match.com+LLC",
    "developerEmail": "android.app@match.com",
    "developerWebsite": "http://www.match.com",
    "updated": "February 5, 2018",
    "version": "Varies with device",
    "genre": "Dating",
    "genreId": "DATING",
    "size": "Varies with device",
    "description": "The Match app has more quality singles than any other dating site and can help you meet new people wherever you are.• View photos of singles near you• Search for single men or Single women• Get handpicked matches delivered every dayWe’re #1 in first dates and relationships.Match is home to the largest pool of singles in online dating—that includes local singles dating apps, gay dating websites, lesbian dating apps and free dating apps.How do we do it? Our matching algorithm delivers only the single men or single ladies that meet your standards.Millions of straight, gay and lesbian singles count on us to find the man or woman they want to date. Get the singles dating app free to start meeting, flirting and exploring the best group of personals in online dating.Don’t fish in a shallow pond: kiss the hookup apps goodbye, and meet the right girl or guy for you on Match.For Android Wear™ users, you can experience Match on your watch.• Search on the go• Exchange messages with voice commands• Rate Daily Matches while they’re hot• Feel the love with pulse email & wink notifications",
    "descriptionHTML": "The Match app has more quality singles than any other dating site and can help you meet new people wherever you are.<br><br>&#x2022; View photos of singles near you<br>&#x2022; Search for single men or Single women<br>&#x2022; Get handpicked matches delivered every day<br><br>We&#x2019;re #1 in first dates and relationships.Match is home to the largest pool of singles in online dating&#x2014;that includes local singles dating apps, gay dating websites, lesbian dating apps and free dating apps.<br><br>How do we do it? Our matching algorithm delivers only the single men or single ladies that meet your standards.<br>Millions of straight, gay and lesbian singles count on us to find the man or woman they want to date. Get the singles dating app free to start meeting, flirting and exploring the best group of personals in online dating.<br>Don&#x2019;t fish in a shallow pond: kiss the hookup apps goodbye, and meet the right girl or guy for you on Match.<br><br>For Android Wear&#x2122; users, you can experience Match on your watch.<br>&#x2022; Search on the go<br>&#x2022; Exchange messages with voice commands<br>&#x2022; Rate Daily Matches while they&#x2019;re hot<br>&#x2022; Feel the love with pulse email &amp; wink notifications",
    "histogram": {
        "1": 12770,
        "2": 4291,
        "3": 8444,
        "4": 13926,
        "5": 34325
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/RsEdgLMj19NjhIazsxNbCKPbH9mu_Z3IMuNdER-yN9Q1QlXpNNzoNIMN7zjdvyq5U0Q=h310",
        "//lh3.googleusercontent.com/v7-mqIGiumcrYPs6iYXy1wWGHwy4O1Am_6i7ihTuWZn9hi7OFdwAs_j2Oy9QBKSJ4A=h310",
        "//lh3.googleusercontent.com/SHiKnCjOi-UlPXzPvyZI9bG2fvNctfCm7dkZhXfGfumxI7it8R5-Fia3aVonLs7pklfP=h310",
        "//lh3.googleusercontent.com/ooMWkuzGZhVHFaUkwKDtjwEdkCVj0vy8hsVj-vjLMPb-JjuEIR7WdWtpszZVn35zAg=h310",
        "//lh3.googleusercontent.com/jllr7LNcb66MlhUXG8p4xChBEWsSyLHF1MxMf8o9uhmMA5oTdbFCNScw_IIvYvu05S8=h310"
    ],
    "comments": [
        "Been on here for 2 weeks now and nothing. I've sent out well over 20 messages and not a single response. I've extensively redone my profile and still nothing. I don't even get any views. I joined POF and in less than an hour I was communicating with two lovely ladies. I don't recommend match for anyone. I don't care what the commercials say, this site doesn't work.",
        "Even if you pay their outrageous monthly fees...the other members of the site can't message you back...unless you pay an ADDITIONAL 9.99, on top of the monthly fee....absolutely nuts. On top of that the app is cheap and glitchy, notifications pop up and won't clear for 6 months after you acknowledge them repeatedly...garbage.",
        "Waaaaay over priced then if you want someone to respond back if they didnt pay the outrageous price you need to pay an extra 10 a month. Just for them to respond. Wouldnt reccommed this site to anyone hope they wake up and cut their prices in half",
        "One of the worst online dating apps, full of ads, and etc. You pay for the services but you don't have full control to navigate around the app. Everything is an extra charge, when I complained and request a refund. I pretty much got the: \"Oh well, we don't do refunds and nothing we can do for you.\" You'll have a better chance at other apps than this one. 1/10 for misleading",
        "Horrible! You can't even see who likes you without paying 30$!!! A month?!?!? Ridiuclous! They try and nickle and dime everything they can out of you, even some weird stuff like the \"seen\" messaging feature your probably common with on FB messanger... Don't download, dont waste your money. Better free apps available",
        "It does the bare minimum. It lets you know when someone messaged or liked you.   Aside from that, everything else is annoying. Even after you sign up, you still get constantly bombarded by advertisements to spend more money. And throws things up on the screen you cannot swipe away."
    ],
    "recentChanges": [
        "New features, exciting designs, and many more. Please download the latest update to enjoy a rich experience on Match. Find love today!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.match.android.matchmobile&hl=en&gl=us",
    "appId": "com.match.android.matchmobile"
}