{
    "title": "theScore: Live Sports News, Scores, Stats & Videos",
    "summary": "Scores, news, stats, videos for NBA, NHL, MLB, NFL, NCAA, EPL, World Cup &amp; more",
    "icon": "//lh3.googleusercontent.com/dDjFtNHe0GExF_0ldvkanmLP3MR3khTepvsn_HrlwsKX7-50itYY3YT1ohxsvmyhcg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.3,
    "reviews": 122716,
    "developer": "theScore, Inc.",
    "developerId": "8331818305029646302",
    "developerEmail": "thescoreapp@thescore.com",
    "developerWebsite": "http://company.thescore.com",
    "updated": "February 23, 2018",
    "version": "6.8.1",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "Download theScore for news, scores, stats, and videos from NBA Basketball, MLB Baseball, NFL Football, NCAA Football, NHL Hockey, English Premier League Soccer, La Liga Soccer, Champions League Soccer, FIFA World Cup and every major league and competition!Coverage of NBA, NCAAB, MLB, NFL, NHL, PGA, MMA, Premier League soccer, World Cup and more – build a personalized ‘FAVORITES’ feed of your favorite football, baseball, hockey and basketball teams, as well as every major competition and league. Set up notifications to never miss a key play, major sports news story or injury update again! Check out videos of key moments in and around the game and stay on top with personalized alerts for your favorite team, including real-time, deep stats from the fantasy players you care about.SPORTS NEWS & SCORES APP – THESCORE’S TOP HIGHLIGHTS INCLUDE:Favorites - This is YOUR personalized feed. All the content you care about from your favorite teams, players and leagues. Just tap ‘Manage’ to add, delete or reorder your favorites. Set-up notifications so you’ll never miss a key moment!Scores - A live view of every game. Every score at a glance, updated in real-time. Just tap the matchup for detailed box scores, including live player data, betting lines, news and multimedia.Discover - Uncover the biggest social stories and multimedia that’s got sports fans talking! This is where you’ll find LeBron’s latest swag or the sick dunk that’s going viral. News - Get updated on the top headlines in an instant from across all sports, or tap the league you want at the top of the page to dive deeper.Leagues - Check out the latest news, scores, standings, and leaders for the sport you care about. Customize by tapping ‘Manage’ to reorder or even delete the sports you don’t care about. Team stats, real-time scores, and news across these major sports:Football (NFL Football, NCAA Football and CFL Football, regular season and playoffs) Baseball (College World Series and MLB Baseball, season play and playoffs)Basketball (NBA Basketball, NCAA Basketball - including March Madness championship and playoffs)Hockey (NHL Hockey, IIHF WJHC - World Junior Hockey Championship, NCAA Frozen Four) Soccer (Premier League Soccer, Champions League, FIFA World Cup, Serie A, La Liga, Bundesliga, MLS, FA Cup, League Cup, Europa League, Ligue 1, Coppa Italia, Copa Del Rey and Liga MX, UEFA European Championships) Golf (PGA, LPGA, Ryder Cup, European Tour, Web.com Tour)Tennis (ATP, WTA)Mixed Martial Arts (MMA: UFC and Bellator)Auto Racing (NASCAR Sprint Cup, Formula 1) Lacrosse (NLL)NFL, MLB, NBA, NHL, PGA, MMA, NCAAB, Premier League soccer, World Cup and more – download theScore today and always be on top of the latest sports scores and live news from your favorite sports team! Need help or have feedback? Email thescoreapp@thescore.com or contact us via ‘Report a Bug’ in the Settings menu. -- We are affiliated with theScore.comPrivacy Policy: http://www.thescore.com/pages/privacyTerms of Use: http://www.thescore.com/pages/terms",
    "descriptionHTML": "Download theScore for news, scores, stats, and videos from NBA Basketball, MLB Baseball, NFL Football, NCAA Football, NHL Hockey, English Premier League Soccer, La Liga Soccer, Champions League Soccer, FIFA World Cup and every major league and competition!<br><br>Coverage of NBA, NCAAB, MLB, NFL, NHL, PGA, MMA, Premier League soccer, World Cup and more &#x2013; build a personalized &#x2018;FAVORITES&#x2019; feed of your favorite football, baseball, hockey and basketball teams, as well as every major competition and league. <br><br>Set up notifications to never miss a key play, major sports news story or injury update again! <br><br>Check out videos of key moments in and around the game and stay on top with personalized alerts for your favorite team, including real-time, deep stats from the fantasy players you care about.<br><br>SPORTS NEWS &amp; SCORES APP &#x2013; THESCORE&#x2019;S TOP HIGHLIGHTS INCLUDE:<br><br>Favorites - This is YOUR personalized feed. All the content you care about from your favorite teams, players and leagues. Just tap &#x2018;Manage&#x2019; to add, delete or reorder your favorites. Set-up notifications so you&#x2019;ll never miss a key moment!<br><br>Scores - A live view of every game. Every score at a glance, updated in real-time. Just tap the matchup for detailed box scores, including live player data, betting lines, news and multimedia.<br><br>Discover - Uncover the biggest social stories and multimedia that&#x2019;s got sports fans talking! This is where you&#x2019;ll find LeBron&#x2019;s latest swag or the sick dunk that&#x2019;s going viral. <br><br>News - Get updated on the top headlines in an instant from across all sports, or tap the league you want at the top of the page to dive deeper.<br><br>Leagues - Check out the latest news, scores, standings, and leaders for the sport you care about. Customize by tapping &#x2018;Manage&#x2019; to reorder or even delete the sports you don&#x2019;t care about. <br><br>Team stats, real-time scores, and news across these major sports:<br>Football (NFL Football, NCAA Football and CFL Football, regular season and playoffs) <br>Baseball (College World Series and MLB Baseball, season play and playoffs)<br>Basketball (NBA Basketball, NCAA Basketball - including March Madness championship and playoffs)<br>Hockey (NHL Hockey, IIHF WJHC - World Junior Hockey Championship, NCAA Frozen Four) <br>Soccer (Premier League Soccer, Champions League, FIFA World Cup, Serie A, La Liga, Bundesliga, MLS, FA Cup, League Cup, Europa League, Ligue 1, Coppa Italia, Copa Del Rey and Liga MX, UEFA European Championships) <br>Golf (PGA, LPGA, Ryder Cup, European Tour, Web.com Tour)<br>Tennis (ATP, WTA)<br>Mixed Martial Arts (MMA: UFC and Bellator)<br>Auto Racing (NASCAR Sprint Cup, Formula 1) <br>Lacrosse (NLL)<br><br>NFL, MLB, NBA, NHL, PGA, MMA, NCAAB, Premier League soccer, World Cup and more &#x2013; download theScore today and always be on top of the latest sports scores and live news from your favorite sports team! <br><br>Need help or have feedback? Email thescoreapp@thescore.com or contact us via &#x2018;Report a Bug&#x2019; in the Settings menu. <br>-- <br>We are affiliated with theScore.com<br>Privacy Policy: http://www.thescore.com/pages/privacy<br>Terms of Use: http://www.thescore.com/pages/terms",
    "histogram": {
        "1": 7323,
        "2": 3860,
        "3": 7951,
        "4": 26107,
        "5": 77475
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone 10+",
    "screenshots": [
        "//lh3.googleusercontent.com/noAPQewMqecYhkqYT60zgXVrRvzH8GrT5eUF8pr-IfPDdyGTOGXOVUzL9RIZik6l93QA=h310",
        "//lh3.googleusercontent.com/1o1EPC2B_I8FPh4m6ODjATJrg4PYOSZMHnaoYG-7UtwjZo1FW-cc92i1rYXwJ0lkl3mJ=h310",
        "//lh3.googleusercontent.com/Hz2zTpXJLCoI_quY8LsBIiDs_pBSV_4dA-OrSYcPuUylbJnbDpQT2pIdT6UFuTe2lg=h310",
        "//lh3.googleusercontent.com/3IHq5ebeCyyVnUzubAW4TyZaadA5s-UqTzRcuP4oPuhnAcsUzPHiN_h8gObOthDA9A=h310",
        "//lh3.googleusercontent.com/XKkO7_1C5_-T3oc8ZooPmg96RCxuiIfR484ptu2cqVnpV5ytYrFZCLC0xARD6dc_A0D9=h310",
        "//lh3.googleusercontent.com/fs18v8VAYnwVHy6IzGJz1dU2XW4jWQBlFGiUdyGsCc7HDDqOBJvA26ely6Sjd0_-FU0=h310"
    ],
    "comments": [
        "Time to look for a new sports app. Crashes non stop on me for both my Samsung tablet and phone. Started doing this couple months ago. Was hoping new updates would fix it. The new version sucks, the old version was perfect. With all the ad money your making now you might want to hire better software development employees.",
        "Ads are becoming too much. Constantly updating lower ad which is conveniently placed right below the navigation bar for accidental clicks. Then ads every 3-4 news items. Enjoyed the content but still wish there was a pro version for now I'll find something else.",
        "Best and only sports app you'll ever need. Only thing is that I'm not interested in the Olympics and no matter how many times I remove the featured item from the list, it keeps reappearing after reopening the app. This is very annoying.",
        "Sitting here at almost 5 am and every single NHL game that ended hours ago on Saturday has not one recap tab available. Have you done away with the recap option? No summary of the games I missed? Ads so big that they cover content. Not impressed with changes.",
        "Love this app, don't mind the new design. Only big thing I think can be improved is a paid, ad-free version. I hate ads with a passion and would not mind paying a buck or two to never see them again.",
        "A few tweaks and this could be a great app. Remove the ad at the footer. There's already an ad in between every 5 articles. Would be nice to select article sources. I want to follow a team to see their upcoming games and live scores but I only want to see articles from theScore, not 3rd party websites who write about the team. Also, can't even watch a video in full screen mode. The ad and menu bar at the footer are persistent so you lose 25% of your screen space. And lastly, it's not breaking news if Zaza Pachulia says Westbrook's comments are childish or if Stan Van Gundy comments about NCAA. Breaking news is Cousins having season ending injury or Blake Griffin getting traded."
    ],
    "recentChanges": [
        "We've got some minor bug fixes and performance enhancements in this update to keep us as fast and awesome as ever. This, plus all our great Winter Games news, scores and stats coverage from every single event!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.fivemobile.thescore&hl=en&gl=us",
    "appId": "com.fivemobile.thescore"
}