{
    "title": "POCKET TUNE - Chromatic Tuner",
    "summary": "The most intuitive tuner for every musician, no matter what instrument you play.",
    "icon": "//lh3.googleusercontent.com/UbpEswiySPLpLfZE6onDBQC5FVPUZb1g8RzNdWCCcpKHgZBfu6E0go6L9nm1IyEvEHI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.9,
    "reviews": 207,
    "developer": "Fretello",
    "developerId": "6901015900245481176",
    "developerEmail": "support@pockettuneapp.com",
    "developerWebsite": "http://www.pockettuneapp.com",
    "developerAddress": "Industriezeile 35 Top 2.24\n4020 Linz\nAustria",
    "updated": "December 11, 2015",
    "version": "1.1.0",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "POCKET TUNE is a highly accurate and intuitive chromatic tuner for every musician. Whether you play brass, woodwinds, strings, acoustic guitar, a Fender, or a Gibson, this chromatic tuner allows you to tune your musical instrument to the right pitch, at the same performance quality as a $50 Seiko or Korg tuner. In addition, this chromatic tuner can be used for pitch ear training, an important talent every musician should master.With its high accuracy and clarity, this tuner is suitable for every musician, regardless if you play• a fretted music instrument such as a ukulele or an acoustic, electric or bass guitar• a fretless music instrument such as violin, cello or contrabass• a brass or woodwind instrument such as clarinet, saxophone, trumpet or tromboneWe have worked with 20+ professional musicians and music teachers who’ve performed  in ensembles, big bands, and orchestras, to test and optimize the POCKET TUNE chromatic tuner app for over 30 different musical instruments, including all kinds of woodwind and brass instruments, acoustic and electric guitars from different manufacturers (e.g. Gibson, Fender, Shecter and ESP), in addition to  all string instruments. Moreover, we compared the quality of this tuner app to   conventional tuners, such as Seiko and Korg tuners.FEATURES• Tune your acoustic, electric or bass guitar to a pitch on the fly. Just play a tone and POCKET TUNE tells you which tone it is and whether or not it’s in perfect pitch.• Improve your intonation with pitch ear training. Select a tone and practice your intonation. Our tuner shows you if you play in or out of tune with easy to grasp colors.• Tune your strings (i.e. violin, cello or contrabass) without caring for the correct  octave range. Use our tuner to select the target pitch you want to tune to and play it on your instrument. POCKET TUNE will show you if your pitch is too high (sharp) or too low (flat) on a cent scale.• As a musician, it is important to train your ear. POCKET TUNE lets you play reference tones, just like a diapason, through your phone's speakers. Use this feature to improve your sense of hearing with ease and to practice tuning your instrument, such as an acoustic guitar or ukulele, by ear.• Adjust the concert pitch with our tuner app. Are you playing a woodwind or brass instrument in a band or orchestra? POCKET TUNE allows you to adjust the default pitch to whatever frequency you need, regardless if it is 438Hz, 440Hz or 444Hz.Download POCKET TUNE now and join our passion for music!We love what we do and want to make the best possible product for you. If you have any feedback let us know and send an email to support@pockettuneapp.com* The actual accuracy of the tuner app depends on the quality of your device's microphone",
    "descriptionHTML": "POCKET TUNE is a highly accurate and intuitive chromatic tuner for every musician. Whether you play brass, woodwinds, strings, acoustic guitar, a Fender, or a Gibson, this chromatic tuner allows you to tune your musical instrument to the right pitch, at the same performance quality as a $50 Seiko or Korg tuner. In addition, this chromatic tuner can be used for pitch ear training, an important talent every musician should master.<br><br><br><br>With its high accuracy and clarity, this tuner is suitable for every musician, regardless if you play<br>&#x2022; a fretted music instrument such as a ukulele or an acoustic, electric or bass guitar<br>&#x2022; a fretless music instrument such as violin, cello or contrabass<br>&#x2022; a brass or woodwind instrument such as clarinet, saxophone, trumpet or trombone<br><br>We have worked with 20+ professional musicians and music teachers who&#x2019;ve performed  in ensembles, big bands, and orchestras, to test and optimize the POCKET TUNE chromatic tuner app for over 30 different musical instruments, including all kinds of woodwind and brass instruments, acoustic and electric guitars from different manufacturers (e.g. Gibson, Fender, Shecter and ESP), in addition to  all string instruments. Moreover, we compared the quality of this tuner app to   conventional tuners, such as Seiko and Korg tuners.<br><br><strong>FEATURES</strong><br>&#x2022; Tune your acoustic, electric or bass guitar to a pitch on the fly. Just play a tone and POCKET TUNE tells you which tone it is and whether or not it&#x2019;s in perfect pitch.<br><br>&#x2022; Improve your intonation with pitch ear training. Select a tone and practice your intonation. Our tuner shows you if you play in or out of tune with easy to grasp colors.<br><br>&#x2022; Tune your strings (i.e. violin, cello or contrabass) without caring for the correct  octave range. Use our tuner to select the target pitch you want to tune to and play it on your instrument. POCKET TUNE will show you if your pitch is too high (sharp) or too low (flat) on a cent scale.<br><br>&#x2022; As a musician, it is important to train your ear. POCKET TUNE lets you play reference tones, just like a diapason, through your phone&apos;s speakers. Use this feature to improve your sense of hearing with ease and to practice tuning your instrument, such as an acoustic guitar or ukulele, by ear.<br><br>&#x2022; Adjust the concert pitch with our tuner app. Are you playing a woodwind or brass instrument in a band or orchestra? POCKET TUNE allows you to adjust the default pitch to whatever frequency you need, regardless if it is 438Hz, 440Hz or 444Hz.<br><br>Download POCKET TUNE now and join our passion for music!<br><br>We love what we do and want to make the best possible product for you. If you have any feedback let us know and send an email to support@pockettuneapp.com<br><br><br>* The actual accuracy of the tuner app depends on the quality of your device&apos;s microphone",
    "histogram": {
        "1": 36,
        "2": 12,
        "3": 8,
        "4": 22,
        "5": 129
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ZGfidCOCumEYRy69YCdtYRIqHAZbHDo1ZN_F55xtVYMWQkcBpRJHpxg3LR50D5452J83=h310",
        "//lh3.googleusercontent.com/7A0cysXmzL_J8Cum-JkaLS00XUVqNpH9z_9o67KIRXBIHzI-8Xm-UP7ymYlWJ2cSmcA=h310",
        "//lh3.googleusercontent.com/9b4GtA89Z3S36yDoj9NMVdr0tQeDQZeykS2VSWi0iaLhmqgyleOgP0CJ_8btCQHFmFk=h310",
        "//lh3.googleusercontent.com/-t3iYcOZqDFPwXlCmFZsUDE8WhdpGYY1gnwoTfmPefecFSr3dw8dYvCwfNSrinmKIQ=h310",
        "//lh3.googleusercontent.com/Mzigmwt-RCnW8GtZWQ1uLR-Q293ZrMrZ-rW66CIYvKvJ0Rvm4GyVNS7g-Ak_-2UcSA=h310",
        "//lh3.googleusercontent.com/4FbHeVwk5rhUaP4kd7-IveD3L5U1tfeSXFLx9RFiifGyPfiR0PtmnPnMPlyYAOYpVg=h310",
        "//lh3.googleusercontent.com/OXZWjp_KIbiydeegVGDa2JEJYmxlIctolfKPGA_RSn9UfmC1gqxJDSTXwb4IXdYmuOnI=h310",
        "//lh3.googleusercontent.com/LcZHQ9Wt_SCZsc6Ui0AXxrqIjOImaBAtXSndUyC9vEA-6hY4KWusZ1PgeHtn4DND5A=h310",
        "//lh3.googleusercontent.com/Xerk1LBObC0kI9qZvBPhAXlI9jPW-fnZFMiX0COmDLSXMaEosIUoVGo6AADrzn8uVaA=h310",
        "//lh3.googleusercontent.com/vkoaBB9lpu_FGGdpiJgVCChhU5S5xEBFVADUFluDLPEoDqK2y-aFko1CQmupY1dLLU_Q=h310",
        "//lh3.googleusercontent.com/SMG-kEL2ictMOKVDB30vybp_MT0d3vXAIdfJ0PKC9rW-L88DGuWKRdvlQJNBYUlMNA=h310"
    ],
    "comments": [
        "Great and simple little app, tunes my double bass perfectly. The only annoying thing is that you can't change it to the concert pitch of 415htz. As a baroque player, and a Viola da Gamba player, it would be nice to be able to tune at A415",
        "Back and forth and back again I play the tuba, and I have a Samsung S5 which has a pretty good microphone, but even with my tuba blaring a C, it first says it's an F, which sounds TOTALLY different than a C, than it says it's a D, then finally a C. Takes so much time to finally tune, and it's meant for every instrement, get your priorities straight people!",
        "Tuning \"sensitivity\" is kinda too low Tried to tune my B-flat clarinet but it often can't catch the notes. Unless there's no background noise. But I can tune with other tuning apps.",
        "It would be great if it actually picked up your notes. I try to tune during class and it picks up nothing. I hate it though. Get a better tuner,  just some advice.",
        "Pretty, about it Slow to identify notes, full screen ads. And worst of all, shaky on a reference tone compared to other tuners tested. Beautiful UI, but needs work. Tested on Nexus 6P.",
        "Great because the pay version lets  you shift master tuning along the Hz spectrum for the A note enabling 432, 444 Hz tuning and etc which is how all music should be!"
    ],
    "recentChanges": [
        "Now even more accurate!",
        "Use your Android Wear device to tune your instrument.",
        "We value your feedback, keep it coming!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pocketlifestyle.music.tune&hl=en&gl=us",
    "appId": "com.pocketlifestyle.music.tune"
}