{
    "title": "Audio Reminder Pro",
    "summary": "Never forget again by reminding yourself in your own voice. Forget me not.",
    "icon": "//lh5.ggpht.com/rTBm93_f7n7PSn8RiX2YMg3KOBjkZ_7REsrhCVvsyNsOi9qRdnID8Soi7oofwzm_TXZg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.3,
    "reviews": 250,
    "developer": "Brandon Andrews",
    "developerId": "Brandon+Andrews",
    "developerEmail": "iamhunted@gmail.com",
    "developerWebsite": "https://www.iubenda.com/privacy-policy/519591",
    "developerAddress": "1310 Gladiolas Dr.\nWinter Park, FL 32792",
    "updated": "February 5, 2016",
    "version": "1.1.33",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "- Never forget again by reminding yourself in your own voice with Audio Reminder Pro.- Use Google Wear to record, schedule, play, or cancel reminders.- Utilizing Google Now alarms you can create your Audio Reminder without ever needing to type with your device.- Remind yourself in your own voice or with the voice of a loved one.- Be woken up with a daily reminder in a loved one's voice.- Reminders play directly on your device's speakers when autoplay is enabled.- Advanced scheduling allows for selecting repeating reminders on specific days of the week.- Play your location reminder the next time you get home with a location reminder.- Need a few more minutes? Just snooze the reminder.- Nothing reminds you better than yourself.With Audio Reminder Pro you record an audio message and have it play back after a scheduled time or when arriving/leaving a location.Forget me not.Audio Reminder was created when I finally got tired of having an idea or plan while in the car only to forget it by the time I got to my destination. I was constantly plagued with thoughts of \"There was something I wanted to do, but what was it.\"Now I simply tap the Audio Reminder widget, say the idea, and in 30 minutes (or however long you decide) Audio Reminder plays my message back to me over my speaker to remind me. If I'm still not ready for the reminder then I can snooze or reschedule it for a later time.Use the widget to track the reminders scheduled to go off today, view, edit, cancel, or create new reminders quickly and easily.Audio Reminder Pro was created to take the place of the original Audio Reminder. It has all of the original features plus much more. Quite literally the app so nice I made it twice.Location based reminders are still in beta.Some of the features include:• Date picker for long term scheduling • Interval picker for scheduling a reminder after a designated amount of time• Location (beta) reminders for reminding yourself to buy eggs the next time you are near the grocery store or to say happy birthday the next time you are at your friends house• On call protection: Reminders do not play if you are on a phone call or VOIP call and will instead reschedule themselves every two minutes until you are off of the call• Optional reminder repeat audio reminder until the reminder is dismissed or snoozed• Multiple language support (translated via machine translations so likely to be incorrect at times all your base are belong to us)• Ping tones based on your devices notification sounds• Optional Vibration• Configurable Recording length (Up to 60 seconds although reminders can be appended repeatedly within reason)• Search for audio reminders by name• Save or share your audio reminder reminder audio♥ Advertisements can be enabled or disabled at whim *sniff*• Audio Reminders can be appended repeatedly as needed• Toggle automatic playing of recording or simply get notified that the reminder is ready to be played• Per reminder options for using popup, notifications, or auto play so you can avoid any embarrassing reminders being automatically played when you are not ready for them• Location search using Google places• Google Wear specific functionality such as dismissing currently playing reminder or playing the reminder again.• Use the volume keys to mute a reminder quicklyRequirements:• Mounted memory card (SD Card) is required for creating and reading of reminders• GPS and internet is required if you desire to use the location based reminders",
    "descriptionHTML": "- Never forget again by reminding yourself in your own voice with Audio Reminder Pro.<br>- Use Google Wear to record, schedule, play, or cancel reminders.<br>- Utilizing Google Now alarms you can create your Audio Reminder without ever needing to type with your device.<br>- Remind yourself in your own voice or with the voice of a loved one.<br>- Be woken up with a daily reminder in a loved one&apos;s voice.<br>- Reminders play directly on your device&apos;s speakers when autoplay is enabled.<br>- Advanced scheduling allows for selecting repeating reminders on specific days of the week.<br>- Play your location reminder the next time you get home with a location reminder.<br>- Need a few more minutes? Just snooze the reminder.<br>- Nothing reminds you better than yourself.<br><br>With Audio Reminder Pro you record an audio message and have it play back after a scheduled time or when arriving/leaving a location.<br><br><br>Forget me not.<br><br><br>Audio Reminder was created when I finally got tired of having an idea or plan while in the car only to forget it by the time I got to my destination. I was constantly plagued with thoughts of &quot;There was something I wanted to do, but what was it.&quot;<br><br><br>Now I simply tap the Audio Reminder widget, say the idea, and in 30 minutes (or however long you decide) Audio Reminder plays my message back to me over my speaker to remind me. If I&apos;m still not ready for the reminder then I can snooze or reschedule it for a later time.<br><br><br>Use the widget to track the reminders scheduled to go off today, view, edit, cancel, or create new reminders quickly and easily.<br><br><br>Audio Reminder Pro was created to take the place of the original Audio Reminder. It has all of the original features plus much more. Quite literally the app so nice I made it twice.<br><br><br>Location based reminders are still in beta.<br><br><br>Some of the features include:<br>&#x2022; Date picker for long term scheduling <br>&#x2022; Interval picker for scheduling a reminder after a designated amount of time<br>&#x2022; Location (beta) reminders for reminding yourself to buy eggs the next time you are near the grocery store or to say happy birthday the next time you are at your friends house<br>&#x2022; On call protection: Reminders do not play if you are on a phone call or VOIP call and will instead reschedule themselves every two minutes until you are off of the call<br>&#x2022; Optional reminder repeat audio reminder until the reminder is dismissed or snoozed<br>&#x2022; Multiple language support (translated via machine translations so likely to be incorrect at times all your base are belong to us)<br>&#x2022; Ping tones based on your devices notification sounds<br>&#x2022; Optional Vibration<br>&#x2022; Configurable Recording length (Up to 60 seconds although reminders can be appended repeatedly within reason)<br>&#x2022; Search for audio reminders by name<br>&#x2022; Save or share your audio reminder reminder audio<br>&#x2665; Advertisements can be enabled or disabled at whim *sniff*<br>&#x2022; Audio Reminders can be appended repeatedly as needed<br>&#x2022; Toggle automatic playing of recording or simply get notified that the reminder is ready to be played<br>&#x2022; Per reminder options for using popup, notifications, or auto play so you can avoid any embarrassing reminders being automatically played when you are not ready for them<br>&#x2022; Location search using Google places<br>&#x2022; Google Wear specific functionality such as dismissing currently playing reminder or playing the reminder again.<br>&#x2022; Use the volume keys to mute a reminder quickly<br><br><br>Requirements:<br>&#x2022; Mounted memory card (SD Card) is required for creating and reading of reminders<br>&#x2022; GPS and internet is required if you desire to use the location based reminders",
    "histogram": {
        "1": 11,
        "2": 12,
        "3": 19,
        "4": 60,
        "5": 148
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/RXZZb0kqTT7WVVf6B01qjMDNprzWMtlkeg8vk4eKlePmI1aA0LBzrcDSxp_kgRam79o=h310",
        "//lh3.googleusercontent.com/CaVNw9Jf1dezjcWV55ZyPu43MkKHDVvr4ukhUJdyjx8y-pzRcCXnJojeFGMeor0r82o=h310",
        "//lh3.googleusercontent.com/5JdBKU5eKR4oqU8Xs4LcGFyxF7SlJPQOQ2fHMRtly9hiz6VvNbBeZOfn2RJXWsKaBtjT=h310",
        "//lh3.googleusercontent.com/hsre2HGNdLGxwl5PsdL_ld4hPVveze9qqqbLAAKAIT6CXXRtNWY_e7pdkjB6O9O4FBU=h310",
        "//lh3.googleusercontent.com/EqWc_JQO7TGEH9gSkJHSMidNlGdOljco4engCDkMY14Jq4-RdSFWTkGkmEUY9ZJ3-7U0=h310",
        "//lh3.googleusercontent.com/x8dnVifYKlDfb9hfkqS52QBgdq6tJNU2DvRNQgs9VKxBsC3iHJUedb_n7Hj42MQ3OQ=h310",
        "//lh3.googleusercontent.com/YwKcXFzW0cLOfUXZN5qyNA2lRSvteqVwTwOOLuZus7MADTPHg9hQ-uvrLpRlyXmNKA=h310",
        "//lh3.googleusercontent.com/LxFFtW0zJ50_PJ_K2j1Rw1QNpWVgo-MqtJ0TQY6ilaRxTvGXcc8uOX8ncm8fPJxF12w=h310",
        "//lh3.googleusercontent.com/VfNZVmfMDZqtkZ3_MzG9MgOu2Xi8ANcXdks-G2Md7Zd_SlQ_-NBir5rLPBE0-x8EFYVU=h310",
        "//lh3.googleusercontent.com/LQLhtWaThuYFfyeRkCiltuOCg7ZlXw3NdHo7oW2mfZ10LAG7zQLRMazymlWyMcXIAyLk=h310",
        "//lh3.googleusercontent.com/bl58HuYSld8iAEjfX8GiDq8J2AMrDI09-_Cjc_mF_CzU4Eh4LL3mY9wW-41Igf3W1k52=h310",
        "//lh3.googleusercontent.com/VMZ9pD32UHH743hB4VhAQi7mJGteem3S08nkRFW1Yax8oJE93SDXJxO47Htgrn0Nu6k=h310",
        "//lh3.googleusercontent.com/eh9j5l6PqcuwEIN-vIbllXB4Ahywu9tynqR5Ndpk1gQqb95F313SueUjPCAevuDotkxl=h310",
        "//lh3.googleusercontent.com/hLo3k3-ubkJKYezTKoQ9z8vwBNZf294D5JTqxnEaW2lyph9SOPP_38tRH_iHhqH_yGWg=h310",
        "//lh3.googleusercontent.com/s8mVrH4CSW_PAiCxg6cqoCsTvIhdkOxYxhy4UeAYjGFV6FxffyD7x3EkjTkcxufNpQ=h310",
        "//lh3.googleusercontent.com/-QbAIVIAHOLaQYtpS7ajFT85Pn3cPGRtueBfCtp_2eh7LhjYEQUwYWpHcsjBYrZ0_A=h310",
        "//lh3.googleusercontent.com/6mwuWejJqVT0N0skvYWt4_GKaxQKMkngUEhIn9CZvJCsej3wc0AbV6erbAShNexuRw=h310",
        "//lh3.googleusercontent.com/0hpl0KtJ9vyOTUUWo5bovxmG45FmNywjVS7YZsNsbyzMpkK73XroamySOZnuXsYD3cI9=h310",
        "//lh3.googleusercontent.com/t5TTztlvJ5JK3aDX6r7ZfcEPmLoAFzbTMOUSeextPjF7Wls9gQXkeyEqPXoW4RmtYE0=h310",
        "//lh3.googleusercontent.com/hTJQQWagtrnl5u5hGs1Rdf78fqiiwM3U21z0p23lQVMsQuyzWYzXcZ-2YeNTbE0eFnQ=h310",
        "//lh3.googleusercontent.com/frF8UpLNFlbgXoS8Nxcq9QEGicZY48Lw4KQFa_hFGChcRLWw56WHWZ-vjDRA15zCqg=h310",
        "//lh3.googleusercontent.com/1fizzKMefG1-ZKukoYqpDrHck2jv4YfdjsEwVRvl8yX6gCCaKAwKpl9qo-mWLLuYMHY=h310",
        "//lh3.googleusercontent.com/VBWh_1vB-7iiEuxYVqUgE1fn1WIx5qDrxFIs33QJ5tDty0txYCTMfZcQ2rY19wNML30=h310",
        "//lh3.googleusercontent.com/qvsW6OBKSF7pFaqEuaTnpJd77Tu6L0FHsYoXyzpCvypC8TvkEDdYacgrVAdmPQDmvxY=h310"
    ],
    "video": "https://www.youtube.com/embed/haJHH_KNoAk",
    "comments": [
        "Nice but fix the bugs This app is exactly wt i wanted. But needs to be improved. It reminds on wrong timings. While entering time, sometimes doesnt accept our choice of time. It wld be wonderfull if a calendar shows our engagement on a particular day. The tasks shld be shown in simple list form. Recording shld be improved. Its v slow.",
        "I wish I had developed this, lol. I plan on making a donation to the \"starving artist\"--using the app to remind myself, of course! Kudos to the dev. Shared an invite immediately after testing. UPDATE: ALSO SHARED TO FACEBOOK. 😁",
        "The best location reminder in the store…  hands down. Really nice app, great job!! My only critique is your logo…  though clever, it is really hard to see what it says especially on the widget. Keep up the good work and you will be rewarded handsomely!!!",
        "Great app, but it does not wake up my phone. So if I don't have a normal alarm set, it won't go off in the morning until press the home button.",
        "Awesome I just started using it but so far the user interface makes it really easy to use and I like that it has a pop-up option and you can choose to have the message read automatically or wait until you tap on the pop-up. Very nice developer keep it up!",
        "Originally five stars. Keeps nagging me to rate after I've already rated. So now it's one star. Hope you're happy."
    ],
    "recentChanges": [
        "- Better compatibility with Android 6",
        "- Fixed permission issue",
        "- Fixed stop button missing from popup on some devices",
        "- Increased recording length maximum to 10 minutes",
        "- New grouped layout which can be disabled",
        "- New preference of minutes to wait before forcing a reminder to play if it failed for some reason.",
        "- Fixed a bug with the widget button not working correctly."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.brandon.audioreminderpro&hl=en&gl=us",
    "appId": "com.brandon.audioreminderpro"
}