{
    "title": "Circle Pay — Send money free",
    "summary": "Send money like a text to friends here and abroad  💸",
    "icon": "//lh3.googleusercontent.com/O8lcRocsqySFtLChk4oQsut_Fi0nfwDvTPk7GSxxaP09VLmN_WlwlGxghFrQkwGVyMM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4,
    "reviews": 9194,
    "developer": "Circle Internet Financial",
    "developerId": "7531027338586476426",
    "developerEmail": "info@circle.com",
    "developerWebsite": "https://www.circle.com",
    "updated": "March 1, 2018",
    "version": "3.24.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Send friends money like you send anything else — easy and free — whether they’re in the same room or a different country. Give your roomie the rent, chip in for the group gift without a big deal and send your friend abroad a drink on you. All without worry. Deposits held in US dollars are insured up to $250,000.FAST & EASY• Pay friends and family instantly with just a phone number or email• Set up in 30 seconds• Just as easy to request money (equally important)FREE• Free to download and free to use• No fees and no exchange rate markups between dollars (USD), pounds (GBP) and euro (EUR) — the rate you see on Google is the rate you get • Cash out to your debit card for, you guessed it, freeFUN• We’re centered around conversations, not transactions, because that’s how people communicate• Add personality with photos, GIFs and emojiSECURE• Deposits held in US dollars are FDIC-insured up to $250,000 and we’re licensed as a Money Transmitter in 48 US states and jurisdictions• If you’re sending money to the UK or Europe, you’ll be interested to know that over there we’re regulated as an E-Money Issuer • Your information is encrypted, your data is private and we’re fully PCI-DSS compliant• Plus, your account is protected by PIN, fingerprint ID and two-step verificationHUMAN• Live support from real human beings• We make mistakes (just making sure you’re reading)BUZZWORTHY“The main selling point of Circle is that it lets app users send money to other people, even non-users, in any part of the world.” — Fast Company“Circle, a money-sending app that works instantly, conducts trades in established currencies like dollars and euros.” — CNN Money“When you need to split the bill, try Circle Pay, a digital money-transfer system that lets people send dollars and euros through iMessage.” — The New York Times“Circle Pay lets you send money to your contacts securely and without having to pay a fee. You can send money in dollars, euros or pounds. And unlike Square Cash, Circle works internationally.”— Macworld",
    "descriptionHTML": "Send friends money like you send anything else &#x2014; easy and free &#x2014; whether they&#x2019;re in the same room or a different country. Give your roomie the rent, chip in for the group gift without a big deal and send your friend abroad a drink on you. All without worry. Deposits held in US dollars are insured up to $250,000.<br><br><b>FAST &amp; EASY</b><br>&#x2022; Pay friends and family instantly with just a phone number or email<br>&#x2022; Set up in 30 seconds<br>&#x2022; Just as easy to request money (equally important)<br><br><b>FREE</b><br>&#x2022; Free to download and free to use<br>&#x2022; No fees and no exchange rate markups between dollars (USD), pounds (GBP) and euro (EUR) &#x2014; the rate you see on Google is the rate you get <br>&#x2022; Cash out to your debit card for, you guessed it, free<br><br><b>FUN</b><br>&#x2022; We&#x2019;re centered around conversations, not transactions, because that&#x2019;s how people communicate<br>&#x2022; Add personality with photos, GIFs and emoji<br><br><b>SECURE</b><br>&#x2022; Deposits held in US dollars are FDIC-insured up to $250,000 and we&#x2019;re licensed as a Money Transmitter in 48 US states and jurisdictions<br>&#x2022; If you&#x2019;re sending money to the UK or Europe, you&#x2019;ll be interested to know that over there we&#x2019;re regulated as an E-Money Issuer <br>&#x2022; Your information is encrypted, your data is private and we&#x2019;re fully PCI-DSS compliant<br>&#x2022; Plus, your account is protected by PIN, fingerprint ID and two-step verification<br><br><b>HUMAN</b><br>&#x2022; Live support from real human beings<br>&#x2022; We make mistakes (just making sure you&#x2019;re reading)<br><br><b>BUZZWORTHY</b><br>&#x201C;The main selling point of Circle is that it lets app users send money to other people, even non-users, in any part of the world.&#x201D; &#x2014; Fast Company<br><br>&#x201C;Circle, a money-sending app that works instantly, conducts trades in established currencies like dollars and euros.&#x201D; &#x2014; CNN Money<br><br>&#x201C;When you need to split the bill, try Circle Pay, a digital money-transfer system that lets people send dollars and euros through iMessage.&#x201D; &#x2014; The New York Times<br><br>&#x201C;Circle Pay lets you send money to your contacts securely and without having to pay a fee. You can send money in dollars, euros or pounds. And unlike Square Cash, Circle works internationally.&#x201D;<br>&#x2014; Macworld",
    "histogram": {
        "1": 1606,
        "2": 219,
        "3": 472,
        "4": 1103,
        "5": 5794
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/kY4m3VjP2PLsZAu1mk8FkGC1w6tg8fkZv59sEZrqRUmhdSPdrGHdMBWCBgRkodrpLRw=h310",
        "//lh3.googleusercontent.com/n19gVSyONJ0G7L_BkAP1nVeT1iQIbJa6En3sSlElYg_mWThDI_WpfVC5t9_ASkeOdBs=h310",
        "//lh3.googleusercontent.com/SX9DASfkhPqHaWn7T1ggpeT5_wcjM_uXxgScESzLBkdpEJPKHInwLvZDw2_qH8WBWUE=h310",
        "//lh3.googleusercontent.com/tQe1sRTSAUUwOWy0y4VOs06Z1jIozcl3tuaL0IB4ZBO6WRFH-q86uPvC4VKOhLPaF7w=h310",
        "//lh3.googleusercontent.com/czpzv7LsViwFbp-dh9MEgfiFRznOVDSToYdlFbC-CNFpZeUzdbMlpyJtz957I3JvrZ4=h310",
        "//lh3.googleusercontent.com/T2jOdVCHvf1PDknJUe3EQs8LrdRejIikdJcacZXnFTzQoAk78gX9FyFkSmRcK80UlWVX=h310"
    ],
    "video": "https://www.youtube.com/embed/CNJlxpB8f2o",
    "comments": [
        "Really easy to pay my pals for anything we owe each other - makes the taxi rides home and group shopping a lot easier to deal with! And the free money goes without saying 😍😍",
        "I love it . I just hate always explaining to people that they have to pay 25 to get the 5",
        "Use my code....n friend me we can make 10 bucks...FNJOBA",
        "FGRSQ my refferal add it in and get £10 :)",
        "Best app ever u get money easily plus it's free",
        "Wicked app"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.circle.android&hl=en&gl=us",
    "appId": "com.circle.android"
}