{
    "title": "World First Money Transfer",
    "summary": "Make international payments cheaper, faster and easier with World First.",
    "icon": "//lh3.googleusercontent.com/E3zvEacR8mMXgeK5vD0GN0HIzjodw8BQ6JJaTipfg-AvQR0SYwioadwXQAmE-rjFoe18=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.6,
    "reviews": 152,
    "developer": "World First Limited",
    "developerId": "World+First+Limited",
    "developerEmail": "mobile.feedback@worldfirst.com",
    "developerWebsite": "http://www.worldfirst.com",
    "updated": "January 26, 2018",
    "version": "5.0.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Make international payments cheaper, faster and easier with our new app.World First helps thousands of private individuals, businesses and online re-sellers transfer money overseas quickly, securely and at the best exchange rates.Features:• Send money internationally in minutes• No hidden fees • Easily keep track of your outstanding paymentsWe make it easy for you to securely log on to the app and manage all your foreign exchange transactions and payments in one place.Register today and make your next money transfer with World First. ",
    "descriptionHTML": "<b>Make international payments cheaper, faster and easier with our new app.</b><br>World First helps thousands of private individuals, businesses and online re-sellers transfer money overseas quickly, securely and at the best exchange rates.<br><br>Features:<br>&#x2022; Send money internationally in minutes<br>&#x2022; No hidden fees <br>&#x2022; Easily keep track of your outstanding payments<br><br>We make it easy for you to securely log on to the app and manage all your foreign exchange transactions and payments in one place.<br><br><b>Register today and make your next money transfer with World First. </b>",
    "histogram": {
        "1": 34,
        "2": 14,
        "3": 8,
        "4": 15,
        "5": 81
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/n4pleCmI_QbrUN6tibz883PFNmZpKDmng_lMdPnskmT0VDC8b1Yj6RvFYAoGLOrBFKY=h310",
        "//lh3.googleusercontent.com/gL95v_v2op8I16dw1yGbb6FnDA_rIIDUkjEGYyjenhpYB6HZi-AOPrGC24LUXhsJZyw=h310",
        "//lh3.googleusercontent.com/mJ4f0HDsigH6PPw0i_awqkkAasQuta7ABFgtnr1zUfwuv3HvqKNaAogwu4NpDAyoD-FT=h310",
        "//lh3.googleusercontent.com/nK3XQDvmzAMeulAC9gF9RBqTu6gBBjsdAxH5cuSRhoBw4RxZIYtWgemVsLcb1CA2VWSg=h310"
    ],
    "comments": [
        "Oh dear, World First....... great website, deplorable app..... surely it's worth your while investing a few dollars to get a decent app, have happy customers and make bad reviews a thing of the past",
        "The app has many bugs. Don't hold much confidence in security!",
        "This is the second edit of my review following updating the app by mistake and so ended up with the latest version. I am making this plea to the developers - PLEASE REPUBLISH v2.4 AS A DIFFERENT VERSION IN THE PLAY STORE SO THAT THOSE OF US WHO NEED A FUNCTIONING APP CAN GET ON WITH EVERYTHING ELSE WE HAVE TO DO. Whilst the newest version doesn't seem to be crashing as much, WHERE HAVE SAVED TRADES GONE?? Seriously guys, this is ridiculous for a company that does so well in every other way. Once again I'll be relying on sideloading a backup of the old app and trying to avoid it updating. I'm an optimistic person so maybe we'll see a result in 2018...",
        "Just a poor app that needs a complete rewrite. Basically no really point in it as it stands. Dialogues keep coming up too.",
        "Where are the up to date currency rate graphs?",
        "Version 3.1 just downloaded and it keeps crashing when I try to access 'Saved trades'. The app just closes. Before this update everything worked fine. Please look at adding finger print login as well."
    ],
    "recentChanges": [
        "We've made improvements based on your feedback.",
        "New & improved user experience to make sending money even easier.",
        "Loving WorldFirst?",
        "Share the love by giving us a review on the Play Store!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.worldfirst.android&hl=en&gl=us",
    "appId": "com.worldfirst.android"
}