{
    "title": "Walk with Map My Walk",
    "summary": "MapMyWalk tracks the route, distance, pace, and more in real-time using GPS.",
    "icon": "//lh3.googleusercontent.com/sBZfDUiBUo8bgcTzWzIMDvhO6BCpp8D-vJw-vttH6g6ERXM6dSwMAdo-K9K03MyMSZc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 131837,
    "developer": "MapMyFitness, Inc.",
    "developerId": "MapMyFitness,+Inc.",
    "developerEmail": "support@mapmyfitness.com",
    "developerWebsite": "http://www.mapmyrun.com",
    "developerAddress": "211 Walter Seaholm Drive\nSuite 200\nAustin, TX 78701",
    "updated": "March 1, 2018",
    "version": "18.2.3",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Track and map every walk with MapMyWalk and get feedback and stats to improve your performance. Discover new workout routes, save and share your favorites, and get inspired to reach new fitness goals with a community of over 40 million athletes. Whether you’re a beginner on your first long walk or a pro, you’ll find the features and tools you need to stay on track and motivated along the way.TRACK AND MAP YOUR WORKOUTS- Log over 600+ activities with the largest selection of activity types, including: running, cycling, walking, gym workouts, cross training, yoga, and more.- Get audio feedback on every GPS-tracked walk, with customizable voice feedback for stats like pace, route, distance, calories, and elevation.- Connect with 400+ devices to import and analyze all your data in one place.- Add your running shoes and track mileage with Gear Tracker. Get notified when it’s time for a new pair and avoid injuries.- Use Routes to find nearby places to walk, save your favorite paths, add new ones, and share them with others.CONNECT WITH APPS AND WEARABLES- Track your activity with the Android Wear app and view your progress at a glance.- Let your shoes do the tracking with UA Record Equipped connected shoes that automatically track your activity and sync your data with your MapMyWalk app.- Sync your data with the hottest apps and wearables, including Google Fit, Android Wear, Garmin, Fitbit, Jawbone, and more.- Take control of your nutrition by connecting with MyFitnessPal for a comprehensive look at your calorie intake and burn.JOIN THE COMMUNITY- See what your friends are doing on your Activity Feed. Whether just getting into fitness, or competing to win—there’s always someone there to motivate you. - Get social and share your workouts on Facebook and Twitter.- Join Challenges to compete with others, climb the leaderboard, and win awesome prizes.TRAIN LIKE A PRO WITH MVP PREMIUM FEATURES- Become a premium member for an ad-free experience with special features.- Reach your walking goal with a personal training plan which adapts dynamically to your fitness level as you improve.- Monitor & analyze your Heart Rate zones to adjust your training based on your goal.- Set a target for your fitness and stay on track with audio coach updates, including pace, distance, duration, calories & more.- Use Live Tracking to share your real-time walk location and give loved ones peace of mind.- Access additional premium features on MapMyWalk.com.If you upgrade to a premium MVP subscription, payment will be charged to your Google Play account at confirmation of purchase. The monthly subscription costs USD 5.99 per month, while the yearly subscription costs USD 29.99 per year, or USD 2.50 per month. Your subscription renews automatically unless canceled at least 24 hours prior to the end of the current period. There is no increase in cost when renewing.Subscriptions can be managed and auto-renewal turned off in Account Settings under ‘Subscriptions’ in the Google Play Store after purchase. Once purchased, the current period cannot be canceled. Any unused portion of a free trial period is forfeited if you choose to purchase a premium subscription to MVP.Find the full terms and conditions and our privacy policy at https://account.underarmour.com/privacy_and_terms.Note: Continued use of GPS running in the background can dramatically decrease battery life.MapMyWalk is part of the world’s largest digital health & fitness community, Under Armour Connected Fitness, which includes UA Record, MapMyFitness, Endomondo, & MyFitnessPal. These apps were built to empower healthy and active lifestyles with one mission – to make you better.",
    "descriptionHTML": "Track and map every walk with MapMyWalk and get feedback and stats to improve your performance. Discover new workout routes, save and share your favorites, and get inspired to reach new fitness goals with a community of over 40 million athletes. Whether you&#x2019;re a beginner on your first long walk or a pro, you&#x2019;ll find the features and tools you need to stay on track and motivated along the way.<br><br>TRACK AND MAP YOUR WORKOUTS<br><br>- Log over 600+ activities with the largest selection of activity types, including: running, cycling, walking, gym workouts, cross training, yoga, and more.<br>- Get audio feedback on every GPS-tracked walk, with customizable voice feedback for stats like pace, route, distance, calories, and elevation.<br>- Connect with 400+ devices to import and analyze all your data in one place.<br>- Add your running shoes and track mileage with Gear Tracker. Get notified when it&#x2019;s time for a new pair and avoid injuries.<br>- Use Routes to find nearby places to walk, save your favorite paths, add new ones, and share them with others.<br><br>CONNECT WITH APPS AND WEARABLES<br>- Track your activity with the Android Wear app and view your progress at a glance.<br>- Let your shoes do the tracking with UA Record Equipped connected shoes that automatically track your activity and sync your data with your MapMyWalk app.<br>- Sync your data with the hottest apps and wearables, including Google Fit, Android Wear, Garmin, Fitbit, Jawbone, and more.<br>- Take control of your nutrition by connecting with MyFitnessPal for a comprehensive look at your calorie intake and burn.<br><br>JOIN THE COMMUNITY<br>- See what your friends are doing on your Activity Feed. Whether just getting into fitness, or competing to win&#x2014;there&#x2019;s always someone there to motivate you. <br>- Get social and share your workouts on Facebook and Twitter.<br>- Join Challenges to compete with others, climb the leaderboard, and win awesome prizes.<br><br>TRAIN LIKE A PRO WITH MVP PREMIUM FEATURES<br>- Become a premium member for an ad-free experience with special features.<br>- Reach your walking goal with a personal training plan which adapts dynamically to your fitness level as you improve.<br>- Monitor &amp; analyze your Heart Rate zones to adjust your training based on your goal.<br>- Set a target for your fitness and stay on track with audio coach updates, including pace, distance, duration, calories &amp; more.<br>- Use Live Tracking to share your real-time walk location and give loved ones peace of mind.<br>- Access additional premium features on MapMyWalk.com.<br><br>If you upgrade to a premium MVP subscription, payment will be charged to your Google Play account at confirmation of purchase. The monthly subscription costs USD 5.99 per month, while the yearly subscription costs USD 29.99 per year, or USD 2.50 per month. Your subscription renews automatically unless canceled at least 24 hours prior to the end of the current period. There is no increase in cost when renewing.<br><br>Subscriptions can be managed and auto-renewal turned off in Account Settings under &#x2018;Subscriptions&#x2019; in the Google Play Store after purchase. Once purchased, the current period cannot be canceled. Any unused portion of a free trial period is forfeited if you choose to purchase a premium subscription to MVP.<br><br>Find the full terms and conditions and our privacy policy at https://account.underarmour.com/privacy_and_terms.<br><br>Note: Continued use of GPS running in the background can dramatically decrease battery life.<br><br>MapMyWalk is part of the world&#x2019;s largest digital health &amp; fitness community, Under Armour Connected Fitness, which includes UA Record, MapMyFitness, Endomondo, &amp; MyFitnessPal. These apps were built to empower healthy and active lifestyles with one mission &#x2013; to make you better.",
    "histogram": {
        "1": 3663,
        "2": 1741,
        "3": 5389,
        "4": 36670,
        "5": 84374
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/bIszOCmjIQG47BUwxtTmZ26Eg_i0i3-7O6rWr6Nolo9u0H161W6CAYPebFdV4qiYbiU=h310",
        "//lh3.googleusercontent.com/yVYKcsDBZmlhEY8e8A_fR1C6A12huRSF6bowb1ALO119qh-gxaWkByKEF8E6my5KoXY=h310",
        "//lh3.googleusercontent.com/qJTPRUFvP4488Zcf7L-oGU2q56SXiLz3O_QxBuHGlJk2n9RXcSSeySmSwEMHHHynzw=h310",
        "//lh3.googleusercontent.com/VFZF3MLV_-KIu9sZusU6YQPCnxNoutLuwNNTkx1IHFMefP92ElrVY6i3CX58pZjGt-Dq=h310",
        "//lh3.googleusercontent.com/dltGcRECaA5WxXn7QDZPJmhlsgcVl85ya_uaHHa6PAUKNZGDlE3PqgMOoasJAoWbs89d=h310",
        "//lh3.googleusercontent.com/2zaM7Lvatm1_OePRJL-gtLoIiUXT64p2mvslTOPjIg5eRH7L6WfF8tx0z_ECx_J2Th4=h310",
        "//lh3.googleusercontent.com/A6M0ItyWhWmiEalvYJ5zZuXeE2yQKX6xN6XAPS0Llzo_kadOS_a040B6Ha_RJcFF0hU=h310",
        "//lh3.googleusercontent.com/myyyZy1OtQWgm9zsLrhRXCErPdoKj7ofJGUKSk3PTG-ux2k_iLNH_xaohoD4GYklFQ=h310",
        "//lh3.googleusercontent.com/nykxvW4NK7MYl-gM7rkjJLjYGWgrDZ1I56e9qzHkLi_aWTseun-QxtntJtHxSSw4fTE=h310",
        "//lh3.googleusercontent.com/wGxt0FvBIyBTvGsUqMGdQuKlEcGVU9vtJBRcQc-75GmVEaCMsX4rX2m67QM-N3mcxg=h310",
        "//lh3.googleusercontent.com/mhVZOjxkrmA1l2Q_yGf13JN5DcTJV6UkouNOAIsi1yJllVOJIdKPoCP8fgbd4jQ12Q=h310"
    ],
    "comments": [
        "Is a really useful  training aid",
        "Nice app !",
        "If you are a slow walker, like after having surgery, if you walk under 2.5 Kilometres an hour, it keeps pausing and restarting your workout. This gives incredible times for the distance you walk. If you have a bad walk with a lot of pain the time you took according to the programme can be faster than when you had a good day with minimal pain and walked very fast. This is unacceptable. You want to know your genuine time for the walk with no automatic pauses and restarts deducted from your total time.",
        "This app used to be really good and reliable. Just lately it has been nothing but trouble. It will record time and calories but not the distance. I have been to the help page and done everything it tells me to on there. I have also restarted my phone and it is still not working. I know it is not my phone because the person I walk with is having exactly the same problem. I notice when you put it into google search a lot of other people are having the same trouble. Unless Map My Walk get this sorted then I will be looking for a more reliable app.",
        "I used this app throughout 2017 with great success.  It helped me lose over 40 pounds in six months. The recent update however does not sync well within the Android OS on the S7, requiring the battery/sleep settings to be reset before every use in order to allow the app to work with the phone's GPS.  Despite saving settings repeatedly, the two default back to a state that prevents GPS tracking within the app.  An app that requires changes to the battery settings before every use is not convenient enough to use.",
        "A good app normally but lately it stops tracking my location if I don't continually check the phone. Seems to be about 10 minutes after you last used the phone. Really annoying. I don't know if it's an OS issue or an app issue."
    ],
    "recentChanges": [
        "* You spoke, we listened. The feed now defaults to the last tab you visited (Community, Friends, Me).",
        "* New ordering of items in the More menu.",
        "Under Armour Connected Footwear Users:",
        "* Receive periodic personalized coaching tips on the workout details page of runs completed with the latest Connected Footwear shoes with HOVR.",
        "* Only workouts > 2 minutes sync from your shoes to prevent unintended workouts.",
        "* Workouts synced from your shoes will now use your default workout privacy setting."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.mapmywalk.android2&hl=en&gl=us",
    "appId": "com.mapmywalk.android2"
}