{
    "title": "WPCU Mobile Banking",
    "summary": "Wright-Patt Credit Union - Save Better, Borrow Smarter, Learn a Lot!",
    "icon": "//lh3.googleusercontent.com/S2EXBE7tkkPtmNwmAV2i9BUQU4tbFxyQ1pfs8BQO7HgKTkXMcyP1AlbA4Oax27Zs_7rP=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.7,
    "reviews": 9252,
    "developer": "Wright-Patt  Credit Union",
    "developerId": "Wright-Patt++Credit+Union",
    "developerEmail": "ContactUs@wpcu.coop",
    "developerWebsite": "http://www.wpcu.coop",
    "updated": "September 22, 2017",
    "version": "5.6.0.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "The WPCU Mobile Banking App makes it easy and convenient to manage your finances – wherever you are! Quickly and securely manage your WPCU accounts no matter where life takes you. Are you away from your computer and need to pay a bill? Now it’s easier than ever! Or maybe you just need to check your balances, transfer money, deposit a check or find the nearest member center. It’s all easy with the WPCU Mobile Banking App! With 24/7 access, you can: •check balances fast on all of your checking, savings, loan and credit card accounts•deposit a check right from your smartphone•check balances on your smart watch•log in using your fingerprint•transfer funds between WPCU accounts, or even to another WPCU member •pay bills to existing payees •view and activate your cash back offers•find Member Center locations •contact the Member Help Center (during normal business hours) Notes: The WPCU Mobile Banking App is free to download and use, but your phone carrier’s charges may apply. System availability and response time is subject to your carrier’s reliability. Wright-Patt Credit Union - Save Better, Borrow Smarter, Learn a Lot!To learn how we protect your privacy, please visit https://www.wpcu.coop/Portals/3/FAQ/Privacy-Policies/wpcu_privacy_policy.pdf",
    "descriptionHTML": "The WPCU Mobile Banking App makes it easy and convenient to manage your finances &#x2013; wherever you are! Quickly and securely manage your WPCU accounts no matter where life takes you. Are you away from your computer and need to pay a bill? Now it&#x2019;s easier than ever! Or maybe you just need to check your balances, transfer money, deposit a check or find the nearest member center. It&#x2019;s all easy with the WPCU Mobile Banking App! <br><br>With 24/7 access, you can: <br>&#x2022;check balances fast on all of your checking, savings, loan and credit card accounts<br>&#x2022;deposit a check right from your smartphone<br>&#x2022;check balances on your smart watch<br>&#x2022;log in using your fingerprint<br>&#x2022;transfer funds between WPCU accounts, or even to another WPCU member <br>&#x2022;pay bills to existing payees <br>&#x2022;view and activate your cash back offers<br>&#x2022;find Member Center locations <br>&#x2022;contact the Member Help Center (during normal business hours) <br><br>Notes: <br>The WPCU Mobile Banking App is free to download and use, but your phone carrier&#x2019;s charges may apply. System availability and response time is subject to your carrier&#x2019;s reliability. <br><br>Wright-Patt Credit Union - Save Better, Borrow Smarter, Learn a Lot!<br><br>To learn how we protect your privacy, please visit https://www.wpcu.coop/Portals/3/FAQ/Privacy-Policies/wpcu_privacy_policy.pdf",
    "histogram": {
        "1": 161,
        "2": 98,
        "3": 236,
        "4": 1411,
        "5": 7346
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/p0bU2QP-71xYqm6AarsIyrTTlLFTusr2okT1BC8y9E34mgLdCLYMB0wieYouKoQlidQ=h310",
        "//lh3.googleusercontent.com/KeWUi8zwgpC98cY4vrfMZknjYILwViwP3341rFv0eyoBntnxss-jfQ974S52KJ8H_W0=h310",
        "//lh3.googleusercontent.com/bVdx25DC2YXLuyC1INF89VHMOTNMGEvEW-LezXFJbezsrigLfJpJ78iVr1XFikXqKA=h310",
        "//lh3.googleusercontent.com/RovCKlzP0Ns0k1HawvmNUGX1oa8kmSUT06uYBc2SqQppDEamEVbJbP2wx4aUNnTqcMw=h310",
        "//lh3.googleusercontent.com/Sj2sN5VcalFcZcMgkTfTUv-ZsLseU_Ce__UNgYNka0dJNPCxHZewc1MsbLAq5NTAAQ=h310",
        "//lh3.googleusercontent.com/79v9sfvGgVN6G-1PSqoL1Gn1uBxo8RLfCay-uvRSW9E1OfKsYAELQbEbxXVk_vYMlRo=h310",
        "//lh3.googleusercontent.com/DbpdqPDPUcUvgLRce0Plic6iDvKq6t7UpFG17CKegsd5Qe0Onzqf1l4HaNagK6l6Jb0=h310",
        "//lh3.googleusercontent.com/gXvRBM_bfIAHXmOfbzmz6cvOz1neJ1gLUGME5mnz-3yJ4XEbw3X_RcN9n4u73mWhfQ0=h310",
        "//lh3.googleusercontent.com/RCHR62fq6M4ywnAPBzA__v3I2DzIdEvY-QtRft9gdu0TmyUGMCAcvnvIGPt2PME6fA=h310",
        "//lh3.googleusercontent.com/seX2DQn4XlZCxB4pKMQA4eW-L4tx6dJrRdEQQmOW64TN2mKm7qV_8X20KGZxbtTRJ-A=h310",
        "//lh3.googleusercontent.com/VrciPqsASy10XedayR-2OlkWQOm0PrfNLJMWG05ZEWXT08c2YtSMhPpZ2S1aUCx-Mexc=h310",
        "//lh3.googleusercontent.com/YCWYRBjhsf1_O6NwtNtOLv5c5bsVDnHpecXPPARmTQjU1ZOwxmVNIZiujAFQJCXM_No=h310",
        "//lh3.googleusercontent.com/HXgZZdJs2pSgC6Eqebz8OklojTwYVIZ4j0Cjyo-FsqiEnqojwDr4Llit7STwv5b17suG=h310",
        "//lh3.googleusercontent.com/ltmgu-u2Rq-eUPboxbo6Xhzm4hB1CmTo5iiQZdiQ_NgGjEtxmdGFuAjCvJloniOEGFoA=h310",
        "//lh3.googleusercontent.com/viFqPSBIIQ3uXEf8OLWuguUqGY-pUfWDtn1c79O3xUlwb-vxxYaFVUQegw8xQURYURO4=h310"
    ],
    "comments": [
        "Has been a life saver multiple times at the register when I over spent and needed to transfer funds from another account to cover what I was spending. Transfers are instant and so easy! I don't know what took so long I literally waited years for this function but they finally added a memo option to the transfer section so that you can notate what you're transferring money for an absolute necessity for me, now I don't have to use my phone to log on to the actual website to do that and I can leave a memo every time to help me keep track of exactly what I pulled money For. Thanks Wright-Patt.",
        "Great service! The only thing I don't care for is the pop up that sometimes appears, blocking the view of the transaction confirmation number. It is  convenient to use  overall and the recent upgrade is working well ,making  electronic deposits easy and fast from my android.",
        "When trying to submit checks, always takes 12-15 attempts for the back of the checks. Software needs work. Bill pay has created problems despite trying to pay even earlier. 3/5 max rating until you improve.",
        "Anyone saying they have never had a problem with this app is LYING. Half the time it comes up with an Application Error upon opening. The other half of the time it waits to tell you that until you enter your login. If I could give -5 stars, I would. Time to look into Chase banking.",
        "When it works, it's great. Unfortunately, it seems as if every time I REALLY need it, I get an error message that says \"We cannot display your information at this time. Please try again later.\" Overall, it's easy and convenient, just not 100% reliable.",
        "I wish this app had 2 things - to be able to look at the history of bill payments. I was told it is not available on the mobile app and history of payment on bills can only be accessed and seen on a computer. Doesn't make sense.  2nd - I wish you had pattern (making a pattern on dots like my Capital One account has) entry to your account vs always typing in a password. Much easier and convenient. If you had these 2 things, I would give this app a 5 star rating."
    ],
    "recentChanges": [
        "The newest version of the WPCU Mobile App is now available! Check out some of the new & convenient features:",
        "•\tSchedule a future dated one-time transfer, or recurring transfer just as you can within Online Banking",
        "•\tRe-order your accounts in Quick Balance",
        "•\tAdd a memo to a transfer, including recurring transfers",
        "•\tSearch your transaction history",
        "•\tUpdate your contact information",
        "•\tNew payment options available for Mortgages: Escrow Only and Principal Only",
        "•\tSome bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.ifs.banking.fiid1359&hl=en&gl=us",
    "appId": "com.ifs.banking.fiid1359"
}