{
    "title": "Myzone™",
    "summary": "Myzone™ is a complete monitoring system to track the physical activity of users.",
    "icon": "//lh3.googleusercontent.com/YCbP0F-cSGIrkj3clGGvC4PIw1rSz-pcu0MI8RKvj8gb5Bb2VjPV8Me2jWJmY_fJS_w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 3735,
    "developer": "MYZONE",
    "developerId": "MYZONE",
    "developerEmail": "developer@myzone.org",
    "developerWebsite": "http://www.myzonemoves.com",
    "updated": "February 22, 2018",
    "version": "2.20",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Myzoneis the next big step in sports wearables, motivating you to get the most from exercise, whatever your fitness level, however you train. It lets you know how hard you’re trying when you work out and features a heart rate accuracy of over 99%. MYZONE also offers amongst the most precise calorie-crunch data on the market, plus the ability to effectively calculate cardio and weight training.Myzone uniquely rewards effort, while providing a game based platform and social experience that is both inclusive and engaging to all, regardless of athletic ability. As the name suggests, its technology creates bespoke and responsive targets for each individual, to provide personal feedback – hence ‘Myzone’.Creating a personal handicap based on your maximum heart rate, it is possible to beat an elite athlete by simply working harder. For example, you might finish behind an elite athlete in an endurance run, but exert greater effort and MYZONE makes you the winner – so everyone competes on a level playing field.MYZONE encourages competition with other users through cloud-based challenges via a web-based account and bespoke app. The community aspect of MYZONE makes it a Facebook for physical activity. Users can analyze, ‘like’, and comment on each other’s workouts, while the app logs your activity history and even updates you over email. In fact, this is the only system to recognize and notify you when you have attained the World Health Organization’s recommended guidelines for physical activity.The Myzone App allows you to sync your MyzoneMZ-3 Physical Activity Belt with your phone meaning you can now see live data and upload stored workouts on your phone. If you prefer to use your MZ-3 with third party fitness apps then your data will still be stored (up to 16 hours) until you sync with your Myzone™ app. **** Please note that the app will only work if you have a Myzone™ Account (you can create an account in the app for free if you don’t have one already) and your tile will only be shown and data uploaded if you have the new Myzone™ MZ-3 Physical Activity Belt.”",
    "descriptionHTML": "Myzoneis the next big step in sports wearables, motivating you to get the most from exercise, whatever your fitness level, however you train. It lets you know how hard you&#x2019;re trying when you work out and features a heart rate accuracy of over 99%. MYZONE also offers amongst the most precise calorie-crunch data on the market, plus the ability to effectively calculate cardio and weight training.<br><br>Myzone uniquely rewards effort, while providing a game based platform and social experience that is both inclusive and engaging to all, regardless of athletic ability. As the name suggests, its technology creates bespoke and responsive targets for each individual, to provide personal feedback &#x2013; hence &#x2018;Myzone&#x2019;.<br>Creating a personal handicap based on your maximum heart rate, it is possible to beat an elite athlete by simply working harder. For example, you might finish behind an elite athlete in an endurance run, but exert greater effort and MYZONE makes you the winner &#x2013; so everyone competes on a level playing field.<br><br>MYZONE encourages competition with other users through cloud-based challenges via a web-based account and bespoke app. The community aspect of MYZONE makes it a Facebook for physical activity. Users can analyze, &#x2018;like&#x2019;, and comment on each other&#x2019;s workouts, while the app logs your activity history and even updates you over email. In fact, this is the only system to recognize and notify you when you have attained the World Health Organization&#x2019;s recommended guidelines for physical activity.<br><br>The Myzone App allows you to sync your MyzoneMZ-3 Physical Activity Belt with your phone meaning you can now see live data and upload stored workouts on your phone. If you prefer to use your MZ-3 with third party fitness apps then your data will still be stored (up to 16 hours) until you sync with your Myzone&#x2122; app. <br><br>**** Please note that the app will only work if you have a Myzone&#x2122; Account (you can create an account in the app for free if you don&#x2019;t have one already) and your tile will only be shown and data uploaded if you have the new Myzone&#x2122; MZ-3 Physical Activity Belt.&#x201D;",
    "histogram": {
        "1": 266,
        "2": 170,
        "3": 208,
        "4": 775,
        "5": 2316
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/qujcuxCQDIvko4Gu1-yT54eWRorqf8Rgv8iMUAMQYiat_s4f0UnnciNj99NubMKAtlQ=h310",
        "//lh3.googleusercontent.com/mBz1MBEsT6CXCw0OtuDDih_IjFBvwzIhi2oI7nRguA-Aa8HFLajIZwyh-483n3N75-e-=h310",
        "//lh3.googleusercontent.com/KRgKnoA4BdHAfAuUBIbgHGHm_TR19MOp1x1uAysivgc2HIVz_9qvUd2vQG1flmzGy8c=h310",
        "//lh3.googleusercontent.com/J37npl2p3qQ7CvAClQWrxhfcICzmMni7L_ARPLl0zdEZ8Udhnkx1NveqjJVv6W3tdA=h310",
        "//lh3.googleusercontent.com/q-_NDbtPzX3EEUmrBNif1UHg9_IbqYRxPV_niCNjPtIo76KlowocJdaTWU60VYOHnQ=h310",
        "//lh3.googleusercontent.com/mon2hQj2cTr9RBAOdq8YSl2De1BSSjKcXHR2HLlNA5m0fSRfrxmDf2somlDRZih0J04=h310",
        "//lh3.googleusercontent.com/enkODPMOEt6zdoX5q6pT-5fUiYBUvO1Wz3R3u7QnwneY68zVj46XJT6tg1gQcsMJSA=h310",
        "//lh3.googleusercontent.com/kVwWaNlW3rjy1l_HE82Wci8j67Z8thFxUdM3Iq3B8qsP6FHYzdJtP1Z-Omf9oMWtp8g=h310",
        "//lh3.googleusercontent.com/DdFfP9QLpfLStq64MWfApSWzmdcAUjODsPUWZ9DvIxV9mtNyav5STaK19PZ_KC7gTZI=h310"
    ],
    "video": "https://www.youtube.com/embed/1_PzcbXKv3s",
    "comments": [
        "Hasn't worked for over 3 months without a single response from the developers. Another update and it still doesn't work. I dropped out of the beta program thinking that might be the issue but that wasn't it.",
        "Data sync is garbage and the interface looks like it's from the 90s.",
        "Great app when it work but recently it has started crashing a lot",
        "Awesome way to track fitness",
        "The app syncs with the belt only intermittently.  It is slow, unpredictable and unreliable.  I have uninstalled and reinstalled the app.  I have checked and double checked the permissions etc.  All are correct.  The MyZone belt capabilities are rendered useless because of this extremely poor app.  Please sort it out as I've paid a lot of money for a product which cannot be utilised due to the poor app it is used with.",
        "Installed it and followed registration and now the app won't do anything. Just shows a welcome page and all icons/buttons are unresponsive. Totally useless. Only saving grace is my gym automatically captures the data live also so I don't have to rely on the app just now. But I can't use it outside of gym... Disappointed."
    ],
    "recentChanges": [
        "2.20",
        "Become a beta tester: https://play.google.com/apps/testing/com.myzone.myzoneble",
        "- Added option to toggle between grid and list view of connections,",
        "- Bodymetrics summary page moved from MyStats to Bodymetrics page,",
        "- Added option to change account language in MyProfile,",
        "- Changed way of editing MZChat members,",
        "- Added \"Last updated\" message to MZChats list,",
        "- \"Heart\" icon replaced with \"Like\" animation,"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.myzone.myzoneble&hl=en&gl=us",
    "appId": "com.myzone.myzoneble"
}