{
    "title": "Camera remote control",
    "summary": "Control your SONY Action Cam remotely and get photos and videos the easy way.",
    "icon": "//lh3.googleusercontent.com/t3scqLBAGZYeE7YiLgSvBXIOopSYiO5iTSauOnPUzLty1UZ6QkYswU-5_qHUL4S2qCY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.3,
    "reviews": 445,
    "developer": "Sony Mobile Communications",
    "developerId": "4851747018805076305",
    "developerEmail": "apps@sonymobile.com",
    "developerWebsite": "http://www.sonymobile.com",
    "developerAddress": "Mobilev. 4\n22188 Lund\nSweden",
    "updated": "August 4, 2016",
    "version": "1.1.A.0.0",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Take great photos and videos the easy and natural way remotely! This is the official Sony Camera remote control application for your Sony SmartWatch 3. With this app you can check the angle and control the shutter of your SONY Action Cam using your SmartWatch 3. You can also start and stop videos, capture photos using our timer function selected Action Cam* and check the pictures taken remotely in the preview screen mode.*Depends on capability of timer function of Action Cam  To install this app Android Wear OS 5.1.1 or higher is required on your SmartWatch 3. Works with SONY Action cam: HDR-AS50, FDR-X1000V, HDR-AS200V, HDR-AS100V, HDR-AZ1, HDR-AS30V, HDR-AS20If you want to develop apps or app extensions for innovative Sony accessories, go to www.sonymobile.com/developerEnjoy!",
    "descriptionHTML": "Take great photos and videos the easy and natural way remotely! <br>This is the official Sony Camera remote control application for your Sony SmartWatch 3.<br> <br>With this app you can check the angle and control the shutter of your SONY Action Cam using your SmartWatch 3. You can also start and stop videos, capture photos using our timer function selected Action Cam* and check the pictures taken remotely in the preview screen mode.<br><br>*Depends on capability of timer function of Action Cam <br> <br>To install this app Android Wear OS 5.1.1 or higher is required on your SmartWatch 3.<br> <br>Works with SONY Action cam: HDR-AS50, FDR-X1000V, HDR-AS200V, HDR-AS100V, HDR-AZ1, HDR-AS30V, HDR-AS20<br><br>If you want to develop apps or app extensions for innovative Sony accessories, go to <br>www.sonymobile.com/developer<br><br>Enjoy!",
    "histogram": {
        "1": 157,
        "2": 13,
        "3": 26,
        "4": 56,
        "5": 193
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/9NrlfBXasH_c6MZFoGdOGgiT64Gd_srMGmHpRN6vbhw5I_idnz-X5XMpG2DJuyvUcfs=h310",
        "//lh3.googleusercontent.com/ZJw6O38Gs7ulpdAWU2FiWP3hwlNN7NT5V2H1KGga_s9b_bHSjVst9LUMNccr1Gp8TJ8=h310",
        "//lh3.googleusercontent.com/wWsDy0j58q7wXiFV1Tvsingxu95jseBcbnJzDzpFEL8torGp2--em1aF1tapUfT5vXQ=h310"
    ],
    "comments": [
        "Works great. The people with negative reviews are unscho... and uninformed. Camera need another application \"Remote App\" from Sony too and both must be installed.  Search, read and think also!",
        "Where is the app for android device. I bought  a point and shoot sony cmera  and u guys didn't made the app for that. How u want people to buy your sony device if u dont keep conection between these devices. Well listen this sony i will return this 600$ camera and buy canon instead . They didn't put monopol on conections with other devices.  U guys are rip off. Shame in you sony.Everybody have an android or iPhone.  How come u guys didn't made the app for conecting android. I have my watch and i dont need another watch on the other hand. You guys dont see everyone gave you 1 star?  Doesn't ring no bell for sony. This way nobody will buy sony cameras.",
        "Ppl in the comments are right. I have a Note 4, sony smartwatch 3 and a sony FDR-1000X action camera yet it wont connect at all",
        "Old proprietary Sony tricks again This is why I never buy Sony hardware.  They always find a way to never work with anything but their own stuff.  So much for looking out for their customers.",
        "Only ssw 3 support I would like to use this app with my android wear watch and my Sony camera. Please add the support for other Android Wear watches!",
        "Only works with sony watch This app should get updates to work with other brands like samsung gear s2 .. it have all required option to do the same thing.."
    ],
    "recentChanges": [
        "- You can change the camera that you want to connect to"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.sonymobile.liveviewremote&hl=en&gl=us",
    "appId": "com.sonymobile.liveviewremote"
}