{
    "title": "ASUS PixelMaster Camera",
    "summary": "Capture your precious moments – perfectly",
    "icon": "//lh6.ggpht.com/q2FsKii1Rby2AiF6MDkpxoTSBqJwzhv8nPy4XtOz5SUEUYqqhS6_UZC30M5SZhrXVxo=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.4,
    "reviews": 608338,
    "developer": "ZenUI, ASUS Computer Inc.",
    "developerId": "6704106470901776285",
    "developerEmail": "zenui@asus.com",
    "developerWebsite": "http://www.asus.com",
    "developerAddress": "NO. 400, Sec. 7, Chende Rd., Beitou Dist., Taipei 112, Taiwan",
    "updated": "June 29, 2016",
    "version": "Varies with device",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "size": "Varies with device",
    "description": "With ASUS PixelMaster Camera at your fingertips, there’s no need to worry about fiddly options or settings to capture great photos. Our unique scene-detection technology analyses your surroundings instantly, suggesting the best mode for your shot.From dusky evening scenes and low-light indoor shots to bright, high-contrast environments, ASUS PixelMaster Camera enables effortless mode-switching. So, no matter whether capturing exciting sporting moments, beautiful scenery on your travels or cute shots of your kids, ASUS PixelMaster Camera turns you into a professional sharp-shooter – all at the touch of a button!Key Features-\tGet down to the basics. Optimize your photos via Auto mode, which auto-sets the camera settings vis-a-vis the lighting and environment. -\tShoot like a pro! With Manual, Super Resolution, HDR, or Depth of field mode, you can capture vivid, beautiful photos effortlessly like a pro!-\tLet there be light. Capture precious moments even in dimly-lit places via Low Light or Night mode that adjusts the background lighting for picture-perfect moments.-\tLet’s have fun! Have more fun and apply animated effects or creative filters to your photos or videos via GIF Animation, Miniature, Effects, or Time Lapse mode.-\tWiden your reach. Encapsulate all that beauty and scenery via Panorama, PanoSphere, or Selfie Panorama mode.-\tCapture pretty and perfect photos. Capture beautifully-enhanced photos using Beautification, Selfie, Time Rewind, or All Smiles mode. Use Smart Remove to remove unwanted details from your picture-perfect mementos.-\tKeep the camera rolling! Create your own story via a video with High Speed Video and Slow Motion Video modes.NoteThe user interface and features may vary depending on hardware limitation and Android version.More informationFor more product information and videos, check out http://www.asus.com/ZenUI/Feedbacks and suggestionsWe’d love to hear from you! Send us your feedbacks via: zenui@asus.com",
    "descriptionHTML": "With ASUS PixelMaster Camera at your fingertips, there&#x2019;s no need to worry about fiddly options or settings to capture great photos. Our unique scene-detection technology analyses your surroundings instantly, suggesting the best mode for your shot.<br><br>From dusky evening scenes and low-light indoor shots to bright, high-contrast environments, ASUS PixelMaster Camera enables effortless mode-switching. So, no matter whether capturing exciting sporting moments, beautiful scenery on your travels or cute shots of your kids, ASUS PixelMaster Camera turns you into a professional sharp-shooter &#x2013; all at the touch of a button!<br><br><b>Key Features</b><br>-\t<b>Get down to the basics.</b> Optimize your photos via <b>Auto</b> mode, which auto-sets the camera settings vis-a-vis the lighting and environment. <br>-\t<b>Shoot like a pro!</b> With <b>Manual</b>, <b>Super Resolution</b>, <b>HDR</b>, or <b>Depth of field</b> mode, you can capture vivid, beautiful photos effortlessly like a pro!<br>-\t<b>Let there be light.</b> Capture precious moments even in dimly-lit places via <b>Low Light</b> or <b>Night</b> mode that adjusts the background lighting for picture-perfect moments.<br>-\t<b>Let&#x2019;s have fun!</b> Have more fun and apply animated effects or creative filters to your photos or videos via <b>GIF Animation</b>, <b>Miniature</b>, <b>Effects</b>, or <b>Time Lapse</b> mode.<br>-\t<b>Widen your reach.</b> Encapsulate all that beauty and scenery via <b>Panorama</b>, <b>PanoSphere</b>, or <b>Selfie Panorama</b> mode.<br>-\t<b>Capture pretty and perfect photos.</b> Capture beautifully-enhanced photos using <b>Beautification</b>, <b>Selfie</b>, <b>Time Rewind</b>, or <b>All Smiles</b> mode. Use <b>Smart Remove</b> to remove unwanted details from your picture-perfect mementos.<br>-\t<b>Keep the camera rolling!</b> Create your own story via a video with <b>High Speed Video</b> and <b>Slow Motion Video</b> modes.<br><br><b>Note</b><br>The user interface and features may vary depending on hardware limitation and Android version.<br><br><b>More information</b><br>For more product information and videos, check out http://www.asus.com/ZenUI/<br><br><b>Feedbacks and suggestions</b><br>We&#x2019;d love to hear from you! <br>Send us your feedbacks via: zenui@asus.com",
    "histogram": {
        "1": 31450,
        "2": 15235,
        "3": 35912,
        "4": 92615,
        "5": 433126
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/CSwxApgKXGwVog2KRPlrJYOndK11OLWKwXwMXqGY6jNmgDLYeb3qgqsVtm8TqUWFi9Y=h310",
        "//lh3.googleusercontent.com/aiCn6bAlAkSjPSEjKuQ44ajFK2yxps137pXWPc3_tslkd7yYRTHauHu2rpu_kzL1o5U=h310",
        "//lh3.googleusercontent.com/lc-fI0CAZQD0sXxIguxJ06oUJzezLpxz5VCuVZNjxHrHBYOfgHXv7I91R8xSdSJf6rqk=h310",
        "//lh3.googleusercontent.com/yS2xqY9yMc46wbWMlKv34w9tIWi2bkVzlloAzvpvjNWQG4JCJogmR01xO1sipNAQxg=h310",
        "//lh3.googleusercontent.com/b2ChIdxEZ_Z1qKnPYN2YcWpnCM7BTFtXuTQIlvNQJH_BPLAZ84BF7ZijqaGTevmQhw8g=h310",
        "//lh3.googleusercontent.com/2lIhK1npcb0yAg4xBkleXi8eQO9oDdEIQEXjM-AZa1bf4qf9WdXj_EOWPEAragPHoQ=h310",
        "//lh3.googleusercontent.com/gdLeJTUxwAT9-jmWIyaALwroDLWNJFfGxMLYhcFmee__JKsx-qesmswQmP7zePQRENo=h310",
        "//lh3.googleusercontent.com/mPNovhAoR_1OY76-vSvaJ0SRI1qidpb3FibL60lRvy9_eNyWt7BmLl-IgbjIq0KSWLox=h310",
        "//lh3.googleusercontent.com/vJs6B5cBxFsJ0CB-9yu0aUEVJ9GhjVATfSHbvShB79_NX20lZe_f37c95FqiB9kYT5yY=h310"
    ],
    "comments": [
        "Best effects but relatively less clarity.. The beast features. just supper features. asus need to increase the clarity of camera. camera clarity is also not much bad. in this softwere many attractive features are present. but i thik good camere app. Must have facility to capture images from distance. thik can be done by sensing hand movement, vistal or \"capture\" sound to take better image by fixing camera and just capturing images by our activities... this may also attract the peoples to take asus phone. because this is small but sweet feature....",
        "Convenient and feature rich I've found my Tab 8 camera a feature rich addition to an already very well designed tablet computer. I would give it 5 stars if it were better at resolving hand shake, I've found I need to be very steady to get a sharp picture. Knowing that, I set it to a 2 second delay. Inclusion of a 'straightening' feature to the already fairly complete editing tools is nicely done.  Overall, I've become an Asus fan.",
        "Self timer has to be separate, and easy to access. I'm a photographer and I use ZenFone as my pocket camera. Being such a powerful device, I use it to take night shots with timer on. But it's too hard to get timer when most needed and also it's such a nasty experience to miss a shot because of it. I often forget that camera is in timer mode after a night shot, and hence miss the shot in day time. PLEASE MAKE THE TIMER A SEPARATE EASY TO ACCESS BUTTON. Else lots of people who are serious about ZenFone photography are going to face this issue.",
        "1. About superresolution mode-When i try to post it on instagram the image turns completely black and also gets posted black. 2. While clicking a photograph the actual colours are different then what your eyes see even manual mode didnt help.3 when focused on the sky the ground turns dark and vice versa. Please help me know why this happens and what i should do to capture a better picture.",
        "Nice Camera Apps! Nice apps, especially the manual mode, feels like my phone became a DSLR! But I hope the iso and the exposure on manual mode could be set independently without locking one another. And please improve the front camera quality. Or probably just my camera? But nice work!",
        "Ok My camera stop working, it become blank, and said to restart my phone. But many times tried also not working. Then I do factory reset, wipe everything and now its working fine. I love ASUS camera, very quick to take photo and sharp. Keep up. But take note on the blank part, it said some app use it at the same time and ask me close it first."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.asus.camera&hl=en&gl=us",
    "appId": "com.asus.camera"
}