{
    "title": "PixtoCam for Android Wear",
    "summary": "remotely control your phone camera to take pictures and make videos",
    "icon": "//lh3.ggpht.com/h3pyYSPxNvo2SYmzoSJa2tR3oHe66viynXUW1EFEaCRq7RgS1vlwO2ZJqqNv0dQtLw=w300",
    "price": "$1.99",
    "free": false,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4,
    "reviews": 1615,
    "developer": "Pixtogram",
    "developerId": "Pixtogram",
    "developerEmail": "contact@pixtogram.com",
    "developerWebsite": "https://plus.google.com/u/0/103120817703481624092/",
    "developerAddress": "4 rue des peupliers\n57130 Vernéville\nFRANCE",
    "updated": "November 3, 2015",
    "version": "1.4.6",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "description": "PixtoCam allows you to view and control camera from your watch to take pictures or make videos : a viewfinder. Don't matter if your phone is on or off just launch PixtoCam on your Android Wear Watch (\"start viewfinder\") and get a realtime preview. You can select the front or rear camera, choose resolution, zoom in and out, use a self-timer, adjust the flash setting, use torch in video mode and more.Features - Get realtime preview even in movie recording mode* - Works without any action on phone, it can be on/off or locked (when is on there's no window) - voice command : \"start viewfinder\" to launch it. - 2 modes : camera and video - you can set picture resolution and video profile - Automatic rotation - Zoom : double tap to zoom, long click to reset** - Fast select button : change camera, set flash, light torch, self-timer - On top phone battery level and charging state widget (white discharging/green charging) - Spy ready : no action on phone, no window when phone is on, no shutter soundIt is simple, effective and wearableFind your pictures and movies in Pictures/PixtoCam/Please give feedback/suggestions on e-mail or on Google+ :https://plus.google.com/u/0/103120817703481624092/Note you need to have an Android Wear Watch to be able to use this app.LG G Watch, Samsung Gear Live, Moto 360.* some phones are not compatible with preview in video mode.** only for camera with zoom support (most all of devices)",
    "descriptionHTML": "PixtoCam allows you to view and control camera from your watch to take pictures or make videos : a viewfinder. Don&apos;t matter if your phone is on or off just launch PixtoCam on your Android Wear Watch (&quot;start viewfinder&quot;) and get a realtime preview. You can select the front or rear camera, choose resolution, zoom in and out, use a self-timer, adjust the flash setting, use torch in video mode and more.<br><br><b>Features</b><br><br> - Get realtime preview even in movie recording mode*<br> - Works without any action on phone, it can be on/off or locked (when is on there&apos;s no window)<br> - voice command : &quot;start viewfinder&quot; to launch it.<br> - 2 modes : camera and video<br> - you can set picture resolution and video profile<br> - Automatic rotation<br> - Zoom : double tap to zoom, long click to reset**<br> - Fast select button : change camera, set flash, light torch, self-timer<br> - On top phone battery level and charging state widget (white discharging/green charging)<br> - Spy ready : no action on phone, no window when phone is on, no shutter sound<br><br>It is simple, effective and wearable<br><br>Find your pictures and movies in Pictures/PixtoCam/<br><br>Please give feedback/suggestions on e-mail or on Google+ :<br>https://plus.google.com/u/0/103120817703481624092/<br><b>Note you need to have an Android Wear Watch to be able to use this app.</b><br>LG G Watch, Samsung Gear Live, Moto 360.<br><br><br>* some phones are not compatible with preview in video mode.<br>** only for camera with zoom support (most all of devices)<br>",
    "histogram": {
        "1": 199,
        "2": 80,
        "3": 107,
        "4": 334,
        "5": 895
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/w9sob34Uq6Gyn3yE6IpxDm8EGXvt-DvcnXjmV4mX0RAvdYiMg2eR_ePKoGvLSKXP5Q=h310",
        "//lh3.ggpht.com/IAEWvEegv9Ij3KFi4BtGTbpUko7ghcsso3o0YzpSnCQGT5JreGLXeYFyMgD0BfQLCdcS=h310",
        "//lh3.ggpht.com/-vMitmpusoxEyAndqNIw8C_eVQ01BUnKtK2Zcef2MqWHsfbkO5z4yXnqOSXYPrsrIg=h310",
        "//lh6.ggpht.com/Vhd2N3mIMW0FGv_ONflb_3JPANJsCRz9MDjNBq27RMkWwPZtCcgsCxS5LGL7MliPTw=h310",
        "//lh3.googleusercontent.com/e87IXS5AcsXv2rLxngtwy0Kjn-988TaYyP9Am0nNFRU3MPUQquDOtuIK101mR2VlAi0=h310"
    ],
    "video": "https://www.youtube.com/embed/CFCzk9H-SHY",
    "comments": [
        "Works perfectly on my Moto 360 2nd Gen paired with a Sony Z3 Best one I've used. The video feed is nice and smooth, and it stays up to date. Settings can easily be changed from the watch. Works even if the screen on the phone is off. The app doesn't create a shortcut in you're phone ether which is awesome, installs directly to the watch and launches from there!",
        "Works perfectly with HTC One m8 and sw3 watch I love this app. I have tried a few of these kind of apps and this one is the best. We'll worth the money. I like how I can take pictures without anyone knowing. Roll on the random pics. Thank you dev, I wasn't sure about the app but am happy I tried it. The app has quite a bit of lag tho which can be annoying at times. Look forward to an update that will fix this issue . Keep up the good work. A++++++",
        "I purchased this app and it did pretty much exactly what I wanted it to do. Then one day, for some reason it just disappeared from my Huawei watch. Uninstalled and reinstalled on my Nexus 6P, but nothing. I tried to contact the developer writing a review and have gotten no response after about a month. Google will not give a refund for whatever reason. If this app works on your device, you will probably like it, but it may also simply disappear one day without warning and you are left with nothing.",
        "Sad to give this app a low rating.  i LOVED the functionality and features.  However, it vanished on my Note 5!  I could not find the app on the phone after it was initially loaded.  Total STEALTH MODE.  Uninstalled and requested refund.  I want to use it a soon as you fix this deal-killer of a bug.",
        "Loved it on my HTC 10. But with sony xz premium, the highest resolution for video is 1080p.. A little shirt of the 4k video it can produce. And less than the 1440 that the htc 10 provided with this app. Does not work at all with an LG style watch, loads but won't record video. Please update. Thanks",
        "Loved this app back in the day. Unfortunately, it's broken on newer devices and the developer seems to have abandoned it years ago. On a Google Pixel running Android 8.0 and a Moto 360 watch, it crashes immediately when you trigger the shutter. This app is completely broken, and I'm not holding my breath for an updated version."
    ],
    "recentChanges": [
        "- update to latest Android Wear SDK",
        "- fix issues"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.pixtogram.wear.zicam&hl=en&gl=us",
    "appId": "com.pixtogram.wear.zicam"
}