{
    "title": "Copy contacts to wear watch",
    "summary": "Backup Emergency Phone Contact from your address book to your android wear watch",
    "icon": "//lh4.ggpht.com/SNX912bRxwwV0Zvba2FEeSWrOVYQmzfIQMioYVZAiNXWihJh_bbCKhSTNwKQVI6jig=w300",
    "price": "$1.25",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.1,
    "reviews": 11,
    "developer": "Joseph O. De Guzman",
    "developerId": "Joseph+O.+De+Guzman",
    "developerEmail": "hepizoj@gmail.com",
    "developerWebsite": "http://josephdeguzman.info",
    "developerAddress": "#201 Pearls hill terrace 04-223 168977",
    "updated": "August 9, 2015",
    "version": "1.9.3",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "We all keep our contacts on our smartphones, and while many of us sync our contacts with Google or some other service, sometimes our phone dies, maybe it’s stolen, you lose it or something similar and there’s no computer nearby. How do you get your most needed contact information? With Wear Contacts Copy + dialer you can select which contacts you want to see from your watch, and they’ll be copied over to your Android Wear device giving you the ability to look up their information even when you’re not connected to your Android smartphone.Keep your Emergency contact list readily available in your watch. This is useful for cases where your phone runs out of juice or gets separated from you or for workplaces that doesn't allow mobile phones. No need to remember long phone numbers or keep paper notes in your wallet. Just Backup your contacts to you Android Wear.Features:Copies Numbers, Emails and Photo without the need to be connected to your phone (offline)Dial your saved contacts from your wearable.Store/save contact in Wear and get sync automatically when reconnected to phone.Developer note: Please give the phone time to sync the watch app to your android wear.Brought to you by the maker of Wear pebble finder.Pro version:No adsUnlimited contacts copyTested on:Moto360LG G watchNexus 6HTC onefully compatible w/:Gear LiveLG Watch UrbaneSmartWatch 3G Watch RG WatchMoto 360ASUS ZenWatch",
    "descriptionHTML": "We all keep our contacts on our smartphones, and while many of us sync our contacts with Google or some other service, sometimes our phone dies, maybe it&#x2019;s stolen, you lose it or something similar and there&#x2019;s no computer nearby. How do you get your most needed contact information? With Wear Contacts Copy + dialer you can select which contacts you want to see from your watch, and they&#x2019;ll be copied over to your Android Wear device giving you the ability to look up their information even when you&#x2019;re not connected to your Android smartphone.<br><br>Keep your Emergency contact list readily available in your watch. This is useful for cases where your phone runs out of juice or gets separated from you or for workplaces that doesn&apos;t allow mobile phones. <br><br>No need to remember long phone numbers or keep paper notes in your wallet. Just Backup your contacts to you Android Wear.<br><br>Features:<br>Copies Numbers, Emails and Photo without the need to be connected to your phone (offline)<br>Dial your saved contacts from your wearable.<br>Store/save contact in Wear and get sync automatically when reconnected to phone.<br><br><br>Developer note: Please give the phone time to sync the watch app to your android wear.<br><br>Brought to you by the maker of Wear pebble finder.<br><br>Pro version:<br>No ads<br>Unlimited contacts copy<br><br>Tested on:<br>Moto360<br>LG G watch<br>Nexus 6<br>HTC one<br><br>fully compatible w/:<br>Gear Live<br>LG Watch Urbane<br>SmartWatch 3<br>G Watch R<br>G Watch<br>Moto 360<br>ASUS ZenWatch",
    "histogram": {
        "1": 3,
        "2": 2,
        "3": 1,
        "4": 1,
        "5": 4
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/4rimyeVkFKxEl3vtDYaikPNTRIULFCH6omc3ZP8AbRXN9M9-YiSisECd5LijWhRkG90=h310",
        "//lh6.ggpht.com/ou9EO-qWsDHF1USIejUv3AScSAJ0FtKqWR0ZutbTwwthp3TsffQq-L8XfQ3auaENshY=h310",
        "//lh5.ggpht.com/ubpQTdpe27nvzaINWR8L7FQ0oLp2dz-ddSdqrBgYhle7ZCQwFdMxuxt0zfI1TSQD1C7L=h310",
        "//lh6.ggpht.com/DgqUmIU-6ZSqfVCC-UpZS9cJXaJK78nFCvZFO6-7iQZ0-PaLCmrqHUb2kpnnAnLDgfI=h310",
        "//lh6.ggpht.com/UPgEuPpnt2z1H5IES1KzzmgJM5TtncYpe_1az2GwaAuzjRzoT_Asgb60xrLAfXruLRo=h310",
        "//lh6.ggpht.com/996x5nhjMBeCpYT4P7E1xYnYDlwwHQC1_6G3SeJZSSAyDTF6D0djVcxVmwHjOKgWnaQ=h310",
        "//lh6.ggpht.com/7mFnvyojjLUxO3CmKnsOXzZ199NlFgC1ARIyji6yYzX4j0PVV-j89OC1UqbTtWZcSFc=h310"
    ],
    "comments": [
        "This app DOES NOT WORK! with the LG G watch despite having to uninstall and reinstall the watch several times. Don't waste your money! get Watch phone instead, brings all your contacts in the watch with no problem",
        "Needs Serious Updating This app use to work awesome. Now its fallen into the cracks of Android, because of no updates. With Android now on Marshmallow, and the upcoming N, this was built around Lollipop. I can go into the app, set my contacts and it sometimes removes the contacts. But instead of it resyncing itself, I have to uncheck and then recheck those I want to save to my watch. Late update was in 2015 and its now almost 2017... Any updates scheduled",
        "Add address and notes? Great app. Even better if the developer adds the option to load address info and address notes....",
        "Useful coz my phones gets drained faster than my watch and i can still see my emergency contacts"
    ],
    "recentChanges": [
        "1.9.3",
        "Layout fix on all round watches",
        "1.9.1",
        "Fiixed Lollipop Bug where checkboxes cannot be selected.",
        "Sync dialog",
        "1.8",
        "Wear duplicate bug",
        "1.7:",
        "Tablet visibility to Google play",
        "Create contact in Wear",
        "Delete contact in Wear",
        "1.6",
        "Tablet fix",
        "1.5",
        "play services checking",
        "1.2",
        "Dial from wear"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.onemanteamtech.wearcontactscopy&hl=en&gl=us",
    "appId": "com.onemanteamtech.wearcontactscopy"
}