{
    "title": "TruLink Hearing Control",
    "summary": "Listen how you like with TruLink Hearing Control.",
    "icon": "//lh6.ggpht.com/Hg_ErClQ5y2aElDm6yl21QgHrrIxS4JC5Qf6n5pdKmLiRskLo-sp_avHhB4Y1oV51A=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.1,
    "reviews": 201,
    "developer": "Starkey Hearing Technologies",
    "developerId": "Starkey+Hearing+Technologies",
    "developerEmail": "mobile_support@starkey.com",
    "developerWebsite": "http://www.starkey.com",
    "updated": "February 8, 2018",
    "version": "Varies with device",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "size": "Varies with device",
    "description": "With TruLink Hearing Control, people with hearing loss can go anywhere and do everything more conveniently than ever before. That’s because TruLink seamlessly connects your hearing aids to your Android phone — so you can easily adjust volume, memories, and even customize the performance to unique situations. TruLink works with specific hearing aids from Starkey, Audibel, NuEar, MicroTech and AGX Hearing. These hearing aids must be purchased from a hearing care professional. Please go to trulinkhearing.com to locate a professional near you.Main Features:• Lets you control your hearing aid volume and memories via your phone • Lets you personalize and geo-tag memories to match what you do and where you go• Can change memories automatically based on personalized geo-tags (e.g. changes to Coffee Shop memory when you walk into a Coffee Shop)• Adapts automatically when you travel in a car• Find a lost or misplaced hearing aid*Currently supported on: - Samsung Galaxy® S8 running Android OS 7.0- Samsung Galaxy® S7 running Android OS 6.0- Samsung Galaxy® S6 running Android OS 5.0- Samsung Galaxy® S4 or S5 running Android OS 4.4.4- Samsung Galaxy® Note 8 running Android OS 7.0- Samsung Galaxy® Note 7 running Android OS 6.0- Samsung Galaxy® Note 5 running Android OS 5.1.1- Samsung Galaxy® Note 3 or Note 4 running Android OS 5.0- HTC M10 running Android OS 6.0- HTC M7 & M8 running Android OS 5.0- Pixel 2 & Pixel 2 XL running Android OS 8.0- Pixel & Pixel XL running Android OS 7.0- Nexus 5x & 6p running Android OS 6.0TruLink for Android does not provide streaming at this time.",
    "descriptionHTML": "With TruLink Hearing Control, people with hearing loss can go anywhere and do everything more conveniently than ever before. That&#x2019;s because TruLink seamlessly connects your hearing aids to your Android phone &#x2014; so you can easily adjust volume, memories, and even customize the performance to unique situations. <br><br>TruLink works with specific hearing aids from Starkey, Audibel, NuEar, MicroTech and AGX Hearing. These hearing aids must be purchased from a hearing care professional. Please go to trulinkhearing.com to locate a professional near you.<br><br>Main Features:<br>&#x2022; Lets you control your hearing aid volume and memories via your phone <br>&#x2022; Lets you personalize and geo-tag memories to match what you do and where you go<br>&#x2022; Can change memories automatically based on personalized geo-tags (e.g. changes to Coffee Shop memory when you walk into a Coffee Shop)<br>&#x2022; Adapts automatically when you travel in a car<br>&#x2022; Find a lost or misplaced hearing aid<br><br>*Currently supported on: <br>- Samsung Galaxy&#xAE; S8 running Android OS 7.0<br>- Samsung Galaxy&#xAE; S7 running Android OS 6.0<br>- Samsung Galaxy&#xAE; S6 running Android OS 5.0<br>- Samsung Galaxy&#xAE; S4 or S5 running Android OS 4.4.4<br>- Samsung Galaxy&#xAE; Note 8 running Android OS 7.0<br>- Samsung Galaxy&#xAE; Note 7 running Android OS 6.0<br>- Samsung Galaxy&#xAE; Note 5 running Android OS 5.1.1<br>- Samsung Galaxy&#xAE; Note 3 or Note 4 running Android OS 5.0<br>- HTC M10 running Android OS 6.0<br>- HTC M7 &amp; M8 running Android OS 5.0<br>- Pixel 2 &amp; Pixel 2 XL running Android OS 8.0<br>- Pixel &amp; Pixel XL running Android OS 7.0<br>- Nexus 5x &amp; 6p running Android OS 6.0<br><br>TruLink for Android does not provide streaming at this time.",
    "histogram": {
        "1": 35,
        "2": 33,
        "3": 50,
        "4": 34,
        "5": 49
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/d2ncTblT9-F7ni1KaRhxeB69nlblWv3NSDa2sf-cO7ensGRS6nTno0jWYK1PYgwOsA=h310",
        "//lh3.googleusercontent.com/yRxDfWm-zkqi77-XKbUl6YLZXVFAwoZwn7e-YWxn0CeVzEje0aoqvCO4GjFdQJ_WPQ=h310",
        "//lh3.googleusercontent.com/MaqMqIkK20kT-ncOHFQU5gJJYBY5N0HJ02BCaay7jSGqteCmy2f6Lgz0X5Bl4WJvaco=h310",
        "//lh3.googleusercontent.com/ZVwRJyGE2n9j3BG_lRkd7pFEV1kjbuD3vI4PdE-zkJuV1ezSQv9zL5cx2qM0i1QWHD1f=h310",
        "//lh3.googleusercontent.com/uIgickZ87EI2BuUE0O447qd6D0beaXLF_ig-KEmBqLV2zK5oAPCpEoNZy7QOhMo8wvE=h310"
    ],
    "comments": [
        "It's  too complicated for those of us not born in the electronic age. You need to be able to control background noise without having to set it up for every situation. It takes too long naming the setting etc.",
        "I could not follow the instructions",
        "As an app it functions well.  There are limitations for Android users on the hearing aids themselves that should be pointed out by the providers when we purchase Starkey hearing aids.  Apple has the market on streaming audio and media on these HAs because they have put the development in and made it proprietary. 😕 As a faithful android user with hearing loss, it really sucks. But the app works and functions properly.  So there is that.",
        "I have a halo and streaming doesn't work. I used to have an iPhone but tree system was not right for me. Ive always had android/ Samsung devices I shouldn't be forced to by a $800 phone just to stream to my hearing aids. Please make this available. Thank you.",
        "Very happy with them but sometimes it sounds likes breaking glass or waterfallingwhen in a situation with alot of background noise ;it would also be nice the comfort boost would stay activated when switching setting (geo locations) and if androids could answer your phone and stream to hearing aids it would be perfect",
        "Streaming and listening to phone calls a MUST. Don't understand why, since bkuetooth5 has a low power option why that can't be  used. It has been 5 months since a new version. When the S9 comes out will it be supported?"
    ],
    "recentChanges": [
        "General bug fixes and language translation updates"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.starkey.trulink.android&hl=en&gl=us",
    "appId": "com.starkey.trulink.android"
}