{
    "title": "1Weather:Widget Forecast Radar",
    "summary": "1Weather: Real-time global forecasts &amp; alerts",
    "icon": "//lh3.googleusercontent.com/SNNEHkP6Af0AJj02WLotJJvZlW11BAtPduudooJJE_Af4g6yhvBMYNb9hyBR8-f-Nw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.6,
    "reviews": 499134,
    "developer": "OneLouder Apps",
    "developerId": "OneLouder+Apps",
    "developerEmail": "onelouderapps@gmail.com",
    "developerWebsite": "http://www.onelouder.com",
    "developerAddress": "1100 Main St, Suite #1500\nKansas City, MO 64105",
    "updated": "January 9, 2018",
    "version": "Varies with device",
    "genre": "Weather",
    "genreId": "WEATHER",
    "size": "Varies with device",
    "description": "1Weather meets all your weather needs in a simple, beautiful package. Track and view weather forecasts and current conditions for “My Location” to get real-time updates wherever you go, or add any location you choose. Whether you want to check the temperature, precipitation forecast, Doppler radar, or simply keep up with the current phases of the sun and moon, 1Weather has you covered.  Plus, it’s outstanding design, makes getting your weather info both easy and fun.  Why wait?  Make 1Weather your weather today. REVIEWS SPOTLIGHT: \"#1 Best Weather App for Android” – Phandroid “Top 25 apps you should download right now” – CNN Tech \"The Most Attractive, Feature-Packed Android Weather App We’ve Ever Seen\" – Lifehacker “The most beautiful weather app we’ve ever seen” – Android Police Features include: Track current conditions and forecasts for your location and up to 12 locations of your choosing.  Access graphs, precipitation forecast, maps, weather facts and videos, and Severe Weather Alerts (U.S. only) from the National Weather Service (NWS).  Easily share weather conditions with your friends via email and social media. See below for more detailed info: Current Conditions:Feels like Temperature, Wind Speed, Visibility, Humidity, UV Index, Barometric Pressure, Dew Point, Percentage Chance of Precipitation for the Next Hour (POP)Forecasts:Hourly – 2 day / 48 HourDetailed – 1.5 days, detailedExtended – 10 days12 Week – a 1Weather app exclusive, the 12 Week PRECISONCAST from renowned meteorologist Gary Lezak.  A must for planning weddings, vacations, reunions, parties, and other outdoor events!  Features video and text forecasts. Graphs:7 hours of temperature highs and percent chance of precipitation1 week of temperatures highs and lows percent chance of precipitation Precipitation Forecast:7-day percentage chanceMaps:Fullscreen mode with ZoomTerrain, and Satellite map viewsWeather Layers: Radar, Clouds, Severe WeatherSun & Moon:Track Sunrise and Sunset TimeLunar (Moon) PhasesTool Tips - by long pressing icons receive tool tips for more infoNotifications: Current conditions, rich notification and sever weather alerts with optional sound/flash Appearance: Live weather background, dynamic photo backgrounds (Dogs, cats, cars, sports and more), or create your own custom background  Languages: Catala, Cestina, Dansk, Deutsch, English (US), Espanol, Esperanto, Francais, Hrvatski, Italiano, Magyar, Nederlands, Norsk, Polski, Portugues (Portugal), Romana, Slovencina, Slovenscina, Suomi, Svenska, Turkce, Japanese, Korean, Simplified Chinese, Traditional Chinese, and moreTemperature Units: Fahrenheit (*F), Celsius (*C)Wind Units: Miles per hour (mph), Kilometers per hour (km/h), Meters per second (m/s), Knots (kn), Beaufort scalePressure Units: Inches of Mercury (“), Millibars (mb), Millimeters of Mercury (mm), Atmosphere (atm), Kilopascal (kPa)Distance Units: Miles, KilometersDon’t wait any longer. Make 1Weather your weather today.",
    "descriptionHTML": "1Weather meets all your weather needs in a simple, beautiful package.<br> <br>Track and view weather forecasts and current conditions for &#x201C;My Location&#x201D; to get real-time updates wherever you go, or add any location you choose. <br><br>Whether you want to check the temperature, precipitation forecast, Doppler radar, or simply keep up with the current phases of the sun and moon, 1Weather has you covered.  Plus, it&#x2019;s outstanding design, makes getting your weather info both easy and fun.  Why wait?  Make 1Weather your weather today.<br> <br>REVIEWS SPOTLIGHT:<br> <br>&quot;#1 Best Weather App for Android&#x201D; &#x2013; Phandroid&#x2028;<br>&#x201C;Top 25 apps you should download right now&#x201D; &#x2013; CNN Tech&#x2028;<br>&quot;The Most Attractive, Feature-Packed Android Weather App We&#x2019;ve Ever Seen&quot; &#x2013; Lifehacker&#x2028;<br>&#x201C;The most beautiful weather app we&#x2019;ve ever seen&#x201D; &#x2013; Android Police<br> <br>Features include: <br><br>Track current conditions and forecasts for your location and up to 12 locations of your choosing.  Access graphs, precipitation forecast, maps, weather facts and videos, and Severe Weather Alerts (U.S. only) from the National Weather Service (NWS).  Easily share weather conditions with your friends via email and social media. See below for more detailed info:<br> <br>Current Conditions:<br>Feels like Temperature, Wind Speed, Visibility, Humidity, UV Index, Barometric Pressure, Dew Point, Percentage Chance of Precipitation for the Next Hour (POP)<br><br>Forecasts:<br>Hourly &#x2013; 2 day / 48 Hour<br>Detailed &#x2013; 1.5 days, detailed<br>Extended &#x2013; 10 days<br>12 Week &#x2013; a 1Weather app exclusive, the 12 Week PRECISONCAST from renowned meteorologist Gary Lezak.  A must for planning weddings, vacations, reunions, parties, and other outdoor events!  Features video and text forecasts.<br> <br>Graphs:<br>7 hours of temperature highs and percent chance of precipitation<br>1 week of temperatures highs and lows percent chance of precipitation<br> <br>Precipitation Forecast:<br>7-day percentage chance<br><br>Maps:<br>Fullscreen mode with Zoom<br>Terrain, and Satellite map views<br><br>Weather Layers: <br>Radar, Clouds, Severe Weather<br><br>Sun &amp; Moon:<br>Track Sunrise and Sunset Time<br>Lunar (Moon) Phases<br>Tool Tips - by long pressing icons receive tool tips for more info<br><br>Notifications: <br>Current conditions, rich notification and sever weather alerts with optional sound/flash<br> <br>Appearance: <br>Live weather background, dynamic photo backgrounds (Dogs, cats, cars, sports and more), or create your own custom background<br><br>  <br>Languages: <br>Catala, Cestina, Dansk, Deutsch, English (US), Espanol, Esperanto, Francais, Hrvatski, Italiano, Magyar, Nederlands, Norsk, Polski, Portugues (Portugal), Romana, Slovencina, Slovenscina, Suomi, Svenska, Turkce, Japanese, Korean, Simplified Chinese, Traditional Chinese, and more<br><br>Temperature Units: <br>Fahrenheit (*F), Celsius (*C)<br><br>Wind Units: <br>Miles per hour (mph), Kilometers per hour (km/h), Meters per second (m/s), Knots (kn), Beaufort scale<br>Pressure Units: Inches of Mercury (&#x201C;), Millibars (mb), Millimeters of Mercury (mm), Atmosphere (atm), Kilopascal (kPa)<br><br>Distance Units: Miles, Kilometers<br><br>Don&#x2019;t wait any longer. Make 1Weather your weather today.",
    "histogram": {
        "1": 11954,
        "2": 8362,
        "3": 21141,
        "4": 108597,
        "5": 349080
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/5V1_XqLUUKt90eyJGXpQhle-c_U2sFG2-ZYWPDewoxN7D6TYT34UBaYP9ItxpWFWmSTX=h310",
        "//lh3.googleusercontent.com/H6Zakd2FLjBCfPGP5264xd3-niqXEVM4ktTi1RaN2VWi-DoCh4J95aZxhV1yMVjl1RLU=h310",
        "//lh3.googleusercontent.com/RXurtG5HE_OxIeu_gzQXGrXlivDQTBwVHaEb0Lny5cCywBELrjFyFcRtQmgO0-ueTTk=h310",
        "//lh3.googleusercontent.com/nW3k5tJNzQTuXMCU3vAxmAHM1pyltjRbFN6dUqRBujaUktTMQ7nfvJMzmfmEyn0wv-M=h310",
        "//lh3.googleusercontent.com/4v2WZa16smOjaUDbOdwqxPyT5EEmckHBJUCZUG55f7HOvqjKJJd9x1fkD7hdvrWVlt7l=h310",
        "//lh3.googleusercontent.com/uiMSW0HbLBrE6e0aWyONDYnjIJexYElgolFDr1IBblCbKEhp2Cy4QpaUE8U7bXeO6Ic=h310",
        "//lh3.googleusercontent.com/ThL42igFU3kI1G2rZaVVzyW-xOOXupfUuvLTYSi3H4brWzyGMeHEJpl4A5Bg24_oaTo=h310",
        "//lh3.googleusercontent.com/s9x0P1PI5H3Jpkmls8AjzndTH73uw5am-alSfSBbDExlwEwupPgVqcITYMe609eRDhg=h310",
        "//lh3.googleusercontent.com/ER-C3mzK6jso1k9ac0Ai6owAbFSVflCahelzMq--bL-MhLKnlmAEf8S413zVk-CR5aM=h310",
        "//lh3.googleusercontent.com/kbRUEU7qqK3VG59tYEZbQdehyTVpBAU4bgCrn1Z5sPlhE5DinaADMlYsVxfhyX7sekxE=h310",
        "//lh3.googleusercontent.com/a_E3PFIqKdmASJ_0PX8RCYSNQNsgr-gBZR5exxcHIBStHGEITo2DPesRwTbkZwITSzi9=h310",
        "//lh3.googleusercontent.com/SvxCIrmofBPAjW12lNqPIw-AwaX_Evx8rWTE58Qw4NxLHOuvWYj5DxPX9h6BhL-HL3M=h310",
        "//lh3.googleusercontent.com/YfAnFDgCmBzF4oK6JHvjCU9iUtep0rWr5yx9FzOSNvwBKazucA99OclkE6x1Qgf9IQ=h310",
        "//lh3.googleusercontent.com/VZu06bFCs3e_Qw754jpYu3DI_XHDrTCg_Ei3nG5Qj8HrWkzYGwF9hN9x2A9_hD2YxJ4=h310"
    ],
    "comments": [
        "I really like the accuracy of this app and the look of it, esp. the \"live conditions\" look.  But I wish there were more widget sizes and an option to show the weekly forcast on the front of it.  Also, I would rather not have the integrated Google search bar on the widget. I'd give it the last stst if these were included in future updstes. Still, it's the best one I have tried and I bought the ad-free version.",
        "Magnificent design! Simple UI with clear concise info. Easy to read screens on my Samsung Galaxy. Because I live in between 2 major cities, 60 miles either way, all other weather apps I tried had a 15 min delay between radar updates. Here I get radar updates every 5 min. GREAT WORK GUYS!",
        "for the most part i love this widget. its the best one ive used by far. i also love that its slightly customizable. the only things i dont like, and i dont know if this is just my phone or not, but the notifications NEVER go away. no matter how much i dismiss it it just pops right back up immediately. also i dont also have the widget on my lockscreen beside the clock like my last phone. id rather have the widget beside my clock and not as a notification. but other than that i love it",
        "Used to be the best app out there! I absolutely love it. Unfortunately, I cannot stop it from having an ongoing notification on my lock screen even after I have shut this function off in the settings. I have a widget, I have the weather in the left hand corner on my phone, and I can click on it anytime I want to get the weather I do not need a notification on my lock screen and on my top bar. When someone stops this in the settings it should stop it. Fix this and it'll get five stars from me!",
        "This app is fun and useful. It doesn't take long to load and is accurate. I love the weather facts. The only thing I would change is when the weather facts pop up, there should be other options to click instead of 'ok.' to exit out of the pop up. Something like 'that's cool' 'good to know' 'i already knew that' etc. To make it more fun. I feel like 'ok' is such an awkward response to awesome weather facts. But the app itself is great!",
        "Great app design. I have just one issue: Current temp is always accurate but the hourly and high/low forecasts are not accurate. (For example right now it says it's 59 out and the hourly shows 65 and dropping) Not sure where you guys get the data from but it's always off compared to other weather apps (Google, weather channel). Is hourly data not refreshed on demand as well? Maybe that is the issue"
    ],
    "recentChanges": [
        "What’s New in 4.2.3",
        "Fixed Notification Bug",
        "What’s New in 4.2.2",
        "Fixed Sharing",
        "Fixed “Clock Tap Launches”",
        "Fixed Truncated Widget Text",
        "Fixed Widget Settings not Saving",
        "Fixed Black Icon Set on 4x2 Widget",
        "Fixed Severe Layers not working w/clouds",
        "Fixed Time Offset for Many Canadian Locations"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.handmark.expressweather&hl=en&gl=us",
    "appId": "com.handmark.expressweather"
}