{
    "title": "Tinder",
    "summary": "Find friends, dates, relationships and everything in between.",
    "icon": "//lh3.googleusercontent.com/stlBGKS482zWajOTk82IXFZhr22hk_NQewNOAJ0IeptPO73qfNesCyfNwW1-xwBiwv0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4,
    "reviews": 2580073,
    "developer": "Tinder",
    "developerId": "Tinder",
    "developerEmail": "help@gotinder.com",
    "developerWebsite": "http://www.gotinder.com",
    "developerAddress": "Tinder\n8833 W. Sunset Blvd.\nWest Hollywood, CA 90069",
    "updated": "March 1, 2018",
    "version": "8.8.0",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "With 20 billion matches to date, Tinder is the world’s most popular app for meeting new people. Think of us as your most dependable wingman—wherever you go, we’ll be there. If you’re here to meet new people, expand your social network, meet locals when you’re traveling, or just live in the now, you’ve come to the right place. We’re called “the world’s hottest app” for a reason: we spark more than 26 million matches per day. How many dating apps do that? Swipe. Match. Chat. Date. Tindering is easy and fun—Swipe Right to Like someone, Swipe Left to pass. If someone likes you back, It’s a Match! We invented the double opt-in so that two people will only match when there’s a mutual interest. No stress. No rejection. Just swipe, match, and chat online with your matches, then step away from your phone, meet up in the real world and spark something new.Now, start swiping. And remember, when in doubt, Swipe Right. Trust us, the more options you have, the better-looking life becomes. Welcome to Tinder—the largest, hottest community of singles in the world. Don’t be shy, swipe on over. MORE FEATURES? THAT’S A PLUSUpgrade to Tinder Plus for premium features, including: Unlimited Likes so you can Swipe Right to your heart’s content, Passport to chat with singles anywhere around the world, Rewind to give someone a second chance, one free Boost per month to be the top profile in your area for 30 minutes, and additional Super Likes to stand out from the crowd.GET THE GOLD TREATMENTUpgrade to Tinder Gold for a first-class swipe experience: Passport, Rewind, Unlimited Likes, five Super Likes per day, one Boost per month, and more profile controls. But wait, it gets better. Save time and aimless swiping with our Likes You feature, which lets you see who likes you before you swipe. Think of it as your personal Swipe Right concierge—available 24/7—bringing all of your pending matches to you. Now you can sit back, enjoy a fine cocktail, and browse through profiles at your leisure. Goodbye swipe fatigue. Hello #GoldLife",
    "descriptionHTML": "With 20 billion matches to date, Tinder is the world&#x2019;s most popular app for meeting new people. Think of us as your most dependable wingman&#x2014;wherever you go, we&#x2019;ll be there. If you&#x2019;re here to meet new people, expand your social network, meet locals when you&#x2019;re traveling, or just live in the now, you&#x2019;ve come to the right place. We&#x2019;re called &#x201C;the world&#x2019;s hottest app&#x201D; for a reason: we spark more than 26 million matches per day. How many dating apps do that?<br> <br>Swipe. Match. Chat. Date. Tindering is easy and fun&#x2014;Swipe Right to Like someone, Swipe Left to pass. If someone likes you back, It&#x2019;s a Match! We invented the double opt-in so that two people will only match when there&#x2019;s a mutual interest. No stress. No rejection. Just swipe, match, and chat online with your matches, then step away from your phone, meet up in the real world and spark something new.<br><br>Now, start swiping. And remember, when in doubt, Swipe Right. Trust us, the more options you have, the better-looking life becomes. <br><br>Welcome to Tinder&#x2014;the largest, hottest community of singles in the world. Don&#x2019;t be shy, swipe on over.<br> <br>MORE FEATURES? THAT&#x2019;S A PLUS<br>Upgrade to Tinder Plus for premium features, including: Unlimited Likes so you can Swipe Right to your heart&#x2019;s content, Passport to chat with singles anywhere around the world, Rewind to give someone a second chance, one free Boost per month to be the top profile in your area for 30 minutes, and additional Super Likes to stand out from the crowd.<br><br>GET THE GOLD TREATMENT<br>Upgrade to Tinder Gold for a first-class swipe experience: Passport, Rewind, Unlimited Likes, five Super Likes per day, one Boost per month, and more profile controls. But wait, it gets better. Save time and aimless swiping with our Likes You feature, which lets you see who likes you before you swipe. Think of it as your personal Swipe Right concierge&#x2014;available 24/7&#x2014;bringing all of your pending matches to you. Now you can sit back, enjoy a fine cocktail, and browse through profiles at your leisure. Goodbye swipe fatigue. Hello #GoldLife",
    "histogram": {
        "1": 295891,
        "2": 102372,
        "3": 273075,
        "4": 608550,
        "5": 1300185
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/JKwu8292vE1LH12E2uxW4wTD-zkPZNFIqCOg0Ud-tJSx8RP7bx-BxL_a4QpHfj-5Fg=h310",
        "//lh3.googleusercontent.com/S2DSh_rKj74TeqvrJchktXjBlE5OiBR8MQK6dzVeAGoACrtcxrNJaRr_dMsX3DfcvQ=h310",
        "//lh3.googleusercontent.com/TeFj799t_D4fhxqsGBjJlrG0o2-CQECSwzSvqk2dWtSSehtvFABdP5FlOMQG1Lu0OIQ=h310",
        "//lh3.googleusercontent.com/xnla02-eXvaUoxqUldow-X0J1mjF1J292AfFpcMT11ELt2INXd16n4bv2lpVJM7zues=h310",
        "//lh3.googleusercontent.com/H2NSE9HfxXy54kYvpsGeUyzXbKHU-mmn4l2IPhEnIbXmFc5UsKV5GjQi_JUznLW1_GZL=h310"
    ],
    "video": "https://www.youtube.com/embed/dsC6HojGOWY",
    "comments": [
        "No other app compares. Tinder is still the best!",
        "Some improvement in functionality over last couple of months. But I agree with others: many likely fake profiles. Also guys watch out for this trick! I had a chick arrange to meet me  then she just unmatched me when I got there. I don't even know if it was a real person and whether they were actually there or pretending to be. Seems like others experienced this too.",
        "I was banned from Tinder for a violation of the terms and conditions. This, though absurd in my opinion, I can accept. I sardonically requested payment from a user who was berating me for sex. Once again, I understand the request for payment is against terms and conditions. My complaints are as follows: 1. Men constantly harass women for sex utilizing this application, causing discomfort and violating the terms and conditions; 2. When I reached out to Tinder for answers, there was no correspondence. I've been attempting to reach someone for days to no avail.",
        "Why can't I buy the 5 dollar super likes anymore? It's like you are forcing me to get the 40 dollar super like. I know you put an algorithm that makes the buttons stop working after a number of purchases so that us consumers spend more money on your stuff. That's sketchy, unlock that button. I know you know what I'm talking about.",
        "Just full of fake profiles. How I know this? My ex is there with 4 profiles with different names. I asked her about it and she said she does the even have an account. So what tinder is doing is hijacking random pics of girls, creating fake profiles with fake names to populate their swipes so you keep thinking there are real people. Fact is less than 10% are real profiles. Good luck",
        "Can't log in. At all. Tried both with phone number and Facebook. Got absolutely nowhere. This is ridiculous. Why can't I log in?  EDIT: even after spending MONTHS off the app, uninstalling,  reinstalling,  restarting my phone, turning off my mobile data and turning it back on again... Everything I can think of..... NOTHING changed. Still having problems. Just tried to log in 4 TIMES only to be sent 2 verification codes and be told that I can't log in 4 times."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.tinder&hl=en&gl=us",
    "appId": "com.tinder"
}