{
    "title": "Nokia Home Cam - Video & Air Quality Monitor",
    "summary": "An ingenious home monitoring system in just 30 seconds",
    "icon": "//lh3.googleusercontent.com/SbiEyczoPDqdS8uZchzO84044ZHVFkExRN4nmEQoWYjTR0BZ7g-9wpt0ZrweGee0rpaM=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 2.2,
    "reviews": 614,
    "developer": "Nokia Apps Distribution LLC",
    "developerId": "Nokia+Apps+Distribution+LLC",
    "developerEmail": "healthmateandroid-support@nokia.com",
    "developerWebsite": "https://health.nokia.com",
    "updated": "January 11, 2018",
    "version": "1.5.3",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Nokia Home is an elegant HD camera with environmental sensors to stay connected to your loved ones while making your home a healthier, safer place.It offers a cutting-edge way to access to your home from anywhere using your Android Phone/Tablet.Nokia Home is also able to browse through the Home diary to review all the events which happened during the last 48h.By using the free Nokia Home Cam app, you can easily: • Instant access to your home from anywhere: HD video, 2-way audio, 130° wide angle, clear night vision, zoom ePTZ x4 and nightlight• Never miss a special moment: motion and noise alerts in your interactive diary• Build a healthier environment: advanced environmental sensing of air quality• Simple and intuitive connectivity: Wi-Fi, Bluetooth and Ethernet cable",
    "descriptionHTML": "Nokia Home is an elegant HD camera with environmental sensors to stay connected to your loved ones while making your home a healthier, safer place.<br><br>It offers a cutting-edge way to access to your home from anywhere using your Android Phone/Tablet.<br><br>Nokia Home is also able to browse through the Home diary to review all the events which happened during the last 48h.<br><br>By using the free Nokia Home Cam app, you can easily:<br> <br>&#x2022; Instant access to your home from anywhere: HD video, 2-way audio, 130&#xB0; wide angle, clear night vision, zoom ePTZ x4 and nightlight<br>&#x2022; Never miss a special moment: motion and noise alerts in your interactive diary<br>&#x2022; Build a healthier environment: advanced environmental sensing of air quality<br>&#x2022; Simple and intuitive connectivity: Wi-Fi, Bluetooth and Ethernet cable",
    "histogram": {
        "1": 348,
        "2": 68,
        "3": 35,
        "4": 41,
        "5": 122
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Mb0XS0v5hnSHdpkUjq3AUKYHatq74cITvzdH7GVZC8_RHX1-PuED7sCOHk2oV8cGkls=h310",
        "//lh3.googleusercontent.com/LLRrPUJ6am7nlGXIBvD7WSEoYU_3Sv3Fr7fzXtAAfC2CJpImH750RPYVlwKVK7jjOg=h310",
        "//lh3.googleusercontent.com/dA0qohlQp1QgZaXqs93kY_ghddeA4U98yhNsZTR2wWQpNWoTac4KrC8J_el9-P2NXio=h310",
        "//lh3.googleusercontent.com/JOA0Sizia-aoTZev1XLNRcPXeshhe-ZWTRPuf332YWl5uXygNfnlCMrCTFZsw-wyAA=h310",
        "//lh3.googleusercontent.com/ZNyY7Ihej1ylGP6yImOwMO5fMgpddOZMEvrMHY4acc4Mm6QKEqMosHt9_xXEMjpwVRg=h310",
        "//lh3.googleusercontent.com/kghFYgmQrAnZxos1HaSkdxziFh86dCu0QfL_Wea12Gbglw9Y2BwQCUbYFwxrC2dbRVA=h310",
        "//lh3.googleusercontent.com/zrdIgmlDFiHh82kOhCIobDS-R6ChU9DWIhUXy_O_RbhwB376r7HQQE2Er1vp83kKGQ=h310",
        "//lh3.googleusercontent.com/Ct9gYyNqgssYXAOrYLSqt4ZOpF5CfWVHYXKn8eUetsqI1Wyw_tjp4_Q6M0FowJSO9Uo=h310",
        "//lh3.googleusercontent.com/MIAUD9iXhKVaJNV0U3kNxF9hAx4knJhHk13qikX-VPiWHtxCQl9p7uwhnxEwNSzmWw=h310"
    ],
    "comments": [
        "I can say it's not off to an impressive start. Getting the nursery ready and hooked up the monitoring system. Easy install but the video takes forever to load as other reviewers state. I'm not getting notifications of motion or sound - kind of the whole point of a baby monitor. The product does not make me free safe and comfortable while baby sleeps and I'm downstairs. Will be returning product immediately.",
        "The app is very unstable and unreliable. For a 200$ camera the app makes the camera useless. The reliability is so low it doesn't work as a baby monitor.   Edit: camera doesn't connect at all. Need to restart camera at least once a day.   Edit: once the app manages to get an image, it goes black and takes several minutes to load the live stream again.  Edit: app doesn't save settings, it always rests to default. Edit: very unreliable",
        "The app crashed constantly without notification so I thought everything was fine and then I hear my twins wailing from the other room. The app makes the camera useless and waste of $200 dollars. I wish we had checked the app ratings before we bought because the camera ratings are great and none of the comparison reviews we checked mentioned this.",
        "Totally baffling overly clever app UI/UX. For Pete's sake use menus. Hardware would be wonderful but need to return home to unplug / replug when it loses connection - completely undermines use as a remote monitoring tool when I am away. Please keep trying, could be great.",
        "A week and half exchanging emails with customer support (very nice folks). To only be escalated and told they have a know issue with T-Mobile network for remote live view. Doubt it, but if true, shouldn't that have been figured out prior to launch.",
        "The android version app for this product gets stuck as Loading on the live feed, and misses a lot of the options the ios has. Too bad ..."
    ],
    "recentChanges": [
        "Stability enhancements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=com.withings.home&hl=en&gl=us",
    "appId": "com.withings.home"
}