{
    "title": "Baby Monitor Annie - Nanny Cloud Cam WiFi, 3G, LTE",
    "summary": "Best Video &amp; Audio Camera. Unique Multi-Platform App. Watch child&#39;s sleep noise.",
    "icon": "//lh3.googleusercontent.com/UOsBaqcKl7hc8Vak0n32BgLCTjW6w3QJvN-5u4l9kow9OgV_RldJQgOR5MpGsr4KsiI=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.4,
    "reviews": 772,
    "developer": "Master App Solutions",
    "developerId": "7473133955449750675",
    "developerEmail": "support@anniebabymonitor.com",
    "developerWebsite": "https://www.anniebabymonitor.com",
    "developerAddress": "Master Internet, s.r.o.\nJiráskova 21\nBrno\n602 00",
    "updated": "December 7, 2017",
    "version": "1.3.5+4f8ec07d7",
    "genre": "Parenting",
    "genreId": "PARENTING",
    "description": "A stunningly reliable baby monitoring app with an unlimited range working via WiFi, 3G or LTE. Now with high-quality video and lullaby player. Use it to monitor up to 4 children from a limitless number of parent units. Annie Baby Monitor turns any two cellphones or tablets into the perfect babysitting assistant.Annie Baby Monitor always keeps you in touch with your babies.”If you have little ones and are using a baby monitor, you have to download this to give it a try. I think it is the best baby monitor app out there, and I think you will agree”2wired2tired.com”With the Annie Baby Monitor you can monitor up to four children at the same time. You can even track their sleep stats with the handy activity log, which is so different than other baby monitors.”TheNaptimeReviewer.comFEATURESLIVE VIDEOYou can see your baby anywhere and anytime thanks to full screen video in five different quality levels. Feel free to use back or front camera of your device and also the Night Light feature.RELIABILITYThe Annie Baby Monitor works via WiFi, 3G or LTE networks. It reconnects automatically and quickly in the case of WiFi outage! EASY TO USEWith just one glance at your phone‘s display.TOP QUALITY AUDIOYou can hear every noise, every breath and sigh of your child.MULTIPARENT & MULTICHILD & MULTIPLATFORMMonitor up to 4 children sleeping in different rooms. The number of parent units is limitless! You can connect to devices on different software platforms.SOOTHE YOUR CHILDTake care from wherever you are. Talk to your child any time by pressing the mike button. The Annie Baby Monitor never lets your baby feel alone. FAST CONFIGURATIONFast and secure configuration over local WiFi with automatic device lookup or over QR invitation code takes less than 30 seconds.UNLIMITED RANGEA wide range of supported mobile networks brings you limitless connectivity. Thanks to the Annie Baby Monitor you stay connected wherever you go, even where there is a weak WiFi signal.SECURE CONNECTIONAll communication between the child and the parent device is securely encrypted via cloud solution. Industry standard encryption is used to ensure that only parents have access to their baby audio stream.BATTERY ALERTStay informed about the battery status on the child device. Always be alerted when the battery level drops below 10 % or an individually set value.ONE LICENCE PER FAMILYWith the Annie Baby Monitor you only pay once and you are then free to use the application in several devices.WIDE SET OF OPTIONSWant to personalize some surveillance features? With the Annie Baby Monitor you decide when your baby should be considered asleep or how you wish to be notified that your little angel has woken up. Do you love using Annie Baby Monitor? It would be nice if you could leave a positive and honest review on the Play Store.Thank you for using and supporting the Annie Baby Monitor.",
    "descriptionHTML": "A stunningly reliable baby monitoring app with an unlimited range working via WiFi, 3G or LTE. Now with high-quality video and lullaby player. Use it to monitor up to 4 children from a limitless number of parent units. Annie Baby Monitor turns any two cellphones or tablets into the perfect babysitting assistant.<br><br>Annie Baby Monitor always keeps you in touch with your babies.<br><br><i>&#x201D;If you have little ones and are using a baby monitor, you have to download this to give it a try. I think it is the best baby monitor app out there, and I think you will agree&#x201D;</i><br>2wired2tired.com<br><br><i>&#x201D;With the Annie Baby Monitor you can monitor up to four children at the same time. You can even track their sleep stats with the handy activity log, which is so different than other baby monitors.&#x201D;</i><br>TheNaptimeReviewer.com<br><br><b>FEATURES</b><br><b>LIVE VIDEO</b><br>You can see your baby anywhere and anytime thanks to full screen video in five different quality levels. Feel free to use back or front camera of your device and also the Night Light feature.<br><br><b>RELIABILITY</b><br>The Annie Baby Monitor works via WiFi, 3G or LTE networks. It reconnects automatically and quickly in the case of WiFi outage!&#xA0;<br><br><b>EASY TO USE</b><br>With just one glance at your phone&#x2018;s display.<br><br><b>TOP QUALITY AUDIO</b><br>You can hear every noise, every breath and sigh of your child.<br><br><b>MULTIPARENT &amp; MULTICHILD &amp; MULTIPLATFORM</b><br>Monitor up to 4 children sleeping in different rooms. The number of parent units is limitless! You can connect to devices on different software platforms.<br><br><b>SOOTHE YOUR CHILD</b><br>Take care from wherever you are. Talk to your child any time by pressing the mike button. The Annie Baby Monitor never lets your baby feel alone.&#xA0;<br><br><b>FAST CONFIGURATION</b><br>Fast and secure configuration over local WiFi with automatic device lookup or over QR invitation code takes less than 30 seconds.<br><br><b>UNLIMITED RANGE</b><br>A wide range of supported mobile networks brings you limitless connectivity. Thanks to the Annie Baby Monitor you stay connected wherever you go, even where there is a weak WiFi signal.<br><br><b>SECURE CONNECTION</b><br>All communication between the child and the parent device is securely encrypted via cloud solution. Industry standard encryption is used to ensure that only parents have access to their baby audio stream.<br><br><b>BATTERY ALERT</b><br>Stay informed about the battery status on the child device. Always be alerted when the battery level drops below 10 % or an individually set value.<br><br><b>ONE LICENCE PER FAMILY</b><br>With the Annie Baby Monitor you only pay once and you are then free to use the application in several devices.<br><br><b>WIDE SET OF OPTIONS</b><br>Want to personalize some surveillance features? With the Annie Baby Monitor you decide when your baby should be considered asleep or how you wish to be notified that your little angel has woken up.&#xA0;<br><br>Do you love using Annie Baby Monitor? It would be nice if you could leave a positive and honest review on the Play Store.<br><br>Thank you for using and supporting the Annie Baby Monitor.",
    "histogram": {
        "1": 225,
        "2": 59,
        "3": 45,
        "4": 66,
        "5": 377
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/JGoG30UYiIb9fJk_KXX7ULKBjcIzdjlteoDjmecn4FFYClQuvygJ0pAEqOfjIdLyUfpX=h310",
        "//lh3.googleusercontent.com/voifRSzdgahaURM7ikRpdkoiWI0Ql8wQdVCVWPrFj-X2Mlw9aIaphOTyMOAE8sG5qzZu=h310",
        "//lh3.googleusercontent.com/a_m4uJBKNhipz-U43UVrA4tsl_iFEeCFbeOcB-owWVsuTeYpEu16B0QSo4s7BvIxlec=h310",
        "//lh3.googleusercontent.com/d1mHdvYGBVAY7enUyyPZ3HtkGjbtDTSqz2O4BMCIRtY-qzjIrMVBysjFsquTMkZnIQ=h310",
        "//lh3.googleusercontent.com/m7MoTmsiU7xzTuDUJ-ogyZmHy8WFO0dr5sNSCPSnISS-IsRrI01-J1_CsEd90vYu7FCX=h310",
        "//lh3.googleusercontent.com/Wx3dPtc22QpSprMuDiT4IPpNQ34VV4cgL89F0f9KQG9dux5aDTOFSj5YKywNH_djBiFf=h310",
        "//lh3.googleusercontent.com/ItHMQVAVPfHrTc_KBB-b0X-ZXvDxanhxbP5nsMNAkwBD9TrX5zezOG2jDRqXn3bafw=h310",
        "//lh3.googleusercontent.com/nAXKFVEgCzhF4egRB5yngwu45AX378QadwqqFNSaltWwFmnlmZOWJ3PGTZPl4AC8Rzg=h310",
        "//lh3.googleusercontent.com/vdB9Ya-s4lUFcDrezM48BydU8KeHJpPTvdYkuMPDXZ26wEcwmakYoeuVZB5Xt1aLIrk=h310"
    ],
    "video": "https://www.youtube.com/embed/eumE5ucNt3M",
    "comments": [
        "READ BEFORE BUYING: If you buy the full app, it won't work without also subscribing their server connection. Without that you can only use the app when all devices are connected to same wifi.  On the free version different networks worked really nicely and for free, so I think this is really sneaky Business!",
        "Emailed company regarding app. It's really poor video quality when it works. Costs extra if you use it on more than one \"network\" and never got help after emailing about app. Got automated response. Emailing to try to get my money back. Waste of money and time",
        "I can monitor my baby on random basis, one time baby's phone is grayed out, another shown as active, it's inconsistent and not user-friendly, I should either see the message pointing the problem, otherwise it should be possible to monitor, we have it on 2 iPhones and 2 android phones which we switch depending on the needs. We need to switch between parent devices and it doesn't come handy. From current perspective not worth the price.",
        "It is constantly disconnecting and unreliable. The video and audio quality is poor. Note, it will not monitor if you turn on Netflix. Can't trust it.",
        "Poor video quality.  When connecting devices, one baby one parent, video always stops after 2 minutes.  IPad to android sharing video sucks bad.  I guess they hate each other.",
        "Think it's good based on two days use between an iPad and an Android phone. Drops occasionally and the sensitivity is a little wild but all in all a solid cross platform monitor to use from a hotel lobby to a room that is not dependent on being on the same WiFi. Paid extra for the family plan and will continue to use in the future"
    ],
    "recentChanges": [
        "Relay subscriptions"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=cz.master.annie&hl=en&gl=us",
    "appId": "cz.master.annie"
}