{
    "title": "Audi MMI connect",
    "summary": "Send navigation destinations, photos or music from the smartphone to your car.",
    "icon": "//lh6.ggpht.com/ulaTVB0SqrlnHdFRhnWR851SKzxGwBA8A93Nv1P0gtZXJpZeMyvnz5Fp0gOxcrRmyko=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 2.8,
    "reviews": 2394,
    "developer": "Audi",
    "developerId": "Audi",
    "developerEmail": "service@audi.de",
    "developerWebsite": "http://www.audi.com",
    "updated": "December 18, 2017",
    "version": "2.9.0-1712131440",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "Audi MMI connect enables you to use a multitude of Audi connect services, that you can access from your mobile device as well as your vehicle. For any questions you might have please contact our support at: service@audi.de. The setting of WiFi Assist could cause connection problems to your car.Depending on your vehicle and your vehicle’s the options the Audi connect portfolio may vary. Audi connect remote servicesWith Audi connect remote services you can use certain vehicle related functions conveniently from your smartphone (only available with the Audi connect Emergency Call and Service package).e-tron: •\tRemote charge•\tRemote climate control•\tRemote trip statisticsNAVIGATIONAudi MMI connect offers you a number of useful Audi connect services which can help with planning your upcoming trips: •\tTraffic online•\tmyAudi Destinations•\tTravel•\tPicturebook Navigation•\tCalendarMEDIAAudi MMI connect enables you to expand your local Media sources with a number of online Music-providers. Once you are connected to your vehicle’s MMI Wi-Fi Network you can enjoy the following Audi connect services: •\tWebradio•\tNapster (for using Napster via Audi connect you need the Napster App and have a subscription at www.napster .com)To use the Audi connect services please subscribe at myAudi (www.myaudi.com). The offered functions depend in part on interfaces to 3rd party suppliers. Thus the functionality and availability might vary from country to country. We recommend a broadband data connection with a corresponding data flat-rate, Costs might occur according to the contract with your local mobile network operator. Insufficient bandwidth of the data transfer might influence your user experience negatively. Please consider the bandwidth restrictions specific to your mobile network operator. This offer is brought to you by your local vehicle importer. For information about your local vehicle importer please see the app imprint.",
    "descriptionHTML": "Audi MMI connect enables you to use a multitude of Audi connect services, that you can access from your mobile device as well as your vehicle. For any questions you might have please contact our support at: service@audi.de. The setting of WiFi Assist could cause connection problems to your car.<br><br>Depending on your vehicle and your vehicle&#x2019;s the options the Audi connect portfolio may vary. <br><br>Audi connect remote services<br><br>With Audi connect remote services you can use certain vehicle related functions conveniently from your smartphone (only available with the Audi connect Emergency Call and Service package).<br><br>e-tron: <br>&#x2022;\tRemote charge<br>&#x2022;\tRemote climate control<br>&#x2022;\tRemote trip statistics<br><br>NAVIGATION<br><br>Audi MMI connect offers you a number of useful Audi connect services which can help with planning your upcoming trips: <br>&#x2022;\tTraffic online<br>&#x2022;\tmyAudi Destinations<br>&#x2022;\tTravel<br>&#x2022;\tPicturebook Navigation<br>&#x2022;\tCalendar<br><br>MEDIA<br><br>Audi MMI connect enables you to expand your local Media sources with a number of online Music-providers. <br><br>Once you are connected to your vehicle&#x2019;s MMI Wi-Fi Network you can enjoy the following Audi connect services: <br>&#x2022;\tWebradio<br>&#x2022;\tNapster (for using Napster via Audi connect you need the Napster App and have a subscription at www.napster .com)<br><br>To use the Audi connect services please subscribe at myAudi (www.myaudi.com). The offered functions depend in part on interfaces to 3rd party suppliers. Thus the functionality and availability might vary from country to country. We recommend a broadband data connection with a corresponding data flat-rate, Costs might occur according to the contract with your local mobile network operator. Insufficient bandwidth of the data transfer might influence your user experience negatively. Please consider the bandwidth restrictions specific to your mobile network operator. <br><br>This offer is brought to you by your local vehicle importer. For information about your local vehicle importer please see the app imprint.",
    "histogram": {
        "1": 890,
        "2": 324,
        "3": 271,
        "4": 296,
        "5": 613
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/rSopAPIN-6CXZhkQbngSEeU6YT4wDek5RJ0xoTqsX068TdW9aaXyDUSX3pqTXv7mx4c=h310",
        "//lh3.googleusercontent.com/p99Dqt97rm_jUoMVl1YzyHfzUaxZRAsY4PZs4UrkFLUbIUj9r_xuSIwCP6YTo1nGGxCQ=h310",
        "//lh3.googleusercontent.com/gFWl_1tgRD1y80FDNdOwghcq0FqZGcsraqZCq-u1Rp_ZEmzlCrW6saUx9YsPpeAfiIwq=h310",
        "//lh3.googleusercontent.com/FouBPk5ujRrCQM5tc8kXoO9Vc6DpVDIZ3l4OeGF611tVdaNSSvaigiVUKScJEqvEPNm3=h310",
        "//lh3.googleusercontent.com/_DAuHs8oeP_u30y5ESEr9PcJ39l7d6kWs7aDdeuPcfqRSm82SDosNyUREafqDkBLNw=h310"
    ],
    "comments": [
        "Absolute trash. Announcing Amazon music as third option... except on our most popular models.  One of the first two music options shut down permanently last year. Audi MMI is utter garbage with no first tier music options.  My brand new Audi has a worse system than an 8 year old Ford. Pathetic and inexcusable.",
        "Works fine in my 2017 S3 however the find my car doesn't always work be nice if the car picked up it's location from the GPS and sent it back or checked it's accuracy with the app after a few minutes. My car was showing parked 12 hours ago outside work when it's on my drive :-/ Amazon music meh! Why not add useful services like Google Play music deezer and Spotify. Come on Audi buck up your ideas. Too many flaws not enough updates.",
        "I don't understand the point of this app. It doesn't let you control locks, start/stop, etc. My phone notifies me about the power drain from the app (Samsung S8+) about once a day. My previous Chevy was much more advanced. It also doesn't save your parking location without connecting to the car wifi for some reason (rather than using the monthly Audi Connect service I pay for). This app seems to exist solely for the purpose of saying \"there is an app.",
        "Sort this out.....The latest update stated that amazon music is now supported, so I linked my amazon music account to my 2017 S3 and after eventually getting it to work the car locator now always considers my parking location to be my start location and NOT my finishing location if Amazon music is running, what damn use us that?  If I don't run Amazon music through the MMI the car locator works fine, this is an error that needs fixing by the developers.  As I now have one function working or the other but not both!!!  Agree with other reviewers that the functionality is not exactly state if the art for the price we're paying for the cars and options!",
        "Crashes when doing just about anything, such as adding a destination or viewing contacts. Shame on Audi. It looks like they spent less building this app than I did on my accessories. Thinks I've been parked at the same place for weeks. No ability to control any car feature or see fuel levels on my brand new S4. Audi would be better withdrawing the App than falsely claiming it can do anything. At all.",
        "The car locator function does not store my parking location automatically as it should for my 2017 S3. Also, share location from other apps also doesn't work. The car is always disconnected in the settings page. I have set it up all correctly and my Audi dealership is also not able to figured out what's wrong. Not expected from Audi. :("
    ],
    "recentChanges": [
        "- Introducing Amazon Music as the third online music service in addition to Napster and Webradio (excluding the A6 and A7 models)",
        "- MMI Wi-Fi connection is disabled, if the myAudi App is installed",
        "- Many improvements and bugfixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.audi.mmiapp&hl=en&gl=us",
    "appId": "de.audi.mmiapp"
}