{
    "title": "billiger.de Preisvergleich",
    "summary": "Cheap prices &amp; current offers from the best stores",
    "icon": "//lh3.googleusercontent.com/jifgMlzeCy1lZ-8szR6c1kDKuYqXPHkQ-hCVSPazNJPvmRKRxyagl1I7TkR7pyvm2YU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.1,
    "reviews": 3713,
    "developer": "solute gmbh",
    "developerId": "solute+gmbh",
    "developerEmail": "android-app@billiger.de",
    "developerWebsite": "http://www.billiger.de",
    "updated": "January 16, 2018",
    "version": "4.2.7",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "billiger.de – die App für den Preisvergleich der günstigsten und aktuellsten Angebote aus den besten Onlineshops Deutschlands – zu jeder Zeit, von überall.Die billiger.de App im Überblick• Sparberater: Immer den besten Preis finden!• 2 Millionen Produkte aus mehr als 22.500 Shops• Zahlreiche Filterfunktionen und übersichtliche Navigation• Preisvergleich mit ausführlichen Produktinfos• Preisalarm: Benachrichtigung auf Wunsch• Schnelle Produktsuche über den Barcode-Scanner• Merkzettel mit Erinnerungsfunktion: die günstigsten Angebote speichern• Android Wear SupportSchnell günstige Produkte finden und preiswerte Angebote entdeckenDie billiger.de App erleichtert die Produktsuche: Mit der Suchfunktion finden Sie schnell das richtige Produkt. Sie kennen das genaue Produkt? Geben Sie die EAN-, ISBN- oder PZN-Codes ein. Und im Laden unterstützen wir Sie mit unserem Barcode-Scanner. Finden Sie jetzt die günstigsten Angebote für Elektronik, Autoteile, Arzneimittel und vieles mehr. Wir kennen die besten Preise für über 2 Millionen Produkte aus vielen Sortimenten.Der billiger.de SparberaterMit unserem Sparberater finden Sie immer den günstigsten Preis. Sie können einfach in Ihren Lieblings-Online-Shops einkaufen und wenn es ein günstigeres Angebot gibt, weisen wir Sie darauf hin. So entgeht Ihnen kein Schnäppchen mehr und Sie bezahlen nie wieder zu viel.Konfigurieren Sie den Sparberater, so wie Sie ihn brauchenDer Sparberater bietet viele Einstellungs-Möglichkeiten, so lässt er sich an Ihre Vorlieben anpassen – unter anderem:• Jederzeit komfortabel ein- und ausschalten• Mit der Aktivitäts-Benachrichtigung sehen Sie immer, ob der Sparberater aktiv ist• „Bestätigungs“-Benachrichtigung, wenn es das billigste Angebot ist• Benachrichtigung anpassen bzgl. Typ und Aktionen• Wiederholte Benachrichtigungen auf identischen Angeboten unterdrückenGroße Anzahl an FilterfunktionenMit der billiger.de App entdecken Sie schnell und präzise die günstigsten Angebote für Ihren Produktwunsch. Wollen Sie ein neues Smartphone kaufen? Suchen Sie nach einer Digitalkamera oder wollen Sie Ihr Auto mit neuen Autoteilen oder Reifen ausstatten? Das geht alles mit der Preisvergleich-App: Sie können auch die preiswertesten Medikamente, ein günstiges Smartphone oder Sport-Artikel entdecken.Effektiver PreisvergleichFür die richtige Kaufentscheidung reicht der Preis als Kriterium nicht aus: Hier gibt's alle Infos, um das beste Angebot zu wählen. Dazu zählen Preisverläufe, Fotos, Testberichte, Kundenmeinungen und Shop-Bewertungen, Gesamtpreis und Versandkosten. So finden Sie das günstigste Produkt – egal, ob Sie Smartphones vergleichen, ein paar Autoreifen oder einen neuen Kühlschrank suchen. Bei billiger.de finden Sie alles, was Sie suchen, zum richtigen Preis.Preisalarm: den günstigsten Preis nicht verpassen!Die App benachrichtigt Sie, wenn ein bestimmter Zielpreis für ein Angebot erreicht ist. So helfen wir Ihnen, Geld zu sparen. Einfach Preisalarm anschalten und warten, bis die Preise sinken!Erinnerungsfunktion: die besten Deals speichern!Mit der App speichern Sie die Top-Angebote in einem Merkzettel. So können Sie die Angebote jederzeit aufrufen und Ihnen entgeht kein Deal mehr. Stöbern Sie in der großen Auswahl an Handys, Tablets, Autoteilen, Fernsehern, Spielekonsolen, Kühlschränken, Kaffeemaschinen, Medikamenten und vielem mehr.Shopping mit billiger.de: Top-Deals mit BestpreisenDie App zeigt ausgewählte Angebote mit den günstigsten Preisen in diversen Kategorien: So shoppen Sie unter anderem die preiswertesten Sommerreifen, Smartphones, Tablets und Fernseher. billiger.de ist Ihre Preissuchmaschine.WICHTIGE HINWEISEBei der Installation verlangt unsere App Zugriff auf Ihre Konten. Diesen Zugriff verwenden wir ausschließlich zur Realisierung der Preisalarm- und Preistrend-Benachrichtigungen, die den Google Cloud Messaging (GCM) Service nutzen.",
    "descriptionHTML": "billiger.de &#x2013; die App f&#xFC;r den Preisvergleich der g&#xFC;nstigsten und aktuellsten Angebote aus den besten Onlineshops Deutschlands &#x2013; zu jeder Zeit, von &#xFC;berall.<br><br><b>Die billiger.de App im &#xDC;berblick</b><br><br>&#x2022; Sparberater: Immer den besten Preis finden!<br>&#x2022; 2 Millionen Produkte aus mehr als 22.500 Shops<br>&#x2022; Zahlreiche Filterfunktionen und &#xFC;bersichtliche Navigation<br>&#x2022; Preisvergleich mit ausf&#xFC;hrlichen Produktinfos<br>&#x2022; Preisalarm: Benachrichtigung auf Wunsch<br>&#x2022; Schnelle Produktsuche &#xFC;ber den Barcode-Scanner<br>&#x2022; Merkzettel mit Erinnerungsfunktion: die g&#xFC;nstigsten Angebote speichern<br>&#x2022; Android Wear Support<br><br><b>Schnell g&#xFC;nstige Produkte finden und preiswerte Angebote entdecken</b><br><br>Die billiger.de App erleichtert die Produktsuche: Mit der Suchfunktion finden Sie schnell das richtige Produkt. Sie kennen das genaue Produkt? Geben Sie die EAN-, ISBN- oder PZN-Codes ein. Und im Laden unterst&#xFC;tzen wir Sie mit unserem Barcode-Scanner. Finden Sie jetzt die g&#xFC;nstigsten Angebote f&#xFC;r Elektronik, Autoteile, Arzneimittel und vieles mehr. Wir kennen die besten Preise f&#xFC;r &#xFC;ber 2 Millionen Produkte aus vielen Sortimenten.<br><br><b>Der billiger.de Sparberater</b><br><br>Mit unserem Sparberater finden Sie immer den g&#xFC;nstigsten Preis. Sie k&#xF6;nnen einfach in Ihren Lieblings-Online-Shops einkaufen und wenn es ein g&#xFC;nstigeres Angebot gibt, weisen wir Sie darauf hin. So entgeht Ihnen kein Schn&#xE4;ppchen mehr und Sie bezahlen nie wieder zu viel.<br><br><b>Konfigurieren Sie den Sparberater, so wie Sie ihn brauchen</b><br><br>Der Sparberater bietet viele Einstellungs-M&#xF6;glichkeiten, so l&#xE4;sst er sich an Ihre Vorlieben anpassen &#x2013; unter anderem:<br><br>&#x2022; Jederzeit komfortabel ein- und ausschalten<br>&#x2022; Mit der Aktivit&#xE4;ts-Benachrichtigung sehen Sie immer, ob der Sparberater aktiv ist<br>&#x2022; &#x201E;Best&#xE4;tigungs&#x201C;-Benachrichtigung, wenn es das billigste Angebot ist<br>&#x2022; Benachrichtigung anpassen bzgl. Typ und Aktionen<br>&#x2022; Wiederholte Benachrichtigungen auf identischen Angeboten unterdr&#xFC;cken<br><br><b>Gro&#xDF;e Anzahl an Filterfunktionen</b><br><br>Mit der billiger.de App entdecken Sie schnell und pr&#xE4;zise die g&#xFC;nstigsten Angebote f&#xFC;r Ihren Produktwunsch. Wollen Sie ein neues Smartphone kaufen? Suchen Sie nach einer Digitalkamera oder wollen Sie Ihr Auto mit neuen Autoteilen oder Reifen ausstatten? Das geht alles mit der Preisvergleich-App: Sie k&#xF6;nnen auch die preiswertesten Medikamente, ein g&#xFC;nstiges Smartphone oder Sport-Artikel entdecken.<br><br><b>Effektiver Preisvergleich</b><br><br>F&#xFC;r die richtige Kaufentscheidung reicht der Preis als Kriterium nicht aus: Hier gibt&apos;s alle Infos, um das beste Angebot zu w&#xE4;hlen. Dazu z&#xE4;hlen Preisverl&#xE4;ufe, Fotos, Testberichte, Kundenmeinungen und Shop-Bewertungen, Gesamtpreis und Versandkosten. So finden Sie das g&#xFC;nstigste Produkt &#x2013; egal, ob Sie Smartphones vergleichen, ein paar Autoreifen oder einen neuen K&#xFC;hlschrank suchen. Bei billiger.de finden Sie alles, was Sie suchen, zum richtigen Preis.<br><br><b>Preisalarm: den g&#xFC;nstigsten Preis nicht verpassen!</b><br><br>Die App benachrichtigt Sie, wenn ein bestimmter Zielpreis f&#xFC;r ein Angebot erreicht ist. So helfen wir Ihnen, Geld zu sparen. Einfach Preisalarm anschalten und warten, bis die Preise sinken!<br><br><b>Erinnerungsfunktion: die besten Deals speichern!</b><br><br>Mit der App speichern Sie die Top-Angebote in einem Merkzettel. So k&#xF6;nnen Sie die Angebote jederzeit aufrufen und Ihnen entgeht kein Deal mehr. St&#xF6;bern Sie in der gro&#xDF;en Auswahl an Handys, Tablets, Autoteilen, Fernsehern, Spielekonsolen, K&#xFC;hlschr&#xE4;nken, Kaffeemaschinen, Medikamenten und vielem mehr.<br><br><b>Shopping mit billiger.de: Top-Deals mit Bestpreisen</b><br><br>Die App zeigt ausgew&#xE4;hlte Angebote mit den g&#xFC;nstigsten Preisen in diversen Kategorien: So shoppen Sie unter anderem die preiswertesten Sommerreifen, Smartphones, Tablets und Fernseher. billiger.de ist Ihre Preissuchmaschine.<br><br>WICHTIGE HINWEISE<br><br>Bei der Installation verlangt unsere App Zugriff auf Ihre Konten. Diesen Zugriff verwenden wir ausschlie&#xDF;lich zur Realisierung der Preisalarm- und Preistrend-Benachrichtigungen, die den Google Cloud Messaging (GCM) Service nutzen.",
    "histogram": {
        "1": 272,
        "2": 186,
        "3": 364,
        "4": 994,
        "5": 1897
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/Qr-b4AgthrB-LvtaCFemErrSfSyT-RBZKEa1yZbyMi0lsFFYTND8fDovUxfehzBfh6I=h310",
        "//lh3.googleusercontent.com/XShNE7vn_L2iyM7NhGwuCfyJc8ifhnsQAI8YGZ3hrHrGImoyzfGSwmVpoEsAE-6gf2gn=h310",
        "//lh3.googleusercontent.com/7UaQByQ2UZOLJGm4P5uQChvScYiM0-DsOeH_cEiDexEAZndYB2HRb2FAV0hjo017TbU=h310",
        "//lh3.googleusercontent.com/oDxAzcGuR9_4kHEpIKk-pQbhFHyfh4D0RvEaZFhFWssdUAgFidi1QThMP6D0UuxA770=h310",
        "//lh3.googleusercontent.com/Lra2-VQIk_2piqu_g4nSbUMW4glcXyDfYhWUKbEc6qWKjLJo2d_qKuiA9JLj8_E7SG-G=h310",
        "//lh3.googleusercontent.com/ojNOuCulc8vjKFPr7dfXlL1f2HICIOqC_WbNuIq-5HMFL9csTsZLYEPSGTJhCvRpVpI=h310",
        "//lh3.googleusercontent.com/GOX41WYVOSPzwbrWE_pKscKUev1Rd_dAI0fCOnSxPjyqHTBwfWMJmSaWpKyThRTYt_Y=h310",
        "//lh3.googleusercontent.com/bUItDRVznVh-pWs7yyaQiw6fhwd6LQYwiygcvsmGHxhOrQKoOLTNnJwxOeLosmSynSI=h310",
        "//lh3.googleusercontent.com/PycglzkV1pIjfeiqTY6F7Jkm-tc11nVwEy6LfEgaX9fwSQd135-JAsTs-dzF_0lZqQ=h310",
        "//lh3.googleusercontent.com/HYNZ0rj95BlIEpJavmmLaeG3YRe0VbWeMh6TzwYHzlV5E2o9G6fprtEjCv0HB2EAPp4=h310",
        "//lh3.googleusercontent.com/-d8j0KD1eNaM4RM5uYZ5QoJ_J8IsCseuYjznnNPqUKEBxJpaj7e8xDxfXEfpvU1nMs0=h310",
        "//lh3.googleusercontent.com/Os70DKdcyObdGvxJNr1zd1YEsPPNoNTXozknAyE1s0AkdxvlIXx6C80LurUBmhfa7W0=h310",
        "//lh3.googleusercontent.com/gNL0Lwl6RyNGcNqZn9vU4KnMqJ2aUgiTAWXXkbU4aqurdRPwAhJx-k_lGJEuKd9vKg=h310"
    ],
    "video": "https://www.youtube.com/embed/4kgXGnKUhe8",
    "comments": [
        "Top of the Top This app is amazing it gives you all products shows you all products, their price history, several online suppliers sorted from the cheapest and you can even set a price Alarm. It's Perfect!",
        "SUPER Nice excellent",
        "Good App.",
        "Sehr gut",
        "Ok Ok",
        "Well done"
    ],
    "recentChanges": [
        "• Fehlerbehebungen"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.billiger.android&hl=en&gl=us",
    "appId": "de.billiger.android"
}