{
    "title": "Börse & Aktien - finanzen.net",
    "summary": "finanzen.net, the largest financial portal in Germany, stock exchange and equities for Android",
    "icon": "//lh3.googleusercontent.com/3XiJCsORihV4bOUqQJ0HQsPfv4AyZ5I1nNw47i2C9nMMgoL88TdbyZFnYGnfe5ATlA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.3,
    "reviews": 17703,
    "developer": "finanzen.net GmbH",
    "developerId": "finanzen.net+GmbH",
    "developerEmail": "App-Contact@finanzen.net",
    "developerWebsite": "http://www.finanzen.net/apps",
    "developerAddress": "finanzen.net GmbH\nGartenstraße 67\n76135 Karlsruhe",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Finance",
    "genreId": "FINANCE",
    "size": "Varies with device",
    "description": "Aktien, Aktienkurse, Realtimekurse der Börse und alles zum DAX – das und mehr bietet die Börsen-App von finanzen.net. TOP-FUNKTIONEN IM ÜBERBLICK- Kursalarme: lassen sie sich aktiv über von Ihnen gesetzte Limits benachrichtigen- DAX, Gold, Euro/Dollar, Bitcoin und weitere Realtimekurse- Jeden Morgen: DAX-Eröffnung als Push-Nachricht (optional und kostenlos)- Realtimekurse für Aktien, Indizes und Rohstoffe- Watchlist und Depot mit Verknüpfung zum finanzen.net Webseite-Account zur Verwaltung Ihrer Aktien und Börsenwerte- App-Watchlist und App-Depot auch OHNE Registrierung. Ihre Finanzen 100% anonym.- Börsennews und der beliebte „Heute im Fokus“ Artikel rund um die Börse- Aktienkurse und Charts zu allen in Deutschland handelbaren Aktien, Fonds, Indizes, Zertifikaten, ETFs, Anleihen, Rohstoffen und Devisen- Aktienkurse von verschiedenen Börsen sowie außerbörslichen Handelsplätzen- Aktiensuche (Wertpapier, WKN, ISIN)- Push-Benachrichtigungen zu Breaking News - Finanzen 100-Prozent kostenlosFINANZNACHRICHTEN- Aktuellste Top-Börsennews – verpassen Sie nichts mehr!- Die Börse im Blick mit Marktberichten zum DAX 30, TecDAX, Dow Jones, Nasdaq, Nikkei, Ahex- Nachrichten zum Goldpreis, Silberpreis, Ölpreis und weiteren Rohstoffen- Alle Finanznachrichten zu Ihren Aktien, Fonds und Anleihen- Aktuelle Entwicklungen verfolgen z.B. -- wie FED-Chefin Janet Yellen die Zinswende angeht, wie Donald Trump die USA in eine neue Richtung lenken will und damit die US-Märkte bewegt-- wie aktuelle Ereignisse wie der Brexit, die Bundestagswahl oder die Wahlen in anderen EU-Staaten den DAX beeinflussenBÖRSENKURSE & CHARTS- Börsenkurse und Aktienkurse von fast 100 Börsenplätzen weltweit- Devisen- und Aktiencharts zu über einer Million FinanzinstrumentenMUSTERDEPOT MIT WATCHLIST- Musterdepot für Aktien, Fonds, Zertifikate und vieles mehr- kostenloses Musterdepot und Watchlist ohne Anmeldung - Verknüpfung mit finanzen.net Musterdepot und Watchlist zusätzlich möglich- Über das finanzen.net Brokerage-Depot ist ein Handel von Aktien und anderen Wertpapieren möglich. Über die Buy-Sell-Funktion in der App erreichen Sie Ihre Ordermaske in Sekunden. Ähnlich wie bei Online-Brokern comdirect, consorsbank, flatex, maxblue oder s-broker!PRESSESTIMMEN„Die vorbildlich gestaltete App vermittelt durch die automatische Kursaktualisierung echtes Börsenparkett-Flair. Das Nachrichtenangebot ist umfangreich, die Meldungen sind ordentlich formatiert.“ – connect, 16.07.2013„finanzen.net gehört zu den besten 20 Finanzapps“ – ComputerBild, 14.05.2012\"Bullishe App für Börsianer: \"finanzen.net Börse & Aktien\" ist eine klare Empfehlung. Gut strukturiert und mit den neuesten Finanz-News, dürfte die App jedem Aktienbesitzer eine gute Unterstützung sein, um immer top informiert zu bleiben.“ – CHIP, 30.04.2012ÜBER UNSDeutschlands führendes Finanzportal finanzen.net bietet börsentäglich Daten zur aktuellen Entwicklung auf den Parketts. Realtime-Push-Kurse zu Indizes, Rohstoffen, Zinsen und Devisen (Dollarkurs, Eurokurs, Yen, Schweizer Franken, Bitcoin und weitere Währungen) runden neben Informationen zu Aktien, Unternehmen, Zertifikaten, Fonds, Politik, Konjunktur und Wirtschaft das Profil ab. Mit Aktienempfehlungen, Analysen, Kurszielen und Kennzahlen werden wichtige Hintergrundinformationen zu den Aktien bereitgestellt. Interaktive Tools zur Chartanalyse und zu Musterdepots machen das Angebot individualisierbar. Weitere Themen: Xetra, Boerse Frankfurt, Börsenspiel, Umlaufrendite, Aktien kaufen, Penny Stocks, Bund Future, private FinanzenDie App bietet Ihnen jetzt einen noch schnelleren Überblick über die Märkte und ihr Depot.Die Börse im Fokus mit der kostenlosen finanzen.net App.finanzen.net GmbHGartenstr. 6776135 KarlsruheTel: +49-(0) 721-161766-0Handelsregister: Mannheim HRB 710118Geschäftsführer: Peter Schille, Jens OhrDies ist ein Angebot der finanzen.net GmbH. Das vollständige Impressum finden Sie hier: www.finanzen.net/impressum",
    "descriptionHTML": "Aktien, Aktienkurse, Realtimekurse der B&#xF6;rse und alles zum DAX &#x2013; das und mehr bietet die B&#xF6;rsen-App von finanzen.net. <br><br>TOP-FUNKTIONEN IM &#xDC;BERBLICK<br>- Kursalarme: lassen sie sich aktiv &#xFC;ber von Ihnen gesetzte Limits benachrichtigen<br>- DAX, Gold, Euro/Dollar, Bitcoin und weitere Realtimekurse<br>- Jeden Morgen: DAX-Er&#xF6;ffnung als Push-Nachricht (optional und kostenlos)<br>- Realtimekurse f&#xFC;r Aktien, Indizes und Rohstoffe<br>- Watchlist und Depot mit Verkn&#xFC;pfung zum finanzen.net Webseite-Account zur Verwaltung Ihrer Aktien und B&#xF6;rsenwerte<br>- App-Watchlist und App-Depot auch OHNE Registrierung. Ihre Finanzen 100% anonym.<br>- B&#xF6;rsennews und der beliebte &#x201E;Heute im Fokus&#x201C; Artikel rund um die B&#xF6;rse<br>- Aktienkurse und Charts zu allen in Deutschland handelbaren Aktien, Fonds, Indizes, Zertifikaten, ETFs, Anleihen, Rohstoffen und Devisen<br>- Aktienkurse von verschiedenen B&#xF6;rsen sowie au&#xDF;erb&#xF6;rslichen Handelspl&#xE4;tzen<br>- Aktiensuche (Wertpapier, WKN, ISIN)<br>- Push-Benachrichtigungen zu Breaking News <br>- Finanzen 100-Prozent kostenlos<br><br>FINANZNACHRICHTEN<br>- Aktuellste Top-B&#xF6;rsennews &#x2013; verpassen Sie nichts mehr!<br>- Die B&#xF6;rse im Blick mit Marktberichten zum DAX 30, TecDAX, Dow Jones, Nasdaq, Nikkei, Ahex<br>- Nachrichten zum Goldpreis, Silberpreis, &#xD6;lpreis und weiteren Rohstoffen<br>- Alle Finanznachrichten zu Ihren Aktien, Fonds und Anleihen<br>- Aktuelle Entwicklungen verfolgen z.B. <br>-- wie FED-Chefin Janet Yellen die Zinswende angeht, wie Donald Trump die USA in eine neue Richtung lenken will und damit die US-M&#xE4;rkte bewegt<br>-- wie aktuelle Ereignisse wie der Brexit, die Bundestagswahl oder die Wahlen in anderen EU-Staaten den DAX beeinflussen<br><br>B&#xD6;RSENKURSE &amp; CHARTS<br>- B&#xF6;rsenkurse und Aktienkurse von fast 100 B&#xF6;rsenpl&#xE4;tzen weltweit<br>- Devisen- und Aktiencharts zu &#xFC;ber einer Million Finanzinstrumenten<br><br>MUSTERDEPOT MIT WATCHLIST<br>- Musterdepot f&#xFC;r Aktien, Fonds, Zertifikate und vieles mehr<br>- kostenloses Musterdepot und Watchlist ohne Anmeldung <br>- Verkn&#xFC;pfung mit finanzen.net Musterdepot und Watchlist zus&#xE4;tzlich m&#xF6;glich<br>- &#xDC;ber das finanzen.net Brokerage-Depot ist ein Handel von Aktien und anderen Wertpapieren m&#xF6;glich. &#xDC;ber die Buy-Sell-Funktion in der App erreichen Sie Ihre Ordermaske in Sekunden. &#xC4;hnlich wie bei Online-Brokern comdirect, consorsbank, flatex, maxblue oder s-broker!<br><br>PRESSESTIMMEN<br>&#x201E;Die vorbildlich gestaltete App vermittelt durch die automatische Kursaktualisierung echtes B&#xF6;rsenparkett-Flair. Das Nachrichtenangebot ist umfangreich, die Meldungen sind ordentlich formatiert.&#x201C; &#x2013; connect, 16.07.2013<br>&#x201E;finanzen.net geh&#xF6;rt zu den besten 20 Finanzapps&#x201C; &#x2013; ComputerBild, 14.05.2012<br>&quot;Bullishe App f&#xFC;r B&#xF6;rsianer: &quot;finanzen.net B&#xF6;rse &amp; Aktien&quot; ist eine klare Empfehlung. Gut strukturiert und mit den neuesten Finanz-News, d&#xFC;rfte die App jedem Aktienbesitzer eine gute Unterst&#xFC;tzung sein, um immer top informiert zu bleiben.&#x201C; &#x2013; CHIP, 30.04.2012<br><br>&#xDC;BER UNS<br>Deutschlands f&#xFC;hrendes Finanzportal finanzen.net bietet b&#xF6;rsent&#xE4;glich Daten zur aktuellen Entwicklung auf den Parketts. Realtime-Push-Kurse zu Indizes, Rohstoffen, Zinsen und Devisen (Dollarkurs, Eurokurs, Yen, Schweizer Franken, Bitcoin und weitere W&#xE4;hrungen) runden neben Informationen zu Aktien, Unternehmen, Zertifikaten, Fonds, Politik, Konjunktur und Wirtschaft das Profil ab. Mit Aktienempfehlungen, Analysen, Kurszielen und Kennzahlen werden wichtige Hintergrundinformationen zu den Aktien bereitgestellt. Interaktive Tools zur Chartanalyse und zu Musterdepots machen das Angebot individualisierbar. Weitere Themen: Xetra, Boerse Frankfurt, B&#xF6;rsenspiel, Umlaufrendite, Aktien kaufen, Penny Stocks, Bund Future, private Finanzen<br><br>Die App bietet Ihnen jetzt einen noch schnelleren &#xDC;berblick &#xFC;ber die M&#xE4;rkte und ihr Depot.<br>Die B&#xF6;rse im Fokus mit der kostenlosen finanzen.net App.<br><br>finanzen.net GmbH<br>Gartenstr. 67<br>76135 Karlsruhe<br>Tel: +49-(0) 721-161766-0<br>Handelsregister: Mannheim HRB 710118<br>Gesch&#xE4;ftsf&#xFC;hrer: Peter Schille, Jens Ohr<br>Dies ist ein Angebot der finanzen.net GmbH. Das vollst&#xE4;ndige Impressum finden Sie hier: www.finanzen.net/impressum",
    "histogram": {
        "1": 678,
        "2": 411,
        "3": 958,
        "4": 6065,
        "5": 9591
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/abmZmZzi9C8pympUuhau1WYVPyR7-V1Whq2ADTLwap5fnuxgSubtUZGzTRXZO_4S4Mlz=h310",
        "//lh3.googleusercontent.com/nz02y6AX-D2bnrJrrF4BZry18CLpTw6V87tuVJI6uGT3RPjQEJ5oDpGilQ7E9gsnanE=h310",
        "//lh3.googleusercontent.com/bVpwou_w3KqcGI7LtIukLRXl3K9FD8lEnJK5jt-oIk4jHmXMXis38pgV3rKCcl_-buA=h310",
        "//lh3.googleusercontent.com/Q-pZCrKpCROKoA7YLLL9E3xoL-tSSFtAieeCchQzXemrxJ3jggq5SoamIEUZI9028Wo=h310",
        "//lh3.googleusercontent.com/-r-n2TCSfvsAXfmYB57K7KoX72u2tGU_G93GEu8SodiamrvQsP6ergCSYy_O3NPUiA=h310",
        "//lh3.googleusercontent.com/aj-RRa74Sc5B7Aqn7eF-fulKtJCsAGkxbs2iXQnI3cKwT-M8GDjsyWaYzcrB3WXp-w=h310",
        "//lh3.googleusercontent.com/Us05IViqv2QXLRTagbfuZp4zsDQZXLae3VylDQLxq4mb2_pEKdpxUgOwWwcvBrH5CJdu=h310",
        "//lh3.ggpht.com/Lbf48DQA9bFM-vQgUI_tfQ11ZpWfo-QubMalt3JgNUC-rXNfHdQOECmsmxYTr77IyzM=h310",
        "//lh3.googleusercontent.com/IczDKiL8UpOBoxDdyxiQSpV5bhnmSZl14ZadTb3bPuc2-Lzs1DybEGucE0k88_3pLhr8=h310",
        "//lh3.googleusercontent.com/sZzM_nlwhqPH6yRcsm5fusJftVTgSWbJWXm15JqbPNnRQnx4PENYuH-SrBOEwvQgKQ=h310",
        "//lh3.googleusercontent.com/Oe1TXalz_cKba80pQtb77ZgxDrJfDfw-xUN3y77JAhSgRga63BY4yM1xBBPqX_zfAlBb=h310",
        "//lh3.googleusercontent.com/vuOkZ1XswDlIk7cevQlhPQUs_2WeUXOnrOx6xBDB8PKYbQudPL4nOPIbFm9dZD3U9A=h310",
        "//lh3.googleusercontent.com/ngVdMAqS_pNiBmodZTt_2VaDjJpflvzjcntIBf0qkrXgxBR-glR-0C9pcH0we4flEg=h310",
        "//lh3.googleusercontent.com/reqVH6W2iWsxH1gd7_LFR-jPPmZh0yXm5FDLbhv4jMNUsmh9NvCLjTVbLPVB_zE3X18=h310",
        "//lh3.googleusercontent.com/L7UBplzOoWLGNE-1JX0pX_QTxlopykO00fwGL2p6ZCvyeLFmRxj8UJLyLDhLkCBMPvE=h310",
        "//lh3.googleusercontent.com/tW96K_9bI8_fJ8Wq1dzcwTq_bznNfpJBqURnGZsyIZy3-uBiPryjohlGmhYXRMXGrr80=h310",
        "//lh3.googleusercontent.com/TOm06CsG8U_An2Jt1gerf8wa9svxACqv68MtSJYfx0KX5A9MJK0NuP8jiYSNXhpL1cM=h310",
        "//lh3.googleusercontent.com/QBrYPSrD5v3BUSBPA3um8VMa4-2tp5C7vjceYAUr52JKUMLUBr8KR7cvu8iycaeFjw=h310",
        "//lh3.googleusercontent.com/ZDBRoT02VyJJzTIDHVwJgP2oAFF0BMcG8W2AnqyOuj3BlUkQzvzheoMP3-Sz6gkXBA0=h310",
        "//lh3.googleusercontent.com/yggMrCkivdnFEs_vaHYi1Y2jL69NLALhJ4ZTb8CGeI28XazEw3wZUqq6plLjYFav4Q=h310",
        "//lh3.googleusercontent.com/xQCvCv2yaS9UdGS9Vz1Z4ioT3x93zX6PR-ssD_K7J6T1GzIFP9tRnHq2D2cp7CpiDNIV=h310",
        "//lh3.googleusercontent.com/1L_T84LrAWT1Jz8YuHt1XlkonTjoJDBzH4uBQAdYceBBkBY1cwvn_JV01QEiDPwNouBG=h310"
    ],
    "comments": [
        "Great app. Very good features. I am not sure if you can change language to English, I use it in German",
        "Werbung wird immer mehr. Auf einer Seite sind schon 4 Banner untergebracht. Dazu großflächige Interstitials. Eine werbefreie Version wäre wünschenswert.",
        "Sehr gute Informationsstruktur und etwaige Tagesaktualitäten, um darüber informiert zu sein wann und wo etwas in der Wirtschaftswelt passiert.",
        "Just watching the market an exchange rates for scheduling vacation booking",
        "Sehr gute Finanz-App für Aktien und Fonds.",
        "Great app for tracking stock prices. Features stock depos, live price charts and newsfeed."
    ],
    "recentChanges": [
        "Neu: Termine bei Aktiendetailseiten",
        "Fixed: falsche Wärungsangabe im Depot"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.finanzen.net&hl=en&gl=us",
    "appId": "de.finanzen.net"
}