{
    "title": "ING-DiBa Kontostand",
    "summary": "With just a tap, the account balance at a glance",
    "icon": "//lh3.googleusercontent.com/ZDaSwICFaPApiUJxRMjuAw2kyaEUFo1T_mVaguqzrk_rtPSt7PhDYY7kFt_U2tXJDY4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.8,
    "reviews": 2160,
    "developer": "ING-DiBa Deutschland",
    "developerId": "ING-DiBa+Deutschland",
    "developerEmail": "info@ing-diba.de",
    "developerWebsite": "http://www.ing-diba.de/kontostand",
    "updated": "January 24, 2018",
    "version": "4.2.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Immer wissen, was drin ist. Ist genug Geld für den Urlaub auf dem Konto? Wie sieht‘s eigentlich im Depot aus? Mit einem Fingertipp haben Sie den Überblick – bei Ihren ING-DiBa Konten und den Konten von fast 4.000 anderen Banken. Jetzt im neuen Design: noch frischer und übersichtlicher. Probieren Sie es gleich aus!•\tAKTUELL: der Kontostand auf dem Smartphone oder der Smartwatch•\tÜBERSICHTLICH: alle Konten im Überblick  •\tOFFEN: Konten von fast allen Banken und Sparkassen hinzufügen•\tEINFACH: einmal Konto-Zugangsdaten eingeben und dann nie wieder•\tSICHER: keine Transaktionen möglich, daher sicher vor Missbrauch. Geschützt mit eigenem App-Passwort•\tANPASSBAR: z.B. mit persönlichen Kontonamen und einem Favoritenkonto So einfach, dass es fast schon Spaß macht Einfach App laden, auf Ihrem Smartphone öffnen und schon kann‘s losgehen: Sie wählen die Konten aus, die in der App angezeigt werden sollen, geben die Zugangsdaten ein - und fertig! Jetzt können Sie jederzeit den Kontostand abrufen,Eine sichere SacheDie App zeigt nur Kontoinformationen an – Überweisungen lassen sich damit nicht ausführen. Sie können also beruhigt sein: Auch wenn Sie Ihr Smartphone verlieren, kann nichts passieren Und dank der intelligenten Technologie ist auch ein Ausloggen oder Abmelden von der App nicht mehr nötig. Die App verbindet sich nur kurz mit Ihren Konten, um die Umsätze zu aktualisieren. Danach meldet sie sich automatisch wieder ab. Mit einem Passwort können Sie die App natürlich jederzeit zusätzlich schützen. Einfach und sicher!Sonst noch was? Ja, ein bisschen Technik noch: Die App verwendet HBCI/FinTS im PIN/TAN Verfahren. HBCI ist ein deutscher Onlinebanking-Standard, mit dem Ihre Kontodaten sicher abgerufen werden. Die  Technologie wird von fast allen Banken und Sparkassen unterstützen. Bis auf ein paar Ausnahmen: z.B. Commerzbank, SEB, Volkswagen Bank und Santander Bank. Wie aktuell die Daten in der App sind, hängt von Ihrer Bank ab. Also bitte nicht böse sein, wenn mal ein Umsatz noch nicht angezeigt wird. Bitte beachten Sie: Depots von anderen Banken können leider aktuell noch nicht angezeigt werden.HAPPY BANKING mit der neuen App, wünscht Ihr ING-DiBa Team!",
    "descriptionHTML": "Immer wissen, was drin ist. <br><br>Ist genug Geld f&#xFC;r den Urlaub auf dem Konto? Wie sieht&#x2018;s eigentlich im Depot aus? Mit einem Fingertipp haben Sie den &#xDC;berblick &#x2013; bei Ihren ING-DiBa Konten und den Konten von fast 4.000 anderen Banken. Jetzt im neuen Design: noch frischer und &#xFC;bersichtlicher. Probieren Sie es gleich aus!<br><br><br>&#x2022;\tAKTUELL: der Kontostand auf dem Smartphone oder der Smartwatch<br>&#x2022;\t&#xDC;BERSICHTLICH: alle Konten im &#xDC;berblick  <br>&#x2022;\tOFFEN: Konten von fast allen Banken und Sparkassen hinzuf&#xFC;gen<br>&#x2022;\tEINFACH: einmal Konto-Zugangsdaten eingeben und dann nie wieder<br>&#x2022;\tSICHER: keine Transaktionen m&#xF6;glich, daher sicher vor Missbrauch. Gesch&#xFC;tzt mit eigenem App-Passwort<br>&#x2022;\tANPASSBAR: z.B. mit pers&#xF6;nlichen Kontonamen und einem Favoritenkonto <br><br>So einfach, dass es fast schon Spa&#xDF; macht <br>Einfach App laden, auf Ihrem Smartphone &#xF6;ffnen und schon kann&#x2018;s losgehen: Sie w&#xE4;hlen die Konten aus, die in der App angezeigt werden sollen, geben die Zugangsdaten ein - und fertig! Jetzt k&#xF6;nnen Sie jederzeit den Kontostand abrufen,<br><br>Eine sichere Sache<br>Die App zeigt nur Kontoinformationen an &#x2013; &#xDC;berweisungen lassen sich damit nicht ausf&#xFC;hren. Sie k&#xF6;nnen also beruhigt sein: Auch wenn Sie Ihr Smartphone verlieren, kann nichts passieren Und dank der intelligenten Technologie ist auch ein Ausloggen oder Abmelden von der App nicht mehr n&#xF6;tig. Die App verbindet sich nur kurz mit Ihren Konten, um die Ums&#xE4;tze zu aktualisieren. Danach meldet sie sich automatisch wieder ab. Mit einem Passwort k&#xF6;nnen Sie die App nat&#xFC;rlich jederzeit zus&#xE4;tzlich sch&#xFC;tzen. Einfach und sicher!<br><br><br>Sonst noch was? <br>Ja, ein bisschen Technik noch: Die App verwendet HBCI/FinTS im PIN/TAN Verfahren. HBCI ist ein deutscher Onlinebanking-Standard, mit dem Ihre Kontodaten sicher abgerufen werden. Die  Technologie wird von fast allen Banken und Sparkassen unterst&#xFC;tzen. Bis auf ein paar Ausnahmen: z.B. Commerzbank, SEB, Volkswagen Bank und Santander Bank. Wie aktuell die Daten in der App sind, h&#xE4;ngt von Ihrer Bank ab. Also bitte nicht b&#xF6;se sein, wenn mal ein Umsatz noch nicht angezeigt wird. Bitte beachten Sie: Depots von anderen Banken k&#xF6;nnen leider aktuell noch nicht angezeigt werden.<br><br>HAPPY BANKING mit der neuen App, w&#xFC;nscht Ihr ING-DiBa Team!",
    "histogram": {
        "1": 218,
        "2": 237,
        "3": 268,
        "4": 536,
        "5": 901
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/isVr6KdGy4B35lnzRkqja9OUfUAj18_RPMoFnWBcU27z8Pl_P15NECfmaY_jiIvoBw=h310",
        "//lh3.googleusercontent.com/bK23qpuQAtzm0KQ6tuqf9irMMUifnHxzUpUU7yaC1L0XCHc_kS-_MvrxHU576e0AUls=h310",
        "//lh3.googleusercontent.com/fwfgrmmYFNeHGOlIkg5Zbt_kutM52PEcgG0_VCZ_F-qPJxokFKY_YgxJnTep68VoNA=h310",
        "//lh3.googleusercontent.com/UdgvUDV-xZ9pigmoPYaB3IruyM6WNzQ06WPejM58x7lltfZbfkRbXwCOhyoPVl01GmGn=h310",
        "//lh3.googleusercontent.com/efxEr2HFdSHj3zLxTqe1MBX1iK4cpTsQIZwcECwtcnDnFyRLEYSJ1BFfUqeSSWFs82o1=h310",
        "//lh3.googleusercontent.com/llRI35qYh_UQa__d-H5_tsfLxzZv5unxTYOUrtZA4ySXTWtcNng9GzGKFTwGVfGkDg=h310",
        "//lh3.googleusercontent.com/KDOQPp4M4OOs9VmEI8vwc4ROaJnmQfEB11Pa_t67gKmUZtS8luoCd3UuT-E02denMIDW=h310",
        "//lh3.googleusercontent.com/E6_OsDA7Ixc1gVedgHYoMq1dJwosXR0Vhi6hb2CU3lVLFcYa3tsm9g7_EOwgq0GcKA=h310"
    ],
    "comments": [
        "Hallo ing diba, leider funktionieren absolute Basis einer Kontostandsapp nicht. Beispiel: ich habe mein girokonto sowie ein Gemeinschaftlich genutztes Konto fürs die Miete hinzugefügt. Der Abgang vom girokonto wird angezeigt, der Eingang auf dem Mietkonto nicht. Der Kontostand verändert sich aber. So kann ich nicht kontrollieren, \"ob die miete schon da ist\" (Werbung!!). Auch mit Daueraufträgen tut die app sich in der Darstellung schwer.",
        "Aktualisierung des Kontostandes ist erst nach 2 Tagen im App erhältlich, das aber nicht bei IOS. Das App für Android könnte dann verbessert werden. (ING-DiBa, ich rufe niemanden an)",
        "Tut was es soll, praktische App, benutze sie fast jeden Tag",
        "Tolle App und sehr hilfreich. Finde sieht auch deutlich besser aus als auf iOS aber leider sehe ich keine vorgemerkten Abrechnungen der Kreditkarte (wie in iOS)... Das ist eigentlich das beste Feature...",
        "Ziemlich nutzlos,  zeigt keine von den dummen \"vorgemerkten Umsätze\" an. Somit bleibt der Kontstand unbekannt. Mal sehen welche Bank das besser kann..",
        "5 Sterne wenn es Push notifications für Eingänge und Ausgänge gibt (am besten modifizierbar im Detail). Ansonsten super!"
    ],
    "recentChanges": [
        "-\tBugfixes & technische Verbesserungen"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.ing_diba.kontostand&hl=en&gl=us",
    "appId": "de.ing_diba.kontostand"
}