{
    "title": "Komoot — Cycling & Hiking Maps",
    "summary": "Route planner, voice nav &amp; offline maps for your cycling and hiking experiences.",
    "icon": "//lh3.googleusercontent.com/NvjDv9RuXllrthxM7u4Ia7Xk5WSt-F1btgllwqeHpCQZsspQmOk-6gGW-Kz-OAXCrnzY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 45069,
    "developer": "komoot GmbH",
    "developerId": "komoot+GmbH",
    "developerEmail": "help@komoot.de",
    "developerWebsite": "https://www.komoot.com",
    "developerAddress": "Friedrich-Wilhelm-Boelcke-Straße 2\n14473 Potsdam\nGermany",
    "updated": "February 22, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "Komoot is the key to the outdoors. Just plan your hiking, road biking or MTB adventures in the planner, and be guided along every trail, track, road or path—even when you’re offline. Get your first region for free and say hello to your next adventure!Plan Your Perfect Hiking, Mountain Biking or Road Biking AdventureGet the route perfect for your sport—be it smooth asphalt for your road bike, singletracks for your mountain bike, silent cycling paths for touring or natural trails for your hikes. Plan down to the last detail with at-your-fingertips info like surface, difficulty, distance and elevation profile.Turn-by-Turn Voice NavigationNever take your eyes off the road with turn-by-turn voice navigation: your precise, down-to-the-inch verbal navigator that doesn’t distract you from your surroundings. Keep your eyes firmly on your surroundings and navigate with ease, even on small trails or in the woods.Offline Maps For Outdoor AdventuresDownload your planned outdoor adventures and save topographic maps with one tap. Navigate the outdoors even when the Internet is down or unreliable. Differentiate hiking paths, singletracks, paved roads, terrain and land cover with one glance.Tell Your StoryTrack your rides and hikes with GPS. Add photos, Highlights and tips and build your own personal adventure log that’ll store your favorite experiences—forever. Save them for private use or share them with the komoot community to receive likes and comments and to inspire fellow outdoor folks. Follow your friends and like-minded explorers to keep up with their outdoor adventures.Seamless Sync Across Every DeviceWhether you prep like a pro on your desktop or plan a route on the go, komoot automatically syncs your routes, tracks and photos across all devices, including your smartphone, desktop, tablet and Android Wear.Experience Komoot For FreeWhen you download komoot, your first region is free—forever. To expand the areas in which komoot has your back, conveniently choose between single regions, region bundles or the Complete Package to access offline maps and turn-by-turn voice navigation wherever you go.  Supported Devices• Android Wear - Take a quick glance at your Android Wear smartwatch to get directions,  distance, and speed in real-time right on your wrist (1)• Wahoo - Connect your komoot account to your Wahoo ELEMNT or ELEMNT BOLT bike computer to access best routes and sync back your recorded tracks• COBI - The navigation system of the COBI App seamlessly integrates with komoot• Garmin - Download the komoot Garmin app in the IQ store and sync your accounts via Garmin Connect to share komoot routes with your Garmin device(1) Compatible with Motorola Moto 360, LG G Watch, LG G Watch R, LG Watch Urbane, Sport & Style, Polar M600, Huawei Watch, Samsung Gear Live, Sony Smartwatch 3, Asus ZenWatch, Fossil Q, Casio Smart Outdoor, Nixon Mission and other Android Wear smartwatches.For support and tips, please visit http://help.komoot.de",
    "descriptionHTML": "Komoot is the key to the outdoors. Just plan your hiking, road biking or MTB adventures in the planner, and be guided along every trail, track, road or path&#x2014;even when you&#x2019;re offline. Get your first region for free and say hello to your next adventure!<br><br><b>Plan Your Perfect Hiking, Mountain Biking or Road Biking Adventure</b><br>Get the route perfect for your sport&#x2014;be it smooth asphalt for your road bike, singletracks for your mountain bike, silent cycling paths for touring or natural trails for your hikes. Plan down to the last detail with at-your-fingertips info like surface, difficulty, distance and elevation profile.<br><br><b>Turn-by-Turn Voice Navigation</b><br>Never take your eyes off the road with turn-by-turn voice navigation: your precise, down-to-the-inch verbal navigator that doesn&#x2019;t distract you from your surroundings. Keep your eyes firmly on your surroundings and navigate with ease, even on small trails or in the woods.<br><br><b>Offline Maps For Outdoor Adventures</b><br>Download your planned outdoor adventures and save topographic maps with one tap. Navigate the outdoors even when the Internet is down or unreliable. Differentiate hiking paths, singletracks, paved roads, terrain and land cover with one glance.<br><br><b>Tell Your Story</b><br>Track your rides and hikes with GPS. Add photos, Highlights and tips and build your own personal adventure log that&#x2019;ll store your favorite experiences&#x2014;forever. Save them for private use or share them with the komoot community to receive likes and comments and to inspire fellow outdoor folks. Follow your friends and like-minded explorers to keep up with their outdoor adventures.<br><br><b>Seamless Sync Across Every Device</b><br>Whether you prep like a pro on your desktop or plan a route on the go, komoot automatically syncs your routes, tracks and photos across all devices, including your smartphone, desktop, tablet and Android Wear.<br><br><b>Experience Komoot For Free</b><br>When you download komoot, your first region is free&#x2014;forever. To expand the areas in which komoot has your back, conveniently choose between single regions, region bundles or the Complete Package to access offline maps and turn-by-turn voice navigation wherever you go.  <br><br><b>Supported Devices</b><br>&#x2022; <u>Android Wear</u> - Take a quick glance at your Android Wear smartwatch to get directions,  distance, and speed in real-time right on your wrist (1)<br>&#x2022; <u>Wahoo</u> - Connect your komoot account to your Wahoo ELEMNT or ELEMNT BOLT bike computer to access best routes and sync back your recorded tracks<br>&#x2022; <u>COBI</u> - The navigation system of the COBI App seamlessly integrates with komoot<br>&#x2022; <u>Garmin</u> - Download the komoot Garmin app in the IQ store and sync your accounts via Garmin Connect to share komoot routes with your Garmin device<br>(1) Compatible with Motorola Moto 360, LG G Watch, LG G Watch R, LG Watch Urbane, Sport &amp; Style, Polar M600, Huawei Watch, Samsung Gear Live, Sony Smartwatch 3, Asus ZenWatch, Fossil Q, Casio Smart Outdoor, Nixon Mission and other Android Wear smartwatches.<br><br>For support and tips, please visit <a href=\"https://www.google.com/url?q=http://www.google.com/url?q%3Dhttp%253A%252F%252Fhelp.komoot.de%26sa%3DD%26sntz%3D1%26usg%3DAFQjCNGYFPfC4lE5poABFrr1tnbMA8mpvw&amp;sa=D&amp;usg=AFQjCNGrIzvXTY1tnHn_jIVNHHTnK-r64A\" target=\"_blank\">http://help.komoot.de</a>",
    "histogram": {
        "1": 1560,
        "2": 909,
        "3": 1761,
        "4": 10808,
        "5": 30031
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/tyJOhDPjVxvC7ia_yPWlKfB8_I9UQK98TEzesjg0QTSj24qyAO8x40jgvXIC3s0nMPQ=h310",
        "//lh3.googleusercontent.com/UnEava4-b4j-vHmb0lKbs7UVqsbmZ6MacqacViYrI7YmguTXhMHD6SMbEahpxZbltWw=h310",
        "//lh3.googleusercontent.com/3xK3iY_Yky8Z5GMwdonH-mcSxz1701mx0AFRTqwbQHK7DOM0NynKrZHmkwF4FzmjgrY=h310",
        "//lh3.googleusercontent.com/mFUaaHyMwRhhroVxFvMAHKXcXzfb9pl-MA82HQOX6noEfEbIFLcsT3Q6IDnt3UUniG2w=h310",
        "//lh3.googleusercontent.com/2t6R5YivBLG71GJxlfa_F1cWkqnphm7wb1IP7t3_hODo87VFCsAauuSRJ4mfUBI4XkQ=h310",
        "//lh3.googleusercontent.com/XX8JLO62GJP-g02McFf48NWE6E3asJtl98oW7FeErjKt6n7l9_bZ7NUKSUd0C7iQ0xs=h310",
        "//lh3.googleusercontent.com/bpy29e3mn6LSkpSxm3jzPCjTDjs9Qo6wUW9fZ-D98HfC9UGhNSVshU6mUv1_yzHAZQg=h310",
        "//lh3.googleusercontent.com/3N2nB4BPQtRKHF6Yq3q9FSIIdJ6TVpfqPQbkXthGb5Yj-Q8F__ga-DJC--m1GtxEiQ=h310",
        "//lh3.ggpht.com/TuLuFFECeKdKqeeHEkcCqFxMVvwxBQbkB9ARQVvp1GgRbbUHMEhIKdL95futk4s0_syz=h310",
        "//lh5.ggpht.com/vfVnrumdb2ko06sdMiAp4gIieks5_NEqPve1rcYOToI_ZWzQUJMbO2GBAplZbYx_kZ8=h310",
        "//lh3.ggpht.com/q2pB5cRAAr585f7jkK7U5BHEnjkiOWsHk-yBuE-PCSbR7D5srWYFVOuoDdawz_J2xRYC=h310",
        "//lh5.ggpht.com/1Qlc8Pqe3iU61ynreburQC-ABx2zAE9tDZszuSRm4QhkFKYA8H-WoOFssvk3Jza4gmw=h310",
        "//lh3.googleusercontent.com/rT-_2ap3ISzF7UIwOObil5pDIIkD8RrZ2h33LoL6fn_7Gd1eKUf7-NQ2pXheBB5FkQ=h310",
        "//lh3.googleusercontent.com/DMOGslA0QMKE_-je0kB9q6KVOJ7BZRVRxuAIwIn7Lxx7zl38apuO7YfhkVJ_ZPGuyIdu=h310"
    ],
    "comments": [
        "Komoot is by far the best route planning software I've ever used. It makes planning turn-by-turn cycling routes for my Wahoo Bolt so simple on the fly.",
        "Love using pictures and GPS map to track trips. Enjoy keeping a log on where I've been as well. Great app. Wish I had more friends using it. Send me a friend request if y 'all need fellow rider friends;-)",
        "Great route planner, and the only route planner worth using if your going to be on a roving trip taking random tracks",
        "Awesome hiking app! Foolproof and really handy :)",
        "Works super well and fits all my needs when cycling. Awesome app!",
        "Gets 5 stars once privacy zones are implemented."
    ],
    "recentChanges": [
        "In order to keep supporting the expanding capabilities of the latest operating systems, this version of komoot will be the final version available for devices using Android 4. To ensure you can continue to use komoot, however, we have optimized this version for ongoing use until you choose to upgrade to Android 5 or higher. Until then, your komoot experience will not change—you just won’t be able to upgrade to the most recent version of the app until you first update your Android OS."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.komoot.android&hl=en&gl=us",
    "appId": "de.komoot.android"
}