{
    "title": "Birthday Reminder",
    "summary": "Enjoy millions of the latest Android apps, games, music, movies, TV, books, magazines & more. Anytime, anywhere, across your devices.",
    "icon": "//lh3.ggpht.com/SodbP6r9PGkXiMxohvpOwCtp0CnW5Cp0cLbojYK0hL-vHuZbMBv8NknUk0_oQauMg6Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.8,
    "reviews": 33,
    "developer": "linuxwhatelse",
    "developerId": "linuxwhatelse",
    "developerEmail": "info@linuxwhatelse.de",
    "developerWebsite": "http://www.linuxwhatelse.de",
    "developerAddress": "Neumarkter Str. 17\n84428 Buchbach\nGermany, Bavaria",
    "updated": "July 5, 2014",
    "version": "1.3.1",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Never forget a birthday or anniversary again!Features: - Click the Contact's Image for more Actions like Call or Send a SMS etc. - Holo Design - Works with Android Wear (Smartwatche's) - Set up to as many reminders as you want. Those will reminder you some days before the actual event - Add notes to each indiviual contact which should be shown once you get reminded (like present ideas) - DashClock extension! Shows you the upcoming birthdays pending on your configuration in the mainappFollow me on Twitterhttp:/www.twitter.com/linuxwhatelseKeywords:geburtstag, birthday, jubiläum, anniversary, reminder, birthdayreminder, erinnerung, Geburtstagserinnerung, dashclock, extension, android, wear, smartwatch, facebook, twitter, whatsapp, hangouts",
    "descriptionHTML": "Never forget a birthday or anniversary again!<br><br>Features:<br> - Click the Contact&apos;s Image for more Actions like Call or Send a SMS etc.<br> - Holo Design<br> - Works with Android Wear (Smartwatche&apos;s)<br> - Set up to as many reminders as you want. Those will reminder you some days before the actual event<br> - Add notes to each indiviual contact which should be shown once you get reminded (like present ideas)<br> - DashClock extension! Shows you the upcoming birthdays pending on your configuration in the mainapp<br><br>Follow me on Twitter<br>http:/www.twitter.com/linuxwhatelse<br><br>Keywords:<br>geburtstag, birthday, jubil&#xE4;um, anniversary, reminder, birthdayreminder, erinnerung, Geburtstagserinnerung, dashclock, extension, android, wear, smartwatch, facebook, twitter, whatsapp, hangouts",
    "histogram": {
        "1": 5,
        "2": 2,
        "3": 4,
        "4": 4,
        "5": 18
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/RnskOVfZMl7TlaEIBMoGYeVwrwhNYviMbjSPhoQZ_qHf7--6B-Il_JIbUyaKb2fuiw=h310",
        "//lh6.ggpht.com/km0kRBwxnP7RhHMthlZ1YRS-NdOJ2uAmTXHnkht9H_3qlw-EmP9sZj87BlYDlYldCNX4=h310",
        "//lh6.ggpht.com/uGG3M5ZD-5LnWh6Vq5Q82hbfkilM8Q7VmNV6skyDD6i95v0OR1NxxCwy3OKYmaxgxYo=h310",
        "//lh5.ggpht.com/snTwGEMAbdUJ3QTkQ6u0jRC1drReG9kEjBYUUx0PEVl34SB9P-IdGKha1BYwJQbBsg=h310",
        "//lh5.ggpht.com/T0xjq_J5x4FNyBqsTMyTgmr4P4TtPS0GeUwduQN6U_yS6HVf9LXGH9ozemAGAoYD8oY=h310",
        "//lh5.ggpht.com/5vAG87kYNTVGwlO8XcL9fSkv5vhCsYpWXW0VTukQBNZIdcOISAvuYgS8ABoaWwybPYg=h310",
        "//lh4.ggpht.com/ZgQ_Z7w6pXOvoLMZ3Yd3L3dPBceB1fk_pS5o6ArVoZ6Q6BHejrj3D5lQDmsB8Wli4a2g=h310",
        "//lh4.ggpht.com/wN_fwIWPEB-dtJZODHQ8LteTrc0xgAwCPfP3yCbs_l9P4hbmTjGT1054iZkTqpW3Kw=h310"
    ],
    "comments": [
        "Best Birthday Reminder App on Play Store Its free, loads birthdays from contacts automatically and you can add additional reminders for the dates. Plus sounds and vibrations. It has everything needed in a birthday reminder app. Trust me. Just download and enjoy. I added 2 days advance reminder as an extra aside from the midnight reminder.",
        "Nice looking app. It will be useful, if the app will have additional widget and not only DashClock extension. Also more deep integration with Android wear, like ability to scroll thru your birthday list on smartwatch will be welcome addition.",
        "Never reminded me of any bdays Bit pointless reaĺly",
        "I don't understand how this app works?",
        "What the f~~~ Do not know how to use it",
        "Does what it says, which is a good thing. This is an important app to have."
    ],
    "recentChanges": [
        "1.3.1",
        "Fixed bug where app crashes while changing the Notification-Sound",
        "1.3.0",
        "**NEW** Added the ability to give me some donation (if you like so ^^)",
        "1.2.0",
        "**NEW** Now with anniversary",
        "**NEW** Now you can maintain as many reminders as you want",
        "Bugfixes",
        "1.1.12",
        "FIX: In the notification-text (and DashClock-text) the wrong age was shown",
        "1.1.11",
        "If the Dashclock-Widget is only 2 rows high you'll see now the days until the birthday instead of the icon only"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.linuxwhatelse.android.birthdayreminder&hl=en&gl=us",
    "appId": "de.linuxwhatelse.android.birthdayreminder"
}