{
    "title": "Onefootball Live Soccer Scores",
    "summary": "Livescores, live soccer news and videos for the MLS and the Premier League",
    "icon": "//lh3.googleusercontent.com/dPit7g-1fI1dTw_pVukGkAfOedN32HQcY_9npltSx54wYOspwX0SZKNdIGLcCmkVOvQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.7,
    "reviews": 728409,
    "developer": "Onefootball GmbH",
    "developerId": "Onefootball+GmbH",
    "developerEmail": "info@onefootball.com",
    "developerWebsite": "http://www.onefootball.com/",
    "updated": "February 2, 2018",
    "version": "9.10.6",
    "genre": "Sports",
    "genreId": "SPORTS",
    "description": "⚽️  SOCCER ⚽️ Never miss another match or the latest transfers news. Onefooball is THE football app to have. Are you a die-hard supporter of US soccer? Then follow the MLS, Lamar Hunt U.S. Open Cup and much more. Or are you also interested in international soccer? Then Onefootball has more than 200 major leagues and competitions to offer, such as the World Cup, Premier League, Liga MX, Primera Division and many more. Our favorite function allows you to customize Onefootball to your needs. COMING SOON - RUSSIA WORLD CUP 2018 Onefootball is the only Soccer app you need for this summer’s World Cup in Russia 2018. Whether you support Brazil, Germany or Mexico, we’ve got plenty of content for our USA fans to tackle. Keep up with the latest news, scores, stats and key dates throughout the competition. See the match schedule for the group stages and follow your team all the way to the knockout stages and beyond. Get real-time updates during games and read player profiles for each of the 32 qualified WC teams. Kick-off the world’s greatest tournament with us.LIVE SCORESWe’ve got you covered with live scores from the latest Soccer matches with all goals.INSTANT PUSH NOTIFICATIONSBe the first to get livescore updates or the latest transfer rumours with our instant push notification system.FOOTBALL NEWS AND HIGHLIGHTSFollow teams, players or competitions around the world and get personalised football news and videos.COMPETITION, PLAYER, AND CLUB PAGESFrom the Champions League to the MLS, Confed Cup to the FA Cup to 200+ more competitions, we’ve got you covered. Look up your favourite clubs and read up on all players.ALL TRANSFERSBe the first to know about transfer rumors and confirmed transfers including transfer fees.FOOTBALL TABLESWith our standings, you can see instantly how many points your club has in the competition.FIXTURES AND RESULTSWe show you upcoming matches and the results of the previous matches. VIDEOS AND VIDEO CHANNELSSit back, relax and watch everything about your soccer club.LIVE COMMENTARYFollow our expert analysis on all major soccer matches including the MLS, the FA Cup, the Champions league and the World Cup qualifiers and you can vote for the best player of any of the matches.PREDICT RESULTSPredict results for upcoming soccer matches and share them with your friends. Who of you is the best football expert?Stay in touch and share your feedback with us!Facebook: facebook.com/Onefootball Twitter: @OnefootballENInstagram: OnefootballSnapchat: onefootballsnapEmail: feedback@onefootball.com",
    "descriptionHTML": "&#x26BD;&#xFE0F;  SOCCER &#x26BD;&#xFE0F; <br>Never miss another match or the latest transfers news. Onefooball is THE football app to have. Are you a die-hard supporter of US soccer? Then follow the MLS, Lamar Hunt U.S. Open Cup and much more. Or are you also interested in international soccer? Then Onefootball has more than 200 major leagues and competitions to offer, such as the World Cup, Premier League, Liga MX, Primera Division and many more. Our favorite function allows you to customize Onefootball to your needs. <br><br>COMING SOON - RUSSIA WORLD CUP 2018<br> <br>Onefootball is the only Soccer app you need for this summer&#x2019;s World Cup in Russia 2018. Whether you support Brazil, Germany or Mexico, we&#x2019;ve got plenty of content for our USA fans to tackle. Keep up with the latest news, scores, stats and key dates throughout the competition. <br><br>See the match schedule for the group stages and follow your team all the way to the knockout stages and beyond. Get real-time updates during games and read player profiles for each of the 32 qualified WC teams. Kick-off the world&#x2019;s greatest tournament with us.<br><br>LIVE SCORES<br>We&#x2019;ve got you covered with live scores from the latest Soccer matches with all goals.<br><br>INSTANT PUSH NOTIFICATIONS<br>Be the first to get livescore updates or the latest transfer rumours with our instant push notification system.<br><br>FOOTBALL NEWS AND HIGHLIGHTS<br>Follow teams, players or competitions around the world and get personalised football news and videos.<br><br>COMPETITION, PLAYER, AND CLUB PAGES<br>From the Champions League to the MLS, Confed Cup to the FA Cup to 200+ more competitions, we&#x2019;ve got you covered. Look up your favourite clubs and read up on all players.<br><br>ALL TRANSFERS<br>Be the first to know about transfer rumors and confirmed transfers including transfer fees.<br><br>FOOTBALL TABLES<br>With our standings, you can see instantly how many points your club has in the competition.<br><br>FIXTURES AND RESULTS<br>We show you upcoming matches and the results of the previous matches. <br><br>VIDEOS AND VIDEO CHANNELS<br>Sit back, relax and watch everything about your soccer club.<br><br>LIVE COMMENTARY<br>Follow our expert analysis on all major soccer matches including the MLS, the FA Cup, the Champions league and the World Cup qualifiers and you can vote for the best player of any of the matches.<br><br>PREDICT RESULTS<br>Predict results for upcoming soccer matches and share them with your friends. Who of you is the best football expert?<br><br><br>Stay in touch and share your feedback with us!<br>Facebook: facebook.com/Onefootball <br>Twitter: @OnefootballEN<br>Instagram: Onefootball<br>Snapchat: onefootballsnap<br>Email: feedback@onefootball.com",
    "histogram": {
        "1": 13752,
        "2": 7176,
        "3": 22060,
        "4": 112668,
        "5": 572753
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/APldM_TnnZzkyYWTKUrKAQsobAHsINXegeqsmnifDmFCypWUaJW_hg-37nfl6O_WxJgK=h310",
        "//lh3.googleusercontent.com/lpUao5JGWAS3eTZYGDk-AARdhC-7pvtVlorFyoNVjoM95DMjH0mEtXOUy8StIxM8Diw=h310",
        "//lh3.googleusercontent.com/4WE4f889cktiNAi_LVCLV8Xtk7YNVsPcdXZAobPmbDHZlOxcIavkHn-ucrmBIEIIRzYj=h310",
        "//lh3.googleusercontent.com/7gcHPKlQ6ocX7JKeKcFBcubk6b7uTrC2YxWAXVOr0sJgO5-YykOLt-E944Tv5HAJ2hk=h310",
        "//lh3.googleusercontent.com/jvMenpZaoCTF49DnG-E-rA02l_nklkZDHxBzux5Zj59HiSz1H6u5dAq_nP4NxoWBEg=h310",
        "//lh3.googleusercontent.com/s6zso9jmE7_wMe3ewICUtBxREfjnPUuLsTFrEC8rZNgBYc149ZBS2nYhNo385T4UdodY=h310",
        "//lh3.googleusercontent.com/uhWsOaxaRdRwVB3UwC4SmGcEAy5PMPAOPqks8W_tpqNMmtn6yq5G975TAjpsJom2aDI=h310",
        "//lh3.googleusercontent.com/lVtnptYsxif6bEE-GtGNvCQoItpfL9-w93WWoFjO-NuQyZ7FvvUMoJzAaWye0NCvlJE=h310",
        "//lh3.googleusercontent.com/eRWS31FyRMOjc_fulAvRJ3xUUnVn0tvlH-3azG1fDeIRhPYfSiNOVDDVIJykmZdpl5UO=h310",
        "//lh3.googleusercontent.com/qfVUVnDjyzG90Eo96S79rYeeiY2xK0zMfXlE68xEtIyoO3RyP13GGEK99X5_pcth-Ohv=h310",
        "//lh3.googleusercontent.com/GChj_FfrPreLtoSq_ILnR1eZWnWFJrAY2AQG9aYAa-7psO_6xm6IKTeZ0LyfDsN8JjZu=h310",
        "//lh3.googleusercontent.com/Q72Vu6tKA7HLuzmGM2gKrCu9VXb3MGXgwvp6jAHVmXSPHCQq1gluHjyWDsGZxqAZvNVi=h310",
        "//lh3.googleusercontent.com/reUzyDvMZyy3kDZqV5ZRLuSOIiyNf6E1axiZJjf_V3fW2nun_DvKT4IDIJCLiFA6qmc=h310",
        "//lh3.googleusercontent.com/SzL42fO3AWKfQZh-Gs3c6ydfprF2pf5aQqcuxpcIdwkxznba1KJi1rSwPv7hGE28Eg=h310",
        "//lh3.googleusercontent.com/iWl1K-cmBODXv8tqFVP5AYVILZjdSo3Cp0-h7PvtVeaw_bwHKuXMSJSXtDkyLikQHR8=h310",
        "//lh3.googleusercontent.com/9iL2QDkefWB4bGvqUhIsxBvtdiKoRMsErKngCN0no9pZW3GoBVYP_5CTjpDnHedfZA=h310",
        "//lh3.googleusercontent.com/JhsQbYDMCGNg8PVYZfUYqM2pQvKxvSxVxOKw6OEJug_j7Cm_Z1pwuQLQ5kVLt5vO4SOm=h310"
    ],
    "video": "https://www.youtube.com/embed/ZtyTUl9CAZk",
    "comments": [
        "Very informative with lots of football videos that are fun to watch on the go. If choosing between this and BBC sport, I would have both. BBC sport is great for all round sports, including tennis and rugby and onefootball is better for football. However, for championship teams, not all players are registered and have a profile-something which would be a nice upgrade for the lower league supporters. Overall, a great app for viewing football anywhere and a good time killer for long journeys. Very informative and fun to use. For premier league fans, it probably is a 5-Star as the main focus is on that league.",
        "Excellent app. Love the following option and favorite teams. Still surprises me when it tells me there's a gol in my favorites' games and I don't even know they were supposed to be playing!. I didn't give it five stars because there must be some room for improvement like live updates with videos.  Thank you for the good work",
        "This app is great for getting the latest football news quickly. They're are no annoying adds popping up and it will always give you he run down of everything to do with football. You can choose what team you support and others you want to follow. It will give you match statistics and facts before the match has even started. And also every time a goal is scored it will give you a notification in that game of your favored team you chose. Very helpful and informative and I have had it for about a year and a half now. BRILLIANT...",
        "It has everything you can ask for, team news, updates, stats on every single player its just a great app all around. One thing i wish they did was have info as to what channel games were on. But other than that great app",
        "Always network error, when a match start it shows match didnt start &now dont show league stats. This app is now  worse. Have to uninstall this app. Dont know how this app still got better rating.",
        "Better than Goal, which really is its only serious competitor on the Play Store. Also my hair grew back within weeks, my libido is like it was freshman year of college, and my meatstick grew 11 inches, around. (think about that) Thanks Onefootball!!!"
    ],
    "recentChanges": [
        "Hi Onefootball fans, with our latest release you will have an all-round smoother in-app experience. Don’t forget to follow your favourite team to get the latest news from your club. We have also made some minor improvements and bug fixes. Let us know what you think.",
        "Share your feedback with us:",
        "Facebook: facebook.com/Onefootball",
        "Twitter: @OnefootballEN",
        "Email: feedback@onefootball.com"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.motain.iliga&hl=en&gl=us",
    "appId": "de.motain.iliga"
}