{
    "title": "wearFlight Flightnavigation",
    "summary": "wearFlight is a flightnavigation app for your Android wear device.",
    "icon": "//lh3.googleusercontent.com/plAzPpeU_kywTZFfu4GZLf_pTqpW0eK8iCNyCf6Zy2BSdJ8Rf6HpUBT3DjcxfsXGlQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 2,
    "reviews": 3,
    "developer": "Markus Freyt",
    "developerId": "Markus+Freyt",
    "developerEmail": "openvfr@gmail.com",
    "developerWebsite": "http://www.wearflight.de",
    "developerAddress": "openVFR, Markus Freyt\nBultmanstraße 11\n33330 Gütersloh, Deutschland",
    "updated": "July 3, 2017",
    "version": "1.2",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "description": "wearFlight is a flightnavigation app for your Android wear device. The usage of GPS (Global Positioning Signal) will help you get oriented during your flights. While flying cross-country finding your destination airport (or other navigational waypoints like VOR, NDB,...) by use of GPS obviously requires considerably less effort by the pilot and saves time for concentrating on the flight operation itself. With wearFlight its easy and fast to get up-to-date information about the current heading, bearing to the final destination, expected arrival time and the current weather and many more - just by a brief look at your watch!wearFlight was developed by real pilots with regards to the requirements for usage of modern technology in the cockpit and tested under real life condition. Learn more: www.wearFlight.dePricing:After downloading you can test the app with the full range of functions for 14 days. If you like wearFlight, you can subcribe it at Google Play Store for approx. 4.20 EUR (excl. tax) per month. You could easily cancel the subcription at any time. All financial transactions will be performed directly with Google.Importance Notes:1. wearFlight is a very young project. Currently it is tested with Sony SmartWatch 3 and LG Watch Urbane. During cross-testing we didn't notice any major issues - therefore we assume that wearFlight might be compatible with many other Android smartwatches. Attention: We recommend to use wearFlight with Sony Smartwatch 3 because this smartwatch has its own standalone GPS module and a transflective TFT-LCD display, which improoves the visibility both in the dark and during direct sun exposure. Feedback from users about compatibility to other smartwatches and -phones is highly appreciated. Many thanks.  2. Most Smartwatches use the GPS of the handy. If your smartwatch has its own GPS module, wearFlight can be used also without your smartphone. However, in this case you will not receive any weather updates (requires internet connection).3. Within wearFlight you have access to navigational data of 20 EU countries (DE, AT, CH, BE, CZ, DK, ES, FR, IR, IT, LU, NL, LU, NL, PL, UK). We plan to add much more countries shortly. Don't hesitate to contact us.....4. wearFlight was developed within just six months. We would be pleased, if you send us your feature requests or report us any bugs at: openvfr@gmail.com5. More information: www.wearFlight.de Unfortunately our website and the manual has not yet been translated into english. Legal Notices:1. Accuracy of satellite navigation signals over EuropePlease note, that the Global Positioning System (GPS) can provide your location, altitude, and speed with near-pinpoint accuracy, but its accuracy might vary from region to region. Also its accuracy its highly dependant on the constellation of satellites above you or many other aspects...2. Flight preparationAlso when using GPS during the flight a preparative flight planning is mandatory and legally required. Pls, plan and check your flight route by use of AIP or any other official sources and your own calculations. Also carefully check official NOTAMs and query official weather sources. 3. Secure flight operationwearFlight is not certified for secure flight operation. Of course, it might help you in orientating during your flight, but (esp. during VFR flights) you are legally required to primary navigate by visual flight rules and the usage of ICAO charts, etc.4. DisclaimerLicensor does not warrant that wearFlight will be free of defects, run without interruption, meet the expectations of Licensee, or function in combination with all  devices. 5. Data sourcesAeronautical data by www.openaip.net ( with kind permission of Butterfly Avionics GmbH)Meteorological data of www.aviationweather.gov",
    "descriptionHTML": "wearFlight is a flightnavigation app for your Android wear device. The usage of GPS (Global Positioning Signal) will help you get oriented during your flights. While flying cross-country finding your destination airport (or other navigational waypoints like VOR, NDB,...) by use of GPS obviously requires considerably less effort by the pilot and saves time for concentrating on the flight operation itself. With wearFlight its easy and fast to get up-to-date information about the current heading, bearing to the final destination, expected arrival time and the current weather and many more - just by a brief look at your watch!<br><br>wearFlight was developed by real pilots with regards to the requirements for usage of modern technology in the cockpit and tested under real life condition. <br><br>Learn more: www.wearFlight.de<br><br><br>Pricing:<br><br>After downloading you can test the app with the full range of functions for 14 days. If you like wearFlight, you can subcribe it at Google Play Store for approx. 4.20 EUR (excl. tax) per month. You could easily cancel the subcription at any time. All financial transactions will be performed directly with Google.<br><br><br>Importance Notes:<br><br>1. wearFlight is a very young project. Currently it is tested with Sony SmartWatch 3 and LG Watch Urbane. During cross-testing we didn&apos;t notice any major issues - therefore we assume that wearFlight might be compatible with many other Android smartwatches. Attention: We recommend to use wearFlight with Sony Smartwatch 3 because this smartwatch has its own standalone GPS module and a transflective TFT-LCD display, which improoves the visibility both in the dark and during direct sun exposure. Feedback from users about compatibility to other smartwatches and -phones is highly appreciated. Many thanks.  <br><br>2. Most Smartwatches use the GPS of the handy. If your smartwatch has its own GPS module, wearFlight can be used also without your smartphone. However, in this case you will not receive any weather updates (requires internet connection).<br><br>3. Within wearFlight you have access to navigational data of 20 EU countries (DE, AT, CH, BE, CZ, DK, ES, FR, IR, IT, LU, NL, LU, NL, PL, UK). We plan to add much more countries shortly. Don&apos;t hesitate to contact us.....<br><br>4. wearFlight was developed within just six months. We would be pleased, if you send us your feature requests or report us any bugs at: openvfr@gmail.com<br><br>5. More information: www.wearFlight.de <br>Unfortunately our website and the manual has not yet been translated into english. <br><br><br>Legal Notices:<br><br>1. Accuracy of satellite navigation signals over Europe<br>Please note, that the Global Positioning System (GPS) can provide your location, altitude, and speed with near-pinpoint accuracy, but its accuracy might vary from region to region. Also its accuracy its highly dependant on the constellation of satellites above you or many other aspects...<br><br>2. Flight preparation<br>Also when using GPS during the flight a preparative flight planning is mandatory and legally required. Pls, plan and check your flight route by use of AIP or any other official sources and your own calculations. Also carefully check official NOTAMs and query official weather sources. <br><br>3. Secure flight operation<br>wearFlight is not certified for secure flight operation. Of course, it might help you in orientating during your flight, but (esp. during VFR flights) you are legally required to primary navigate by visual flight rules and the usage of ICAO charts, etc.<br><br>4. Disclaimer<br>Licensor does not warrant that wearFlight will be free of defects, run without interruption, meet the expectations of Licensee, or function in combination with all  devices. <br><br>5. Data sources<br>Aeronautical data by www.openaip.net ( with kind permission of Butterfly Avionics GmbH)<br>Meteorological data of www.aviationweather.gov",
    "histogram": {
        "1": 2,
        "2": 0,
        "3": 0,
        "4": 1,
        "5": 0
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/4RoV6b_NfEklsRMm5xSjEb8oBEok_4mcf_gy0sjX9wy7fUBqfy7Z-7h5a0Vv7bVuyw8=h310",
        "//lh3.googleusercontent.com/4lIffeper23etwh0K7onLPLUCNrYoyi2eU4l4pJNihMIXN_iUOmTerze8Nl_JCICfJo=h310",
        "//lh3.googleusercontent.com/AParvCTwQNAPxuYB5jv6UFaBExjqeYbtdkq09JBWqx4_OH3R-zUL4t7wpQOzylgPtqKh=h310",
        "//lh3.googleusercontent.com/5w9HOJyrS8agmULCnLwo2N8F0O13tvJi9kBUXjSDbZslpEJSQdoT5si5DbgydhimjlmD=h310",
        "//lh3.googleusercontent.com/YISSuI5_UcSQnBV44ceTqmittMXXapgB5xFoQziQYlvs0OEuvgf_eZRQ60FLxXwuS_Y=h310",
        "//lh3.googleusercontent.com/hcodGti3uDjw-QwnbVwRJ5FslNMRBI-8Aqs8svWLbnaN2c3PaL-1WCouBtFcMOf6IGQ=h310",
        "//lh3.googleusercontent.com/xSgid_ldSKzAxly-R0NRtZc52g5d4NevRhvfVqRItQUA_SEi0V9RyVr-qdqkMi88ozA=h310",
        "//lh3.googleusercontent.com/Pjnd_E0k70Yg4Z5CdtcLHcgv-KH5Cptf-_GPPIZQd7ExPx6VX9jL7Lb4QM_aqnYe0P8=h310",
        "//lh3.googleusercontent.com/-zC1CDAIwTLV9f_VUNbbuFVLKkIvjfw9YVFLSeNxXdKzF87L30-yVQr0Wul8sAmLo17p=h310",
        "//lh3.googleusercontent.com/52yI61hDi5ox0eDcLXM5tPVuR5DDxhrrCpw8N9V7YuRSn-WlpS5dVN43eOWpzfTRjA=h310",
        "//lh3.googleusercontent.com/8IoQh8gKEwHIt8PRq_78Cp82XJXhLCUbhp_J9MD9hvBKgWGsaKfKnBo1l-O8OQakZdTX=h310",
        "//lh3.googleusercontent.com/MXYmI-v_7XVPqQluY8vrDiGIRtRkj7SD6jLeO-P1wmJpsaaHqkvcZhEd8BURlpveog=h310",
        "//lh3.googleusercontent.com/wBDTGF2yXTaCHB-wCHJYvyWpphSz9eX-5mOkFdl2QrQIjuBFUHEx_C-_-Z2sbfDiJMY=h310",
        "//lh3.googleusercontent.com/MmHMfa74VQNsBLSipHwO8Vwu6Yb0YI6OvjXze8YrKFKEsK9mGLOChgBvabO1wGFnqsY=h310"
    ],
    "comments": [],
    "recentChanges": [
        "Management of user waypoints",
        "Bugfixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.openvfr.wearflight&hl=en&gl=us",
    "appId": "de.openvfr.wearflight"
}