{
    "title": "BikeComputer Pro",
    "summary": "BikeComputer Pro is one of the best apps for cycling.",
    "icon": "//lh3.ggpht.com/HnvCgsYk0-deZvws0rXC-oEt5oT6vSang3UjlO1_QqIXoguGSY9TMdbh95yz5vGbkIQ=w300",
    "price": "$4.99",
    "free": false,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.7,
    "reviews": 4161,
    "developer": "RoProducts",
    "developerId": "RoProducts",
    "developerEmail": "bikecomputerpro@googlemail.com",
    "developerWebsite": "http://bikecomputer.roproducts.de",
    "developerAddress": "Robert Oehler\nMax-Beer-Str.18\n10119 Berlin",
    "updated": "January 28, 2018",
    "version": "7.7.1",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "BikeComputer Pro is one of the best apps for cycling or other outdoor activities. The Pro version contains all the features you need:✓ New : Support for Ant+ and Bluetooth power meters✓ Support for Ant+/Bluetooth 4 (BLE) heart-rate, cadence, speed and temperature(Ant+ only) sensors✓ Easy route setup : create a route in a few steps ✓ Route recalculation when you leave it (BikeComputer Premium necessary)✓ You can use multiple offline map files simultaneously✓ Pause, resume or continue any session, also after a reboot / battery change✓ Support for Android Wear ✓ No login, no account necessary. All data will remain on the device until you upload it. BikeComputer Pro is of course ad-free✓ Synchronisation - plan a route on your tablet, synchronise and use it on your mobile✓ Turn-by-turn instructions : the app indicates you when to make a turn on your route✓ You can load turn-by-turn instructions also for imported GPX✓ Rotating map : the map follows your direction to have the upcoming area always on top✓ Audio Feedback – BikeComputer Pro informs you about your average speed, the current elevation, the remaining distance on trail, your climbing speed, your heart rate and training zone, when you have lost the actual trail and other information✓ Import GPX tracks or POIs and follow the track of a friend on the map✓ Take photos or set waypoints during your ride✓ Use the barometric sensor to achieve exact elevation change data (if your devices features it)✓ Modify the resolution of the offline map and the font size of the driving values ✓ Support for Polar Bluetooth 2.0 heart rate straps ✓ Plan your route! Touch the map where you want to go. BikeComputer Pro will calculate a route with distance, elevation and elevation profile for you and will save the route to follow it while riding✓ Adjust the GPS sensitivity as you want, which means you can determine in which intervals the GPS values are refreshed✓ Arrange and setup your session values as you want and the app saves this order✓ Additional driving values as number of currently used satellites, accuracy of the GPS signal and the direction according to the GPS positionYou can import your sessions from the free version as well.If you change your phone, backup your session to SD card and restore them on the new phone or use the synchronisation!",
    "descriptionHTML": "BikeComputer Pro is one of the best apps for cycling or other outdoor activities. The Pro version contains all the features you need:<br><br>&#x2713; New : Support for Ant+ and Bluetooth power meters<br><br>&#x2713; Support for Ant+/Bluetooth 4 (BLE) heart-rate, cadence, speed and temperature(Ant+ only) sensors<br><br>&#x2713; Easy route setup : create a route in a few steps <br><br>&#x2713; Route recalculation when you leave it (BikeComputer Premium necessary)<br><br>&#x2713; You can use multiple offline map files simultaneously<br><br>&#x2713; Pause, resume or continue any session, also after a reboot / battery change<br><br>&#x2713; Support for Android Wear <br><br>&#x2713; No login, no account necessary. All data will remain on the device until you upload it. BikeComputer Pro is of course ad-free<br><br>&#x2713; Synchronisation - plan a route on your tablet, synchronise and use it on your mobile<br><br>&#x2713; Turn-by-turn instructions : the app indicates you when to make a turn on your route<br><br>&#x2713; You can load turn-by-turn instructions also for imported GPX<br><br>&#x2713; Rotating map : the map follows your direction to have the upcoming area always on top<br><br>&#x2713; Audio Feedback &#x2013; BikeComputer Pro informs you about your average speed, the current elevation, the remaining distance on trail, your climbing speed, your heart rate and training zone, when you have lost the actual trail and other information<br><br>&#x2713; Import GPX tracks or POIs and follow the track of a friend on the map<br><br>&#x2713; Take photos or set waypoints during your ride<br><br>&#x2713; Use the barometric sensor to achieve exact elevation change data (if your devices features it)<br><br>&#x2713; Modify the resolution of the offline map and the font size of the driving values <br><br>&#x2713; Support for Polar Bluetooth 2.0 heart rate straps <br><br>&#x2713; Plan your route! Touch the map where you want to go. BikeComputer Pro will calculate a route with distance, elevation and elevation profile for you and will save the route to follow it while riding<br><br>&#x2713; Adjust the GPS sensitivity as you want, which means you can determine in which intervals the GPS values are refreshed<br><br>&#x2713; Arrange and setup your session values as you want and the app saves this order<br><br>&#x2713; Additional driving values as number of currently used satellites, accuracy of the GPS signal and the direction according to the GPS position<br><br>You can import your sessions from the free version as well.<br><br>If you change your phone, backup your session to SD card and restore them on the new phone or use the synchronisation!",
    "histogram": {
        "1": 70,
        "2": 59,
        "3": 108,
        "4": 737,
        "5": 3187
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/AksdLWTxX4xZ3Xtwu-8jFr10isyfOTc7J8v0PURiyh4HhumKzr9e63owweWepP-q-ZfH=h310",
        "//lh5.ggpht.com/d8jNpUbLe4UVYMU86fvb9Rcl5TtB1HnGpXkjejF9uD8s85514YUS0j8d6k_7Ht0p65k=h310",
        "//lh3.googleusercontent.com/Z7-yamI8CtA76-8zv_CONKNOfk-gFy8Mkxm0Av70BrCCDudkoHNeIwo3y1iy371GNw=h310",
        "//lh6.ggpht.com/qAY47KVync7ITCPqIbBxXDb_54YITfYB-6-mVBOTRFYjwcPO6xESIy7GX9AdsbW9YoTH=h310",
        "//lh6.ggpht.com/s6EaJYvMxUxm7Em7P_IfWe1NMQ-ZtGDKxKU4pKtq4PJxZM9xoZiOTOaLMEvcqnOTd2g=h310",
        "//lh5.ggpht.com/zIPe6ar6vFx19HSJF0SQToO4NRyGjOWCgq8s_6E0IdwytfL-QN1IgatzypQ2EYTrJg=h310",
        "//lh5.ggpht.com/IASucgeDPwA-ei3mxa18-n1lDTb3oCIz_LTKzcyh8-8Q5eFoUkLeSgKtGuEjCbhzzhE=h310",
        "//lh5.ggpht.com/FI3mINAIhP1sSSlNIqsZ3izSn5kJWd78rb_3jFAVScA8yugLT1fDyuQsOSaFxZ__D2xq=h310",
        "//lh3.googleusercontent.com/UBJRbvFlH4O1UtDrWWWtkdsszQHMCKnoogvvo-WEa8pPne1_07CEzqRv9uTemO9EYw=h310",
        "//lh3.googleusercontent.com/OCnsG_kXdHWJfTwl3xbCTMC2g4FnNpE34GBx6FWz7EsJcU9wkLwadrtVk_m3sNw9BzQ=h310",
        "//lh3.googleusercontent.com/awE8KzBJWP4BmYVTquJAbCly-oyF_R2n2jGCY8BCLfWbTV5BMPsk6r9jsSmOkKlDkA=h310",
        "//lh3.googleusercontent.com/lMSi3VZsAUmtefcgpT7XajLCVmJlTBrBcKuMNvsHDz11vrQXRS-Iw6j4wE_kmMMTyzM=h310",
        "//lh3.googleusercontent.com/TUN4o342no66IOAvromrWeV1LKi60Rjblh206VdR95HYjwvyIeDSe5JVocdpsy1W=h310",
        "//lh3.googleusercontent.com/CcvtGv-DMj02XikPlu7wIpOE8oLXQuphvgdrZApgL_nJhxy490dbmHLZKyPG254MupA=h310",
        "//lh3.googleusercontent.com/PUKIFw_rwunsdGtvsffjTbxVrARXRfggAVyM0wD_euz_VKzi49EuJsu_69l8pz9MDHA=h310",
        "//lh3.googleusercontent.com/-CxrFJXsovmTtDMkE5KE6Oewdku-y0Tbu5S3HcfXJ_SbwX_5hx7Ge-RccUyxXQzqt37M=h310",
        "//lh3.googleusercontent.com/BCTwTgAgeeqFL1hXsxDAOM99-48ZZhJoaM2YHzkYYAOI-IFEotxU3ctYcqUQvcBp9yw=h310",
        "//lh3.googleusercontent.com/anhALL0fw7WDiX7nGAnr3X3NPO85MBZXZsa-ywIehZm8TeEMbfKdHo-xnL3ZMHosrF4=h310",
        "//lh3.googleusercontent.com/WYdpMMARWp0JnWOliiUmjApHJN64Z7xwkhJgQmFNTQjPmV0bCS1pGZ_X20JRas8sVg=h310",
        "//lh3.googleusercontent.com/h0kbmU-ePhZb7pV5D2gsNtH61PtnEKpoo9AMkhwv77DBI_hsNznMd7WK2kXBnme-UBc=h310",
        "//lh3.googleusercontent.com/C6TmpF676HyA9f7UEh6Dg4JmeHWzf7JnBt_eIy9gomw1v9sMi96vmJICjfBqdMSPN9VX=h310"
    ],
    "video": "https://www.youtube.com/embed/snYsw_ewaYQ",
    "comments": [
        "It's okay.   I find the it is easy to use. I have a few little issues when pausing a session and the sensors cut out.  A couple of anomalous top speed and elevation data when uploading to Strava. Though the graphs do seem accurate.   The GPS and offline maps work great and routing with the aid of Google or grasshopper also is snappy and quick to organise.   Sensor troubles aside. I find the app to be pretty decent and would recommend.",
        "I used to use this app also for my walks but since last updates, I'm not able anymore to track them, when the speed is about between 6 and 13 km/h. Is it possible to fix?",
        "Works really well. Like the customizable displays, audio updates & Strava sync. Only thing missing for me is .gpx uploads and the ability to follow the elevation profile like a Garmin does.",
        "Fantastic,I use it to replace a bike computer",
        "Great app. Thank you.  I have been using the pro version for about 8 months now. I have found ways to do everything that I need with it.   I like to access to the data so that I can post process it to provide the statistics that I require.  At present, I upload to Strava and then download the gpx file from there for my processing.  I do not hesitate to recommend BikeComputer pro to anyone who will listen to me.",
        "Best of any HRM app. (I hope that one day it displays my power *while I ride*."
    ],
    "recentChanges": [
        "7.7.1",
        "✓ Removed map1eu map as it was no longer working",
        "✓ Optimizations and bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.rooehler.bikecomputer.pro&hl=en&gl=us",
    "appId": "de.rooehler.bikecomputer.pro"
}