{
    "title": "Radioplayer - Gratis Radio App",
    "summary": "The best German stations in one app - Free Radio Tune in radioplayer.de",
    "icon": "//lh3.googleusercontent.com/YefDE03NUy8IPNO3fI_gIlkFYRoSAN6tggkkXZnCtl_pJdHVqI9Px1EAwHOXxQgipA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.5,
    "reviews": 11213,
    "developer": "Radioplayer Deutschland GmbH",
    "developerId": "Radioplayer+Deutschland+GmbH",
    "developerEmail": "support@radioplayer.de",
    "developerWebsite": "https://www.radioplayer.de",
    "updated": "August 14, 2017",
    "version": "3.10.306.15",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Genießen Sie die besten deutschen Sender in einer App – kostenlos und datenschonend. Mit der offiziellen Radio App der deutschen Radiostationen und Webradiosender für Android Smartphones und Tablets hat das Suchen ein Ende: Statttausender Kanäle finden Sie hier einfach und übersichtlich alle deutschen Radios. NEU: Ab 19.04. und ab Tarif Magenta M kostenfrei: Die mobile Nutzung des Radioplayers wird Telekom-Kunden nicht mehr angerechnet.Speichern Sie Favoriten einfach und für den schnellen Zugriff im Auto mit extragroßen Symbolen, blättern Sie durch Ihre persönliche Empfehlungsliste die sich durch Ihre Hörgewohnheiten ständig verbessert. Finden Sie Stationen in ihrer unmittelbaren Nähe oder entdecken Sie Stationen aus anderen Teilen Deutschlands, die Sie vielleicht seit Ihrem letzten Urlaub vermissen. Außerdem können Sie nachsehen und -hören, welche Stationen bei anderen Radioplayer-Hörern gerade besonders beliebt sind. Musik-Streaming leicht gemacht: Mit der Power-Suche können Sie nach Sendern, Sendungen, Orten, Webradios, Podcasts, Moderatoren oder Musiktiteln suchen. Extra große Favoriten-Buttons für Ihre Lieblingsprogramme sorgen im Auto-Modus für sicheres Hören beim Fahren.Chromecast kompatibel: Freuen Sie sich auf ein noch schöneres Radio-Erlebnis. Die Radioplayer-App unterstützt Chromecast-Video und Chromecast-Audio.Podcast: Comedy, Nachrichten, Interviews und ganze Sendungen als Podcast zum Nachhören finden Sie in der Mediathek.Sleep-Timer und Radiowecker-Funktion: Lassen Sie sich mit Ihrem Lieblingssender wecken oder schlafen Sie mit ihm ein.  Android Wear: Der Radioplayer macht auch am Handgelenk eine gute Figur und funktioniert mit Ihrer Android-Smartwatch.Echte Vielfalt: Erleben Sie Stationen wie Antenne Bayern, HIT RADIO FFH, 1live, Radio 7, Teddy, Radio SAW, Antenne Niedersachsen, SWR3, Radio Regenbogen, Deutschlandfunk, N-JOY, delta radio, Radio Hamburg, 104.6 RTL Berlin, radio ffn, 105.5 NDR2, JAM FM, BB Radio, planet radio, Rockland Radio, Fritz, MDR JUMP,  alle öffentlich-rechtlichen Sender von NDR, MDR, HR, WDR, SWR, SR und Deutschlandradio, ihre ganz persönlichen Lokalradios und viele Webradio-Only-Angebote von DetektorFM bis Ballermann Radio.Geschmacks-Sache: Ob Rock, Dance, Charts, Top 40, Klassik, Lounge, Indie, Jazz, Soul, Schlager oder Soundtrack. Der Radioplayer bietet Radiogenuss für alle.DAB+: Auf DAB+ fähigen Handys wie dem LG Stylus 2 erkennt die Radioplayer App ob der gerade gehörte Stream auch via DAB+ empfangbar ist und schaltet intelligent um! Helfen Sie uns den Radioplayer besser zu machen. Mails an support@radioplayer.de beantworten wir ganz persönlich.Und jetzt viel Spaß mit der neuen Android Radioplayer-App!Berechtigungen:Damit der Radioplayer seine vielen Funktionen bereitstellen kann, benötigt er einige Berechtigungen auf Ihrem Gerät:- Zugriff auf Telefonstatus: Damit unser Stream automatisch stoppt, wenn das Handy klingelt.- Zugriff auf den Standort: Damit wir Sender in der Nähe anzeigen können.- Zugriff auf den USB-Speicher: Falls Sie die App auf einer SD-Karte speichern möchten, weil auf dem Geräte-Speicher nicht genug Platz verfügbar ist.- Netzwerk: Damit kann der Radioplayer Audiostreams und weitere Informationen über die Radiosender empfangen.- Facebook: Um die Ergebnisse der Empfehlungen optimal auf Sie abzustimmen fragt die App nach Ihrer Facebook-Berechtigung. Geben Sie diese nicht, arbeiten wir mit Ihren Hörgewohnheiten innerhalb der App. Warum ist die App so groß? Wir haben in der App schon alle Sender-Logos gespeichert, damit Sie diese später unterwegs nicht mehr laden müssen. Sobald Sie die App einmal im WLAN laden, werden diese aktualisiert und so auf dem neuesten Stand gehalten.",
    "descriptionHTML": "Genie&#xDF;en Sie die besten deutschen Sender in einer App &#x2013; kostenlos und datenschonend. <br>Mit der offiziellen Radio App der deutschen Radiostationen und Webradiosender f&#xFC;r Android Smartphones und Tablets hat das Suchen ein Ende: Statt<br>tausender Kan&#xE4;le finden Sie hier einfach und &#xFC;bersichtlich alle deutschen Radios. <br><br>NEU: Ab 19.04. und ab Tarif Magenta M kostenfrei: Die mobile Nutzung des Radioplayers wird Telekom-Kunden nicht mehr angerechnet.<br><br>Speichern Sie Favoriten einfach und f&#xFC;r den schnellen Zugriff im Auto mit extragro&#xDF;en Symbolen, bl&#xE4;ttern Sie durch Ihre pers&#xF6;nliche Empfehlungsliste die sich durch Ihre H&#xF6;rgewohnheiten st&#xE4;ndig verbessert. Finden Sie Stationen in ihrer unmittelbaren N&#xE4;he oder entdecken Sie Stationen aus anderen Teilen Deutschlands, die Sie vielleicht seit Ihrem letzten Urlaub vermissen. Au&#xDF;erdem k&#xF6;nnen Sie nachsehen und -h&#xF6;ren, welche Stationen bei anderen Radioplayer-H&#xF6;rern gerade besonders beliebt sind. <br><br>Musik-Streaming leicht gemacht: Mit der Power-Suche k&#xF6;nnen Sie nach Sendern, Sendungen, Orten, Webradios, Podcasts, Moderatoren oder Musiktiteln suchen. <br>Extra gro&#xDF;e Favoriten-Buttons f&#xFC;r Ihre Lieblingsprogramme sorgen im Auto-Modus f&#xFC;r sicheres H&#xF6;ren beim Fahren.<br><br>Chromecast kompatibel: Freuen Sie sich auf ein noch sch&#xF6;neres Radio-Erlebnis. Die Radioplayer-App unterst&#xFC;tzt Chromecast-Video und Chromecast-Audio.<br><br>Podcast: Comedy, Nachrichten, Interviews und ganze Sendungen als Podcast zum Nachh&#xF6;ren finden Sie in der Mediathek.<br><br>Sleep-Timer und Radiowecker-Funktion: Lassen Sie sich mit Ihrem Lieblingssender wecken oder schlafen Sie mit ihm ein.  <br><br>Android Wear: Der Radioplayer macht auch am Handgelenk eine gute Figur und funktioniert mit Ihrer Android-Smartwatch.<br><br>Echte Vielfalt: Erleben Sie Stationen wie Antenne Bayern, HIT RADIO FFH, 1live, Radio 7, Teddy, Radio SAW, Antenne Niedersachsen, SWR3, Radio Regenbogen, Deutschlandfunk, N-JOY, delta radio, Radio Hamburg, 104.6 RTL Berlin, radio ffn, 105.5 NDR2, JAM FM, BB Radio, planet radio, Rockland Radio, Fritz, MDR JUMP,  alle &#xF6;ffentlich-rechtlichen Sender von NDR, MDR, HR, WDR, SWR, SR und Deutschlandradio, ihre ganz pers&#xF6;nlichen Lokalradios und viele Webradio-Only-Angebote von DetektorFM bis Ballermann Radio.<br><br>Geschmacks-Sache: Ob Rock, Dance, Charts, Top 40, Klassik, Lounge, Indie, Jazz, Soul, Schlager oder Soundtrack. Der Radioplayer bietet Radiogenuss f&#xFC;r alle.<br><br>DAB+: Auf DAB+ f&#xE4;higen Handys wie dem LG Stylus 2 erkennt die Radioplayer App ob der gerade geh&#xF6;rte Stream auch via DAB+ empfangbar ist und schaltet intelligent um! <br><br>Helfen Sie uns den Radioplayer besser zu machen. Mails an support@radioplayer.de beantworten wir ganz pers&#xF6;nlich.<br>Und jetzt viel Spa&#xDF; mit der neuen Android Radioplayer-App!<br><br><br>Berechtigungen:<br><br>Damit der Radioplayer seine vielen Funktionen bereitstellen kann, ben&#xF6;tigt er einige Berechtigungen auf Ihrem Ger&#xE4;t:<br><br>- Zugriff auf Telefonstatus: Damit unser Stream automatisch stoppt, wenn das Handy klingelt.<br>- Zugriff auf den Standort: Damit wir Sender in der N&#xE4;he anzeigen k&#xF6;nnen.<br>- Zugriff auf den USB-Speicher: Falls Sie die App auf einer SD-Karte speichern m&#xF6;chten, weil auf dem Ger&#xE4;te-Speicher nicht genug Platz verf&#xFC;gbar ist.<br>- Netzwerk: Damit kann der Radioplayer Audiostreams und weitere Informationen &#xFC;ber die Radiosender empfangen.<br>- Facebook: Um die Ergebnisse der Empfehlungen optimal auf Sie abzustimmen fragt die App nach Ihrer Facebook-Berechtigung. Geben Sie diese nicht, arbeiten wir mit Ihren H&#xF6;rgewohnheiten innerhalb der App. <br><br>Warum ist die App so gro&#xDF;? Wir haben in der App schon alle Sender-Logos gespeichert, damit Sie diese sp&#xE4;ter unterwegs nicht mehr laden m&#xFC;ssen. Sobald Sie die App einmal im WLAN laden, werden diese aktualisiert und so auf dem neuesten Stand gehalten.",
    "histogram": {
        "1": 264,
        "2": 202,
        "3": 418,
        "4": 2785,
        "5": 7544
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/Ijuw3u55sf0Bds4ZnT2Suus0_F21LPOuafYL4om8aOTRK4NiT_4PAxyVcBm9AHCKqw=h310",
        "//lh3.googleusercontent.com/0RNQzfzJdznfiUYeUbjb6YPjbXrbROYPcaQjx-dVQFMlR_yELa7733I16ITqTH2v1GI=h310",
        "//lh3.googleusercontent.com/pLsV7n5usYZvmumdAUdnKLmkJHr3yov8I5NZE4_mK_gfGtXUlUYEhWIDDgyd1V65EEQ=h310",
        "//lh3.googleusercontent.com/osv0t7AZRT8T6zclVdh7C_2dR3DowYDLS3TjlJUlwhE4iuEgKCvAYQXqbFpRB9tZ4Dg=h310",
        "//lh3.googleusercontent.com/xAacPykQbmDiiUpkzLEgdawW4BZZQBlEGgV8V3b_eE2zpsvagpv_jVDo8dljZyei_Xs=h310",
        "//lh3.googleusercontent.com/mpswPJd1cVJazw99_lLY92_fODxkCn7FeSwoPTH2rK4S3Xs2-XejKkpPM7rsPlW3T6fL=h310",
        "//lh3.googleusercontent.com/3lTAUD-eqQE2I-WnZcH3sOGeVAo6gtS2HOaO42WZb6Y31G_J2AsDs_8hDWrczRHapQ=h310",
        "//lh3.googleusercontent.com/0BtLXFYx2SOIYhxpjx36nAXsj1R1evEneYZwvNiEKM8CxMw8giHSE7_yUAOYuXIVyT0H=h310",
        "//lh3.googleusercontent.com/rgdeIrSQ-wcEf1Xl4BdQ0P36tJxUvSWDyYQ4WHR2qsMT2uJLmwPTLMUhBn7wdk95xNg=h310",
        "//lh3.googleusercontent.com/F7RbVytwgMbpU6LegC5Py_OyGnf_RteukWiw53d6trjLe4IDN6Doi15V7-H_WQsEtzc=h310",
        "//lh3.googleusercontent.com/ntTB4QGDfKz5HLSVvLKtwWXABVQSuQqAarU49FhTw5D_4wtOLK81ZM_2w4DAsxmhhw=h310",
        "//lh3.googleusercontent.com/F3IVbHBmCQAstCOONkqDjrpDMw3a6rKhPSNsDz_tdL4VZDoL3e8aGPIaOiD2nOzq4gg=h310"
    ],
    "comments": [
        "Verstellt die Lautstärke beim Öffnen, warum ist mir schleierhaft. Startet sich auch mehrmals neu obwohl es geschlossen wurde.",
        "Super App, besonders in Verbindung mit StreamOn. Leider fehlt eine Option, hohe Qualität auch auf Mobildaten zu erhalten. Damit gäbe es 5 Sterne ;)",
        "nice, clear, maybe could also integrate internet radio streams",
        "Das Springen zum nächsten Sender ist viel zu umständlich.",
        "Bisher beste Radioapp für den deutschsprachigen Raum",
        "Radio mit streamon funktioniert großartig"
    ],
    "recentChanges": [
        "- Aktualisierung zur ChromeCast-Anbindung mit Anzeige der Inhalte",
        "- Implementierung des Smart-Device-Links für Ford- und Toyota-KFZ",
        "- Verbesserung der Stabilität",
        "Daten: Seit April 2017 und ab Tarif Magenta M kostenfrei: Die mobile Nutzung des Radioplayers wird Telekom-Kunden nicht mehr angerechnet. Bitte aktivieren Sie hierzu die Option \"StreamOn\"."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=de.radioplayer.android&hl=en&gl=us",
    "appId": "de.radioplayer.android"
}