{
    "title": "Pitch Perfect (Digital Pitch Pipe)",
    "summary": "Pitch Perfect -- a free digital pitch pipe for singers and musicians!",
    "icon": "//lh3.ggpht.com/SIthmdl6fLwOi8eRh7OsY-LzWfyH6k-jkyJPWuvdzKzDsJx8Vsp7SlpzkcCPDTowKHE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 1548,
    "developer": "DepollSoft",
    "developerId": "DepollSoft",
    "developerEmail": "support@davidpoll.com",
    "developerWebsite": "http://apps.depoll.com",
    "developerAddress": "1866 Peacock Ave.\nMountain View, CA 94043",
    "updated": "December 28, 2017",
    "version": "3.0.1",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Pitch Perfect is a utility app for the musically inclined. At its core, it’s a digital pitch pipe, allowing musicians to take an initial pitch before beginning or rehearsing a song. If you’re the type of person who struggles to match a key signature to the name of a key, the app provides visual aids to make it as easy as matching what you see on your sheet music with the image on your screen. For singers who keep a list of songs and their keys, Pitch Perfect makes it easy!Just hold down the button to play the note!Note: Pitch Perfect makes no effort to synthesize a natural sound -- instead, it generates a plain old sine wave at the appropriate frequency. The goal of the app is to provide quick, easy access to a note when you need it.Tips and tricks:-To reorder your songs, long-press the edit button next to the song and choose \"Move up\" or \"Move down\"-To sort your song list alphabetically, hit the menu button while looking at the list-Hit the menu key on your phone (or look at the action bar) for additional options-Use it with your Android Wear smart watch to remotely control the pitch pipe -- even when the app isn't open-Add a pitch pipe widget to your home or lock screen for easy accessIf you encounter issues or have feature requests, please send them to support@davidpoll.com",
    "descriptionHTML": "Pitch Perfect is a utility app for the musically inclined. At its core, it&#x2019;s a digital pitch pipe, allowing musicians to take an initial pitch before beginning or rehearsing a song. If you&#x2019;re the type of person who struggles to match a key signature to the name of a key, the app provides visual aids to make it as easy as matching what you see on your sheet music with the image on your screen. For singers who keep a list of songs and their keys, Pitch Perfect makes it easy!<br><br>Just hold down the button to play the note!<br><br>Note: Pitch Perfect makes no effort to synthesize a natural sound -- instead, it generates a plain old sine wave at the appropriate frequency. The goal of the app is to provide quick, easy access to a note when you need it.<br><br>Tips and tricks:<br>-To reorder your songs, long-press the edit button next to the song and choose &quot;Move up&quot; or &quot;Move down&quot;<br>-To sort your song list alphabetically, hit the menu button while looking at the list<br>-Hit the menu key on your phone (or look at the action bar) for additional options<br>-Use it with your Android Wear smart watch to remotely control the pitch pipe -- even when the app isn&apos;t open<br>-Add a pitch pipe widget to your home or lock screen for easy access<br><br>If you encounter issues or have feature requests, please send them to support@davidpoll.com",
    "histogram": {
        "1": 232,
        "2": 75,
        "3": 159,
        "4": 291,
        "5": 791
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/DQ--AsETEYHBvwqx-rEsIsETt4WhyBln4m_5FKu_sP-Dn6Zm0UwI4HcUtgMh4zWWxhhQ=h310",
        "//lh3.googleusercontent.com/d_PAR3okngrW-muUnPEqLEy5kwba5sLeTGjPj-pyhhimpIoTCqdDDvLRg6oxorrJKxI=h310",
        "//lh3.googleusercontent.com/92uBWyeM3A8pFvVhW1BMRaMEm85jdwQp6E6VKBzinR769b06xhwtAkXFiVMM6hck_fE=h310",
        "//lh3.googleusercontent.com/Wq90efoqMxM260qMrcETSH3QaR-4U1XBEIUw4dL-p51KpoTayPYGFwBERxHHZP07XCmR=h310",
        "//lh6.ggpht.com/nKcXePdTEvNyzuaRdQYzhVkhvUeK9xV52mLXLkLsuSyYUa5EBEpkcUz64UZwd8dkETQ=h310",
        "//lh3.googleusercontent.com/ihql9qE_SBsGJBUAR6iTDbIZ35QAqqgUeZcVmCdwTLBkSvCd-yVKzf417jdXHHoXjQ=h310",
        "//lh3.googleusercontent.com/DHwvp_vQtsbHxxCHCb7y7Zy9aE1JuLVIG_JQS7qhyuyrB2Xv6uzR6QquFtI3lYLJNME=h310",
        "//lh3.googleusercontent.com/sCS3yOIpNR6uDolWS59EG9T7Cl3YoumqnaYktsEf_5vlrqg_AB304yAkVjd4qQUVl1Q=h310",
        "//lh3.googleusercontent.com/ZzJaUbknzVRb70nTYkvrsCSqOfi3RxHnXJwt11XCE2sW8wLw_6CbKc0C_jbuG3ri8Q=h310",
        "//lh3.ggpht.com/pb7klSKrhd8aI4PwDCUVGvVg3ZgEH67--fjEqNsd-f4ZhbNhycNDCbd9jgpx-0upZg=h310",
        "//lh3.googleusercontent.com/OkbagsQ3p5SEcFu_hVCpHLLN0e2K5BMuUf-APcUhu6JCiBfPwnPd2uWzKbcvoBKwLQ=h310"
    ],
    "comments": [
        "I tried the free version. I paid for the no adds upgrade. Now with the latest updates I have adds again unless I pay a monthly fee. I am very disappointed.",
        "Great app",
        "I've had no issues with it. For those of you who purchased a license, you can still find and download it from your Play Store purchase history. Once you do, the ads are gone, same as ever, so the developer isn't ripping you off. He's changed business model, but he's not ripping off his earliest customers.",
        "The sound this app produces make it intolerable to use, a far cry from the sine wave that was expected, please listen to your consumers and address this issue:)  Update: I downloaded this app to see if anything had changed the swiftly uninstalled in disappointment. Seriously, the sound makes what other wise would be a great app entirely unusable. It didn't used to be this way, please revert the sound back to the way it was, or at least offer the option to change the sound settings back to the advertised sine sound wave, or at the very least respond to let us know that your hearing us out; this is discouraging...",
        "Not pretty, but feature-rich and does the job",
        "Its a great vocal app for pitch range and to find out if your singing flat or to sharp of a notes. Also to help u memorize notes from head voice and chest voice if your not near music, or proper floor monitor when do a show..."
    ],
    "recentChanges": [
        "Minor visual tweaks."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=depollsoft.pitchperfect&hl=en&gl=us",
    "appId": "depollsoft.pitchperfect"
}