{
    "title": "NBK Mobile Banking",
    "summary": "Download the App today and conduct your transactions easily around the clock.",
    "icon": "//lh4.ggpht.com/jD38e-CVazr0uASdgnfgEc46gwxrpL-mV4yJjEs_B52VhQuG2cD98m1WZA8B14Q2MpY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 2031,
    "developer": "National Bank Of Kuwait",
    "developerId": "National+Bank+Of+Kuwait",
    "developerEmail": "e-Business-Kuwait@nbk.com",
    "developerWebsite": "https://nbk.com/kuwait/personal/ways-to-bank/mobile-banking.html",
    "updated": "November 26, 2017",
    "version": "Varies with device",
    "genre": "Finance",
    "genreId": "FINANCE",
    "size": "Varies with device",
    "description": "NBK’s mobile banking application allows you to manage your account through your device. The application is available in Arabic and EnglishIt is a safe, convenient, and practical way to undertake all your banking needs with a simply user-friendly interface.Some of the benefits of the app include:•\tReal-Time balance and transactions updates made on your account•\tThe ability to view the full history of transactions made on your accounts and credit cards•\tTransfer funds between your accounts or other NBK customer’s accounts•\tTransfer funds locally or internationally•\tAbility to transfer money from your credit card to your account (Cash advance)•\tMake instant payments to your credit cards•\tPay your mobile and telephone bills with a touch of a button•\tRequest printed account statements and checkbooks•\tAdding Cash Deposit Machine (CDM) and promotion locators•\tView participating outlets•\tDisplay FAQs •\tLocate your nearest NBK branch or ATM in Kuwait•\tContact NBK through Call Center and Social Media Channels•\tLocate branches and ATMs through the Augmented Reality camera in the app•\tTravel tips•\tAl Jawhara, Loan, and Term Deposit calculators•\tView the exchange rate•\tCreate pre-paid cards with different currencies: in US Dollars, Great Britain Pound, EURO, UAE Dirhams, Egyptian Pound, Indian Rupees, Jordanian Dinar, and Saudi Riyal And much moreThe application is simple, safe, and easy to use.Download the application today and manage your finance at your own convenience.For any support issues, please contact NBK Call Center on 1801801 or via What’s App 52221333 and ask for help! Our trained agents will be more than happy to assist you anytime around the clock.",
    "descriptionHTML": "NBK&#x2019;s mobile banking application allows you to manage your account through your device. The application is available in Arabic and English<br><br>It is a safe, convenient, and practical way to undertake all your banking needs with a simply user-friendly interface.<br><br>Some of the benefits of the app include:<br>&#x2022;\tReal-Time balance and transactions updates made on your account<br>&#x2022;\tThe ability to view the full history of transactions made on your accounts and credit cards<br>&#x2022;\tTransfer funds between your accounts or other NBK customer&#x2019;s accounts<br>&#x2022;\tTransfer funds locally or internationally<br>&#x2022;\tAbility to transfer money from your credit card to your account (Cash advance)<br>&#x2022;\tMake instant payments to your credit cards<br>&#x2022;\tPay your mobile and telephone bills with a touch of a button<br>&#x2022;\tRequest printed account statements and checkbooks<br>&#x2022;\tAdding Cash Deposit Machine (CDM) and promotion locators<br>&#x2022;\tView participating outlets<br>&#x2022;\tDisplay FAQs <br>&#x2022;\tLocate your nearest NBK branch or ATM in Kuwait<br>&#x2022;\tContact NBK through Call Center and Social Media Channels<br>&#x2022;\tLocate branches and ATMs through the Augmented Reality camera in the app<br>&#x2022;\tTravel tips<br>&#x2022;\tAl Jawhara, Loan, and Term Deposit calculators<br>&#x2022;\tView the exchange rate<br>&#x2022;\tCreate pre-paid cards with different currencies: in US Dollars, Great Britain Pound, EURO, UAE Dirhams, Egyptian Pound, Indian Rupees, Jordanian Dinar, and Saudi Riyal <br>And much more<br><br>The application is simple, safe, and easy to use.<br><br>Download the application today and manage your finance at your own convenience.<br><br>For any support issues, please contact NBK Call Center on 1801801 or via What&#x2019;s App 52221333 and ask for help! Our trained agents will be more than happy to assist you anytime around the clock.",
    "histogram": {
        "1": 219,
        "2": 68,
        "3": 121,
        "4": 270,
        "5": 1353
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/V_ywi1vDLVUPIZZ1cZ71uGprgnlcLOOcWnH5Mw2R9MNm6_LlFQ2KrhXZxzU_01gIgA=h310",
        "//lh3.googleusercontent.com/1udWl_jmrWXA1Nc8xG4lYCk8aMWS9Ot4lPpTqMLBa3Os0I-8FRJi54qObQTMv6y_O2zp=h310",
        "//lh3.googleusercontent.com/eHw8yoGRxmGyBty3PAZ1aEgQgJTfpFcA_fnkLhtyXFuu7HLrLIX7qDbkHKE197dfQpE=h310",
        "//lh3.googleusercontent.com/GvbSVIxBdhbuSkzoMYuykDAePpALpieYxP26LK8eaN8kbPTTGkf7YN7Yv5fwLv_Oqw=h310",
        "//lh3.googleusercontent.com/V5GfULaUdOlVkyb1SlvcfBoiA3rIqZviQmHBweuiVUTbQTRoq3Nlh3csGTbnw-BM-AfA=h310",
        "//lh3.googleusercontent.com/nlxYOoN_8rdbvzPUZbOmGaZKW84g7LdDe-mbVlHSUJKoQKFo7miGZrx6NtgZ1DtL5Q=h310",
        "//lh3.googleusercontent.com/SQSaErSmUFAm3QEKpjMth2zuIoBCpCHKj789bVN5ylysxSyqoxiHYd0GGRCC2uvdYbA=h310",
        "//lh3.googleusercontent.com/VTPo5G6INhk0OC4qCI-EN7wmfu9T9nuO3bTgIfQ9cJRnEgpbCiWA3R6PQexCV1A776Y=h310",
        "//lh3.googleusercontent.com/lH5Fwr3tSiGDQskSBc2WTAUmBkdQSBub93QapBnexoOhvfPMzsCkJHCwGdjSVLgBuQ=h310",
        "//lh3.googleusercontent.com/i1_yQ0Lvo5Kt-CnHcWkQiRY-gZg-1QS7hI4l_CiTYIlFOktrKs1nfnhCzOlDXNpTBbI=h310",
        "//lh3.googleusercontent.com/BEVVWlxmiefyEYGiaAoUnbnKNeV-vYq1IO-xBIUbSClLlR6KAJX8mIFtkr3NriWju-c=h310",
        "//lh3.googleusercontent.com/O5QcdeZp8rZI_YgTHwZ6Dct-4PFDL9Pd40SqbdiyXArQel2XhlGJfGxahtIJCb6kXA=h310"
    ],
    "comments": [
        "I think Nbk needs to provide a better service and financial operation to its customers which are unhappy with this so called mobile app. 1. Fingerprint accessibility should be provided for the customer at any cost. And please don't tell us (your customers that iPhone is more secure than android OS because that's a lame excuse. That for the customer to choose and the developer to provide.  2. Nbk should provide local and international  beneficiaries add on for us. Its poor financial operation service that other banks in the GCC are providing those service. Nbk you should be providing better services for your customer isn't that part of your culture.",
        "Needs finger print unlock. I can decide myself if it's secure enough for me..  Also, being able to add a new beneficiary directly from the app would be useful. I had to login to nbk online via my web browser to do something that should be offered on the app.",
        "تحديث جيد ولكن ينقصة بعض الإضافات مثل الدخول السريع على الحساب فادخال كلمة السر كل مرة مزعج جدا ؛ وذلك عن طريق البصمة مثل معظم التطبيقات البنكية والربط مع الساعات الذكية أسوة بنظام الايفون",
        "I can't believe that we still have to type our passwords like savages, what is this 2014!",
        "Need to add fingerprint or iris login like all the other banks",
        "يعني بنك شكبره شعرضه  وتحديثكمالاخير تعبان متى بتسوونه بالله"
    ],
    "recentChanges": [
        "•\tAccount opening through Mobile Application (Current, Saving, Super, Trust, and Al Jawhara) in Kuwaiti Dinar and other currencies (American Dollars, Great Britain Sterling Pounds, Euro, and  Japanese Yen)",
        "•\tSMS subscription",
        "•\tView NBK Miles Points",
        "•\tApply for foreign currency prepaid cards",
        "•\tLive chat",
        "•\tView Loan Details",
        "•\tCustomized eAds",
        "•\tView NBK Investment Products"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=eu.eleader.mobilebanking.nbk&hl=en&gl=us",
    "appId": "eu.eleader.mobilebanking.nbk"
}