{
    "title": "Fit Interval Timer for wear",
    "summary": "Bulid up your body with android wear",
    "icon": "//lh6.ggpht.com/Mktk2sDT89dVz17ageo3D6EOYxV54_xAZCuhHvwRHMea2tz8Xn1RuU8CMJ6fPA0thojA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.8,
    "reviews": 87,
    "developer": "Kodeglam Mobile",
    "developerId": "Kodeglam+Mobile",
    "developerEmail": "kodeglam@gmail.com",
    "developerWebsite": "http://kodeglam.com",
    "developerAddress": "서울특별시 강동구 진황도로 72, 202호",
    "updated": "September 15, 2014",
    "version": "1.002.20140915",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Let's start buliding up your body with android wear.Easy to use workout timer for Crossfit, Interval training, tabata, running, and yoga. - Can customize timer for crossfit, interval training, tabata, and running- Skip forward in workout- Can easily compare the workout times of yesterday and today.keywordkodeglam, smartwatch, android wear, timer, fitness, excercise, workout, crossfit, training, tabata, yoga, interval",
    "descriptionHTML": "Let&apos;s start buliding up your body with android wear.<br>Easy to use workout timer for Crossfit, Interval training, tabata, running, and yoga. <br><br>- Can customize timer for crossfit, interval training, tabata, and running<br>- Skip forward in workout<br>- Can easily compare the workout times of yesterday and today.<br><br>keyword<br>kodeglam, smartwatch, android wear, timer, fitness, excercise, workout, crossfit, training, tabata, yoga, interval",
    "histogram": {
        "1": 11,
        "2": 2,
        "3": 12,
        "4": 27,
        "5": 35
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh4.ggpht.com/SZ1XyENdrzrytwFi5S0MB1AcRA7M2bWuU8kBA_Fex2IpmWZNfliItAaPbQzkfBVmrkk=h310",
        "//lh3.ggpht.com/oy9oLXHYRksoYPHXIfYqwbqutsEN3_JxDNW-Heq9nuVGD8dP2yRTZ_lxyw-GC3qJIs7C=h310",
        "//lh5.ggpht.com/PK8TzbLypez_ekng1KxUMp6JBVbXl07er2oRaHHbsLIOaZVHQsUGoDU-JoGUWajUcBLV=h310",
        "//lh4.ggpht.com/Ccg5MPZm8F_e5SJvPQaydFX0FhanonH5kJcIh60JmU_ADFS39fhxFT7oR7neANKLxD7G=h310"
    ],
    "comments": [
        "Just one thing.. Had 5 stars and changed to 4 because there one thing that could help a lot... Saved presets of different interval timings to select from the watch would be great. I want to use this for multiple workouts, studying and more!.. Just need to be able to save different presets",
        "I have been using this app from past one year in my moto360 sport watch and it was fulfilling my workout purpose, but now it's not syncing to my watch. What's the problem?",
        "Very convenient but has to be reset each time Even though I've configured my preferred intervals on the phone, every time I run the app on my watch it offers the default intervals. I need to open the phone and get the app to sync with my watch to see my customized times.",
        "What is \"ready\"? Everything is fine except after 1 interval of work then rest , it defaults to something called ready, for a short time then back to work... What is up with that?",
        "does not tick in ambient mode so the watch has to be on the whole time for the clock to keep ticking...like...why?",
        "I'm sorry, but this is completely useless. First off, the devs don't understand intervals. The flow of the app is completely screwed up. It should be a warm up period....then workout...then rest. The workout/rest periods repeat for a variable number of times...then there is a cool down period.  It has great potential but it needs work. However, seeing that it hasn't been updated since September 2014 I think its safe to say this app is out of business."
    ],
    "recentChanges": [
        "- Bug fix : Can be set for 10 units round",
        "- Voice Commander \"Timer\" add"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=fitnesstimer.kodeglam.com.fitnesstimer&hl=en&gl=us",
    "appId": "fitnesstimer.kodeglam.com.fitnesstimer"
}