{
    "title": "Podcast Player - Free",
    "summary": "⬇️Fast, lightweight and convenient... the perfect daily companion.⬇️",
    "icon": "//lh3.googleusercontent.com/xFvpTCm5bwx0mggjceAHD5cXeBmuncfvsQXgEfXr3p33RSxkqXOldPVHac0u7Tu-6JE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.6,
    "reviews": 62912,
    "developer": "Player FM Podcasts",
    "developerId": "Player+FM+Podcasts",
    "developerEmail": "android@player.fm",
    "developerWebsite": "http://player.fm",
    "developerAddress": "Nuvomondo Ltd\n86-90 Paul St\nLondon\nEC2A 4NE",
    "updated": "March 2, 2018",
    "version": "Varies with device",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "size": "Varies with device",
    "description": "Listed as Top 30 Best Android apps of 2017 by TheNextWebWe love to ensure that you have the best listening experience. Enjoy a redesigned interface, sync playback position across multiple devices, add notes to episodes, create custom playlists and more!★★★★★ FEATURES ★★★★★📚 A catalog of over 300,000 podcasts - Discover many podcasts on different topics, ranging from daily news to entertainment, and broaden your knowledge in any field.📱💻 Multi-device sync - Share your subscriptions and listen to your favorite podcasts on all your devices, with a single account. So, if you want to go out and your device is charging, you may use another device instead.🚶 Offline listening - Listen to preselected podcasts offline, perfect for commute or climbing mountains. No signal, no Internet, no problem!💾 Store downloads to an SD card - No more worries about running out of space and if you can't download podcasts, by setting the download location to keep your device's memory free.📦 Custom categories - You don't need to scroll down to find particular series. Create custom categories and organize your podcasts the way you like so that you can find them easily.🎧 Advanced audio player - No more struggles to understand what people say in the podcast. Use speed control, intelligent silence skip and volume boost to ensure that you will have the best listening experience!⏲️ Sleep timer - You don't have to worry about falling asleep and that the app will be running all night. Once enabled, the sleep timer will stop the app at the time you choose.★★★★★ PREMIUM FEATURES ★★★★★Player FM Gold — Level up your daily podcast experience with these cutting-edge features:😍 Listen on several devices - Easily sync playlists, playback position & resume playback on any device, including our desktop web app!😎 Custom playlists - Make as many playlists on the app as you want & sync them across devices and the web!😇 Bookmarks - Save noteworthy quotes from episodes you listened to, note them down and play back effortlessly.😚 Custom themes - Experiment with colors and create your own themes, to match your style or mood!😊 Play your collection of media files - Enjoy listening to your local media files, using the Player FM app!😉 Space saver - Save up to 70% of podcast storage and download as many as you want!$0.99/monthPlayer FM Pro — Podcast paradise. All the Gold features, plus the following:😃 Back up - Save your favorite episodes, even when they're deleted by the publisher, as they're now auto-backed up.😋 Turbo Fetch - Follow as many shows as you want and get updates early & often, as our cloud servers will closely monitor them.😎 Personalized search - Look for shows easily, by matching shownotes within your subscriptions and playlists with the personalized search feature.$3.99/monthPrices above are at annual billing rates. Local currencies may vary and local tax added in some regions.Here's what the experts say about Player FM:Android Central: \"Just looks amazing ... packed with useful features ... tell it what you're interested in and watch it work its magic\"LifeHacker: \"Guides you to smart, interesting podcasts\"Tested: \"Right from the start, I found the experience of using Player FM enjoyable\"All About Android: Winner, app arenaGigaOm: \"Makes podcasts look cool again\"There you go! We hope that you enjoy!Player FM is actively developed and supported. Feel free to write to us & share your feedback and we will get back to every mail as quickly as possible. Get in touch with us at android@player.fm for any questions or suggestions.You may also reach us via our social media accounts:Twitter: https://twitter.com/playerfmFacebook: https://www.facebook.com/playerfmBlog: http://blog.player.fm",
    "descriptionHTML": "<b>Listed as Top 30 Best Android apps of 2017 by TheNextWeb</b><br><br>We love to ensure that you have the best listening experience. Enjoy a redesigned interface, sync playback position across multiple devices, add notes to episodes, create custom playlists and more!<br><br>&#x2605;&#x2605;&#x2605;&#x2605;&#x2605; FEATURES &#x2605;&#x2605;&#x2605;&#x2605;&#x2605;<br><br>&#x1F4DA; <b>A catalog of over 300,000 podcasts</b> - Discover many podcasts on different topics, ranging from daily news to entertainment, and broaden your knowledge in any field.<br><br>&#x1F4F1;&#x1F4BB; <b>Multi-device sync</b> - Share your subscriptions and listen to your favorite podcasts on all your devices, with a single account. So, if you want to go out and your device is charging, you may use another device instead.<br><br>&#x1F6B6; <b>Offline listening</b> - Listen to preselected podcasts offline, perfect for commute or climbing mountains. No signal, no Internet, no problem!<br><br>&#x1F4BE; <b>Store downloads to an SD card</b> - No more worries about running out of space and if you can&apos;t download podcasts, by setting the download location to keep your device&apos;s memory free.<br><br>&#x1F4E6; <b>Custom categories</b> - You don&apos;t need to scroll down to find particular series. Create custom categories and organize your podcasts the way you like so that you can find them easily.<br><br>&#x1F3A7; <b>Advanced audio player</b> - No more struggles to understand what people say in the podcast. Use speed control, intelligent silence skip and volume boost to ensure that you will have the best listening experience!<br><br>&#x23F2;&#xFE0F; <b>Sleep timer</b> - You don&apos;t have to worry about falling asleep and that the app will be running all night. Once enabled, the sleep timer will stop the app at the time you choose.<br><br>&#x2605;&#x2605;&#x2605;&#x2605;&#x2605; PREMIUM FEATURES &#x2605;&#x2605;&#x2605;&#x2605;&#x2605;<br><br>Player FM Gold &#x2014; Level up your daily podcast experience with these cutting-edge features:<br><br>&#x1F60D; <b>Listen on several devices</b> - Easily sync playlists, playback position &amp; resume playback on any device, including our desktop web app!<br><br>&#x1F60E; <b>Custom playlists</b> - Make as many playlists on the app as you want &amp; sync them across devices and the web!<br><br>&#x1F607; <b>Bookmarks</b> - Save noteworthy quotes from episodes you listened to, note them down and play back effortlessly.<br><br>&#x1F61A; <b>Custom themes</b> - Experiment with colors and create your own themes, to match your style or mood!<br><br>&#x1F60A; <b>Play your collection of media files</b> - Enjoy listening to your local media files, using the Player FM app!<br><br>&#x1F609; <b>Space saver</b> - Save up to 70% of podcast storage and download as many as you want!<br><br>$0.99/month<br><br>Player FM Pro &#x2014; Podcast paradise. All the Gold features, plus the following:<br><br>&#x1F603; <b>Back up</b> - Save your favorite episodes, even when they&apos;re deleted by the publisher, as they&apos;re now auto-backed up.<br><br>&#x1F60B; <b>Turbo Fetch</b> - Follow as many shows as you want and get updates early &amp; often, as our cloud servers will closely monitor them.<br><br>&#x1F60E; <b>Personalized search</b> - Look for shows easily, by matching shownotes within your subscriptions and playlists with the personalized search feature.<br><br>$3.99/month<br><br>Prices above are at annual billing rates. Local currencies may vary and local tax added in some regions.<br><br>Here&apos;s what the experts say about Player FM:<br><br><b>Android Central:</b> &quot;Just looks amazing ... packed with useful features ... tell it what you&apos;re interested in and watch it work its magic&quot;<br><b>LifeHacker:</b> &quot;Guides you to smart, interesting podcasts&quot;<br><b>Tested:</b> &quot;Right from the start, I found the experience of using Player FM enjoyable&quot;<br><b>All About Android:</b> Winner, app arena<br><b>GigaOm:</b> &quot;Makes podcasts look cool again&quot;<br><br>There you go! We hope that you enjoy!<br><br>Player FM is actively developed and supported. Feel free to write to us &amp; share your feedback and we will get back to every mail as quickly as possible. Get in touch with us at android@player.fm for any questions or suggestions.<br><br>You may also reach us via our social media accounts:<br>Twitter: https://twitter.com/playerfm<br>Facebook: https://www.facebook.com/playerfm<br>Blog: http://blog.player.fm",
    "histogram": {
        "1": 1726,
        "2": 882,
        "3": 2355,
        "4": 13140,
        "5": 44809
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/Wd8T69Xza4wUOz2vwvSy4xV1SxblGJMxJexZZ7BlBpLKD7MkJjyZ0OI0Hrqzc7BS2ML5=h310",
        "//lh3.googleusercontent.com/DSRT9X6RVXCKPltPUWYwM9QBxzO20-VS9DzQVTLGzrspggV76Wf9TlTlcX3bqVs63FBi=h310",
        "//lh3.googleusercontent.com/wwu-NDGFfpTCC6t5NQZKnaFLCRoXOZfO-chHKE3rtdIonqYubC1ZekFIknDNw4fForY=h310",
        "//lh3.googleusercontent.com/eIIJEeaXFVGObdGu7Qgzk68KkfjKGe8NmAp5h25s1lY0eOkQ1vx3BzEtWWkFCsheWWY=h310",
        "//lh3.googleusercontent.com/aYcOCKroCSeHA0i8unien6Vl38vJbM6AizsKhcsMriqSNmH-5aR9uy1XrxRhR8J1w50=h310",
        "//lh3.googleusercontent.com/sza82fFt_F6MdkDlbeCuMuhkQzzwTCj3nsD1frVK4YxJ9_-ggPdQyqS_hb2LT2x5pN9y=h310",
        "//lh3.googleusercontent.com/_LEekQKZJrD5OBzVxUh_QFu5XbTHquZrEKc7ZJtBbsLiE2sxKIVVHYZPGBgahecT0g=h310",
        "//lh3.googleusercontent.com/-m5OAo2tFrzpQ5bQynpKzSh5z3uYVaS01IVkJ8r4IZhBazFnr_4gijRw-GpKTZgxhA=h310",
        "//lh3.googleusercontent.com/oIIwvg8syrqYEc8sPLjBcF3U_eqFH0HnhjJisnAA-48ARNfOnvFpLLcv3cyUJEfGBg=h310",
        "//lh3.googleusercontent.com/6rxzrzCYulNv4Fx9Hj1jFeTJh1xwv4buFkkOH1Anq1O0S-i8P-JY6dv8GvJqGz32cudy=h310",
        "//lh3.googleusercontent.com/8BrRQme6KVLDn_Qv0kCeRJBKFR3xpDtmjHo5eUfpBBkP1DuDV0HdrYR6tDOktV6W4X4=h310",
        "//lh3.googleusercontent.com/J5dLfrMZk8SrHokSOcz_4OmOKy2BwIZovumQaN4ztEVEe3iIOCZ6Zr3AD7R3FA3bTyY=h310"
    ],
    "video": "https://www.youtube.com/embed/FqwlbsJ2bXc",
    "comments": [
        "Moving from one star to two. All the new stuff is very pretty but sadly its too unreliable. 3 podcasts not updating today, but are fine in my backup app. The fact I need a backup app on my phone shows this is not an isolated incident",
        "Have used this app for a year with no problems. Last week or so half my feeds have not been synchronising properly. Switching to another podcast app until they fix it",
        "Terrible. About 1 out of 10 uses results in my note 8 overheating and draining the battery in 2-3 hours. I can use any other player for 30+ hours and they don't turn my phone into a hand warmer.  It appears they are aware of issues. I hope they are resolved soon. Just don't fall asleep without terminating the app manually, it's otherwise a good app. System warns of battery drain caused by player FM generally when the app is not playing sound and is closed but still running in background (often when sleep after episode is used)  Tried to send logs, but I'm unsure if they went through.",
        "Terribly. Very buggy. I wanted to like it, but had to delete it",
        "The app is mostly fine, but the skip episode setup is a bit wonky. I find that I have to hit previous track to play the downloaded episodes I have.",
        "Really janky app, for a long time have had issues downloading episodes, when trying to download on cellular it's almost impossible"
    ],
    "recentChanges": [
        "- Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=fm.player&hl=en&gl=us",
    "appId": "fm.player"
}