{
    "title": "My CookBook (Recipe Manager)",
    "summary": "Store all your favorite recipes! Recipe manager with search and import features.",
    "icon": "//lh5.ggpht.com/HdW_8yt4Suvb23Nl9iQxL10YxmyPfx2hjuKO5xIGr9NAl4mjcgpaAOXL31rKywl6Zg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 20415,
    "developer": "Maadinfo Services",
    "developerId": "Maadinfo+Services",
    "developerEmail": "androidcookbook@gmail.com",
    "developerWebsite": "http://mycookbook-android.com/site/",
    "developerAddress": "2 allée des Ormeaux\n06130 Grasse\nFrance",
    "updated": "February 1, 2018",
    "version": "Varies with device",
    "genre": "Food & Drink",
    "genreId": "FOOD_AND_DRINK",
    "size": "Varies with device",
    "description": "Store all your favorite recipes in one place! My CookBook is a recipe manager with search and import features.My CookBook lets you create your own digital cookbook.  Build your own recipe database by gathering recipes on the web and using the import features.It is you and your own cookery!You are looking for a new recipe ? Use our searching engine to find a new recipe on the web. When you have found one you like, import it into My CookBook. Then you will be able to view it everywhere on your phone or your tablet. You can add your own photo, change ingredients or directions, or add you own commentsYou already have a cookbook ? Add a new recipe into My CookBook manually, or import your digital cookbook using one of the file formats we support like Meal Master (.mmf), MasterCook (.mxp), LivingCookBook (.fdx) , ReKconv (.rk)...You want to share some recipes with your friends ? Invite your friends to join My CookBook, share your recipes with them and view their recipes. Or share your recipes on Facebook or by email, sms, and others. You can also send them a “My CookBook” file they will be able to load into their appMy CookBook also includes these features :• Create shopping lists using your recipe ingredients• Synchronize your recipes on different devices using dropbox• Scale the ingredients to serve more or less people• Use the speech feature to read recipes• Customize various parts of the app such as theme, font size, categories.• Earn Kiip Rewards by adding new recipes• Open recipes on your Android Wear watchMy CookBook is also available on your desktop: https://www.mycookbook-online.net Create a free account on our online version My CookBook Online and you will enjoy these additional features (in the app and the website):• Save up to 105 recipes and 8 shopping lists in the cloud• Synchronize up to 105 recipes and 8 shopping lists between all your android applications and your online account• View and manage these recipes on any computer or any device• Invite your friends to join My CookBook Online and view their recipes• Plan your meals and generate a shopping list for the weekCreate a Premium account on My CookBook Online and :• All your recipes and shopping lists will be saved in the cloudMore details here : https://www.mycookbook-online.net/pro/The creation of an account on My CookBook Online is optional and the number of recipes is not limited in the Android application.We support more than 200 websites. If your favorite cooking website is not supported, you can submit a request or vote for already submitted requests here : https://www.mycookbook-online.net/siterequests/My CookBook , the only cooking app you need !Ads in the app may be removed by purchasing an in-app add-on or by installing the paid version of My CookBook : https://play.google.com/store/apps/details?id=fr.cookbookproHelp us to translate My CookBook to other languages : https://mycookbook.oneskyapp.comKey words : cook, cooking, recipe, shopping list, recipe manager, meal planner",
    "descriptionHTML": "Store all your favorite recipes in one place! My CookBook is a recipe manager with search and import features.<br><br>My CookBook lets you create your own digital cookbook.  Build your own recipe database by gathering recipes on the web and using the import features.<br>It is you and your own cookery!<br><br><br>You are looking for a new recipe ? Use our searching engine to find a new recipe on the web. When you have found one you like, import it into My CookBook. Then you will be able to view it everywhere on your phone or your tablet. You can add your own photo, change ingredients or directions, or add you own comments<br><br><br>You already have a cookbook ? Add a new recipe into My CookBook manually, or import your digital cookbook using one of the file formats we support like Meal Master (.mmf), MasterCook (.mxp), LivingCookBook (.fdx) , ReKconv (.rk)...<br><br><br>You want to share some recipes with your friends ? Invite your friends to join My CookBook, share your recipes with them and view their recipes. Or share your recipes on Facebook or by email, sms, and others. You can also send them a &#x201C;My CookBook&#x201D; file they will be able to load into their app<br><br><br>My CookBook also includes these features :<br>&#x2022; Create shopping lists using your recipe ingredients<br>&#x2022; Synchronize your recipes on different devices using dropbox<br>&#x2022; Scale the ingredients to serve more or less people<br>&#x2022; Use the speech feature to read recipes<br>&#x2022; Customize various parts of the app such as theme, font size, categories.<br>&#x2022; Earn Kiip Rewards by adding new recipes<br>&#x2022; Open recipes on your Android Wear watch<br><br><br>My CookBook is also available on your desktop: https://www.mycookbook-online.net <br><br><br>Create a free account on our online version My CookBook Online and you will enjoy these additional features (in the app and the website):<br>&#x2022; Save up to 105 recipes and 8 shopping lists in the cloud<br>&#x2022; Synchronize up to 105 recipes and 8 shopping lists between all your android applications and your online account<br>&#x2022; View and manage these recipes on any computer or any device<br>&#x2022; Invite your friends to join My CookBook Online and view their recipes<br>&#x2022; Plan your meals and generate a shopping list for the week<br><br><br>Create a Premium account on My CookBook Online and :<br>&#x2022; All your recipes and shopping lists will be saved in the cloud<br><br><br>More details here : https://www.mycookbook-online.net/pro/<br><br><br>The creation of an account on My CookBook Online is optional and the number of recipes is not limited in the Android application.<br><br><br>We support more than 200 websites. If your favorite cooking website is not supported, you can submit a request or vote for already submitted requests here : https://www.mycookbook-online.net/siterequests/<br><br><br><br>My CookBook , the only cooking app you need !<br><br><br><br>Ads in the app may be removed by purchasing an in-app add-on or by installing the paid version of My CookBook : https://play.google.com/store/apps/details?id=fr.cookbookpro<br><br><br>Help us to translate My CookBook to other languages : https://mycookbook.oneskyapp.com<br><br><br>Key words : cook, cooking, recipe, shopping list, recipe manager, meal planner",
    "histogram": {
        "1": 580,
        "2": 326,
        "3": 890,
        "4": 5217,
        "5": 13402
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/gkIWYGs2DvfkfwlEzz62VwYUa227umEJ490Ps6HYAW6zxEpt0egZQ8jjS0PzBTLER6ra=h310",
        "//lh3.googleusercontent.com/nI1sTipARTlYdZpaDBX6lJtyGPtqdttXwPmBhMJY92xWocaaqCUFnmCl8QZGT3ERyXti=h310",
        "//lh3.googleusercontent.com/u2-EqDwlYVV7tSjnP2pmK6T4vhn_L81D_UVpSaN1xp3iObjiHwlkIU7KY-VHHfZncJE=h310",
        "//lh3.googleusercontent.com/69lcKFDRyh92XlLVKrJEjeT2fA9u_QhtOdLwOwLyQv_GEAGPpScRydmwZCztiksXSgs=h310",
        "//lh3.googleusercontent.com/q2wu09QeUtrAKFqF_j815oe1QXimrDrN5dTgFNTeOTt8ZIwUi8jlftAnYVTIaWBPaIM=h310",
        "//lh3.googleusercontent.com/pZxrZbYQpSwtjjUN24usV3HXX-MHS4mHLT5qA4nsiqoq7EeHYU0OyMm6d-pr3HRMS-o=h310",
        "//lh3.googleusercontent.com/9FpgndwSvF1ZJSLT0uEjDkzJMjUsp2WFbm_Y_CxrAQPWNVklapHIGO1qev3KyZvysS4=h310",
        "//lh3.googleusercontent.com/4dFkW4y1AZF7bjZA1HOstMbLkmGkz3O40B76RZ1VFtOc3xoL9NTix8wYy9J_KYj1Vg=h310",
        "//lh3.googleusercontent.com/9YIMS2WsZOY9vjTvqibKOoM5maekwXxASbt1BxuY0G0JFc28LXQOGfyRyTOx_xT9=h310",
        "//lh3.googleusercontent.com/_SKnfP3vaYSqBUgqNV5OX1riU4OMHeCuXW_rMrRevsdEgOG_XBM0MnA3Yp6MxlU1e9Q=h310",
        "//lh3.googleusercontent.com/4I9qM541n4qxOsMlGNqAnIlFNDxZYiSeultRiZaYZhBX6pDXMwJTOI3KZDRjzh1usyFn=h310",
        "//lh3.googleusercontent.com/LIjjW2EzQvqJO1GPgPU3WYrvwATAAHlVniuiL4G63CXzQ24k4WpKt2Pg9-gNWlLrqQ=h310",
        "//lh3.googleusercontent.com/haBaS9oJH4y5k9VPSUbaDhsHkX3fz-FRxCVTeI_fuwgJy3yf2plnf0iblhIzfKV4qAsE=h310",
        "//lh3.googleusercontent.com/ojvhafhratVfGjglAvX3y_JqltOfN25or2FEQFT1SIsQx4vFDEX1o3-M30ysMRdtNw=h310",
        "//lh3.googleusercontent.com/oiVtuJCe9NPAa-yNvZk1-YbnKkExWLmVGPOY7bT9AhyUihAotOnWc_TfAcPH1uOfKQ=h310"
    ],
    "comments": [
        "Really good! Really really good. I've used it now for over three years which has highlighted my wants list. I'd like it to link to a shopping and kitchen storage app. I'd like it to let me assemble a weeks worth of connected menus and integrate it with my shopping list. But that's being picky. If you want a recipe app then look no further, you've found the best.",
        "I liked the app for its simplicity, however, premium subscription is too expensive and without the synchronization won't work. Furthermore, it seams that the meal planner feature isn't available anymore without sync.  To sum up, it's easy to manage your recipes. Good, light, nice design. But I stay uncertain about pricing politics and available features in the different available  subscriptions.",
        "So easy and beautiful to store and organize recipes. My favorite function is to go the recipe webpage, choose \"share\" to My Cookbook and the instructions and photos are imported in. All I have to do is add categories and tags. It even save the source HTML. Love this. The meal plan function is lame though. I mean... It works...but not very well integrated into the app. Hopefully, it'll improve in the future :)",
        "Love this ~ import any recipe you Google over to this to save. Look up recipes from Food Network on Google, then hit share... Hit the My CookBook app and automatically imports with sections broken up for ingredients and instructions. Used this for a few years now.",
        "Love it. One tiny flaw the the unislim recipes are not compatable to dl to the cookbook. I have a screenshot of what it says so if the makers of this want me to show them please respond with email address I can forward it to. When you fix it I'll update to 5*",
        "I've tried several cookbook apps, and this one is finally a keeper. I hate reading every bloggers blah blah blah, just give me a recipe that I can read quickly! Beautiful, clean, one page layout. You don't  have to click through multiple pages (like pintrest and yummly). Easy to find online recipes, though not all websites work (tops paprika because it imports nutrition and can have multiple pictures).  You can add notes or your own pics, great for customizing to your taste. You can type in or import hour own recipes (yummly can't ) and sharing recipes is easy (paprika doesn't allow exporting). I can't speak to the shopping list, but I do like having cloud storage so I can look my recipes up anywhere, including the grocery store parking lot. My one wish is that it would share with my fitness pal so I could easily add nutrition to my food tracking."
    ],
    "recentChanges": [
        "5.0.34",
        "- Add a tag to your recipes from the recipe list page",
        "- Recipe Edit : You can rotate your images",
        "- Bug fixes",
        "5.0.33",
        "- New supported websites : Smitten Kitchen (en)",
        "- Bug fixes",
        "5.0.31",
        "- New supported websites : Cooking Panda (en), Tasty.co (en), Ricette Mania (it), みんなのきょうの料理 (kyounoryouri.jp)",
        "- Bug fixes",
        "5.0.29",
        "- Bug fixes",
        "5.0.27",
        "- Preferences : you can choose backup directories on your SD Card",
        "- Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=fr.cookbook&hl=en&gl=us",
    "appId": "fr.cookbook"
}