{
    "title": "Mes Comptes - LCL pour mobile",
    "summary": "The latest news in your bank account, your expenses, your balance in one click.",
    "icon": "//lh4.ggpht.com/82YNXGa98OnARYXH8Ibkh9aQ2EBE_rerX1TDRhGZuoz2VUqdywd3l53x7zokkPq3zQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.9,
    "reviews": 25829,
    "developer": "LCL - Le Crédit Lyonnais",
    "developerId": "LCL+-+Le+Cr%C3%A9dit+Lyonnais",
    "developerEmail": "support-android@lcl.fr",
    "developerWebsite": "http://www.lcl.fr",
    "updated": "February 28, 2018",
    "version": "3.7.4",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Besoin de consulter votre solde, vos dépenses, gérer vos crédits ou prendre rendez-vous avec votre conseiller ?L’application sera alors un incontournable.Pour cela, rien de plus simple :• SOLDE EN UN CLIC Profitez dès la page d’accueil d’un aperçu du solde de votre compte, de votre encours carte et de votre cagnotte Avantage+ en quelques secondes.• MES COMPTESGérez vos comptes rapidement et simplementConsultez la liste de vos dépenses en détailGérez votre crédit renouvelableGérez votre épargneConsultez vos relevés de comptes et documents• EFFECTUEZ DES VIREMENTSGrace à l’application, effectuez en toute sécurité des virements bancaires directement de votre smartphoneAjoutez des bénéficiaires, choisissez un compte à débiter et celui à créditer. Immédiat ou différé, choisissez vous-même la date du virement, et tout ça entre vos comptes ou vers des comptes pré enregistrés.• CONTACTEZ OU PRENEZ RENDEZ-VOUS AVEC VOTRE CONSEILLERVous recherchez des informations sur votre banque, vos dépenses, votre épargne, un conseil sur comment gérer votre argent, une demande de prêt ?Vous pouvez prendre rendez-vous directement dans l’agenda de votre conseiller depuis l’application. Retrouvez également toutes les coordonnées de votre conseiller et l’adresse de votre agence LCL. Très pratique : Vous pouvez envoyer des pièces justificatives directement depuis la messagerie.• SUIVEZ LES ACTUS DE VOTRE COMPTESuivez l’actualité de votre compte grâce aux informations bancaires de votre Fil d’actu LCL. Retrouvez vos prélèvements à venir, les échéances de vos cartes, vos rendez-vous avec votre conseiller, etc. Rien de plus simple pour gérer et suivre votre compte !• MAIS AUSSIL’application vous permet aussi de commander votre chéquier pour le recevoir chez vous, ou bien à votre agence LCLVous pouvez vous activer Avantage+ et consulter votre cagnotte en 1 clic sur votre mobile Consulter et partagez vos RIB en quelques clicsConsulter votre portefeuille titreVotre carte bancaire est perdue ou volée ? Faites opposition rapidement grâce au service SOS Carte d’LCLRetrouvez facilement tous les numéros utiles• CONCERNANT LES AUTORISATIONS demandées par l’application- Accéder à des photos, à des contenus multimédia : permet d'envoyer des pièces jointes à votre conseiller via la messagerie sécurisée.- Effectuer et gérer des appels téléphoniques : permet d'appeler nos services en un clic depuis l'Appli ainsi que détecter la présence de logiciel malveillant sur votre téléphone pour une utilisation sécurisée.Avec l’application, reprenez la gestion de vos dépenses, de votre épargne, de votre argent et retrouvez votre conseiller rapidement et facilement pour toute demande. Tout ça n’importe où !Retrouvez toute l’actualité de votre Banque LCL sur les réseaux sociaux :Facebook : https://www.facebook.com/LCLInstagram : https://www.instagram.com/lclbanque/Twitter : https://twitter.com/lclLinkedIn : https://fr.linkedin.com/company/lclViadeo : http://fr.viadeo.com/fr/company/lcl Youtube : https://www.youtube.com/user/lclvideo2010« L'ergonomie et le design ont été totalement revus pour faciliter l'usage des services essentiels de la banque et développer l'expérience utilisateur. » - Boursier.com« En 1 seul clic sur son smartphone, le client a accès au solde de son compte et à l’encours des cartes bancaires, dès le lancement de l’application. Pour la banque, il s’agit de la fonctionnalité la plus appréciée des clients » - billetdebanque.panorabanques.com Vous n’êtes pas client LCL ? Rendez-vous sur le site LCL.fr pour ouvrir un compte.En cas de difficulté ou pour toutes suggestions, n’hésitez pas à nous contacter à l’adresse : support-android@lcl.fr",
    "descriptionHTML": "Besoin de consulter votre solde, vos d&#xE9;penses, g&#xE9;rer vos cr&#xE9;dits ou prendre rendez-vous avec votre conseiller ?<br><br>L&#x2019;application sera alors un incontournable.<br><br>Pour cela, rien de plus simple :<br><br>&#x2022; SOLDE EN UN CLIC <br>Profitez d&#xE8;s la page d&#x2019;accueil d&#x2019;un aper&#xE7;u du solde de votre compte, de votre encours carte et de votre cagnotte Avantage+ en quelques secondes.<br><br>&#x2022; MES COMPTES<br>G&#xE9;rez vos comptes rapidement et simplement<br>Consultez la liste de vos d&#xE9;penses en d&#xE9;tail<br>G&#xE9;rez votre cr&#xE9;dit renouvelable<br>G&#xE9;rez votre &#xE9;pargne<br>Consultez vos relev&#xE9;s de comptes et documents<br><br>&#x2022; EFFECTUEZ DES VIREMENTS<br>Grace &#xE0; l&#x2019;application, effectuez en toute s&#xE9;curit&#xE9; des virements bancaires directement de votre smartphone<br>Ajoutez des b&#xE9;n&#xE9;ficiaires, choisissez un compte &#xE0; d&#xE9;biter et celui &#xE0; cr&#xE9;diter. Imm&#xE9;diat ou diff&#xE9;r&#xE9;, choisissez vous-m&#xEA;me la date du virement, et tout &#xE7;a entre vos comptes ou vers des comptes pr&#xE9; enregistr&#xE9;s.<br><br>&#x2022; CONTACTEZ OU PRENEZ RENDEZ-VOUS AVEC VOTRE CONSEILLER<br>Vous recherchez des informations sur votre banque, vos d&#xE9;penses, votre &#xE9;pargne, un conseil sur comment g&#xE9;rer votre argent, une demande de pr&#xEA;t ?<br>Vous pouvez prendre rendez-vous directement dans l&#x2019;agenda de votre conseiller depuis l&#x2019;application. Retrouvez &#xE9;galement toutes les coordonn&#xE9;es de votre conseiller et l&#x2019;adresse de votre agence LCL. <br>Tr&#xE8;s pratique : Vous pouvez envoyer des pi&#xE8;ces justificatives directement depuis la messagerie.<br><br>&#x2022; SUIVEZ LES ACTUS DE VOTRE COMPTE<br>Suivez l&#x2019;actualit&#xE9; de votre compte gr&#xE2;ce aux informations bancaires de votre Fil d&#x2019;actu LCL. Retrouvez vos pr&#xE9;l&#xE8;vements &#xE0; venir, les &#xE9;ch&#xE9;ances de vos cartes, vos rendez-vous avec votre conseiller, etc. Rien de plus simple pour g&#xE9;rer et suivre votre compte !<br><br>&#x2022; MAIS AUSSI<br>L&#x2019;application vous permet aussi de commander votre ch&#xE9;quier pour le recevoir chez vous, ou bien &#xE0; votre agence LCL<br>Vous pouvez vous activer Avantage+ et consulter votre cagnotte en 1 clic sur votre mobile <br>Consulter et partagez vos RIB en quelques clics<br>Consulter votre portefeuille titre<br>Votre carte bancaire est perdue ou vol&#xE9;e ? Faites opposition rapidement gr&#xE2;ce au service SOS Carte d&#x2019;LCL<br>Retrouvez facilement tous les num&#xE9;ros utiles<br><br>&#x2022; CONCERNANT LES AUTORISATIONS demand&#xE9;es par l&#x2019;application<br>- Acc&#xE9;der &#xE0; des photos, &#xE0; des contenus multim&#xE9;dia : permet d&apos;envoyer des pi&#xE8;ces jointes &#xE0; votre conseiller via la messagerie s&#xE9;curis&#xE9;e.<br>- Effectuer et g&#xE9;rer des appels t&#xE9;l&#xE9;phoniques : permet d&apos;appeler nos services en un clic depuis l&apos;Appli ainsi que d&#xE9;tecter la pr&#xE9;sence de logiciel malveillant sur votre t&#xE9;l&#xE9;phone pour une utilisation s&#xE9;curis&#xE9;e.<br>Avec l&#x2019;application, reprenez la gestion de vos d&#xE9;penses, de votre &#xE9;pargne, de votre argent et retrouvez votre conseiller rapidement et facilement pour toute demande. Tout &#xE7;a n&#x2019;importe o&#xF9; !<br><br>Retrouvez toute l&#x2019;actualit&#xE9; de votre Banque LCL sur les r&#xE9;seaux sociaux :<br>Facebook : https://www.facebook.com/LCL<br>Instagram : https://www.instagram.com/lclbanque/<br>Twitter : https://twitter.com/lcl<br>LinkedIn : https://fr.linkedin.com/company/lcl<br>Viadeo : http://fr.viadeo.com/fr/company/lcl <br>Youtube : https://www.youtube.com/user/lclvideo2010<br><br>&#xAB; L&apos;ergonomie et le design ont &#xE9;t&#xE9; totalement revus pour faciliter l&apos;usage des services essentiels de la banque et d&#xE9;velopper l&apos;exp&#xE9;rience utilisateur. &#xBB; - Boursier.com<br><br>&#xAB; En 1 seul clic sur son smartphone, le client a acc&#xE8;s au solde de son compte et &#xE0; l&#x2019;encours des cartes bancaires, d&#xE8;s le lancement de l&#x2019;application. Pour la banque, il s&#x2019;agit de la fonctionnalit&#xE9; la plus appr&#xE9;ci&#xE9;e des clients &#xBB; - billetdebanque.panorabanques.com <br><br>Vous n&#x2019;&#xEA;tes pas client LCL ? Rendez-vous sur le site LCL.fr pour ouvrir un compte.<br><br>En cas de difficult&#xE9; ou pour toutes suggestions, n&#x2019;h&#xE9;sitez pas &#xE0; nous contacter &#xE0; l&#x2019;adresse : support-android@lcl.fr",
    "histogram": {
        "1": 2409,
        "2": 1521,
        "3": 3300,
        "4": 8359,
        "5": 10240
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/onE7MD2dTuVd-edgqZoPv3AOPSLMR4Tg7-gx5iFhNjeOMJ0n0N5ssCSaF4Kc3egHrZY=h310",
        "//lh3.googleusercontent.com/HHidEh7g-5KO1MYQ1I9tJo0ORMYmmEFlU9cqQOmbNYcJyDlwCckmsJ4XDsga_fCh1w=h310",
        "//lh3.googleusercontent.com/8Gi_RvUtK1NNmEC-je0xs1aEp3LYHBDn9cRfWuYhg9vZhww9UnXVRTM6YG-i7Gr5YPE1=h310",
        "//lh3.googleusercontent.com/9sc1pEP6zJbxt8UccqV3S3QwK0XOPah6iTj-Z6xu9VNquS2mFCNTrQKNSNVzpUSJgvE=h310",
        "//lh3.googleusercontent.com/J5vs0pBmCR52T4ODkG6SThQ-3qnN5mfumra7mOZzp5NhfNGptATSwoWCr0JOoaaOpsY=h310",
        "//lh3.googleusercontent.com/hzpUlwzIE_ozFuYbyUmaFHvc-ow1yUxbfigEqrm4c3yS_mBTK3VgJHJ7fPcfkt6enCU=h310",
        "//lh3.googleusercontent.com/BsYoos4zQJgAPt7PgvKgIypwv9DX8kjeo2cJkhlHWseA0W02pgK1ekzLPIU4U7q8Y2E=h310",
        "//lh3.googleusercontent.com/NdgGTA6Qhj7qup8kdNuaU8_zKPm5tI0gTHeCleEOeDFU-K_BlMB6dRUMnqk5_YcYuQ=h310"
    ],
    "comments": [
        "Dernier mis à jour, c'est une très mauvaise idée de séparer les comptes et l'epargne, il faudra avoir une vue globale qui somme tout les compte !!!",
        "Nouvelle gestion des droits tout à fait intrusive (il faut autoriser l'appli à gérer les appels !!) et obligatoire (on ne peut pas l'utiliser sinon). Merci de rectifier le tir",
        "Parfaite appli...aucune remarque négative",
        "Léger problème au niveau de l'affichage du montant des virements. J'ai accidentellement viré 1173€ au lieu de 173€  car l'application ne m'affichait pas tous les chiffres que j'avais écrit",
        "LCL vient de changer les permissions requises. Ils veulent accéder à mes photos et fichiers. Pourquoi voudrais je autoriser ma banque à avoir accès à mes fichiers??",
        "Impossible de faire des virements sur des comptes non bénéficiaires (étrangers ou non), ennuyeux car sur la plateforme web les incidents techniques sont légions !"
    ],
    "recentChanges": [
        "Nouveauté :",
        "Correction de bugs.",
        "N’hésitez pas à nous contacter sur support-android@lcl.fr pour continuer à nous faire part de vos remarques."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=fr.lcl.android.customerarea&hl=en&gl=us",
    "appId": "fr.lcl.android.customerarea"
}