{
    "title": "FreeTelec Télécommande Freebox",
    "summary": "Remotely control your Freebox from your Phone / Tablet",
    "icon": "https://lh5.ggpht.com/wg-8wXYQPSFTzNwrfDvA0a9YKFOhXxqz8epRJSSzzcZnFLuod0MyFmwphdfkeShCdg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.1,
    "reviews": 42894,
    "developer": "r0ro",
    "developerId": "r0ro",
    "developerEmail": "r0ro@freetelec.fr",
    "developerWebsite": "http://android.r0ro.fr/",
    "developerAddress": "47 rue du Chemin Vert\n92100 Boulogne Billancourt\nFRANCE",
    "updated": "October 23, 2017",
    "version": "Varies with device",
    "genre": "Tools",
    "genreId": "TOOLS",
    "size": "Varies with device",
    "description": "Cette application gratuite vous permet de contrôler votre Freebox depuis votre téléphone avec une télécommande virtuelle. Sur Freebox V6 vous pouvez utiliser le clavier de votre téléphone pour saisir du texte à l'écran. Vous pouvez aussi utiliser votre écran comme track pad pour déplacer la souris de la Freebox.En plus elle vous permet de consulter la liste des chaines et le programme en cours sans avoir à zapper.Si vous en avez marre de chercher votre télécommande, si vous avez perdu votre télécommande freebox, ou si votre télécommande n'a plus de piles, c'est la solution idéale.FreeTéléc fonctionne par le réseau Wifi, ainsi plus besoin d'être à proximité de la Freebox et plus besoin de viser le récepteur infra rouge !Vous pouvez aussi vous servir de Free Téléc pour faire une blague à vos proches en changeant de chaîne.Pour tester les versions bêta rejoignez la communauté FreeTéléc : https://plus.google.com/communities/116394682203819814246",
    "descriptionHTML": "Cette application gratuite vous permet de contr&#xF4;ler votre Freebox depuis votre t&#xE9;l&#xE9;phone avec une t&#xE9;l&#xE9;commande virtuelle. <br><br>Sur Freebox V6 vous pouvez utiliser le clavier de votre t&#xE9;l&#xE9;phone pour saisir du texte &#xE0; l&apos;&#xE9;cran. Vous pouvez aussi utiliser votre &#xE9;cran comme track pad pour d&#xE9;placer la souris de la Freebox.<br><br>En plus elle vous permet de consulter la liste des chaines et le programme en cours sans avoir &#xE0; zapper.<br><br>Si vous en avez marre de chercher votre t&#xE9;l&#xE9;commande, si vous avez perdu votre t&#xE9;l&#xE9;commande freebox, ou si votre t&#xE9;l&#xE9;commande n&apos;a plus de piles, c&apos;est la solution id&#xE9;ale.<br><br>FreeT&#xE9;l&#xE9;c fonctionne par le r&#xE9;seau Wifi, ainsi plus besoin d&apos;&#xEA;tre &#xE0; proximit&#xE9; de la Freebox et plus besoin de viser le r&#xE9;cepteur infra rouge !<br><br>Vous pouvez aussi vous servir de Free T&#xE9;l&#xE9;c pour faire une blague &#xE0; vos proches en changeant de cha&#xEE;ne.<br><br>Pour tester les versions b&#xEA;ta rejoignez la communaut&#xE9; FreeT&#xE9;l&#xE9;c : https://plus.google.com/communities/116394682203819814246",
    "histogram": {
        "1": 4324,
        "2": 1945,
        "3": 3586,
        "4": 6877,
        "5": 26162
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/ewyiE8qidAWiLS_bh-osKwv4RqJSsLvUeBpcpLAuITsFeTlv31tzL0fl_k9IZV3TBmsm=h310",
        "//lh5.ggpht.com/W5dufAjPAptU9zOf4uhdRYo2wvtqOQcw1AhT3bxJFlLXGlJYUdyEwTpM5wc8hvRy_Eg=h310",
        "//lh4.ggpht.com/wsRksR1X_bIxk9NtBB-U_51pOnHIC4qncCGfXA7v6fLYWr4ofvOls41SbVfWoSOBzWo=h310",
        "//lh4.ggpht.com/70jH9XvSc9BJSUGWEOT0EXv4zRN5efJliLQ0db4fPGt8p7QZ2SLAfrZlwbU_me65AR8=h310",
        "//lh3.googleusercontent.com/kphxAl2XGIlUsSI8zTHA0sxA6esEkgxw1VgvctEaHvHJJ_EeZDnjymAjiJrTtr2B1vo-=h310"
    ],
    "comments": [
        "It works well. Useful. It has a few extras compared to completely free options: mouse and keyboard (very useful!), TV chains list and favorites.  The remote control key layout could be improved, but it's OK.",
        "1. L'interface :  les boutons de AFT (Application Freetelec) ne sont pas disposés comme sur la TCF (TéléCommande matérielle Freebox), c'est un défaut de conception qui grève sensiblement la rapidité et la fiabilité de l'usage. 2. La PUB est de la FAUSSE pub, car, ne cherchant qu'à gêner l'usager (on se demande pourquoi puisqu'il n'y a pas de version payante), elle le rend furieux et n'a évidemment jamais eu la moindre intention ou probabilité de vendre quoi que ce soit à quiconque. C'est horripilant et cause des crashes à répétition. 3. Les touches sont plus réactives que ceux de la TCF. Ça c'est un très bon point, mais il est tempéré par les nombreux défauts : c'est trop souvent que la AFT se met à ne plus répondre du tout ; les boutons n'étant que virtuels on ne les sent pas donc il faut sortir ses lunettes (je suis 77, presbyte) et regarder sans cesse l'écran AFT. 4. Tout montre que pour l'éditeur, ce serait perdre son temps que de songer à améliorer son produit ou à aider ses usagers. Il n'y a donc pas d'espoir que ce produit évolue dans le bon sens. 5. Tout compte fait cette appli est une bonne roue de secours pour les cas (fréquents) où la télécommande Free tombe en panne.",
        "Ne se connecte pas, inutile",
        "Très utile,ça fonctionne bien trop pub",
        "Bonne appli en général Actuellement, l'application se \"déconnecte\" en quelque sorte, au bout de quelques minutes elle ne communique plus à la Freebox (j'utilise la v6) donc je suis obligé de redémarrer la box. Sinon, un peu trop de pub mais bon je n'aurai sûrement pas d'influence la dessus.",
        "Je rencontre souvent des problèmes (freebox ou app), volume bloqué au max ou au min, les chaînes qui s'incrémentent toutes seules, cette app dépanne tout de même quand la télécommande est en panne... Merci free 😁 L'ergonomie de l'app pourrait relativement facilement être améliorée en privilégiant les fonctions les plus utilisées."
    ],
    "recentChanges": [
        "1.9.2",
        "- Correction d'un problème avec la touche 0",
        "1.9.1:",
        "- Amélioration de la prise en charge de la Freebox Mini 4K",
        "- Amélioration de la stabilité",
        "1.9.0:",
        "- Correction d'un problème de zap depuis la liste des chaînes sur Freebox Crystal / V5",
        "1.8.0:",
        "- Ajout du support de la Freebox Mini 4K",
        "- Correction de l'appui long sur Freebox Crystal / V5",
        "- Possibilité de désactiver la recherche des Freebox Crystal / V5 pour accélérer le scan réseau",
        "http://iphone.r0ro.fr/forum/forum5-freetelec.html"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=fr.r0ro.android.FreeTelec&hl=en&gl=us",
    "appId": "fr.r0ro.android.FreeTelec"
}