{
    "title": "FidMe Loyalty Cards & Deals at Grocery Supermarket",
    "summary": "Carry ALL your loyalty cards, coupons, rewards &amp; receipts in ONE wallet app! 🚀",
    "icon": "//lh3.googleusercontent.com/h2GLh3sctlnIPFBr5xv3KHtkoyD2LOTpQLqp_s_M2-O-smDSRDrp_qPhpPe8O7C-rLc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.2,
    "reviews": 31766,
    "developer": "Snapp'",
    "developerId": "Snapp'",
    "developerEmail": "support@fidme.com",
    "developerWebsite": "http://www.fidme.com",
    "updated": "February 19, 2018",
    "version": "Varies with device",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "size": "Varies with device",
    "description": "NO MORE forgotten or lost loyalty cards, no more plastic cards, paper receipts, folders or ads cluttering your wallet and your life ! Wait no more, be a Smart Shopper: ✓ Join 5 millions users on FidMe, the leading Mobile Loyalty Wallet app for your grocery shopping 🛒✓ Let your wallet breathe and save money every day, in a snap 👍👍FidMe Wallet is your Smart Shopping companion, helping you save and keep all your loyalty cards (barcode and stamps cards), grocery coupons and deals directly on your phone, in one single place. ★ Thousands of loyalty cards available ★For ALL your favorite supermarkets, merchants, stores and shops: grocery, fashion, high-tech, beauty or cosmetics, restaurants, gas, sports, DIY, airlines, hotels - and many more!✓ Tesco, Nectar, Boots, Costa Coffee, Matalan, Subway, Sainsbury's, McDonald’s, Ikea, British Airways, Blockbuster, Superdrug, Iceland, Shell, Accor hotels, HMV, Air France, Odeon Toys R Us, Staples...★ Easy, fast and handy ★Just scan your loyalty card to add it in seconds! Wether Barcode, 3D, ID: all your loyalty cards, stamps and reward cards can be saved on your FidMe app.You now just need to show your mobile at purchase to collect your bonus and loyalty points!★ NEW:Digitize & manage your paper receipts ★Scan and store all your supermarket sales receipts, invoices, gift cards or airline tickets in your phone, in just one tap - and access them whenever you need them!★ Never miss out again the best deals around ★ Quickly find all stores and latest offers near you at a glance on the Map! Get notifications for the products, brands and retailers you love, as soon as new promotions, discounts and coupons are available.★ Stamp Cards to save at your local shops ★Earn loyalty points and get rewarded for your loyalty in your favorite coffee shops, restaurants, cinemas and outlets. Scan the FidMe QR code at the check-out to collect stamps at every visit and redeem your freebies, free meals, gifts or coupons.★ Cashback grocery savings on your favorite brands ★Discover our latest cashback offers and coupons, and save on your everyday purchase in all your favorite supermarkets and online shops - no matter where you are shopping! ★ Use FidMe on each shopping trip - and WIN! ★Earn FIDS loyalty points for exclusive deals, lottery, sweepstakes - simply by using your favorite FidMe wallet app: sponsor your friends, add loyalty cards and stamps, Check in on Facebook and Twitter, etc.--- ✓ All Loyalty Cards, Stamp Cards, Vouchers and Deals available FOR FREE, without registration needed.✓  Access all your favorite loyalty cards and coupons in one click, with the FidMe WIDGETS and SHORTCUTS.✓ Compatible with APPLE WALLET / Passbook.☎️ Any question, feedback or suggestion? We'd love to hear from you at support@fidme.com. More info on www.fidme.com.Note: This app may use your location even when it isn’t open, which can decrease device battery life.",
    "descriptionHTML": "<b>NO MORE forgotten or lost loyalty cards, no more plastic cards, paper receipts, folders or ads cluttering your wallet and your life !</b> Wait no more, be a Smart Shopper: <br><b>&#x2713;</b> Join 5 millions users on FidMe, the <b>leading Mobile Loyalty Wallet app for your grocery shopping</b> &#x1F6D2;<br><b>&#x2713;</b> Let your wallet breathe and save money every day, in a snap &#x1F44D;&#x1F44D;<br><br>FidMe Wallet is your Smart Shopping companion, helping you save and keep all your loyalty cards (barcode and stamps cards), grocery coupons and deals directly on your phone, in one single place.<br> <br>&#x2605; <b>Thousands of loyalty cards available</b> &#x2605;<br>For ALL your favorite supermarkets, merchants, stores and shops: grocery, fashion, high-tech, beauty or cosmetics, restaurants, gas, sports, DIY, airlines, hotels - and many more!<br><b>&#x2713;</b> Tesco, Nectar, Boots, Costa Coffee, Matalan, Subway, Sainsbury&apos;s, McDonald&#x2019;s, Ikea, British Airways, Blockbuster, Superdrug, Iceland, Shell, Accor hotels, HMV, Air France, Odeon Toys R Us, Staples...<br><br>&#x2605; <b>Easy, fast and handy</b> &#x2605;<br>Just scan your loyalty card to add it in seconds! Wether Barcode, 3D, ID: all your loyalty cards, stamps and reward cards can be saved on your FidMe app.<br>You now just need to show your mobile at purchase to collect your bonus and loyalty points!<br><br>&#x2605; <b><u>NEW</u>:Digitize &amp; manage your paper receipts</b> &#x2605;<br>Scan and store all your supermarket sales receipts, invoices, gift cards or airline tickets in your phone, in just one tap - and access them whenever you need them!<br><br>&#x2605; <b>Never miss out again the best deals around</b> &#x2605; <br>Quickly find all stores and latest offers near you at a glance on the Map! Get notifications for the products, brands and retailers you love, as soon as new promotions, discounts and coupons are available.<br><br>&#x2605; <b>Stamp Cards to save at your local shops</b> &#x2605;<br>Earn loyalty points and get rewarded for your loyalty in your favorite coffee shops, restaurants, cinemas and outlets. Scan the FidMe QR code at the check-out to collect stamps at every visit and redeem your freebies, free meals, gifts or coupons.<br><br>&#x2605; <b>Cashback grocery savings on your favorite brands</b> &#x2605;<br>Discover our latest cashback offers and coupons, and save on your everyday purchase in all your favorite supermarkets and online shops - no matter where you are shopping! <br><br>&#x2605; <b>Use FidMe on each shopping trip - and WIN!</b> &#x2605;<br>Earn FIDS loyalty points for exclusive deals, lottery, sweepstakes - simply by using your favorite FidMe wallet app: sponsor your friends, add loyalty cards and stamps, Check in on Facebook and Twitter, etc.<br><br>--- <br><b>&#x2713;</b> All Loyalty Cards, Stamp Cards, Vouchers and Deals <b>available FOR FREE, without registration</b> needed.<br><b>&#x2713;</b>  Access all your favorite loyalty cards and coupons in one click, with the <b>FidMe WIDGETS and SHORTCUTS</b>.<br><b>&#x2713;</b> Compatible with <b>APPLE WALLET / Passbook</b>.<br><br>&#x260E;&#xFE0F; Any question, feedback or suggestion? We&apos;d love to hear from you at support@fidme.com. <br>More info on www.fidme.com.<br><br><i>Note: This app may use your location even when it isn&#x2019;t open, which can decrease device battery life.</i>",
    "histogram": {
        "1": 1682,
        "2": 1082,
        "3": 2576,
        "4": 9882,
        "5": 16544
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/MD4NUwcczAvmNPAsbfh8R7Pdo2Od5FxsBIaT_s2OglWWiyhFe6mpDYyyBc58unwv=h310",
        "//lh3.googleusercontent.com/SJzh0RTfLwnCA72LhJuG_82bpRqkAmmPza-tZdomVAd8_6VoViZq4sv9izDgmPdxnd8=h310",
        "//lh3.googleusercontent.com/i4ySMlHT-13NahfTRf8nqbdJaMrizP8dme2A4KTVUx-p5guoKENDaerVXjIpR8H_GnU=h310",
        "//lh3.googleusercontent.com/v8k7HQV6dzhnvHfu6y-6LVRZ3aaSxWfbmaCBQWf8UVQUZak8Cv5R_DgQVkRlovO6NMj6=h310",
        "//lh3.googleusercontent.com/RdI2Hz34e1nPIY1NODthbshfHwJ8-eK_Q-FroD79Xq_jokcX1hI3XOo5xs2Dp4_YLIvD=h310",
        "//lh3.googleusercontent.com/tiCozjtwAADSGqijwozSxQFb3ur4BLEZLYlevtIvcEjGkjixeIjEv9w0gcL8ALsz_oc=h310",
        "//lh3.googleusercontent.com/1U1Q-AS3CHWxIpxIEZUxcMUaMEqCYBjdESOjvUHt4ySZYx9NSmEufRRbDmxRvp_V1g=h310",
        "//lh3.googleusercontent.com/ZqFnLnvnwb8Nw3i6E1cyI0o1LXpk7unz_UpU-txR4yQ3bgn-CCESYRb8Yfro2qwMDhA=h310",
        "//lh3.googleusercontent.com/8eM5TEu9ZZnDtcEm9Slc9QdBap-wN1zXhTR1lQ4g06Fh5zVLQd7sgG7zJ9ItTT4-Fw=h310"
    ],
    "video": "https://www.youtube.com/embed/R2C476ppSJc",
    "comments": [
        "Excellent app . Never crash,  ability to add your own cards and photo of them manually, plus super easy to add loyalty cards of almost any stores .",
        "Good App., makes place in my wallet, sure to get my fidelity points, card scan easy, wouldn't like to miss it😉!",
        "Have so much more space in my wallet after installing this app and transferring all my card to it. Most shops can scan my phone no problem, sometimes the cashier just types in the code, but  it always works.",
        "Perfect app if you want to have all loyalty cards at hand at all times with no extra big wallet.",
        "Did not except at the grocery store...delete!",
        "I really want this to work! My wallet has much more room now but I have yet to find a shop where the stored card is read. I'll have to put the cards back in my wallet. I'm using a Moto Z. Update January 9 2018. At last I found a store where the scanner works. Waitrose!!!  Still no joy at Tesco, Morrisons or Sainsbury."
    ],
    "recentChanges": [
        "🚀 Wait no more: update your FidMe loyalty app, optimized to make your daily grocery shopping quicker and easier and faster!",
        "Our mission #1: make FidMe become your favorite Shopping companion, helping you to save money every day and shop faster & smarter than ever!",
        "---",
        "Got feedback, questions? Let’s keep in touch at support@fidme.com.",
        "Love FidMe? Do not hesitate to show your support and affection with a 5-star rating ;-)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=fr.snapp.fidme&hl=en&gl=us",
    "appId": "fr.snapp.fidme"
}