{
    "title": "Irish Radioplayer",
    "summary": "All RTÉ stations, plus dozens more, in the simplest radio app for phone/tablet",
    "icon": "//lh3.googleusercontent.com/KCnggjRkB__tl_B9xCzvBzlfgFN_PiJHljlcIRZ8ifu1k8C72ffACdrXNCSg123jw88=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 1802,
    "developer": "Irish Radioplayer",
    "developerId": "Irish+Radioplayer",
    "developerEmail": "support@radioplayer.ie",
    "developerWebsite": "https://radioplayer.ie/",
    "updated": "August 14, 2017",
    "version": "3.10.306.15",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "The official Irish Radio app, designed in partnership with RTÉ and the IBI, now available on Android. Works well with HTC One, Samsung Galaxy S3, Samsung Galaxy S4, Asus Phonepad, Asus Nexus 7 and other devices.Car Mode, Sleep Timer, and a slick layout for iPhone. Quite simply, the best radio app in the world.Scroll through radio recommended just for you, see what's local or trending, save your favourite stations and shows, and play them with one tap.All RTÉ services, and dozens more great Irish stations, on your iPad, iPhone, or iPod. Tune in to live streams of radio, or browse our on-demand programmes and podcasts.This radio app has everything from news and sport - to pop, rock, indie, dance, jazz, and classical. It's perfect for football, hurling, rugby, and UK soccer at the weekend.Irish Radioplayer is a partnership between RTÉ and the Independent Broadcasters of Ireland, aimed at making radio listening easier. The partnership is backed by RTÉ (owners of stations like RTÉ Radio 1, RTÉ 2fm, RTÉ lyric fm, RTÉ Raidió na Gaeltachta, RTÉ Gold, RTÉ 2XM, RTÉ Jr Radio, RTÉ Pulse and RTÉ Radio 1 extra).The IBI includes UTV (who run FM104, Q102, C103, Cork’s 96FM, Galway Bay FM, WLRFM, Live 95FM and LMFM), and Communicorp (operators of Newstalk, Today FM, TX FM, Spin 103.8 and Spin Southwest).Other IBI member stations in Radioplayer include Beat, Clare FM, Classic Hits 4fm, East Coast Radio, Highland Radio, iRadio, KCLR 96FM, Kfm, Midlands 103, Midwest Radio, Northern Sound, Ocean FM, Radio Kerry, Radio Nova, Red FM, Shannonside 104, South East Radio, Sunshine and Tipp FM.",
    "descriptionHTML": "The official Irish Radio app, designed in partnership with RT&#xC9; and the IBI, now available on Android. Works well with HTC One, Samsung Galaxy S3, Samsung Galaxy S4, Asus Phonepad, Asus Nexus 7 and other devices.<br><br>Car Mode, Sleep Timer, and a slick layout for iPhone. Quite simply, the best radio app in the world.<br><br>Scroll through radio recommended just for you, see what&apos;s local or trending, save your favourite stations and shows, and play them with one tap.<br><br>All RT&#xC9; services, and dozens more great Irish stations, on your iPad, iPhone, or iPod. Tune in to live streams of radio, or browse our on-demand programmes and podcasts.<br><br>This radio app has everything from news and sport - to pop, rock, indie, dance, jazz, and classical. It&apos;s perfect for football, hurling, rugby, and UK soccer at the weekend.<br><br>Irish Radioplayer is a partnership between RT&#xC9; and the Independent Broadcasters of Ireland, aimed at making radio listening easier. The partnership is backed by RT&#xC9; (owners of stations like RT&#xC9; Radio 1, RT&#xC9; 2fm, RT&#xC9; lyric fm, RT&#xC9; Raidi&#xF3; na Gaeltachta, RT&#xC9; Gold, RT&#xC9; 2XM, RT&#xC9; Jr Radio, RT&#xC9; Pulse and RT&#xC9; Radio 1 extra).<br><br>The IBI includes UTV (who run FM104, Q102, C103, Cork&#x2019;s 96FM, Galway Bay FM, WLRFM, Live 95FM and LMFM), and Communicorp (operators of Newstalk, Today FM, TX FM, Spin 103.8 and Spin Southwest).<br><br>Other IBI member stations in Radioplayer include Beat, Clare FM, Classic Hits 4fm, East Coast Radio, Highland Radio, iRadio, KCLR 96FM, Kfm, Midlands 103, Midwest Radio, Northern Sound, Ocean FM, Radio Kerry, Radio Nova, Red FM, Shannonside 104, South East Radio, Sunshine and Tipp FM.",
    "histogram": {
        "1": 87,
        "2": 65,
        "3": 136,
        "4": 450,
        "5": 1064
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/qYrNduxUtu1Dkqtify09qn8H5EPhWYrnv8HJlcRrcWiX-itzNCBSzKKdMJ1JA_ptwg=h310",
        "//lh3.googleusercontent.com/o_xl0TrFaaGVaZCxc1DBiAU77mCm9QE7aChZ8K-Mid-wdFZbxvg5PUwmBLZjp4f0KUg=h310",
        "//lh3.googleusercontent.com/ih8Z0Sh9LC5H1QvgAgGs0v7oDq7tarijbf7OFuEi7gA6t6y-ogReO9TcmrHJPlvvhg=h310"
    ],
    "comments": [
        "Good for RTE Radio. Newstalk still a bit flaky. On both stations, streaming seems more reliable over mobile data. Newstalk quite often won't stream over Wi-Fi. Generally, internet radio in Ireland (and the bad wireless coverage here) makes me wish that devices still had FM radio receivers. The service is not reliable.",
        "Great idea having them all in one place but i find it a tiny bit slow to open and the pages for each station take ages to load up. And if youve been listening to a station for cpl of hours the 'whats on now' info at the bottom doesnt update from what was on at the beginning ,when you first logged on.",
        "I had it on previous phones and always deleted it as it is just too unstable. Stuck in a loop opening, forgot favourites, annoying buttons that often don't work. Such a shame, it's fine if it always worked",
        "Use the app daily and am very happy with it overall.   Two gripes are the fact that clicking the app in the notifications menu on my OnePlus 5 doesn't bring the app back into focus and the splash screen on launch adds unnecessary delay to the radio stream starting. An option to disable this would be useful.  Thanks for the free app!",
        "I'm absolutely SICK TO DEATH with the continuous voice ads that disrupt every Radio station during every song. Pissing me off. Going to drop this app.",
        "I use it for Newstalk and 98FM.  In the past week, it has stopped working.  Such a shame cause it was one of my most used apps.  Hope it gets fixed soon"
    ],
    "recentChanges": [
        "Bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ie.radioplayer.android&hl=en&gl=us",
    "appId": "ie.radioplayer.android"
}