{
    "title": "Amazon India Online Shopping",
    "summary": "India’s Largest Online Store in your pocket – Shop from over 10 crore products!",
    "icon": "//lh5.ggpht.com/TpxeOgptQworHjromT4yoo05oHk72dSE0pVQowPfb3u3rozTwLjYUHxTpEzIYMemomQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.3,
    "reviews": 2584740,
    "developer": "Amazon Mobile LLC",
    "developerId": "Amazon+Mobile+LLC",
    "developerEmail": "feedback-amazon-app-android@amazon.com",
    "developerWebsite": "http://www.amazon.in/",
    "developerAddress": "Amazon Mobile LLC\n500 9th Avenue N,\nSeattle, WA 98109",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "size": "Varies with device",
    "description": "Amazon Online Shopping AppThe Amazon India Shopping App brings to you, over 10 Crore original products and at great prices. Shop on the Amazon App for the latest electronics – Redmi 4, Apple iPhone 7, Samsung J7, OnePlus 3T & many more, accessories & software for your gadgets - memory cards, earphones, chargers, power banks & anti-virus. Don’t just stop there, shop for your home needs and choose from selection across TVs, refrigerators, water purifiers, washing machines, sofa sets, mattresses, bean bags, wall stickers & cookware. Shop from Amazon Fashion for all occasions – Formal attire, vacation wear to casual and daily wear – shirts for men, sarees & gowns for women, watches and jewellery to match and shoes & footwear to boot. Also, the kids range of clothes, footwear, toys - from remote control cars, to bicycles, skateboards and school supplies –bags, bottles & more. Download the Amazon India Shopping App for free, from Google Play Store & enjoy online shopping like never before. Great Shopping ExperienceThe free online shopping app from Amazon assures you of a great shopping experience with a lighter app, faster load time & wide selection across categories. You can browse and search for your desired products by product name, category or brands. Enjoy the rich catalogue images - you can view the product from multiple angles, with options to zoom. Get personalised recommendations based on ratings & shopping trends. You can also share product links with your family & friends via email, SMS, WhatsApp, Facebook, Twitter, & more.With Amazon India, you are guaranteed 24x7 customer service support, faster delivery, easy returns, convenient payment options including cash on delivery as well as the 100% purchase protection offered by Amazon’s A-to-Z Guarantee.Enjoy Safe and Secure ShoppingShop using your Credit/Debit Card, EMI or Net Banking knowing that all transactions are securely processed. No need to worry about your personal or account details getting leaked, as Amazon.in provides you 100% purchase protection for safe payments & transactions. You could also pay cash on delivery for your orders.Track your OrdersShopping on the Amazon app offers you up to the minute updates on the status of your orders & you can choose to track it anytime through the ‘Your Orders’ menu option.Shopping is Fun on the Amazon.in AppOne of the best parts about shopping on the Amazon App are the exclusive App events. Get deals & discounts only on the app. App only games and quizzes games offer you the chance to win exciting prizes!Make the most of Amazon’s exclusive benefits - Become an Amazon Prime member & get guaranteed Free 1-Day, 2-Day or standard delivery on eligible items, 30 minute early access to top Lightning deals & watch the latest and exclusive movies and TV shows on Prime Video.Use Amazon Pay for Instant checkout for your purchases & hassle-free payments, balance tracking to monitor your spends & view your balance at any given time & faster refunds should you require it. Explore Amazon Exclusives for branded electronics, accessories, appliances, jewellery, fashion & more only available on Amazon. With Amazon Pantry get next day delivery of household items & groceries and save in the process. Now available in 25 cities in India.Amazon Global Store provides access to products sold by Amazon across the Globe. International brands & products from Fashion, Electronics, Home & Kitchen, Books & more at your fingertips.Amazon Launchpad makes available to you, unique & innovative products from today’s brightest startups.PermissionsIn order to offer you the best experience and operate properly, the Amazon Shopping App needs access to the following services:* Operating System Requirements: Requires Android OS 2.3 or higher.* Account: Account permissions are needed for integration with Facebook & other social media network you have connected to your device to allow you to share products with family & friends.",
    "descriptionHTML": "Amazon Online Shopping App<br><br>The Amazon India Shopping App brings to you, over 10 Crore original products and at great prices. Shop on the Amazon App for the latest electronics &#x2013; Redmi 4, Apple iPhone 7, Samsung J7, OnePlus 3T &amp; many more, accessories &amp; software for your gadgets - memory cards, earphones, chargers, power banks &amp; anti-virus. Don&#x2019;t just stop there, shop for your home needs and choose from selection across TVs, refrigerators, water purifiers, washing machines, sofa sets, mattresses, bean bags, wall stickers &amp; cookware. Shop from Amazon Fashion for all occasions &#x2013; Formal attire, vacation wear to casual and daily wear &#x2013; shirts for men, sarees &amp; gowns for women, watches and jewellery to match and shoes &amp; footwear to boot. Also, the kids range of clothes, footwear, toys - from remote control cars, to bicycles, skateboards and school supplies &#x2013;bags, bottles &amp; more. Download the Amazon India Shopping App for free, from Google Play Store &amp; enjoy online shopping like never before. <br><br>Great Shopping Experience<br><br>The free online shopping app from Amazon assures you of a great shopping experience with a lighter app, faster load time &amp; wide selection across categories. You can browse and search for your desired products by product name, category or brands. Enjoy the rich catalogue images - you can view the product from multiple angles, with options to zoom. Get personalised recommendations based on ratings &amp; shopping trends. You can also share product links with your family &amp; friends via email, SMS, WhatsApp, Facebook, Twitter, &amp; more.<br>With Amazon India, you are guaranteed 24x7 customer service support, faster delivery, easy returns, convenient payment options including cash on delivery as well as the 100% purchase protection offered by Amazon&#x2019;s A-to-Z Guarantee.<br><br>Enjoy Safe and Secure Shopping<br><br>Shop using your Credit/Debit Card, EMI or Net Banking knowing that all transactions are securely processed. No need to worry about your personal or account details getting leaked, as Amazon.in provides you 100% purchase protection for safe payments &amp; transactions. You could also pay cash on delivery for your orders.<br><br>Track your Orders<br><br>Shopping on the Amazon app offers you up to the minute updates on the status of your orders &amp; you can choose to track it anytime through the &#x2018;Your Orders&#x2019; menu option.<br><br>Shopping is Fun on the Amazon.in App<br><br>One of the best parts about shopping on the Amazon App are the exclusive App events. Get deals &amp; discounts only on the app. App only games and quizzes games offer you the chance to win exciting prizes!<br><br>Make the most of Amazon&#x2019;s exclusive benefits - <br><br>Become an Amazon Prime member &amp; get guaranteed Free 1-Day, 2-Day or standard delivery on eligible items, 30 minute early access to top Lightning deals &amp; watch the latest and exclusive movies and TV shows on Prime Video.<br><br>Use Amazon Pay for Instant checkout for your purchases &amp; hassle-free payments, balance tracking to monitor your spends &amp; view your balance at any given time &amp; faster refunds should you require it. <br><br>Explore Amazon Exclusives for branded electronics, accessories, appliances, jewellery, fashion &amp; more only available on Amazon. <br><br>With Amazon Pantry get next day delivery of household items &amp; groceries and save in the process. Now available in 25 cities in India.<br><br>Amazon Global Store provides access to products sold by Amazon across the Globe. International brands &amp; products from Fashion, Electronics, Home &amp; Kitchen, Books &amp; more at your fingertips.<br><br>Amazon Launchpad makes available to you, unique &amp; innovative products from today&#x2019;s brightest startups.<br><br>Permissions<br><br>In order to offer you the best experience and operate properly, the Amazon Shopping App needs access to the following services:<br>* Operating System Requirements: Requires Android OS 2.3 or higher.<br>* Account: Account permissions are needed for integration with Facebook &amp; other social media network you have connected to your device to allow you to share products with family &amp; friends.",
    "histogram": {
        "1": 176184,
        "2": 61568,
        "3": 178325,
        "4": 525734,
        "5": 1642929
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/4kax7Bk4Onu7AAofwBK8_nb1ekgGlzNa6mgQyS81cWAtZsr5D3LoRiWE_c8hhb-XhA=h310",
        "//lh3.googleusercontent.com/DPxL1XwP-Cmp_Okt4kjtqUIthsC5zEsBClzCKT8BKSNftPkG93wItxg6wi9RWz5dhb4=h310",
        "//lh3.googleusercontent.com/s7VB2id_qlOxuB01bCCIk2Fe590MYszJSeZSPHpZNikGyUexC8LfgOFQpveAwgfQ044=h310",
        "//lh3.googleusercontent.com/BfDai5IO4rHjUy5wrxQ8EQeYs1jdC6MghqKRPG5wALLFaezKJ1V5IpCVnBuG3NmqTE0P=h310",
        "//lh3.googleusercontent.com/RxKv3W0UNPzZDiGwxcNJJibj6MHk32SpPRNYp8iNqUgqMSnxUfB5tBXbyxeGRNb_rGM=h310",
        "//lh3.googleusercontent.com/YrkQue18mer6YYUvQ4yoR11lAXQF5J8E_Zz1u1S7OOmBO3tOiVvouUVd5jgLVas370U=h310",
        "//lh3.googleusercontent.com/o5x1tE5H034q0EDCvk7BUgBA-LLfWmUInrLyDCbG-qnJHuNZQPSJgtwOLKYhwsGMWuPJ=h310",
        "//lh3.googleusercontent.com/OrnSbQNbSNeablXIL_n9qDoGFm7oXKMSjtNIBJu4UERkggUMkIMwBYiZAUJcxJ4lwXo=h310"
    ],
    "video": "https://www.youtube.com/embed/35MpOxVi_C4",
    "comments": [
        "Happy to buy on Amazon but the message updated on deliver is not real time. The product was delivered yesterday mistakenly refused by my wife. Next day morning got any sms update it will be dilivered today after 30min again got an sms shipment going back to seller as it was refused. I was not knowing it was delivered & returning to as it was supposed to silver in 5th March & came on 3rd March but sms update came on 4th March that it will be delivered today.",
        "Till now, Great experience. Customer support is up to the mark. Hope it will continue. 2 stars deducted becoz of return policy for electronic items specially mobile. I have stopped buying high value electronic item.   Further, why don't you guys improve your app. User interface is really poor. Filter doesn't work properly.",
        "The payment gateway is horrible. When I am at the last page when juspay reads the OTP sent to my number, the app stops responding but money gets deducted from my account and the when I see me order page , it says payment failed. This has happened me me 4 times in a row. Please fix this as soon as possible. Called customer care to report this , but nothing has improved yet.",
        "Amazon has a very unique point in having the most PATHETIC and AWFULLY DISGUSTING SERVICE...I am literally tired of its terrible service... Just let me know how to get rid of your GRIP.... That is how to deactivate my account on Amazon... Besides.., I'm anyway going to uninstall your app",
        "Hangs on search screen. Whenever I try to search something it shows results but when you click on any product it just hangs and shows a white screen, I tried reinstalling several times but no avail also it sometimes start showing desktop version​ of Amazon website.  So its pretty much useless for me and I had to use mobile website of Amazon, btw I am using it on Motorola Z2 Play with Android 7.1.1 running.",
        "Worst service ever,  I have ordered a Seagate barracuda hard-disk, but I got delivered Seagate pipeline hard-disk which is a used dead one, I contacted the seller he replied go to return option in Amazon then return , but Amazon is showing that the order will reach you by 5th March which they delivered me on 27th February . The seller says go to return option in Amazon account and return the item so that they can refund me , but when I go to return option it shows this item cannot be returned,  I have 2 issues  1. Reflect in my Amazon account that the order has been delevired 2. Make sure that I can return the dead hard-disk and get refund."
    ],
    "recentChanges": [
        "Enjoy our latest update where we have fixed some bugs and improved our app to provide you a seamless shopping experience."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=in.amazon.mShop.android.shopping&hl=en&gl=us",
    "appId": "in.amazon.mShop.android.shopping"
}