{
    "title": "Audify Notifications Reader",
    "summary": "Drive safe and Distraction-free music with your smart notifications assistant.",
    "icon": "//lh3.googleusercontent.com/VVtZIba0soSO52OQFaB1Jb-Rm8lCkxoF_TRU66ml2fZitUUTodz5vv_Y1KbDPxDSO8E=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 3802,
    "developer": "AppKiddo",
    "developerId": "8443232511621177982",
    "developerEmail": "appkiddohelp@gmail.com",
    "developerWebsite": "https://twitter.com/audifyapp",
    "developerAddress": "8/4-13 A5, Sambu Nivas,\nKTVR Gardens,\nKolathur (po),\nMettur(tk), Salem(Dt),\nIndia - 636303",
    "updated": "November 19, 2017",
    "version": "2.85",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Appszoom says Audify is the \"21st century Speak & Read\" app.DRIVE SAFELYFocus on the road while you drive or ride and let Audify read your notifications as per you prefer. ENJOY MUSIC WITHOUT DISTRACTIONEnjoy your music like never before. Don't let the notifications spoil your joy of music. Audify can mute your notifications tone on demand and reads the notification.STAY CONNECTED WITH YOUR NOTIFICATIONSAudify helps you to be informed about your notifications without any effort. It speaks out your notifications through your phone speaker or headset or via any connected Bluetooth device and intelligently ignores the notifications that might annoy you.\"Audify however, it is much smarter than it appears at first glance\" - Androidworld.itACTIVATES AND DEACTIVATES AUTOMATICALLYOnce Audify is enabled, It starts to work automatically as soon as you connect a wired or wireless headset/speaker and stops itself as soon as you disconnect your headset/speaker.❤ Drive safely and let Audify take care of your notifications.❤ Enjoy music without getting anxious about annoying notifications. Ignore the unwanted and only act when you receive an important notification.❤ Cast your notifications on your big screen with google cast support.❤ Enable Audify OnSpeaker wherever you want and be informed about your notifications.❤ Tons of options to customise as you like.❤ Fully accessible via TalkBackKEY FEATURES ★ Mute annoying apps and enable only those apps you like.★ Add blacklisted words and mute any specific notification from any app.★ Enable/Disable Bluetooth device or wired headsets.★ Privacy mode to skip notification content.★ Automatically save your vehicle location and easily navigate with Audify.★ Intelligently avoids consecutive notifications from the same app to avoid an annoying burst of notifications from a specific app.★ Enable Audify on phone speaker.★ Supports Google cast (Chromecast devices)★ 250 free audifications. Buy Audify Premium once to get unlimited audifications forever across all your devices.*1 Audification = 1 notification that is spoken by AudifyGoogle Plus Community : https://goo.gl/pQeEtOOfficial Twitter Handle     : https://twitter.com/audifyappHistory of Audify : Part 1 - https://goo.gl/1WurzHPart 2  - https://goo.gl/VJfWqJ",
    "descriptionHTML": "Appszoom says Audify is the &quot;21st century Speak &amp; Read&quot; app.<br><br><b>DRIVE SAFELY</b><br><br>Focus on the road while you drive or ride and let Audify read your notifications as per you prefer. <br><br><b>ENJOY MUSIC WITHOUT DISTRACTION</b><br><br>Enjoy your music like never before. Don&apos;t let the notifications spoil your joy of music. Audify can mute your notifications tone on demand and reads the notification.<br><br><b>STAY CONNECTED WITH YOUR NOTIFICATIONS</b><br><br>Audify helps you to be informed about your notifications without any effort. It speaks out your notifications through your phone speaker or headset or via any connected Bluetooth device and intelligently ignores the notifications that might annoy you.<br><br>&quot;Audify however, it is much smarter than it appears at first glance&quot; - Androidworld.it<br><br><b>ACTIVATES AND DEACTIVATES AUTOMATICALLY</b><br><br>Once Audify is enabled, It starts to work automatically as soon as you connect a wired or wireless headset/speaker and stops itself as soon as you disconnect your headset/speaker.<br><br>&#x2764; Drive safely and let Audify take care of your notifications.<br>&#x2764; Enjoy music without getting anxious about annoying notifications. Ignore the unwanted and only act when you receive an important notification.<br>&#x2764; Cast your notifications on your big screen with google cast support.<br>&#x2764; Enable Audify OnSpeaker wherever you want and be informed about your notifications.<br>&#x2764; Tons of options to customise as you like.<br>&#x2764; Fully accessible via TalkBack<br><br><b>KEY FEATURES </b><br><br>&#x2605; Mute annoying apps and enable only those apps you like.<br>&#x2605; Add blacklisted words and mute any specific notification from any app.<br>&#x2605; Enable/Disable Bluetooth device or wired headsets.<br>&#x2605; Privacy mode to skip notification content.<br>&#x2605; Automatically save your vehicle location and easily navigate with Audify.<br>&#x2605; Intelligently avoids consecutive notifications from the same app to avoid an annoying burst of notifications from a specific app.<br>&#x2605; Enable Audify on phone speaker.<br>&#x2605; Supports Google cast (Chromecast devices)<br>&#x2605; 250 free audifications. Buy Audify Premium once to get unlimited audifications forever across all your devices.<br><br>*1 Audification = 1 notification that is spoken by Audify<br><br>Google Plus Community : https://goo.gl/pQeEtO<br>Official Twitter Handle     : https://twitter.com/audifyapp<br><br>History of Audify : <br>Part 1 - https://goo.gl/1WurzH<br>Part 2  - https://goo.gl/VJfWqJ",
    "histogram": {
        "1": 246,
        "2": 153,
        "3": 411,
        "4": 654,
        "5": 2338
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/EA2OYTom8GmjlxFgryYoeXNIg5CXd4PbNdiQinKOmCWgKUL_M2LM-l6JE6rZ4dUsDjIo=h310",
        "//lh3.googleusercontent.com/sJc5-ItP4jAwtrCa8ciwXtksFAKY4Qza3JO3NgyE7pMH3yY6gIshU6hESem3bIZhfQo=h310",
        "//lh3.googleusercontent.com/0RmlSVNWZAvL6aU0dIew28GulFjbGX8uISCAvy3zyGVE_pN4GLU3Azdr8einAoHWWCgc=h310",
        "//lh3.googleusercontent.com/gLZKwdt_Qf1XXef7aKA-pREg-5NT4xGCch9-8GmVBzvVd2eV-G2Cp9X4_ShgGde-GGA=h310",
        "//lh3.googleusercontent.com/zEkOFlDjKhf7lA9ehVdIbHxCoqGRpUZWPpJe2RxO61XhbAV0s4cydlTJFv6xT4tGIVg=h310",
        "//lh3.googleusercontent.com/_BJi1JcBDJNnfcc0CE5YZpxuFmNFbMoDpAj41ijVY9HeNlmK4RszBLQbMthy3yox7d9p=h310",
        "//lh3.googleusercontent.com/ib42qNFHuCap4R2U9l-dT3Wabmem-Aj_rfja6GcmyJy41F9rel-og1_Esi1PUWyIhk3d=h310",
        "//lh3.googleusercontent.com/vybPPCdU36_7Rc9q_B15m5SPJ0u_9jOV7v-Uj9twW6nIBotC86tupCJx8Fxpa5lR31s=h310",
        "//lh3.googleusercontent.com/CJtrPCtaNJspkQr9O831juxDOk72NFCTQPYW4pWPFmZWCgGdGimrbgr_6KipnbE2xmpE=h310",
        "//lh3.googleusercontent.com/EKdl2DtFaILvrymKbvuZZf4Skfizi9E3x1Rcd0SJdz_iP1U4QPe_7sT6XvNAqiCz8oKP=h310",
        "//lh3.googleusercontent.com/7G3vhtb8d3yBwcmaTvzVhD9NqyAcgT-2zUgm_zvD8furi6pU9u5ciEZcLziDoUp0TlPi=h310",
        "//lh3.googleusercontent.com/WnLAoj0cT7PKU3c97PUVWeZs3RnoY70kWiX_CMJy52ACisy1Xxu5flITSDeE1KQtx88=h310",
        "//lh3.googleusercontent.com/TKKsSGVpDNWtsx__hBfV2I2wLq9BHu-IUscTrVTMjtY57SLllh--ON1THSm3evRKoA=h310",
        "//lh3.googleusercontent.com/YBZp0MJP-p0_Ya145HZND0145JFCAO6iiDJyjLDJWpSo7pz3jTR74DH2nCQGxyloPdwE=h310",
        "//lh3.googleusercontent.com/vj7-0VvDLYLV0YD0i7jY2NKPSgvoM983T8SLUGL7PrOlI2Ab9BVR1cgeq46QGEDtDXE=h310",
        "//lh3.googleusercontent.com/NMJcrIwFBm_G3j54l5Juk3bdGvwApt8lXDr58bRh4SfQoL81VzvtDq59mdjUWrzngw=h310",
        "//lh3.googleusercontent.com/7mqQz2GuWdrcBrvhPbTkjvjY0IxgroStd65SQA_VDqzV_oocXAaRO7BnHRqMe2zCTe0=h310"
    ],
    "video": "https://www.youtube.com/embed/a-jEKelozro",
    "comments": [
        "The app is great, developers did a good job. But I have one missing feature to mention: p.e. in whatsapp I receive messages in different languages (English, Italian, Portuguese, Dutch) , and all of them are spoken with the default language (English),and it is pretty annoying. This language resiliency feature is present in one app in the play store (@Voice Aloud Reader) which speaks in the language of the webpage or whatever other content in the appropriate language and it would be a great feature if your app has it too. Is it in your plans to implement that in the future?",
        "Audify is the best of this type of app available. I use it constantly, it works perfectly.  I recently had an issue with my Bluetooth hearing aids not turning on quickly enough to relay short notifications. Even though it wasn't an Audify problem, the developers took the time to analyse what was happening and provided a solution.  Outstanding support!",
        "Still a 5... Starting a new year right. I never give 5 stars, but you made it. The one app I am truly happy using, & with great support. Thank you.",
        "SCAMWARE...   AUTHOR IS WORRYINGLY SILENT IN RESPONSE TO HIS USERS LEGITIMATE OBSERVATIONS.  BAD DEVELOPER.  YOU GET 250 FREE ANNOUNCEMENTS THEN IT'LL STOP WORKING AND DEMAND MONEY TO CONTINUE!  BAD APPLICATION.  PATHETIC SCAM... DON'T DOWNLOAD... A COMPLETE WASTE OF EVERYBODY'S TIME.",
        "One of my favourite essential Android apps. Would love it if there was a way to read out notifications on Google Home devices.",
        "Would love if this app had Tasker/automate plug-in support to allow more control"
    ],
    "recentChanges": [
        "Reduced app size by few mega bytes 💪",
        "Removed Accessibility permission and Auto OnSpeaker feature which relies on accessibility permission to comply with Google Playstore policy change 📝",
        "Read more: https://www.reddit.com/r/androiddev/comments/7clzr6/google_is_threatening_to_remove_apps_with/"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=in.codeseed.audify&hl=en&gl=us",
    "appId": "in.codeseed.audify"
}