{
    "title": "Unidogs App",
    "summary": "Application app dogs and pets. Pets geo localized social network.",
    "icon": "//lh3.ggpht.com/SIzxMJ74LraTpzF0Z1vSv_EW7E--bgL-Jt8Wjx2OXQ8-ZBJdt5ZlQ8A7TFFGx1x5KgYE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.3,
    "reviews": 51,
    "developer": "Unidogs Spain S.L.",
    "developerId": "Unidogs+Spain+S.L.",
    "developerEmail": "admin@unidogs.es",
    "developerWebsite": "http://unidogs.es/",
    "developerAddress": "C/ Manojo de Rosas 85, cuarto piso, letra B, 28041. MADRID. ESPAÑA.",
    "updated": "September 10, 2015",
    "version": "1.37",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Los dueños de perros y otras mascotas estamos de suerte. Nace Unidogs. Una App gratuita, que te informa de todo aquello que sucede en tu zona y puede ser interesante para ti  y para tu perro o cualquier animal de compañía. Si hay una mascota en tu familia, una empresa de productos o servicios para animales, o una entidad protectora, Unidogs es tu aplicación. Unidogs son 3 Apps en 1: Una red social para personas y sus perros, junto con el directorio de profesionales y servicios más grande y actualizado de España, y un sistema de información y notificaciones por radios de acción. Tu barrio, tu localidad… los servicios que te pillan más a mano.Como toda red social, puedes establecer comunicación con otros dueños de perros y mascotas, los mejores profesionales y protectoras. Dispones de más de 3.600 servicios registrados, entre veterinarios, tiendas, o adiestradores que te ofrecen las atenciones que necesita tu mascota, y el único directorio de protectoras en el mapa.  Un completo sistema de notificaciones, a través del cual crearás y recibirás:•\tnovedades (perros que  buscan novia, o cachorros que buscan hogar…), •\talertas importantes (mascota perdida, adopciones o posibles sustancias tóxicas y plagas….),•\teventos próximos a ti (quedadas, exposiciones o cursos de adiestramiento…). Además, Unidogs está definiendo diferentes actividades de carácter social, como programas de ayuda a las protectoras de animales, o cursos de adiestramiento para dueños de mascotas, cuya finalidad es en todo momento, mejorar la calidad de vida de las mascotas y sus familias. Unidogs plantea reducir el maltrato y el abandono mediante la educación y la cooperación.Unidogs está disponible para IOs y Android. Toda la información, contenidos y videos explicativos en unidogs.es",
    "descriptionHTML": "Los due&#xF1;os de perros y otras mascotas estamos de suerte. Nace Unidogs. Una App gratuita, que te informa de todo aquello que sucede en tu zona y puede ser interesante para ti  y para tu perro o cualquier animal de compa&#xF1;&#xED;a. <br>Si hay una mascota en tu familia, una empresa de productos o servicios para animales, o una entidad protectora, Unidogs es tu aplicaci&#xF3;n. <br><br>Unidogs son 3 Apps en 1: Una red social para personas y sus perros, junto con el directorio de profesionales y servicios m&#xE1;s grande y actualizado de Espa&#xF1;a, y un sistema de informaci&#xF3;n y notificaciones por radios de acci&#xF3;n. Tu barrio, tu localidad&#x2026; los servicios que te pillan m&#xE1;s a mano.<br><br>Como toda red social, puedes establecer comunicaci&#xF3;n con otros due&#xF1;os de perros y mascotas, los mejores profesionales y protectoras. Dispones de m&#xE1;s de 3.600 servicios registrados, entre veterinarios, tiendas, o adiestradores que te ofrecen las atenciones que necesita tu mascota, y el &#xFA;nico directorio de protectoras en el mapa.  Un completo sistema de notificaciones, a trav&#xE9;s del cual crear&#xE1;s y recibir&#xE1;s:<br>&#x2022;\tnovedades (perros que  buscan novia, o cachorros que buscan hogar&#x2026;), <br>&#x2022;\talertas importantes (mascota perdida, adopciones o posibles sustancias t&#xF3;xicas y plagas&#x2026;.),<br>&#x2022;\teventos pr&#xF3;ximos a ti (quedadas, exposiciones o cursos de adiestramiento&#x2026;). <br><br>Adem&#xE1;s, Unidogs est&#xE1; definiendo diferentes actividades de car&#xE1;cter social, como programas de ayuda a las protectoras de animales, o cursos de adiestramiento para due&#xF1;os de mascotas, cuya finalidad es en todo momento, mejorar la calidad de vida de las mascotas y sus familias. Unidogs plantea reducir el maltrato y el abandono mediante la educaci&#xF3;n y la cooperaci&#xF3;n.<br><br>Unidogs est&#xE1; disponible para IOs y Android. <br>Toda la informaci&#xF3;n, contenidos y videos explicativos en unidogs.es",
    "histogram": {
        "1": 6,
        "2": 3,
        "3": 1,
        "4": 1,
        "5": 40
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.ggpht.com/tFYEFOu2PIZYHYpgnYTm0ShRhrU4NrBDsO2fr21r1xiGLl045pqKLNGaG5-aRVYLUh3x=h310",
        "//lh5.ggpht.com/nGPfXEXouydgQXB5X7GSan3O4CK49nNpK6WGjQ8bmpthRMYzh0-64YJUO_Ei37-DeuA=h310",
        "//lh3.ggpht.com/UrzEyQ2leQ9IG_JEvWm2Q_3Tre2z3l33ppTgrJzam3PlCW-bEbzXp2qBuOjZdGs0r3Qg=h310",
        "//lh6.ggpht.com/8F9sk-ZPl6aJUhugPTMDLaK0akkGZOERgzGUizGRwU-JSLKhUZHEQnpvH4w1yeWcgC0=h310",
        "//lh5.ggpht.com/krZeNDm8YUqhOepdRGwbObe9auX0s6P8C0qop3lZpIX1nBzR_cIUDWE8GU8yvxTkXnM=h310",
        "//lh5.ggpht.com/RWUhKLQ1WVY8De2qz9Z7rEVfQWhkEpkHN8MPCzGcSzU6q1LGF_DnzND0nsDlfClYUU09=h310",
        "//lh3.ggpht.com/4Zeb2_L1sIu7UZt1t7JHT2M-ecUe8-g2pahEibpH43OQWOnasH6CVitdHqy7yPUqPbjp=h310",
        "//lh4.ggpht.com/NWloQ1huPsl0GN05qYu2CBS5UnZ2At4jcNaArCzvJgfyL_6gNkYX2xOdZ-3l8fHsTfs=h310",
        "//lh3.ggpht.com/bLC39pEdNlwUHwhCSXipur018KUZ7xa_QMlz9_TvGs7FqKapNONSqB-2JAqV1Mq45ks=h310",
        "//lh6.ggpht.com/kNQNYCJZdHiYJv4znZI2tNTbO9D79NilYsi7cWqgv3vRl4k_hkBIDxGj-0w7jGwWvdwR=h310",
        "//lh3.ggpht.com/8M9swspwy8_dYBxVFvyxE6kJD0zm1jYuUHvpqRVF6PBDl8FyiQbsgeTL_aABvAfFQQ=h310",
        "//lh6.ggpht.com/9QZPvLbqewkMonznvGzOmxUR_3L3T9hEWwjl9f7JEkaU-trL2HrIoQP7K_uZVD4ExYo=h310",
        "//lh4.ggpht.com/-1kB97l-7KxWLPeaTz84lZhovHy4yTUPouAfCNeDfCSnB43tUegbS4JNMYzm-ZeMnQ=h310"
    ],
    "video": "https://www.youtube.com/embed/_G5gpwnYjP4",
    "comments": [],
    "recentChanges": [
        "Corrección de errores en comentarios con emoticonos.",
        "Últimos cambios:",
        "- Mejoras de estabilidad y notificaciones.",
        "- Emoticonos en comentarios mejorados.",
        "- Comparte tus acciones en Facebook y Twitter: ¡queremos llegar a todos para ser efectivos!",
        "- *** App Wear incluida *** Si tienes un reloj compatible con Android Wear, estas de enhorabuena :) Puedes activar el \"Modo Paseo\" y recibir notificaciones en tiempo real.",
        "- Integrado Fabric Crashalytics"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=info.si2.android.unidogs.app&hl=en&gl=us",
    "appId": "info.si2.android.unidogs.app"
}