{
    "title": "Iowa By Trail",
    "summary": "Take full advantage of Iowa, the World Capital of Trails, with Iowa By Trail",
    "icon": "//lh3.ggpht.com/npLTKOtLXbZBB15HWGN7lmP42tR_EjgPH48fDc7D-JJDQL642mCx0w77JNGYFUGZ1g=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.6,
    "reviews": 36,
    "developer": "Shift Interactive, LLC",
    "developerId": "Shift+Interactive,+LLC",
    "developerEmail": "wagner@interactiveshift.com",
    "developerWebsite": "http://www.iowabytrail.com",
    "updated": "January 25, 2017",
    "version": "2.3.1",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "description": "Get outdoors, and connect with nature on Iowa’s trails with Iowa By Trail. With over 1,800 miles of trails to explore, the app allows you to take full advantage of what makes Iowa the World Capital of Trails. Discover hidden gems and points of interest along familiar trails, or find new trails to explore with the app’s interactive map. Learn local natural and historical stories and facts throughout the map. Find trailheads, water restrooms and restaurants along with parks and other recreation opportunities. Go find your adventure today. With the Iowa By Trail App, you can:• Explore the 800 miles of trail Central Iowa offers and come July the 1,800 miles of trails state wide• Easily track any kind of trip• View your progress along the trail on an interactive map• Keep track of your favorite trail routes through the map my journey feature • Share your outdoor adventures through email, Facebook and Twitter• Customize your settings to optimize your tracking experience• Access satellite and Street View™ views of trails and surrounding areas• Learn about the natural wildlife areas and interesting history of different locations around the state• Find parks, picnic areas, sports facilities and amenities• Get news and alerts about the trails from Iowa Natural Heritage Foundation• Track your speed and mileage while you exploreIowa Natural Heritage Foundation is a statewide private nonprofit that protects and restores Iowa’s land, water and wildlife. We do this by connecting people to nature and protecting private and public lands across the state. For more information about Iowa Natural Heritage Foundation, please visit INHF.org.",
    "descriptionHTML": "Get outdoors, and connect with nature on Iowa&#x2019;s trails with Iowa By Trail. With over 1,800 miles of trails to explore, the app allows you to take full advantage of what makes Iowa the World Capital of Trails. Discover hidden gems and points of interest along familiar trails, or find new trails to explore with the app&#x2019;s interactive map. Learn local natural and historical stories and facts throughout the map. Find trailheads, water restrooms and restaurants along with parks and other recreation opportunities. Go find your adventure today. <br><br>With the Iowa By Trail App, you can:<br><br>&#x2022; Explore the 800 miles of trail Central Iowa offers and come July the 1,800 miles of trails state wide<br><br>&#x2022; Easily track any kind of trip<br><br>&#x2022; View your progress along the trail on an interactive map<br><br>&#x2022; Keep track of your favorite trail routes through the map my journey feature <br><br>&#x2022; Share your outdoor adventures through email, Facebook and Twitter<br><br>&#x2022; Customize your settings to optimize your tracking experience<br><br>&#x2022; Access satellite and Street View&#x2122; views of trails and surrounding areas<br><br>&#x2022; Learn about the natural wildlife areas and interesting history of different locations around the state<br><br>&#x2022; Find parks, picnic areas, sports facilities and amenities<br><br>&#x2022; Get news and alerts about the trails from Iowa Natural Heritage Foundation<br><br>&#x2022; Track your speed and mileage while you explore<br><br>Iowa Natural Heritage Foundation is a statewide private nonprofit that protects and restores Iowa&#x2019;s land, water and wildlife. We do this by connecting people to nature and protecting private and public lands across the state. For more information about Iowa Natural Heritage Foundation, please visit INHF.org.",
    "histogram": {
        "1": 7,
        "2": 3,
        "3": 3,
        "4": 9,
        "5": 14
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/t2vjpYplAnuz0UwC3pzRdv_DLZIqdlt-fQloQkStRNwQn-SEa0yWdtG3_cH3Xn7dmlM=h310",
        "//lh4.ggpht.com/vWmFx89ZouP4EF25BPPrNJAasKo46gaZNXsIL2oBY-0da4rZEXD1Pys5WI7RRDKF2Ss=h310",
        "//lh6.ggpht.com/KGYH7qNr-_bPEzYWcrBIIDQIZfyVee-iY5mlcM0e8FkdZ0bNw1-loj2px2P6SKQJQCY=h310",
        "//lh5.ggpht.com/uDRKg2VFrc-_W_VGGTnHEstqQoBKEyOR89L52Q3cd6SV_MdRpZsYba9R9VtX8JHP2XGg=h310",
        "//lh4.ggpht.com/xG1cZo7Qsrd7AkxJSfKbVm3wtpJuTd0OMPekj2DMjFXucs_w0MHweWD6Pzv5vbdg2lst=h310"
    ],
    "comments": [
        "Maps need updated.  The Raccoon River Trail is a loop. I know because I ride it.",
        "The trail in my town is missing.",
        "Won't run on S5 sucks",
        "Won't run properly my husband has this app on his iPhone and it works great, so I tried to install it on my android, and everytime I try to view anything it takes me back to the homepage and won't let me do anything else. what am I doing wrong?!",
        "Works great on iPhone but still worthless for android",
        "Need to have updates on trail conditions There hasn't been any new news for a year"
    ],
    "recentChanges": [
        "updated for Android 7"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=interactiveshift.com.trailswear&hl=en&gl=us",
    "appId": "interactiveshift.com.trailswear"
}