{
    "title": "Liana - Connecting Expats",
    "summary": "Meet people who speak your language anywhere in the world.",
    "icon": "//lh6.ggpht.com/_915ScmYmsIXcekq0XkN5BYivrRCDnciupPmVOjKf0_w84P5IHeoM2vr7ciAeSOBAPk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.3,
    "reviews": 206,
    "developer": "EMG",
    "developerId": "EMG",
    "developerEmail": "info@appliana.com",
    "developerWebsite": "http://appliana.com/",
    "updated": "March 22, 2016",
    "version": "1.4.3",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "Liana - connecting expats or your fellow countrymen while abroadAre you a globetrotter? Do you like to travel? Do you have a home away from home? If yes, while on the road, would you like to meet people just like you? Expats or travelled like you who speak your mother tongue? Try Liana to have more fulfilled, comfortable and happier international travels. - Connect with locals when abroad or travelers when home- Any City in the World- Discover & Share, Chat, Meet, PartyMeet Liana - the only app you will need while being abroad - it is the new geo-targeted app based on your nationality or languages you speak. Explore the world in a way you have never before. Liana will make your travels easier and more enjoyable. With Liana, you can connect, meet, chat or even gain new friendships with people from your country who live in foreign countries. You will experience different cultures in entirely new way! Isn't that insanely good? Isn't that what travelling is about?Easy to use, fun, life changing and exciting. Try it now!",
    "descriptionHTML": "Liana - connecting expats or your fellow countrymen while abroad<br><br><br>Are you a globetrotter? Do you like to travel? Do you have a home away from home? If yes, while on the road, would you like to meet people just like you? Expats or travelled like you who speak your mother tongue? Try Liana to have more fulfilled, comfortable and happier international travels. <br><br><br>- Connect with locals when abroad or travelers when home<br>- Any City in the World<br>- Discover &amp; Share, Chat, Meet, Party<br><br><br>Meet Liana - the only app you will need while being abroad - it is the new geo-targeted app based on your nationality or languages you speak. Explore the world in a way you have never before. <br><br><br>Liana will make your travels easier and more enjoyable. With Liana, you can connect, meet, chat or even gain new friendships with people from your country who live in foreign countries. You will experience different cultures in entirely new way! Isn&apos;t that insanely good? Isn&apos;t that what travelling is about?<br><br>Easy to use, fun, life changing and exciting. Try it now!",
    "histogram": {
        "1": 16,
        "2": 10,
        "3": 6,
        "4": 32,
        "5": 142
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.ggpht.com/AuUuTvf08iluR1DumprPJaeOyMb-2G08IxVK63lrrwc8sokiGajCrTUmoSiCTR8asw=h310",
        "//lh5.ggpht.com/BvGLI-_H5xfcfP5iuSZNrVRHPSTT1IuwrGazFFGDq70y2yp92WWzIxBvxhzZZ8XyNAk=h310",
        "//lh4.ggpht.com/2W81QyaVgKwL3UCvIZ-7NX5QgPinUolBwVXL2UDWORu0fbcMgrkC4Tr11_IDFJZ4hWR3=h310",
        "//lh3.ggpht.com/GmLVWe2k7RTmZJyWX0PhXMFKNSF4tXzeFjhaOjIO3-eYT1CjUGmdAm8ZQkvo_Xyit6I=h310"
    ],
    "comments": [
        "Could not sign in via Facebook and could not sign up. Keeps saying that email is in use. Seems like an email collector",
        "Is very good ....l Love  Pakistan I like it is very nice my country Pakistan haven to much user thank you Liana company",
        "Like Bbz",
        "Great!",
        "Great app! Easy to use, works really well.",
        "Great and helpful app !!!"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=io.honig.liana&hl=en&gl=us",
    "appId": "io.honig.liana"
}