{
    "title": "Quantus Tasks",
    "summary": "Sync OmniFocus to your Android device",
    "icon": "//lh6.ggpht.com/DL_zBv2lRRJM4QK6Lu-NYF_KKUO-7ckY8GrTz3RKuVNgvQWM_xZiepNphuxNj467_Sk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3,
    "reviews": 197,
    "developer": "Quantus Software",
    "developerId": "Quantus+Software",
    "developerEmail": "steven@quantus.io",
    "developerWebsite": "http://quantustasks.com",
    "developerAddress": "Stationsstraat 120\n3150 Haacht\nBelgium",
    "updated": "November 18, 2015",
    "version": "0.1.31",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Quantus Tasks is GTD app that syncs OmniFocus to your Android device. (Requires an OmniFocus account)# Get Things Done : Add actions to your inbox or immediately assign a project and context.# Never forget a task : The forecast view shows you at a glance which actions are due soon. Separate project and context views are also available. # Background syncing : Quantus Tasks works together with OmniFocus on your Mac, iPhone or iPad. Changes you make inside Quantus Tasks become visible inside OmniFocus and vice versa.# Notifications: Receive notifications when your tasks are due (or x minutes before they become due)We're working hard on adding new features every few weeks. The goal is to become feature-equivalent to the official iOS OmniFocus app. If you buy the app now you are making a very useful contribution to the app by providing us with the necessary funds to continue development.## Features we are working on in the coming weeks ##- Better Project/Context creation- Better notes/attachment support- Google Now/Android Wear integration- Location reminders- More fine-grained date picking for due/defer dates- Quick entry widgetDisclaimer: OmniFocus is a trademark of the Omni Group. Quantus Tasks is in no way affiliated with the Omni Group. Any support requests regarding this app should go to steven@quantus.io",
    "descriptionHTML": "Quantus Tasks is GTD app that syncs OmniFocus to your Android device. (Requires an OmniFocus account)<br><br><br># Get Things Done : Add actions to your inbox or immediately assign a project and context.<br><br># Never forget a task : The forecast view shows you at a glance which actions are due soon. Separate project and context views are also available. <br><br># Background syncing : Quantus Tasks works together with OmniFocus on your Mac, iPhone or iPad. Changes you make inside Quantus Tasks become visible inside OmniFocus and vice versa.<br><br># Notifications: Receive notifications when your tasks are due (or x minutes before they become due)<br><br><br>We&apos;re working hard on adding new features every few weeks. The goal is to become feature-equivalent to the official iOS OmniFocus app. If you buy the app now you are making a very useful contribution to the app by providing us with the necessary funds to continue development.<br><br><br>## Features we are working on in the coming weeks ##<br><br>- Better Project/Context creation<br>- Better notes/attachment support<br>- Google Now/Android Wear integration<br>- Location reminders<br>- More fine-grained date picking for due/defer dates<br>- Quick entry widget<br><br><br>Disclaimer: OmniFocus is a trademark of the Omni Group. Quantus Tasks is in no way affiliated with the Omni Group. Any support requests regarding this app should go to steven@quantus.io",
    "histogram": {
        "1": 48,
        "2": 29,
        "3": 32,
        "4": 45,
        "5": 43
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/6mrvln5znmCrDFZuY8xm23t6G8pdXmHTWcV-xIO92Q_zxh_CJG4C8GsPXVZpTDcqs0_j=h310",
        "//lh4.ggpht.com/-MTeZ4aBBi7N3TJrlcMi6AgZvq60SesPW2NjkeDmS13elq5TmmmcUzHXNgsHGQFf34OA=h310",
        "//lh4.ggpht.com/g5YhKYJ6fE7hUX9hJwt4t5rVUb94EhFpO93bVb1tkilW5ZjG6I0S-tciqaegd4HKUHCW=h310",
        "//lh3.ggpht.com/Hx4owohqvZoxh96GCIE-_RieWf0BA2PLcN3w1NxVnYSANrdld8EjUnqtD0PoiwtXpnU=h310",
        "//lh6.ggpht.com/RK7kzkjyqnXcIdSTJuYVNIbJFMB06dx96DDcE5kikq11rvIclshP44WQxsg27SYlpqbx=h310",
        "//lh6.ggpht.com/kblBcrmy09VMpmEEB5Q02tLtA_kv8ZON-A7POu0DUbhCte9OUtC4zar8FlEVru_xSQ=h310",
        "//lh4.ggpht.com/OfgbSC9qCLMeFl5B-qEaTE_22OxdXfMyJEno24vTi7-ul0BikWV2pYZYToxg3DkmyA=h310"
    ],
    "comments": [
        "Very pretty… not so useful I tried this app after FocusGTD that does the same kind of thing for a lower price. This app looks much better, but lacks basic functionality, and has terrible problems: IT DELETES ALL NOTES AND REPEATED TASKS!",
        "REPEATING TASKS GETS WIPED OUT Update:  Also Sub Actions do not appear...  Update:  It's been 2 months without any updates....  Update:  There has been some updates, will change from at least it warns about repeating tasks...1 star to 2 star...please implement access to notes too. Update: looks like he abandoned this app",
        "Pros:  The developer Steve is very accessible and helped me out when I had some trouble setting it up.   No major syncing issues helping me stay OmniFocused when away from my computer.   Cons: Still has more features it needs to add. Missing the ability to set custom due dates and custom repeating options. Also I would really love there to be a calendar view option.    10/ 24/ 2016 UPDATED:   Now Steve won't respond to emails. It completely won't work and he won't get back to me so it's wasted money. DON'T BUY.",
        "I've been a dedicated Omnifocus user for years now, and recently jumped the iOS ship. Steven got back to me very quickly about my questions and suggestions - which is quite impressive! As a new application, it needs some work (which he is obviously doing!) but is still quite usable - I think it is fair to say that this is an investment in a good app that has the promise of being a great app. As long as we don't have to pay another $12.99 for the next version, it is money well spent! Update: This app kept promising but never came through. The developer promised to make all sorts of improvements and its still barely functional with basic things like repeating tasks. I'm so tired of this app I never use it anymore.",
        "Great Client missing a couple things I think this is the best omnifocus client for android. However, it seems like it was never finished. The main feature I would like to see fixed is the ability to check off repeating tasks, which is strangly lacking :(",
        "Stuck in setup loop After login into my Omnisync account I get the synchronising screen which completes the process but when I click 'finish setup' it goes back to synchronising. I can't get passed this and even see my tasks."
    ],
    "recentChanges": [
        "- Fix issue where the Inbox view would show the wrong set of tasks."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=io.quantus.apps.androidfocus&hl=en&gl=us",
    "appId": "io.quantus.apps.androidfocus"
}