{
    "title": "Mtalk: landline in your pocket",
    "summary": "Add a landline number, call &amp; text abroad for free or low rates, HD audio",
    "icon": "//lh6.ggpht.com/Mbjn6p7xOZ9lz3n5gRTG8_gtQKZr9i0yujNGnDmMBJl3jYP6_HQ4ZoeELf08ZhsT2bY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.6,
    "reviews": 6552,
    "developer": "Messagenet",
    "developerId": "Messagenet",
    "developerEmail": "support@messagenet.it",
    "developerWebsite": "http://www.mtalk.net",
    "updated": "October 31, 2017",
    "version": "1.40",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "With Mtalk you can add a phone number that follows you also abroad.Call at low rates worldwide, great audio quality.Unlimited free talk & text other Mtalk users. Create a personal web page to let your contacts call and text you for free.ADD A DOMESTIC OR INTERNATIONAL NUMBER TO YOUR SMARTPHONE: With Mtalk, you can add telephone numbers to your smartphone from any of 18 countries. Say goodbye to cellular roaming charges when abroad or simply enjoy the added flexibility of having more than one number on your device for personal or business use.USE MTALK TO REACH OUT TO ANYONE WORLDWIDE AT VERY LOW RATES: save on calls to traditional phone numbers with no compromise on audio quality, even in 3G. When calling international, enjoy rates usually much cheaper compared to cellular rates. When you are abroad, you may call your home country using Wi-Fi and save a lot vs. major mobile carriers. Our rates at http://www.messagenet.com/voip/tariffe/UNLIMITED TALK AND TEXT WITH OTHER USERS: Registered Mtalk users can text and talk with each other for free with HD audio.WHAT ELSE DOES MTALK OFFER YOU?FREE VOICEMAIL: When you miss a call, Mtalk will deliver a voice message to your mailbox. Just click and listen.WORKS WHEN OTHER SERVICES DON'T: Mtalk is able to bypass the VoIP blocking efforts made by mobile service providers in some countries by making use of proprietary technologies.RECEIVE CALLS ON REGULAR PHONES: Because Mtalk’s service relies on open standards, users can also choose to forward calls to any standard SIP, softphone or PBX equipment – an option that is perfect for businesses.BLUETOOTH AND EARPHONES: Mtalk supports most Bluetooth and wired earphones.ANDROID INTEGRATION: app integration with native telephony and messaging. Take into account user prefs for ringtones, messages notifications, vibrate. Take advantage of device audio processing features, if available, to reduce battery usage and increase efficiency.TALKBACK: Mtalk supports talkback for the visually impairedWE VALUE YOUR PRIVACY: Any transmission of your contact lists is fully encrypted, and the information is used only to identify the friends you can call for free. Data will never be provided to any third party. All Mtalk users are protected by European data protection regulations.Please, note: network data charges may apply.App validation via SMS is available only with mobile numbers belonging to one of the countries where the app is distributed. App validation via email is available everywhere.",
    "descriptionHTML": "With Mtalk you can add a phone number that follows you also abroad.<br>Call at low rates worldwide, great audio quality.<br>Unlimited free talk &amp; text other Mtalk users. Create a personal web page to let your contacts call and text you for free.<br><br>ADD A DOMESTIC OR INTERNATIONAL NUMBER TO YOUR SMARTPHONE: With Mtalk, you can add telephone numbers to your smartphone from any of 18 countries. Say goodbye to cellular roaming charges when abroad or simply enjoy the added flexibility of having more than one number on your device for personal or business use.<br><br>USE MTALK TO REACH OUT TO ANYONE WORLDWIDE AT VERY LOW RATES: save on calls to traditional phone numbers with no compromise on audio quality, even in 3G. When calling international, enjoy rates usually much cheaper compared to cellular rates. When you are abroad, you may call your home country using Wi-Fi and save a lot vs. major mobile carriers. Our rates at http://www.messagenet.com/voip/tariffe/<br><br>UNLIMITED TALK AND TEXT WITH OTHER USERS: Registered Mtalk users can text and talk with each other for free with HD audio.<br><br>WHAT ELSE DOES MTALK OFFER YOU?<br><br>FREE VOICEMAIL: When you miss a call, Mtalk will deliver a voice message to your mailbox. Just click and listen.<br><br>WORKS WHEN OTHER SERVICES DON&apos;T: Mtalk is able to bypass the VoIP blocking efforts made by mobile service providers in some countries by making use of proprietary technologies.<br><br>RECEIVE CALLS ON REGULAR PHONES: Because Mtalk&#x2019;s service relies on open standards, users can also choose to forward calls to any standard SIP, softphone or PBX equipment &#x2013; an option that is perfect for businesses.<br><br>BLUETOOTH AND EARPHONES: Mtalk supports most Bluetooth and wired earphones.<br><br>ANDROID INTEGRATION: app integration with native telephony and messaging. Take into account user prefs for ringtones, messages notifications, vibrate. Take advantage of device audio processing features, if available, to reduce battery usage and increase efficiency.<br><br>TALKBACK: Mtalk supports talkback for the visually impaired<br><br>WE VALUE YOUR PRIVACY: Any transmission of your contact lists is fully encrypted, and the information is used only to identify the friends you can call for free. Data will never be provided to any third party. All Mtalk users are protected by European data protection regulations.<br><br>Please, note: network data charges may apply.<br>App validation via SMS is available only with mobile numbers belonging to one of the countries where the app is distributed. App validation via email is available everywhere.",
    "histogram": {
        "1": 160,
        "2": 88,
        "3": 228,
        "4": 1191,
        "5": 4885
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/sL0Uy24zlwFZ--aR3qvD4uHnuiHEI_JAmpV1eqCykRlibFRUJ_v4zn7d20TXdVYDD54=h310",
        "//lh6.ggpht.com/JR_AdCCg0SmHSNM_BME63LezHe5OZICysyi2e6YcaUdD4Xak0TeJxgEvywhcPRh25A=h310",
        "//lh3.ggpht.com/UD2rMl7b1pAChdYT9il4AGfsLwN4ATOUTyHDg-vIiycv63empbsxtiDI-TEloocN1g=h310"
    ],
    "comments": [
        "Even when abroad, no matter where I am, I get to keep in touch with my family and friends thanks to this app. I even made my closest friends in different countries download and install it and we keep in touch easily, as clearly as if we were both using a landline phone. I even got a VoIP adapter to make the use of the Messagenet's free number even easier. My parents couldn't be happier. It's as easy as using a landline phone. We've been using this app and its services since at least 2013. We're still using it today. Thank you Messagenet! Really great app!",
        "Can't make it work. It's not just jumping through hoops. Needs an IT GENIUS to work out which hoops to jump through.",
        "The app is fine, the service is fine. Small compatibility problems with some ip phone.",
        "The best VoIP experience on the store!",
        "Can't do anything with this app",
        "Does its job"
    ],
    "recentChanges": [
        "• Optimizations for Android 8",
        "• Fixed an issue about incoming call notification actions on some Android Wear devices",
        "• Fixed an issue about vibration persistence on system notifications during a Mtalk call",
        "• Bug fixing and improved stability and security"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=it.messagenet.mtalk&hl=en&gl=us",
    "appId": "it.messagenet.mtalk"
}