{
    "title": "JEFIT Workout Tracker, Weight Lifting, Gym Planner",
    "summary": "#1 Exercise Routine App, Home Personal Trainer, Bodybuilding Strength Program",
    "icon": "//lh3.googleusercontent.com/IYJTsQRsGBELbLHqR7LdM2bz8IddmgKDxZTxk0RSP4Bazsxw1zZyO2mxrUtRLztCdAU=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.5,
    "reviews": 57305,
    "developer": "Jefit Inc.",
    "developerId": "8399102968121737189",
    "developerEmail": "support@jefit.com",
    "developerWebsite": "https://www.jefit.com",
    "developerAddress": "830 Stewart Dr. Ste 105\nSunnyvale, CA 94085\nUSA",
    "updated": "February 6, 2018",
    "version": "9.97",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "★ Google Play Editor's Choice ★ Men’s Fitness - Best Fitness and Health Apps ★ USA Today - New year, new youOver 8 million people use JEFIT to track their workouts and transform their bodies.The only exercise tracker with detailed workout programs, HD video exercise instructions and tools to log and track your workouts. On your Android device or on your desktop, use JEFIT to track your training at home or at the gym and throw away your notebook.JEFIT, the number one workout tracking planner app, provides free fitness program database to help you stay fit, make progress and get the most out of your gym or home fitness sessions. From beginner programs like 5x5, 531, stronglifts, 3 or 4 day splits, starting strength to advanced bodybuilding, weightlifting, powerlifting or kettlebell routines to programs using bodyweight, limited space or specialized equipment, JEFIT is the only workout app you need.Who is this app for?If you’ve logged your workouts in a journal, planner or just love training at the gym on your own schedule, JEFIT will help you reach your strength, weight and fat loss, and training goals from beginners to advanced lifters. We’ve made the app to motivate you by rewarding you for consistency, pushing yourself to new personal records and committing to challenges with the community. Top Features● Web or App - Track with the app and edit routines on our web app.● Track Workouts - Set your exercises, track weights and reps and we’ll show you the results of your training● Exercise Instruction Database - Over 1300+ demonstrations and variations with HD video from experts● Intuitive Tools - Rest Timer, Supersets, Interval Timers, Body Measurements Log, Notes, Schedule Planner, Notes● Training Programs - Customized workout programs made for 3, 4 or 5 day splits, fat loss, stronglifts, 5x5, starting strength, bodybuilding, 531, weightlifting, powerlifting, GZCLP, Greyskull, or build your own● Stay Motivated - Join our monthly fitness challenge with cash prizes and get support from other gym goers in the community. Also add your gym buddies to compare routines and lifts so you can reach your goal of improving strength, getting lean, toned or just staying active● Set Goals - Want to lose weight, get lean, get stronger or exercise consistently? You can build that in JEFIT’s custom journal● Add Friends - Find new fitness buddies in our community. Whether it’s someone to spot you at the gym or to compare bodybuilding tips.Programs for any fitness level with full instruction database✔ Beginner Programs - Stronglifts, 5x5, Starting Strength, 3 day splits✔ Advanced Programs - Powerlifting, bodybuilding, 531, GZCLP, Greyskull✔ Target Programs - Abs, Arms, Glutes, Fat and Weight Loss, Toning✔ Personal Training - Get routines built by your personal trainer✔ Sports Training - Baseball, Space✔ Equipment Focused - Squat Racks, Barbells, Kettlebells, Dumbbells✔ Bodyweight or Minimal Equipment - Bands, Mats, Machine Only, Core Focused✔ Kettlebells, Cardio, Circuit Training, Space Limited Routines* Or build your own custom workout routines or schedulesSpecial tools and features✔ Access from Desktop and Web✔ Rest Timer - Set custom times to remind when to lift✔ Supersets and circuit training routines supported✔ Interval Timer, Set Notes and 1 Rep Max Calculator✔ Body Measurements and Weekly Planner for Scheduling✔ Social Feed and Community Contest✔ Store Workouts in the Cloud and share with your personal trainer1,300 exercises supported with full HD videos in our database✔ Barbell, Dumbbell, Machines, Cable, Band✔ Cardio, Elliptical, Rowing, Bike, Swimming✔ Static Movements, Planks, Stretching, Abs✔ Bodyweight, Kettlebell, Core✔ Create custom exercisesBenchmarking, analysis and instructions✔ Personalized charts for lifting volume✔ Benchmark against other users or gym buddy✔ Weekly summaries of progress✔ Personalized Record PR tracking",
    "descriptionHTML": "&#x2605; Google Play Editor&apos;s Choice &#x2605; Men&#x2019;s Fitness - Best Fitness and Health Apps &#x2605; USA Today - New year, new you<br><br><b>Over 8 million people use JEFIT to track their workouts and transform their bodies.</b><br><br>The only exercise tracker with detailed workout programs, HD video exercise instructions and tools to log and track your workouts. On your Android device or on your desktop, use JEFIT to track your training at home or at the gym and throw away your notebook.<br><br>JEFIT, the number one workout tracking planner app, provides free fitness program database to help you stay fit, make progress and get the most out of your gym or home fitness sessions. From beginner programs like 5x5, 531, stronglifts, 3 or 4 day splits, starting strength to advanced bodybuilding, weightlifting, powerlifting or kettlebell routines to programs using bodyweight, limited space or specialized equipment, JEFIT is the only workout app you need.<br><br><b>Who is this app for?</b><br>If you&#x2019;ve logged your workouts in a journal, planner or just love training at the gym on your own schedule, JEFIT will help you reach your strength, weight and fat loss, and training goals from beginners to advanced lifters. We&#x2019;ve made the app to motivate you by rewarding you for consistency, pushing yourself to new personal records and committing to challenges with the community. <br><br><b>Top Features</b><br>&#x25CF; Web or App - Track with the app and edit routines on our web app.<br>&#x25CF; Track Workouts - Set your exercises, track weights and reps and we&#x2019;ll show you the results of your training<br>&#x25CF; Exercise Instruction Database - Over 1300+ demonstrations and variations with HD video from experts<br>&#x25CF; Intuitive Tools - Rest Timer, Supersets, Interval Timers, Body Measurements Log, Notes, Schedule Planner, Notes<br>&#x25CF; Training Programs - Customized workout programs made for 3, 4 or 5 day splits, fat loss, stronglifts, 5x5, starting strength, bodybuilding, 531, weightlifting, powerlifting, GZCLP, Greyskull, or build your own<br>&#x25CF; Stay Motivated - Join our monthly fitness challenge with cash prizes and get support from other gym goers in the community. Also add your gym buddies to compare routines and lifts so you can reach your goal of improving strength, getting lean, toned or just staying active<br>&#x25CF; Set Goals - Want to lose weight, get lean, get stronger or exercise consistently? You can build that in JEFIT&#x2019;s custom journal<br>&#x25CF; Add Friends - Find new fitness buddies in our community. Whether it&#x2019;s someone to spot you at the gym or to compare bodybuilding tips.<br><br><b>Programs for any fitness level with full instruction database</b><br>&#x2714; Beginner Programs - Stronglifts, 5x5, Starting Strength, 3 day splits<br>&#x2714; Advanced Programs - Powerlifting, bodybuilding, 531, GZCLP, Greyskull<br>&#x2714; Target Programs - Abs, Arms, Glutes, Fat and Weight Loss, Toning<br>&#x2714; Personal Training - Get routines built by your personal trainer<br>&#x2714; Sports Training - Baseball, Space<br>&#x2714; Equipment Focused - Squat Racks, Barbells, Kettlebells, Dumbbells<br>&#x2714; Bodyweight or Minimal Equipment - Bands, Mats, Machine Only, Core Focused<br>&#x2714; Kettlebells, Cardio, Circuit Training, Space Limited Routines<br>* Or build your own custom workout routines or schedules<br><br><b>Special tools and features</b><br>&#x2714; Access from Desktop and Web<br>&#x2714; Rest Timer - Set custom times to remind when to lift<br>&#x2714; Supersets and circuit training routines supported<br>&#x2714; Interval Timer, Set Notes and 1 Rep Max Calculator<br>&#x2714; Body Measurements and Weekly Planner for Scheduling<br>&#x2714; Social Feed and Community Contest<br>&#x2714; Store Workouts in the Cloud and share with your personal trainer<br><br><b>1,300 exercises supported with full HD videos in our database</b><br>&#x2714; Barbell, Dumbbell, Machines, Cable, Band<br>&#x2714; Cardio, Elliptical, Rowing, Bike, Swimming<br>&#x2714; Static Movements, Planks, Stretching, Abs<br>&#x2714; Bodyweight, Kettlebell, Core<br>&#x2714; Create custom exercises<br><br><b>Benchmarking, analysis and instructions</b><br>&#x2714; Personalized charts for lifting volume<br>&#x2714; Benchmark against other users or gym buddy<br>&#x2714; Weekly summaries of progress<br>&#x2714; Personalized Record PR tracking",
    "histogram": {
        "1": 1628,
        "2": 1008,
        "3": 2915,
        "4": 12173,
        "5": 39581
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/EEpqGQz2cW9N1VMKx4txJrKck5LjhWH_O085HipAdg0h6HcOL0mpdfXvuWGIQJMccLw=h310",
        "//lh3.googleusercontent.com/SZBM_BRQhy_EGzog3poNXYzVsuKQSvparJSKZkEaNqyaI2vXiq5OlqfR1L7G2F2Gag=h310",
        "//lh3.googleusercontent.com/6T0ZnWzhy79rYMWQDRGYbL1u6GB-adf16EMg9PDs0Ycvv-aBkBzSnmh0MmmuBG6tQQQ=h310",
        "//lh3.googleusercontent.com/naGE7S87ePWhCeYQxYl2i2DRiupkosfW86gmF6vbksjeOY-s9-nmvnz_784LMYjS-x0=h310",
        "//lh3.googleusercontent.com/P-TnXuCQKEylxSKyNJFgCxxFsy0pCqWFVi737lYHVgvnOgUKNAysmLHbO3StGFaGbg=h310",
        "//lh3.googleusercontent.com/YP52drzCfi42DK22r6QfqqV3pMKreoMX9PFK1SPVH_12cmsHTVDMP5avBTh-RoYwSQ=h310",
        "//lh3.googleusercontent.com/8Juz2rsbbOEHkwIG6BjAkV-YeAcOU1uEtdhrKswJ-1Y5MQGjbZLf4FIFu4C0MaAMzfb_=h310",
        "//lh3.googleusercontent.com/SAMLjWoWTRpk1pLfc5nvpAe1IUbsUs5nlkrAFFIrKJYo49RNsGWMwXA9aV73ZB9AXZY=h310"
    ],
    "video": "https://www.youtube.com/embed/RdghPMvT_zY",
    "comments": [
        "I've used it for years,  it's phenomenal.  No b.s. push notifications. Try it for a month if you can't find routines or build your own isn't working hit the uninstall.  Music apps play in the background and don't affect timer chimes.  Examples of movement, tap to adjust weight and reps on the fly.",
        "Would be much better if you didn't have to stop your yoga routine to hit  a button to record that pose. Or timed exercises where you have to stop hit the button just to record that 30 or 60 sec movement.... Didnt fix the issue till have to stop to push a button will stay with my other BETTER workout app",
        "Why does a fitness app need to access my contacts? In response to the developers reply:  When I deny the app permission to my contacts, installation will not continue. Why can't I opt out when asked for access to my contacts?",
        "Hey guys, great great app! One bug is a bit annoying: when you share a session without reception, the share is lost and you can't re-share after. Can you please make it so that you can re-share the session or so that the app keeps the session in memory to share later? Thanks!",
        "One of the greatest apps to ever be made. Absolutly step by step you can't find a better app. Great on saving time and money! App shows you diagrams on how to perform each exercise. Alot of time and effort went I to this app and it's all for free which is the best part! Amazing!",
        "Brilliant, came here from another app as converted from aerobic exercises to bulking weights and really enjoy the experience so far. Only criticism is maybe containing alternate exercises in workouts? This is due to long queues often forming for machines in many gyms thus breaking the workout up into rests that are too long. Other than that, outstanding."
    ],
    "recentChanges": [
        "New Feature - Introduced a new Elite feature - Smart Exercise Swap",
        "Fixed - Database crash during upgrading.",
        "Minor bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=je.fit&hl=en&gl=us",
    "appId": "je.fit"
}