{
    "title": "SimpleToDoManager",
    "summary": "ToDoManager is an app that lets you manage and set notes to GoogleWearWatches.",
    "icon": "//lh6.ggpht.com/pRtv_SIm1EPZWQYAKbfA8qRzCH1GA7n1iR2_xW9QpuXOhepWBbKd0gR3eMJV7UXlGk8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 4,
    "reviews": 2,
    "developer": "株式会社ポケットアイデア",
    "developerId": "%E6%A0%AA%E5%BC%8F%E4%BC%9A%E7%A4%BE%E3%83%9D%E3%82%B1%E3%83%83%E3%83%88%E3%82%A2%E3%82%A4%E3%83%87%E3%82%A2",
    "developerEmail": "supporta1@pocket-idea.jp",
    "developerWebsite": "http://pocket-idea.jp/",
    "developerAddress": "CASA AIOI B402, 2-22-6, TSUKUDA, CHUO-KU, TOKYO JAPAN",
    "updated": "September 10, 2014",
    "version": "1.0.2",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Simple ToDo Manager is an app that lets you manage and set notes to Google Wear Watches easily.ToDo lists can act as reminders, plans for the day, shopping lists, or whatever you need.Do you check your phone or tablet whenever you’re out, to go over your notes for the day? Using Simple ToDo Manager, you can check all of these from your Google Wear Watch, without ever taking out your phone or tablet. ToDo lists can be saved, so you don’t have to enter the same thing again for daily, routine work or ingredients for recipes.=====Usage Tips=====1. Shopping ListsSince your recipes are saved after you input the ingredients once, next time just send to your watch to avoid forgetting anything. Also, since each ingredient is saved to the watch as a separate ToDo list, you can delete items as you put them into your cart. 2. Reminders of Important EventsIf you display that one thing you can’t afford to forget about on your watch, you’ll remember it whenever you check the time. 3. What You Enter Once Gets SavedToDo lists you enter are saved, and can be re-used. You can manage more than one list, so keep any that you think you might use again. For example, the errands you need to take care of every weekend, ingredients sorted by recipe, or your various workout routines can repeat this way.=====ToDo List Management Tips=====Saved ToDo lists are managed as files. They can be backed up or given to others for use through file explorer.",
    "descriptionHTML": "Simple ToDo Manager is an app that lets you manage and set notes to Google Wear Watches easily.<br>ToDo lists can act as reminders, plans for the day, shopping lists, or whatever you need.<br><br>Do you check your phone or tablet whenever you&#x2019;re out, to go over your notes for the day? Using Simple ToDo Manager, you can check all of these from your Google Wear Watch, without ever taking out your phone or tablet. <br>ToDo lists can be saved, so you don&#x2019;t have to enter the same thing again for daily, routine work or ingredients for recipes.<br><br>=====Usage Tips=====<br>1. Shopping Lists<br>Since your recipes are saved after you input the ingredients once, next time just send to your watch to avoid forgetting anything. Also, since each ingredient is saved to the watch as a separate ToDo list, you can delete items as you put them into your cart. <br>2. Reminders of Important Events<br>If you display that one thing you can&#x2019;t afford to forget about on your watch, you&#x2019;ll remember it whenever you check the time. <br>3. What You Enter Once Gets Saved<br>ToDo lists you enter are saved, and can be re-used. You can manage more than one list, so keep any that you think you might use again. For example, the errands you need to take care of every weekend, ingredients sorted by recipe, or your various workout routines can repeat this way.<br><br>=====ToDo List Management Tips=====<br>Saved ToDo lists are managed as files. They can be backed up or given to others for use through file explorer.",
    "histogram": {
        "1": 0,
        "2": 0,
        "3": 1,
        "4": 0,
        "5": 1
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/Q9cIbRw_hfg5yB82VSS27YxOY4obL8vUKaAfq87a-r5ZV6OVaPcZctZE-BUae5IAexFm=h310",
        "//lh3.ggpht.com/-NsRtLdJLdc45PD300C0l9wyCJjIIgE3a92nN9Bn9R_0rdlrhZxnPMX6Coot_PGCUQ=h310",
        "//lh5.ggpht.com/1bxzZmi9khQQs5IbVDK8G_uB0_u3s4jiuY2m24sAn82GFOvfkEp_qVV9MZfCJu77F5A=h310",
        "//lh4.ggpht.com/dfALCre5_pKXIHRW3Y3NLYAoGDFOCgYzwcMMJptIrexbuDi-iq9LqiMglAA9VcUVGdYU=h310",
        "//lh3.ggpht.com/s3RLZOkSKXVBFMxBdJAqPoq5BdMqZqvnMsiAo6toRwS8yjXClH8f-uXBOxY7uJ-54cs=h310",
        "//lh6.ggpht.com/OpFsOyiye8R__uyTMFzC_HEo7t_-NhvYerzViAnPABmScXAOK2mxDWZp1CEz3nVyTw=h310",
        "//lh5.ggpht.com/QrBJywDESlAQn9ZJFknrd9ucV5u2BnPbUi1p_ooXnbUwVjmZFP5Tx4N-vIjv6zt9bA=h310",
        "//lh3.ggpht.com/GyyKgkHZe0uN55mX3tC57lN0q4i92Q8bItiFQ71nggI2Ozrj9IiyCU8cP2gYV2nbkSw=h310",
        "//lh5.ggpht.com/MzbslFiWRXk3-LddjNTFcuK4DBNrxwm96qYe6jhKonpV7bJ3WxD1OT1uG6R2YJdxbQ=h310"
    ],
    "comments": [],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=jp.pocketidea.android.wearable.todomanager&hl=en&gl=us",
    "appId": "jp.pocketidea.android.wearable.todomanager"
}