{
    "title": "Kik",
    "summary": "Connect with all your friends",
    "icon": "//lh3.googleusercontent.com/XPCe5NnyoQwqNBWQRMVbd32j-9wJ2SrqWhEibZWW-7Ke5T7awXfQ9mouC4wj5HgkoSY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.3,
    "reviews": 2444035,
    "developer": "Kik Interactive",
    "developerId": "Kik+Interactive",
    "developerEmail": "support@kik.com",
    "developerWebsite": "http://kik.com",
    "developerAddress": "420 Weber Street North\nSuite I\nWaterloo, Ontario\nN2L 4E7\nCanada",
    "updated": "February 14, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Get connected. Kik is way more than just messaging. It’s the easiest way to connect with your friends, stay in the loop, and explore – all through chat. No phone numbers, just pick a username.• Choose who to chat with one-on-one and in groups• Share pics, videos, gifs, games, and more• Meet new friends with similar interestsGet on Kik now. Start chatting!",
    "descriptionHTML": "Get connected. <br><br>Kik is way more than just messaging. It&#x2019;s the easiest way to connect with your friends, stay in the loop, and explore &#x2013; all through chat. No phone numbers, just pick a username.<br><br>&#x2022; Choose who to chat with one-on-one and in groups<br>&#x2022; Share pics, videos, gifs, games, and more<br>&#x2022; Meet new friends with similar interests<br><br>Get on Kik now. Start chatting!",
    "histogram": {
        "1": 180298,
        "2": 86608,
        "3": 205141,
        "4": 352759,
        "5": 1619229
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/-7uwv32jvbK7Q0lrbyooxJlwt3MoKg8dKTn_tNuu4lKl0N4Hd7wQAj_or5znHFE5jA=h310",
        "//lh3.googleusercontent.com/chDPOIkfqUl3l9CDK9tRHC0m35BwgbBNsT56qs9vCDqSliLxINVW76TS-c1J9p5a8t0=h310",
        "//lh3.googleusercontent.com/84uLBKcaqi5OKjy9AaFOkfbAw7znqhQKsjStUWR8bjBxpA74cInZGlalSLotPKC7FLy_=h310",
        "//lh3.googleusercontent.com/AsCOO6fs2_sQyJBnhiuEAOiLujYVJY46Zqe1x1-HXIpVFPtVHlIbB4iC_8BI_KokXNU=h310",
        "//lh3.googleusercontent.com/1ZCYmYdQA7BD75Lv3Glp6lPt-5b5vQrNhjmAIDeYDWt1W7PSUGuF5_eciuHOkqcO38U=h310",
        "//lh3.googleusercontent.com/dLFP-bZuIGczeh4d0GSGumddFWFNkG6pkT2Te_mmwvqZbPOW-olcmdM1NhOlG4hQnA=h310"
    ],
    "comments": [
        "It used to be an amazing app! I don't have service for my phone, so I use kik to contact people. Ever since the update though, it keeps crashing every time I try to use the camera. It even started to do this with other apps as well after I updated it. I wanted to see if it was just my camera that was buggy, so I deleted kik to test it out. My camera was back to normal on other apps after that. I redownloaded it and it started to act up again. Please try to fix this, it's important to be able to contact others incase something happens, I can't do that if it keeps crashing. Thank you!",
        "They banned me perminantly, no reason, no warning... no way to contact my friends, and no email responses.  They never tell you what you did wrong, even if you ask them.  I only ever violated their rules once, and that was a long time ago, I read every single rule at that point so it would never happen again, yet I still somehow get banned.",
        "Something in the app was not working properly so I logged out to fix it and I lost all my messages... I was talking with 30+ people and the messages were very important, now they are just lost forever.. I wasn't warned that they would be deleted by logging out too, I'm really mad. Aside from that, the app has a lot of other small bugs too. Fix yo problems.",
        "I preferred the old Kik tbh. I know I'm not the only one. Kik used to be my favourite app back in the day. I especially loved the mini features where I could swipe through and meet random people. I downloaded it and had it for about 20 minutes and it's just boring and dead. Please bring back the old Kik, it was so fun back then",
        "I rated it 4 star Because i REALLY like it and useful for me but the reason I didn't give 5 star Because if I log out then all the conversation get delete and  fake like those NASTY people will text you and send inpropripate stuff. It's doesn't happen always but sometimes. It's important to create a good username so they won't find you. They really should fix the conversation issue. Thanks!",
        "The send and receive is slow as hell right now not only that the replay take a while to be received. it wasnt like this last week. it's not my internet i know i checked tvisvusing my data also same slow as hell. also Ur permissions shouldnt  be allowed to change my settings without my go ahead at all if people dont turn off the phone and location in ur app permissions settings it clearly states it can use ur gps to track you and also  read my contacts. those i turn off . but the other permissions you cant"
    ],
    "recentChanges": [
        "Kik has a brand new look! It's more fun and easy to use, so you can spend less time hunting for photos and GIFs and more time chatting with friends.",
        "• Quickly find friends, start groups and discover bots with the \"+\" menu",
        "• It's easier to send your favorite photos, GIFs, stickers and smileys - they're under the text field for easy access",
        "• When you have a lot to say and send several messages in a row, chat bubbles will group together",
        "• Looking for faded D? We made the S, D and R colors darker!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=kik.android&hl=en&gl=us",
    "appId": "kik.android"
}