{
    "title": "QR Droid Code Scanner",
    "summary": "QR Droid™ - a full-featured, multi-language QR utility now compatible with Wear!",
    "icon": "https://lh6.ggpht.com/sRD-KnIiknzGuUITit7pvoav79AIDjkO0l54aol9Qm8ayWeq-bEmPemTQF-IzuHY-Bs=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000000,
    "maxInstalls": 100000000,
    "score": 4.1,
    "reviews": 348742,
    "developer": "DroidLa",
    "developerId": "DroidLa",
    "developerEmail": "info@droid.la",
    "developerWebsite": "http://qrdroid.com/",
    "developerAddress": "Clinch’s House\nLord Street P\nDouglas\nIsle of Man\nIM99 1RZ",
    "updated": "October 25, 2016",
    "version": "6.8",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Change your smartphone into a powerful QR Code, Barcode, and Data Matrix scanning utility. Import, create, use, and share data in a matter of taps.  This intuitive, full-featured and multi-language QR utility will change the way you interact with QR Codes and their smart actions and activities. Get the app PCWorld and Android Magazine awarded 5 out of 5 Stars. QR Droid allows you to digitally share just about anything. COST-FREE and AD-FREE.THE LATEST VERSION’S FEATURES INCLUDE:- A tap on the Menu button acts as a Home button to bring you to the top of the menu tree. - Intuitive, more aesthetically pleasing UI- Easily scan and create QR Code, or even edit one you've just scanned- Auto-sync your data on your own Google Drive account- Sort and group your history to help you quickly access your most-used QR Codes. - Amazon Store location bug fixed to ensure relevant store will appear wherever you are.  ALL FEATURESQR Droid is true to its roots: a first class scanner. All the features you would expect to have, and more, are right here!- Create a code from a contact or bookmark and let a friend scan it to their device – no typing needed!- Map where you are and where you're going to, share it with friends, colleagues and family.- Scan a QR Code in a magazine and watch a video immediately.- Scan QR Codes from your camera, browser, SD card, or saved image.- Create and share QR Codes in less than a second from maps, contacts, bookmarks, installed apps & more- 'Inbox' and 'Feedback' options. Receive important updates & give feedback directly to QR Droid’s support team using the in-app messaging system.- Create XQR Codes for massive ‘Plain Text’ and ‘Contact’ QR Codes.- USSD codes are never opened automatically, preventing remote wipe attacks of your device.- Add QR Droid Widgets free to help you get the most from QR Droid. Install a widget on your Android homepage to take you directly into the specific part of the app you use most: create business cards, history, bookmarks and others. Download QR Droid Widgets at http://0.qr.ai or use the pre-installed widgets in the QR Droid app.- Zap a QR Code to gain access to private WiFi networks.PERMISSIONS  & USABILITYDesigned with security as a top priority, the best QR utility on the market offers a simple interface with abundant functionality  This functionality for improved usability requires access to certain permissions in your device. ***** View the detailed permissions: http://qrdroid.com/adhoc/permissions.htm.***** View how to Scan & Create QR Codes & Barcodes: http://qrdroid.com/adhoc/how_scan_create.htm.SOCIAL- Like us on Facebook: https://www.facebook.com/qrdroid.- Follow us on Twitter: https://twitter.com/QrDroid.- Visit http://www.qrdroid.com for more info and our blog.DISCLAIMERS- 'QR Code' is a registered trademark of Denso Wave Incorporated.- QR Codes ARE NOT recommended for use with confidential/secret information.- QR Droid™ uses ZXing library. Apache License 2.0.Direct download installable QR Droid™ APK here: http://qrdroid.com/apk/QrDroid6.8.apk* If your device doesn't have Google Services you can try this version instead:http://qc.qr.ai",
    "descriptionHTML": "Change your smartphone into a powerful QR Code, Barcode, and Data Matrix scanning utility. Import, create, use, and share data in a matter of taps.  <br><br>This intuitive, full-featured and multi-language QR utility will change the way you interact with QR Codes and their smart actions and activities. <br><br>Get the app PCWorld and Android Magazine awarded 5 out of 5 Stars. QR Droid allows you to digitally share just about anything. COST-FREE and AD-FREE.<br><br>THE LATEST VERSION&#x2019;S FEATURES INCLUDE:<br><br>- A tap on the Menu button acts as a Home button to bring you to the top of the menu tree. <br>- Intuitive, more aesthetically pleasing UI<br>- Easily scan and create QR Code, or even edit one you&apos;ve just scanned<br>- Auto-sync your data on your own Google Drive account<br>- Sort and group your history to help you quickly access your most-used QR Codes. <br>- Amazon Store location bug fixed to ensure relevant store will appear wherever you are.  <br><br>ALL FEATURES<br><br>QR Droid is true to its roots: a first class scanner. All the features you would expect to have, and more, are right here!<br><br>- Create a code from a contact or bookmark and let a friend scan it to their device &#x2013; no typing needed!<br>- Map where you are and where you&apos;re going to, share it with friends, colleagues and family.<br>- Scan a QR Code in a magazine and watch a video immediately.<br>- Scan QR Codes from your camera, browser, SD card, or saved image.<br>- Create and share QR Codes in less than a second from maps, contacts, bookmarks, installed apps &amp; more<br>- &apos;Inbox&apos; and &apos;Feedback&apos; options. Receive important updates &amp; give feedback directly to QR Droid&#x2019;s support team using the in-app messaging system.<br>- Create XQR Codes for massive &#x2018;Plain Text&#x2019; and &#x2018;Contact&#x2019; QR Codes.<br>- USSD codes are never opened automatically, preventing remote wipe attacks of your device.<br>- Add QR Droid Widgets free to help you get the most from QR Droid. Install a widget on your Android homepage to take you directly into the specific part of the app you use most: create business cards, history, bookmarks and others. Download QR Droid Widgets at http://0.qr.ai or use the pre-installed widgets in the QR Droid app.<br>- Zap a QR Code to gain access to private WiFi networks.<br><br>PERMISSIONS  &amp; USABILITY<br><br>Designed with security as a top priority, the best QR utility on the market offers a simple interface with abundant functionality  This functionality for improved usability requires access to certain permissions in your device. <br><br>***** View the detailed permissions: http://qrdroid.com/adhoc/permissions.htm.<br><br>***** View how to Scan &amp; Create QR Codes &amp; Barcodes: http://qrdroid.com/adhoc/how_scan_create.htm.<br><br>SOCIAL<br><br>- Like us on Facebook: https://www.facebook.com/qrdroid.<br>- Follow us on Twitter: https://twitter.com/QrDroid.<br>- Visit http://www.qrdroid.com for more info and our blog.<br><br>DISCLAIMERS<br><br>- &apos;QR Code&apos; is a registered trademark of Denso Wave Incorporated.<br>- QR Codes ARE NOT recommended for use with confidential/secret information.<br>- QR Droid&#x2122; uses ZXing library. Apache License 2.0.<br><br>Direct download installable QR Droid&#x2122; APK here: http://qrdroid.com/apk/QrDroid6.8.apk<br><br>* If your device doesn&apos;t have Google Services you can try this version instead:<br>http://qc.qr.ai",
    "histogram": {
        "1": 28712,
        "2": 15052,
        "3": 34621,
        "4": 70266,
        "5": 200091
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.0 and up",
    "androidVersion": "2.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/SqbAFJD4PGRn1aXN_qBjUPTUz0D_UvTm6Cl56ke3_EsGTyD7MYGYp_t7nT2OwK_-vXQ=h310",
        "//lh4.ggpht.com/h6VrtmkiKUVp_MUAes1zaIQnByfMYdaVi5hagZkW9EQZEo5MQ0Dbwco--suMt4XqJt15=h310",
        "//lh4.ggpht.com/iG0qSseAPf1ktC4v4dAQhcBPh2-bgYgGrSnbZsFqBQmeqxrbMhIJg3hDJm0BKs6Qngs=h310",
        "//lh5.ggpht.com/kBBsa8NeAvCii91wWCexcQL0HwTqkQQni9pXbCcQU-etCPR6J6i4va136KrthGaX3g=h310",
        "//lh4.ggpht.com/cii36xhBrMrqlmNxClipauPlOO6M2mqKXtyFRYuaCvwyw4HeXad8TuhLIsPWT8JE9wg2=h310"
    ],
    "comments": [
        "Good in Theory I liked the design. I liked the cool features it boasted about in the description. I liked how well-rated it was and how positive the reviews were. I most definitely did NOT like trying to scan the SAME EXACT CODE forever. Either it would prompt me to put the code in view of the camera (while it's taking up most of the screen), or tell me to let the phone focus (while in focus) to then turn completely blurry, focus in and out, then finally be crystal-clear, and ask for the code to be put in view again. Ugh.",
        "This is probably the fastest QR Code Reader. It is also ad-free. You can even make QR code. It's really feature rich. However, there are two things I didn't like about it. I couldn't figure out how to get the exact plain text encoded in the QR for types other than plain text (ex: vCard). It would also be great if it could directly connect to Wi-Fi without a separate plugin.",
        "We have a winner! I put this head-to-head with i-nigma, and QR Droid with the zxing engine consistently performed best. Both are fine with qrcodes, but i-nigma just couldn't compete on straight barcodes. I only found one blue-tinted bar that both i-nigma and zxing couldn't read, but switching to the zapper engine worked. I also like that QR Droid tells you what kind of code you just scanned. The only dislike I have is that the interface is rather unprofessional, esp. the comic font. Otherwise this is definitely the best.",
        "I think im doing something wrong. If i want to make a bitcoin link it has to start with bitcoin:(addr) but when i try it changes the source in bitcoin:/(addr). But the rest is just a plain simple app whitch i adore, the nerd style,plain functional, plus i love how good the code behind is.",
        "Used to have this installed, then forgot to install on a new phone... WHY did I not remember this APP? I've been using inferior APPS for too long. This has only improved over the years! So easy, so intuitive, so aqesome!",
        "Spent over an hour trying to scan 3 Barcode. Still can't scan the last one.  Seems like camera can't stay in focus for more then a few seconds on this.  Don't know why but it's very frustrating.  Have even printed the Barcode and it still is not scanning."
    ],
    "recentChanges": [
        "v6.8",
        "- Improved synchronization. Get your new items on all your devices in nearly real-time.",
        "- Bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=la.droid.qr&hl=en&gl=us",
    "appId": "la.droid.qr"
}