{
    "title": "QR Droid Private™",
    "summary": "The best QR code app does not ask access to &quot;Your Personal Information&quot;!",
    "icon": "https://lh6.ggpht.com/coO_HIq-3Xz8JwS9iisWdOwFZeL9T5PZRPATfSKXUw3vRUJojm9CxTryKqZQuj6Trg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4.2,
    "reviews": 41058,
    "developer": "DroidLa",
    "developerId": "DroidLa",
    "developerEmail": "info@droid.la",
    "developerWebsite": "http://QrDroid.com/private",
    "developerAddress": "Clinch’s House\nLord Street P\nDouglas\nIsle of Man\nIM99 1RZ",
    "updated": "October 25, 2016",
    "version": "6.8",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "QR Droid™ Private requires fewer permissions than QR Droid™. The later uses more permissions to allow you to create codes using information from your device without typing anything. Your data is safe with both QR Droid™ Private and QR Droid™.Change your smartphone into a powerful QR Code, Barcode, and Data Matrix scanning utility. Import, create, use, and share data in a matter of taps.  This intuitive, full-featured and multi-language QR utility will change the way you interact with QR Codes and their smart actions and activities. Get the app PCWorld and Android Magazine awarded 5 out of 5 Stars. QR Droid allows you to digitally share just about anything. COST-FREE and AD-FREE.THE LATEST VERSION’S FEATURES INCLUDE:- A tap on the Menu button acts as a Home button to bring you to the top of the menu tree. - Intuitive, more aesthetically pleasing UI- Easily scan and create QR Code, or even edit one you've just scanned- Auto-sync your data on your own Google Drive account- Sort and group your history to help you quickly access your most-used QR Codes. - Amazon Store location bug fixed to ensure relevant store will appear wherever you are.  ALL FEATURESQR Droid is true to its roots: a first class scanner. All the features you would expect to have, and more, are right here!- Create a code from a contact or bookmark and let a friend scan it to their device – no typing needed!- Map where you are and where you're going to, share it with friends, colleagues and family.- Scan a QR Code in a magazine and watch a video immediately.- Scan QR Codes from your camera, browser, SD card, or saved image.- Create and share QR Codes in less than a second from maps, contacts, bookmarks, installed apps & more- 'Inbox' and 'Feedback' options. Receive important updates & give feedback directly to QR Droid’s support team using the in-app messaging system.- Create XQR Codes for massive ‘Plain Text’ and ‘Contact’ QR Codes.- USSD codes are never opened automatically, preventing remote wipe attacks of your device.- Add QR Droid Widgets free to help you get the most from QR Droid. Install a widget on your Android homepage to take you directly into the specific part of the app you use most: create business cards, history, bookmarks and others. Download QR Droid Widgets at http://0.qr.ai or use the pre-installed widgets in the QR Droid app.- Zap a QR Code to gain access to private WiFi networks.PERMISSIONS  & USABILITYDesigned with security as a top priority, the best QR utility on the market offers a simple interface with abundant functionality  This functionality for improved usability requires access to certain permissions in your device. ***** View the detailed permissions: http://qrdroid.com/adhoc/permissions.htm.***** View how to Scan & Create QR Codes & Barcodes: http://qrdroid.com/adhoc/how_scan_create.htm.SOCIAL- Like us on Facebook: https://www.facebook.com/qrdroid.- Follow us on Twitter: https://twitter.com/QrDroid.- Visit http://www.qrdroid.com for more info and our blog.DISCLAIMERS- 'QR Code' is a registered trademark of Denso Wave Incorporated.- QR Codes ARE NOT recommended for use with confidential/secret information.- QR Droid™ uses ZXing library. Apache License 2.0.- Direct download installable QR Droid™ Private APK here: http://qrdroid.com/apk/QrdPrivate6.8.apk",
    "descriptionHTML": "QR Droid&#x2122; Private requires fewer permissions than QR Droid&#x2122;. The later uses more permissions to allow you to create codes using information from your device without typing anything. Your data is safe with both QR Droid&#x2122; Private and QR Droid&#x2122;.<br><br>Change your smartphone into a powerful QR Code, Barcode, and Data Matrix scanning utility. Import, create, use, and share data in a matter of taps.  <br><br>This intuitive, full-featured and multi-language QR utility will change the way you interact with QR Codes and their smart actions and activities. <br><br>Get the app PCWorld and Android Magazine awarded 5 out of 5 Stars. QR Droid allows you to digitally share just about anything. COST-FREE and AD-FREE.<br><br>THE LATEST VERSION&#x2019;S FEATURES INCLUDE:<br><br>- A tap on the Menu button acts as a Home button to bring you to the top of the menu tree. <br>- Intuitive, more aesthetically pleasing UI<br>- Easily scan and create QR Code, or even edit one you&apos;ve just scanned<br>- Auto-sync your data on your own Google Drive account<br>- Sort and group your history to help you quickly access your most-used QR Codes. <br>- Amazon Store location bug fixed to ensure relevant store will appear wherever you are.  <br><br>ALL FEATURES<br><br>QR Droid is true to its roots: a first class scanner. All the features you would expect to have, and more, are right here!<br><br>- Create a code from a contact or bookmark and let a friend scan it to their device &#x2013; no typing needed!<br>- Map where you are and where you&apos;re going to, share it with friends, colleagues and family.<br>- Scan a QR Code in a magazine and watch a video immediately.<br>- Scan QR Codes from your camera, browser, SD card, or saved image.<br>- Create and share QR Codes in less than a second from maps, contacts, bookmarks, installed apps &amp; more<br>- &apos;Inbox&apos; and &apos;Feedback&apos; options. Receive important updates &amp; give feedback directly to QR Droid&#x2019;s support team using the in-app messaging system.<br>- Create XQR Codes for massive &#x2018;Plain Text&#x2019; and &#x2018;Contact&#x2019; QR Codes.<br>- USSD codes are never opened automatically, preventing remote wipe attacks of your device.<br>- Add QR Droid Widgets free to help you get the most from QR Droid. Install a widget on your Android homepage to take you directly into the specific part of the app you use most: create business cards, history, bookmarks and others. Download QR Droid Widgets at http://0.qr.ai or use the pre-installed widgets in the QR Droid app.<br>- Zap a QR Code to gain access to private WiFi networks.<br><br>PERMISSIONS  &amp; USABILITY<br><br>Designed with security as a top priority, the best QR utility on the market offers a simple interface with abundant functionality  This functionality for improved usability requires access to certain permissions in your device. <br><br>***** View the detailed permissions: http://qrdroid.com/adhoc/permissions.htm.<br><br>***** View how to Scan &amp; Create QR Codes &amp; Barcodes: http://qrdroid.com/adhoc/how_scan_create.htm.<br><br>SOCIAL<br><br>- Like us on Facebook: https://www.facebook.com/qrdroid.<br>- Follow us on Twitter: https://twitter.com/QrDroid.<br>- Visit http://www.qrdroid.com for more info and our blog.<br>DISCLAIMERS<br><br>- &apos;QR Code&apos; is a registered trademark of Denso Wave Incorporated.<br>- QR Codes ARE NOT recommended for use with confidential/secret information.<br>- QR Droid&#x2122; uses ZXing library. Apache License 2.0.<br>- Direct download installable QR Droid&#x2122; Private APK here: http://qrdroid.com/apk/QrdPrivate6.8.apk",
    "histogram": {
        "1": 3204,
        "2": 1651,
        "3": 3776,
        "4": 8796,
        "5": 23631
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.0 and up",
    "androidVersion": "2.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ejXrLE0NAfEVIeBKIII6s6ouJ5foOcZcjbnwEUu2aw8nnlVXO5XjKcum2Yo3FuI79Qk=h310",
        "//lh3.googleusercontent.com/s2UXGLea1k8iWaPLWOvDZEEmvC-IbZ0h36QnE8TJ8FaMtQT7BNNkZoGKTaKIMWyhpw=h310",
        "//lh3.googleusercontent.com/Sy3veDQisSAk5Dkuu307TWMXoNvX8BOD2iavk7gcHrpkpEmDy7CeqOL_3gvEccv91Q=h310",
        "//lh3.googleusercontent.com/NL6GBNygvFA-fF5ktEh1EIpZ7VlM9R-qIJAgaYj-gMmkQJH0v7Lmv3fz400biTNw0g=h310",
        "//lh3.googleusercontent.com/sbjjAtwPGHiG1BAzetzBu6-wGfx3pBp0GVdUZSQ4QE0SJ7IE75ns2YM17CztScE_RIg=h310"
    ],
    "comments": [
        "### SIMPLY THE BEST! ### I really can't praise this app high enough... I'm really into tech' and can appreciate it when someone makes something that really matters for the time/age we live in and this app is the best you can get at what it does. This is one of the top 10 most important apps that every android user should have on every device be it a phone or tablet as it really is a one stop shop for everything to do with reading and making QR Codes. There's NO advertising and it doesn't need access to any of your personal information! So simple to use and manufacturers are starting to use them more & more in the setup instructions you get with tech' these days. Just today I got a new router delivered and by reading their code I had the app download and setup in no time compared to having to type the web address in manually. So you might not think you need it now, but trust me you will in the near future, so get the best while it's free.",
        "A brilliant app, first barcode scanner I have found that enables you to use front camera as well as rear camera. (You can choose which one to use). Just two minor hiccups in that: •Flashlight doesn't turn back on when you return from a scan result, even with option turned on... AND •Beware of the widget; they may decide to rearrange themselves, used 4 lots of 1x1 widgets to fill a row up on home screen, turned device back on and they had moved to a new page in a quad formation - widget became bigger than 1x1 too. However; in comparison to the apps main features this is hypothetical.",
        "More private alternative to QR Droid UPDATED Only asks for permission to use the camera which is a HUGE plus in my book. Support for multiple languages is nice and has a few of privacy features that I hope will be expanded upon. It does ask for an email to activate password protection though which makes me slightly uncomfortable but a throw away email can always be set up and used. I will update this rating after some time using this app just to make sure everything works. UPDATE: Everything works!",
        "Never give much of review... But this is absolutely the best app I have ever downloaded is totally awesome.. they're right it's not a smartphone until you download this app..👍👍",
        "QR Droid is the most reliable scanner I've tested. Somehow it will read codes that others cannot, and quickly too.",
        "QR Droid is the most complete of the genre with less permissions But it's failing to read some barcodes"
    ],
    "recentChanges": [
        "v6.8",
        "- Improved synchronization. Get your new items on all your devices in nearly real-time.",
        "- Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=la.droid.qr.priva&hl=en&gl=us",
    "appId": "la.droid.qr.priva"
}