{
    "title": "Tool Box",
    "summary": "ToolBox has everything just you want.",
    "icon": "//lh3.googleusercontent.com/Mh23Pigl0Qart5tCCgdBOWC_yQHp6ckNOM0y0Hsgr2UzbMYzISXyTMvCm4J8R79E8w=w300",
    "price": "$1.99",
    "free": false,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.4,
    "reviews": 252,
    "developer": "Maxcom",
    "developerId": "Maxcom",
    "developerEmail": "maxcom.dev@gmail.com",
    "developerWebsite": "http://maxcom-app-center.blogspot.com",
    "developerAddress": "서울시 금천구 벚꽃로 254 102호",
    "updated": "March 12, 2017",
    "version": "1.6.8.A",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "It's essential 24 utility tools using device's hardware and sensors.Max tool series are already downloaded more then 3 million times in Android Market world wide.in Tool Box...- Compass- Leveler- Length measuring tools- Protractor- Vibrometer- Magnetic field Detector- Altimeter- Tracker- Heart Rate Monitor- Decibel Meter- Flash Light- Unit Converter- Magnifier- Calculator- Abacus- Counter- Score Board- Roulette- Barcode Reader- Mirror- Tuner- Stopwatch- Timer- MetronomeIf you have \"Tool Box\", you don't need to wonder in the market anymore.\"Tool Box\" will help you anytime you want likes Swiss Army Knife.",
    "descriptionHTML": "It&apos;s essential 24 utility tools using device&apos;s hardware and sensors.<br><br>Max tool series are already downloaded more then 3 million times in Android Market world wide.<br><br>in Tool Box...<br>- Compass<br>- Leveler<br>- Length measuring tools<br>- Protractor<br>- Vibrometer<br>- Magnetic field Detector<br>- Altimeter<br>- Tracker<br>- Heart Rate Monitor<br>- Decibel Meter<br><br>- Flash Light<br>- Unit Converter<br>- Magnifier<br>- Calculator<br>- Abacus<br>- Counter<br>- Score Board<br>- Roulette<br>- Barcode Reader<br>- Mirror<br>- Tuner<br><br>- Stopwatch<br>- Timer<br>- Metronome<br><br>If you have &quot;Tool Box&quot;, you don&apos;t need to wonder in the market anymore.<br><br>&quot;Tool Box&quot; will help you anytime you want likes Swiss Army Knife.",
    "histogram": {
        "1": 11,
        "2": 2,
        "3": 14,
        "4": 65,
        "5": 160
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/SLC5xn2_m9GyU1AdUrbK7AaknHhJRRNRFWfhbHqEmPpZmpLYIgzfB6St65FZ0wQi7Mg=h310",
        "//lh3.googleusercontent.com/8L_i21LU3N7VPr6H71Iw-qViuUITW22spu9bsc4jEkoR1VA8LYhD2zFsF9iV4ElQk-QK=h310",
        "//lh3.googleusercontent.com/iWcQGtKadBLdZnSNtPBc_oewPCVM_uNVXTykI_LoSTe5O3SG1NiU6niJbw-WXGkuBDE=h310",
        "//lh3.googleusercontent.com/dSyHnFo5IubVfChXdMwaf7IPzBesftMyQhusqEcxKnKP4ednQYmlmTfq1nLjh9sBv3ng=h310",
        "//lh3.googleusercontent.com/jcvb_2r2Pud2NUEq-5Ys5j9lnDTIVlp0zMm0hd5T0VJflpM-Fhu4UkBbH_Hdh2Dw6POf=h310",
        "//lh3.googleusercontent.com/71WBguYqi_yDU11ku_ynm7O57ZIBQpbhzhXJaeyRVNAcwryYsPJWpuQ6l2W15T9xtZA=h310",
        "//lh3.googleusercontent.com/1IlmkIn4xju2kaB_-bZDzFNp-3YKvWVZMtfujeGOfc_l0vo65ydxg9B96tvbUtaoqHbV=h310",
        "//lh3.googleusercontent.com/mbAsEpAVX28wQIzFbZ28F_YrHKfuZoYenOsRLAbRKjyJp03FmUo7uiAX7VWwgusqfA=h310"
    ],
    "video": "https://www.youtube.com/embed/P6aIuuCWw2A",
    "comments": [
        "Very good. Some tools perhaps too complicated.  Eg.  Protractor should have simple bubble level mode like in Army Knife and others. This means simple mode with big digits, readable font an hi contrast for use in heavy environment. BLACK theme useful for night measurments is missing. EXPORT is missing, though it fortunately can save results in app dir.",
        "I use my Tool Box almost everyday, especially for converting metric to English. The magnifier has an option to take a picture of what your looking at, I got a great pic of a scorpion I caught. There is so many tools in this app, you won't be disappointed!",
        "I rarely buy apps because there's always a free similar version but nothing touches the pro toolbox so worth it this is one app that doesn't have an app that is free in it's league",
        "amazing comprehensive useful app for many things that could enhance your daily smart mob usage",
        "Truly richest toolbox software studio Tool Box is the best for me and it has almost everything I guess I need from this class of software. I only suggest to add more categories in \"Converter\", add more timers in \"Timer\" (now there is only one timer available but sometimes we need to run two or more timers simultaneously). Also it will be great to add function to display live local time with seconds and milliseconds. I am talking about real world or local time in present. Maybe in the future we will see good currency converter in Tool Box.",
        "Great combination of tools Very simple to use,  actually has me using tools I otherwise wouldn't. Getting more out of my 📱.the 1 tool I would ❤ to see is Thermometer,  even as an in-app purchase to Pro."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=maxcom.toolbox&hl=en&gl=us",
    "appId": "maxcom.toolbox"
}