{
    "title": "Lyft",
    "summary": "Use the Lyft app for friendly, affordable rides whenever you need a lift.",
    "icon": "//lh5.ggpht.com/CfRup8ZMEbNpd4sf8PDUWzbnFIq0QINZpJ96M6V0-8wLmyqKD0ORSqPOq5EKdL1OskE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.2,
    "reviews": 140216,
    "developer": "Lyft, Inc.",
    "developerId": "Lyft,+Inc.",
    "developerEmail": "support@lyft.com",
    "developerWebsite": "http://www.lyft.com",
    "updated": "March 2, 2018",
    "version": "Varies with device",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "size": "Varies with device",
    "description": "Need a lift? Use Lyft to get an affordable ride in minutes. Instead of hailing a cab or waiting for the bus, just request a car with the tap of a button, and get picked up by a nearby friendly driver who’ll take you to your destination right away. Enjoy a welcoming, affordable, and memorable ride today.Our app is cheaper than a taxi, faster than the bus, and easy to use •   Getting Started: After downloading Lyft and signing up, simply open the app and request a ride.  •   Paying: Never worry about having cash for a cab or the bus again — with Lyft, you pay through your phone. It’s easy, fast, and secure. •   Split the Cost: Easily split the cost of a ride with friends through the app. No more IOU’s. About Our Drivers •   All Lyft drivers pass comprehensive background and DMV checks before being approved for the service. •   Drivers are rated by passengers and only the highest-rated drivers are allowed on the road. •   Lyft provides a first-of-its-kind $1M liability insurance for total peace of mind.Join the millions who’ve chosen Lyft instead of a cab for commuting, going out at night, and getting to events. Next time you need a ride, skip the bus, taxi, or car service and choose Lyft.Prices vary based on market condition. By downloading the app, you agree (i) to receive communications from Lyft, including push notifications; and (ii) to allow Lyft to collect your device’s language settings. You can opt out of receiving push notifications through your device settings.",
    "descriptionHTML": "Need a lift? Use Lyft to get an affordable ride in minutes. Instead of hailing a cab or waiting for the bus, just request a car with the tap of a button, and get picked up by a nearby friendly driver who&#x2019;ll take you to your destination right away. Enjoy a welcoming, affordable, and memorable ride today.<br><br>Our app is cheaper than a taxi, faster than the bus, and easy to use<br><br> &#x2022;   Getting Started: After downloading Lyft and signing up, simply open the app and request a ride. <br><br> &#x2022;   Paying: Never worry about having cash for a cab or the bus again &#x2014; with Lyft, you pay through your phone. It&#x2019;s easy, fast, and secure.<br><br> &#x2022;   Split the Cost: Easily split the cost of a ride with friends through the app. No more IOU&#x2019;s. <br><br><br>About Our Drivers<br> &#x2022;   All Lyft drivers pass comprehensive background and DMV checks before being approved for the service.<br><br> &#x2022;   Drivers are rated by passengers and only the highest-rated drivers are allowed on the road.<br><br> &#x2022;   Lyft provides a first-of-its-kind $1M liability insurance for total peace of mind.<br><br><br>Join the millions who&#x2019;ve chosen Lyft instead of a cab for commuting, going out at night, and getting to events. Next time you need a ride, skip the bus, taxi, or car service and choose Lyft.<br><br>Prices vary based on market condition. <br>By downloading the app, you agree (i) to receive communications from Lyft, including push notifications; and (ii) to allow Lyft to collect your device&#x2019;s language settings. You can opt out of receiving push notifications through your device settings.",
    "histogram": {
        "1": 17149,
        "2": 4290,
        "3": 6956,
        "4": 14748,
        "5": 97073
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/isCyI93f9SCMexWwVdF-myf7bZcEMf40SABY613LOXCAqSc02aF5E133ptvxbeN6q2Q=h310",
        "//lh3.googleusercontent.com/4hvhKsrfRpwhhKwgtceYJ8YbDhO-QwHvoeBzvR9MrJEt7GSus0gynkPL3MklWN7TjkA=h310",
        "//lh3.googleusercontent.com/X769mv1Izn9eEfSkoK6gMUaQ39-c1IYMhQiW1w4BU26of9Zy3rTxzNfRrtITEnjG748=h310",
        "//lh3.googleusercontent.com/o-BW9qoiDZASoSm5XOjiDqx2WMZOYdXGIJJ4kJKuTKdk72PGyJ4okUoL0sBsBnUqiVg=h310",
        "//lh3.googleusercontent.com/Myf1kmZ8UefT8Y7fuQB1xxNwEossiSpxqEmI2SimtWLHw_u1mwuOTYAs6QPn9QzZRV-2=h310",
        "//lh3.googleusercontent.com/fucnLrd7EGGCbT07a1ahj3yg8WgFhpLSaKtNfHnAOpwHa52AkSflBqJpOKLoS4e5o5fn=h310"
    ],
    "comments": [
        "Don't like the price hikes u guys have my usual $15 trip now is usually about $25-$30 I know gas prices ain't rising that much & I've been a loyal customer for a couple of yrs u guys need to work on a discount plan for frequent customers",
        "I loved lyft for the fair prices but I have to say, charging me 63 dollars for what is usually a 17 dollar ride is not ok, prime time or not, the most I've paid during prime time for an 11 mile ride to pick my kids up from school is always up to 25 dollars.  I don't care what you're spin on that price spike was but now I'm thinking of going over to uber and will be letting folks know. 🤷🏻‍♀️",
        "I keep getting money taking out of my account yet tells there is an issue with my payment information, I get nothing driver but yet you are constantly taking my money and I have no way of contacting anyone, this is very inconvenient, I have court and no way to get there because all you seem to want to do. Is take my money!! I would like someone to get in contact with me ASAP!",
        "I use this app twice a day and when it comes to getting to work it's like trying to play the lotto. This morning a driver cancelled as he pulled up before I could even go down the elevator. You can't write and complain about things that though to customer service. I'm so irritated with Lyft",
        "App gave an inaccurate location where I was at. I had to contact my driver , to let him know my location.  I dont fault the driver.  I was 8 mins driving distance to my destination which I put in. When he picked me up he went had some other destination point thus I was late.  Estimated fee was $18.00 for a 5 min ride. The app then asked for a tip and review of some driver i never had.  Horrible. Horrible first time experience.",
        "The app used to be good, however, now it barely works. Whenever I open it the app automatically schedules my ride later for an hour plus. It's come to the point where I have to clear the cache or reinstall the app for it to work properly. When I do get a ride the drivers even complain about how bad the app is on their end."
    ],
    "recentChanges": [
        "Thanks for choosing Lyft! To make your rides even better, we update the app regularly. It’s like housekeeping: squashing bugs, cleaning up code, and other small-but-mighty improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=me.lyft.android&hl=en&gl=us",
    "appId": "me.lyft.android"
}