{
    "title": "Free WiFi - Wiman",
    "summary": "Free WiFi map and WiFi auto-connect to get a free Internet connection anywhere.",
    "icon": "//lh3.googleusercontent.com/kodmGNUHdnf4QggU45gufKZEbfQzqfVYbdvH4vW4B-nkjeXo6RM1hXrnQV6KZWyUbC0=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000000,
    "maxInstalls": 10000000,
    "score": 4,
    "reviews": 57765,
    "developer": "Wiman",
    "developerId": "5920036514190750919",
    "developerEmail": "android-support@wiman.me",
    "developerWebsite": "http://www.wiman.me/mobile",
    "updated": "December 15, 2017",
    "version": "3.2.170432",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "Wiman is a global WiFi network that allows people like you to connect to the Internet for free and share their WiFi safely without the password is visible.Thanks to the community of users, Wiman is becoming the largest WiFi database worldwide with over 60.000.000 hotspots, so you can surf the Internet for free anywhere in the world.Wiman was awarded by Google as one of the 18 most beautiful Apps of 2015 and it was included in the “Best-In-Class Android Design” section.------------------------★ INSTANT WIFI ACCESSGet automatically connected to millions of free WiFi all around the world and to WiFi shared by Wiman users.★ SAFE WIFI SHARINGWiman users will be able to connect to your WiFi without your password being visible and you can keep track of the usage stats. You can lock your shared WiFi again at any time.★ A BRAND NEW WIFI MANAGERIt works like your system WiFi Manager, but with superpowers! It gives you full control over WiFi: you can mark a WiFi as your favorite, get notified when you are connected and keep your device from auto-connecting to specific WiFi. It also classifies and suggests WiFi nearby and shows you the blue keys to access the shared WiFi.★ OFFLINE WIFI MAPSDownload WiFi maps of cities to avoid data roaming charges and find out where you can go online for free.It also works with offline maps of open WiFi, so you can surf for free in your city or abroad.★ HOW TO FIND FREE WIFI HOTSPOTS WITH WIMAN- Choose the city in which you are traveling, or the nearest free hotspots to you- Scroll the map and find the open WiFi- Thanks to the offline WiFi maps you can access the free hotspots maps even without an Internet connection★ EARN POINTSThe more actions you perform in the App the more points you get! Win trophies and become the strongest among your friends!★ AVAILABLE FOR ANDROID WEARTake a WiFi speedtest and discover hotspots that really work.Try it directly on your wrist, wherever you are!------------------------ADVANTAGES★ Unlimited offline WiFi maps★ Access to free WiFi in bars, hotels, cities, Countries and airports★ Find the nearest free WiFi hotspots close to you wherever you are★ Rating of free WiFi hotspots★ Automatic access to open WiFi hotspots★ Free shared access to Internet without the WiFi password. Passwords are protected for the privacy and security of those who share.------------------------This App is not about WiFi hacking: it has been developed to find the online and offline WiFi maps to surf the Internet for free everywhere. You can connect to WiFi wilfully shared by Wiman users in a safe way.------------------------Feedback? Suggestions?Come and talk about it here: http://bit.ly/wiMANbetaDo you like Wiman? Follow us:Facebook: facebook.com/wimanappTwitter: twitter.com/wimanmeWebsite: wiman.me/mobile------------------------Facebook Ads Policy: https://m.facebook.com/ads/ad_choices",
    "descriptionHTML": "Wiman is a global WiFi network that allows people like you to connect to the Internet for free and share their WiFi safely without the password is visible.<br><br>Thanks to the community of users, Wiman is becoming the largest WiFi database worldwide with over 60.000.000 hotspots, so you can surf the Internet for free anywhere in the world.<br><br>Wiman was awarded by Google as one of the 18 most beautiful Apps of 2015 and it was included in the &#x201C;Best-In-Class Android Design&#x201D; section.<br><br>------------------------<br><br>&#x2605; <b>INSTANT WIFI ACCESS</b><br>Get automatically connected to millions of free WiFi all around the world and to WiFi shared by Wiman users.<br><br>&#x2605; <b>SAFE WIFI SHARING</b><br>Wiman users will be able to connect to your WiFi without your password being visible and you can keep track of the usage stats. You can lock your shared WiFi again at any time.<br><br>&#x2605; <b>A BRAND NEW WIFI MANAGER</b><br>It works like your system WiFi Manager, but with superpowers! It gives you full control over WiFi: you can mark a WiFi as your favorite, get notified when you are connected and keep your device from auto-connecting to specific WiFi. <br>It also classifies and suggests WiFi nearby and shows you the blue keys to access the shared WiFi.<br><br>&#x2605; <b>OFFLINE WIFI MAPS</b><br>Download WiFi maps of cities to avoid data roaming charges and find out where you can go online for free.<br>It also works with offline maps of open WiFi, so you can surf for free in your city or abroad.<br><br>&#x2605; <b>HOW TO FIND FREE WIFI HOTSPOTS WITH WIMAN</b><br>- Choose the city in which you are traveling, or the nearest free hotspots to you<br>- Scroll the map and find the open WiFi<br>- Thanks to the offline WiFi maps you can access the free hotspots maps even without an Internet connection<br><br>&#x2605; <b>EARN POINTS</b><br>The more actions you perform in the App the more points you get! Win trophies and become the strongest among your friends!<br><br>&#x2605; <b>AVAILABLE FOR ANDROID WEAR</b><br>Take a WiFi speedtest and discover hotspots that really work.<br>Try it directly on your wrist, wherever you are!<br><br>------------------------<br><br>ADVANTAGES<br><br>&#x2605; Unlimited offline <b>WiFi maps</b><br>&#x2605; Access to <b>free WiFi</b> in bars, hotels, cities, Countries and airports<br>&#x2605; Find the nearest <b>free WiFi</b> hotspots close to you wherever you are<br>&#x2605; Rating of <b>free WiFi</b> hotspots<br>&#x2605; Automatic access to <b>open WiFi</b> hotspots<br>&#x2605; Free shared access to Internet without the <b>WiFi password</b>. Passwords are protected for the privacy and security of those who share.<br><br>------------------------<br><br>This App is not about WiFi hacking: it has been developed to find the online and offline WiFi maps to surf the Internet for free everywhere. You can connect to WiFi wilfully shared by Wiman users in a safe way.<br><br>------------------------<br><br>Feedback? Suggestions?<br>Come and talk about it here: http://bit.ly/wiMANbeta<br><br>Do you like Wiman? Follow us:<br>Facebook: facebook.com/wimanapp<br>Twitter: twitter.com/wimanme<br>Website: wiman.me/mobile<br><br>------------------------<br><br>Facebook Ads Policy: https://m.facebook.com/ads/ad_choices",
    "histogram": {
        "1": 7745,
        "2": 2644,
        "3": 5501,
        "4": 7554,
        "5": 34321
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FS83hnM6s6OiZ1y5vATkUVYRhKf2C88tjRwtikU4z--q1jHr7wZKIqTT1SkHz4s8xm0=h310",
        "//lh3.googleusercontent.com/u6aDTQbmFEQHepQCMOhcgw85Fi4k4x9ev2c8C49IVRnTiG7i7WZiwo6SyDwl9xEQLg=h310",
        "//lh3.googleusercontent.com/Gqew7t9yvZOdQt35qQOLlYusFWsYVr-EleABlkfwFjtiHQQbW3Id3JzOJ2kFEizX-Ao=h310",
        "//lh3.googleusercontent.com/oo4u__l4rF-3sTErab-Uo8UYpSvG8ongFdyM-Vm47Lt9c045iL7HK3NSkAXLxa9FyhEb=h310",
        "//lh3.googleusercontent.com/rgr7R3b_M0IguaZBuoHVJ1_ini5l6G5IGbPWt59TH6u3hTtsvUvkK_he9EGUEDw6oZo=h310",
        "//lh3.googleusercontent.com/zDru4cgdCf3ElmE_ZeFveD1Yd_RXX9xuqZ_BefIV0n7sI15NuyYjfIbUKvJHR-D-Vu4=h310",
        "//lh3.googleusercontent.com/WU1EhL56LifU6vnbVguGQ-fQ_8X3etSyCPv7d9TF_ZNI3r1E1g7y-qS0vbaxR_7z5leH=h310",
        "//lh3.googleusercontent.com/i1fpRiUIAW1-QD5yAq7FE42uuuoY5HioPWRVzIghtU2RaN_1t5l05PV09NhK1oc72Uk=h310",
        "//lh3.googleusercontent.com/GTh4HG0n9JqSDO5zCsvruQNQPMrQvmAp5X1QaZABOQlGM-vAaTS4MvJXtM-oAqa-3TY=h310",
        "//lh3.googleusercontent.com/8ev6YNMm18a8azhzbtjdFEZJUvHVpAT6zXTsARjtoskeZe0knzV3UcGBL_JhYHHxTQ=h310",
        "//lh3.googleusercontent.com/8dxS1WhY6LL2U5c2yh7BWwjas9-2go9U80WlpYPcNWOmfEMuqxTI2Qpbn_LVjtrD_RSi=h310"
    ],
    "video": "https://www.youtube.com/embed/nEVMXHmndK4",
    "comments": [
        "Great concept, and useful. My only issue is too many people mark wifi as verified and free but there is a sign in required. I havent been able to find a way to mark it as inaccurate or change it. Perhaps it exists but cant find the option (s). It is a persistant issue as well. MANY are marked verified (green) but should be purple (password required)",
        "Tells me I can close the window if not wanting info about my life sold. But the x for closing is greyed out. Had to close they task manager. Go get a real job rather wanting cameras in peoples' bathrooms.",
        "Used to work but about year ago it locked reward my account.. And customers support just denied my mail",
        "Finds a free wifi for less than 3 minutes.  Unable to find free wifi.  Dors not work offline.  Uninstalling.",
        "Great app for finding free Wi-Fi I used it last summer all over and it found me many free sources for Wi-Fi",
        "i hate  it cause it won't let me  travel no were  with free interest"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=me.wiman.androidApp&hl=en&gl=us",
    "appId": "me.wiman.androidApp"
}