{
    "title": "BeyondPod Podcast Manager",
    "summary": "Discover thousands of free audio and video shows from all over the world!",
    "icon": "//lh4.ggpht.com/pg3aEBwJts7CHKPE57vex2gRE-QDY6m9xbRk_f9VhZw-LbcibuOkz_m2YId6SkcqogE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4,
    "reviews": 31821,
    "developer": "BeyondPod Team",
    "developerId": "BeyondPod+Team",
    "developerEmail": "support@beyondpod.mobi",
    "developerWebsite": "http://www.beyondpod.mobi/android",
    "developerAddress": "8571 Gander Creek Dr\nMiamisburg, OH 45342",
    "updated": "November 23, 2016",
    "version": "Varies with device",
    "genre": "News & Magazines",
    "genreId": "NEWS_AND_MAGAZINES",
    "size": "Varies with device",
    "description": "Play thousands of free audio and video podcasts from all over the world!With nearly 3 million downloads, BeyondPod’s streamlined interface and powerful controls give youeasy access to millions of audio and video episodes from small publishers like local radio stations to \"big name\" publishers like CNN, ESPN, BBC, CBC. • ACCESS hundreds of thousands of free audio and video podcasts from all over the world.• PLAY your content everywhere - online or offline.• CUSTOMIZE your playlist the way you like.____________________This is a \"Lite\" version with 7 day full feature trial____________________• DISCOVER A WORLD OF PODCASTS IN YOUR HANDDiscover thousands of free audio and video shows from all over the world. Search for feeds or browse our extensive library of popular Podcasts.Import your own files (music, audio books, lectures & more) and play them with our powerful player. • PLAY PODCASTS YOUR WAYAdjust the playback speed, set a sleep timer, use \"volume boost\", or \"cast\" to your TV - we have all the tools to enjoy your content the way you like it. • FOCUS ON WHAT MATTERSBeyondPod’s configurable \"skip/replay\" buttons let you easily skip overparts that you’re not interested in, or replay parts you missed.• CAST TO THE \"BIG\" SCREEN WITH CHROMECASTCast your audio or video episodes to your TV via Chromecast directly fromBeyondPod.• SMART PLAYLISTSBeyondPod’s Smart Playlists automatically create playlists based on your listeningpreferences. You can build a playlist for your daily commute, another for 'At the Gym' or 'On the Train' etc. • COMPLETE CONTROLDecide which episodes to download, when and over which connection as well as how longto keep old episodes. Choose to automatically update a single feed, all the feeds in agiven category, or all feeds.• CUSTOMIZABLE CONNECTION SETTINGSSave bandwidth and battery by scheduling your downloads at a specific time, only when connected to WiFi,or only when the phone is charging.• HOME SCREEN WIDGET AND PLAY LIST SHORTCUTSResizeable Home Screen Widget gives you quick access to your player and playlist. Start your favoriteSmart Playlists directly from your home screen.• INTEGRATED WITH FEEDLYComplete Feedly integration allows you to access older episodes that are no longer part of the publisher's feed.You can also easily import your Feedly subscriptions as well as synchronize read and starred posts between a PC and your phone.Like to live on the cutting edge? Subscribe to our BETA channel on Google Play!Details at: http://www.beyondpod.mobi/Android/BETA",
    "descriptionHTML": "Play thousands of free audio and video podcasts from all over the world!<br><br>With nearly 3 million downloads, BeyondPod&#x2019;s streamlined interface and powerful controls give you<br>easy access to millions of audio and video episodes from small publishers like local radio stations to &quot;big name&quot; publishers like CNN, ESPN, BBC, CBC. <br><br>&#x2022; ACCESS hundreds of thousands of free audio and video podcasts from all over the world.<br>&#x2022; PLAY your content everywhere - online or offline.<br>&#x2022; CUSTOMIZE your playlist the way you like.<br><br>____________________<br><br>This is a &quot;Lite&quot; version with 7 day full feature trial<br>____________________<br><br>&#x2022; DISCOVER A WORLD OF PODCASTS IN YOUR HAND<br>Discover thousands of free audio and video shows from all over the world. Search for feeds or browse our extensive library of popular Podcasts.<br>Import your own files (music, audio books, lectures &amp; more) and play them with our powerful player.<br> <br>&#x2022; PLAY PODCASTS YOUR WAY<br>Adjust the playback speed, set a sleep timer, use &quot;volume boost&quot;, or &quot;cast&quot; <br>to your TV - we have all the tools to enjoy your content the way you like it. <br><br>&#x2022; FOCUS ON WHAT MATTERS<br>BeyondPod&#x2019;s configurable &quot;skip/replay&quot; buttons let you easily skip over<br>parts that you&#x2019;re not interested in, or replay parts you missed.<br><br>&#x2022; CAST TO THE &quot;BIG&quot; SCREEN WITH CHROMECAST<br>Cast your audio or video episodes to your TV via Chromecast directly from<br>BeyondPod.<br><br>&#x2022; SMART PLAYLISTS<br>BeyondPod&#x2019;s Smart Playlists automatically create playlists based on your listening<br>preferences. You can build a playlist for your daily commute, another for &apos;At the Gym&apos; or &apos;On the Train&apos; etc. <br><br>&#x2022; COMPLETE CONTROL<br>Decide which episodes to download, when and over which connection as well as how long<br>to keep old episodes. Choose to automatically update a single feed, all the feeds in a<br>given category, or all feeds.<br><br>&#x2022; CUSTOMIZABLE CONNECTION SETTINGS<br>Save bandwidth and battery by scheduling your downloads at a specific time, only when connected to WiFi,<br>or only when the phone is charging.<br><br>&#x2022; HOME SCREEN WIDGET AND PLAY LIST SHORTCUTS<br>Resizeable Home Screen Widget gives you quick access to your player and playlist. Start your favorite<br>Smart Playlists directly from your home screen.<br><br>&#x2022; INTEGRATED WITH FEEDLY<br>Complete Feedly integration allows you to access older episodes that are no longer part of the publisher&apos;s feed.<br>You can also easily import your Feedly subscriptions as well as synchronize read and starred posts between a PC and your phone.<br><br>Like to live on the cutting edge? Subscribe to our BETA channel on Google Play!<br>Details at: http://www.beyondpod.mobi/Android/BETA",
    "histogram": {
        "1": 3974,
        "2": 1939,
        "3": 2530,
        "4": 6365,
        "5": 17013
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/t2-52Z-hnSodwEIUlohaNR_WNwDXhBbsEaV6QkJPf97didoXXKHc_axpFVSqLZkRya5n=h310",
        "//lh4.ggpht.com/Qtk4eNXdPU04yO9OYnFeZJ0anEsJPi8IzB3HrE4te6vWd0uFJK5kuKXOyU1ZkHhMvo-8=h310",
        "//lh5.ggpht.com/2FX0dDF0cxlKa_nokon_TSqjX8mZmW038Pd_2kseVOWrlhZmAM-jX73w9tYMboPRjg=h310",
        "//lh6.ggpht.com/hgQYM6J1Nj4Y-rRfDMKoBrkGONyT-a6jThdi0Rv8Kwkr7QFq3YW5zu5l575D5lHieXs=h310",
        "//lh5.ggpht.com/wHHk8w6oA4mQWES1jnAdXFI_p2MZXLeZoGIehVSNkwKU5QPFhuh9JbUt4hmgyKqw4OI=h310",
        "//lh6.ggpht.com/9kUCeyJeMqMKmYem5alrZafk18J06mGsAjVlbgo6BpYm0xXQdP3FpBPwyKyUysPjrg=h310",
        "//lh3.ggpht.com/uRkzFGq-We3ENaJDfgJzImG5XssMOqL0xj0oZNfucKAYWaNuqC_acDXsbpAJDJ5F0tyT=h310",
        "//lh3.ggpht.com/bhFMpNmYKll0bj6AWPSjsLiGMQmbhadCnuYS_gR2tIMvLhKW2xlCIhl861x6DZqrcKu9=h310",
        "//lh3.ggpht.com/3s2rt1NxAilNCAr60weFcRC7mrZPbNBUAvGVn4awp3zPtVVucv4ypqkBtL8th6tWxA=h310",
        "//lh4.ggpht.com/HNKuaAztdWd064qrHmijBf6WkCSljCDumzq7ybb-g8tHNXN_m69UNhZqdwVoy-a8qCI=h310",
        "//lh5.ggpht.com/GWy8PZD9U0nePEXtamKdiBk-5MXgL_Je_T5gL3MTCYIhS9HPiEW-QBhE0XWaRDoRx2Q=h310",
        "//lh6.ggpht.com/daxnEv92ruSJOk4GKDNs0dUQSCL425U1jOI4NGvsOZJh0CnML_KzI0mSTrzMl90kZ3aP=h310",
        "//lh4.ggpht.com/KmH_AA1Ew2sIiWHlHxrjAZGB2FtSQim_gCocxRqtrI_U7t8avBYu9XvRjc2521ROeF8=h310",
        "//lh6.ggpht.com/XKxoPyzEHwXPgCXMBrH0QhBUO2-WoHv-1saiqWB6iT6_-an2UNvecgc6tjdaKd4VwgE=h310",
        "//lh3.ggpht.com/qNN8UrCyH_uD__kkqVR09MlYODmppBX9VQsMg9bkvDGPIgsjvpLkRPYSZAYWfrwQ2VmF=h310",
        "//lh3.ggpht.com/xlSTpiGm_s5AU-AbXF7Rhc09gPNdAuvUHik5rWFika_zzAGracq7DCn2l3UxSxvJsjU=h310",
        "//lh4.ggpht.com/BJ0QNybg-VNo2CSNYjuiYhrQPfDpBLo21s8SOWUjkk0GiCcwxtm0GuLdeMqQM_ybYEEt=h310",
        "//lh6.ggpht.com/WC3n49PjTpFxy4dSsysBTwW1WYMS0-qgs9cnT9lhbAp4zSrJMuGYAnS9B6wIu4FqiA=h310",
        "//lh5.ggpht.com/mABas_2VrQR09y6G4B6_8YklV-zegSIEyG9lrvi0EZZfrUmPTtSYu-VPXqCWyFnIEA=h310",
        "//lh5.ggpht.com/pg2uuDYjMu_3YXwIg9lxf-zqEdyvPuhqpJR5wGIdk8zZoWUPDmGDUa3Y4xxp-Xqk07xv=h310",
        "//lh4.ggpht.com/YWj-TZro9JvDK-lvKae-Xiwtfot3xqAd2_z-atBFZaTyRjWCFCk6wJQaOVWLGbZjAbc2=h310"
    ],
    "video": "https://www.youtube.com/embed/Vw7GD4kGf-0",
    "comments": [
        "I hated the new look and then I got used to it and now I like it a lot. Play with it a little bit and give it a chance, you may get to like it too.  Update: New beyond pod beta version 4.2.19 is awful and full of bugs... so many bugs... Huge problems as a result, I lost everything. Must backup regularly... Lesson learned",
        "Was my favorite until the .19 beta release. They released it with so many bugs you need a hazmat suit to run it and the problems persist almost 2 months later. Had to use adb side loading to downgrade to a working .18 release.   I could no longer allow a friend to run this product.",
        "Long time user of this app; the new beta version is unusable and you cannot leave the beta group with the links they have provided. The latest public version (non beta is over a year old) and not suitable for use on newer android versions. Wish I could get my money back for the pro key.",
        "The quality of this app has fallen off very recently. There are bugs in the themes, playback speed, Chromecast and auto downloads. The developer has not been very active in squashing the bugs.",
        "Was my favourite podcast app for several years, but after some changes in the maintaining team, it just doesn't work any more. The stable version still (after 2 years now!) doesn't support Android Auto, the beta version does not work on Android 8.0 / 8.1.",
        "A company bought it, and ruined it three months ago with a broken beta, and have shown no interest in fixing. Absentee developer, find a program that is actually maintained."
    ],
    "recentChanges": [
        "* Bug fixes."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=mobi.beyondpod&hl=en&gl=us",
    "appId": "mobi.beyondpod"
}