{
    "title": "Amber Weather - Local Forecast,live weather app",
    "summary": "Accurate weather app with daily&amp;hourly forecasts and different weather widgets.",
    "icon": "//lh3.googleusercontent.com/mSn9_15xvTl4tgfT5NQeytpdO4MfsdyCDezMLphIY5j2dFITrlKcpGuIVCinFxepZ2w=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 4.4,
    "reviews": 258077,
    "developer": "Amber Mobile Limited",
    "developerId": "7686194056937543414",
    "developerEmail": "support@amberweather.com",
    "developerWebsite": "http://www.amberweather.com/",
    "developerAddress": "RM 1401, 14/F WORLD COMMERCE CTR HARBOUR CITY 7-11 CANTON RD TST KLN HONG KONG",
    "updated": "October 16, 2017",
    "version": "3.6.7",
    "genre": "Weather",
    "genreId": "WEATHER",
    "description": "One of the most popular weather apps and best weather forecast apps is waiting for you!This best widget is a full featured, completely customizable digital clock and weather forecast widget. With it, you can get clock and weather information conveniently. It provides accurate local weather information like highest/lowest temperature and current weather conditions. This clock and weather widget for android, definitely your best widget choice in daily life.Features:· A weather location app: displays current temperature: it provides weather alert notifications· Detailed weather reports that include location time, sunrise and sunset, temperature and humidity, pressure, chance of rain, dew point, visibility, UV index, wind speed and direction, weather current condition·Live weather forecast for free: this weather and climate app offers daily weather, hourly weather forecasts and monthly weather forecasts. Meanwhile, it also provides interstate travel weather forecasts and forecast weather and wind.·Weather notifications in status bar can help you better plan your day with weather warnings and alerts updates·Precipitation: precipitation forecasts and precipitation amounts·A news weather app with news weather and updates daily: News weather and temperature with location display.· A weather alert app with sound with severe weather alerts for your area: weather warnings will be sent to you. You can also use this widget as temperature sensor, humidity sensor, storm tracker, wind speed and direction meter and even snow tracker.· Air Quality Index (AQI): presents air quality index for 20,000 locations worldwide, like aqi India.·Precipitation Forecast, tells you when will be an umbrella weather.·It’s also a weather app with sunrise & sunset time. And you can also check sunrise and sunset time on the widget.· World Weather App& accurate weather checker for America: It’s not only a weather detector for your own location, but also a global weather tracker that you can search world weather and temperature. We support weather and temperature checking in cities like Los Angeles temperature, New York weather, Chicago, Las Vegas, Hawaii, San Francisco weather and Houston weather.4 The exceptional characteristics of this best clock weather widget:· Global weather tracker and forecasterLocal Weather Live App provides weather conditions of all locations, world weather and temperature report. It can be you true weather tracker and temperature checker in pocket.· Simple Weather Tracker and smart temperature trackerSimple weather outlook and weather skins. It shows current location temperature in status bar, which you can check current temperature conveniently.· CustomizedOffer a widget creative collection with temperature display and live weather themes for you to personalize home screen. Besides, sun and moon live wallpaper with weather is available as well.· Live weather background wallpaperIt has real weather day night live wallpapers which are using as background wallpaper. You can understand the current weather via this beautiful weather pictures.Coming soon:· National weather radar;· Weather radar widget· True weather 3d live wallpapers with location wallpaper;· Moon phase clock widget and moon phase calendar widget for customization.Stay in touchIf you would like to help with the translation and localization, please write to: support@amberweather.com",
    "descriptionHTML": "One of the most popular weather apps and best weather forecast apps is waiting for you!<br><br>This best widget is a full featured, completely customizable digital clock and weather forecast widget. With it, you can get clock and weather information conveniently. It provides accurate local weather information like highest/lowest temperature and current weather conditions. This clock and weather widget for android, definitely your best widget choice in daily life.<br><br>Features:<br>&#xB7; A weather location app: displays current temperature: it provides weather alert notifications<br><br>&#xB7; Detailed weather reports that include location time, sunrise and sunset, temperature and humidity, pressure, chance of rain, dew point, visibility, UV index, wind speed and direction, weather current condition<br><br>&#xB7;Live weather forecast for free: this weather and climate app offers daily weather, hourly weather forecasts and monthly weather forecasts. Meanwhile, it also provides interstate travel weather forecasts and forecast weather and wind.<br><br>&#xB7;Weather notifications in status bar can help you better plan your day with weather warnings and alerts updates<br><br>&#xB7;Precipitation: precipitation forecasts and precipitation amounts<br><br>&#xB7;A news weather app with news weather and updates daily: News weather and temperature with location display.<br><br>&#xB7; A weather alert app with sound with severe weather alerts for your area: weather warnings will be sent to you. You can also use this widget as temperature sensor, humidity sensor, storm tracker, wind speed and direction meter and even snow tracker.<br><br>&#xB7; Air Quality Index (AQI): presents air quality index for 20,000 locations worldwide, like aqi India.<br>&#xB7;Precipitation Forecast, tells you when will be an umbrella weather.<br><br>&#xB7;It&#x2019;s also a weather app with sunrise &amp; sunset time. And you can also check sunrise and sunset time on the widget.<br><br>&#xB7; World Weather App&amp; accurate weather checker for America: It&#x2019;s not only a weather detector for your own location, but also a global weather tracker that you can search world weather and temperature. We support weather and temperature checking in cities like Los Angeles temperature, New York weather, Chicago, Las Vegas, Hawaii, San Francisco weather and Houston weather.<br><br>4 The exceptional characteristics of this best clock weather widget:<br><br>&#xB7; Global weather tracker and forecaster<br><br>Local Weather Live App provides weather conditions of all locations, world weather and temperature report. It can be you true weather tracker and temperature checker in pocket.<br><br>&#xB7; Simple Weather Tracker and smart temperature tracker<br><br>Simple weather outlook and weather skins. It shows current location temperature in status bar, which you can check current temperature conveniently.<br><br>&#xB7; Customized<br><br>Offer a widget creative collection with temperature display and live weather themes for you to personalize home screen. Besides, sun and moon live wallpaper with weather is available as well.<br><br>&#xB7; Live weather background wallpaper<br><br>It has real weather day night live wallpapers which are using as background wallpaper. You can understand the current weather via this beautiful weather pictures.<br><br>Coming soon:<br><br>&#xB7; National weather radar;<br>&#xB7; Weather radar widget<br><br>&#xB7; True weather 3d live wallpapers with location wallpaper;<br><br>&#xB7; Moon phase clock widget and moon phase calendar widget for customization.<br><br>Stay in touch<br><br>If you would like to help with the translation and localization, please write to: support@amberweather.com",
    "histogram": {
        "1": 12086,
        "2": 6869,
        "3": 17655,
        "4": 52642,
        "5": 168825
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/RASbJuz8iKhEMo_GWNcaKceL2OchSKagMSZFFH7UExt56JurI-AqyRkQW8D6t1qgLyI=h310",
        "//lh3.googleusercontent.com/cECn0SY26fMr8MsbzT2vK40fTIKVK3g7O9bAK04-23y7Da7pwVH_fWEfzo1QrdnVQiLS=h310",
        "//lh3.googleusercontent.com/Qff8GoVShN8DF0dEJfsCc9r7jPwT9fuiaBzGLNTwrWbRie4mnp6zRjTDrifRAPlMRy0T=h310",
        "//lh3.googleusercontent.com/2DdFkiQ74X5vfZzcV3SqlEwzMol32Uci41tu3nrtgUid1jmeosYco7VzT80qZrD_crSR=h310",
        "//lh3.googleusercontent.com/6KC1uNWmjH_js5JDD_dc-OO8Vfzs8KA7LTx5xGF895Mjx39Ucd09QUNbxE0vHq5ruTY=h310",
        "//lh3.googleusercontent.com/72lB8_nO67Aq-6k7Dad6JYQYkaGXkZPfpOzD8klBTbEIgOTA8SoCot1aKYq3gNX1yKVA=h310"
    ],
    "video": "https://www.youtube.com/embed/p-O_FJ8EJJ8",
    "comments": [
        "I wish the add-on widgets for this app were more configurable. Not a single one of them allows me to choose all of the units. I can control the main ones only. So I uninstalled the widgets because none of them were acceptable. I did keep Amber weather as it is nice. Just wish your widgets were better.",
        "Update=3.6.7 BAD BAD BAD LOCATION ACCURACY. I CHECKED MY RECORDS ABOUT MY FIRST CORRESPONDENT TO YOU TO IMPROVE THE LOCATION ACCURACY. IT WAS 18 MONTHS AGO. AND, YOU DID NOTHING. WHAT SHOULD I SAY ABOUT YOUR CUSTOMER SERVICE?????",
        "i liked it because some of the widgets were simple and nice. but the widgets changed on their own more than once, and the notifications are getting annoying. i may look for another clock widget if more pop ups appear",
        "Couple years later and it's still occasionally asking me to rate and give feedback. I will open it for /the weather/ and almost always have to dismiss some notification or another. I don't even use the widgets anymore.",
        "Update,  have had this app for almost a year and even though a paid app its plagued with ads !!! , and hidden push ads which I hate!!  Will be uninstalling and not renewing,  good riddens!!",
        "Almost as good as Accuweather, but doesn't force me to keep my gps on. My only critique for Amber weather is to have a native English speaker go through & proof read the grammar. Some of it sounds like they tried hard to get it correct. *Currently widgets have a separate notification setting than the main app. I think it's conflicting. I keep getting morning and evening alerts when I turned them off."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=mobi.infolife.ezweather&hl=en&gl=us",
    "appId": "mobi.infolife.ezweather"
}