{
    "title": "Omlet Chat",
    "summary": "Just Between Us",
    "icon": "//lh4.ggpht.com/oPvsGGduuB731f4SQ9JW-WPBeev4FVuf8_B_micb6cF3ZSdP1K3kIZ5nQ04i0qnYSw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000000,
    "maxInstalls": 50000000,
    "score": 3.9,
    "reviews": 39554,
    "developer": "Omlet, Inc",
    "developerId": "Omlet,+Inc",
    "developerEmail": "contact@mobisocial.us",
    "developerWebsite": "http://omlet.me",
    "developerAddress": "457 Castro St\nMountain View, CA",
    "updated": "November 4, 2016",
    "version": "2.2.7600",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Omlet is the most fun, collaborative and FREE way to stay connected on a chat app.  You can pick your communication style -- make a gif to show your reaction to your friend’s messages or make a sticker of yourself and photobomb your friends’ pictures. You can also start a chat at a party, wedding, concert, and have everybody in the room join and create a photo album together.  All the pictures are shared only between the people in the room, and nobody else needs to know about them, if that’s what you want. With Omlet you are the customer, not the product. You own your data, not us.         Omlet runs on the world’s most advanced privacy protection technology developed in the Stanford Computer Science Department.   Omlet promises never to monetize your data.  You can link your chat account to your Box, Dropbox, or Baidu account today, with more choices in the future.  The company stores users’ data for only two weeks to handle disconnected devices. ** ALL NEW FOR ANDROID WEAR **Omlet supports Android Wear so you can keep in touch better with your closest friends.  Notifications will automatically extend to your Android smart watch.  You can see text, pictures, and check-ins in a quick glance as well as reply with love, voice replies, or quick texts.  If you run the Omlet wearable app on from the \"Start...\" section, you can see the latest content or send a quick message to your recent conversations.        Why Use Omlet:- FUN & CREATIVE: Create custom stickers, GIFs, edit photos, and more.- ON-THE-FLY SHARING: Start a chat on the spot to create photos albums with anyone nearby-- even people not in your address book.- SECURE & PRIVATE: Omlet doesn’t store your data -- you do! In the cloud provider of your choice.- NO CREEPY ADS: No one likes ads that seem like someone’s been reading your messages.  We don’t do it and never will.",
    "descriptionHTML": "Omlet is the most fun, collaborative and FREE way to stay connected on a chat app.  You can pick your communication style -- make a gif to show your reaction to your friend&#x2019;s messages or make a sticker of yourself and photobomb your friends&#x2019; pictures. <br><br>You can also start a chat at a party, wedding, concert, and have everybody in the room join and create a photo album together.  All the pictures are shared only between the people in the room, and nobody else needs to know about them, if that&#x2019;s what you want. <br><br>With Omlet you are the customer, not the product. You own your data, not us. <br>        <br>Omlet runs on the world&#x2019;s most advanced privacy protection technology developed in the Stanford Computer Science Department.   Omlet promises never to monetize your data.  You can link your chat account to your Box, Dropbox, or Baidu account today, with more choices in the future.  The company stores users&#x2019; data for only two weeks to handle disconnected devices. <br><br>** ALL NEW FOR ANDROID WEAR **<br>Omlet supports Android Wear so you can keep in touch better with your closest friends.  Notifications will automatically extend to your Android smart watch.  You can see text, pictures, and check-ins in a quick glance as well as reply with love, voice replies, or quick texts.  If you run the Omlet wearable app on from the &quot;Start...&quot; section, you can see the latest content or send a quick message to your recent conversations.<br><br>        <br>Why Use Omlet:<br><br>- FUN &amp; CREATIVE: Create custom stickers, GIFs, edit photos, and more.<br><br>- ON-THE-FLY SHARING: Start a chat on the spot to create photos albums with anyone nearby-- even people not in your address book.<br><br>- SECURE &amp; PRIVATE: Omlet doesn&#x2019;t store your data -- you do! In the cloud provider of your choice.<br><br>- NO CREEPY ADS: No one likes ads that seem like someone&#x2019;s been reading your messages.  We don&#x2019;t do it and never will.",
    "histogram": {
        "1": 5046,
        "2": 1768,
        "3": 5220,
        "4": 6329,
        "5": 21191
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Teen",
    "screenshots": [
        "//lh5.ggpht.com/_E_Y5MGbkX6S0jkrVw_TfvhKkWVmx_SVvEKzgg8U7vSUU5ZSS0lakMpHzpiuKxQRIra3=h310",
        "//lh5.ggpht.com/inC6mmsqztm3s46qxZTrWK_nSId3YNhZYWc0Xm4tHpevq-a3g7SW9qGVNF94PW7c9S5_=h310",
        "//lh4.ggpht.com/RfIj5ENTVYH34rLuLaG9D3f0sqEGb3uvF0_YRJAJ-0N_XQC8vJVCINH3q73ZFpoZ694=h310",
        "//lh6.ggpht.com/0EJx5rQeV0t3ZEveWpU2RdT8mXCchqgaxRIQG11HsslF0rhQKSnOzBZevhNUmIziGgc=h310",
        "//lh5.ggpht.com/kh6ms6FS7BA5X0qfaoFZWS3YXWCKvwQRYC7JK7TEd7BxOhlaW2gicvBsTL7cl7XW8A=h310",
        "//lh3.ggpht.com/YvZKghFgbUXz5m9QH79ObFQEBXI8DZWXFvH9jBm64gJzkCbCmJMYDON0d5onaoyrfzE=h310",
        "//lh3.googleusercontent.com/H2nv4Xy_EJbqDm7Yk6CVFt8-lAdgQs1D1YONtmplSKgmus0PRR2I5VRtH0pRyAOCGoU=h310",
        "//lh3.ggpht.com/23yBKlbsxC3gL0eD9VkaQ7pFEWu3Opvj36kN6rW-OvRPN0VqHzDZY52uBeSaPbJ_cgU=h310",
        "//lh5.ggpht.com/tAPBzG2yDOUyzVJkYMr41S7kd4IEbIvzAht6DejgWFITAez_ND3rRBSeywq78XThhw=h310",
        "//lh4.ggpht.com/OKMZl-omYAnb0r6kKga_o7E1G6FzJGxC67YIa2jtlCuC7UsWHCZVwgyCDrTmBE268qJ6=h310",
        "//lh3.ggpht.com/Y-x5UOxGPqoBkkope1tUq7F5CyGs61O2SgKB9Gt2GRWv1RF8nNbJE6DQJgLLoDyhqQ=h310",
        "//lh4.ggpht.com/ZMoKwz2rbWn5jyNN-6juZV1aTou_ZRhQD5LfMzmmvGQ_LRbGeUuYT6BPQhbYystkzKnn=h310"
    ],
    "video": "https://www.youtube.com/embed/H3hE63010bw",
    "comments": [
        "It would be better if I can connect to anyone without switching ON my location setting.  Would like to meet pals outside of town,  not within my own hometown though. 😑",
        "It doesn't work well It's a good app backed by a powerful platform, and it has a few unique features (like webapps that interact with the chat), but it's constantly broken and not well maintained",
        "I like the features this app has. I love that it's cross platform. The performance has improved. But now I'm not getting notifications for messages. I'll check and I missed messages from a few days ago.",
        "I'd like to change my Omlet account ID but It is not possible . Font size is too small and not changeable . Generally speaking , Omlet still is not flexible and user-friendly  in comparison to some other similar apps . Thanks.",
        "I could not even start the app they dnt providing me pin n saying Ur no is invalid just hate this app is dnt want even to give 1 star  0 starts from me",
        "Won't Work What is the point of Omlet chat if you can't chat? I tried going on a chat and it sent me to my tablets home screen."
    ],
    "recentChanges": [
        "- Fix picture support on Android N",
        "- Fix linker warning on Android N",
        "- Link to the new Omlet Arcade"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=mobisocial.omlet&hl=en&gl=us",
    "appId": "mobisocial.omlet"
}