{
    "title": "Lockable",
    "summary": "A smart, full featured, swipe/pin/pattern lockscreen for Android Wear",
    "icon": "//lh6.ggpht.com/_hFScke7WqrSVIjtgbeag4ep08ghKyxeisphZZKgqM8HL9UoAGLMtzHd6dlFw01AkWQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.8,
    "reviews": 125,
    "developer": "Mohammad Adib",
    "developerId": "Mohammad+Adib",
    "developerEmail": "m.a.adib96@gmail.com",
    "developerWebsite": "http://www.mohammadadib.com",
    "developerAddress": "3882 139th Ave SE\nBellevue, WA",
    "updated": "January 23, 2015",
    "version": "11.0",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Introducing LockableLockable is a smart lock screen for Android Wear featuring Swipe, PIN and Pattern unlocks. Lockable features an easy-to-use user interface crafted with impeccable attention to detail, coupled with smart functionality that leaves a truly transparent footprint on your Android Wear experience. It adapts to both rectangular as well as circular screens.Swipe gesturesSwipe down from the center of the top edge to instantly lock your wearable. You can even set it to automatically lock a certain duration after the screen dims. The background can be set to transparent as well, allowing you you view what's underneath on the homescreen without needing to unlock.Smart featuresAs the screen dims, the lock screen will disappear leaving the watchface plain to see. Upon interaction, the lock screen will fade back in allowing you to keep track of time while protecting the information on your wearable at the same time!Lockable Pro for PIN and Pattern unlockThe PIN and Pattern unlock makes Lockable the optimal, secure, and configurable lock screen solution for Android Wear.",
    "descriptionHTML": "<b>Introducing Lockable</b><br>Lockable is a smart lock screen for Android Wear featuring Swipe, PIN and Pattern unlocks. Lockable features an easy-to-use user interface crafted with impeccable attention to detail, coupled with smart functionality that leaves a truly transparent footprint on your Android Wear experience. It adapts to both rectangular as well as circular screens.<br><br><b>Swipe gestures</b><br>Swipe down from the center of the top edge to instantly lock your wearable. You can even set it to automatically lock a certain duration after the screen dims. The background can be set to transparent as well, allowing you you view what&apos;s underneath on the homescreen without needing to unlock.<br><br><b>Smart features</b><br>As the screen dims, the lock screen will disappear leaving the watchface plain to see. Upon interaction, the lock screen will fade back in allowing you to keep track of time while protecting the information on your wearable at the same time!<br><br><b>Lockable Pro</b> for PIN and Pattern unlock<br>The PIN and Pattern unlock makes Lockable the optimal, secure, and configurable lock screen solution for Android Wear.",
    "histogram": {
        "1": 15,
        "2": 10,
        "3": 10,
        "4": 34,
        "5": 56
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.3 and up",
    "androidVersion": "4.3",
    "contentRating": "Unrated",
    "screenshots": [
        "//lh6.ggpht.com/zObOtW2Y_voQXXXkUxRQwZ1KpDio3zCAJKnAF2s0GtzxYl60cMZ2iHIvtlWBqEPJsQk=h310",
        "//lh6.ggpht.com/a_9sHRRRZHhwUqC99AxDJpnUK7czzRRu89dvKDI7wx1dkN6EMpcXcjwz9ByGHJoATR4=h310",
        "//lh6.ggpht.com/EeXj8RaIvATk3FkXWDKCaNTEHhl2xwU47voUdBjNKUDEYhqb4WaxcTLvIJ7j0hpL_A=h310",
        "//lh4.ggpht.com/gepyO66CYqQ1Qt7U-B7FCoh04WT43BIclf6Gr0neUthSv90_0nGahpmLgGyHMN3xB738=h310",
        "//lh5.ggpht.com/Io7C-6Yile1Q9tVmR85FFXauWfcJl-UnBdr5paxkziq0qcQNz0ZxxTQDR0WLIdxAA7M=h310",
        "//lh3.ggpht.com/bX8R4M1H07OUgWpePcLuBXKV4hgqNWNpngmzMDevmSe3tSF-Mb8ZoYm1fGbFShfnvuuD=h310",
        "//lh3.ggpht.com/fKCslDl4OC3lnSVefAMoT4J34xnY2l_o6iH8uoE1WEr7vs0UHJ3h0XgmOiCFulnA0o_P=h310",
        "//lh6.ggpht.com/Hl6WXYNhq4tBzQ2aDco1IooE9LVTmKK8AfcrivdYvbuPOw80BwiwUdngKa3v6RhV3IQ=h310",
        "//lh5.ggpht.com/rbAqNPWfDmnT0IBdB0kwaa9JJsxHP7_11glbMGZla7jsN1-onRv5Hme98YRMgG3buXA=h310",
        "//lh3.ggpht.com/tPgZZkKaWjJoX_N8PaZwxMEb-HmqugoUP7mdS-VkTuEUsCtPTU-wkq6GDa1FyaxsAcU=h310",
        "//lh5.ggpht.com/DzaUlbO45GOGUykjcd4ng07riP9DEC_3dSX5X4g_isXpMNy9sfCMh-MFG6PAbH-HyPk=h310"
    ],
    "comments": [
        "I kept activating my smartwatch when I crossed my arms and messing up the watchface or opening an app. With Lockable, I now don't have to worry about touching the screen unintentionally any more.  The only problem that I have, and that is the reason why I don't give it 5 stars, is because the Transparency option doesn't work on my LG Urbane 2. It makes my screen glow when is locked, and it's not transparent. I can't see my watchface behind the lock screen.  Otherwise it's a great app. I believe that this is functionality that should be part of Android Wear.",
        "Almost perfect! The reason I installed Lockable is because I cross my arms a lot without sleeves. It messes up my watch every time, but with lockable it doesn't! I would suggest one thing tho, make an invisible lock screen, so I can see the time better when just touching the screen, that would be even better! (Same as the \"Swipe\" lock, but without the dots and lock icon)",
        "Doesn\"t work on my Moto 360 Y just Installed and bought different lock options and only swipe which is free works!!!  Developer,  please tell me what I'm doing wrong.  Transparency doesn't work also. UPDATE : Got it to work,  only transparency issue exists.",
        "The best lock out here! Just need a tweak, is to let refuse accept calls because code gets over a call on wear.",
        "No lock on restart Doesn't  lock after restarting the watch.. Or am I missing something? Other than that perfect.",
        "I like the app.   It prevents some accidental touches.   Might be nice to have it disabled while charging though."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=mohammad.adib.wlock&hl=en&gl=us",
    "appId": "mohammad.adib.wlock"
}