{
    "title": "SMS Parking",
    "summary": "Pay for parking with ease",
    "icon": "//lh3.googleusercontent.com/og6LdPi_QaLh3c0eX1OvmOJ_-myUwI2XCwL-Vxx9v1jp8oBk1XiJx_D2k5Qs_VaAwO_n=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4.5,
    "reviews": 859,
    "developer": "NACHEV Development",
    "developerId": "NACHEV+Development",
    "developerEmail": "support@smsparkingapp.com",
    "developerWebsite": "https://smsparkingapp.com",
    "developerAddress": "Mohnweg 2\n50259 Pulheim\nGermany",
    "updated": "January 18, 2018",
    "version": "Varies with device",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "size": "Varies with device",
    "description": "SMS Parking is an app that allows you to pay public parking easily with features like detecting your location and sending the appropriate short text message (SMS) to the corresponding service number.MULTIPLE CAR PROFILESCreate a profile for each one of your cars and send parking messages with a single tap. Additionally, you can schedule sending a SMS at a specified time (up to 24h ahead).AUTOMATIC ZONE SUGGESTIONAvailable parking zones are suggested automatically, based on your location. Parking position is detected and displayed on the map in the application along with the nearby parking zone bounds. ***† OVER-THE-AIR UPDATESMore than 500 parking zones in over 100 cities across Europe and counting. Automatic parking service message recognition and zones with sessions (Start/Stop) are supported in selected cities. **CUSTOM PARKING ZONESYour city is not available? Define your own custom parking zones, city and message format, or drop us a line and we will add it for you!DUAL-SIM SUPPORTSelect from which SIM card to send messages on dual SIM devices. The app will remember your preference for each one of your cars. (Dual-SIM support requires Android 5.1)SUPPORT FOR ANDROID WEARSelect car profiles, send parking SMS messages, check confirmations and extend remaining time directly from your smartwatch ‡Stay in touch! Follow us on your preferred social media to get the latest news: https://smsparkingapp.com/#connect Eager about the latest features? Become a beta tester and get early access to the new stuff: https://goo.gl/wRL75O Need help and support? If you experience problems with the app, before rating it low, please contact us, so we could try to help you. * Sending a SMS message charges user's mobile plan with the price of 1 hour parking (or other period, depending on the parking service terms) in the respective paid zone plus the price of the SMS message according to user's current mobile service payment plan.** Available for selected cities only. *** Currently supporting cities in Belarus (Minsk), Bosna and Herzegovina, Bulgaria, Croatia (Hrvatska), Czech Republic (Česko), Hungary (Magyarország), Macedonia (FYROM) (Македонија), Montenegro (Црна Гора/Crna Gora), Romania (România), Russia (Россия), Serbia (Србија/Srbija) and Slovakia (Slovensko). † Requires GPS (fine) location to work properly. ‡ Requires Android Wear 5.0+ smartwatch.",
    "descriptionHTML": "SMS Parking is an app that allows you to pay public parking easily with features like detecting your location and sending the appropriate short text message (SMS) to the corresponding service number.<br><br><b>MULTIPLE CAR PROFILES</b><br>Create a profile for each one of your cars and send parking messages with a single tap. Additionally, you can schedule sending a SMS at a specified time (up to 24h ahead).<br><br><b>AUTOMATIC ZONE SUGGESTION</b><br>Available parking zones are suggested automatically, based on your location. Parking position is detected and displayed on the map in the application along with the nearby parking zone bounds. ***&#x2020; <br><br><b>OVER-THE-AIR UPDATES</b><br>More than 500 parking zones in over 100 cities across Europe and counting. Automatic parking service message recognition and zones with sessions (Start/Stop) are supported in selected cities. **<br><br><b>CUSTOM PARKING ZONES</b><br>Your city is not available? Define your own custom parking zones, city and message format, or drop us a line and we will add it for you!<br><br><b>DUAL-SIM SUPPORT</b><br>Select from which SIM card to send messages on dual SIM devices. The app will remember your preference for each one of your cars. (Dual-SIM support requires Android 5.1)<br><br><b>SUPPORT FOR ANDROID WEAR</b><br>Select car profiles, send parking SMS messages, check confirmations and extend remaining time directly from your smartwatch &#x2021;<br><br>Stay in touch! Follow us on your preferred social media to get the latest news: https://smsparkingapp.com/#connect <br><br>Eager about the latest features? Become a beta tester and get early access to the new stuff: https://goo.gl/wRL75O <br><br>Need help and support? If you experience problems with the app, before rating it low, please contact us, so we could try to help you. <br><br><br>* Sending a SMS message charges user&apos;s mobile plan with the price of 1 hour parking (or other period, depending on the parking service terms) in the respective paid zone plus the price of the SMS message according to user&apos;s current mobile service payment plan.<br>** Available for selected cities only. <br>*** Currently supporting cities in Belarus (Minsk), Bosna and Herzegovina, Bulgaria, Croatia (Hrvatska), Czech Republic (&#x10C;esko), Hungary (Magyarorsz&#xE1;g), Macedonia (FYROM) (&#x41C;&#x430;&#x43A;&#x435;&#x434;&#x43E;&#x43D;&#x438;&#x458;&#x430;), Montenegro (&#x426;&#x440;&#x43D;&#x430; &#x413;&#x43E;&#x440;&#x430;/Crna Gora), Romania (Rom&#xE2;nia), Russia (&#x420;&#x43E;&#x441;&#x441;&#x438;&#x44F;), Serbia (&#x421;&#x440;&#x431;&#x438;&#x458;&#x430;/Srbija) and Slovakia (Slovensko). <br>&#x2020; Requires GPS (fine) location to work properly. <br>&#x2021; Requires Android Wear 5.0+ smartwatch.<br>",
    "histogram": {
        "1": 46,
        "2": 15,
        "3": 47,
        "4": 95,
        "5": 656
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/18G4ekh2oXj8vuA9XYnEu6M3pzvSN5P44Mqcp5LUO5airr4anM37RH4pYqfgAfsw_dM=h310",
        "//lh3.googleusercontent.com/8CVLZMg-0MqBKtLGMgxOZUumVWts5wLC2tQr9I5F7iPFO8nx9X1_ZLIAm3IPT5a7kwo=h310",
        "//lh3.googleusercontent.com/-3AZDeFmwqTXtm0Aw9MD-lpqRuOmfi7O2gCzbyBV3NkgPO3ELTgoYA7pvNW5-vgZvlc=h310",
        "//lh3.googleusercontent.com/MT9XlFlT-jgqnGiaoajWFXfOW6A251sc1O4O88xkOaClc9KDBsJn3dFs_MvRcqMc7yU=h310",
        "//lh3.googleusercontent.com/B5YTsToVeEEg3rUn3l000iLRFLoG-WJ4Wl9lr7crhEKx3cimY265dgS8V8H1U6HBt1Bh=h310",
        "//lh3.googleusercontent.com/b64hzpn3UmpptvbdUpZfCz6_bMnO2cJAFeOKmdX5nizc6vvR8uKdNX7zaA6JukIA16I=h310",
        "//lh3.googleusercontent.com/TiOwkF22yGbBrVRBFcJzGpPzhP7ieoQt0E7tVz7pj48BuihS_zq8Qv_oCKbF_EPqY88=h310",
        "//lh3.googleusercontent.com/b8p90xQityvjz-xJWEo8cUJZyGQPTEcvdQ84DJq_1vOS0-MfJWxnQFvNvdfe-1JGxVU=h310",
        "//lh3.googleusercontent.com/uEH6m7yY8XvCZ_Ft5yZLcmKd5ANs3paYBERoGvKAzBPKWAzSCQSZGTZXF5wBCxs8z64=h310",
        "//lh3.googleusercontent.com/HWrA5SHyA5Sh2JbfgbmJLj_xepF2zDYxqwV-pI62hszov-9tqg5W4AU0bsGkdoOz9Jwr=h310",
        "//lh3.googleusercontent.com/iiAt7ncnrdBeToiUCIGXihd7jyXlHFwfLpWFqP4SsxbHr3b7tyN4Noxit_p-0WHPxQU=h310",
        "//lh3.googleusercontent.com/-9cNnUYJDc598M3ceHTIiBBbBIJjInJkBbqEcOH5aHmaHMf_P57zqhOlYEwNvQ5a81U9=h310"
    ],
    "comments": [
        "Odlicna, ekspresno dodato Kraljevo",
        "След ъпдейт спря да ми показва зоните на картата, местоположението работи, но на картата за всички градове не се показват вече къде се намират зоните",
        "P10 Plus dual sim. Няма опция за избор през коя карта да праща смс!",
        "Отлична работа е свършил екипа създал това приложение. Благодаря ви.",
        "Много добро приложение. Супер полезно и лесно за употреба.",
        "При изпращане на смс за паркиране на друг автомобил (невъведен като профил) апликацията автоматично възприема, че е за някой от профилите и предрага (удобно) да бъде продължено времето, но за нъведен профил, а не за новера на кората, която е различна от въведените. Може би тряцна да предложи създаване на нов профил или въобще да не се \"намесва\"?"
    ],
    "recentChanges": [
        "* Supports switching of parking zones numbers based on selected SIM card in Hungary",
        "* Improves handling of location updates",
        "* Allows adding user parking zones from the map directly",
        "* Improves user zone creation flow",
        "* Minor UI improvements and bugfixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=mtel.htc.contest.parking.app&hl=en&gl=us",
    "appId": "mtel.htc.contest.parking.app"
}