{
    "title": "ING Smart Banking",
    "summary": "Easy-to-use app for managing private and business accounts on your smartphone",
    "icon": "//lh3.googleusercontent.com/PKgq43HlPDHgGOE0y7pKDjfIi99gt68gjinjzKNeeKwLtqoQHe6dDX3MNhraKvgYl7U=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 9084,
    "developer": "ING Belgium NV",
    "developerId": "ING+Belgium+NV",
    "developerEmail": "info@ing.be",
    "developerWebsite": "http://www.ing.be/androidphoneapp",
    "developerAddress": "Marnixlaan 24, 1000 Brussels, Belgium",
    "updated": "November 7, 2017",
    "version": "8.4",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "ING Smart Banking for smartphoneManage your private and business accounts easily and securely via your smartphone with this banking app from ING Belgium.How does it work? Discover the full functionality of the app via our demo video using fictive data. Not an ING customer yet? Open your free current account directly via our app.Logging in for the first time? Create a profile using your ING Card Reader, choose a 6-digit profile code and you are ready to take advantage of all of our app’s features. Your profile code is all you need to log in and sign your transactions.The app will ask your permission to access certain data on your smartphone for very specific purposes:• Access to the photos, media and files on your smartphone so you can find a branch on the map or upload a profile picture.• Access to your photo and video camera, so you scan QR codes when making Bancontact payments.• Access to your calling function, to allow the app to identify your device for your security when using Bancontact payments.• Access to your GPS, to help you find and/or make an appointment at your nearest branch. Main features• Check the balance and transaction history for all your current accounts and savings accounts (including those for which you have a mandate), credit cards and investments.• Rename your accounts in order to identify them more easily and have your account number sent to any e-mail address. • Make transactions between your current or savings accounts, to beneficiaries saved in Home'Bank or Business’Bank or to any other Belgian account. • Check your payments with a future execution date as well as the upcoming payment of your standing orders. • Enter and sign payments requiring multiple signatures. • Find your closest ING branch and make an appointment straightaway with one of our employees.• Apply for a savings account, a credit card or a pension savings plan via our app.• Pay for your purchases or reimburse friends via QR code using the built-in Bancontact/Mister Cash module.",
    "descriptionHTML": "ING Smart Banking for smartphone<br><br>Manage your private and business accounts easily and securely via your smartphone with this banking app from ING Belgium.<br><br>How does it work? <br>Discover the full functionality of the app via our demo video using fictive data. Not an ING customer yet? Open your free current account directly via our app.<br><br>Logging in for the first time? Create a profile using your ING Card Reader, choose a 6-digit profile code and you are ready to take advantage of all of our app&#x2019;s features. Your profile code is all you need to log in and sign your transactions.<br><br>The app will ask your permission to access certain data on your smartphone for very specific purposes:<br>&#x2022; Access to the photos, media and files on your smartphone so you can find a branch on the map or upload a profile picture.<br>&#x2022; Access to your photo and video camera, so you scan QR codes when making Bancontact payments.<br>&#x2022; Access to your calling function, to allow the app to identify your device for your security when using Bancontact payments.<br>&#x2022; Access to your GPS, to help you find and/or make an appointment at your nearest branch. <br><br>Main features<br>&#x2022; Check the balance and transaction history for all your current accounts and savings accounts (including those for which you have a mandate), credit cards and investments.<br>&#x2022; Rename your accounts in order to identify them more easily and have your account number sent to any e-mail address. <br>&#x2022; Make transactions between your current or savings accounts, to beneficiaries saved in Home&apos;Bank or Business&#x2019;Bank or to any other Belgian account. <br>&#x2022; Check your payments with a future execution date as well as the upcoming payment of your standing orders. <br>&#x2022; Enter and sign payments requiring multiple signatures. <br>&#x2022; Find your closest ING branch and make an appointment straightaway with one of our employees.<br>&#x2022; Apply for a savings account, a credit card or a pension savings plan via our app.<br>&#x2022; Pay for your purchases or reimburse friends via QR code using the built-in Bancontact/Mister Cash module.",
    "histogram": {
        "1": 700,
        "2": 394,
        "3": 770,
        "4": 2243,
        "5": 4977
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/UaTuBsxDTVyjyO4afogpLu4EN9LHyrVmQf-JsUecMD__8URtNuo5HAyYICP2GAAy6Hk=h310",
        "//lh3.googleusercontent.com/Dxkq62ehwCa91z3UtrbpAHFh1qR5AOzlImJSY_Y1dPAUBW3IqSM0ZoBsDSF0hrz--U1U=h310",
        "//lh3.googleusercontent.com/kJIFrMWMkpUAMpp1tYAkLb6ZwNwMdNAoHfU84iHgkg_NZGQlvi5thITvkwJVVT9E3SU=h310",
        "//lh3.googleusercontent.com/CTUOPG-AE4mjpDJVSWsscPzzEM5Kz_O4H3FLQ2u5aNQJtgdAzDL4ybSuDeECtzIuxbc=h310",
        "//lh3.googleusercontent.com/mcaabUV5_1J5tZVGhzNfMHLQjUujlHE1mvkGHuJu9LzsWGQ-K7a7htNztRA14UDE_CPE=h310",
        "//lh3.googleusercontent.com/z1Oo3Z6TqZnPFUtpWEAKKWVrEYPZC2yd4c-_uuA9Z_QltGPQ1Q9-4e7aO9LYSof5X_k=h310",
        "//lh3.googleusercontent.com/_XXjyuETL8oYS2v7VgVpDuC0xCppd9ox1MdYdCfAqalo_6ERjGZ9NLjVsdZFE6GTA-E=h310"
    ],
    "comments": [
        "I am having issues since the last update. I can no longer log in and prior to that I wasn't even able to confirm any transfers. It worked very well until then. Is there a fix for this yet?  Edit - turns out it was another apps bluescreen and turning it off fixes it!",
        "Good app. I love the integrated bancontact option which allows you to transfer money to other people, even outside info bank, although it sometimes takes long time to open it in the app. But as noted by others below, if you have screen dimmer active, such as Twilight, you will not be able to log in. You have to disable it manually and then restart the app. I wonder why, if it's for security reasons, or if it's a bug. In any case, it's annoying.",
        "Nice app, but since last update some issues. Some buttons seems to be frozen, like button to confirm transfer or beneficiary. Few days later it worked again, now it's again broken. What can be the cause ?",
        "It's the second time when this app doesn't work on my phone. In a month. It will work again only if I restore my phone to factory settings. This is not nice.  And I can't find an explanation for that.",
        "Pretty handy app. Been using it for years, and it got notably better throughout the last year or so. Kudos to the developers.  One tip: if you are using a screen dimmer app, you might run into problems tapping buttons, notably the login. The issue goes away if you pause any such app while you use smart banking.",
        "I love the app and use it daily. The fingerprint log-in disappeared, however, since my phone's OS was updated to Oreo. I read in the description of the latest app update that the problem was fixed, but that doesn't seem to be the case."
    ],
    "recentChanges": [
        "- The fingerprint ID issue with Android 8.0 Oreo has been resolved.",
        "- We are expanding the settings control. You will soon be able to manage all your bank settings in ING Smart Banking.",
        "- Keep an eye on your assets in “My investments” and watch out for future improvements in the app.",
        "- Various general improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=MyING.be&hl=en&gl=us",
    "appId": "MyING.be"
}