{
    "title": "Wear Air Cam",
    "summary": "Wear Air Cam sends your phone or tablet camera&#39;s view to Android Wear devices.",
    "icon": "//lh5.ggpht.com/n4FTY70ssvywxQXkc7C1SQcu7T38oqoomUKVbWsZCQlOybTlQ66BReoTuPqQfJVB_w=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 500,
    "maxInstalls": 1000,
    "score": 3.7,
    "reviews": 19,
    "developer": "Starnode",
    "developerId": "Starnode",
    "developerEmail": "vox@starnode.net",
    "developerWebsite": "http://www.starnode.net/",
    "developerAddress": "36 rue Rivay\n92300 LEVALLOIS-PERRET\nFRANCE",
    "updated": "May 10, 2015",
    "version": "1.2.2",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "description": "Wear Air Cam is an Android Wear application. With Wear Air Cam, you can remotely control your phone or tablet's camera and broadcast it to any of your Android Wear powered devices.Usage examples:• Baby care• House security• Remote control of your phone's camera (include yourself in pictures and group photos!)• Look in tight spaces (like behind furnitures, under the sink, in your car's engine, ...)Feature list:• See your phone or tablet camera as a video stream on your Wear device.• Take photos with a single tap on your Wear device screen. You can choose the size of the pictures for both back and front-facing cameras.• Record videos. Long press on your Wear device screen to start recording. A timer will let you know for how long you've been recording so far. Long press again to end recording.• Record your phone/tablet's microphone. Recording is also remotely triggered from your Android Wear device.• Control your phone/tablet's camera hardware from your Wear device (switch between back and front camera, zoom in or out and change flash mode.)• Remotely start video streaming from your Wear device. This will work if your phone or tablet is turned off, but only if it has been allowed in the device settings. If the display is turned on, the capture will shows itself in a floating window that does not cover all the display.• Choose between broadcasting the whole (scaled down) picture, or a cropped portion of it to benefit the most of your Wear device's screen real estate.• Auto-adaptive video stream to use the most of the Bluetooth connection between your devices• Many other settings like video quality, compression algorithm, auto-focus, picture resolution, real-time transmission status, ...Wear Air Cam has been fully tested with the following Android Wear powered devices : Motorola Moto 360 & LG G Watch, but is intended to work with all kinds of devices.Have fun with Wear Air Cam, and let us know what do you think of it, and what you would like to see in the future !",
    "descriptionHTML": "Wear Air Cam is an Android Wear application. With Wear Air Cam, you can remotely control your phone or tablet&apos;s camera and broadcast it to any of your Android Wear powered devices.<br><br>Usage examples:<br><br>&#x2022; Baby care<br>&#x2022; House security<br>&#x2022; Remote control of your phone&apos;s camera (include yourself in pictures and group photos!)<br>&#x2022; Look in tight spaces (like behind furnitures, under the sink, in your car&apos;s engine, ...)<br><br>Feature list:<br><br>&#x2022; See your phone or tablet camera as a video stream on your Wear device.<br><br>&#x2022; Take photos with a single tap on your Wear device screen. You can choose the size of the pictures for both back and front-facing cameras.<br><br>&#x2022; Record videos. Long press on your Wear device screen to start recording. A timer will let you know for how long you&apos;ve been recording so far. Long press again to end recording.<br><br>&#x2022; Record your phone/tablet&apos;s microphone. Recording is also remotely triggered from your Android Wear device.<br><br>&#x2022; Control your phone/tablet&apos;s camera hardware from your Wear device (switch between back and front camera, zoom in or out and change flash mode.)<br><br>&#x2022; Remotely start video streaming from your Wear device. This will work if your phone or tablet is turned off, but only if it has been allowed in the device settings. If the display is turned on, the capture will shows itself in a floating window that does not cover all the display.<br><br>&#x2022; Choose between broadcasting the whole (scaled down) picture, or a cropped portion of it to benefit the most of your Wear device&apos;s screen real estate.<br><br>&#x2022; Auto-adaptive video stream to use the most of the Bluetooth connection between your devices<br><br>&#x2022; Many other settings like video quality, compression algorithm, auto-focus, picture resolution, real-time transmission status, ...<br><br>Wear Air Cam has been fully tested with the following Android Wear powered devices : Motorola Moto 360 &amp; LG G Watch, but is intended to work with all kinds of devices.<br><br>Have fun with Wear Air Cam, and let us know what do you think of it, and what you would like to see in the future !",
    "histogram": {
        "1": 3,
        "2": 1,
        "3": 3,
        "4": 3,
        "5": 9
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/AAbDTJnx8U2uC5RrlODIgQSC0bYZCVMlECSpb7Ukug49c76phGDRw9VQQZtsiOk07s4_=h310",
        "//lh4.ggpht.com/Nj1CfbUZlItAGsKfdqEElDN2oiVOyFSxNEY_aY9FYon7d95LWzvs_StsjswZqfg4Y9dv=h310",
        "//lh5.ggpht.com/Anydi-q1ckwTIf3JFTsj2VdOoUEejX1IV64ze6v5ITq634Zt_YrbYT2AEBTfIDAadSw=h310",
        "//lh4.ggpht.com/pvmUGGoSdHMI4LW3Vx8GM6UTIvZDvdyprK4iXyXGCUQmDnjBvqzlm-hrOPPY_ujAPWU=h310",
        "//lh5.ggpht.com/Ya0AbMDobCgXgaeQ3-mJ84kJyeHI2qtArLR9-PuP9mq6ax0YtN_Y58e_env6Q-eXFj0=h310",
        "//lh5.ggpht.com/IqsgnJ8h-vr6LC0voiVQJcmlxo5e5ltyxdKKmHQ2tEf6K_ScwzOqMOYXu56mFtYzJnM=h310",
        "//lh5.ggpht.com/kfW0_DPL9hpjhof_ar8vL7zAKBqveN--DzN8iKVllaShOH5oNCp_SW3cmMCslLLTLl8=h310",
        "//lh3.ggpht.com/P_QpEnBo54qDODWFULuMnZF7P6Tfz57HgFWBPKBE61AKH90oOPg-hgLcjWX63gOabQ=h310",
        "//lh6.ggpht.com/u6aK63SunASvHRwtTDtA0rtzJ2ZgnSXUSQmtPJb7ylajTXjzPQFRbACOQehiRfwFvWE=h310",
        "//lh4.ggpht.com/c2IJ9miVbpqJ8geY6E-3BMnp-iWuM7hhu00PzWob7j-fWnKwTy4cw_Ehh-1EU8DTJ-U=h310",
        "//lh5.ggpht.com/UI1KpvFmaSe6soMDltGknO160UOfQ6Zr-ke7-YRlMqxnpJM21uUEdry2Vm4b8I2PoJg=h310"
    ],
    "comments": [
        "Needs something Pretty good app but it needs an option to save to a photo gallery.  Would be especially useful for GPS tagging when using as an evidence collection tool.  Also a big laggy at times and fails to start.  Otherwise, phenomenal app. 5 stars if these can be changed",
        "Dislike Can't use watch to start up the app when screen is locked,  plus it disconnects very often,  (auto rotate - disconnected)  after its disconnected you have to manually connect it on the phone every time. I would appreciate the feedback  please and thank you!",
        "Had to edit my review as I don't feel I gave sufficient reason why this is 'serious innovation'. For one, I dont need to unlock my phone. Can start filming or record audio purely on watch. Don't even need to wake the screen (M2 and Z3 (L and MM)). Filming quality is perfect.Use this with a Z3 and SW3 and the feedback quality to watch is customisable, so can cater to every environment. Photo taking is superior to even Sony camera bridge app. No ads, no spam, no privacy issues. This is pure genious. 10 stars.  Can you pretty please update app to support Oreo. Can film from watch and take photos (Wear 1.5 watch), but app on phone crashes. Also, donate link please. You deserve it!",
        "New version 1.2.2 is not working (LG G Watch R with LG G3) The new version does not show any picture over the watch. It crashes each time I try use the cropping tool.",
        "It took awhile to figure it out!  Are there plans to allow saving to SD card?",
        "Can't ask for more Works great with moto 360 and nexus 6"
    ],
    "recentChanges": [
        "Version 1.2.2:",
        "- Improved Android Lollipop compatibility",
        "- Corrected a few crashes",
        "- Corrected stalled video (after a few seconds) bug that appeared on some devices",
        "- Performance improvements",
        "Version 1.2.1:",
        "- Improved notifications",
        "- Control image cropping from watch",
        "- Bug and crash fixes",
        "Version 1.2:",
        "- new: video recording",
        "- lots of bug fixed",
        "Version 1.1.3:",
        "- added flash torch mode",
        "- added window support for Samsung devices with the Multi Window feature"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.starnode.wear.AirCam.prod&hl=en&gl=us",
    "appId": "net.starnode.wear.AirCam.prod"
}