{
    "title": "Meetic – Tchattez et rencontrez des célibataires",
    "summary": "Swipez profiles, chat and meet singles in your area",
    "icon": "//lh3.googleusercontent.com/wzRmvVkGHIcesj89tTVyAfmrWXyChlsxDznUpWX__aoTTZup6zvvKKAkzfi6Yexz6lA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.4,
    "reviews": 54111,
    "developer": "Meetic SA",
    "developerId": "Meetic+SA",
    "developerEmail": "support.mobile@meetic.fr",
    "developerWebsite": "http://touch.meetic.fr",
    "developerAddress": "6 rue Auber 75009 Paris",
    "updated": "February 6, 2018",
    "version": "Varies with device",
    "genre": "Dating",
    "genreId": "DATING",
    "size": "Varies with device",
    "description": "Découvrez nos events de dating autour de vous, faites des rencontres avec de nouvelles personnes et entamer le dialogue avec elles. Montrez votre intérêt pour les profils avec un swipe, engagez le tchat et trouvez des célibataires à proximité. Explorez l’univers du dating en ligne, faites-vous de nouveaux amis et de nouvelles rencontres grâce à vos matchs. Rencontrer des célibataires sur Meetic pourrait bien être le début d’une nouvelle histoire d’amour et de couple.Trouvez des events de dating pour rencontrer des célibataires ! Que vous cherchiez à vous faire des amis, à trouver l’amour, débuter une nouvelle relation de couple avec un homme ou une femme célibataire, vous lancer dans le chat en ligne et rencontrer des célibataires, Meetic vous accompagne pour cette belle aventure. Prenez quelques minutes pour vous inscrire et commencez à chercher un partenaire dès aujourd’hui !Faites des rencontres et commencez à sortir avec des hommes et des femmes célibataires en un seul clic ! Découvrez le dating en ligne avec Meetic1.\tTrouvez des célibataires à rencontrer autour de vous – débutez une nouvelle relation grâce à un seul match avec un célibataire ! 2.\tSwipez des profils, engagez le tchat et le flirt comme un pro avec vos matchs – parcourez des profils de célibataires et rencontrez-les par la même occasion.3.\tDécouvrez des events de dating proches de chez vous pour discuter et sortir avec des célibataires dans un environnement agréable et amical.Découvrez le chat et le flirt en ligne sous un nouveau jour. Trouvez des célibataires, ayez l’occasion de flirter avec des personnes attirantes et ne soyez plus lassé du dating. Trouvez des events de dating autour de vous, explorez la piste d’une nouvelle relation de couple et pratiquez le flirt différemment. Rejoignez le dating en ligne avec Meetic, la version actuelle du “dispo pour sortir boire un verre ce soir ?”, annonce le début d’une histoire d’amour.•\tFaites un swipe sur les profils, trouvez des events de dating locaux et organisez par la même occasion une rencontre avec un célibataire.•\tVous aimez particulièrement le profil d’un membre célibataire? Envoyez un clin d’œil aux hommes et aux femmes célibataires dont vous rêvez pour ainsi flirter et trouver l’amour.•\tDécouvrez des profils de dating, mettez à jour votre profil de membre et publiez-y des photos pour trouver l’amour.Meetic fait partie du groupe Match, dont font également partie DisonsDemain. Flirter avec des célibataires en tchat et commencer une nouvelle histoire d’amour est une véritable aventure avec Meetic ! Profitez du chat en ligne avec de nouveaux amis et ayez l’occasion de sortir avec des célibataires à des events de dating locaux. Nous passons notre temps à mettre des couples en relation pour que vous n’ayez pas à le faire. Envoyez et recevez des messages sur l’application et souscrivez à match.com pour avoir accès à des fonctions additionnelles. Et, si vous cherchez à rencontrer des hommes et des femmes célibataires plus âgés, faites un tour sur DisonsDemain, notre application de rencontre pour les 50 ans et plus ! L’inscription et la navigation sur les profils des célibataires sont gratuites. Pour accéder à des fonctions additionnelles de dating, comme discuter par message avec vos matchs, vous devrez souscrire à match.com. Si vous avez déjà souscrit un abonnement au site web de match.com, téléchargez simplement l’application de rencontre et connectez-vous pour accéder aux fonctions de Meetic. Si vous n’avez pas d’abonnement au site web, vous pouvez y souscrire via l’application match.com en utilisant votre carte bancaire. Vous aurez ainsi accès à match.com depuis tous les appareils que vous voulez. Les mêmes conditions s’appliquent à DisonsDemain, le site de rencontre pour les 50 ans et plus.Notre service client est disponible pour vous aider et vous conseiller : https://www.meetic.fr/faq/#!home",
    "descriptionHTML": "D&#xE9;couvrez nos events de dating autour de vous, faites des rencontres avec de nouvelles personnes et entamer le dialogue avec elles. Montrez votre int&#xE9;r&#xEA;t pour les profils avec un swipe, engagez le tchat et trouvez des c&#xE9;libataires &#xE0; proximit&#xE9;. Explorez l&#x2019;univers du dating en ligne, faites-vous de nouveaux amis et de nouvelles rencontres gr&#xE2;ce &#xE0; vos matchs. Rencontrer des c&#xE9;libataires sur Meetic pourrait bien &#xEA;tre le d&#xE9;but d&#x2019;une nouvelle histoire d&#x2019;amour et de couple.<br><br>Trouvez des events de dating pour rencontrer des c&#xE9;libataires ! Que vous cherchiez &#xE0; vous faire des amis, &#xE0; trouver l&#x2019;amour, d&#xE9;buter une nouvelle relation de couple avec un homme ou une femme c&#xE9;libataire, vous lancer dans le chat en ligne et rencontrer des c&#xE9;libataires, Meetic vous accompagne pour cette belle aventure. Prenez quelques minutes pour vous inscrire et commencez &#xE0; chercher un partenaire d&#xE8;s aujourd&#x2019;hui !<br><br>Faites des rencontres et commencez &#xE0; sortir avec des hommes et des femmes c&#xE9;libataires en un seul clic ! <br><br>D&#xE9;couvrez le dating en ligne avec Meetic<br>1.\tTrouvez des c&#xE9;libataires &#xE0; rencontrer autour de vous &#x2013; d&#xE9;butez une nouvelle relation gr&#xE2;ce &#xE0; un seul match avec un c&#xE9;libataire ! <br>2.\tSwipez des profils, engagez le tchat et le flirt comme un pro avec vos matchs &#x2013; parcourez des profils de c&#xE9;libataires et rencontrez-les par la m&#xEA;me occasion.<br>3.\tD&#xE9;couvrez des events de dating proches de chez vous pour discuter et sortir avec des c&#xE9;libataires dans un environnement agr&#xE9;able et amical.<br><br>D&#xE9;couvrez le chat et le flirt en ligne sous un nouveau jour. Trouvez des c&#xE9;libataires, ayez l&#x2019;occasion de flirter avec des personnes attirantes et ne soyez plus lass&#xE9; du dating. Trouvez des events de dating autour de vous, explorez la piste d&#x2019;une nouvelle relation de couple et pratiquez le flirt diff&#xE9;remment. Rejoignez le dating en ligne avec Meetic, la version actuelle du &#x201C;dispo pour sortir boire un verre ce soir ?&#x201D;, annonce le d&#xE9;but d&#x2019;une histoire d&#x2019;amour.<br><br>&#x2022;\tFaites un swipe sur les profils, trouvez des events de dating locaux et organisez par la m&#xEA;me occasion une rencontre avec un c&#xE9;libataire.<br>&#x2022;\tVous aimez particuli&#xE8;rement le profil d&#x2019;un membre c&#xE9;libataire? Envoyez un clin d&#x2019;&#x153;il aux hommes et aux femmes c&#xE9;libataires dont vous r&#xEA;vez pour ainsi flirter et trouver l&#x2019;amour.<br>&#x2022;\tD&#xE9;couvrez des profils de dating, mettez &#xE0; jour votre profil de membre et publiez-y des photos pour trouver l&#x2019;amour.<br><br>Meetic fait partie du groupe Match, dont font &#xE9;galement partie DisonsDemain. <br><br>Flirter avec des c&#xE9;libataires en tchat et commencer une nouvelle histoire d&#x2019;amour est une v&#xE9;ritable aventure avec Meetic ! Profitez du chat en ligne avec de nouveaux amis et ayez l&#x2019;occasion de sortir avec des c&#xE9;libataires &#xE0; des events de dating locaux. Nous passons notre temps &#xE0; mettre des couples en relation pour que vous n&#x2019;ayez pas &#xE0; le faire. Envoyez et recevez des messages sur l&#x2019;application et souscrivez &#xE0; match.com pour avoir acc&#xE8;s &#xE0; des fonctions additionnelles. Et, si vous cherchez &#xE0; rencontrer des hommes et des femmes c&#xE9;libataires plus &#xE2;g&#xE9;s, faites un tour sur DisonsDemain, notre application de rencontre pour les 50 ans et plus ! <br><br>L&#x2019;inscription et la navigation sur les profils des c&#xE9;libataires sont gratuites. Pour acc&#xE9;der &#xE0; des fonctions additionnelles de dating, comme discuter par message avec vos matchs, vous devrez souscrire &#xE0; match.com. Si vous avez d&#xE9;j&#xE0; souscrit un abonnement au site web de match.com, t&#xE9;l&#xE9;chargez simplement l&#x2019;application de rencontre et connectez-vous pour acc&#xE9;der aux fonctions de Meetic. Si vous n&#x2019;avez pas d&#x2019;abonnement au site web, vous pouvez y souscrire via l&#x2019;application match.com en utilisant votre carte bancaire. Vous aurez ainsi acc&#xE8;s &#xE0; match.com depuis tous les appareils que vous voulez. <br>Les m&#xEA;mes conditions s&#x2019;appliquent &#xE0; DisonsDemain, le site de rencontre pour les 50 ans et plus.<br><br>Notre service client est disponible pour vous aider et vous conseiller : <br>https://www.meetic.fr/faq/#!home",
    "histogram": {
        "1": 11975,
        "2": 3924,
        "3": 7216,
        "4": 11140,
        "5": 19856
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/_AbWmXk9q4A-dCGyK2CmLnVsJuicAF0XYvw_Zt6rJs0Y8mK7MCGYXB-L9C02TtJogx07=h310",
        "//lh3.googleusercontent.com/NcHj3INHlcxuLnuS3irJb6Yroa6fFlhPqDz0yMk2iheGeS56RhXPU82hkvcYqcO6mCQ=h310",
        "//lh3.googleusercontent.com/OmyFbY1XspCU-xTb-yovsfKjDaFGGrsIpAaWfFvbSiqL2qU5GxyVsE6kdjHFQc-Lww=h310",
        "//lh3.googleusercontent.com/AypSUPk2VFzvD2ZkEwMxapalJOCHG8J9RsC7xIgBmyEBemJvjFnZYqzjNv7RMpDJhLw=h310",
        "//lh3.googleusercontent.com/jWZP-Sv1l5waCdggDvUgTg3saEhsXxZDD46aEtQ79MXFUA1nE1RXu4mzEKlGK0O4Feg=h310"
    ],
    "video": "https://www.youtube.com/embed/yYCu7omZbuk",
    "comments": [
        "Hopefully I can find some new friends with English speaking 'coz my french is not good",
        "Eelll beaucoup trop chère et en plus les paiements sont renouvelé automatiquement. Franchement ils abusent",
        "Well the app is good but why they cant reply your messages or even read? Though i payed , atleast let them read or reply you .... Pls improve that... Or else its pointless paying for something that you cant even get a single reply .. Or even just reading the message. Hoping for improvement",
        "Need to be able to message without paying other wise it's absolutely pointless. And change the language please",
        "The app I downloaded has everything written in French. I am in Spain and it should either be in Spanish, or let me choose languages. English would be a good option. I don't get that.",
        "L'app è molto migliorata, per l'utilizzo da cellulare. Forse aggiungerei la possibilità di contattare direttamente il servizio clienti e migliorerei la gestione del profilo da cellulare. Molte persone ormai utilizzano l'app quasi solo da li. Comunque nel complesso 4 stelle. Confido nella possibilità di darne 5 in futuro."
    ],
    "recentChanges": [
        "C’est avec de petits détails que nous bâtissons de grandes histoires, c’est pourquoi nous mettons à jour régulièrement votre application.",
        "Vous déménagez ? Vous pouvez désormais changer depuis votre profil vos données de localisation."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.ilius.android.meetic&hl=en&gl=us",
    "appId": "net.ilius.android.meetic"
}