{
    "title": "At Work",
    "summary": "With &quot;At Work&quot; you can manage your working hours so simple and straightforward!",
    "icon": "//lh5.ggpht.com/DCGwimcN3mhMhtnCUOU8lKy7PRBGsQLP_LT2AHYPY-aoUdkBq4MzRQrEiKOvJxkDbYw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 4,
    "reviews": 948,
    "developer": "MiNi Group",
    "developerId": "6373487843939580826",
    "developerEmail": "mini.group.dev@gmail.com",
    "developerWebsite": "http://www.micene.net",
    "developerAddress": "Padova\nItaly",
    "updated": "January 7, 2016",
    "version": "3.1.1",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "With \"At Work\" you can manage your working hours so simple and straightforward! The application is also available for Android Wear devices (watch).At Work is a simple and appealing application that is designed to simplify your working life. Just one click to record your entry or exit from your work, thus helping you to keep track of the hours you engage in day-to-day. Exploit new technologies: ☆ NFC: you can create a tag with the text \"punch\" to insert the events via the NFC capabilities of your smartphone. ☆ Smart WiFi: this is a new function created by MiNi Group to exploit the connections to WiFi office to figure out when you enter or exit. ☆ QR Code: you can use a QR Code (downloadable from the settings) to record events. ☆ Geolocalization: you can decide whether to register the location of the events (useful for travel, meetings,...). ☆ Android Wear: through the app for Wear devices you can easily insert events (entry, exit, voice note) and view infographics and lists directly from your wrist.You can easily figure out how many hours you worked during a day, a week or a month. Reports can be customized, letting you know exactly all the details of your working life. Some settings can be set via the standard working hours every day, so you can accurately calculate overtime, whatever your working hours. Other useful settings allow you to decide whether or not to calculate overtime and if round schedules. The application also allows you to enter notes, record special events or events of interest. A notification system (can be disabled) alerts you when you have finished your standard hours per day and reminds you when you are at work. Features: ☆ Event Entry / Exit ☆ List of events of the month ☆ Calendar of Events of the month and week☆ Detail of the day ☆ Copy / Delete / Edit events ☆ Export configurable data ☆ Notification of start / end work ☆ Backup / Restore Data ☆ Configurability Follow us on: ♥ Facebook https://www.facebook.com/MiNi.Group.Dev ♥ Twitter https://twitter.com/ #! / MiNi_Group ♥ Google Plus https://plus.google.com/u/0/113343151666726753764/postsCreative Commons license:Man by Matt Brooks, clock by Luis Prado and receipt by Benni from The Noun Project",
    "descriptionHTML": "With &quot;At Work&quot; you can manage your working hours so simple and straightforward! <br><br><b>The application is also available for Android Wear devices (watch).</b><br><br>At Work is a simple and appealing application that is designed to simplify your working life. <br>Just one click to record your entry or exit from your work, thus helping you to keep track of the hours you engage in day-to-day. <br><br>Exploit new technologies:<br><br> &#x2606; <b>NFC</b>: you can create a tag with the text &quot;<b>punch</b>&quot; to insert the events via the NFC capabilities of your smartphone.<br> &#x2606; <b>Smart WiFi</b>: this is a new function created by MiNi Group to exploit the connections to WiFi office to figure out when you enter or exit.<br> &#x2606; <b>QR Code</b>: you can use a QR Code (downloadable from the settings) to record events.<br> &#x2606; <b>Geolocalization</b>: you can decide whether to register the location of the events (useful for travel, meetings,...).<br> &#x2606; <b>Android Wear</b>: through the app for Wear devices you can easily insert events (entry, exit, voice note) and view infographics and lists directly from your wrist.<br><br>You can easily figure out how many hours you worked during a day, a week or a month. Reports can be customized, letting you know exactly all the details of your working life. <br><br>Some settings can be set via the standard working hours every day, so you can accurately calculate overtime, whatever your working hours. Other useful settings allow you to decide whether or not to calculate overtime and if round schedules. <br><br>The application also allows you to enter notes, record special events or events of interest. <br><br>A notification system (can be disabled) alerts you when you have finished your standard hours per day and reminds you when you are at work. <br><br><b>Features:</b> <br>&#x2606; Event Entry / Exit <br>&#x2606; List of events of the month <br>&#x2606; Calendar of Events of the month and week<br>&#x2606; Detail of the day <br>&#x2606; Copy / Delete / Edit events <br>&#x2606; Export configurable data <br>&#x2606; Notification of start / end work <br>&#x2606; Backup / Restore Data <br>&#x2606; Configurability <br><br><b>Follow us on:</b> <br>&#x2665; Facebook https://www.facebook.com/MiNi.Group.Dev <br>&#x2665; Twitter https://twitter.com/ #! / MiNi_Group <br>&#x2665; Google Plus https://plus.google.com/u/0/113343151666726753764/posts<br><br>Creative Commons license:<br>Man by Matt Brooks, clock by Luis Prado and receipt by Benni from The Noun Project",
    "histogram": {
        "1": 65,
        "2": 48,
        "3": 141,
        "4": 278,
        "5": 416
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "2.3.3 and up",
    "androidVersion": "2.3.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/yhAGmDCeelz66MsR2qkXaw66i7G56MupmK5JmYwl2qPvCe0KQoIdOhnwlN8gpJGqRQ=h310",
        "//lh3.ggpht.com/KU-rIyz3XwdYgSF7-b49eF1iL3SQr1nWcr951CJI5XpmXFWvErifQ2EHdOcFDcrdYQQ=h310",
        "//lh6.ggpht.com/ymBN5I3ctlkvnWJgzaIswRpVciN6NIlW7B_y880Dn9f4y3nun9IGrAKpFFDoVrL6JTs=h310",
        "//lh5.ggpht.com/h0ziiZhFhrG9ygpJR6Jy4PGrsM_0aF3d0WhddclzhHYbIanWupn8H2oFUm9V1EJZ-dc=h310",
        "//lh3.ggpht.com/53mXRLHRyb0ylLihXDx8eC3rhDKPaTIqYXcyhKzahRo0eY56DMmglT3S7gYG3sDDd5s=h310",
        "//lh4.ggpht.com/sIuy1fwUKvUYZFpFBsmgWB-8yyFQK4RuVfnLLukDKvYWTBmsrn0jeExDbNNhR3TczPU=h310",
        "//lh3.googleusercontent.com/QkMwoQvh8wuvZavBZbLkgWGEGIwrNHLErX90XkKMjX_E8BhgQoqszT8PYz4d2tBmrg=h310",
        "//lh4.ggpht.com/6LqgWTaPhaxXMDCB6HDmzqW-c3XhB58rVyrZAl0lroYmvvTtqmn3MZoiLU9lIcHhA98=h310"
    ],
    "comments": [
        "Mostly, the app does what it's supposed to do, but I do experience some pretty significant glitches. Any time I try to use the note function on the watch, the app crashes. Random punch-ins and punch-outs appear in my event log. The app can be moved to the SD card, but doing so causes it to be uninstalled from the watch. I use this app every day to keep track of my hours; please fix these glitches, and I'll be happy.  I'm using it on a ZenWatch 2 with a Galaxy S5.",
        "Works perfectly with Wear. I've been using this app for over a year now and love it. Of all the time card apps, this one works best with Wear. Punch in and punch out is effortless from the watch. Also the UI on both phone and watch are clean and simple. My only suggestion would be to add voice commands for Wear. I would love to be able to say \"OK Google, clock me in/out\" and have it do it!",
        "Doesn't work for 3rd shifters. If I work 7p to 7a, I punch in at 7p, but it doesn't carry over to the next day. It shows that I worked 7a to 7p.",
        "Perfect for logging work hours Does what it says! Worked great along with Tasker and my Android Wear device to auto prompt me to punch in/out from my watch and then create a useful log of all my hours worked!",
        "It's a pretty decent time tracking application. I wish there were a chrome plugin and Google Drive sync.",
        "Smart Wifi does not work very well, automatically creates punchin events when I am at home, so nowhere near the selected wifi."
    ],
    "recentChanges": [
        "• Ability to set default times more specific.",
        "• Added automatic backup (only for Android 6.0 or higher).",
        "• Added times in exports.",
        "• Solved some minor bugfix."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.micene.minigroup.workingtime&hl=en&gl=us",
    "appId": "net.micene.minigroup.workingtime"
}