{
    "title": "Marine Compass",
    "summary": "Marine compass : in all positions this compass remains parallel to the floor !",
    "icon": "https://lh4.ggpht.com/XW9zUNdttgpfgcruiYgrjw5FGrStBfftIY0SBo10Nbp4HuCIDq6KJVEQOc66TZ31dg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.1,
    "reviews": 6028,
    "developer": "PierroX",
    "developerId": "PierroX",
    "developerEmail": "pierrox@pierrox.net",
    "developerWebsite": "http://www.pierrox.net/",
    "developerAddress": "La Jacquetière, 73470 Nances",
    "updated": "July 11, 2014",
    "version": "3.4",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "A simple marine compass : move your phone in all positions, and the compass will always stay parallel to the floor ! This app has support for 3D themes meaning that you can select another kind o style of compass, including other interesting objects such as the aiming cube or the XYZ arrows.Marine Compass can also display your location using GPS. In that case latitude and longitude will be displayed under the heading display.It is also possible to extend Marine Compass with the optional augmented reality plugin, which will display the camera preview under the compass..This compass app has no ad and does not require permission except LOCATION for the GPS feature. Enjoy !Long tap on the compass will display the settings screen.Have fun.*** READ THIS PLEASE ***accuracy depends on the hardware, please use a calibration tool designed for your device whenever the displayed direction seems wrong or not accurate.",
    "descriptionHTML": "A simple marine compass : move your phone in all positions, and the compass will always stay parallel to the floor ! <br><br>This app has support for 3D themes meaning that you can select another kind o style of compass, including other interesting objects such as the aiming cube or the XYZ arrows.<br><br>Marine Compass can also display your location using GPS. In that case latitude and longitude will be displayed under the heading display.<br><br>It is also possible to extend Marine Compass with the optional augmented reality plugin, which will display the camera preview under the compass..<br><br>This compass app has no ad and does not require permission except LOCATION for the GPS feature. Enjoy !<br><br>Long tap on the compass will display the settings screen.<br><br>Have fun.<br><br>*** READ THIS PLEASE ***<br>accuracy depends on the hardware, please use a calibration tool designed for your device whenever the displayed direction seems wrong or not accurate.",
    "histogram": {
        "1": 575,
        "2": 217,
        "3": 543,
        "4": 1393,
        "5": 3300
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.0 and up",
    "androidVersion": "2.0",
    "contentRating": "Everyone",
    "screenshots": [
        "https://lh3.ggpht.com/BFieEa_8zBoMRQ8NQxpsmj4nOstvHU0Pm_y8sVSF9zN6dwbXlhDARQzyLx5eoVlCtw=h310",
        "https://lh3.ggpht.com/5-dHeFMhRo_ltRzAo_rvOueLMXM1UC4eLOIclOCWI5bS85ZO3-osxe43Ua6M989QL8Cz=h310",
        "https://lh4.ggpht.com/6rg30pVZamysNcNCNksk6HNuj92myZbedxAyHuzkJZLpMAO_sdb9LY3_nDUYyarOdw=h310"
    ],
    "video": "https://www.youtube.com/embed/TJA8OV53Z18",
    "comments": [
        "I Like It Extremely Accurate. I was actually taken back at how accurate it is. Cool little themes to download for free too, using the cube one. I'm using Sam Galaxy S4 Mini tho, May be different with different phone's for obvious reasons. Quality of phone and sensors and if set up right etc etc. Just letting you s4 mini users know it's ok for your sexy little phone like mine lol :)",
        "Something wrong from bottom side All right if see from top. If try see more than 90 degress ball flipped upside down. This strange effect seems on my Sony Xperia tipo dual and on my Huawei G510. I need current reading mark (red line that cross scale in my side for precise read). All other works perfect. Good compass.",
        "The best compass app I've tried so far. Finally found a compass app that gives me the same reading as my real compass! After having tried 3-4 other apps with no success, I'm glad to have found this one. Still had to hold my phone right for correct reading though. Other than that I woulda gave 5 stars.",
        "Works Works. But i thought it was gimmicky. All the positions i can hold my phone in that this compass displays usefully, my 2d compass also displays usefully. And all the positions i can hold my phone in that don't give me a useful display on my 2d compass, also don't give me a useful display on this compass. Nice idea but no real benefit over 2d compass was noticed.",
        "Loose Cannon just bought this supposed? compass it does not work. it is the second one that doesn't work I don't think I will bother with any more  google purchases, I have only just got my tablet. two out of two that's a good start?",
        "Awesome app but Works perfectly. Has fair customization. Just wanted 2 think. A little bit higher resolution of the compass itself and a simple red pointer at the top. We might not always looking for the principal directions.. great work developers. Cheers"
    ],
    "recentChanges": [
        "3.4",
        "- support for wearable devices: display the Marine Compass on your watch !",
        "3.3",
        "- long pressing the heading or the location texts will copy their content to the clipboard",
        "3.2.4",
        "- fix transparency problem and augmented reality plugin",
        "3.2.3",
        "- update startup hint thanks to Tim Wolf",
        "3.2.2",
        "- add an option for landscape devices",
        "3.2.1",
        "- fix compass heading value in landscape orientation",
        "- better style match with the platform (menus, dialogs)",
        "3.2",
        "- add text color and \"keep screen on\" option"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.pierrox.mcompass&hl=en&gl=us",
    "appId": "net.pierrox.mcompass"
}