{
    "title": "Clockwork Tomato",
    "summary": "Pomodoro made pretty",
    "icon": "//lh5.ggpht.com/7dV7cEUgs06lBxsEX4MbKyN85hExkQCJE8raDg_mSMOo51AhhlSUEs2TY3aCHdEkdA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.5,
    "reviews": 8402,
    "developer": "phlam",
    "developerId": "phlam",
    "developerEmail": "dev.phlam@gmail.com",
    "developerWebsite": "https://goo.gl/gCos4J",
    "developerAddress": "Paris, France",
    "updated": "October 1, 2017",
    "version": "3.7.0",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Clockwork Tomato is a time management application, based on the Pomodoro technique, a method that boosts productivity by breaking down work periods into 25-minute slices, separated by short breaks.• This application is a timer, a clock, and an activity log all at once (°) with a relaxing display and a beautiful widget.• Fully configurable: timers, behaviour, colors, sounds, style, and more than 50 options.• Highly expandable through the Tasker calls (https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm).(°) And more, with the in-app expansion pack, featuring:• Profiles, to switch between up to 5 preference sets.• Task lists, editable from any text editor through Dropbox, based on the todo.txt file format (http://www.todotxt.com/).• Detailed and colorful activity logs with enhanced recaps.",
    "descriptionHTML": "Clockwork Tomato is a time management application, based on the Pomodoro technique, a method that boosts productivity by breaking down work periods into 25-minute slices, separated by short breaks.<br><br>&#x2022; This application is a timer, a clock, and an activity log all at once (&#xB0;) with a relaxing display and a beautiful widget.<br>&#x2022; Fully configurable: timers, behaviour, colors, sounds, style, and more than 50 options.<br>&#x2022; Highly expandable through the Tasker calls (https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm).<br><br>(&#xB0;) And more, with the in-app expansion pack, featuring:<br>&#x2022; Profiles, to switch between up to 5 preference sets.<br>&#x2022; Task lists, editable from any text editor through Dropbox, based on the todo.txt file format (http://www.todotxt.com/).<br>&#x2022; Detailed and colorful activity logs with enhanced recaps.",
    "histogram": {
        "1": 248,
        "2": 204,
        "3": 546,
        "4": 1699,
        "5": 5705
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/iYsaeuHaATio1ZepbiO7L2m3P35beqGybnSaH4c9RrAXpRAd4ZqFQBd6TD045QB8lfI=h310",
        "//lh5.ggpht.com/61butyQzR2PG18iKtUd9xwVBtpnuJanvn8dnGsCl2MHJGmnWUyRNrHGcc3IeIK9FOw=h310",
        "//lh3.googleusercontent.com/IBMugxkCb21Cahti_ARSS4qFYGdgXsx_PgUJjAdrLSc-eYk96vTsoPFGzlSwL-Yi5rA=h310",
        "//lh3.ggpht.com/Zt8gmqeq88Sg_M9PZT2zpFEggxm5p63DUZvXYxoY3-0aOfVDlrh6Ge9AN39gYdSLLAzd=h310",
        "//lh4.ggpht.com/YPbgF1wLBfVT6fANUaGx-DgzSTIQ4F_fFfBueUx2jILonUhzPHB1bwgta88fbErsbA=h310",
        "//lh3.googleusercontent.com/mRNf2Pex4oicDaR-qdr96Rik27SHNod4M6RAzG3QwF3rExe1ln5eSNt34XH0APV_s6Q=h310",
        "//lh3.googleusercontent.com/g2iLDOW_E1d-JBExiqFr4Cn2LMUqoBHyTlWqEB3MvikcdDTH2itczS1zCiuwCIms3fg=h310",
        "//lh3.googleusercontent.com/7F0V0wDstR0v2cJqjP-j4_eaugQH2KVyq-mG9Sl9Q6BlHy18CdtStj3pt6OtRbJve5nW=h310",
        "//lh3.ggpht.com/kR242m7SisZCNbiNP0At1Jt0y8qWfa4pPykYPRL0rc47hKTfFw1C1kDcBaZa7UOaLRil=h310",
        "//lh6.ggpht.com/8e3me_jMJJBcXRWAJciGa6pHemu6Mkk34N-k84RSITqEWDBMQqBsp9e2LJwMycUV2GU=h310",
        "//lh3.googleusercontent.com/F2PDzzHxrZMoS761FhdUdJY5riwr1qtSoZ3q5IexS5PjUNOLaTiqUE7WjjJP_VEaZW4=h310",
        "//lh3.googleusercontent.com/OWJwX8bTL88Hi6gfimAM1qIksRiq6mDhvBUI9L7OfgbS4SgMhwAILALqDe3Iqmiz2g=h310"
    ],
    "video": "https://www.youtube.com/embed/2lQDx9REn0E",
    "comments": [
        "I quit my job so that I could work as a freelancer as well as take my licensure exam. While having a time of my own to balance my money-earning tasks and my schooling, I downloaded this app and bought its added features. Six months later, I passed my exams and was able to fulfill my freelance jobs with much ease. This app was very useful and I give it a lot of credit. Its customizable, gorgeous art design and reports can be exported via Excel. Pomodoro works and I didnt feel any stress. Really, thanks!",
        "Easily the best pomodoro timer on any platform. Has everything. Would perhaps be nice to sync with gcal, but it's basically just a joy to use. Update: bought the extras pack and Dropbox Todo sync isn't working, I guess there are api problems? App is authorized, but todo.txt doesn't appear in dropbox. An error \"Error communicating with Dropbox\" flashes onto the screen for a second. But Dropbox app & website are fine.",
        "Clockwork tomato is the best pomodoro app there is, hands down. It works perfectly out of the box, but it is extremely customizable. You can change the duration of each part of the pomodoro, determine whether you want to extend a section or move on to the next one, and even set different sounds for each section of a pomodoro.  Most importantly, it tracks the pomodoros you make and gives you statistics on your productivity.  The only thing that I would add is the option to track distractions too,  like Flat Tomato on iOS.   I highly recommend this, and even more the extension pack (it's cheap and it adds profiles and the ability to keep todos).",
        "This app has got me moving and working so many times in the morning that it's become part of my routine. Plus, I love the different profiles and the ability to change the length of the Pomodoros. Thanks for keeping this updated so well!",
        "This app has been so helpful when studying for tests or writing papers since I tend to work for 4 hours straight and it makes me exhausted very easily. With the pomodoro technique it reminds me to take breaks every so often to do things like go to the bathroom or grab yet another cup of coffee. 😂😂 This app is so much easier than setting a timer over and over again, and the customizability is amazing. A solid 5/5 from me!",
        "There is no description how to use the app and how breaks are allocated. Like I have heard from my friend that there is a long break after 4 short breaks but it should me mentioned somewhere in the app."
    ],
    "recentChanges": [
        "• Dropbox access update to match the new API."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.phlam.android.clockworktomato&hl=en&gl=us",
    "appId": "net.phlam.android.clockworktomato"
}