{
    "title": "Match.com: meet singles, find dating events & chat",
    "summary": "Find singles, swipe profiles, meet up &amp; chat with singles at local dating events",
    "icon": "//lh6.ggpht.com/TIN8qH71pEWgACdAMrISZbSnr04PiuQ5q7Xahys13Mrt1kYtLMlH4DhkM8SEaPA3bQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3,
    "reviews": 10564,
    "developer": "match.com International Limited",
    "developerId": "match.com+International+Limited",
    "developerEmail": "dk.support@eu.match.com",
    "developerWebsite": "http://m.europe.match.com",
    "developerAddress": "The Communications Building\n48 Leicester Square\nLondon, WC2H 7LT\nUnited Kingdom",
    "updated": "February 6, 2018",
    "version": "Varies with device",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "size": "Varies with device",
    "description": "Explore local dating events, meet up & chat with new people. Swipe profiles, chat and find singles near you. Explore online dating, discover new friends and find dating events to meet your match. Meeting singles on match.com could be the beginning of a brand new relationship!Find local dating events & meet singles! Whether you’re looking for friends, a great love, a new relationship or single men or women for a local love match, online dating & meeting singles with match.com is a fun adventure. Take a couple of minutes to sign up and start matching today! Meet Single Men or Women to Date at a Click!Discover Online Dating with Match.com – Top 3 Reasons to Download1.\tFind singles to date near you – start a new relationship with just one match! 2.\tSwipe profiles, chat & flirt like a pro – meet singles & check out their dating profile while on the move3.\tExplore local dating events and meet a couple of singles in a fun, friendly environmentDiscover online dating from a new perspective. Find singles, meet interesting people and shake off dating fatigue. Find local dating events, explore a new relationship and date differently. Join online dating with match.com, the “drinks tonight?” of our time.•\tSwipe profiles, find dating events, meet local singles & plan a meeting while on the move•\tLove a member’s profile? Wink at single men or women you fancy •\tDiscover dating profiles, find dating events, update your member profile & upload photosmatch.com is a part of the Match Group, which also owns Our Time and Meetic. Meeting singles is an adventure with match.com! Chat online with new friends and meet singles at local dating events. We spend our time matching couples so you don’t have to. Send and receive messages on the app and for access to additional dating features with a match.com subscription. And, if you’re looking to date more mature single men or women, check out Our Time, our dating app for the over 50 crowd!Registration and browsing single profiles is free. To access additional dating features, including reading and sending messages, you will need a match.com subscription. If you have an existing match.com website subscription, simply download the dating app and log-in to access all the features of match.com. If you do not have an existing website subscription, you can subscribe via the match.com app using a credit or debit card. This will give you access to match.com on any device. Our customer care team are available for help and advice:http://www.uk.match.com/help/contact_ex_faq_v.php---------------------------------------Example subscription prices include:1 month subscription for £29.99 per month3 month subscription for £19.99 per month (charged in a single payment of £59.97)6 month subscription for £12.99 per month (charged in a single payment of £77.94)You can also choose our simple instalment plan by following the instructions on the match.com app.Please note that subscriptions are renewed automatically for successive subscription periods of the same duration and at the same price as the initial period chosen.You can switch off the automatic renewal of your match.com subscription no later than 48 hours before your next subscription payment is due by logging into the match.com website with your username and password and following the instructions on your “My Account page”.Note: When using 3G users are advised to disable ‘Content control’ to launch the app and experience the full functionality.Pursuant to The Consumer Contracts (Information, Cancellation and Additional Payments) Regulations 2013, you have the right to cancel your contract for the Services within fourteen days from the date of placing your order.For further information go to our website www.match.com",
    "descriptionHTML": "Explore local dating events, meet up &amp; chat with new people. Swipe profiles, chat and find singles near you. Explore online dating, discover new friends and find dating events to meet your match. Meeting singles on match.com could be the beginning of a brand new relationship!<br><br>Find local dating events &amp; meet singles! Whether you&#x2019;re looking for friends, a great love, a new relationship or single men or women for a local love match, online dating &amp; meeting singles with match.com is a fun adventure. Take a couple of minutes to sign up and start matching today! <br><br>Meet Single Men or Women to Date at a Click!<br><br>Discover Online Dating with Match.com &#x2013; Top 3 Reasons to Download<br>1.\tFind singles to date near you &#x2013; start a new relationship with just one match! <br>2.\tSwipe profiles, chat &amp; flirt like a pro &#x2013; meet singles &amp; check out their dating profile while on the move<br>3.\tExplore local dating events and meet a couple of singles in a fun, friendly environment<br><br>Discover online dating from a new perspective. Find singles, meet interesting people and shake off dating fatigue. Find local dating events, explore a new relationship and date differently. Join online dating with match.com, the &#x201C;drinks tonight?&#x201D; of our time.<br><br>&#x2022;\tSwipe profiles, find dating events, meet local singles &amp; plan a meeting while on the move<br>&#x2022;\tLove a member&#x2019;s profile? Wink at single men or women you fancy <br>&#x2022;\tDiscover dating profiles, find dating events, update your member profile &amp; upload photos<br><br>match.com is a part of the Match Group, which also owns Our Time and Meetic. <br><br>Meeting singles is an adventure with match.com! Chat online with new friends and meet singles at local dating events. We spend our time matching couples so you don&#x2019;t have to. Send and receive messages on the app and for access to additional dating features with a match.com subscription. And, if you&#x2019;re looking to date more mature single men or women, check out Our Time, our dating app for the over 50 crowd!<br><br>Registration and browsing single profiles is free. To access additional dating features, including reading and sending messages, you will need a match.com subscription. <br>If you have an existing match.com website subscription, simply download the dating app and log-in to access all the features of match.com. <br>If you do not have an existing website subscription, you can subscribe via the match.com app using a credit or debit card. This will give you access to match.com on any device. <br><br><br>Our customer care team are available for help and advice:<br>http://www.uk.match.com/help/contact_ex_faq_v.php<br><br>---------------------------------------<br>Example subscription prices include:<br>1 month subscription for &#xA3;29.99 per month<br>3 month subscription for &#xA3;19.99 per month (charged in a single payment of &#xA3;59.97)<br>6 month subscription for &#xA3;12.99 per month (charged in a single payment of &#xA3;77.94)<br>You can also choose our simple instalment plan by following the instructions on the match.com app.<br>Please note that subscriptions are renewed automatically for successive subscription periods of the same duration and at the same price as the initial period chosen.<br>You can switch off the automatic renewal of your match.com subscription no later than 48 hours before your next subscription payment is due by logging into the match.com website with your username and password and following the instructions on your &#x201C;My Account page&#x201D;.<br>Note: When using 3G users are advised to disable &#x2018;Content control&#x2019; to launch the app and experience the full functionality.<br>Pursuant to The Consumer Contracts (Information, Cancellation and Additional Payments) Regulations 2013, you have the right to cancel your contract for the Services within fourteen days from the date of placing your order.<br>For further information go to our website www.match.com",
    "histogram": {
        "1": 3431,
        "2": 1072,
        "3": 1439,
        "4": 1682,
        "5": 2940
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/SSM9VVYMAxJr8SQMCtg0OhXbRbS5FsABhLu7JLbCd7M1Nxe_YdQC5DJr272707pB7nA=h310",
        "//lh3.googleusercontent.com/U542PnFnQfjApA1e3OalR6A-Lw09NqIgIGbdTpDKQ8VYYe8sQYSpjFnDBSWu0cULbf0=h310",
        "//lh3.googleusercontent.com/Z0A9n2Qlklaegcp4dyRR0NixtqGYtR5Tnpo_IgT5vWtYldIjbk8bYiJlH3y4F2pQcxU=h310",
        "//lh3.googleusercontent.com/DHHztKAfISqAUP3Cfp8IvZT4icwkzDSbxZRrDEYFMSpPgpwvuzQ1WCn8W_SNeUx6bl4N=h310",
        "//lh3.googleusercontent.com/pRoTyLhI6Mur5VZBk7DJPqrZX7LAtjtaKPoTFQ8sKTdlcmHmZMzCWL9-9VhLLic6aN8=h310",
        "//lh3.googleusercontent.com/ZEbeyis00u2XomUKghwVKrBS5yrIZqYb-yzbcbaU8u0zJJ-FCNYMDsSNzSP9CAcBX5AY=h310",
        "//lh3.googleusercontent.com/GqTfbH-rPYc0P9mRLX8PZCV6swPik7lijYLsAQnGiyPIesT2dZHG6-IruQra2xtH4U8=h310",
        "//lh3.googleusercontent.com/zK-adytR3KZEkdDrS0BpY83_8PyXk9Zu8vpOJj39dQixA_11YjvMO6Y4lCJhz4C6oQ=h310",
        "//lh3.googleusercontent.com/FmK4bwOFQRzIn3tsA4ObpjShneDgdHM7Fwt0EJI70yvBCAAHbrM2G7H16496W23c_Js1=h310"
    ],
    "video": "https://www.youtube.com/embed/wC5999Kvht8",
    "comments": [
        "It offers most functions of the website, plus the function to search nearby profiles. One odd feature is that some fields from the old website are still visible on the app, but not anymore on the new website. Unlike the UK version of the new website, the app also allows searching by metric height, good for people like me not familiar with feet/inches.",
        "Disappointing. I agree with most of the other reviewers. Messages from people who have clearly not bothered to read your profile. Sick to the back teeth of reading profiles of guys (sorry men!) who like glasses of wine, DVDs and blazing log fires! Photos of people covering their eyes with sunglasses or pints of lager in hand! Is this what life has become for the over 40s?",
        "App gets me by OK. Doesn't say whether someone has read my message like on  the desktop side to a point where I have to log in on my mobile browser and set to desktop mode.  Push notifications are unreliable, they work probably 65% of the time. Browsing profiles is good though.",
        "Awful can't choose or centre profile pics easily, message notifications are wrong and messages in mixed order, customer support terrible, no refunds, can't see if messages have been read, keeps promoting how many views I've had as if it matters? Probably more likely to get a date writing this review then on there! ✌️",
        "One of the most broken apps I've ever used. Sends push messages to say someone has viewed, then when you go to see who that person doesn't exist. Sends emails with the same problem. Now I just get the generic email saying people have viewed... not who specifically has and when you log in there's no new views. Personally had good success from the format but this app specifically is an absolute joke. If I was one of the devs who created this I'd be feeling very embarrassed!",
        "Have to pay for messages...avoid..doesn't tell you this until after profile is created! Waste my time"
    ],
    "recentChanges": [
        "It's with little details that we build great stories, that’s why we regularly update your application.",
        "On the move?  You can now change your location from your profile."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.ilius.android.match&hl=en&gl=us",
    "appId": "net.ilius.android.match"
}