{
    "title": "Social Media Vault",
    "summary": "All in One Social Media App - Twitter, Facebook, Instagram, 9gag &amp; 51 more.",
    "icon": "//lh3.googleusercontent.com/DT73KxxosWsmT7yrGUyG7Wk5IQTT5XQFnJlncRD9_F1lmgscd9GsLm5T0gkmCLid2qP9=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 6418,
    "developer": "NewSoftwares.net",
    "developerId": "9019378719257280280",
    "developerEmail": "support@newsoftwares.net",
    "developerWebsite": "http://www.newsoftwares.net",
    "developerAddress": "9450 SW Gemini Dr., ECM# 37715,\nBeaverton, OR 97008, USA.",
    "updated": "December 6, 2017",
    "version": "1.6",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "★All-in-one solution for all your social media needs.★ Access multiple social media accounts via just ONE APP★ No need for other apps anymore!★100% secure Social Media Platform!\"Social Media Vault\" allows you to access multiple social media accounts via just one app. With its password-protected interface, you don’t have to worry about others hacking into your account. Using this app’s social media dashboard, you can fearlessly access Facebook, Twitter, Instagram, and other social apps. In addition, the application has a host of secondary security features that keeps your social network accounts hidden from others. Social Media Vault saves you from downloading separate social media apps. It lets you access all your accounts within a secure interface, making it a perfect and unique social media manager application!Fingerprint LockIn this application, you’re well able to protect and access your confidential data using your unique fingerprint. A fingerprint locking option is now made available which is mostly found rare in other apps.Different Security locksSet up a Password, PIN or Pattern as your primary security credentials. It is your perfect social media lock and is the only app that offers such reliable security.Anti- HackIf someone tries to access your social networking apps behind you back, you can easily track down that crook via the anti-hack feature. The app captures the image of the culprit with the front camera of your smartphone along with the time stamp and you can check all the information about the hack attempt whenever you want.Panic SwitchNo need to worry if someone tries to snoop into your phone or suddenly arrives when you are surfing your social sites. The Panic Switch is here to save you. This feature allows you to switch to another app quickly by just shaking, flicking or placing the palm of your hand on the screen of your phone. It allows you to hide the contents of your app from any person passing by.Hide App iconThis feature dynamically hides the app’s icon, preventing snoopers from discovering or finding the app on your smartphone. Means, you can enjoy using any social media account and no one will ever know.Private BrowserYou can Socialize freely with the app’s built-in Private Browser and leave no traces of browsing behind. Plus, you can surf the web without the fear of getting your browsing history tracked. Internet browsing was never this safe.1.\tTwitter 2.\tinstagram3.\tFacebook4.\tYouTube5.\tLinkedIn6.\tPinterest7.\tGoogle+8.\tReddit9.\tTumblr10.\tGmail11.\tOutlook mail12.\tYahoo mail13.\tAol mail14.\tVkontakte (VK)15.\t9Gag16.\tBuzz feed17.\timgur18.\tLife hacker19.\tMyspace20.\tVimeo21.\tSoundCloud22.\tDigg23.\tPath24.\tDailymotion25.\tNetflix26.\tXanga27.\tStumbleupon28.\tClassmates29.\tCyWorld30.\tBadoo31.\tFotolog32.\tBlackPlanet33.\tGaiaOnline34.\tFlixster35.\tSkyrock36.\tDevainArt37.\tHabbo38.\tGoogle39.\tVine40.\tTwoo41.\tBox42.\tLast.fm43.\tDropbox44.\tQzone45.\tTravian46.\tWe Heart It47.\tMy life48.\tSina Weibo49.\tOdnoklassniki50.\tWAYN51.\tYikyak52.\tMymfb53.\tMedium54.\tFlickr55.\tSlackFor more information visit http://www.newsoftwares.net/",
    "descriptionHTML": "&#x2605;<b>All-in-one solution</b> for all your <b>social media needs</b>.<br>&#x2605; Access multiple social media accounts via just <b>ONE APP</b><br>&#x2605; No need for other apps anymore!<br>&#x2605;<b>100% secure</b> Social Media Platform!<br><br><b>&quot;Social Media Vault&quot;</b> allows you to access multiple social media accounts via just one app. With its password-protected interface, you don&#x2019;t have to worry about others hacking into your account. Using this app&#x2019;s social media dashboard, you can fearlessly access <b>Facebook, Twitter, Instagram, </b>and other social apps. In addition, the application has a host of secondary security features that keeps your social network accounts hidden from others. Social Media Vault saves you from downloading separate social media apps. It lets you access all your accounts within a <b>secure interface</b>, making it a <b>perfect</b> and <b>unique social media manager application!</b><br><br><b>Fingerprint Lock</b><br><br>In this application, you&#x2019;re well able to protect and access your confidential data using your unique fingerprint. A fingerprint locking option is now made available which is mostly found rare in other apps.<br><br><b>Different Security locks</b><br><br>Set up a Password, PIN or Pattern as your primary security credentials. It is your perfect social media lock and is the only app that offers such reliable security.<br><br><b>Anti- Hack</b><br><br>If someone tries to access your social networking apps behind you back, you can easily track down that crook via the anti-hack feature. The app captures the image of the culprit with the front camera of your smartphone along with the time stamp and you can check all the information about the hack attempt whenever you want.<br><br><b>Panic Switch</b><br><br>No need to worry if someone tries to snoop into your phone or suddenly arrives when you are surfing your social sites. The Panic Switch is here to save you. This feature allows you to switch to another app quickly by just shaking, flicking or placing the palm of your hand on the screen of your phone. It allows you to hide the contents of your app from any person passing by.<br><br><b>Hide App icon</b><br><br>This feature dynamically hides the app&#x2019;s icon, preventing snoopers from discovering or finding the app on your smartphone. Means, you can enjoy using any social media account and no one will ever know.<br><br><b>Private Browser</b><br><br>You can Socialize freely with the app&#x2019;s built-in Private Browser and leave no traces of browsing behind. Plus, you can surf the web without the fear of getting your browsing history tracked. Internet browsing was never this safe.<br><br><br>1.\tTwitter <br>2.\tinstagram<br>3.\tFacebook<br>4.\tYouTube<br>5.\tLinkedIn<br>6.\tPinterest<br>7.\tGoogle+<br>8.\tReddit<br>9.\tTumblr<br>10.\tGmail<br>11.\tOutlook mail<br>12.\tYahoo mail<br>13.\tAol mail<br>14.\tVkontakte (VK)<br>15.\t9Gag<br>16.\tBuzz feed<br>17.\timgur<br>18.\tLife hacker<br>19.\tMyspace<br>20.\tVimeo<br>21.\tSoundCloud<br>22.\tDigg<br>23.\tPath<br>24.\tDailymotion<br>25.\tNetflix<br>26.\tXanga<br>27.\tStumbleupon<br>28.\tClassmates<br>29.\tCyWorld<br>30.\tBadoo<br>31.\tFotolog<br>32.\tBlackPlanet<br>33.\tGaiaOnline<br>34.\tFlixster<br>35.\tSkyrock<br>36.\tDevainArt<br>37.\tHabbo<br>38.\tGoogle<br>39.\tVine<br>40.\tTwoo<br>41.\tBox<br>42.\tLast.fm<br>43.\tDropbox<br>44.\tQzone<br>45.\tTravian<br>46.\tWe Heart It<br>47.\tMy life<br>48.\tSina Weibo<br>49.\tOdnoklassniki<br>50.\tWAYN<br>51.\tYikyak<br>52.\tMymfb<br>53.\tMedium<br>54.\tFlickr<br>55.\tSlack<br><br>For more information visit http://www.newsoftwares.net/",
    "histogram": {
        "1": 595,
        "2": 294,
        "3": 745,
        "4": 1109,
        "5": 3675
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "3.0 and up",
    "androidVersion": "3.0",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/6tLCsLWis7fdg3FUT-szQuF8vmbRtYQXteUFRg19eUxzS159zIm_fHX3abrOGqhGBQ=h310",
        "//lh3.googleusercontent.com/JJ7D5vHO05SqLnQalrtAcKKGPbHyP9cOAggQthY3mCD-vwW8tGcFnOone9igidqOaRo=h310",
        "//lh3.googleusercontent.com/QzqOBexbFfkqON4PIZ-dTl0l7OS2QZ2ixbMYRDwV0Ym2vp_FIDNp6mbjOVWPvxPD5g=h310",
        "//lh3.googleusercontent.com/5OkV3j2Cfnvz-POJQDUAB8if0Iw1AmYpmtPm56MJ6wKCtzhxk6oy5OW_fyH7_WzKFckN=h310",
        "//lh3.googleusercontent.com/T3jOIGzwRx9Im3psLO9FEe_YdDMrZAOSGzN7ROV8ohbzc5QsOZBpwbmKPOniO0PhpzQ=h310",
        "//lh3.googleusercontent.com/iOfTMzMxwsI3Eo39Y3eVEpFVg68YLmxuCrQWQ0fxlCfGoG7-QxyCMvE8JkDO51Zmw0Wx=h310",
        "//lh3.googleusercontent.com/gU-8xoohFBQll0TLUsBMzmOGTEUql2C35ie68DNVdYS7hh5u87xPoo6yyKEueyv00Dc=h310",
        "//lh3.googleusercontent.com/sQP_CXJaZGIKkydqm3RYNIvEqpV6PpKteCZPTArm88rzVKOnHX98Tt1ZgMTpS3fOrx-2=h310",
        "//lh3.googleusercontent.com/oql0qcumCgcWX6cR67kVUevqMjNY-GcAu6VfaJVT1mhk0RCUJ0bPASBAhCZrhgQAqeg=h310",
        "//lh3.googleusercontent.com/RSpLYmMGMhGLxwgOjN7Cj6JKfi-d46Gy489V7uMSglcOqHklMS5lFQaD8xzNZbTTwA=h310",
        "//lh3.googleusercontent.com/GVzD3up2NuP7FqcrHPsWsz38Z_eEHipXtDwryF-19NAh7PuYmJFdjVZF6zr129N5mQ=h310",
        "//lh3.googleusercontent.com/EsQcuEQoVCn5vOcjmScZ-IELyZ3PS-s_z0KvaBRWrnQ6QRPva5MqwmaSEJff6Lhg8qM=h310",
        "//lh3.googleusercontent.com/JA4Tbl87ZcIdkTn3Nn8dBTevQnCGNHRHdpavxnycQl_92PKp5TAvs53ej5xwXdmQj0o=h310",
        "//lh3.googleusercontent.com/tTee8FRvjTvCJSc5t-WIxFTRDA5KugpwMamz0Bou_tDBFFwX72ObtKqCieeAaVRO9g=h310",
        "//lh3.googleusercontent.com/2kSR9oPEQ1ZpT82_e9Ut-lnfIH3ILXYlSafRnLJyNVZQasA1VJuPM9btCxNL0Bv1RNY=h310"
    ],
    "comments": [
        "My Instagram doesn't work.. It's very nice and save alot of space in my phone. But I don't need the other app.the very important to me is my email.. My facebook messenger, whatsapp and viber.. But very useful",
        "I actually thought to myself; What a great Idea. I can install this..and save space as well as have every-thing in one convenient place! Well Unfortunetly I can't get in.. and I have no one to talk to to find out why my password is not working! Or how to to get into access my stuff. What a oain your app has created...",
        "I like that it saves me storage space with downloading apps. My only question: Why didn't somebody think of this sooner?",
        "Its really good only thing i didnt like was there was no messenger and i had to download a seperate app for messemger",
        "Superb 100%,just what I was looking for (apps all in one place,no more clogging up my phone's internal memory)",
        "Liking it so far. It's ad free like I was looking for. Thank you."
    ],
    "recentChanges": [
        "Updated for Android-Nougat."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.newsoftwares.SocialMediaVault&hl=en&gl=us",
    "appId": "net.newsoftwares.SocialMediaVault"
}