{
    "title": "Recharge, Payments, QR Scanner, UPI, Bank Account",
    "summary": "Accept Payments, Scan QR,Recharge, Savings a/c, UPI, Book Flight, Train Ticket",
    "icon": "//lh3.googleusercontent.com/TA8TqYpRe77mzU0CjbzwZyN1iEhRlN6LpyLINQxKiwwzrdWvlGkcCPS4Q42PsGBmvsjY=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.4,
    "reviews": 3278823,
    "developer": "Paytm - One97 Communications Ltd.",
    "developerId": "Paytm+-+One97+Communications+Ltd.",
    "developerEmail": "app.feedback@paytm.com",
    "developerWebsite": "http://www.paytm.com",
    "updated": "February 28, 2018",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "description": "#PaytmKaro for the UPI, Savings Account, Mobile Recharge, DTH, Data & Metro Recharge, Movie Ticket, Train Ticket, Bus Ticket & Flight Booking. With Paytm app, it is simple to Send or Receive Money, use QR Code Scanner to scan all types of QR, create UPI to link your Bank account or open a savings account with Paytm Payments BankPaytm Payments Bank Savings AccountOpen Savings account with Paytm Payments Bank and enjoy benefits like zero charges on online transactions, no minimum balance requirements and free virtual debit card. Keep upto Rs. 1 lakh of deposits and earn interest every month. Visit Paytmbank.com for more details. Paytm BHIM UPI AddressCreate your own Paytm BHIM UPI id on the app. Link any of your Savings account with this unique ID and start sending & receiving money instantly. You don’t need bank details or IFSC code to send or receive money. Send upto Rs. 1 lakh in a single transaction using UPI and there is no receiving limit. There are zero charges for transferring money using UPI.Online Recharge and Utility Bill PaymentDo mobile recharge or pay postpaid mobile bills for Aircel, Airtel, BSNL, IDEA, Matrix Postpaid, Tata Docomo, Tata Indicom, Vodafone, Telenor, Jio, MTNL and more. Pay electricity bills (CESC, Reliance, Tata Power, MSEDCL, BSES etc.), water bills (DJB, BWSSB, MCG etc.) or gas bills (IGL, SGL, Adani, Mahanagar, Siti, etc.) through the Paytm app quickly. Data card recharge and bill payment are available for Aircel, Airtel, BSNL, IDEA, Jio, MTNL, Vodafone, Tata Photon Plus and more. Send or Receive PaymentSend money to friends & family or make a payment to any shop or merchant using a phone number or Paytm QR. You can pay using your wallet, UPI linked bank account or Paytm Payments Bank Savings account or you can add money to your wallet with debit cards, credit cards, net banking from all leading banks - using Visa, Mastercard, Rupay. Offline Payments, QR Code ScannerPay through QR code scanner at restaurants, lifestyle & fashion outlets, grocery stores and so on. Use Paytm wallet or QR code scanner to pay for your cab/auto rides like Uber, Ola, Meru, etc. Explore places near you that accept payment through the Paytm wallet. Pay for your local Kirana shop, retail stores (like Big Bazaar, More, Central etc.) or even for restaurants, petrol pumps (Indian Oil Petrol pumps, Bharat Petroleum), milk (Mother Dairy) through Paytm. Entertainment- Amusement Park, Event & Movie TicketBook movie tickets for the latest releases and upcoming movies across various theatres & multiplexes. You can also book tickets for events, amusement parks, water parks, theme parks and enjoy Cashback offers & discount deals.Book Travel Tickets on Paytm – Flights, Buses, Trains Book your next flight ticket, train ticket or bus ticket with Paytm and enjoy Cashback offers! Complete your journey with a hotel booking on Paytm. Book IRCTC train tickets online and you can also check PNR status.Metro Card RechargeMake a metro card recharge (Delhi Metro, Hyderabad Metro, Mumbai Metro) with Paytm and skip long queues. Digital Gold Buy or sell digital gold with Paytm. To get physical gold against Paytm digital gold, you just need to pay the making charges and request for delivery anytime after 24 hours. Loan Payment & Insurance Premium Pay your loan EMI & take advantage of various promo codes available. Don’t worry about payment delays, pay your insurance premiums in a jiffy with Paytm. Shop Online Shop for the top-selling products in women and men fashion, mobiles & electronics, home & kitchen, accessories, jewellery, home appliances, baby & kids and more.For App Permissions do check our Permissions Page @ https://paytm.com/offer/android-app-permissions/Stay updated on what's new with Paytm by checking out our blog https://blog.paytm.com",
    "descriptionHTML": "#PaytmKaro for the UPI, Savings Account, Mobile Recharge, DTH, Data &amp; Metro Recharge, Movie Ticket, Train Ticket, Bus Ticket &amp; Flight Booking. With Paytm app, it is simple to Send or Receive Money, use QR Code Scanner to scan all types of QR, create UPI to link your Bank account or open a savings account with Paytm Payments Bank<br><br><b>Paytm Payments Bank Savings Account</b><br>Open Savings account with Paytm Payments Bank and enjoy benefits like zero charges on online transactions, no minimum balance requirements and free virtual debit card. Keep upto Rs. 1 lakh of deposits and earn interest every month. Visit Paytmbank.com for more details. <br><br><b>Paytm BHIM UPI Address</b><br>Create your own Paytm BHIM UPI id on the app. Link any of your Savings account with this unique ID and start sending &amp; receiving money instantly. You don&#x2019;t need bank details or IFSC code to send or receive money. Send upto Rs. 1 lakh in a single transaction using UPI and there is no receiving limit. There are zero charges for transferring money using UPI.<br><br><b>Online Recharge and Utility Bill Payment</b><br>Do mobile recharge or pay postpaid mobile bills for Aircel, Airtel, BSNL, IDEA, Matrix Postpaid, Tata Docomo, Tata Indicom, Vodafone, Telenor, Jio, MTNL and more. Pay electricity bills (CESC, Reliance, Tata Power, MSEDCL, BSES etc.), water bills (DJB, BWSSB, MCG etc.) or gas bills (IGL, SGL, Adani, Mahanagar, Siti, etc.) through the Paytm app quickly. Data card recharge and bill payment are available for Aircel, Airtel, BSNL, IDEA, Jio, MTNL, Vodafone, Tata Photon Plus and more. <br><br><b>Send or Receive Payment</b><br>Send money to friends &amp; family or make a payment to any shop or merchant using a phone number or Paytm QR. You can pay using your wallet, UPI linked bank account or Paytm Payments Bank Savings account or you can add money to your wallet with debit cards, credit cards, net banking from all leading banks - using Visa, Mastercard, Rupay. <br><br><b>Offline Payments, QR Code Scanner</b><br>Pay through QR code scanner at restaurants, lifestyle &amp; fashion outlets, grocery stores and so on. Use Paytm wallet or QR code scanner to pay for your cab/auto rides like Uber, Ola, Meru, etc. Explore places near you that accept payment through the Paytm wallet. Pay for your local Kirana shop, retail stores (like Big Bazaar, More, Central etc.) or even for restaurants, petrol pumps (Indian Oil Petrol pumps, Bharat Petroleum), milk (Mother Dairy) through Paytm. <br><br><b>Entertainment- Amusement Park, Event &amp; Movie Ticket</b><br>Book movie tickets for the latest releases and upcoming movies across various theatres &amp; multiplexes. You can also book tickets for events, amusement parks, water parks, theme parks and enjoy Cashback offers &amp; discount deals.<br><br><b>Book Travel Tickets on Paytm &#x2013; Flights, Buses, Trains </b><br>Book your next flight ticket, train ticket or bus ticket with Paytm and enjoy Cashback offers! Complete your journey with a hotel booking on Paytm. Book IRCTC train tickets online and you can also check PNR status.<br><br><b>Metro Card Recharge</b><br>Make a metro card recharge (Delhi Metro, Hyderabad Metro, Mumbai Metro) with Paytm and skip long queues. <br><br><b>Digital Gold </b><br>Buy or sell digital gold with Paytm. To get physical gold against Paytm digital gold, you just need to pay the making charges and request for delivery anytime after 24 hours. <br><br><b>Loan Payment &amp; Insurance Premium </b><br>Pay your loan EMI &amp; take advantage of various promo codes available. Don&#x2019;t worry about payment delays, pay your insurance premiums in a jiffy with Paytm. <br><br><b>Shop Online </b><br>Shop for the top-selling products in women and men fashion, mobiles &amp; electronics, home &amp; kitchen, accessories, jewellery, home appliances, baby &amp; kids and more.<br><br>For App Permissions do check our Permissions Page @ https://paytm.com/offer/android-app-permissions/<br><br>Stay updated on what&apos;s new with Paytm by checking out our blog https://blog.paytm.com",
    "histogram": {
        "1": 180359,
        "2": 67727,
        "3": 200562,
        "4": 713463,
        "5": 2116712
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FJZG-_16rhA0grUMV459ggpaTVS9L09mMkZdvSIHizkAJaLBmgYO16zHMcR34X4y=h310",
        "//lh3.googleusercontent.com/0PxAYBPW1hm6mG2r_zVMfAHr4-eUdbHzTgAZHTfM3Mu_amQgudSYjeDx0Yd-yFYBew=h310",
        "//lh3.googleusercontent.com/nMyBC9BZ6QrPUyg8vwKlXZRdcfRnYdM4LrFwKH-tutG7Tv9cZkjkympLSLNU4zVmVsc=h310",
        "//lh3.googleusercontent.com/JC8RR8cmFqy_gSYzNFPOf0FYJpBMHEkGo39FErQHpdqP9JW79sPr8mBOzpQyXvmay3c=h310",
        "//lh3.googleusercontent.com/1u-lJEui_dWE0LQWQNL6sLArtzN1RcBrrgqM84im4PTeO-_IJ4VkI1IGoe12Iq12705L=h310",
        "//lh3.googleusercontent.com/U7fsu1jedDtQnCzrYVkfJF83QrEV2GUk1NWJ9DZWo-5rg7k_Le2xVg-DeqTjKAKp9pg=h310",
        "//lh3.googleusercontent.com/UMjhNBHtIME6tb79X1KjMDky8ilnh4uTuYgilXJ2tvxeNfr1aA6zT5Gyhw189lbjSfYt=h310",
        "//lh3.googleusercontent.com/my1ORcp7inshnV-WLeWjjyGhz_z3U9o3Lv7z2fqmFaHe_64jGPIzxCA74no9jBEr_CF-=h310"
    ],
    "comments": [
        "One of the most worst customer service i have ever seen. I am contacting them from last 3 days but they didn't solve my problem and i also message them on Help & Support but i didn't get any reply. I am facing a problem in KYC verification. Whenever i try to verify my KYC it always shows error. I am using Paytm from last many years i never expect that type of service from Paytm. I am very disappointed with Paytm.",
        "Account blocked for past 20 days. Contacted customer care and sent all the documnets they asked but no one reply after semding the kyc docs. And account is still bocked. I have sent mails but no reply of that too. My business is going under loss due to this problem. Looking for alternate wallets.",
        "UNABLE TO ADD MONEY For the past few days I'm not able to add any money to my Paytm wallet through my debit card. Whenever I try to add money the app doesn't let me write my complete card number & then it says invalid card number. What should I do?? I've registered my complaint also but there's no response.",
        "It's the worst app I ever seen. WIthout my permission 105rs has been debited to a company known as nano wicore lab pvt Ltd. I will recommend not to install this app to my friends. And this had happened in just 1 day two times... So cheating app..",
        "This app is getting worst day by day. I'm not able to add money to paytm wallet, though the credit card limit is more than 3 lakhs. I'm getting this error when I try to add money in wallet \"Please try with lower amount or different payment mode. Transaction limits will revise as you continue using paytm\" last month I didn't gave such problem... Can you please try to resolve the issue. Also, Customer service is pathetic",
        "Already 48 hours complete for updating KYC. But still not verified by PayTM and still showing \"it will take upto 24 hours to confirm \". VERY BAD SERVICE GIVEN BY PAYTM.  Fas gya PayTM account bna kr....    Advising to everyone pls use other app instead of PayTM."
    ],
    "recentChanges": [
        "Bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.one97.paytm&hl=en&gl=us",
    "appId": "net.one97.paytm"
}