{
    "title": "Wear Remote Camera Viewfinder",
    "summary": "Remote Control your smartphone (front and back) camera with Android Wear watch",
    "icon": "//lh5.ggpht.com/vgSxWfmJr9S64kBjmHHqkeZZWulIDhW5WrSJB_92BqVK0xDkaAWdhEIHjEwamskSUugp=w300",
    "price": "$1.49",
    "free": false,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.6,
    "reviews": 91,
    "developer": "JonG Mobile Apps",
    "developerId": "JonG+Mobile+Apps",
    "developerEmail": "jonnigil@gmail.com",
    "developerWebsite": "http://privacy.jonni.sexy",
    "developerAddress": "Arthur van Schendelstraat 205\n3511MC Utrecht\nThe Netherlands",
    "updated": "October 29, 2014",
    "version": "2.1",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "description": "-- Please note: Android Wear apps take up to 5 minutes to be installed onto the watch AFTER having installed the mobile module. --Wear Viewfinder is an Android Wear application which enables you to take pictures while using your watch as a viewfinder. Options for flash, timer and camera switcher are included. Prop your phone up to take group pictures or better selfies! Use it as a \"spy cam\" with the screen off. Keep an eye on your cooking. Surprise a friend with perfect timing. Use it as a high tech rear-view mirror and anything else you can come up with.Operation is simple and intuitive:- Start app through any launcher on your watch.- Tap the viewfinder to take a picture.- Swipe left for options.- Swipe right to exit app.- The app never runs in the background and will never give you unsolicited popup cards.Currently Wear Viewfinder supports all available round and square Android Wear watches. It will be updated to include support for future devices AND android versions. DO NOT buy this app if you own a TIZEN powered smartwatch.Images made with this app are saved in /sdcard/DCIM/Camera. for most devices this is the default camera folder but for devices from for example Samsung and HTC this is a different folder.-- Feature requests, bug reports, complaints and refunds --Please do not hesitate to contact me directly so I can immediately take action. The goal is to make your user experience as smooth and enjoyable as possible!No Bunnies were harmed in the making of this app!",
    "descriptionHTML": "-- Please note: Android Wear apps take up to 5 minutes to be installed onto the watch AFTER having installed the mobile module. --<br><br>Wear Viewfinder is an Android Wear application which enables you to take pictures while using your watch as a viewfinder. Options for flash, timer and camera switcher are included. <br><br>Prop your phone up to take group pictures or better selfies! Use it as a &quot;spy cam&quot; with the screen off. Keep an eye on your cooking. Surprise a friend with perfect timing. Use it as a high tech rear-view mirror and anything else you can come up with.<br><br>Operation is simple and intuitive:<br>- Start app through any launcher on your watch.<br>- Tap the viewfinder to take a picture.<br>- Swipe left for options.<br>- Swipe right to exit app.<br>- The app never runs in the background and will never give you unsolicited popup cards.<br><br>Currently Wear Viewfinder supports all available round and square Android Wear watches. It will be updated to include support for future devices AND android versions. <br>DO NOT buy this app if you own a TIZEN powered smartwatch.<br><br>Images made with this app are saved in /sdcard/DCIM/Camera. for most devices this is the default camera folder but for devices from for example Samsung and HTC this is a different folder.<br><br>-- Feature requests, bug reports, complaints and refunds --<br>Please do not hesitate to contact me directly so I can immediately take action. The goal is to make your user experience as smooth and enjoyable as possible!<br><br>No Bunnies were harmed in the making of this app!",
    "histogram": {
        "1": 13,
        "2": 12,
        "3": 13,
        "4": 16,
        "5": 37
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/n0tLvGPhOL6-GoCOMAbRh6gnNoBuFUirUxXZNlY_DZzAtNIgjoFTTPEaPx0BIwUe=h310",
        "//lh4.ggpht.com/nWtTkoAd_atEH4A9_so1Htny4drJ0h13ETel4aQ_uzRcd-QnyKA22R7gl_dyWrwxzMw=h310",
        "//lh5.ggpht.com/lOIyT06yC4MYqVasWLNCBPHk3FVHSGf2BufyRh_ClRQO6SloRWbE_oQTvDU3jxD3JnQ=h310",
        "//lh5.ggpht.com/4c0bZO5bZcQ1WLetvTUazMKllS8cnL__ZE6Eb2IuI9ydhrRjQaWKIhaMmwSXDoFEfqE=h310",
        "//lh5.ggpht.com/_JEq9gFtRRh3mTqZ5XCxE_Cx_3sl0PSPUdnH544JoxM8LZZRoyjIs0roNrEdGttRdlVy=h310",
        "//lh3.googleusercontent.com/HBS3HxJ5tEEPRl61zeFbwD4k3LB9vP9GuEcWbtocM4xEkoxbAH9_fPg-wIvwiZ8JBw=h310",
        "//lh3.googleusercontent.com/G0kWOXoKqcaUM3khl77y0RW57eYju2T6kh3ZWZIh9ePkPfLyna3SJtSeuQ-UeE4rcA=h310",
        "//lh3.googleusercontent.com/j8T0tI7UBC-WYzvnuDwMNtv31Ywut1BkX3z-ecCYI8ITNxfcNa8HscV2XBuuGIV2R2hN=h310"
    ],
    "comments": [
        "It Kinda works I have the moto 360 and it works mostly. The stream works great and it is a good quality. I can't take a picture from the watch. I also can't switch from back to front without closing and reopening the watch app. I would have rated this lower but it is the only app like it so it is fine. It is definitely worth it. Devs: please fix the picture taking problem!",
        "Works pretty good. The quality is not great and slight lag but otherwise really cool. The photo that saves to phone is high res. Wish they had option to turn the flash on to work like a flashlight. Would be helpful if using the phone in dark places.",
        "Update Have to update because this app keeps getting worse. There is severe lag and viewfinder often freezes. The image on my watch is definitely not a \"live\" image.",
        "Functionality is there usually but isn't always consistent Works on my test devices (moto 360 and gear live) and works but the camera feed can get pretty laggy at times or just hang alltogether. When this doesn't happen its a great app to have.",
        "I did not give up, seeing all the users were able to make it work. I continued on playing with re=set/re start, install re install and somehow it is working now. Let's see how long will it work as the other reviewers said it stop working after a few days. For now I am giving this 4 stars, it is a great and useful app when it is working. 5 stars for developer's support.    I managed to get a refund, but then I decided to give it a chance so I re  purchased, re installed, clear the cache, re started my One M9, re started the watch, re sync, all the  possible re! So please refund me, I gave it a chance, I wasted a lot of time trying to make it it work. Please give my money back. Thanks",
        "Great concept Love that I can finally take a pic and see it from my watch but real laggy and hard to see on moto 360 but yet again I give full credit to these people I can't make a app so good job just update to fix please also can not use stock camera for pictures seems to override it with this app"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.jonni.wearcamera&hl=en&gl=us",
    "appId": "net.jonni.wearcamera"
}