{
    "title": "Lexa, dating voor singles",
    "summary": "Always and everywhere online dating with Lexa app!",
    "icon": "//lh3.googleusercontent.com/roNg4RWAb6hxbhVDKNN6RJ25FafduYeYb6QT-pPfV3xOefnH9xlv7X0xz-2Gw7M5h2A=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.3,
    "reviews": 4667,
    "developer": "Lexa.nl",
    "developerId": "Lexa.nl",
    "developerEmail": "support.mobile@lexa.nl",
    "developerWebsite": "http://touch.lexa.nl",
    "developerAddress": "6 rue Auber Paris",
    "updated": "February 6, 2018",
    "version": "Varies with device",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "size": "Varies with device",
    "description": "Online dating met Lexa altijd & overal toegang tot een succesvolle date!Een leuke date is nu binnen handbereik! -------------------------------------------------Lexa, is dé online dating service voor singles. Dankzij de online dating app van Lexa kun je voortaan duizenden singles ontmoeten via je Android toestel. Met de applicatie kun je altijd & overal:•\tIn contact komen met duizenden singles •\tDirect zien wie jouw profiel bezocht, met jou flirtte of wie een bericht stuurde•\tUitgebreide zoekopdrachten uitvoeren•\tDe profielen en foto’s van singles bekijken•\tFlirts versturen •\tDirect chatten met wie je maar wilt•\tBerichten lezen, beantwoorden en versturen•\tJouw profiel bijwerken, fotos uploaden, etc. En er zijn nog veel meer functies die je kunt ontdekken door deze gratis online dating app van Lexa  te downloaden. Gebruik deze toepassing om binnen enkele minuten jouw Lexa-profiel te maken! Lexa.nl is continu op zoek naar nieuwe manieren om de kwaliteit van haar online dating service te verbeteren en jou te helpen bij het vinden van een leuke date tussen al die leuke singles. Dus schrijf je nu gratis in en wie weet heb jij binnenkort een date!Heb je al een betaald membership bij Lexa? Dan kun je direct en zonder (meer)kosten het membership ook op de Lexa Android app gebruiken. Heb je nog geen membership van Lexa? Dan kun je je rechtstreeks vanaf de Android app registreren.6 maanden voor  € 9,99 per maand3 maanden voor  € 16,99 per maand1 maand voor  € 24,99Met het membership kun je ook gebruik maken van alle functies op Lexa als je via de reguliere website inlogt.Om te voorkomen dat je jouw contacten en berichten verliest bij het verlopen van je membership, zal je membership automatisch worden verlengd met een termijn van 1 (één) maand. Uiteraard kun je de automatische verlenging van je membership op elk moment annuleren vanaf de pagina “Mijn instellingen & Membership” op Lexa. Omwille van technische redenen kan het membership niet worden opgezegd in de 24 uur na aankoop van het membership en in de 48 uur voor de vervaldag van het lopende membership.",
    "descriptionHTML": "Online dating met Lexa altijd &amp; overal toegang tot een succesvolle date!<br>Een leuke date is nu binnen handbereik!<br> -------------------------------------------------<br>Lexa, is d&#xE9; online dating service voor singles. Dankzij de online dating app van Lexa kun je voortaan duizenden singles ontmoeten via je Android toestel. <br>Met de applicatie kun je altijd &amp; overal:<br>&#x2022;\tIn contact komen met duizenden singles <br>&#x2022;\tDirect zien wie jouw profiel bezocht, met jou flirtte of wie een bericht stuurde<br>&#x2022;\tUitgebreide zoekopdrachten uitvoeren<br>&#x2022;\tDe profielen en foto&#x2019;s van singles bekijken<br>&#x2022;\tFlirts versturen <br>&#x2022;\tDirect chatten met wie je maar wilt<br>&#x2022;\tBerichten lezen, beantwoorden en versturen<br>&#x2022;\tJouw profiel bijwerken, fotos uploaden, etc. <br><br>En er zijn nog veel meer functies die je kunt ontdekken door deze gratis online dating app van Lexa  te downloaden. Gebruik deze toepassing om binnen enkele minuten jouw Lexa-profiel te maken! Lexa.nl is continu op zoek naar nieuwe manieren om de kwaliteit van haar online dating service te verbeteren en jou te helpen bij het vinden van een leuke date tussen al die leuke singles. Dus schrijf je nu gratis in en wie weet heb jij binnenkort een date!<br><br>Heb je al een betaald membership bij Lexa? Dan kun je direct en zonder (meer)kosten het membership ook op de Lexa Android app gebruiken. Heb je nog geen membership van Lexa? Dan kun je je rechtstreeks vanaf de Android app registreren.<br>6 maanden voor  &#x20AC; 9,99 per maand<br>3 maanden voor  &#x20AC; 16,99 per maand<br>1 maand voor  &#x20AC; 24,99<br>Met het membership kun je ook gebruik maken van alle functies op Lexa als je via de reguliere website inlogt.<br>Om te voorkomen dat je jouw contacten en berichten verliest bij het verlopen van je membership, zal je membership automatisch worden verlengd met een termijn van 1 (&#xE9;&#xE9;n) maand. Uiteraard kun je de automatische verlenging van je membership op elk moment annuleren vanaf de pagina &#x201C;Mijn instellingen &amp; Membership&#x201D; op Lexa. Omwille van technische redenen kan het membership niet worden opgezegd in de 24 uur na aankoop van het membership en in de 48 uur voor de vervaldag van het lopende membership.",
    "histogram": {
        "1": 1066,
        "2": 373,
        "3": 648,
        "4": 1175,
        "5": 1405
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/yUdMPW32bypWOco-yHu3jYY1ZUZ2lam6C2y9JckjxKOiirRTAgA6WjP_gMCn78UfbAIZ=h310",
        "//lh3.googleusercontent.com/wK7KHsmSkB2TO8ObtV46kk7C_XJQJg8vjDAjhaJna14Vnpwjb2BGzadzS96G8JinUUI=h310",
        "//lh3.googleusercontent.com/ToVsFyaHUu470fB_tqm2s0daMYtc2AJXqbE2c6anYEooOYHuote4QIL_t8YCLkP7YGk=h310",
        "//lh3.googleusercontent.com/Vv0wOR2w572kNOMhdVnJ9e9TFObfko1sTnz5tRcv_l8CxLCZlcXlgW2wiuZZbYXci24=h310",
        "//lh3.googleusercontent.com/NIAHH8fjTWPXPGfIaIRTiUv-dIYNxGqOKnFl-egEjrlR1lQnUTAE8q-4Rg4BRABTw3jB=h310"
    ],
    "comments": [
        "Wat een waardeloze geldklopperij!! Half jaar geprobeerd, niemand die ook maar interesse toond! Zeg je het op krijg je 4 winks per dag!! Sure!! 😂😂",
        "No messaging while you have a free account, if you want to send a message, either the recepient or you should have a premium membership, or you BOTH need a full membership. Also the memberships are way overpriced for basic functionalities",
        "It's a terrible App. For everything you have to pay. If you wanna send message, you have to pay if you want to see who looked at you, you have to pay, for everything you have to pay..! I tried it out for one evening and I got so mest up with it. I still have to find out how to delete my profile couse on profile, account settings it seems impossible😡😠😡",
        "Messaging your MATCHES, not just random people, no, the people who like you BACK, is a PREMIUM FUNCTION... need I say more?",
        "Paying for Everything is outdated in the time! Come on Lexa..",
        "The messaging interface is terrible, misleading."
    ],
    "recentChanges": [
        "De mooiste verhalen beginnen vaak met kleine details, daarom updaten wij onze App regelmating.",
        "Ga jij verplaatsen? Je kunt nu je locatiegegevens in je profiel veranderen."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.ilius.android.lexa&hl=en&gl=us",
    "appId": "net.ilius.android.lexa"
}