{
    "title": "Family Locator & Safety",
    "summary": "Locate your family &amp; kids on a map in real-time - securely &amp; for free",
    "icon": "//lh3.googleusercontent.com/CSHexwWyptl7xXlkpE0afnuWbSBwggwiqC_Sgt5uthlebbEPtDx2KEQam8LpYP5lXnRK=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 21600,
    "developer": "Familonet",
    "developerId": "7776906669583109560",
    "developerEmail": "support@familo.net",
    "developerWebsite": "http://www.familo.net/",
    "developerAddress": "Familonet GmbH\nSternstr. 97\n20357 Hamburg\nGermany",
    "updated": "October 19, 2017",
    "version": "2.32",
    "genre": "Social",
    "genreId": "SOCIAL",
    "description": "Familonet is a free Locator App that lets you stay connected with the people who matter to you most: your family & friends★ Real time location tracking on a map – you can always see where your child or partner is★ Automatic push notifications when a family member arrives at or leaves a place such as school. home or office★ Enhanced safety through the integrated panic button including location sharing★ Private chat function★ Locate lost or stolen phones★ Low battery consumption★ Very easy to use for childrenINTELLIGENT PLACES: Automatic notifications when family members, like children, grandma or grandpa safely arrive at and leave their daily places - such as school, work or home.CHECK-IN: Share your location with your group membersREAL-TIME LOCATION SHARING: Share your location and locate / track others in real-time. You choose when and for how long!MULTIPLE GROUPS: Create individual groups for all the people in your life: Family, friends, roommatesCHAT: Share messages and images with your group members at highest data security standardPANIC BUTTON: Enhanced safety – send your group members your current location so they can find and help you. Lets parents give their child more freedom and allows the elderly to feel safePHOTO ALBUM: All your pictures at a glance – save every moment shared in your group in a photo album All benefits at a glance:★ More freedom and less worries for your child, parents and the elderly★ Locate / track / find lost phones via the GPS tracker★ Messaging and sharing according to highest standards of data security★ Allows parents to feel close to their child★ Children and teens are happy not having to call their parents all the time★ The elderly feel safe and independent★ Couples can stay connected thanks to GPS phone tracking★ Enhanced safety, easier communication, and more freedom!★ Location-sharing technology made in Germany EASY DAILY LIFE ORGANIZATION AT IT’S BESTEnhances daily communication of your family: Parents, children, grandma, grandpa. Also great for couples, friends or roommates.To function properly Familonet needs access to: In-app purchases - In-app billing of premium subscriptionsIdentity - Managing your Familonet user accountContacts - Adding other users to your groupsLocation - To share your location with your group membersSMS - Send invitation SMS to your group membersPhotos/Media/Files - Send photos and create your profile pictureWi-Fi connection information - Check whether you are connected to the internetDevice ID & call information - Verification of your phone number during registration",
    "descriptionHTML": "Familonet is a free Locator App that lets you stay connected with the people who matter to you most: your family &amp; friends<br>&#x2605; Real time location tracking on a map &#x2013; you can always see where your child or partner is<br>&#x2605; Automatic push notifications when a family member arrives at or leaves a place such as school. home or office<br>&#x2605; Enhanced safety through the integrated panic button including location sharing<br>&#x2605; Private chat function<br>&#x2605; Locate lost or stolen phones<br>&#x2605; Low battery consumption<br>&#x2605; Very easy to use for children<br><br>INTELLIGENT PLACES: Automatic notifications when family members, like children, grandma or grandpa safely arrive at and leave their daily places - such as school, work or home.<br>CHECK-IN: Share your location with your group members<br><br>REAL-TIME LOCATION SHARING: Share your location and locate / track others in real-time. You choose when and for how long!<br><br>MULTIPLE GROUPS: Create individual groups for all the people in your life: Family, friends, roommates<br>CHAT: Share messages and images with your group members at highest data security standard<br><br>PANIC BUTTON: Enhanced safety &#x2013; send your group members your current location so they can find and help you. Lets parents give their child more freedom and allows the elderly to feel safe<br>PHOTO ALBUM: All your pictures at a glance &#x2013; save every moment shared in your group in a photo album<br> <br>All benefits at a glance:<br>&#x2605; More freedom and less worries for your child, parents and the elderly<br>&#x2605; Locate / track / find lost phones via the GPS tracker<br>&#x2605; Messaging and sharing according to highest standards of data security<br>&#x2605; Allows parents to feel close to their child<br>&#x2605; Children and teens are happy not having to call their parents all the time<br>&#x2605; The elderly feel safe and independent<br>&#x2605; Couples can stay connected thanks to GPS phone tracking<br>&#x2605; Enhanced safety, easier communication, and more freedom!<br>&#x2605; Location-sharing technology made in Germany<br> <br>EASY DAILY LIFE ORGANIZATION AT IT&#x2019;S BEST<br>Enhances daily communication of your family: Parents, children, grandma, grandpa. Also great for couples, friends or roommates.<br><br>To function properly Familonet needs access to: <br>In-app purchases - In-app billing of premium subscriptions<br>Identity - Managing your Familonet user account<br>Contacts - Adding other users to your groups<br>Location - To share your location with your group members<br>SMS - Send invitation SMS to your group members<br>Photos/Media/Files - Send photos and create your profile picture<br>Wi-Fi connection information - Check whether you are connected to the internet<br>Device ID &amp; call information - Verification of your phone number during registration",
    "histogram": {
        "1": 1993,
        "2": 976,
        "3": 2030,
        "4": 4655,
        "5": 11946
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/imexa-VPsAEz6dpagihtsNo07dLp2-sq3Af7-I2NpRUY6ZezDs82oOzj18N3Azb0XQ=h310",
        "//lh3.googleusercontent.com/0ttZAtaNG0BEPAsPm9eIv-JNpaukBX2pLtgbUvgcBSuAbmRfb7lSix0QMdJup6xz_bnQ=h310",
        "//lh3.googleusercontent.com/mmVuPvN-2JgEPxpetCV89StKwYvvPBBIDscLe99hJwPI-3OEo8C-bgncYxAOFHuMlw=h310",
        "//lh3.googleusercontent.com/z9G-a-YqD9O5ctLwU602lp_3fPE_ndP1q4vzCtinANKbMWQ53A1ek99mCIfR0JEYzW9V=h310",
        "//lh3.googleusercontent.com/TwC5vMWVo5a-HxT_TomY3NXl6lRB1RuNaue8m9Oo1gLJACwZhlQy1UzSo825acknsrYq=h310",
        "//lh3.googleusercontent.com/uMo1vJyCrtrmVtkufEYNZBum4N54_mkLxJvA_INZdDOVTtygdIY7SZHT68UmSIIBhA=h310",
        "//lh3.googleusercontent.com/54D8JM5tmpuP1MDtjB5C5MfKHn3EnnDsVS9EG9reb8wrVVcjLzr8Fh0_qn4rflnY8PsA=h310"
    ],
    "video": "https://www.youtube.com/embed/Aupac9jK6VQ",
    "comments": [
        "The developers switched to a monthly subscription model and, instead of adding value to the app, they simply put existing useful features behind a pay wall.  That's a deceptive way of doing business, making this an unreliable service for users concerned about family safety.  For example, the emergency panic button feature now requires a paid account.  Who knows what functionality will be lost next.",
        "This app USED to be great, but now it can never find anyone. Turns out they moved that feature to pay accounts only. I have 4 kids and want to be able to find them all, but now I'm limited and can't do that anymore. It's unfortunate because this was the best app up until it became money required.",
        "Constantly notifying you that you left and arrived left and arrived all the time when you didn't even leave it was a good app then they updated it and now you can only have 3 locations for free. 3 star",
        "Just continues to be unreliable, not showing location of members. Just sits and spins then gives error message of lost connection when none of our phones ever lose connection. Great idea,great look & features,  just doesn't work reliably.",
        "After installation of this app on my phone its asking me for phone no and I input but telling me please enter correct number when I keep entering my own number I had to go recheck my number on my call log if indeed am correct or I made a mistake but seriously am correct with my number. I had to call someone and ask the person of my number and indeed it was still that same number familonet said its not correct. Pls what's happening?",
        "Very impressed with this app. The peace of mind I get with the automatic updates as my family gets to preset places is PRICELESS!! I Do however, wish it was a little more accurate as far as Real Time tracking when my family is on the Move. I bought the premium package so I feel that should be a feature that works as advertised.  Other than that I Love It!!!!"
    ],
    "recentChanges": [
        "• Bug fixes and improvements",
        "• Become a Beta tester via www.familo.net/beta",
        "Give us a chance before writing a bad review. What can we do better? Send your feedback to cedrik@familo.net, Facebook (fb.com/familonet) or Twitter (@familo).",
        "Your Familonet team from Hamburg :)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=net.familo.android&hl=en&gl=us",
    "appId": "net.familo.android"
}