{
    "title": "Notes",
    "summary": "The easiest way to securely organize and save your thoughts.",
    "icon": "//lh4.ggpht.com/oJ0NJs1vxi0g0ohTM23Po-wdOVIi_b04UL1WFvpslpduJq9fh_AL3wX7L34wD6HyNZ8=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.2,
    "reviews": 13842,
    "developer": "Jacob Ras",
    "developerId": "Jacob+Ras",
    "developerEmail": "support@jacobras.nl",
    "developerWebsite": "http://www.notesforandroid.com",
    "developerAddress": "Roggebot 42\n8321 RB Urk\nThe Netherlands",
    "updated": "February 16, 2018",
    "version": "7.2.3",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Notes is the easiest way to keep track of your thoughts and ideas. Organize your notes into notebooks, secure them with a password and synchronize them to all your devices (optionally). Whether you're using a 10-inch tablet or a 4-inch phone, your notes are always within reach. • Stay organizedOrganize your notes into notebooks to keep track of all your thoughts and ideas. • Password protectionKeep your notes private by setting up a password. You can choose to use a text password or a PIN code, depending on your level of security. • Clean user interfaceA beautiful design that is optimized for phones and tablets helps you stay focused on your notes. • Always up-to-dateEnable Dropbox synchronization and your notes will always be within reach on all your Android devices and online at http://www.notesforweb.com.This app is internationally known as \"Notes\" and available in English, French, German, Italian, Spanish, Dutch, Russian, Ukrainian and Czech. Feel free to contact me if you have any questions or feedback. If you like Notes, please rate it.",
    "descriptionHTML": "Notes is the easiest way to keep track of your thoughts and ideas. Organize your notes into notebooks, secure them with a password and synchronize them to all your devices (optionally). Whether you&apos;re using a 10-inch tablet or a 4-inch phone, your notes are always within reach.<br> <br>&#x2022; <b>Stay organized</b><br>Organize your notes into notebooks to keep track of all your thoughts and ideas.<br> <br>&#x2022; <b>Password protection</b><br>Keep your notes private by setting up a password. You can choose to use a text password or a PIN code, depending on your level of security.<br> <br>&#x2022; <b>Clean user interface</b><br>A beautiful design that is optimized for phones and tablets helps you stay focused on your notes.<br> <br>&#x2022; <b>Always up-to-date</b><br>Enable Dropbox synchronization and your notes will always be within reach on all your Android devices and online at http://www.notesforweb.com.<br><br>This app is internationally known as &quot;Notes&quot; and available in English, French, German, Italian, Spanish, Dutch, Russian, Ukrainian and Czech. Feel free to contact me if you have any questions or feedback. If you like Notes, please rate it.",
    "histogram": {
        "1": 919,
        "2": 592,
        "3": 1294,
        "4": 2761,
        "5": 8276
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/IZuCWfPJSS9h28Hp3xvtZnPQa7hFk9N7wkEh_WTyZxwxfToP_p--wjSrFhuEtPL3zQ=h310",
        "//lh3.googleusercontent.com/0XLfJrbqzj516ize24AEib985o5xAp_Cwk2kN3DAw4bVrcIbeX5AIis--jNhqzGa6A=h310",
        "//lh3.googleusercontent.com/RDrpEsU5U8mYppIeWBaQVfodaH9PM5V9AixVZ_ozfxVt_3lkLSkEFdDwSPrYEtF8gA=h310",
        "//lh3.googleusercontent.com/LtHbdDjUBG4rGauHaSC4roBgA75ngkZP0gDQsaRueXahpFcF4XOsI9RG5WdhR9hxYA=h310",
        "//lh3.googleusercontent.com/MIH4OeZlYoBvgBJsPs7tiJPBJKfjTzlc-ZXqHtnOBJCPl9PuAIT3eeLyPZCLK6nLAAA=h310",
        "//lh3.googleusercontent.com/bFSNxenPAxJOFF3fZJy06Q6ITtqjLTfyvuT-FaIswOJHnSYKDbhCDi1jP1vu5Th_xuo=h310",
        "//lh3.googleusercontent.com/9TQ2HL_qpJhntJFRPPl6SGA6AtU0MhVXeTdJZ1Xgo7YyvGyGdf_QYSoV_qxGY6C9mQ=h310",
        "//lh3.googleusercontent.com/oIeZMg7xssYd5ORdCd4XrPUD0ZMl5IPgT2t4WsAbxJ8GKJmaiQRZL4u25OaRhXhtM2o=h310",
        "//lh3.googleusercontent.com/OZsmz7PG540cDqbMmd529xyMWbadPPbxJFtBl4FsiyZG0RRFsRsjAz1ZPdonF0DcqxU=h310",
        "//lh3.googleusercontent.com/a2uBuqGDsHF5cVf6YBXNPXhKGp7zok1w78XTS4Da7H2-cjNsk4-76bfLfo7VVTs60Cs=h310",
        "//lh3.googleusercontent.com/QoIxTrE-cMloypPiDJXGASy3g0c2zVI0rIqrON94fLr1WcMC5sge-7-tpnwU4ItrSoSN=h310",
        "//lh3.googleusercontent.com/RcVTUUKEMBdOU51dtfNjSRucJEhxXPiSxxdWqlYnQvalXDUXpAexKkCb_Hs0qmSOVQ=h310",
        "//lh3.googleusercontent.com/yjh0wLcXLev_mJUQJEaGoAQZIlQmK1RKo6RWqHZ0bAwVfM-XchoYeIQZaLSjN2eh77hQ=h310",
        "//lh3.googleusercontent.com/L6vL_EY4_RnDLNVj_WfzSpFKwTeWC7KagNxlBpnfNjgy_7XxKNhn_JiCaID8Ya3I-Xk=h310"
    ],
    "comments": [
        "This is the notes app to get, especially if you are a Dropbox user. Not much to say really. Works wonderfully! The only thing o_O I could wish for is to be able to save a note without closing it. I have now been using this app for a couple of years and it's on my very small list of must-have apps. A great addition is that you can access you notes in your web browser also. The only thing I miss is to be able to print notes from my phone. Just buy it. It's so worth it supporting development of this great app! After another couple of years this is still one of my most used apps. Just updated and better than ever. Please make the web interface searchable! I keep updating this review since this app is one of the best and most used app on my phone.",
        "Edit: completely stopped working, doesn't go past the password prompt which is a bummer because I have a lot of notes I can't access anymore. Waste of money.    Works as expected, although ever since I updated to Oreo it closes after adding/editing a note or unlocking the app. Hopefully it'll be fixed soon",
        "I like it. But I keep getting conflicted versions from todo lists synced with Dropbox, despite the fact that I'm only editing and viewing the files in the app on a single device. So why are there conflicted versions? Perhaps this happens when I edit a list while offline and then the older Dropbox version is considered to be conflicting while in my opinion it just should be overwritten because it's older. This is a bit of an annoyance.",
        "Been  using it for a few minutes And i've discovered That you cannot move notes from one notebook to another. Also, you cannot Rename A notebook. One other thing i've noticed is that it keeps running in the background. Author does not comment reviews To either acknowledge An issue Or provide solution. Other than these things, I like it. Not ready for primetime.. Use the free edition.",
        "I just love this,  but would love to know how big the memory is.  Can I save a whole book on it? I also love the password function and that I can add many photos. Thank you!",
        "Please add a search function in individual notes otherwise an awesome application"
    ],
    "recentChanges": [
        "Bug fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=nl.jacobras.notes&hl=en&gl=us",
    "appId": "nl.jacobras.notes"
}