{
    "title": "RegioBank - Mobiel Bankieren",
    "summary": "Met Mobiel Bankieren van RegioBank altijd en overal uw bankzaken regelen.",
    "icon": "//lh4.ggpht.com/cwFsSRBYmJKffKCeHCb6lemz_EuY5SOBdnI1HpeFsT1cn3_zXKRnAeSEfwXm9fh7Uso=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 676,
    "developer": "RegioBank",
    "developerId": "RegioBank",
    "developerEmail": "internetverkoop@regiobank.nl",
    "developerWebsite": "https://www.regiobank.nl/particulier/home/klantenservice/mobiel-bankieren.html",
    "updated": "February 27, 2018",
    "version": "2.22.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Met Mobiel Bankieren van RegioBank regelt u altijd en overal makkelijk uw bankzaken. Geld overboeken, uw afschrijvingen bekijken en steeds meer handige functies voor uw particuliere en zakelijke rekeningen (met 1 digipas). Met Mobiel Bankieren van RegioBank kunt u:Bekijken en zoeken- Saldo checken zonder in te loggen- Bij –en afschrijvingen 24 maanden terug bekijken- Bij –en afschrijvingen zoeken tot 24 maanden terug- Geplande incasso’s en andere betalingen bekijken- Hypotheekgegevens bekijken- Herkent u een transactie niet? Zoek via Google- Vergelijkbare betalingen zoekenGeld overmaken- Geld overmaken met mobiele pincode, vingerafdruk of de digipas - Geld overmaken naar eigen rekeningen- Geld overmaken naar elk Europees rekeningnummer binnen het SEPA-gebied- Betalen met iDEAL- Acceptgiro’s scannen- Betalingen inplannen- Terugkerende betalingen inplannen- Betalingen bewaren en later verzenden- Status van uw betaling bekijken- Betaling kopiëren- Geplande incasso’s vooraf weigeren- Contact opslaan in uw adresboek- Adresboek: contacten toevoegen, wijzigen en verwijderen- Bevestiging van uw betaling in PDFExtra instellingen Mobiel ankieren- Inloggen met mobiele pincode- Inloggen met vingerafdruk- Daglimiet mobiele pincode wijzigen- Mobiele pincode wijzigen- Geld overmaken naar onbekende rekeningen met mobiele pincode- Meerdere gebruikers toevoegen op uw toestelPersoonlijk overzicht- Geef uw rekening een naam- Wijzig de volgorde van uw rekening- Kies welke rekening(en) u wilt tonenFinancieel inzicht- Inzicht in uitgaven: weet waar uw geld blijft- Bekijk het verloop van uw saldo- Inzicht in geplande betalingen: weet wat eraan komt- Inzicht in rente: weet welke rente u krijgt en betaalt- Inzicht in uw spaargeld: stop uw geld in spaarpottenPasgebruik zelf wijzigen- Pinnen buiten Europa aan- en uitzetten- Contactloos betalen aan- en uitzetten- Pinlimiet tijdelijk verhogen (1 dag)- Betaalpas blokkeren en deblokkeren- Betaalpas activerenBerichten en alerts- Saldo- en transactie-attenties instellen- Persoonlijke tips en serviceberichten ontvangen in uw inboxHulp en contact- Betaalpas kwijt of verloren? Zó opgelost met de extra hulp- De contactgegevens van uw Adviseur inzien- Geef uw mening: wat zou u in de app willen?- Tips over veilig Mobiel Bankieren- Bekijk wat handig en nieuw is in de app- Veelgestelde vragen bekijkenSmartwatch- Saldo checken op uw Android Wear smartwatchMakkelijk inloggen en overboekenMeldt u 1 keer aan met uw digipas of digicode en bedenk een pincode voor uw app. Daarmee kunt u voortaan makkelijk en snel inloggen en overboeken.Voor wie?- Particuliere rekeningen- Zakelijke rekeningen met 1 digipasVeiligheidMobiel Bankieren is net zo veilig als Internet Bankieren. Voor de veiligheid is het niet mogelijk om uw app te kopiëren naar een andere telefoon. Heeft u een nieuwe telefoon? Dan moet u de app opnieuw downloaden. Verwijder de app ook van uw oude telefoon als u die niet meer gebruikt of deactiveer de app in Internet Bankieren.Blijf meedenken!Schrijf in een review wat u vindt of wat u mist. We lezen uw reactie. Zo maken we Mobiel Bankieren van RegioBank beter!",
    "descriptionHTML": "Met Mobiel Bankieren van RegioBank regelt u altijd en overal makkelijk uw bankzaken. Geld overboeken, uw afschrijvingen bekijken en steeds meer handige functies voor uw particuliere en zakelijke rekeningen (met 1 digipas). <br><br>Met Mobiel Bankieren van RegioBank kunt u:<br><br>Bekijken en zoeken<br>- Saldo checken zonder in te loggen<br>- Bij &#x2013;en afschrijvingen 24 maanden terug bekijken<br>- Bij &#x2013;en afschrijvingen zoeken tot 24 maanden terug<br>- Geplande incasso&#x2019;s en andere betalingen bekijken<br>- Hypotheekgegevens bekijken<br>- Herkent u een transactie niet? Zoek via Google<br>- Vergelijkbare betalingen zoeken<br><br>Geld overmaken<br>- Geld overmaken met mobiele pincode, vingerafdruk of de digipas <br>- Geld overmaken naar eigen rekeningen<br>- Geld overmaken naar elk Europees rekeningnummer binnen het SEPA-gebied<br>- Betalen met iDEAL<br>- Acceptgiro&#x2019;s scannen<br>- Betalingen inplannen<br>- Terugkerende betalingen inplannen<br>- Betalingen bewaren en later verzenden<br>- Status van uw betaling bekijken<br>- Betaling kopi&#xEB;ren<br>- Geplande incasso&#x2019;s vooraf weigeren<br>- Contact opslaan in uw adresboek<br>- Adresboek: contacten toevoegen, wijzigen en verwijderen<br>- Bevestiging van uw betaling in PDF<br><br>Extra instellingen Mobiel ankieren<br>- Inloggen met mobiele pincode<br>- Inloggen met vingerafdruk<br>- Daglimiet mobiele pincode wijzigen<br>- Mobiele pincode wijzigen<br>- Geld overmaken naar onbekende rekeningen met mobiele pincode<br>- Meerdere gebruikers toevoegen op uw toestel<br><br>Persoonlijk overzicht<br>- Geef uw rekening een naam<br>- Wijzig de volgorde van uw rekening<br>- Kies welke rekening(en) u wilt tonen<br><br>Financieel inzicht<br>- Inzicht in uitgaven: weet waar uw geld blijft<br>- Bekijk het verloop van uw saldo<br>- Inzicht in geplande betalingen: weet wat eraan komt<br>- Inzicht in rente: weet welke rente u krijgt en betaalt<br>- Inzicht in uw spaargeld: stop uw geld in spaarpotten<br><br>Pasgebruik zelf wijzigen<br>- Pinnen buiten Europa aan- en uitzetten<br>- Contactloos betalen aan- en uitzetten<br>- Pinlimiet tijdelijk verhogen (1 dag)<br>- Betaalpas blokkeren en deblokkeren<br>- Betaalpas activeren<br><br>Berichten en alerts<br>- Saldo- en transactie-attenties instellen<br>- Persoonlijke tips en serviceberichten ontvangen in uw inbox<br><br>Hulp en contact<br>- Betaalpas kwijt of verloren? Z&#xF3; opgelost met de extra hulp<br>- De contactgegevens van uw Adviseur inzien<br>- Geef uw mening: wat zou u in de app willen?<br>- Tips over veilig Mobiel Bankieren<br>- Bekijk wat handig en nieuw is in de app<br>- Veelgestelde vragen bekijken<br><br>Smartwatch<br>- Saldo checken op uw Android Wear smartwatch<br><br>Makkelijk inloggen en overboeken<br>Meldt u 1 keer aan met uw digipas of digicode en bedenk een pincode voor uw app. Daarmee kunt u voortaan makkelijk en snel inloggen en overboeken.<br>Voor wie?<br>- Particuliere rekeningen<br>- Zakelijke rekeningen met 1 digipas<br><br>Veiligheid<br>Mobiel Bankieren is net zo veilig als Internet Bankieren. Voor de veiligheid is het niet mogelijk om uw app te kopi&#xEB;ren naar een andere telefoon. Heeft u een nieuwe telefoon? Dan moet u de app opnieuw downloaden. Verwijder de app ook van uw oude telefoon als u die niet meer gebruikt of deactiveer de app in Internet Bankieren.<br><br>Blijf meedenken!<br>Schrijf in een review wat u vindt of wat u mist. We lezen uw reactie. Zo maken we Mobiel Bankieren van RegioBank beter!",
    "histogram": {
        "1": 86,
        "2": 42,
        "3": 67,
        "4": 156,
        "5": 325
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/v2n333FUWf8Jd3aN4TKqDJpDYzygKMz8A7lt250pSi9YdHTvdJQ2fah6zHlvFiRacQ9t=h310",
        "//lh3.googleusercontent.com/Hg9PKymk4c5kd-k7ebuDNG6Bt6h3afYvi0_pxnT7GNUOfPvItjl_Bc9vOwgUa3N_o1k=h310",
        "//lh3.googleusercontent.com/I26TSEjf0PeG7MNwLnf-2DCL9sFvrpBUlMw1DQxPigupXvT1JQQhJMNGgqP0OLOA96Cg=h310",
        "//lh6.ggpht.com/WlyaKBQCYqipgz1RWKIvBhvxXewvHlpjL3KRxvWuLv7eDTziOyY9i9C_8BTO-SFG4nU=h310",
        "//lh5.ggpht.com/M-pc4mbr6WeX_ehA-sA2jk2gDjtB-nGXarwhNs4v7F7b_6sUxnwVfVB4kj8n_eeO_GQ=h310",
        "//lh3.googleusercontent.com/VKaS_cCPGLqgBwb8ggLEhWtvtfVI6MTw2NBZf-ePFnipI-X21ucUSEvEOGGVGC0ovHM=h310",
        "//lh3.ggpht.com/UQpMuUwW90sp0cdSY6IS9_ldUJHxpD0kwLvZtxI0-dIAmnOWZ1oC1g-hIKRSfNU1Fao=h310",
        "//lh3.googleusercontent.com/y9Fw_h6NX0Nf6NDnLkjrr0ir0RRRFQjahX2WlWhWl4ARGdEc6FivXi7-YqARorsJV3o=h310",
        "//lh3.ggpht.com/uXh3V-KGckH-J_u-qJZW7X5_Y7KaLBf9QQ7TsmSPF2qudJdNy3joZ15ZahPFh7zBWAM=h310",
        "//lh3.googleusercontent.com/Yst9mx_9aHCeaBXkIQqOyt2CCK2-EC7b2-VQhU6e2AWPqcmuPqeN9FcEx2uqC4w0yo8=h310",
        "//lh4.ggpht.com/9JVWrzVirhG4t_Rm-qTf-O0Ayp9mfq7zfPIj5V-yF2Ue1lw0i9yBuLe1pBKk_Pop1erX=h310",
        "//lh4.ggpht.com/xB45GGgFdIPrzM8R5zhrWKM4QIQvzfQX3KEX9H2NZgsh4mRCU17BiJQ-3v2CqBvqoh4=h310",
        "//lh5.ggpht.com/2LxCTFKlm0w3_ckPRvT3V6HqOWQQtUx3HsQraJ1FzbIlPjaKNEm5IN3zMOU_8EHU0u4=h310",
        "//lh6.ggpht.com/BjqQcU-1rDTaWoYBZG-SY0Nh2gTidR-pCN1n9xe6d1J_D54mHxTeVr7xBq2s0yANZsk=h310",
        "//lh3.googleusercontent.com/RdUMANXWgq3mr2B1Xq87oxBVtL1ru97oBW0fzR9QFu_6N3VG_YzTQg0IEVOhTnVe5R4Q=h310",
        "//lh6.ggpht.com/EHHIjCSj6JRlbKsW0rJw7E6HW6Uc_DKREo2D3t-ec6ofVZ9l274PQK-qBcA46vHM5pV9=h310",
        "//lh6.ggpht.com/A_w-q-2OgKbG3kSLlguOm61zrkvm9U-5lQYKJgingPhmYAIv_O2ZL_cO9HTix-qr5Wg=h310",
        "//lh5.ggpht.com/Z45WOXsf7Ex5cVY_fIddbIYOkClI3quBW4e2hokuNLVRrdVGTyE5H2c68ME6gwIIOQ=h310",
        "//lh3.ggpht.com/ul8euVpTZz-YB6vCdA-2xOqxo0ZMUfWvb8f0qxFEM5BjEAt8SPSosknSZeKAa73Ht_g=h310",
        "//lh3.ggpht.com/5J4u4hY18f90ET05fgbm_q6istkdFpf124F4E-cjfv4UxUdfVdKm_DtNL6ooegYdjA=h310",
        "//lh4.ggpht.com/AJKEj2L4he6j_CtmpQpb6n71gHG7xeYMzNLFEeEb4WXK_trOc-uV09fHNUr-9xsuozs=h310"
    ],
    "video": "https://www.youtube.com/embed/S1_lEKozV7k",
    "comments": [
        "Prima app zonder flauwekul",
        "Helaas nog geen contactloos betalen.",
        "Handige app, inloggen met fingerprint werkt. Echter laat het inzicht te wensen over, maandelijkse overboekingen zijn niet in te delen en er ontbreken transacties.",
        "Het zou fijn zijn als je met deze app contactloos zou kunnen betalen met NFC. Andere banken ondersteunen dit al wel.",
        "De app kan nog steeds niet een zakelijke rekening laten zien waar 2 of meer digipassen zijn. Duurt erg lang",
        "eenvoudig, maar fijn"
    ],
    "recentChanges": [
        "Wat is er nieuw in versie 2.22?",
        "- Heeft u een betaalrekening bij SNS of ASN Bank? Dan kunt u deze rekening toevoegen aan de app zodat deze zichtbaar wordt in uw rekeningoverzicht.",
        "- Met minder stappen snel en makkelijk uw iDEAL-betaling afronden.",
        "- Verbeteringen in de stabiliteit van de app, het design en oplossen van technische fouten."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=nl.regiobank.regiobankieren&hl=en&gl=us",
    "appId": "nl.regiobank.regiobankieren"
}