{
    "title": "SNS Mobiel Bankieren",
    "summary": "Met SNS Mobiel Bankieren regel je altijd en overal makkelijk je bankzaken.",
    "icon": "//lh3.ggpht.com/5WbsYQUs7hRC5ssri1LqfaPNi-3qjpHYxHRyQNyykWw8y76IlDPr1HhCqe11e4Dujg=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 3.9,
    "reviews": 3632,
    "developer": "SNS Bank",
    "developerId": "SNS+Bank",
    "developerEmail": "info@sns.nl",
    "developerWebsite": "https://www.snsbank.nl/particulier/service/mobiel-bankieren-bij-sns.html",
    "updated": "February 27, 2018",
    "version": "3.22.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Met SNS Mobiel Bankieren regel je altijd en overal makkelijk je geldzaken. Je bij- en afschrijvingen bekijken, geld overboeken, bankieren met je particuliere en zakelijke rekeningen (met 1 digipas). Ben je nog geen klant? Open eenvoudig en snel je rekening in de app. Met SNS Mobiel Bankieren kun je:Bekijken en zoeken- Saldo checken zonder in te loggen- Bij- en afschrijvingen 24 maanden terug bekijken- Bij- en afschrijvingen zoeken tot 24 maanden terug - Creditcardgegevens bekijken tot 12 maanden terug- Geplande incasso’s en andere betalingen bekijken- Hypotheekgegevens bekijken- Herken je een transactie niet? Zoek via Google- Vergelijkbare betalingen zoekenGeld overmaken- Geld overmaken met mobiele pincode, vingerafdruk of digipas- Geld overmaken naar eigen rekeningen- Geld overmaken naar elk Europees rekeningnummer binnen het SEPA-gebied.- Betalen met iDEAL- Acceptgiro’s scannen- Betalingen inplannen- Terugkerende betalingen inplannen- Betalingen bewaren en later verzenden- Status van je betaling bekijken- Betaling kopiëren- Geplande incasso’s vooraf weigeren- Contact opslaan in je adresboek- Adresboek: contacten toevoegen, wijzigen en verwijderen- Bevestiging van je betaling in PDFExtra instellingen mobiel bankieren- Inloggen met mobiele pincode- Inloggen met vingerafdruk- Daglimiet mobiele pincode wijzigen- Mobiele pincode wijzigen- Geld overmaken naar onbekende rekeningen met mobiele pincode- Meerdere gebruikers toevoegen op je toestelPersoonlijk overzicht- Geef je rekening een naam- Wijzig de volgorde van je rekening- Kies welke rekening(en) je wilt tonenFinancieel inzicht- Inzicht in uitgaven: weet waar je geld blijft- Saldografiek: bekijk het verloop van je saldo- Inzicht in geplande betalingen: weet wat eraan komt- Inzicht in rente: weet welke rente je krijgt en betaalt- Inzicht in je spaargeld: stop je geld in spaarpottenPasgebruik zelf wijzigen- Pinnen buiten Europa aan- en uitzetten- Contactloos betalen aan- en uitzetten- Pinlimiet tijdelijk verhogen (1 dag)- Betaalpas blokkeren en deblokkeren- Betaalpas activerenBerichten en alerts- Saldo- en transactie-attenties instellen- Persoonlijke tips en serviceberichten ontvangen in je inboxHulp en contact- Betaalpas kwijt of verloren? Zó opgelost met de extra hulp- Stel je vraag in de app- Contact opnemen met SNS Klantenservice- Geef je mening: wat zou je in de app willen?- Tips over veilig mobiel bankieren- Bekijk wat handig en nieuw is in de app- Veelgestelde vragen bekijkenSmartwatch- Saldo checken op je Android Wear smartwatchRekening openen- Nog geen klant? Open snel je rekening met de app- Bestaande klant? Open een nieuwe spaar- of betaalrekening in je overzichtMakkelijk inloggen en overboekenMeld je 1 keer aan met je digipas of digicode en bedenk een pincode voor je app. Daarmee kun je voortaan makkelijk en snel inloggen en overboeken.Voor wie?•\tParticuliere rekeningen•\tZakelijke rekeningen met 1 digipasVeiligheidMobiel bankieren is net zo veilig als internetbankieren. Voor de veiligheid is het niet mogelijk om je app te kopiëren naar een andere telefoon. Heb je een nieuwe telefoon? Dan moet je de app opnieuw downloaden. Verwijder de app ook van je oude telefoon als je die niet meer gebruikt of deactiveer de app in Mijn SNS.Blijf meedenken!Schrijf in een review in de store wat je goed vindt of wat je mist. We lezen en gebruiken je reactie. Zo maken we SNS Mobiel Bankieren steeds beter!",
    "descriptionHTML": "Met SNS Mobiel Bankieren regel je altijd en overal makkelijk je geldzaken. Je bij- en afschrijvingen bekijken, geld overboeken, bankieren met je particuliere en zakelijke rekeningen (met 1 digipas). Ben je nog geen klant? Open eenvoudig en snel je rekening in de app. Met SNS Mobiel Bankieren kun je:<br><br>Bekijken en zoeken<br>- Saldo checken zonder in te loggen<br>- Bij- en afschrijvingen 24 maanden terug bekijken<br>- Bij- en afschrijvingen zoeken tot 24 maanden terug <br>- Creditcardgegevens bekijken tot 12 maanden terug<br>- Geplande incasso&#x2019;s en andere betalingen bekijken<br>- Hypotheekgegevens bekijken<br>- Herken je een transactie niet? Zoek via Google<br>- Vergelijkbare betalingen zoeken<br><br><br>Geld overmaken<br>- Geld overmaken met mobiele pincode, vingerafdruk of digipas<br>- Geld overmaken naar eigen rekeningen<br>- Geld overmaken naar elk Europees rekeningnummer binnen het SEPA-gebied.<br>- Betalen met iDEAL<br>- Acceptgiro&#x2019;s scannen<br>- Betalingen inplannen<br>- Terugkerende betalingen inplannen<br>- Betalingen bewaren en later verzenden<br>- Status van je betaling bekijken<br>- Betaling kopi&#xEB;ren<br>- Geplande incasso&#x2019;s vooraf weigeren<br>- Contact opslaan in je adresboek<br>- Adresboek: contacten toevoegen, wijzigen en verwijderen<br>- Bevestiging van je betaling in PDF<br><br>Extra instellingen mobiel bankieren<br>- Inloggen met mobiele pincode<br>- Inloggen met vingerafdruk<br>- Daglimiet mobiele pincode wijzigen<br>- Mobiele pincode wijzigen<br>- Geld overmaken naar onbekende rekeningen met mobiele pincode<br>- Meerdere gebruikers toevoegen op je toestel<br><br>Persoonlijk overzicht<br>- Geef je rekening een naam<br>- Wijzig de volgorde van je rekening<br>- Kies welke rekening(en) je wilt tonen<br><br>Financieel inzicht<br>- Inzicht in uitgaven: weet waar je geld blijft<br>- Saldografiek: bekijk het verloop van je saldo<br>- Inzicht in geplande betalingen: weet wat eraan komt<br>- Inzicht in rente: weet welke rente je krijgt en betaalt<br>- Inzicht in je spaargeld: stop je geld in spaarpotten<br><br>Pasgebruik zelf wijzigen<br>- Pinnen buiten Europa aan- en uitzetten<br>- Contactloos betalen aan- en uitzetten<br>- Pinlimiet tijdelijk verhogen (1 dag)<br>- Betaalpas blokkeren en deblokkeren<br>- Betaalpas activeren<br><br>Berichten en alerts<br>- Saldo- en transactie-attenties instellen<br>- Persoonlijke tips en serviceberichten ontvangen in je inbox<br><br>Hulp en contact<br>- Betaalpas kwijt of verloren? Z&#xF3; opgelost met de extra hulp<br>- Stel je vraag in de app<br>- Contact opnemen met SNS Klantenservice<br>- Geef je mening: wat zou je in de app willen?<br>- Tips over veilig mobiel bankieren<br>- Bekijk wat handig en nieuw is in de app<br>- Veelgestelde vragen bekijken<br><br>Smartwatch<br>- Saldo checken op je Android Wear smartwatch<br><br>Rekening openen<br>- Nog geen klant? Open snel je rekening met de app<br>- Bestaande klant? Open een nieuwe spaar- of betaalrekening in je overzicht<br><br>Makkelijk inloggen en overboeken<br>Meld je 1 keer aan met je digipas of digicode en bedenk een pincode voor je app. Daarmee kun je voortaan makkelijk en snel inloggen en overboeken.<br>Voor wie?<br>&#x2022;\tParticuliere rekeningen<br>&#x2022;\tZakelijke rekeningen met 1 digipas<br>Veiligheid<br>Mobiel bankieren is net zo veilig als internetbankieren. Voor de veiligheid is het niet mogelijk om je app te kopi&#xEB;ren naar een andere telefoon. Heb je een nieuwe telefoon? Dan moet je de app opnieuw downloaden. Verwijder de app ook van je oude telefoon als je die niet meer gebruikt of deactiveer de app in Mijn SNS.<br><br>Blijf meedenken!<br>Schrijf in een review in de store wat je goed vindt of wat je mist. We lezen en gebruiken je reactie. Zo maken we SNS Mobiel Bankieren steeds beter!",
    "histogram": {
        "1": 440,
        "2": 220,
        "3": 368,
        "4": 900,
        "5": 1704
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/tza3ABCl-zEcwYHkL4VBT9IpL9Xs-BUSdN4m3jKEPEwnb9Vn4c7iXiF6iJcoZ5EQG0M=h310",
        "//lh3.googleusercontent.com/6cEO05UXsj0oABn4Yamm17gXO0m2i1vIFoMNtRNNaebGqEWSX_BfKgneXra2Si5o_w=h310",
        "//lh3.googleusercontent.com/_a7LDJZ_eNtNKLlzKvoRC5RFkQgcXWZPQwkz8efNO-H4aaOd9SmQqTa8Ad8Ku1mQih2b=h310",
        "//lh3.googleusercontent.com/37lTgf7Provva5nudZ5uPVnOOnIAUXIf5_LqKUul3FKgmDJDZhkY1Woa-jRmLHVSyqIa=h310",
        "//lh3.googleusercontent.com/ky9caYFBigU1Zm9aRNIUiP4wBmQu3v9VgJQWVI1So59UOcegzA5CMuGmeSMgskHhnw=h310",
        "//lh3.googleusercontent.com/eklt1fFkhUEj8UUaaQ8zT04q9-uE_OWzOxbIMkK9BpWJKOOtOMydY-ppVYDybWl1vk8=h310",
        "//lh3.googleusercontent.com/Z-2M-JVT6ikbxTyYhuImNfIrf_krZw2uf3mQNdsv8x8fzi0IWzAW-A1fHQy41Mox7g=h310",
        "//lh3.googleusercontent.com/OhSya3TQQOyRA65b0Rc3Gvt1CEg3qaUlAAhdZbNmpGtC8G66Oy4eZS3_HuOfWpUsKpoZ=h310",
        "//lh3.googleusercontent.com/2ePYmYYKr7X6YBBAKJQj180qT4QKPe502B5x3se-OSAP7JxvmE32GCvXgloQqd14f-Wr=h310",
        "//lh3.googleusercontent.com/pEvHXwEIYAc-YWL60j4Zav-CIHhdJHf_mTE0twDYrysOWmYpf6wP7l37NZv0q0kD8s8=h310",
        "//lh3.googleusercontent.com/fOmV-NqnMQpIKrsBNz-sky801_ahsKFj5YpFLfrUUJMsDF-t8im0HwS0gtM0tMgvs-0=h310",
        "//lh3.googleusercontent.com/9ROv9scXyr8fxFHFoSCtrA41QLjJFGpCBltvvnJIoKSaPYZF0FIImwQtL8VMFqM0Jfk=h310",
        "//lh3.googleusercontent.com/TCF5iprynm4b1eyGZJcl4lHOg7_zscwFLPt4Z6XlsPLVtlre-17l7yVqECDh4fkNWw=h310",
        "//lh3.googleusercontent.com/0DvHHH6vakIQY6TShqbIcrt_3iimRsimWG76xSrXp8FsQPFVARLUKZrA0NHuNVZclsnk=h310",
        "//lh3.googleusercontent.com/i1cYtBMJqLj8Di5utksiA5Wm2oTeDmFmOhFotkMGyWAmZv_DJ0IzeSfEkFoWvJyfPIA=h310"
    ],
    "video": "https://www.youtube.com/embed/enU9Qo1vscw",
    "comments": [
        "Is goed zo. Maak er geen bloatware van waar veel ontwikkelaars op een gegeven moment last van krijgen.",
        "Eerst kon je je overschrijvingen heel makkelijk in categorieen indelen. En zo je uitgave patroon inzichtelijk maken. Helaas kan ik dat nergens meer vinden",
        "Waarom is de naam aangepast naar Bankieren en niet gewoon SNS Mobiel Bankieren in de naam?",
        "acceptgiro is not working with new version",
        "Vervelend, eerste keer  online, daarna telkens op nieuw registreren. App is nog niet volwassen",
        "Vraagt om root-privileges!?! Heel verdacht."
    ],
    "recentChanges": [
        "- Met minder stappen snel en makkelijk je iDEAL-betaling afronden.",
        "- De app is stabieler, het design is verbeterd en technische fouten zijn opgelost.",
        "Met al jullie feedback blijven we de SNS Mobiel Bankieren app verbeteren. Bedankt!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=nl.snsbank.snsbankieren&hl=en&gl=us",
    "appId": "nl.snsbank.snsbankieren"
}