{
    "title": "TV Overalt",
    "summary": "Altibox TV EverywhereWatch TV where you want your home - on tablet, mobile or pc",
    "icon": "//lh3.googleusercontent.com/Ub0QDrIOinrHHS1kn7cKq8MjKYfNfDeTZq_sVnUaq2z2B698SdO3c-za8PXV--LWmA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.1,
    "reviews": 1677,
    "developer": "Altibox AS",
    "developerId": "Altibox+AS",
    "developerEmail": "apps@altibox.no",
    "developerWebsite": "http://www.altibox.no",
    "developerAddress": "Breiflåtveien 18, 4017 Stavanger",
    "updated": "February 6, 2018",
    "version": "4.2.0",
    "genre": "Video Players & Editors",
    "genreId": "VIDEO_PLAYERS",
    "description": "Vi har to ulike Altibox-apper. Velg denne appen dersom du har fjernkontrollen hvor Altibox-logoen er påtrykket nederst- og ikke står som egen sølvfarget knapp.Se tv- Velg mellom over 40 tv-kanaler- Velg kanal ved å trykke på en kanallogo- Sveip for å skifte mellom kanaler- Dra tidsindikatoren til venstre for å spole tilbake opptil 3 timer på mange av kanalene- Sett på pause og hopp fremover ved å dra tidsindikatoren til høyre- Start et program forfraLei, kjøp og last ned filmer og serier- Velg Film og Serier i menyen- Enkelt å navigere gjennom kategorier eller søk- Trykk Lei eller Kjøp film- Innholdet er tilgjengelig i 48 timer ved leie. Ingen tidsbegrensning ved kjøp- Last ned kjøpt innhold og ta det med hvor du vil på mobile enheterFjernstyr opptak på din tv-dekoder- Åpne tv-guiden- Trykk på et program- Velg hvilken dekoder du vil ta opp programmet med- Velg Ta opp Planlegg med tv-guiden- Åpne tv-guiden- Dra ned/opp for å se hva ulike kanaler sender- Dra mot venstre/høyre for å se hva som kommer fremover i tid- Trykk på program for å få mulighet for å gå til kanalenAndroid WearAltibox TV Overalt kan nå brukes på din Android Wear. Installer den nye versjonen av TV Overalt, og du vil automatisk få vår nye Android Wear-app overført til din klokke, hvor du kan gjøre følgende:- Bla i tv-guiden for alle kanaler- Sett programmer til opptak og serieopptak på din dekoder- Sett på varsling når et program skal starte- Sett på automatisk kanalbytte på din dekoder når et program starter Slik kommer du i gang- Last ned og start Altibox TV Overalt-appen - Se tv, kjøpte og leide filmer uten å logge inn, når du er hjemme- Når du ikke er hjemme må du logge inn for å styre opptak på din dekoder, samt se mange av tv-kanalene dine og kjøpte og leide filmer. Rettighetsbestemmelser fra tv-kanaler og filmselskaper begrenser antall kanaler som kan vises i Altibox TV Overalt. Kanalutvalget er derfor forskjellig om du er utenfor eller innenfor husstanden.",
    "descriptionHTML": "Vi har to ulike Altibox-apper. Velg denne appen dersom du har fjernkontrollen hvor Altibox-logoen er p&#xE5;trykket nederst- og ikke st&#xE5;r som egen s&#xF8;lvfarget knapp.<br><br>Se tv<br>- Velg mellom over 40 tv-kanaler<br>- Velg kanal ved &#xE5; trykke p&#xE5; en kanallogo<br>- Sveip for &#xE5; skifte mellom kanaler<br>- Dra tidsindikatoren til venstre for &#xE5; spole tilbake opptil 3 timer p&#xE5; mange av kanalene<br>- Sett p&#xE5; pause og hopp fremover ved &#xE5; dra tidsindikatoren til h&#xF8;yre<br>- Start et program forfra<br><br>Lei, kj&#xF8;p og last ned filmer og serier<br>- Velg Film og Serier i menyen<br>- Enkelt &#xE5; navigere gjennom kategorier eller s&#xF8;k<br>- Trykk Lei eller Kj&#xF8;p film<br>- Innholdet er tilgjengelig i 48 timer ved leie. Ingen tidsbegrensning ved kj&#xF8;p<br>- Last ned kj&#xF8;pt innhold og ta det med hvor du vil p&#xE5; mobile enheter<br><br>Fjernstyr opptak p&#xE5; din tv-dekoder<br>- &#xC5;pne tv-guiden<br>- Trykk p&#xE5; et program<br>- Velg hvilken dekoder du vil ta opp programmet med<br>- Velg Ta opp<br> <br>Planlegg med tv-guiden<br>- &#xC5;pne tv-guiden<br>- Dra ned/opp for &#xE5; se hva ulike kanaler sender<br>- Dra mot venstre/h&#xF8;yre for &#xE5; se hva som kommer fremover i tid<br>- Trykk p&#xE5; program for &#xE5; f&#xE5; mulighet for &#xE5; g&#xE5; til kanalen<br><br>Android Wear<br>Altibox TV Overalt kan n&#xE5; brukes p&#xE5; din Android Wear. Installer den nye versjonen av TV Overalt, og du vil automatisk f&#xE5; v&#xE5;r nye Android Wear-app overf&#xF8;rt til din klokke, hvor du kan gj&#xF8;re f&#xF8;lgende:<br>- Bla i tv-guiden for alle kanaler<br>- Sett programmer til opptak og serieopptak p&#xE5; din dekoder<br>- Sett p&#xE5; varsling n&#xE5;r et program skal starte<br>- Sett p&#xE5; automatisk kanalbytte p&#xE5; din dekoder n&#xE5;r et program starter <br><br>Slik kommer du i gang<br>- Last ned og start Altibox TV Overalt-appen <br>- Se tv, kj&#xF8;pte og leide filmer uten &#xE5; logge inn, n&#xE5;r du er hjemme<br>- N&#xE5;r du ikke er hjemme m&#xE5; du logge inn for &#xE5; styre opptak p&#xE5; din dekoder, samt se mange av tv-kanalene dine og kj&#xF8;pte og leide filmer.<br> <br>Rettighetsbestemmelser fra tv-kanaler og filmselskaper begrenser antall kanaler som kan vises i Altibox TV Overalt. Kanalutvalget er derfor forskjellig om du er utenfor eller innenfor husstanden.",
    "histogram": {
        "1": 537,
        "2": 158,
        "3": 175,
        "4": 284,
        "5": 523
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Teen",
    "screenshots": [
        "//lh6.ggpht.com/wkS2A7UMIO2uslCeD2rHsGLkLTCp_Bydg2gD-cdiIx875FHToAgniSq89Gdc2HG60y0=h310",
        "//lh5.ggpht.com/Ny-SBJ_svprx5saFBQ_yFBn2tdCKiAavsxAVJdzmyO8BCTqt8MN0cGgz_RsWJt7HAkx4=h310",
        "//lh3.ggpht.com/NfA5qVO-_sYwaXisbGwLOp7lLQEn3YPbb5W0BTSFZ63l8XxbCGrHF3-nWO0Jz5qW7pw=h310",
        "//lh6.ggpht.com/ZxoEl_IAq3447M8WzPokvqugz9lhXW8hQqo92OGWS0ojKEDgLOJAwSBIJ7fRiTTcOFo=h310",
        "//lh4.ggpht.com/6OqGO70xGPc6FqTyyXo_KXDDs2wWh66ntE82jbXWbrHzR9lBs9LSWaziDFLBtlGDH5uQ=h310",
        "//lh3.ggpht.com/qDQrF-yNwoDtPzOAY1ZvI3upkHNpq2Uz8mohUGtTy9frjMmKDulvKuth-myDde5y-RM=h310",
        "//lh4.ggpht.com/yMgcfdAjubHDANsOegZ2bDNx4_Hv1awc6q3Nxwv-383XwK3piYoyimG_EQykrjnpahw=h310",
        "//lh6.ggpht.com/qumqHP40Er5sc3ZbeRGbjrQvhERYM0r015RRK8FgLjY9ocVow5dngW5kWhTm5_ZG4A=h310",
        "//lh3.ggpht.com/Hyc7a7CWVZoTY_MfYggwqT8RZvfemxMpm49WYE2ztCFkbLLGXXV_vJ5WEDwUnNyn5NYz=h310",
        "//lh4.ggpht.com/-TFFRH_9LlnAQl1vtSi8KaaI3lIDxAh3Fib-5w1NBNNJvUdWAiWFxiGvyHtZSoPCYw=h310",
        "//lh6.ggpht.com/XiptComEtKkIsgXySaR82GbXj3PkvEy8KiE_BbojX7lCGZT-R-fH4Z-qqM5-n-LCKQsi=h310",
        "//lh3.ggpht.com/b6pbFZvOeJ1S4e53aueI0OE8E1SE4TB02DDKHXbqBhGQASBj8G6IngSULdWbgLeAdak=h310",
        "//lh4.ggpht.com/3KKzlAkS6hb5lA6UctYVxwnnpkDqvaadQHa39S4gxzJri-slPOfKRYphreaf_lIM7g=h310",
        "//lh3.ggpht.com/AaMI5WnrquECteelBwSZ3n5XjsZ5eofIMdqkoJ2EfvPiI4JTUK0Jn_ZTJnnnoqQF4yw=h310",
        "//lh5.ggpht.com/q4hhIDg4fV96y1eR0EGM5AoXfEaBwEb2UsCDuS6Ac78fWjOqKP-wrTWE3Qq1aPPNKQ=h310",
        "//lh5.ggpht.com/rkEcghKxKx93e60PMTzaAqjIxfYNgGYQhJ0XEUbCWU1clo7O9G1UaXBT6kVsxWJmB3M=h310",
        "//lh5.ggpht.com/OHRtFwT3SwdPBlyFIcPyIMIZqvocADzEUwiaSvJTUE22ZZzTGHhBb2IELSAPA0kg3lg=h310",
        "//lh4.ggpht.com/8ooBcFRle541hvUROzqIW-UvAg7GxS5bA6w3ux-yCDHvH8sZgEwUPR2E8gkdeXkGS3s=h310",
        "//lh3.googleusercontent.com/DsQC3aZFFRBK-r_2u6SdXOuq99ZNbxzBrQhDBV8yRbQDl4hqNRQPmXbcQ0TZwhmKUXk=h310"
    ],
    "comments": [
        "Seems like the fatal error - 3 problem is fixed. Works perfectly now (except app sometimes crashes when running in the background). But would wish they removed the side-swipe to change channel, or changed it to rewind/fast forward 30 seconds.",
        "Februar 2018. Chromecast er like ustabilt som alltid. Hopper over i \"Ready for a bigger experience?\" eller \"Something erong happened. Please try again\". Alle andre apper jeg har fungerer 100% med cadt",
        "Skulle gjerne ha brukt den mer hadde ChromeCast virket skikkelig. NRK-appen derimot fungerer helt perfekt.",
        "Chromecast-støtte, buffering og \"halv-ok\" UGI, men casting til Chromecast er svært ustabilt og krasjer ofte: fryser eller stopper med Fatal error-melding. Chromecast-støtte er viktig for meg. Relativt stabil utenom casting (mobil/nettbrett). Tilbyr noe fjernstyring av PVR.",
        "Fungerte i en periode for lenge siden etter mye om og men. Lenge siden appen har fungert i det hele tatt. Ubrukelig. Kundeservice er fullstendig fraværende. Styr unna!",
        "Krasjer ofte. \" Something wrong happened. Please try again. Fatal error - 3."
    ],
    "recentChanges": [
        "- Flere feilrettinger",
        "- Rettet feil i avspilling for enkelte enheter"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=no.altibox.tvoveralt&hl=en&gl=us",
    "appId": "no.altibox.tvoveralt"
}