{
    "title": "Spark NZ",
    "summary": "We’ve revamped the app with a fresh new design and handy features.",
    "icon": "//lh3.googleusercontent.com/2pbQyr_h7L-_YjGfTJ6q8wCctiW-Z_CuXZIt_2rFYnuyz5sfTkTzWAjXeUkl1C462aE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.4,
    "reviews": 4112,
    "developer": "Spark New Zealand Trading Limited",
    "developerId": "Spark+New+Zealand+Trading+Limited",
    "developerEmail": "appsupport@spark.co.nz",
    "developerWebsite": "http://www.spark.co.nz",
    "updated": "January 31, 2018",
    "version": "2.7.1",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "The Spark Mobile App is here, which means whatever you’re doing, you can manage your plan on the go right from your phone. Because who wants to spend time waiting in line when you can do it yourself? We’ve revamped the app with a fresh new design and handy features that are easy to use and are available to both mobile and broadband customers. To access all the app features, make sure you register for a Spark ID and use it to sign in.• Check usage of your data, minutes and texts• Check your broadband usage• Change your broadband data limit• Check your account balance• Pay your bill• Top up and buy extras• Manage multiple plans and accounts• Search for and get directions to Spark stores and WiFi Zones Note – Access to the Spark Mobile App is a free service, but some small charges may apply.APP PERMISSIONSThe app requests for contacts access only to populate the names when you have multiple lines under your account. This appears at the top of the dashboard. Users who manage the entire family's lines under their account find it useful to differentiate by name instead of having to look at the number.",
    "descriptionHTML": "The Spark Mobile App is here, which means whatever you&#x2019;re doing, you can manage your plan on the go right from your phone. Because who wants to spend time waiting in line when you can do it yourself?<br> <br>We&#x2019;ve revamped the app with a fresh new design and handy features that are easy to use and are available to both mobile and broadband customers. To access all the app features, make sure you register for a Spark ID and use it to sign in.<br><br>&#x2022; Check usage of your data, minutes and texts<br>&#x2022; Check your broadband usage<br>&#x2022; Change your broadband data limit<br>&#x2022; Check your account balance<br>&#x2022; Pay your bill<br>&#x2022; Top up and buy extras<br>&#x2022; Manage multiple plans and accounts<br>&#x2022; Search for and get directions to Spark stores and WiFi Zones<br> <br>Note &#x2013; Access to the Spark Mobile App is a free service, but some small charges may apply.<br><br>APP PERMISSIONS<br>The app requests for contacts access only to populate the names when you have multiple lines under your account. This appears at the top of the dashboard. Users who manage the entire family&apos;s lines under their account find it useful to differentiate by name instead of having to look at the number.",
    "histogram": {
        "1": 1001,
        "2": 306,
        "3": 460,
        "4": 753,
        "5": 1592
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/GRP_LBogPdYkNpmaUl2VmeTUaMdjvvQJB1zC7hcd9D-9T4qx2hH8_IvEBVJ_s5VmlA=h310",
        "//lh3.googleusercontent.com/HVXGfQlUDKREEdVlxzIObpkYGoeipPrkJ3kxHve5OopYPoJ5ZWqOV-jTz-bWsL3ocZU=h310",
        "//lh3.googleusercontent.com/T4rOwffsWNoYMJm2Wjpg4G1s-HzluQKALYnZ7zpCpg1LQZWsWcaVVfM8k-MxZLHXSIDR=h310",
        "//lh3.googleusercontent.com/BKZp2KMLnSH41fJq7ZAhPHTSgEQAmEwdeLbHA2aYxB8fGSSKgeN2buPhUE1wSPIszvc=h310",
        "//lh3.googleusercontent.com/nrmHcXtPlHa-FLQ5Ekv2knFXfkXVJ1f85qzBsyhD2rHf06suagIkVj2hjMkWyb8barA=h310"
    ],
    "comments": [
        "Lots of issues since latest app. Keeps asking me to sign in and won't let me so I need to change password before it lets me sign in. No longer shows account/bill along top or linked in app. I tried manually adding my account (it says add account number once and you won't have to again) and it worked but when I exited out and went back in, the account was no longer there. It's easier to pay my monthly bill if it's linked in the app so please sort this ASAP",
        "I liked this app b4, now it sucks, i could open it and see all my info, i could top up my or my sons ph. As well as the lock on my ph, I had a lock on the app to keep me safe. That was b4. Suddenly the latest update has stuffed everything up. I have to enter all my details, an email address and a password to look at my account. If i wanted that i wouldnt have a prepay ph, really spark this is stupid and makes me think you...spark.. have other agenda, i dont want ads on my email, i dont want to sign in every time, i wanted a simple prepay and a simple app so i could see my balances etc. Change it back or im going to change companies. Sad.",
        "It's good for a quick check on my usage, topping up, and adding extras on prepaid... but latest version keeps asking to log in every time which is pretty annoying. often there is some 'technical issue' so it won't update for a while. there's no real point to keep asking to log in - it doesn't add any security, so it must be a bug. No response, so minus 1 star.",
        "An absolute joke for an app.. From an absolute joke of a company... 3-4 hrs waiting times... Call back service is a joke call you back and still on hold for another 15-30 mins... Costumer care haven't a clue what they are doing just reading off the same book. Try to resolve matters and you just end back at square one. You say you keep promises please ye don't even know what the word means",
        "Having to sign in every time is an absolute pain, what kind of update is that?! Can't change my plan within the app, it's no longer the useful app it was unfortunately.",
        "Well Good News Bad News Colure Choice! Least now I can change the order of users and or what screen comes up first. But Wait you now have to log in Dayly? or every power off ? or set time? Spark sold me a Secure phone that uses biometrics and or retina scan as well as Geo locking and I still have to log in again and again? I still  prey I don't hit a buy now button! It is worse than you know but better than last time I wrote a review I have  the stars have been subtracted from last review"
    ],
    "recentChanges": [
        "Bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=nz.co.telecom.smartphone.android&hl=en&gl=us",
    "appId": "nz.co.telecom.smartphone.android"
}