{
    "title": "ANZ goMoney New Zealand",
    "summary": "ANZ goMoney New Zealand makes it easy to manage your money on the go.",
    "icon": "//lh5.ggpht.com/HMkiEaO62Hd4H9qGDma4GKo1NrM_vbY69WU6LyZ9XtTsHiQa_-Wk1KnEZ0x0VroemXk=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.3,
    "reviews": 9231,
    "developer": "ANZ NZ",
    "developerId": "ANZ+NZ",
    "developerEmail": "mobilephonebanking@anz.com",
    "developerWebsite": "http://anz.co.nz",
    "updated": "December 13, 2017",
    "version": "6.4.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "• Securely access your ANZ accounts with a four-digit PIN or Fingerprint Login on selected fingerprint-enabled devices• View balances without logging in using Quick Balance, the ANZ goMoney Widget, or Android Wear smartwatch• View personal and business accounts as one list (including Bonus Bonds)• View your KiwiSaver account details including transaction history and performance breakdown• View account statements and documents in PDF format (up to 7 years)• Turn off paper statements and set up credit card statement alerts• Transfer money between accounts (including Foreign Currency Accounts and to any one of ANZ’s three KiwiSaver schemes)• Send money overseas• Make payments to a new person, saved payee, registered payee, or IRD• Create, edit and skip automatic payments• Send money to anyone with a NZ bank account using their mobile number• Manage Cards (personal cards) – set or change your PIN, add/remove temporary blocks, or report your card lost/stolen and order a replacement• Apply for everyday and savings accounts, or start the application process for credit cards, personal loans, and home loans• ANZ goMoney Wallet – use your eligible phone to make contactless payments. For more information go to: http://comms.anz.co.nz/gomoney/gomoneywallet.htmlYour money and personal details are protected because:• ANZ goMoney is guarded by high-grade encryption and we ensure none of your personal or banking details are stored on your device• OnlineCode provides a second level of authentication for registration, adding a new device, resetting PIN or Guest Login• ANZ goMoney locks you out if you repeatedly use the wrong security PIN or fingerprint and will time-out if the app is left running for too long with no activity• We’ll also cover you for any unauthorised transactions, providing you comply with our Electronic Banking ConditionsFind out more about ANZ goMoney by visiting http://anz.co.nz/gomoney.To use ANZ goMoney, you need to be an ANZ New Zealand customer, registered for ANZ Internet Banking and be using an Android* device with an operating system of 4.1 (Jelly Bean) or above. goMoney Wallet is currently only available to specific Android phones and model numbers deemed eligible by ANZ.For further information about the Permissions required for ANZ goMoney or how ANZ uses Google Analytics, please see our Electronic Banking Conditions of Use. For Google's Privacy Policy see below.http://www.google.com/analytics/http://www.google.com/policies/privacy/*Android is a trademark of Google Inc.ANZ goMoney is provided in New Zealand by ANZ Bank New Zealand Limited (ANZ).",
    "descriptionHTML": "&#x2022; Securely access your ANZ accounts with a four-digit PIN or Fingerprint Login on selected fingerprint-enabled devices<br>&#x2022; View balances without logging in using Quick Balance, the ANZ goMoney Widget, or Android Wear smartwatch<br>&#x2022; View personal and business accounts as one list (including Bonus Bonds)<br>&#x2022; View your KiwiSaver account details including transaction history and performance breakdown<br>&#x2022; View account statements and documents in PDF format (up to 7 years)<br>&#x2022; Turn off paper statements and set up credit card statement alerts<br>&#x2022; Transfer money between accounts (including Foreign Currency Accounts and to any one of ANZ&#x2019;s three KiwiSaver schemes)<br>&#x2022; Send money overseas<br>&#x2022; Make payments to a new person, saved payee, registered payee, or IRD<br>&#x2022; Create, edit and skip automatic payments<br>&#x2022; Send money to anyone with a NZ bank account using their mobile number<br>&#x2022; Manage Cards (personal cards) &#x2013; set or change your PIN, add/remove temporary blocks, or report your card lost/stolen and order a replacement<br>&#x2022; Apply for everyday and savings accounts, or start the application process for credit cards, personal loans, and home loans<br>&#x2022; ANZ goMoney Wallet &#x2013; use your eligible phone to make contactless payments. For more information go to: http://comms.anz.co.nz/gomoney/gomoneywallet.html<br><br>Your money and personal details are protected because:<br>&#x2022; ANZ goMoney is guarded by high-grade encryption and we ensure none of your personal or banking details are stored on your device<br>&#x2022; OnlineCode provides a second level of authentication for registration, adding a new device, resetting PIN or Guest Login<br>&#x2022; ANZ goMoney locks you out if you repeatedly use the wrong security PIN or fingerprint and will time-out if the app is left running for too long with no activity<br>&#x2022; We&#x2019;ll also cover you for any unauthorised transactions, providing you comply with our Electronic Banking Conditions<br><br>Find out more about ANZ goMoney by visiting http://anz.co.nz/gomoney.<br><br>To use ANZ goMoney, you need to be an ANZ New Zealand customer, registered for ANZ Internet Banking and be using an Android* device with an operating system of 4.1 (Jelly Bean) or above. goMoney Wallet is currently only available to specific Android phones and model numbers deemed eligible by ANZ.<br><br>For further information about the Permissions required for ANZ goMoney or how ANZ uses Google Analytics, please see our Electronic Banking Conditions of Use. For Google&apos;s Privacy Policy see below.<br><br>http://www.google.com/analytics/<br><br>http://www.google.com/policies/privacy/<br><br>*Android is a trademark of Google Inc.<br><br>ANZ goMoney is provided in New Zealand by ANZ Bank New Zealand Limited (ANZ).",
    "histogram": {
        "1": 638,
        "2": 336,
        "3": 671,
        "4": 1819,
        "5": 5767
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/iXoBsThBtE3Z_IAXo_mBJsZDDxjuRlBqTIlivRqiNnZA8xjLN-pjFT17bjV-JpjbTNc=h310",
        "//lh3.googleusercontent.com/X4PyZIjeY2BU8L2QoFMLhElKtUky8iWtDdwfuCQ7v4mKIiEFNZNfpKns0BNO50pcYOR5=h310",
        "//lh3.googleusercontent.com/4ttsBCgEPMwHhNj7C6PHLK0JTlegRtNI0EWL-g-Wlp9U2e-4zVz7CcK2B4uJbpOfTu9l=h310",
        "//lh3.googleusercontent.com/_jlbkrRjEP51msYodfhiU5hb8sU_TUoT7733CVPDOj7ER7g9yyGVv16E70Z2wlAnUg=h310",
        "//lh3.googleusercontent.com/QchEZxQeIHFNzAINPDZQbpd6yEPFd8ksbaLIgp8K_IRSVsQJyxruBprSC-BwMLdgGQ=h310",
        "//lh3.googleusercontent.com/WjGfb3xkSvlpOBGly40LKd3A-kaQkm82-yvxrIGwMDNmiyO8IeoPI6pCPdwKENA9qQ=h310",
        "//lh3.googleusercontent.com/IwR-eS99mafUBBXAOVGISTQxJ5pCQtUGoFhcLuL_fXa38rnLfayZ0oF9mxkswRsNIUc=h310",
        "//lh3.googleusercontent.com/x8jJgO8BNgaA__TFWdnaL6swXGP8bHXiLFXPC7Jhpzymr_qemyW_5O5ZGn0N_xUneGY=h310",
        "//lh3.googleusercontent.com/DWBJpyV1dcW2Y7E_G2TYsOYlcmf2PBdJisYGDRuczR9OL0UmNdVBtfaYIWmANnhiK1dV=h310",
        "//lh3.googleusercontent.com/p6SwymlwoM6c7XZelbx0vn7lWFseJAknbXYhfd1-uctP5MlG931414kYMab1-V558A=h310",
        "//lh3.googleusercontent.com/50i7AoC7HdTGtkKb7LLiBrYJootJeB9QTfloqsYymYs1CstBL1Hc53yNqcqUsitOIi4=h310",
        "//lh3.googleusercontent.com/WlZkrG-auQl_MnJ7ZMlSksXTZQDRrLWV_evGgiecvYiB6VIxaP5QzbtnyGGbDbb5pA=h310",
        "//lh3.googleusercontent.com/NEwe0Sc1JB8wpWag5c7_0pbSb5FaCMEvAH9oEnKN4nfUK022ohoJjKtzBp_mblQ8DA=h310",
        "//lh3.googleusercontent.com/4zsTHb_gS8UG0mTPXIl_GhkMcKSswXY7siJBR1eUMaOa-u6kG1hRr7u6OZSNo3EE_MI=h310",
        "//lh3.googleusercontent.com/hIRKPToKq0u6IDR8wmWyEoWTH4EMKKCAJ8PrbQGDMljZIT0rfcDnFnhklfUiwwUTLITv=h310",
        "//lh3.googleusercontent.com/ERPoE6KOZXmWpqM2xWJ3ga8MTm_-hILqiCzN_kikORyYeotMUyqKPjuLnv-2WYTNGlg=h310"
    ],
    "comments": [
        "Overall this app is ok, but it stopped login via fingerprint. Every time I enable this function and next time I try to login with fingerprint it tells that my settings vere changed and fingerprint access switched off. But I did not change my fingerprints settings. That's kinda annoying",
        "The ultimate reason for my rating is due to the fact you can't screenshot anything from the app. It's your account and you should be able to do as you please. I have seen people on IPhone having the ability to do so but not samsung. I also know for a fact you can screenshot on other banks apps. Please rectify this security feature in your next update it has really been irritating for so long now. Once you have I will change my review. Cheers.",
        "Hi, this is a very good app. I have been using it for about 4 years already. Updated constantly and for every update the usage of this app got much easier and more efficient. I really appreciate it. The only problem for me is that, i cannot switch or install the app to a new phone since i moved to another country.",
        "Hey ANZ, great app. Please can you add an extension to the app that tracks all your finances and categorizes them so you can see what you spend money on? And can work out stuff like how much leftover money  you have each month so you can work out how much to save etc.",
        "I love it but... Last update came with errors in the search bar. When I try to retrive payment records, it would only show the last 2-3 payments and when I hit the \"load more\" button nothing really happens. I then decided to search manually , and when scrolling down, it jumps from Dec 2017 to Dec 2016 ?? Please help to fix this. Thanks .",
        "never seen such a stupid app. Everytime a new fingerprint is added, have to uninstall this app and reinstall it again to make it work. Otherwise no matter what you do, fingerprint does not work."
    ],
    "recentChanges": [
        "• You can now send money overseas in goMoney via ‘Overseas Payments’ in the main navigation menu",
        "• We’re now displaying more information about your home loans, including a total balance for customers with more than one home loan, and more details about your fixed and floating loans"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=nz.co.anz.android.mobilebanking&hl=en&gl=us",
    "appId": "nz.co.anz.android.mobilebanking"
}