{
    "title": "BPM",
    "summary": "Tap your screen to find the tempo of a song or measure a heart rate in BPM.",
    "icon": "//lh3.googleusercontent.com/TaVXFj5iXmStDhKhDoizcL7ULieT7ggBWEPE6SS6SodumzwBj5YIwK86AVg65hTfcg=w300",
    "price": "$0.99",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.1,
    "reviews": 36,
    "developer": "AQ",
    "developerId": "AQ",
    "developerEmail": "wear@quet.org",
    "developerAddress": "Aladin Quet\n3BIS rue Henri Barbusse\n30000 Nîmes - France",
    "updated": "February 2, 2017",
    "version": "Varies with device",
    "genre": "Tools",
    "genreId": "TOOLS",
    "size": "Varies with device",
    "description": "Tap your screen repeatedly to quickly measure any tempo as a song rhythm or your heart rate in beats per minute (BPM).  TYPICAL USAGES• Just after an intensive sport session, you might want to count your heartbeat.• Can be used by musician and DJ to calculate the tempo (quadruple measure) of a song.• You want to know if you are born with the rhythm.  In your phone, tablet or at your wrist, round and square screens are supported.  HOW TO USE IT• Press anywhere repeatedly to measure the BPM• Long press to restart a new session  TROUBLESHOOTING FOR WEAR 1.* DEVICESWait 10 to 20 seconds after install in order to be able to launch this application on your wearable device.If it is still not available, \"Resync apps\" or uninstall and then re-install it again, and be sure to have enough free space.",
    "descriptionHTML": "Tap your screen repeatedly to quickly measure any tempo as a song rhythm or your heart rate in beats per minute (BPM).<br>  <br><b>TYPICAL USAGES</b><br>&#x2022; Just after an intensive sport session, you might want to count your heartbeat.<br>&#x2022; Can be used by musician and DJ to calculate the tempo (quadruple measure) of a song.<br>&#x2022; You want to know if you are born with the rhythm.<br>  <br>In your phone, tablet or at your wrist, round and square screens are supported.<br>  <br><b>HOW TO USE IT</b><br>&#x2022; Press anywhere repeatedly to measure the BPM<br>&#x2022; Long press to restart a new session<br>  <br><b>TROUBLESHOOTING FOR WEAR 1.* DEVICES</b><br>Wait 10 to 20 seconds after install in order to be able to launch this application on your wearable device.<br>If it is still not available, &quot;Resync apps&quot; or uninstall and then re-install it again, and be sure to have enough free space.",
    "histogram": {
        "1": 2,
        "2": 4,
        "3": 3,
        "4": 5,
        "5": 22
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/iFVXcdRAnXiJKsw9di8__iG2J_tD7WYfVLHCs7vwrMaBYBkIebPwVfJbCYea6cW2E5k=h310",
        "//lh3.googleusercontent.com/wLkeSD-OLlIu4cwPQ-p22tMmN6TxxX9vv4UnsWBu1lMd7tjUTVycUqQMHdQ6JYsvSSU=h310",
        "//lh3.googleusercontent.com/2Hi4Unyl2lFR6dCi3jdcReOC4npQpaHSu2It0WynT1uou3OrzwXsJaqrspkGD8yFguI=h310"
    ],
    "video": "https://www.youtube.com/embed/JbnbwiO8iQo",
    "comments": [
        "Very useful for identifying EDM genres I've been looking for a tool like this for some time: An app that takes a timed average of the taps. Other metronome apps seem to only take the previous two or three, so this is much better. Bonus is that I can easily pull it up on my Moto 360.",
        "Bad The quicker you tap the the higher the bpm. Doesn't seem accurate at all",
        "Nice little app Works as advertised. No problems at all with the Lg G Watch, accurate for PsyTrance :) Nice addition was the ability to measure bpm on the phone side.",
        "DJ/musician's best friend I regularly use this app when following other DJ's. I used to have a similar app on my phone, but it's so much more convenient (and less antisocial) to not have to whip out my phone all the time. 5 stars, great job!",
        "Very Useful And the developer helped me learn a little about android wear!",
        "Perfect First, it doesn't ask for any permissions. Second it works! Perfect by my standards."
    ],
    "recentChanges": [
        "Version 1.2.0",
        "• Added Wear 2.0 support",
        "• Improved accuracy",
        "• Cosmetic changes",
        "Version 1.1.0",
        "• Application can now also run on the handheld (mobile/tablet) device",
        "• Fixed reset screen after timeout",
        "• Minor improvements",
        "---",
        "Version 1.0.2",
        "• Better readability.",
        "• Added a counter representing the number of taps.",
        "• Size drastically reduced (from 930KB to 80KB).",
        "• Compliant with functional requirements, visual design and user interaction criteria."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=org.quet.android.bpm.wear&hl=en&gl=us",
    "appId": "org.quet.android.bpm.wear"
}