{
    "title": "Void Watch Face",
    "summary": "The most minimalist watch face for Wear.",
    "icon": "//lh4.ggpht.com/2Yv4-jYiZKfVV1lbFeZt_RvAPDzjpdRSlnzNJh4cpy2Rn4LvKtDpeohxiOw4WhKFDts=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 3.9,
    "reviews": 315,
    "developer": "AQ",
    "developerId": "AQ",
    "developerEmail": "wear@quet.org",
    "developerAddress": "Aladin Quet\n3BIS rue Henri Barbusse\n30000 Nîmes - France",
    "updated": "February 1, 2017",
    "version": "Varies with device",
    "genre": "Personalization",
    "genreId": "PERSONALIZATION",
    "size": "Varies with device",
    "description": "The most minimalist watch face for Wear.",
    "descriptionHTML": "The most minimalist watch face for Wear.",
    "histogram": {
        "1": 71,
        "2": 10,
        "3": 15,
        "4": 16,
        "5": 203
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/A8psL6HkgH0XE5Uj47qzjcV961zrYRd_uWhJx7WrH4qMeYofJjwM0m1nNGK_OCyjWCI=h310",
        "//lh3.googleusercontent.com/BUM-m2U_2YGn9q0cTH3EOhJ2-h42rBzTC7vVFB8c5hE52-uaUXkl9bquwKsRPMCBIunO=h310"
    ],
    "comments": [
        "Let's be honest: it's absurd and futile to strap a tiny computer on the wrist and call it a \"smart\" watch. It's neither smart nor a watch. It needs charging every day and is dead after 3 years max.",
        "Greatest idea ever! It reminds me of a Black Sabbath song though. Into the void! 😂",
        "Rubbish",
        "The smell of new carpet is better I have changed my rating from 5 stars to 5 after the developer pointed out my stupidity with regard to advert blocking. It was my mistake. I feel utterly stupid. STUPID. STUPID STUPID STUPID. I hate myself. But on the plus side, I can now successfully purchase tampons for my stress related nosebleeds. Wonderful is the only word for this app and the developer. Apart from telloniflous",
        "It may be a gimmick, but it still has its uses Since I sleep with my watch on, and I like to use it as my alarm clock as well, this is perfect, since I toss and turn a bunch, so the bright screen on my moto360 turns itself on and off, bugging me and making it hard to fall asleep.  The only way to fix that in the system, is to turn on Theater mode, but that turns off notifications as well.  So this watchface serves as a fantastic alternative, that doesn't disable my alarm.  Thumbs up and five stars to this unique as can get idea, love it",
        "I love this watch face not only because it never has to be updated but the review section has always been a place to go to give me a good laugh. Who needs apps like iFunny or 9Gag when they can just read the reviews of this app. Keep up the wonderful work!"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=org.quet.android.wear.watchface.voidness&hl=en&gl=us",
    "appId": "org.quet.android.wear.watchface.voidness"
}