{
    "title": "Telegram",
    "summary": "Telegram is a messaging app with a focus on speed and security.",
    "icon": "//lh3.googleusercontent.com/jVXglyWWL5J2y1vRN-7Jy3_ozvvZc4w5486IAkbAIrWcNN_vn7YuIvhc1JDtGq43BqGl=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.3,
    "reviews": 2834035,
    "developer": "Telegram Messenger LLP",
    "developerId": "Telegram+Messenger+LLP",
    "developerEmail": "support@telegram.org",
    "developerWebsite": "http://telegram.org",
    "updated": "February 18, 2018",
    "version": "Varies with device",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "size": "Varies with device",
    "description": "Pure instant messaging — simple, fast, secure, and synced across all your devices. Over 100 million active users in two and a half years.FAST: Telegram is the fastest messaging app on the market, connecting people via a unique, distributed network of data centers around the globe.SYNCED: You can access your messages from all your devices at once. Start typing on your phone and finish the message from your tablet or laptop. Never lose your data again.UNLIMITED: You can send media and files, without any limits on their type and size. Your entire chat history will require no disk space on your device, and will be securely stored in the Telegram cloud for as long as you need it.SECURE: We made it our mission to provide the best security combined with ease of use. Everything on Telegram, including chats, groups, media, etc. is encrypted using a combination of 256-bit symmetric AES encryption, 2048-bit RSA encryption, and Diffie–Hellman secure key exchange.POWERFUL: You can create group chats for up to 100,000 members, share large videos, documents of any type (.DOC, .MP3, .ZIP, etc.), and even set up bots for specific tasks. It's the perfect tool for hosting online communities and coordinating teamwork.RELIABLE: Built to deliver your messages in the minimum bytes possible, Telegram is the most reliable messaging system ever made. It works even on the weakest mobile connections. FUN: Telegram has powerful photo and video editing tools and an open sticker/GIF platform to cater to all your expressive needs.SIMPLE: While providing an unprecedented array of features, we are taking great care to keep the interface clean. With its minimalist design, Telegram is lean and easy to use.100% FREE & NO ADS: Telegram is free and will always be free. We are not going to sell ads or introduce subscription fees. PRIVATE: We take your privacy seriously and will never give third parties access to your data.For those interested in maximum privacy, Telegram offers Secret Chats. Secret Chat messages can be programmed to self-destruct automatically from both participating devices. This way you can send all types of disappearing content — messages, photos, videos, and even files. Secret Chats use end-to-end encryption to ensure that a message can only be read by its intended recipient.We keep expanding the boundaries of what you can do with a messaging app. Don’t wait years for older messengers to catch up with Telegram — join the revolution today.",
    "descriptionHTML": "Pure instant messaging &#x2014; simple, fast, secure, and synced across all your devices. Over 100 million active users in two and a half years.<br><br>FAST: Telegram is the fastest messaging app on the market, connecting people via a unique, distributed network of data centers around the globe.<br><br>SYNCED: You can access your messages from all your devices at once. Start typing on your phone and finish the message from your tablet or laptop. Never lose your data again.<br><br>UNLIMITED: You can send media and files, without any limits on their type and size. Your entire chat history will require no disk space on your device, and will be securely stored in the Telegram cloud for as long as you need it.<br><br>SECURE: We made it our mission to provide the best security combined with ease of use. Everything on Telegram, including chats, groups, media, etc. is encrypted using a combination of 256-bit symmetric AES encryption, 2048-bit RSA encryption, and Diffie&#x2013;Hellman secure key exchange.<br><br>POWERFUL: You can create group chats for up to 100,000 members, share large videos, documents of any type (.DOC, .MP3, .ZIP, etc.), and even set up bots for specific tasks. It&apos;s the perfect tool for hosting online communities and coordinating teamwork.<br><br>RELIABLE: Built to deliver your messages in the minimum bytes possible, Telegram is the most reliable messaging system ever made. It works even on the weakest mobile connections. <br><br>FUN: Telegram has powerful photo and video editing tools and an open sticker/GIF platform to cater to all your expressive needs.<br><br>SIMPLE: While providing an unprecedented array of features, we are taking great care to keep the interface clean. With its minimalist design, Telegram is lean and easy to use.<br><br>100% FREE &amp; NO ADS: Telegram is free and will always be free. We are not going to sell ads or introduce subscription fees. <br><br>PRIVATE: We take your privacy seriously and will never give third parties access to your data.<br><br>For those interested in maximum privacy, Telegram offers Secret Chats. Secret Chat messages can be programmed to self-destruct automatically from both participating devices. This way you can send all types of disappearing content &#x2014; messages, photos, videos, and even files. Secret Chats use end-to-end encryption to ensure that a message can only be read by its intended recipient.<br><br>We keep expanding the boundaries of what you can do with a messaging app. Don&#x2019;t wait years for older messengers to catch up with Telegram &#x2014; join the revolution today.",
    "histogram": {
        "1": 171076,
        "2": 93800,
        "3": 220782,
        "4": 459441,
        "5": 1888936
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/4DD8TT_D5EWoHd7G03MX99MZSpAJVsdX2d14QJiwb2gGT1DrwgGlKJao0a8dWpAUlCc=h310",
        "//lh3.googleusercontent.com/OS7iPb4kgHjPLNCP7MSWu1D0OOVJJT05030B5cPxbHHEgo1Ter-U3pbVzqfkS5ETaxZk=h310",
        "//lh3.googleusercontent.com/W8iDC5yfF_a4rS_S9jAHCqRDSSRPrmKL7QArfIRIGvp6DSELII5oNoMo-xDLFVTNoA=h310",
        "//lh3.googleusercontent.com/eYKpYeYtFBWJbPltLHGr7LNoT9i9-XWzR-mJ-ZLYMDzbzTDxTNd-NhzW9Hpl9XxZ9_c=h310",
        "//lh3.googleusercontent.com/6LV1ig0vI56LJozc9S1n55lMI-E_FfqXAm02lP3p6zN5nhh9UKMn1QyZI1zUdnMQmR8=h310",
        "//lh3.googleusercontent.com/VSYuBHNITT6DErarY0usXxO-mwlrfXn91LoWaAK8Zo-G4zQ60ROdYP9lE15KzNG4-QkD=h310",
        "//lh3.googleusercontent.com/JHLRP3mt-avmhhi6KtTpysOs14Kivht2qNSsEPDdaRF8SIIcGJosprmd4WzZwcdZ9EwA=h310",
        "//lh3.googleusercontent.com/2_wiGetxlEYHXu7Mcp2GRhVXMqcbbpc5YaMyyCMXoharg6DtY8d6HOY_KFknFUcXdZ0=h310",
        "//lh3.googleusercontent.com/0zfne3O_M0c0FDZNxOdrsE1dF20SIchDzy_9E1UzbnM1IAX3LsCOePr4DTlfOM8z5w=h310",
        "//lh3.googleusercontent.com/pl0i5aqdxd_3UB6QLEZKYsOkzKf-oyE0BQynYRi_rpbAhBQ4qATkUxiJv7UET0K00w=h310",
        "//lh3.googleusercontent.com/xmKS4i25uwOn9hr23ETfN7ZH3TBTo-DUi8HE3gMQ1PBzF_BucjXyErz32E3UNvt_VLMH=h310",
        "//lh3.googleusercontent.com/dkXRFToQ25OvIvpR-kWZXW9ZQJ9ax2MLGfidcMXye6GkwUPrKMAucjqTqsO1MFr5_BcM=h310",
        "//lh3.googleusercontent.com/hRkLLiEWbl26MYzSLeSezpXzNVypeuxizZk47KhLtruTPVKfG4bnUB0P87KVuB1UBVpU=h310",
        "//lh3.googleusercontent.com/0W9hrBPxU_XlF4mu3dDYuDFShGl-fxvmdsvCqBKO45fWZWG7nQHp6LFgcb-bCdLJIVE=h310"
    ],
    "comments": [
        "My issue is with the audible alerts once joined to a group - I use it for receiving important alerts and the sounds are tied to my phone general alert sounds.... all this is fine but new messages only sound for 2 weeks then silence. ... I have to keep clicking on it to see if there's anything new. .. can't have that... I have to reinstall again.",
        "The best designed app I've ever seen! It is a perfect messaging app. Keeps it simple unless you want to mess with details- and it has ability to change all the settings you want. The only problem is that is has no userbase in the place I'm living, but I'll try to draw more people to use this beautiful, simple, secure and feature-rich  messaging app!",
        "Brooo you are great. Where were you hiding in these years. We are all fooling by a 1 app starts leter with 'W'. You came to rescue us. You proved its not only limited features which is shown by W app. You are awsome. But you have to prove and make them realize about you by giving ads. So only we can use a lot.",
        "I absolutely love Telegram, I use it all the time, but I have one small issue with it. My friends and I, who have Galaxy S8's all experience the problem of not receiving notifications until after we've opened the app. If this problem could be fixed I would greatly appreciate it",
        "I would like to be able to use this app but am blind, and so rely on talk back to interact with my phone and other Android devices. This app is completely incompatible with Talkback. I'm talking about totally incompatible. It's not just that talk back isn't able to convey to me that there are unlabeled buttons, TalkBack isn't able to convey any  kind of information about any other controls present in this app. I am completely unable to use this app. Please consider updating this app so that it is at least partially usable 4 people relying on the TalkBack service. If you won't, then I hope the world recognizes you as the discriminatory company that you will then be.",
        "As always been the best app. The last 2 updates were horrible. Till now the contacts remain a major issue. Please fix asap. Contacts are all over the place and some contacts didn't show up as names on telegram. Annoying as.."
    ],
    "recentChanges": [
        "4.8.4",
        "- Fixed issues with contacts names",
        "4.8:",
        "- Streaming for videos. Start watching any newly uploaded video instantly without having to fully download it first.",
        "- Auto-Night Mode. Automatically switch to the dark version of the interface after nightfall or in low-light conditions.",
        "- Telegram Login widget. Log in to other websites and services using your Telegram account."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=org.telegram.messenger&hl=en&gl=us",
    "appId": "org.telegram.messenger"
}