{
    "title": "LibreOffice Impress Remote",
    "summary": "The Impress Remote is an app to remote-control your LibreOffice presentation.",
    "icon": "//lh3.googleusercontent.com/K0NKRbJZMR7y6FEHxdBN5SdjBw0SGWOTnKbFw8k_tk6-pBK3o6q6plg417348QpPL54=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 1427,
    "developer": "The Document Foundation",
    "developerId": "The+Document+Foundation",
    "developerEmail": "info@documentfoundation.org",
    "developerWebsite": "http://www.libreoffice.org",
    "developerAddress": "The Document Foundation, Kurfürstendamm 188, 10707 Berlin, Germany\nPhone: +49 30 55579920, Fax: +49 30 555799299, Internet: http://www.documentfoundation.org, E-Mail: info@documentfoundation.org\n\nThe Document Foundation is a charitable Foundation under German law (gemeinnützige rechtsfähige Stiftung des bürgerlichen Rechts). Board of Directors: Marina Latini (Chairman of the Board), Michael Meeks (Deputy Chairman of the Board), Thorsten Behrens, Jan Holešovský, Osvaldo Gervasi, Simon Phipps, Eike Rathke (addresses as above)\n\nRegulatory Authority: Senatsverwaltung für Justiz und Verbraucherschutz, Stiftungsaufsicht, Salzburger Str. 21-25, 10825 Berlin, Germany\nVAT number as per § 27 a Umsatzsteuergesetz: DE 295589870\nhttp://www.documentfoundation.org/imprint",
    "updated": "October 12, 2015",
    "version": "2.2.3",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Get the free presentation remote control app for LibreOffice! The Impress Remote lets you interact with your slideshow presentation from your Android device – including slide previews, speaker notes, and more.A detailed description of the prerequisites and a step-by-step user guide is available here: https://wiki.documentfoundation.org/Development/Impress/RemoteHowToLibreOffice is the power-packed free, libre and open source personal productivity suite for Windows, macOS and GNU/Linux, which gives you six feature-rich applications for all your document production and data processing needs: Writer, Calc, Impress, Draw, Math and Base. Support and documentation is free from our large, dedicated community of users, contributors and developers.Download LibreOffice from https://www.libreoffice.org/download/LibreOffice, and the Impress Remote, is community-driven and developed software – and a project of the governing charitable organization, The Document Foundation.This software is developed by users, just like you, who believe in the principles of free software and in sharing their work with the world in a non-restrictive way. Meet us at https://www.libreoffice.org/get-involved/",
    "descriptionHTML": "Get the free presentation remote control app for LibreOffice! The Impress Remote lets you interact with your slideshow presentation from your Android device &#x2013; including slide previews, speaker notes, and more.<br><br>A detailed description of the prerequisites and a step-by-step user guide is available here: https://wiki.documentfoundation.org/Development/Impress/RemoteHowTo<br><br>LibreOffice is the power-packed free, libre and open source personal productivity suite for Windows, macOS and GNU/Linux, which gives you six feature-rich applications for all your document production and data processing needs: Writer, Calc, Impress, Draw, Math and Base. Support and documentation is free from our large, dedicated community of users, contributors and developers.<br><br>Download LibreOffice from https://www.libreoffice.org/download/<br><br>LibreOffice, and the Impress Remote, is community-driven and developed software &#x2013; and a project of the governing charitable organization, The Document Foundation.<br><br>This software is developed by users, just like you, who believe in the principles of free software and in sharing their work with the world in a non-restrictive way. Meet us at https://www.libreoffice.org/get-involved/",
    "histogram": {
        "1": 99,
        "2": 50,
        "3": 82,
        "4": 253,
        "5": 943
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.ggpht.com/xusgk5ynfOk-AjbhcQ6LaIKzdM7StVy1_NARJyn11orwjhRX5Ul9ez1X5gQMl_7g6A=h310",
        "//lh3.ggpht.com/hFEPNUQw0c7C95GDr7_yTB5wvrfoC9HH6RJj5RirxkY2Gz6-FzKu9fzrZgZ_GEDzuig=h310",
        "//lh4.ggpht.com/kP2eLRgTGLnNTdJOfoG9oIsrbxPQj0X7rHiQwWpFOLuRT9NqvdNm13Bo85dGWWsVbT4=h310",
        "//lh6.ggpht.com/tk1UK8aNp5BL1QBbPUURrQZqtjqQpekcvGPrrMWkxqNAIgdbZGT0Spm5FzDYghK7PoY=h310",
        "//lh5.ggpht.com/e9yn2rMzQKAvv1m_CtYozT5rnCumoVW_XpT8wbqSwqXbRy7bBjlB5_h3rn3Q0TF67sI=h310",
        "//lh5.ggpht.com/sGAKuBU2v-159Fyrakvh_v-hs7FgrwWdRIE8K9VzNB7mDzf4tw63195Djfc4cqYa3A=h310",
        "//lh4.ggpht.com/lhPqHGGYaCTCE7iPV59ExvUEUVhxpOEFtMkctJlmDLnaNNtPpPneT-8_bP11wL_FygE=h310",
        "//lh3.googleusercontent.com/DHzgHdvCZnOJJTTVTA6QZJEEAdYQ4FyeK8mLj-LnXVen2rXkKxw8KPF_MhXmzEmwVA=h310",
        "//lh3.googleusercontent.com/443fKF3lgdqb4V2SkqVfvR5KhO2PVLia6sYMYhKPaxA-Bp2LuWoW4LsC1n-YJydnenQB=h310",
        "//lh3.googleusercontent.com/zDXZMh8ZVUFmK8EZ7ZktzYWvR909GCa7LrKi5pmmVhpbcBaEE5G_GvYs_3-wIkDbbfs=h310"
    ],
    "video": "https://www.youtube.com/embed/hM5H4fUxq4M",
    "comments": [
        "'Connection Failed'. I paired my laptop to my phone via Bluetooth, it paired successfully. I open up Libreoffice Impress Remote and chhose my laptop. After that, nothing happens. It shows an error. 'Make sure you've enabled remote control Impress>Tools>Options>General enable remote control'. I've enabled the option and restart libreoffice. It still doesn't work like the video you've shown. I am running Xperia Z2 5.1.1, my laptop is Windows 8.1. Libreoffice Impress version 4.4.5.2 on Windows8.1. I'll edit this comment to inform if everything worked out.",
        "Why it not noticed if the remote presentation feature and experimental feature was enabled you must restart the Libreoffice? that make confused the users if you not noticed that! By the way, It's work on me! so I should not buy a wireless mouse or wireless remote presentation :p",
        "Gives connection error over Bluetooth. Everything else has no problem connecting to the PC over Bluetooth. Over WiFi it allows you to create link and enter code on the PC side but then it just crashes. Zenfone 3 running Android 7",
        "Works on Linux and Windows XP (after enabling Remote Control in Impress General options AND allowing program to communicate through firewall) and is awesome.  However, for Windows 7 and 8 laptops, this app fails to finds computers or unable to connect to specific IPs on the network; always reports \"Connection failed\".  Tried app on iPad mini as well as Android 4.4 cell.  Tried disabling firewall altogether in Windows 7 and Windows 8 machines and even specifying the IP address of the computer running Impress but the app still can't find the computer!  Great app but not workable for me in Windows 7 or 8.  Running LibreOffice 5.1.3 on Windows.  Does anyone running Windows 7 or 8 have the same problem? anyone with a solution? Need it to work on Windows 7 or 8!!!",
        "What's wrong woth this app? I enabled the remote control in the L.O. Impress already but it keeps on telling \"connection failed\". I'm sure that the problem is not on bluetooth because its working fine. Improve this please.",
        "I used to carry extra long VGA and USB cables so that I could position my laptop on a rostrum and to one side of a presentation. No longer so! Thank you Impress Remote. I recommend just using a hand held lasar pointer and don't give up on Bluetooth connection problems - it does work! My own problems with Bluetooth are due to a poor laptop and not this App. For large auditoriums or where the Bluetooth range is poor, definitely set up a WiFi connection. Now my laptop can be wired and left close to the data projector, and I just stand nearby, tablet in hand. Much better for audience attention as I can move about. Highly recommended. Improvements? Better resolution for the notes on handheld devices would be nice, but not essential. For some reason hidden slides in a presentation are shown by this App, the workaround is easy - save and use an abridged presentation."
    ],
    "recentChanges": [
        "Version 2.2.3 (v17):",
        "* reduce size of package",
        "* fix crash when adding computers",
        "* minor translation updates",
        "* minor code cleanup",
        "Version 2.2.2 (v16):",
        "* android wear improvements",
        "** controls now also available  on the notification card",
        "** uses current slide as background image",
        "* minor translation updates",
        "Version 2.2.1 (v15):",
        "* prevent crash when Bluetooth devices don't report their device class",
        "* prevent crash when trying to use slides grid before it is setup"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=org.libreoffice.impressremote&hl=en&gl=us",
    "appId": "org.libreoffice.impressremote"
}