{
    "title": "Castle Wear",
    "summary": "&quot;Castle Wear&quot; is an old-school persistent turn-based rogue-like game for Wear.",
    "icon": "//lh3.ggpht.com/YGG6_fAss53VwJLjnvYGHHvA7SRXLVgY0MfLt72KujVCReLXmXX-tKVm6oM5rPJpiQ=w300",
    "price": "$1.99",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.9,
    "reviews": 81,
    "developer": "AQ",
    "developerId": "AQ",
    "developerEmail": "castlewear@quet.org",
    "developerAddress": "Aladin Quet\n3BIS rue Henri Barbusse\n30000 Nîmes - France",
    "updated": "April 3, 2015",
    "version": "0.1.37",
    "genre": "Adventure",
    "genreId": "GAME_ADVENTURE",
    "description": "An old-school persistent turn-based rogue-like game influenced by heroic fantasy, currently in alpha stage development, mainly for Wear but not only.  IMPORTANT NOTEPlease be indulgent concerning the bugs, crashes, lack of content and the high difficulty, \"Castle Wear\" is in ALPHA stage development, a very early state part of the alpha funding program. this is simply under construction.In the contrary of crowd-funding, you already have a \"playable\" but unfinished product in your hands.  PLOTThe evil sorcerer Diordna stole a very rare talisman from the King and generated a mysterious labyrinth with its power under the King's Castle. Since then the ruler has gone mad and has started to continuously send new recruits further down in the maze to retrieve the previous artifact from the hands of Diordna.  TIPS FOR STARTING• Weigh your party (e.g. take two fighters, a thief, a cleric and two mages).• Do not run in the wall, it makes noise and that might alert nearby monsters.• Remember where your everyone died, you can retrieve their corpses with another party later on.• Be cautious with spells points. You can only refill them via resting in the Adventurer's Inn.• You can only level up in the Adventurer's Inn.• The difficulty is high, so do not worry if you die often.  FEATURES ALREADY THERE• Hundred of items and hundred of creatures• Custom character creation, 8 classes (e.g. Fighter), 5 different races (e.g. Elf), gold, exp and many attributes• 50 unique spells split into Mage and Cleric categories, divided into 7 levels of power and varying effects• Few NPC available (e.g. Trading center, Temple)• An underground textured 3D maze (raycasting) infested of monsters• A turn-by-turn combat system allowing various actions per member• Non persistent auto-map  FUTURE FEATURES• Better UI, better performance• Cloud save, quest system, achievements and rewards• Real-time multi-player battle mode (fight with your friends)• Procedural random level generation• A real story-line• Multi-class mode    Contact me if you think I forgot you in the Credits page.",
    "descriptionHTML": "An old-school persistent turn-based rogue-like game influenced by heroic fantasy, currently in <u>alpha stage</u> development, mainly for Wear but not only.<br>  <br><b>IMPORTANT NOTE</b><br>Please <u>be indulgent</u> concerning the bugs, crashes, lack of content and the high difficulty, &quot;Castle Wear&quot; is in ALPHA stage development, a very early state part of the alpha funding program. this is simply under construction.<br>In the contrary of crowd-funding, you already have a &quot;playable&quot; but unfinished product in your hands.<br>  <br><b>PLOT</b><br>The evil sorcerer Diordna stole a very rare talisman from the King and generated a mysterious labyrinth with its power under the King&apos;s Castle. Since then the ruler has gone mad and has started to continuously send new recruits further down in the maze to retrieve the previous artifact from the hands of Diordna.<br>  <br><b>TIPS FOR STARTING</b><br>&#x2022; Weigh your party (e.g. take two fighters, a thief, a cleric and two mages).<br>&#x2022; Do not run in the wall, it makes noise and that might alert nearby monsters.<br>&#x2022; Remember where your everyone died, you can retrieve their corpses with another party later on.<br>&#x2022; Be cautious with spells points. You can only refill them via resting in the Adventurer&apos;s Inn.<br>&#x2022; You can only level up in the Adventurer&apos;s Inn.<br>&#x2022; The difficulty is high, so do not worry if you die often.<br>  <br><b>FEATURES ALREADY THERE</b><br>&#x2022; Hundred of items and hundred of creatures<br>&#x2022; Custom character creation, 8 classes (e.g. Fighter), 5 different races (e.g. Elf), gold, exp and many attributes<br>&#x2022; 50 unique spells split into Mage and Cleric categories, divided into 7 levels of power and varying effects<br>&#x2022; Few NPC available (e.g. Trading center, Temple)<br>&#x2022; An underground textured 3D maze (raycasting) infested of monsters<br>&#x2022; A turn-by-turn combat system allowing various actions per member<br>&#x2022; Non persistent auto-map<br>  <br><b>FUTURE FEATURES</b><br>&#x2022; Better UI, better performance<br>&#x2022; Cloud save, quest system, achievements and rewards<br>&#x2022; Real-time multi-player battle mode (fight with your friends)<br>&#x2022; Procedural random level generation<br>&#x2022; A real story-line<br>&#x2022; Multi-class mode<br>  <br>  <br>Contact me if you think I forgot you in the Credits page.",
    "histogram": {
        "1": 4,
        "2": 9,
        "3": 14,
        "4": 17,
        "5": 37
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh4.ggpht.com/X-4OcPtZF-fs1DMXLm0MkXH3l0NSRjOylrWAUqPOgYpTP9008XNl0jv-q4Ev3KHMsg=h310",
        "//lh3.googleusercontent.com/O4-hPgia68JWn4pvYjJJYX5k8hbwQtThkmVYaDrY8j2f7xFLHFJBO2LxNGct15K-PA=h310",
        "//lh5.ggpht.com/SDpOZKlxFinMloVAEkBlmcIpVdejluFdYzNU-v4I6CbICo-sGpbnVD9mSTtIxT0TyVk=h310",
        "//lh4.ggpht.com/XAVxYVcFJziQTd8neJYMqGk3aptq3kVcDzw5R9A1ZhR3p2_sxMDL08VacEDYvGgSHuo=h310",
        "//lh6.ggpht.com/fViQLXuH87ELwudrTHeGLtUpCH0WI8Xx3CF8S5SLslXxgG1-8R4lUsw4zLWJOseHWbo=h310",
        "//lh3.ggpht.com/Or18kXOKfaYaLuYz9fkDqSFCmH-2bK_8AYcPvZblrsTgaezDVTt8CXBA6MsZBoPZuQ=h310",
        "//lh3.googleusercontent.com/JLq-DeR7880DDrksP3jrDgeGWePHByo-Gcd91RaCd7Eh6ttqdXWqMMK6lRcelNjviQ=h310",
        "//lh3.googleusercontent.com/PU4jlcUVqTXyALjQPzlV2nxbXfL_dJcZXi-avrbP3ApOqb8znWnlC5OXn0Px3A-xkX8=h310",
        "//lh4.ggpht.com/iabCDoD7MUL3FlshI-XQsz3MJ1GWhCYV86XXiUOvQRPZVaUfNf6tEHXX5-TAhUoV3Vqk=h310",
        "//lh3.googleusercontent.com/cwabsnG9ItyldjtVvpCeCzQmQFVRg_SvDaiXzBCsbZATmuJ-mPFzoUxnDDA2GPLHT08=h310",
        "//lh3.googleusercontent.com/dijiXACui0z-7dAP9999p8iBi9KNhE0tuWqP1TvcmB7Ym-ikps7anEbBY-R2Cge4cjM=h310",
        "//lh3.googleusercontent.com/jBro9gMBqKe4oAzRSw_EZ8W0aUy139OORSE3Q3iTq_mFjjAoKapJ43imHHUmkIyeurE=h310",
        "//lh3.googleusercontent.com/LxQtGp7EzWyxK1m_J_wMyr_p3ZgPafGwC3Jxk3UwlQ0jhBXwHC6s8jXiDr57BMKyHow=h310",
        "//lh3.googleusercontent.com/AartZEjCkW4x4uR9xFHJfSXVAbOztHYSmwUweAblZAF3rxeIzBMW4S_pOnB-x5Sz9Ik=h310",
        "//lh5.ggpht.com/MTuveoBhP8Ueu0SqTjxXaNNRBG6HfqPFgmWG2OUV_I7aDk2QcPciNrBkwSiLkLxRhV4=h310",
        "//lh3.googleusercontent.com/CiXMJRPqh957wZ4EyQJEPpIfJVrG3rdYUCXC5-HoZs6jelgfwqY1OWjCCMpsc066X6k=h310",
        "//lh6.ggpht.com/G58wBqPeFxfm6q39jfD_LkFF_UbAtAeD9sPmjZmaUmMY94Ivr2L0G0fVcDfQajM2hg=h310",
        "//lh3.googleusercontent.com/I_1WRNbVNue6WO6OKpYH7oQrIxaPYB2-FU3GZA_CgSpZdqZYCrcAc8raxQS6G7GBRbX0=h310",
        "//lh3.googleusercontent.com/0NLnqmZNHrjoDy3AVpZEpZOok6Bq41ui-xd-qlQwa0-cJS1oncn3gFoAJQVLfMNVkQ=h310",
        "//lh6.ggpht.com/y54ggAO78TQ0zMxYiDn0kNtNuJRuj9XHPHCgoozeC88Lo-yGCpXEdnO3ONK_dx2kADY=h310",
        "//lh5.ggpht.com/mhA4KBSBS6OuOI0mOZlzqBs3EXjJNWMUSkCPjlRQwq7tKDgiciEi4eRt4BdVMka_ZQ=h310",
        "//lh3.googleusercontent.com/JiryqpKxAV_dwvkK_M2RkR1V3VETb11J6qEVHAspxFkVszD1vL7OcPLMT_66NzItzlw=h310"
    ],
    "comments": [
        "Best wear game!!! Within Five minutes of installing this game I knew it was going to get a five star rating from me, but I decide to give it a bit of time to see if my feelings changed.  They did. Now I'm upset I can't give it a sixth star. Keep up the great work you're developing an amazing game.",
        "Great concept I love the concept and I find its a great game already! Impressive how you could make a real game fit on such a small screen!Would love to see some sort of zoom function for the phone so it occupies whole screen or maybe have it display the map on screen. Speaking of map would be great to be able to move while in map mode! Edit: a big thank you for lowering difficulty! Ty for bug fixing so much to explore",
        "Looks like fun.. Sadly I can't see anything. The game takes up about 1/5th of my screen and the rest is black.. I can't read the tiny options. I'm willing to re-rate the game after this is fixed.  Until then I can't even play it to give it a better score.",
        "OK I get how it works now! Still not impressed yet. The game IS a decent rpg for Android especially for the price but it's not perfect. The controls take a lot of getting used to and the screen should be able to be fullscreen or adjustable. I find the current setting just a bit too small. Also LOSING stats randomly on level up? Yeah no. That's an awful idea. Ive seen it before, it literally makes no sense.",
        "Super fun, but stuck! I've been playing this for a while now, my characters are all level 8 or 9. I finally got to the elevator, and took it down to the 4th floor. On the 4th floor, I could no longer access the elevator I had been riding, but there was a second elevator nearby. However, this elevator seems to be broken. It doesn' have buttons like the first one, and nothing happens when I swipe to the right. Also, I can't get to stairs from where I'm at, and I can't find any hidden doors. Why did the first elevator disappear??",
        "This is what you NEED to have. I will support this project and even invest in it. This is the type of game that not only is  a missing/hidden genre of RPG for Android bit to have it on the go on your watch is amazing. I can't put the game down."
    ],
    "recentChanges": [
        "Fixed hundreds of FIXME and TODO.",
        "See the changelog at http://pastebin.com/4VZJGp9k or inside Castle Wear."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=org.quet.android.castlewear&hl=en&gl=us",
    "appId": "org.quet.android.castlewear"
}