{
    "title": "Luas at a Glance",
    "summary": "Never miss your Luas. Real-time notifications, maps and slick Material Design.",
    "icon": "//lh3.googleusercontent.com/DdF5GBaOVeuX3Fvbcrh-mu0Kc4ea0UkapEmSAyjoDWzWFBm1CNkV7d5w-N6_eWYrPncP=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.7,
    "reviews": 82,
    "developer": "Aaron Hastings",
    "developerId": "Aaron+Hastings",
    "developerEmail": "aaron@thecosmicfrog.org",
    "developerWebsite": "https://luasataglance.thecosmicfrog.org",
    "updated": "December 8, 2017",
    "version": "Varies with device",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "size": "Varies with device",
    "description": "Now featuring real-time information for Luas Green Line (Cross City) extension!For both phones and wearables, Luas at a Glance is the most feature-rich and slickest Luas app for Android. Designed using the latest Material Design guidelines, Luas at a Glance is clean, simple to use and completely free of ads. It's built with you in mind, to make your Dublin trams commute easier and faster.Features:• Real-time information for new Luas Green Line (Cross City) extension.• Never miss your next Luas with incoming tram notifications - just tap the tram you plan to take, choose when you want to be reminded and finish your morning coffee in peace.• Jump to your regular stops in just two taps using the built-in Favourites feature.• Quick and easy maps of the entire Dublin Luas network, at the touch of a button.• Calculate your fare price before you get to the ticket machine using the handy fares calculator.• Create a widget for your most-frequented stops and get tram information straight to your homescreen. [BETA]• See the latest Luas news and travel disruptions.• Cainteoir Gaeilge? Tá Luas at a Glance ar fáil i nGaeilge! - Irish speaker? Luas at a Glance is available in Irish! (Note: Requires Irish language support on device)Luas at a Glance is free and open source software and is made available under the GNU General Public License.Source code, bugs and feature requests:https://github.com/thecosmicfrog/LuasataGlanceIrish language translations kindly provided by Feidhlim Seoighe.",
    "descriptionHTML": "Now featuring real-time information for Luas Green Line (Cross City) extension!<br><br>For both phones and wearables, Luas at a Glance is the most feature-rich and slickest Luas app for Android. Designed using the latest Material Design guidelines, Luas at a Glance is clean, simple to use and completely free of ads. It&apos;s built with you in mind, to make your Dublin trams commute easier and faster.<br><br>Features:<br>&#x2022; Real-time information for new Luas Green Line (Cross City) extension.<br><br>&#x2022; Never miss your next Luas with incoming tram notifications - just tap the tram you plan to take, choose when you want to be reminded and finish your morning coffee in peace.<br><br>&#x2022; Jump to your regular stops in just two taps using the built-in Favourites feature.<br><br>&#x2022; Quick and easy maps of the entire Dublin Luas network, at the touch of a button.<br><br>&#x2022; Calculate your fare price before you get to the ticket machine using the handy fares calculator.<br><br>&#x2022; Create a widget for your most-frequented stops and get tram information straight to your homescreen. [BETA]<br><br>&#x2022; See the latest Luas news and travel disruptions.<br><br>&#x2022; Cainteoir Gaeilge? T&#xE1; Luas at a Glance ar f&#xE1;il i nGaeilge! - Irish speaker? Luas at a Glance is available in Irish!<br> (Note: Requires Irish language support on device)<br><br>Luas at a Glance is free and open source software and is made available under the GNU General Public License.<br><br>Source code, bugs and feature requests:<br>https://github.com/thecosmicfrog/LuasataGlance<br><br>Irish language translations kindly provided by Feidhlim Seoighe.",
    "histogram": {
        "1": 2,
        "2": 1,
        "3": 2,
        "4": 7,
        "5": 70
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/edmrsldJYQy3YpChLYwhKvPyBhx0Opr71_RxUcRHh79yRJbe45plzt6Bv1EyL8Z7F5cR=h310",
        "//lh3.googleusercontent.com/UpqYjajEw50UA5PSv5iUgYIFyD5Sdq-eNflkbJz2RPS1IClPZpLugzgRC0Xqm_jbHhIs=h310",
        "//lh3.googleusercontent.com/jq_4yBLp6Opk_NSKTRWsfoURtHkYq7O0EZrOBYiXIN-GllRDl_kXBGjyuy4HjrUVW9eQ=h310",
        "//lh3.googleusercontent.com/1nZcG0e_frL3_SWBkRpr7nCRIF9cr_c4dDlHZd6Cv4r4Xa1BKru3dvcIQ2T_2wWo--4=h310",
        "//lh3.googleusercontent.com/sQpil01tJNvbOGZvH4YEseHKbqCKlZ1qvezv06n4Hw77vPLyA9n8z8csWNG_g-TQj9Kf=h310",
        "//lh3.googleusercontent.com/Ki1UCagW7K52wW1O46GnF_wH97ujP9oo8d1GJcYIfuVS-gVJ9Lv0siXc6DCeMJlu9iQ=h310",
        "//lh3.googleusercontent.com/MR9sfO5mXmAncpxmFvQJ1qi-D9ZU4DwScdKSV00sm8SMhayakI2Akv_GDvFBc6ETBQ=h310",
        "//lh3.googleusercontent.com/sRpflrRR01CFu0L9VtJDmTQ0YWKIFK3yHqxj7f8jU9KIl6DyDVdXoCXb-nvRzXQssyw=h310"
    ],
    "comments": [
        "Good app. It used to work fine with smartwatch, but not anymore. It can be open on the smartwatch but it never shows time information for a stop. Reinstall, clearing cache does not help",
        "The best LUAS Android app with regular updates and a proper material design look! Will always recommend this app (instead of the rubbish \"official\" app)",
        "Tús maith leath na hoibre!   Is ansa liom é bheith in ann \"ceanáin\" a roghnú.  Tá Samsung agam leis an leagan gaeilge.  Dá mba mhaith leat na haistriúcháin a fheabhsú, bhí i dteagmháil liom!  Mar shampla, \"Níl aon tramanna le teacht\" agus \"Gheobhaidh tú fógraí\"",
        "Extremely handy and reliable, still the best app for Luas.",
        "Great app and simple to use.",
        "Easy peasy"
    ],
    "recentChanges": [
        "• [NEW] Added support for new Luas Green Line (Cross City) stops - from Broombridge to Dawson! These stops are scheduled to open on December 9th 2017.",
        "• [NEW] Updated to latest version of Luas RTPI system. Provides more accurate service alerts and disruptions.",
        "• [FIXED] Fixed bug where Alerts would always show as red.",
        "Please submit any issues to my GitHub page and I will be happy to fix them. Feature requests also gladly accepted!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=org.thecosmicfrog.luasataglance&hl=en&gl=us",
    "appId": "org.thecosmicfrog.luasataglance"
}