{
    "title": "Naviki – the bicycle satnav",
    "summary": "Route planner for your bike routes and an impressive compilation of cycle paths!",
    "icon": "https://lh6.ggpht.com/rb5fxPBsCUMdZ_5khO2pAuyWW6p_5uySbggH4NSkLZ93TE0rIkPQy2iJHX2jII8a9Q=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.4,
    "reviews": 5101,
    "developer": "beemo",
    "developerId": "beemo",
    "developerEmail": "help@naviki.org",
    "developerWebsite": "https://www.naviki.org",
    "developerAddress": "Dortmunder Str. 47\n48155 Münster\nDeutschland",
    "updated": "January 10, 2018",
    "version": "3.69.1",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "description": "Naviki is the comprehensive bicycle App! Naviki offers worlwide best route planning for bicycles and an impressive documentation of your cycling activities. Optionally for everyday, leisure, mountain bike and racing bike Naviki provides ideal connections between any start and destination addresses, it immediately shows your routes on a map and navigates to your target by spoken navigation instructions and arrows on the display. Naviki easily records your own trips and synchronises them with www.naviki.org. The result is an impressive personal collection of routes! Simple and practical: Plan routes on www.naviki.org and transmit them to the App with just one click. Naviki’s most important functions: ROUTE PLANNER Simply enter your start and destination, immediately get your customised route with the most important additional information. TURN-BY-TURN NAVIGATION Spoken instructions and pleasantly large navigation arrows on your display. By means of spoken instructions, the phone can remain in your pocket which is energy-saving. Spontaneous deviation from a planned route is no problem - Naviki automatically calculates a new route to your destination. EVERYDAY ROUTING Gives you the cycle tracks for your daily activities. Prefers minor roads, bicycle lanes, rather short and straight routes as well as easy accessible and solid surfaces.LEISURE ROUTING Your cycle routes for tourism and leisure activities. Prefers officially signposted cycle tracks, easy accessible and solid surfaces, minor roads and a nice natural environment.MOUNTAIN BIKE ROUTING Your routes for great MTB experiences! Prefers unsealed surfaces, single trails, distinguished and signposted MTB routes as well as forest and country tracks.RACING BIKE ROUTING Racing bike routes for fascinating fast trips! Prefers sealed and smooth surfaces, tracks allowing high-speed cycling, minor roads, a scenic environment.S-PEDELEC ROUTINGTailored routes for fast e-bikes up to 30 mph on roads allowing power-driven vehicles. Prefers minor roads and a nice environment whenever possible. ROUND TRIPSJust enter a start and a required length – Naviki calculates numerous alternative round trips to choose from for immediate navigation.POINTS OF INTERESTNaviki contains a huge and well-structured collection of Points of Interest you can easily implement in your calculated routes by using them as destinations.OFFLINE MAPSDownload high quality Naviki maps on your smartphone and use them independent of internet access.HEIGHT PROFILE For all routes Naviki provides a height profile, the highest and lowest points and the total altitude to be cycled upwards. CONVENIENT COCKPIT Speed​​, average speed, distance traveled and distance to your target are always in view. During navigation and recording the speedometer is automatically displayed. CONNECTIVITY Via Bluetooth Naviki sends the distance to the next turn and navigation arrows to the coachsmart display (www.o-synce-shop.de). This saves battery power and your phone can remain in the pocket.RECORDING YOUR OWN TRIPS Just one tap and Naviki records the path you cycle and stores it in your personal Naviki Cloud. Easily create an impressive statistic on www.naviki.org! You can always add an individual description.TURN BY TURN INSTRUCTIONS FOR RECORDED ROUTESNaviki provides turn-by-turn instructions for paths of arbitrary origin, including those you recorded with Naviki.MEMORISE PATHS Plan comfortably on the web and then immediately use your routes via App: transmit your routes from www.naviki.org to your Naviki App by just one click. LISTS FOR MEMORISED AND RECORDED ROUTES Clearly arranged lists show your recorded trips and the routes you calculated via web or Naviki App. Extras: “Find Points of Interest” is € 2,99 as an in-app purchase. Turn-by-turn navigation and leisure routing are € 3.79 each. Mountain bike routing and racing bike routing are € 4.79 each. Offline Maps starting from € 4,79.",
    "descriptionHTML": "Naviki is the comprehensive bicycle App! <br>Naviki offers worlwide best route planning for bicycles and an impressive documentation of your cycling activities. Optionally for everyday, leisure, mountain bike and racing bike Naviki provides ideal connections between any start and destination addresses, it immediately shows your routes on a map and navigates to your target by spoken navigation instructions and arrows on the display. Naviki easily records your own trips and synchronises them with www.naviki.org. The result is an impressive personal collection of routes! Simple and practical: Plan routes on www.naviki.org and transmit them to the App with just one click. <br><br>Naviki&#x2019;s most important functions: <br><br>ROUTE PLANNER <br>Simply enter your start and destination, immediately get your customised route with the most important additional information. <br><br>TURN-BY-TURN NAVIGATION <br>Spoken instructions and pleasantly large navigation arrows on your display. By means of spoken instructions, the phone can remain in your pocket which is energy-saving. Spontaneous deviation from a planned route is no problem - Naviki automatically calculates a new route to your destination. <br><br>EVERYDAY ROUTING <br>Gives you the cycle tracks for your daily activities. Prefers minor roads, bicycle lanes, rather short and straight routes as well as easy accessible and solid surfaces.<br><br>LEISURE ROUTING <br>Your cycle routes for tourism and leisure activities. Prefers officially signposted cycle tracks, easy accessible and solid surfaces, minor roads and a nice natural environment.<br><br>MOUNTAIN BIKE ROUTING <br>Your routes for great MTB experiences! Prefers unsealed surfaces, single trails, distinguished and signposted MTB routes as well as forest and country tracks.<br><br>RACING BIKE ROUTING <br>Racing bike routes for fascinating fast trips! Prefers sealed and smooth surfaces, tracks allowing high-speed cycling, minor roads, a scenic environment.<br><br>S-PEDELEC ROUTING<br>Tailored routes for fast e-bikes up to 30 mph on roads allowing power-driven vehicles. Prefers minor roads and a nice environment whenever possible. <br><br>ROUND TRIPS<br>Just enter a start and a required length &#x2013; Naviki calculates numerous alternative round trips to choose from for immediate navigation.<br><br>POINTS OF INTEREST<br>Naviki contains a huge and well-structured collection of Points of Interest you can easily implement in your calculated routes by using them as destinations.<br><br>OFFLINE MAPS<br>Download high quality Naviki maps on your smartphone and use them independent of internet access.<br><br>HEIGHT PROFILE <br>For all routes Naviki provides a height profile, the highest and lowest points and the total altitude to be cycled upwards. <br><br>CONVENIENT COCKPIT <br>Speed&#x200B;&#x200B;, average speed, distance traveled and distance to your target are always in view. During navigation and recording the speedometer is automatically displayed. <br><br>CONNECTIVITY <br>Via Bluetooth Naviki sends the distance to the next turn and navigation arrows to the coachsmart display (www.o-synce-shop.de). This saves battery power and your phone can remain in the pocket.<br><br>RECORDING YOUR OWN TRIPS <br>Just one tap and Naviki records the path you cycle and stores it in your personal Naviki Cloud. Easily create an impressive statistic on www.naviki.org! You can always add an individual description.<br><br>TURN BY TURN INSTRUCTIONS FOR RECORDED ROUTES<br>Naviki provides turn-by-turn instructions for paths of arbitrary origin, including those you recorded with Naviki.<br><br>MEMORISE PATHS <br>Plan comfortably on the web and then immediately use your routes via App: transmit your routes from www.naviki.org to your Naviki App by just one click. <br><br>LISTS FOR MEMORISED AND RECORDED ROUTES <br>Clearly arranged lists show your recorded trips and the routes you calculated via web or Naviki App. <br><br><br>Extras: &#x201C;Find Points of Interest&#x201D; is &#x20AC; 2,99 as an in-app purchase. Turn-by-turn navigation and leisure routing are &#x20AC; 3.79 each. Mountain bike routing and racing bike routing are &#x20AC; 4.79 each. Offline Maps starting from &#x20AC; 4,79.",
    "histogram": {
        "1": 1016,
        "2": 527,
        "3": 607,
        "4": 1280,
        "5": 1671
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/n1bYq2JKne07mOC21g5efDdLnx5Cr9XfYemK-gOs3NESBQfbGA-XXNlb27wiZLhu2YA=h310",
        "//lh3.googleusercontent.com/-bUF9cPHZwK9HSkLGn2KqiCT7NMVVJ0igXdwJvpd7q4r9YZu6lQK1Z7-9iZ9wdwetA=h310",
        "//lh3.googleusercontent.com/4YCtaUaq3kwnKfWGHf86k7Ld_07a7ofEQMNqkOohkff_4uDeatUWeAPFa20a-Ei2sw=h310",
        "//lh3.googleusercontent.com/bceDXyYDZI7h_IjV7etn-eDsdAr7haV6D06xL2rQZBw1RAVz_h2rd4v01HAKiMIAlqQ=h310",
        "//lh3.googleusercontent.com/pRHSa-Vg8eCxi0jlhkkdK3TfyINo9rrC0zhbu9_j2f5acsDVqdDRjj0Kl2N3E4TA1o8=h310",
        "//lh3.googleusercontent.com/0hwTE64lekVC52vmcvys9R_TievK8a6bU_48K2QNS55pNAY58_pkJMrRfiXIyMoTqOY=h310",
        "//lh3.googleusercontent.com/5OifqjPe92rlOyo4aRfeCmnu5d5Wvj1AIJJA6aucWKwA9jEh1rX-LDv-0_xcRxRO3IY=h310",
        "//lh3.googleusercontent.com/rS5r4DZkPyorR2MkvsvrIuB4BSzk1CYvoSJT5Kl6aOZstOhBrCd4IU99fPfzWiSo7dc=h310",
        "//lh3.googleusercontent.com/03DAqZLvTKxN-6YwxrGg1eIC-6W8wIkT1t4xAgjVv7-zeM6ZxGYJzS8eWvtjET8qgSs=h310",
        "//lh3.googleusercontent.com/3HoUgV_IA4ow3XCQJHqhnKu-toto6a8cbSZDFlgDUwwgLSWk-ppFSZjWDHq835QeRu9Q=h310"
    ],
    "comments": [
        "Nice and simple to plot the route, clear and easy to read on my phone. Very quick and helpful technical support.",
        "Very good",
        "Superb. Worked out some great routes for me that were safe and pleasant. The map graphics are superb. I'm slightly puzzled as to how some people say they prefer Google maps as for me they're like light and dark. For cycling this is way better. I just wish it had the ability to finish route with walking so I could, if necessary, lock up my bike and finish the journey on foot. Other than that it is perfect.",
        "Just ok. Ridiculous sign up procedure. Took 10 minutes. But very good navigation",
        "Really terrible navigation compared to Google maps. I bought the road bike and turn by turn navigation because Google maps doesn't really do cycling routes in Italy. From Sorrento to Vesuvius it took me the most horrible possible route - for over a mile it wasn't even a road, I had to get off and carry my bike down loads of steps - and even on roads it would constantly tell me to make a turn but then say \"you have left the route \" when I took the correct turn. It meant that I had to constantly stop to double check the route on my phone, as I couldn't trust the instructions. Also a lot sorer on battery than it probably should be, meaning that I ran out of battery midway through a journey that I hadn't expected to.",
        "There is no support in app nor on website. I bought turn by turn voice navigation and it stopped working after 3 months"
    ],
    "recentChanges": [
        "- Improvements for Android Oreo",
        "- Bugfixes",
        "For support please send us an e-mail (help@naviki.org)!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=org.naviki&hl=en&gl=us",
    "appId": "org.naviki"
}