{
    "title": "SG BusLeh: Award Winning",
    "summary": "Even tells you if the coming buses are double deck or bendy buses!",
    "icon": "//lh3.googleusercontent.com/KH6Ni3Qkak4kBxU-CeYvVDLiqQL_XKBipCNBQJuufzOP4LUpGlvDgSGbVkttTGSyV8qN=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 8438,
    "developer": "Originally US - Mobile App Development Singapore",
    "developerId": "8657364104187803118",
    "developerEmail": "calixto@originally.us",
    "developerWebsite": "http://by.originally.us/busleh",
    "developerAddress": "#03-47, Oxley Bizhub\n63 Ubi Road 1\nSingapore 408728",
    "updated": "January 11, 2018",
    "version": "148.0",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "description": "A SG Bus Arrival App for both SBS and SMRT bus arrival timing that Singapore Truly Deserves!SG BusLeh won LTA's Land Transport Excellence Awards 2016 - Most Innovative Solution!We now also provide SMRT train arrival timing as well as NTU & NUS internal shuttle bus timing!-------------By downloading or using the app, the terms stated at the bottom of this description will automatically apply to you. -------------Top Features 1. The only Bus Arrival Timing App that tells you where the bus is!Simply tap on a bus arrival timing to view the location of the bus on a map!2. Check you EZ-Link Card Balance anytime, anywhere!Forget looking for an EZ-Link card machine to check balance. You can now check your EZ-Link card balance using the SG BusLeh app!3. Got seats? No seat? You will know at a glance!The only SG Bus App that presents SBS and SMRT bus capacity as simple bars!4. Magical Unified SearchYou can search for anything! These includes bus numbers, postal codes, buildings, road names or even bus-stop ids! Anything would work! No other bus-app comes close.5. Favourites!!! All new Favourites feature - simply long-press on any bus-stop to add to Favourites. If you wish to, you may be your own government and rename bus-stops when adding them to Favourites!6. Bus Routes!Tap on Bus service number to see bus-routes!7. Don't waste time on a bus app!This app is optimized for speed. We have crafted a mechanism to store the latest timing from LTA on our high-speed servers so there's no lag!8. Now available on Android WearBusLeh is now available on your Android Wear smartwatches! This feature is only available for paid users.9. Bus IntervalsBusLeh now shows you the interval between the previous and upcoming bus so that you can better predict if your bus will be crowded by the time it reaches your stop!10. Notifications!Let BusLeh monitor your buses for you so you don't have to. BusLeh will automatically notify you when the bus you want is arriving!------------Note on App PermissionsThe app permission system on Android is really broken. As long as we request for any permission within any permission group, Android would display a permission warning for the entire permission group, which can be confusing. For example, we request for permission to generate custom bitmap. This permission belongs to the same group as SD card permission, leading to Android warning you about SD card access. Please trust us, we are not so bo liao to be interested in your personal data.------------Terms Of UseBy downloading or using the app, the terms here will automatically apply to you – you should make sure therefore that you read them carefully before using the app. We are offering you this app to use for your own personal use without cost, and we are not liable for any injuries, \"late for work\", \"late for exams\", \"bus don't want to come\" or any other form of damages, which can be monetary, emotional or otherwise that may arise from the use of this app. All bus arrival estimates in this app are provided \"as-is\" by Land Transport Authority, cached on our servers and served to you. We make no guarantee of the accuracy or reliability of bus arrival estimates.",
    "descriptionHTML": "A SG Bus Arrival App for both SBS and SMRT bus arrival timing that Singapore Truly Deserves!<br><br>SG BusLeh won LTA&apos;s Land Transport Excellence Awards 2016 - Most Innovative Solution!<br><br>We now also provide SMRT train arrival timing as well as NTU &amp; NUS internal shuttle bus timing!<br><br>-------------<br><br>By downloading or using the app, the terms stated at the bottom of this description will automatically apply to you. <br><br>-------------<br>Top Features <br><br>1. The only Bus Arrival Timing App that tells you where the bus is!<br>Simply tap on a bus arrival timing to view the location of the bus on a map!<br><br>2. Check you EZ-Link Card Balance anytime, anywhere!<br>Forget looking for an EZ-Link card machine to check balance. You can now check your EZ-Link card balance using the SG BusLeh app!<br><br>3. Got seats? No seat? You will know at a glance!<br>The only SG Bus App that presents SBS and SMRT bus capacity as simple bars!<br><br>4. Magical Unified Search<br>You can search for anything! These includes bus numbers, postal codes, buildings, road names or even bus-stop ids! Anything would work! No other bus-app comes close.<br><br>5. Favourites!!! <br>All new Favourites feature - simply long-press on any bus-stop to add to Favourites. If you wish to, you may be your own government and rename bus-stops when adding them to Favourites!<br><br>6. Bus Routes!<br>Tap on Bus service number to see bus-routes!<br><br>7. Don&apos;t waste time on a bus app!<br>This app is optimized for speed. We have crafted a mechanism to store the latest timing from LTA on our high-speed servers so there&apos;s no lag!<br><br>8. Now available on Android Wear<br>BusLeh is now available on your Android Wear smartwatches! This feature is only available for paid users.<br><br>9. Bus Intervals<br>BusLeh now shows you the interval between the previous and upcoming bus so that you can better predict if your bus will be crowded by the time it reaches your stop!<br><br>10. Notifications!<br>Let BusLeh monitor your buses for you so you don&apos;t have to. BusLeh will automatically notify you when the bus you want is arriving!<br><br>------------<br>Note on App Permissions<br><br>The app permission system on Android is really broken. As long as we request for any permission within any permission group, Android would display a permission warning for the entire permission group, which can be confusing. <br><br>For example, we request for permission to generate custom bitmap. This permission belongs to the same group as SD card permission, leading to Android warning you about SD card access. Please trust us, we are not so bo liao to be interested in your personal data.<br><br>------------<br>Terms Of Use<br><br>By downloading or using the app, the terms here will automatically apply to you &#x2013; you should make sure therefore that you read them carefully before using the app. We are offering you this app to use for your own personal use without cost, and we are not liable for any injuries, &quot;late for work&quot;, &quot;late for exams&quot;, &quot;bus don&apos;t want to come&quot; or any other form of damages, which can be monetary, emotional or otherwise that may arise from the use of this app. All bus arrival estimates in this app are provided &quot;as-is&quot; by Land Transport Authority, cached on our servers and served to you. We make no guarantee of the accuracy or reliability of bus arrival estimates.",
    "histogram": {
        "1": 379,
        "2": 190,
        "3": 396,
        "4": 2065,
        "5": 5408
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.0 and up",
    "androidVersion": "4.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ufwuTW44hGIIYOzS1ZJYp6UECk69KUmRekX1bpLq25sBKLxreH61yuNquEuHiF0zGg=h310",
        "//lh3.googleusercontent.com/Y_L1lgKD4jw6eGPvVkTEepqEetUPoKZprX_sCWNkVziDJLLBwhC_TJVoQTicLWw-33s=h310",
        "//lh3.googleusercontent.com/jr4tKrIG4_60tk5nwtMOa46xPrc9WAjnXAK4IMJlw3sS9AfjrEGVbABtl6rfm8vI8Q=h310",
        "//lh3.googleusercontent.com/Lx6-faRE7_W4h5HFdmNOQuorif4aZMhj-dbXPJfA8l4m13iQiuPnmHnPDRNZWD1kOpo=h310",
        "//lh3.googleusercontent.com/js5oCKFxN59tpN8QQphMbAD6oDWSQjb3vbV4Me-4MVE0V5vosOjqq6fOXW5Uuk76O5k=h310",
        "//lh3.googleusercontent.com/1rnngOHnaW-uvgpM5KV4EVpVNPNSGn445tftbaFV_RxH5sFewk5tENElNMke_GGPOatm=h310",
        "//lh3.googleusercontent.com/HHq1QPqFGUZ1Sr3tBCDwPXBln6jDXBh0iL5lMDCK6fXFXuGqiI2TKpLV9N7cge_Ggw=h310",
        "//lh3.googleusercontent.com/fKVJtDnPCCfdxckfMdvBxOL4AQVexC-EuoyMqeOKeLyd5GFQh7ww7R4K0SK4hcxPfg=h310",
        "//lh3.googleusercontent.com/RoABNLHDXTYouoHWgkxy4ayhPz9FM5ZMHrBfMFibxxjuGxQsNkdoBv0kOWe9zws222eC=h310",
        "//lh3.googleusercontent.com/59tSIFOA7qUku6fka894mRt4MPX-nL_QgKEEsNVExyq-Dc2bdjT7t0R76wK21cjYVIA=h310",
        "//lh3.googleusercontent.com/ETKzMUcqHyASTI1Do130yE9mtCQL0dZEAQwMWvKknu0xz7x28rBrW_SGiejIW8wD9tY=h310",
        "//lh3.googleusercontent.com/ew5hrlZ0Cmwcm96VFRK0UwmW32s7Gq23b6Hd51ynyaT0eGC_LqzFTHwIgAkiwli62n0=h310",
        "//lh3.googleusercontent.com/L05OoPKfjtx8HRAYZi9rtp9sSrxxpSdS-UOoccIRgu77KFNfuz_TOlR51H7lRcQRBdg=h310"
    ],
    "comments": [
        "Bus timing not accurate, can u all give LTA a wake up call? Pls add logic to remove buses from bus stops which are returning to the depo! (e.g 700A last bus at suntec Convention bus stop ) They don't fetch passengers! But the app shows it anyway. Learn that the hard way stranded past midnight. | Favourites should be first page | coming back, going out headers should have settings to auto hide.",
        "Been using this app for 2 months now. It's a good app but I can't get the notification to work no matter how I try. No notification for bus arrival, no notification for reaching destination as well. It just doesn't notify even when I've selected the necessary settings. My phone settings are also set to allow notification for this app. Using a Google pixel 2 xl.",
        "The user interface is great, however the app itself is quite unstable. Once I leave the app it starts slowing down my phone, and always crashes eventually. If this bug is fixed the app would be perfect.",
        "This app is a nightmare to use in the morning, timings constantly changing,  time travelling backwards etc.  Other than that,  it works almost perfectly.   Update : Developer claims to have fixed it but problems are still persisting.",
        "I subscribed for the paid version so that i can monitor the bus arrival time at notifications tab. It worked well previously but now no longer accurate and the time is frozen and won't update accordingly. Please fix this ASAP!",
        "This apps is ok but dont know why, when i edited and hid the bus at certain bus stop, the hidden bus stop will still keep appearing! Is there any way to hide the buses in certain bus stop?"
    ],
    "recentChanges": [
        "Minor fixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=originally.us.buses&hl=en&gl=us",
    "appId": "originally.us.buses"
}