{
    "title": "Conotoxia Currency Exchange",
    "summary": "Conotoxia - Online currency exchange office.",
    "icon": "//lh3.googleusercontent.com/gRePyB1uU-Ij_cfqTgGapcbkItzxKtzf8K7CLo9kpXTVrRv_yVeg4DZIcZBX_3wEj1E=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.5,
    "reviews": 2227,
    "developer": "Cinkciarz.pl Sp. z o.o.",
    "developerId": "Cinkciarz.pl+Sp.+z+o.o.",
    "developerEmail": "apps@cinkciarz.pl",
    "developerWebsite": "https://cinkciarz.pl",
    "developerAddress": "ul. Sienkiewicza 9\n65-001 Zielona Góra\nPolska",
    "updated": "December 22, 2017",
    "version": "2.3.2",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "Official app brought to you by Conotoxia - online currency exchange office.Discover our global brand! Cinkciarz is available in Polish. Other language versions are presented as Conotoxia. Two brands, the same services. Following features: Exchange rates: - Conotoxia exchange rates - NBP exchange rates- Currency converter - Exchange rates widget (widgets manually refresh every 15 sec),Transactions from bank account: - Buy / sell / exchange - Operations history Transactions from currency wallet: - Buy / sell / exchange - Summary - Top up - Withdraw- History of operations- History of blockagesSocial transactions: - Buy / sell- Your orders - Top 20Your profile: - Banking accounts - Recipients- Messages - Your data- Change password - Discount codes - Settings Services:- Standing orders- Direct payments- Currency alerts- Currency cards- ATM withdrawal- SMS exchange rates- Text messages packagesOther: - Create account- Branches - Consultants - News- Podcasts and Vodcasts- Podcast Player for Android Auto- Language settings - the app supports 35 languages (Polish, English (US), English (UK), French, Italian, Spanish, Portuguese (Brazil), Portuguese (Portugal), Catalan, German, Dutch, Danish, Swedish, Finnish, Norwegian, Russian, Czech, Slovak, Croatian, Romanian, Turkish, Ukrainian, Hungarian, Traditional Chinese, Simplified Chinese, Korean, Japanese, Vietnamese, Arabic, Thai, Greek, Hebrew, Hindi, Indonesian, Malay),Attention! In case of any issues concerning the application, please attach a detailed description of the problem via Google Play (select \"Email Developer\" in the \"Contact Developer\" section).",
    "descriptionHTML": "Official app brought to you by Conotoxia - online currency exchange office.<br><br>Discover our global brand! Cinkciarz is available in Polish. Other language versions are presented as Conotoxia. <br>Two brands, the same services.<br> <br>Following features:<br> <br>Exchange rates: <br>- Conotoxia exchange rates <br>- NBP exchange rates<br>- Currency converter <br>- Exchange rates widget (widgets manually refresh every 15 sec),<br><br>Transactions from bank account: <br>- Buy / sell / exchange <br>- Operations history <br><br>Transactions from currency wallet: <br>- Buy / sell / exchange <br>- Summary <br>- Top up <br>- Withdraw<br>- History of operations<br>- History of blockages<br><br>Social transactions: <br>- Buy / sell<br>- Your orders <br>- Top 20<br><br>Your profile: <br>- Banking accounts <br>- Recipients<br>- Messages <br>- Your data<br>- Change password <br>- Discount codes <br>- Settings <br><br>Services:<br>- Standing orders<br>- Direct payments<br>- Currency alerts<br>- Currency cards<br>- ATM withdrawal<br>- SMS exchange rates<br>- Text messages packages<br><br>Other: <br>- Create account<br>- Branches <br>- Consultants <br>- News<br>- Podcasts and Vodcasts<br>- Podcast Player for Android Auto<br>- Language settings - the app supports 35 languages (Polish, English (US), English (UK), French, Italian, Spanish, Portuguese (Brazil), Portuguese (Portugal), Catalan, German, Dutch, Danish, Swedish, Finnish, Norwegian, Russian, Czech, Slovak, Croatian, Romanian, Turkish, Ukrainian, Hungarian, Traditional Chinese, Simplified Chinese, Korean, Japanese, Vietnamese, Arabic, Thai, Greek, Hebrew, Hindi, Indonesian, Malay),<br><br>Attention! In case of any issues concerning the application, please attach a detailed description of the problem via Google Play (select &quot;Email Developer&quot; in the &quot;Contact Developer&quot; section).",
    "histogram": {
        "1": 110,
        "2": 51,
        "3": 118,
        "4": 304,
        "5": 1644
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/risgJnEn2Hq-dF9bgBV9DUckZbX-nyUxHP3E5vin9-2ILUIFSz1rR94VaW1IXU59Cw=h310",
        "//lh3.googleusercontent.com/1A0Mrj835eYJMBNJmJQUScoN4arRdkqEOfvEzxsqWkmXzdRyxM8mhQUZZpqxhl8XbNc=h310",
        "//lh3.googleusercontent.com/j3_lOC4vjzT9OwpiETcGc2nASjlr2NBrEKpn08-_co0I8XwqlXJznO9f3PQN9aFiiMI=h310",
        "//lh3.googleusercontent.com/1YGDDsXUHF2Mm3CTBwcI6gPb3Wy1TgVuo2NvNCc_TyPj-Uk1VZxaDduV-3FcX30O7Q=h310",
        "//lh3.googleusercontent.com/WmBJopR7j8OMJRCyDazfRRCZ4SRUM_bU70BAF-5vbMbo7vr3H0jGYrvlymkBOApaXA=h310",
        "//lh3.googleusercontent.com/P_T3H51qKAK7547xY2_h4474Fn0CQ_MxqD5-bXpErdrfa4rv7bRpDLQLij982OCRSQ=h310",
        "//lh3.googleusercontent.com/NL89QeH5M5YzEWtmLpkWhPN3_n1UIcgEeMLj4jvi7ohTkLli7UA3DvbuajN8E5jeVGk=h310"
    ],
    "comments": [
        "Perfect",
        "Can't login on Android 8 Oreo.",
        "Działa całkiem fajnie. Nie ma się do czego doczepić. Może domyślnie powinna się wyświetlać ulubione waluty.",
        "Intuicyjna w obsludze i czytelna.",
        "Co jest z aplikacją, że bez przymusowego zamknięcia, sama nie chce się wyłączyć.",
        "5/5"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=pl.cinkciarz&hl=en&gl=us",
    "appId": "pl.cinkciarz"
}