{
    "title": "Fu*** Weather (Funny Weather)",
    "summary": "Take your #@*&amp;% umbrella. Or better don&#39;t go outside at all.",
    "icon": "//lh3.googleusercontent.com/Y0kzAqRFpLgT5OM_nTzGgiZtZicyrcpQ_MBxF5lNnNUlqVToRgHcajfVAawr0G_GIw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.7,
    "reviews": 11868,
    "developer": "ZsuiwaL",
    "developerId": "ZsuiwaL",
    "developerEmail": "zsuiwal@gmail.com",
    "developerWebsite": "https://zsuiwal.github.io/",
    "updated": "October 12, 2017",
    "version": "Varies with device",
    "genre": "Weather",
    "genreId": "WEATHER",
    "size": "Varies with device",
    "description": "Sometimes, when we look outside the window, the only thing we can honestly say is: Oh #@*&%!Well, let Fu*** Weather app do that for you. It will check the weather and show it in a very special way...Features:Detailed current weather conditions,Hourly weather,Weather for a whole week (detailed of course),Weather maps (radar, satellite, temperature, humidity, wind),Home screen widgets,Optional weather notifications,Wearable app.Warning:The app contains strong language.",
    "descriptionHTML": "Sometimes, when we look outside the window, the only thing we can honestly say is: Oh #@*&amp;%!<br>Well, let Fu*** Weather app do that for you. It will check the weather and show it in a very special way...<br><br>Features:<br>Detailed current weather conditions,<br>Hourly weather,<br>Weather for a whole week (detailed of course),<br>Weather maps (radar, satellite, temperature, humidity, wind),<br>Home screen widgets,<br>Optional weather notifications,<br>Wearable app.<br><br>Warning:<br>The app contains strong language.",
    "histogram": {
        "1": 170,
        "2": 92,
        "3": 391,
        "4": 2311,
        "5": 8904
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Mature 17+",
    "screenshots": [
        "//lh3.googleusercontent.com/4WT8rpL4sW1C8cbNR-3Vbvrwv9H8t3XL2IWZM9S3ymIrDekmXtcTJGIPiW_BhmkR1g=h310",
        "//lh3.googleusercontent.com/2PQv5nOk3Ek03L5nAWlIpgPOPtYqfJumy9cvSRGmDKWCJn5Wca3OWQyeytVN8S1LKBg=h310",
        "//lh3.googleusercontent.com/9LjsWEGq4PzkD9MduEvkLvAzPCs6HDfGt4m3ZHP91Xff_O3UvEi-taNGR7SrfV7sBoI=h310",
        "//lh3.googleusercontent.com/dziWKCJq_uW5QDDrvcOUCodytV7q_2ISw4Lxf_e5GS3I1fmek6TUd6KVqCi7SEqQkiY=h310",
        "//lh3.googleusercontent.com/yPYghO5zrcbmL1WY-xJjk47RWhLbttEbPaUhR0MXUZWhNV7lYIW7cR2pBOwg2nKygyo=h310",
        "//lh3.googleusercontent.com/Ils8d4gYcPSFxHhXmde7FP3bBBzaJL3kZgthC2lkx0jQJMmTYoA5rpvEiwoTel6aEA=h310",
        "//lh3.googleusercontent.com/4iuoKvg1gdVQYslMOkce4L7NDk7vPba646llRH88soAzkNG2NnTfh20F4Jmtf54nRgU=h310",
        "//lh3.googleusercontent.com/QKsNURVQUkgT9rz_a3V3tTjoulB6da8blF1LYwA5xlnYjbr4CjcHO7IguZhI91UGmHc=h310"
    ],
    "comments": [
        "This app is great and the widgets are perfect for a minimalist Homescreen, BUT there needs to be an option to control the update Intervalls. This app is draining my battery because is uses GPS location constantly without any option to control it. At the moment the app has been using GPS for 2 hours and 40 minutes and I have only taken it off the charger 3 hours ago... it's using more battery than my screen! Please fix this and add an option to pay for a pro version.",
        "This app is amazing. First of all even though this app takes a comedic turn on the weather, it is still more accurate then the weather channels themselves, go figure. Second, the app itself is just hilarious, giving an amazing amount of humor on a day where the weather might have you down. This app easily dwarfs other apps that tell the weather not only with it's comedic theme, but also with it's accurate weather forecasts. Another small, but funny detail I would like to talk about is what the app said when it asked me to rate it. The app gave me three options, the third not being important, the other two options are very funny. The option I could choose for giving the app a rating was \"fantastic, I love this app\" or something like that, the first option only becomes funny when you read the second. The second option which you could choose if you didn't want to rate the app was \"frankly, that's a piece of ****\" which was so funny and made my day with how they customized the choices of whether you wanted to rate something or not. Five Stars!",
        "I like it. Makes me smile sometimes, and occasionally makes me chuckle. I think it may be from a developer not fluent in English, because some of its grammar and/or wording is off. Plus, in the timeline graph of predicted temperatures, the labels are celcius when truly the graph is a representation  of fahrenheit. (The graph shows 50°C and declining. 50°C is about 120°F...the true temperature now is about 50°F) A little more variety in descriptions could be good too...  Submissions of descriptions could expand the app and make it more user interactive.",
        "It's good, but not great. I think it would be great if it gave NOAA and / or other sever weather alerts. As well as if it did a better job with the UI for forecast for the coming days. The AI language needs a little more variance as well, after a few days of the same weather it repeats itself and the whole app losses at least some of it's charm and appeal at that point.",
        "Rather hilarious. My main complaint is this app was very was written in an area where it actually snows. For the rest of the minority states where it doesn't snow, the 50°s are cold darnit!",
        "It's funny. There should be a way to edit phrases that are included with the app. Speech wise, it doesn’t do well with contractions (easy fix would be to individualize them, example: can't = can not) it would be just as funny or funnier because it would be understandable) as is can't  sounds like can-tee"
    ],
    "recentChanges": [
        "•   Added new layers to weather maps (wind speed and humidity; available only for US locations)",
        "•   Weather maps can be zoomed in and out",
        "•   Satellite (earth) images can be used as weather maps' base",
        "•   High resolution maps can be enabled on supported devices",
        "•   Decreased battery drain",
        "•   Fixed broken (in some cases) weather sharing option",
        "•   Added new weather phrases",
        "•   Fixed some minor bugs, improved some stuff"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=pl.lawiusz.funnyweather.release&hl=en&gl=us",
    "appId": "pl.lawiusz.funnyweather.release"
}