{
    "title": "Prana - Breathe For Health",
    "summary": "This app will help you experience benefits of simple, deep breathing.",
    "icon": "//lh3.googleusercontent.com/ik-QQSpATe8Xq2N99bq_L-lh4qAPYC3o78DuuGt4eSRroYEBChQIQ_F-CyL_VT6f68A=w300",
    "price": "0",
    "free": true,
    "minInstalls": 5000,
    "maxInstalls": 10000,
    "score": 4.4,
    "reviews": 33,
    "developer": "w9 software",
    "developerId": "w9+software",
    "developerEmail": "w9@w9.pl",
    "developerWebsite": "http://www.moveup.zone",
    "developerAddress": "ul. Nickla 23/10\n41-908 Bytom\nPOLSKA",
    "updated": "August 8, 2016",
    "version": "1.0",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "“For breath is life, and if you breathe well you will live long on earth.” ~Sanskrit proverbThis beautiful breathing exercise app will help you experience benefits of simple, deep breathing which include: - Reduced anxiety and depression - Lower/stabilized blood pressure - Increased energy levels - Muscle relaxation - Decreased feelings of stress and overwhelmApp uses beautiful animations to guide you through the session. Thanks to subtle vibration cues you can also perform exercise with closed eyes. This app is designed for Android Wear devices but an also be used on your phone. ANY FEEDBACK IS VERY VALUABLE TO US!Especially, if you think the app lacks any feature or functionality just let us know. App is currently in intensive development phase and almost anything is possible.",
    "descriptionHTML": "&#x201C;For breath is life, and if you breathe well you will live long on earth.&#x201D; ~Sanskrit proverb<br><br>This beautiful breathing exercise app will help you experience benefits of simple, deep breathing which include:<br> - Reduced anxiety and depression<br> - Lower/stabilized blood pressure<br> - Increased energy levels<br> - Muscle relaxation<br> - Decreased feelings of stress and overwhelm<br><br><br>App uses beautiful animations to guide you through the session. Thanks to subtle vibration cues you can also perform exercise with closed eyes. <br><br><br>This app is designed for Android Wear devices but an also be used on your phone. <br><br><br>ANY FEEDBACK IS VERY VALUABLE TO US!<br>Especially, if you think the app lacks any feature or functionality just let us know. App is currently in intensive development phase and almost anything is possible.",
    "histogram": {
        "1": 1,
        "2": 2,
        "3": 2,
        "4": 6,
        "5": 22
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/PqYXlBjJr3UvvLNv2LPFUl2J5txeF4Jf2dJnQFfPeQ3RhyxBpOHuCqkmlonR1MP03g=h310",
        "//lh3.googleusercontent.com/OCW4oAgenq2uPmuxD9jobsdON3LL7-wsZqfbI7_dJ124AMGCjmv2DDR3-Pyt4GDECks=h310",
        "//lh3.googleusercontent.com/39VIXbuDctGQIo4LcW84-VI9SCp4DbQOC193RksWopYZiWU5cjaicp3jdLhhSML-KHo=h310",
        "//lh3.googleusercontent.com/DRSz1qWB9gIV2UtNVLpH1nZANMjSSlzETmhBW7aLtxHorheNYo31C7ue1sE6I_ArdCpk=h310"
    ],
    "comments": [
        "Great app! Finally a really nice simple breathing exercise app for android wear! Love the graphic style! Would love to see more features such as adjusting the inhale exhale timing, custom colour plus more shape variations. Keep up the good work!",
        "Not sure how to contact the company, saw they want feedback so I'll put that here. I am given a cue for breathing in but no cue is given for when I am to exhale. I'm left just holding my breath.",
        "Awesome app! It does exactly as it should and I'm glad it's a Android Wear first application. I love the tiny vibrations that it does on the watch. For future versions. It would be nice to have a Google Fit add-on.",
        "I would like to be able to customize inhale hold exhale durations, and also reminders to do the exercises would be helpful maybe enable a trigger from the mutlitimer",
        "The vibrations are a bit weird but the graphics are nice. Perfect alternative to the Breathe app on Apple Watches.",
        "Please support heart rate BPM. I need to know how many beats my heart produced after the minute of breathing. Please."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=pl.w9.prana&hl=en&gl=us",
    "appId": "pl.w9.prana"
}