{
    "title": "Music Player for Wear",
    "summary": "A File Manager, an Offline Music Player and a Gallery on your wrist",
    "icon": "//lh3.googleusercontent.com/FYFKb-HctwrFl08GLOJRa0qAEug5R_Sw-TRjD1YFVP_vpYIavPhSGCb51ieNYfln2gQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 1648,
    "developer": "QubinApps",
    "developerId": "QubinApps",
    "developerEmail": "qubinapps@gmail.com",
    "developerWebsite": "http://www.qubin.de",
    "developerAddress": "Schaafenstraße 65\n50676 Köln",
    "updated": "June 12, 2017",
    "version": "Varies with device",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "size": "Varies with device",
    "description": "Offline Music Player and File Manager and GalleryWith Wear Media you can manage your files on your watch and also move any kind of files or complete folders from your phone to your watch. During the copy process you will always keep the overview over the copy state of each file. Copied files or folders can easily be deleted with the integrated file explorer.The integrated music player on the smartwatch allows playing of music files offline with different media types like mp3, wav, m4a, aac, mp4, ogg. This means that no connection to the smartphone is needed. The watch app has also a file explorer integrated with which you can navigate through your music collection. The player supports the usual play modes like shuffle or different types of repeat playing, next and previous track or change volume. Furthermore in the music player screen you can fast-forward or rewind the track with an nice looking waveform which is animated during playback. The music player can save the track position for each music file and therefore it is perfectly suited to use for audiobooks and podcasts. An audiobook or podcast usually has a length of about a couple of hours and storing the track position will help you to stop and start playing at the last position.Additional, Wear Media has an image galerie integrated with which you can navigate through your transfered pictures and the viewer allows also zoom in and out of images.Key features------------------File Manager / Explorer★ Faster transfer due to new Channel API (WIFI support)★ Browse through your files on your watch and phone★ Copy files/folders from your phone to your watch and see the progress size, duration, transfer rate and average★ Delete files/folders on your watchOffline Music Player (Watch and Phone)★ Offline music player on your watch and phone with shuffle and repeat (3 modes)★ Music player stores and restores track position★ Perfect for audiobooks and podcastsImage Gallery on Watch including Zoom★ Gallery on your watch with zoom in/out of images★ Double Tap to Zoom in/out★ Drag during zoomed in mode to swipe the image★ Long press to delete the image from watch----------------------------------------------------To get a ad-free version upgrade to premium.----------------------------------------------------Compatible with all Android Wear devices.Please make sure your Phone / Wear and Google Apps are up-to-date:Google Play Services app version 7.3.28 or aboveGoogle Search app version 4.0 or aboveAndroid Wear app version 1.1.0 or abovehttps://support.google.com/androidwear/answer/6057772?hl=en&ref_topic=6056410----------------------------------------------------------------------------------------------------------Do you have suggestions for improvement or additional feature requests? Any ideas or problems with the app. Before leaving negative feedback, please get in touch with us.We are always willing to help users and therefore respond quickly: qubinapps@gmail.comBeta tester are always welcome and you can join the group here: https://plus.google.com/u/2/communities/117293678283345732223",
    "descriptionHTML": "Offline Music Player and File Manager and Gallery<br><br>With Wear Media you can manage your files on your watch and also move any kind of files or complete folders from your phone to your watch. During the copy process you will always keep the overview over the copy state of each file. Copied files or folders can easily be deleted with the integrated file explorer.<br>The integrated music player on the smartwatch allows playing of music files offline with different media types like mp3, wav, m4a, aac, mp4, ogg. This means that no connection to the smartphone is needed. The watch app has also a file explorer integrated with which you can navigate through your music collection. The player supports the usual play modes like shuffle or different types of repeat playing, next and previous track or change volume. Furthermore in the music player screen you can fast-forward or rewind the track with an nice looking waveform which is animated during playback. The music player can save the track position for each music file and therefore it is perfectly suited to use for audiobooks and podcasts. An audiobook or podcast usually has a length of about a couple of hours and storing the track position will help you to stop and start playing at the last position.<br>Additional, Wear Media has an image galerie integrated with which you can navigate through your transfered pictures and the viewer allows also zoom in and out of images.<br><br>Key features<br>------------------<br><br>File Manager / Explorer<br><br>&#x2605; Faster transfer due to new Channel API (WIFI support)<br>&#x2605; Browse through your files on your watch and phone<br>&#x2605; Copy files/folders from your phone to your watch and see the progress size, duration, transfer rate and average<br>&#x2605; Delete files/folders on your watch<br><br>Offline Music Player (Watch and Phone)<br><br>&#x2605; Offline music player on your watch and phone with shuffle and repeat (3 modes)<br>&#x2605; Music player stores and restores track position<br>&#x2605; Perfect for audiobooks and podcasts<br><br>Image Gallery on Watch including Zoom<br><br>&#x2605; Gallery on your watch with zoom in/out of images<br>&#x2605; Double Tap to Zoom in/out<br>&#x2605; Drag during zoomed in mode to swipe the image<br>&#x2605; Long press to delete the image from watch<br><br><br>----------------------------------------------------<br>To get a ad-free version upgrade to premium.<br>----------------------------------------------------<br>Compatible with all Android Wear devices.<br>Please make sure your Phone / Wear and Google Apps are up-to-date:<br><br>Google Play Services app version 7.3.28 or above<br>Google Search app version 4.0 or above<br>Android Wear app version 1.1.0 or above<br><br>https://support.google.com/androidwear/answer/6057772?hl=en&amp;ref_topic=6056410<br>----------------------------------------------------------------------------------------------------------<br><br>Do you have suggestions for improvement or additional feature requests? Any ideas or problems with the app. <br>Before leaving negative feedback, please get in touch with us.<br><br>We are always willing to help users and therefore respond quickly: qubinapps@gmail.com<br><br>Beta tester are always welcome and you can join the group here: <br>https://plus.google.com/u/2/communities/117293678283345732223",
    "histogram": {
        "1": 103,
        "2": 56,
        "3": 131,
        "4": 383,
        "5": 975
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/YSMO2-eqXdAoRtziYJecevRhPGQp4Zos5Ypi3ae3AHhoFLurVmqx5mR2C9MhYQn3ow=h310",
        "//lh3.googleusercontent.com/NnO8tz8ODSDFfLOarJXf7gh9187oQc3-3ljQnclbEc3SERmARDhEGUSLkNYesI43Zv8V=h310",
        "//lh3.googleusercontent.com/mOMpfWs8e1OiouQ4IaPVYbbVtYg7LfvXAGBk1jABlZQugnAfuYrrjLa_32NJ_bMMrA=h310",
        "//lh3.googleusercontent.com/HYw56s4gqxekCUz3bVFFivwaJoYjBjVkdUtVDeFVxLqXkT2l-mNvdnYhMZIm6Xd1K6vb=h310",
        "//lh3.googleusercontent.com/k_f7j2xBazaMKNW7O-zujGDeP0j-1uY3viWHX6RRj92cQ20ZgkqYeQllCN94mvxfT1U=h310",
        "//lh3.googleusercontent.com/hmRj-rx4ZvkoKhldH1uoN24mmpMnOEnwGqSK6ZrWaNvydPBTCEPdgY8Z4-YYA-MxhE0=h310",
        "//lh3.googleusercontent.com/h0Y_-gGSVDYPjyFuHvrLDH-NPFOtthoSDwW_1ajcqDbW9O7k_2qhjhe9spimiVwardw=h310",
        "//lh6.ggpht.com/g62TFva3kIY35p6Fu0YJ17jcW4q-KQUSrLP2fTTJLqwAkBKla1bLF8uiL-FXg9Ib5kE=h310",
        "//lh3.googleusercontent.com/7S5SaX1AgQJwbKMHOLKdCXi4tugYaid791GUITNjrRrJ8uYs7bSAY_AA3rnRUVs4_Ew=h310",
        "//lh3.googleusercontent.com/8R4faxZcF_pd-UShB4AaIM2zbgd5ArsK9PfTEAVGd7ahYU11o9ThswHhBHtFUwnw6fJi=h310",
        "//lh3.googleusercontent.com/ltq4CwaZWf6lW6OAQJqNQzRKOChgKCwRWwwMZOGDFn9--dzXVC_OSe2JJp4mSMyDQC6K=h310",
        "//lh3.googleusercontent.com/xwK_xEBzOIHr61-u15dtFBqyU2-LJgxxg7rnln92ps7E4_XjnWsD3vAIZEG7kJcm9Qg=h310"
    ],
    "video": "https://www.youtube.com/embed/1WTbBsnhoOs",
    "comments": [
        "Has every feature I've been looking for.  This is a comprehensive app to move media from phone to Android Wear. The estimated transfer time is a nice touch.  It isn't super intuitive to use but I got the hang of it after a few minutes. It isn't the prettiest app ever but no big deal.  My nitpick would be that when playing back audio on Android Wear it does not respond to pause/play commands from my headphones like every other app seems to do. This would be nice to see added.",
        "Fantastic! The simple fact alone that this slams google for having such a crappy app, makes it A++ Here is what I use, on this app that works. Move music files to music folder, and use music player to play on the watch. google wants me to upload to their player, or join a subscription. No way. This app does what I need. Con: transfer is a bit slow, I think that is a hardware issue, cause this developer writes a great app, I can deal with a little slow transfer for each song one time.",
        "Free version had way to many ads forcing one to upgrade to pay version which should be reported to Google.  The app works but is very slow, about 120KBS even on WiFi.  However when copying files, it does not recognize ones already copied, so the transfer then takes much longer.   Could and should be great, but is let down on greed and lack of functionality.  This app should be getting around 2MB second and is not.",
        "Literally ads every 5-10 seconds, even layering over each other. If you want ads in your app, fine. But don't make your app unusable because of them. Ugh. It wouldn't transfer the files for me either.",
        "Was awesome. Now gets stuck in weird ad loops. See the same ad every few seconds. Also forcibly reorients the screen...very annoying",
        "Very nice app. Sync works just fine between phone and watch. Bluetooth headphones buttons don't work when playing from Android Wear device. Also the interface for smartwatch is pretty bad for the size of the screen."
    ],
    "recentChanges": [
        "- Player - Shuffle will now play all files from the folder/subfolder, where the current file is playing",
        "- Removed bad translations, if you want your language back, please help to get better translations :-)"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=qubin.de.wearmedia&hl=en&gl=us",
    "appId": "qubin.de.wearmedia"
}