{
    "title": "Energy Radio",
    "summary": "Enjoy anytime, anywhere your favorite music with Energy Radio",
    "icon": "//lh3.googleusercontent.com/LiWzpweVjEtHLVgSNgIWlwZB4fRlTYxgBbhTkA9-3b6-WYL5urmqC5FiSDs4VT1yD-k=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.1,
    "reviews": 8257,
    "developer": "Energy Schweiz",
    "developerId": "Energy+Schweiz",
    "developerEmail": "marketing@energy.ch",
    "developerWebsite": "http://www.energy.ch",
    "updated": "November 13, 2017",
    "version": "3.0.2",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Geniesse jederzeit und überall deine Lieblingsmusik und bleib mit den aktuellsten Artikeln auf dem Laufenden. Egal, wann und wo: Hör dir jede Sendung und jede beliebige Stelle des bereits ausgestrahlten Energy Programms nochmals in Ruhe an. Mit der Energy Radio App empfängst du neben Energy Basel, Energy Bern und Energy Zürich mehr als 50 Radioprogramme unterschiedlicher Musikrichtungen und Energy TV. Spartenkanäle wie Energy Rock, Energy Black, Energy Lounge und viele mehr lassen keinen musikalischen Wunsch offen. Entdecke neue Musik auf Energy Hot, tauche mit den zeitlosen Klassikern von Energy 80’s, 90’s und 00‘s in die Vergangenheit ein oder lass dich mit Energy Soundtrack und Energy Live in andere Welten entführen. Energy – dein Sound für jede Stimmung. Energy ist das erste Online-Radio mit integrierter On-Demand-Funktion. Wenn du eine Sendung verpasst hast und nochmals hören willst, scrolle einfach in der Timeline zurück. Möchtest du in einen bereits gespielten Song reinhören? Auch das ist direkt in der Channel Timeline möglich. Falls dir der laufende Channel nicht gefällt, kannst du einfach per Swipe zum nächsten Channel wechseln.Du bist dir noch nicht sicher welchen Channel du hören willst? Geht einfach in die Explore Ansicht und entdecke welcher Song gerade auf welchem Channel läuft.",
    "descriptionHTML": "Geniesse jederzeit und &#xFC;berall deine Lieblingsmusik und bleib mit den aktuellsten Artikeln auf dem Laufenden. Egal, wann und wo: H&#xF6;r dir jede Sendung und jede beliebige Stelle des bereits ausgestrahlten Energy Programms nochmals in Ruhe an.<br> <br>Mit der Energy Radio App empf&#xE4;ngst du neben Energy Basel, Energy Bern und Energy Z&#xFC;rich mehr als 50 Radioprogramme unterschiedlicher Musikrichtungen und Energy TV. Spartenkan&#xE4;le wie Energy Rock, Energy Black, Energy Lounge und viele mehr lassen keinen musikalischen Wunsch offen. Entdecke neue Musik auf Energy Hot, tauche mit den zeitlosen Klassikern von Energy 80&#x2019;s, 90&#x2019;s und 00&#x2018;s in die Vergangenheit ein oder lass dich mit Energy Soundtrack und Energy Live in andere Welten entf&#xFC;hren. Energy &#x2013; dein Sound f&#xFC;r jede Stimmung.<br> <br>Energy ist das erste Online-Radio mit integrierter On-Demand-Funktion. Wenn du eine Sendung verpasst hast und nochmals h&#xF6;ren willst, scrolle einfach in der Timeline zur&#xFC;ck. <br>M&#xF6;chtest du in einen bereits gespielten Song reinh&#xF6;ren? Auch das ist direkt in der Channel Timeline m&#xF6;glich. Falls dir der laufende Channel nicht gef&#xE4;llt, kannst du einfach per Swipe zum n&#xE4;chsten Channel wechseln.<br><br>Du bist dir noch nicht sicher welchen Channel du h&#xF6;ren willst? Geht einfach in die Explore Ansicht und entdecke welcher Song gerade auf welchem Channel l&#xE4;uft.",
    "histogram": {
        "1": 838,
        "2": 383,
        "3": 687,
        "4": 1378,
        "5": 4971
    },
    "offersIAP": false,
    "adSupported": true,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/vn5Z4LluAluaZiJ1EVPvwMJJU9_npkhRqoF_sHrLgO1_1SnJD2WUAxq3A1b_HuaKosU=h310",
        "//lh3.googleusercontent.com/-tR3emeWhJcNYan7iTSp0l1oHSSKs5jzwENbbi-_uw3nVgO4FNEOnnYCwSHuTYeoUGT_=h310",
        "//lh3.googleusercontent.com/dQC5-7_JI8WOljImAtahk3JKjSicfWssj8ywcXrE4Q9YBdxFUr31S4UDnYya4DA1I9k=h310",
        "//lh3.googleusercontent.com/1FMA23r3Hk_DFW-p_Z4ShAzQRi8wzXnutYKAg-puqCvqWarkiJelxwIyU76tJEMBqw=h310",
        "//lh3.googleusercontent.com/yflkS7vzmSR790IFU39RfzG2B3Yz15CC4wtqWnPyIqrpRHOymDYZJszkDhLt2hEXPGIV=h310"
    ],
    "comments": [
        "Nostalgic non-stop music from my favourite decade ( The 80's ) 😊",
        "Loved it! 👍",
        "Its aight",
        "the best radio ever!",
        "Love it!!!",
        "Best /excellent /  Radio / Mobile  phone  # 1"
    ],
    "recentChanges": [
        "Bewerte jetzt unsere App oder gib uns Feedback, was wir besser machen sollten. Unter More bei Einstellungen findest du das Feedback-Formular, über welches du direkt mit uns in Kontakt treten kannst. Wir beantworten alle Meldungen persönlich und freuen uns auf deine Inputs."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=radioenergy.app&hl=en&gl=us",
    "appId": "radioenergy.app"
}