{
    "title": "IntelliText - SMS for Wear",
    "summary": "Intelligent SMS for Android Wear - Historic suggestions, rules, voice and more.",
    "icon": "//lh6.ggpht.com/epjOyVROOMT1WR89crh-K3Im-TpEpk19WDBUloEvq9n7Ts2XFxqrHDlyj69T54D2qew=w300",
    "price": "$1.95",
    "free": false,
    "minInstalls": 100,
    "maxInstalls": 500,
    "score": 3.8,
    "reviews": 9,
    "developer": "RBApps",
    "developerId": "RBApps",
    "developerEmail": "ronnieballe@hotmail.com",
    "developerAddress": "Nørregade 5\n8660, Skanderborg",
    "updated": "March 18, 2015",
    "version": "1.0",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "The intelligent SMS texting app for Android Wear!Analyses incoming SMS (text) and MMS (text/image) messages in order to suggest relevant replies on your watch based on:A: Previous conversations with that person.What was your reply the last time that person wrote something similar to the current message.B: Rules Intelligently parse and detect questions and common phrases in incoming messages, and suggest relevant replies based on those.- When will you be home? - Are you coming over today or tomorrow? - How many do you want? - See you then.- Thank you.- Will you come and pick me up? - etc.You can always add your own rules, as well as editing the included default ones.Default rules are included for languages: English, Danish (more will follow soon)In addition to the smart-reply capabilities, IntelliText also enables you to:- Dictate replies by speaking to your watch.- Setting reminders from your watch, to remind you to reply to an incoming message later.- Open the current message on your phone from your watch (in your existing messaging app).Note:Make sure to open the IntelliText app on your phone after downloading.This is required to enable IntelliText to subscribe for incoming messages due to Android security measures.FAQ:- Will the wear app show incoming MMS images on my watch?Yes! IntelliText will use the incoming image as background when displaying the associated text message on your watch.- Why do I receive 2 notifications on my watch for every incoming message?Solve this by disabling the default SMS watch notification inside \"Android Wear\" settings on your phone (or just block the default one from your watch).You will still receive the notifications from IntelliText.- When I receive MMS messages, it sometimes take several seconds before the message is pushed to my watch, why?IntelliText will wait for the image to finish downloading on your phone, once it has - it will be instantly sent to your watch. When you have had a chance to try IntelliText for yourself, please take a moment to give us a rating in the store - it helps us knowing how we are doing, as well as what we need to improve on next - thanks!More useful features are planned for future releases and feature requests in general are always very welcome.Please send your feature requests by email.",
    "descriptionHTML": "The intelligent SMS texting app for Android Wear!<br><br>Analyses incoming SMS (text) and MMS (text/image) messages in order to suggest relevant replies on your watch based on:<br><br>A: Previous conversations with that person.<br>What was your reply the last time that person wrote something similar to the current message.<br><br>B: Rules <br>Intelligently parse and detect questions and common phrases in incoming messages, and suggest relevant replies based on those.<br><br>- When will you be home? <br>- Are you coming over today or tomorrow? <br>- How many do you want? <br>- See you then.<br>- Thank you.<br>- Will you come and pick me up? <br>- etc.<br><br>You can always add your own rules, as well as editing the included default ones.<br>Default rules are included for languages: English, Danish (more will follow soon)<br><br>In addition to the smart-reply capabilities, IntelliText also enables you to:<br><br>- Dictate replies by speaking to your watch.<br>- Setting reminders from your watch, to remind you to reply to an incoming message later.<br>- Open the current message on your phone from your watch (in your existing messaging app).<br><br><br>Note:<br>Make sure to open the IntelliText app on your phone after downloading.<br>This is required to enable IntelliText to subscribe for incoming messages due to Android security measures.<br><br><br>FAQ:<br><br>- Will the wear app show incoming MMS images on my watch?<br>Yes! IntelliText will use the incoming image as background when displaying the associated text message on your watch.<br><br>- Why do I receive 2 notifications on my watch for every incoming message?<br>Solve this by disabling the default SMS watch notification inside &quot;Android Wear&quot; settings on your phone (or just block the default one from your watch).<br>You will still receive the notifications from IntelliText.<br><br>- When I receive MMS messages, it sometimes take several seconds before the message is pushed to my watch, why?<br>IntelliText will wait for the image to finish downloading on your phone, once it has - it will be instantly sent to your watch. <br><br><br>When you have had a chance to try IntelliText for yourself, please take a moment to give us a rating in the store - it helps us knowing how we are doing, as well as what we need to improve on next - thanks!<br><br>More useful features are planned for future releases and feature requests in general are always very welcome.<br>Please send your feature requests by email.",
    "histogram": {
        "1": 1,
        "2": 2,
        "3": 0,
        "4": 1,
        "5": 5
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/bH973O6JsivA0BUjD8wwW9W2BECbKxl_OcWybfsbQUnK3mkpX4s5fQaXcv4VzTBMlqw=h310",
        "//lh4.ggpht.com/3dcakY1jiKth6w5gRvLil221sbSaVser149IRj0OixlVTcLQb9cthJKGGVbar0jwVDk=h310",
        "//lh5.ggpht.com/cBTl3KI8SdoVcjO5V12IYl1z9G5gw_H9sfwoA1LjsXD3hPWM9z0O3PTR3LlBjDoSUusl=h310",
        "//lh3.ggpht.com/BWFNLoamrbF11JqCsEwCQfpMLuyPxm5I6kcm8Y0m5kYwWFQsU_sK40Xhr9ifUtTb5HjT=h310",
        "//lh6.ggpht.com/d2wdt-uAHnIKQvdM6VXIvdca9JG5AspaLbsXRhHAuhFs_-qLevwIWhukoAjwGnV_VIY=h310",
        "//lh6.ggpht.com/_WXkpurWrAw6r9m_BSjF0OtgvY1QS2ptbT_yKJIncx46O5sD4aC4XINvC6t3PQVzqFU=h310",
        "//lh4.ggpht.com/vHBzTAMUnnlHYD7TZORwg0oSAX3_zGjSTeVABdM9TyGY84ci4ebDemvgJUuTAgRFDc0=h310",
        "//lh5.ggpht.com/SwxSPk0UylDBjvPu-oL4NPU-bmNU1Kg-2cfeJYuNdjUigepqj2_mtJTETAU1HPYe-2zq=h310"
    ],
    "comments": [
        "I really like this app.  The MMS pictures show on my moto 360 just fine.  The responses work great as they are, although they can be customized as well.    I think the author should consider a free trial, because I think a lot of people would pay for this, if they knew for a fact that it worked on their phone/watch.  It's really good, but nobody seems to know about it.  I have tried it with chomp, verizon messaging, and the stock messaging app.  They all work good.  But it doesn't seem to play nice with Textra, so hopefully that gets worked out in a future build.  Very nice app, and well worth the 2 bucks.  A note to the author, though - give us the option to kill the toast message on our phone.  It isn't a deal breaker, and it's small, but I'd rather have the option to not have it there.",
        "Intellitext Needs work, developer could extend how long the message appears on your screen and allow you to send outgoing messages without waiting for someone to message you. Can you see previous conversations ? Upon testing during a work day it failed the ease of use test and missed calls and messages. I have now swaped to a different free app Drextee Messenger",
        "The phone interface is clunky and a bit tedious to set up.  What I'm most annoyed by though is the claim that the phone will receive MMS text and pictures, neither of which came through.  I don't know if there is anything I need to do outside of the instructions, but I was greatly disappointed that it didn't deliver as promised in the description. (Using a Moto 360.)",
        "Excellent Just what I was looking for. Adds so much functionality to Android Wear. Well worth the price.",
        "When i pressed dictations it gave a dam checkmark and did absolutley nothing",
        "Works exactly as promised."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=rbapps.intellitext&hl=en&gl=us",
    "appId": "rbapps.intellitext"
}