{
    "title": "Task Manager For Android Wear",
    "summary": "First task manager for the Android Wear operation system. Download now for free.",
    "icon": "//lh3.googleusercontent.com/1gsAXzPTgyiY6acsKP3exNb3bX8711qHYcDihvAUEifQ3bGKS1X7RMXdqmlcQm3VctuO=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.1,
    "reviews": 1420,
    "developer": "Wearable Software",
    "developerId": "9027257451638050761",
    "developerEmail": "support@wearable-software.com",
    "developerWebsite": "http://www.wearable-software.com/",
    "developerAddress": "Wearable Software\nCedric Larrat\nGrötzingerstr. 73\n76227 Karlsruhe-Durlach",
    "updated": "August 31, 2015",
    "version": "1.2.1",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "The first task manager for the Android Wear operation system. Android Wear Task Manager can list all running processes on your watch and it can help you to stop any of the tasks easily and quickly. You could also close all opened apps at once with the \"Close all\" button. Download this helper now for free. Get more top apps, games & news with \"Android Wear Center\": http://tinyurl.com/m87stxsPlease note:-Make sure your mobile is compatible with Android Wear.-Make sure to pair your phone with the wearable device with help of the Android Wear App.-To open: Go to \"Start...\" and open the app \"Task Manager\" or say \"Start Task Manager\" -Some apps might restart themselves immediately after being killed. This is normal, as these apps run as constant services.You have to own an Android Wear device to use this appCurrently compatible devices:► HUAWEI Watch► Moto 360 Gen 2 (2015)► Moto 360 Gen 1 (2014)► Asus Zenwatch► LG G Watch► LG G Watch R► LG G Watch Urbane (Android Wear version)► Samsung Gear Live► Sony SmartWatch 3Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let me know.",
    "descriptionHTML": "The first task manager for the Android Wear operation system. Android Wear Task Manager can list all running processes on your watch and it can help you to stop any of the tasks easily and quickly. You could also close all opened apps at once with the &quot;Close all&quot; button. Download this helper now for free. <br><br><br>Get more top apps, games &amp; news with &quot;Android Wear Center&quot;: http://tinyurl.com/m87stxs<br><br><br>Please note:<br>-Make sure your mobile is compatible with Android Wear.<br>-Make sure to pair your phone with the wearable device with help of the Android Wear App.<br>-To open: Go to &quot;Start...&quot; and open the app &quot;Task Manager&quot; or say &quot;Start Task Manager&quot; <br>-Some apps might restart themselves immediately after being killed. This is normal, as these apps run as constant services.<br><br><br>You have to own an Android Wear device to use this app<br>Currently compatible devices:<br>&#x25BA; HUAWEI Watch<br>&#x25BA; Moto 360 Gen 2 (2015)<br>&#x25BA; Moto 360 Gen 1 (2014)<br>&#x25BA; Asus Zenwatch<br>&#x25BA; LG G Watch<br>&#x25BA; LG G Watch R<br>&#x25BA; LG G Watch Urbane (Android Wear version)<br>&#x25BA; Samsung Gear Live<br>&#x25BA; Sony SmartWatch 3<br><br><br>Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let me know.",
    "histogram": {
        "1": 129,
        "2": 59,
        "3": 142,
        "4": 371,
        "5": 719
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3 and up",
    "androidVersion": "2.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/3bw1e_QLvwqE7pCt77hxHLv-smCv2SOb-NsQ7VWxQLuWxNxS6unZNQ8yWa5XORdYXu0Z=h310",
        "//lh3.googleusercontent.com/8H05mKQhaoFQRpABdODwezINBx8oqkOY5qPk60QhnjMiq5gs8Ue5T7Hr4C95h0_TarU=h310",
        "//lh3.googleusercontent.com/D62OkWiwVfFLG-rDufprjMervrZX7HD7iMm3tEdIZJLCMDS5UoFNkagItZrUx1eTHA=h310",
        "//lh4.ggpht.com/m0IzRKy3USR7YJqooXRWdp4oBeJ9ITWQfhLoPBGdiLoTpSTRfQyKSPxOqTU0r-65Bg=h310",
        "//lh3.ggpht.com/xMZ3QcA-7_j9Gl95f4OI_gZU_2wNvOcsN95-0CiUEYWMY31YBUQHDnpITvNnF6LJTkE=h310"
    ],
    "comments": [
        "Really effective app and very simple. The app provides a single button to stop all apps (I don't seem to have an 'advanced settings' button). It's also not clear what the app is doing to my watche but it has definitely boosted battery life and has sped up the whole wear 2.0 experience on my ticwatch s. In that respect, how can I complain? I definitely recommend the app.",
        "Sony wear 3 Battery life was all over the place. Had to charge at least once ever 24hours sometimes it was dead within a few hours. Was not happy with it at all. After this was installed it's a whole different story. 48 hours plus after every charge.  :-D",
        "A task manager is great for Android Wear. It works very well and it has helped me close apps that weren't responding. It doesn't have all the features that task manager on Windows does though, such as CPU and RAM usage, but it works well.",
        "Don't work All normal apps came back to life after killed.   REPLY: Yes they're normal non blue apps.  In fact I pressed the killed all and the non blue were gone for a minute or so.  This is on LG Urbane 2nd LTE.",
        "Works as expected. Only issue I have is I have TouchOSC sideloaded on a Moto 360 and when I kill it and try to reopen it it still takes me to the same screen, and without a back button I get stuck on that screen. I can still quit it and use the watch as normal but I have to restart the watch to get back to TouchOSC's main menu, where I was hoping this app would properly exit it so I could relaunch and be back at the main menu. Other than that it works great.",
        "Works as Advertised Phone: S. Galaxy S3 Watch: Asus Zenwatch 2. Great app to have, the only way i could figure out how to close unnecessary apps running in the background. I installed this and it's worked as advertised everytime I've needed to use it. So far no problems and it's simple to use."
    ],
    "recentChanges": [
        "- New design",
        "- Using blue text color to show service processes",
        "- Fixed issue with Android Wear 5.1.1",
        "- Close all open programs at once",
        "- More languages ​​added"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=rocketstartups.weartaskmanager&hl=en&gl=us",
    "appId": "rocketstartups.weartaskmanager"
}