{
    "title": "Roll The Dice For Android Wear",
    "summary": "Dice for Android Wear. Download now for free. Simple and easy to use.",
    "icon": "//lh4.ggpht.com/hkQbwvoh4iUtD955ngI3A72nJIGZ8Anbg5QBVnWjwM9c3lC6Bm4bO6LVaiPc5XIdcQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 3.8,
    "reviews": 260,
    "developer": "Wearable Software",
    "developerId": "9027257451638050761",
    "developerEmail": "support@wearable-software.com",
    "developerWebsite": "http://www.wearable-software.com/",
    "developerAddress": "Wearable Software\nCedric Larrat\nGrötzingerstr. 73\n76227 Karlsruhe-Durlach",
    "updated": "October 15, 2014",
    "version": "1.1",
    "genre": "Entertainment",
    "genreId": "ENTERTAINMENT",
    "description": "You have no dice? Do you want to play a game? Here comes the first dice app for your smartwatch. It is simple and easy to use, a great helper for on the go. Download now for free. This is the first version, we will add new features as soon as possible. Get more top apps, games & news with \"Android Wear Center\": http://tinyurl.com/m87stxsPlease note:-Make sure your mobile is compatible with Android Wear.-Make sure to pair your phone with the wearable device with help of the Android Wear App.-To open: Go to \"Start...\" and open the app \"Roll The Dice\" or say \"Start Roll The Dice\"Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let us know.",
    "descriptionHTML": "You have no dice? Do you want to play a game? Here comes the first dice app for your smartwatch. It is simple and easy to use, a great helper for on the go. Download now for free. This is the first version, we will add new features as soon as possible. Get more top apps, games &amp; news with &quot;Android Wear Center&quot;: http://tinyurl.com/m87stxs<br><br><br>Please note:<br>-Make sure your mobile is compatible with Android Wear.<br>-Make sure to pair your phone with the wearable device with help of the Android Wear App.<br>-To open: Go to &quot;Start...&quot; and open the app &quot;Roll The Dice&quot; or say &quot;Start Roll The Dice&quot;<br><br>Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let us know.",
    "histogram": {
        "1": 29,
        "2": 24,
        "3": 39,
        "4": 55,
        "5": 113
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/gMvK1RezEvAa1DB0imkH6TpckHG83Tg9AX6qOd4zbmR54KJC5jmG9y1RWG1AlRMN2As=h310",
        "//lh6.ggpht.com/2d7WLBFyDEqi1JERlRX9fIp3RUpZddMVDnTpLFssC_dYXkv51oq764uqsJ0C-8uEim0=h310",
        "//lh6.ggpht.com/pApgZr9bwMCA79dOiCdqGHp8j27g3YNesmETPo0jHrQxKg3Sl1Bwt-LCTzkFzq2ubPlH=h310",
        "//lh3.ggpht.com/lFLnRq_KF7Da3UVujvYzJvsXH2-81KrPaAnVtkHp3drN0TuW-aKZuJa-9cnY0eDMvP24=h310",
        "//lh3.ggpht.com/ClN8wW0zL4rYoWiI-41P6cMYsIgpID5LQ0LrLL1-sBlN4vQVyKoZzRm7Q0FX6AlhC2U9=h310",
        "//lh4.ggpht.com/ekLdY_e05Y42y64aChmkgY788P-kMLdG4OEFsMMn3daelMPJbiwPq3FfNCQJuW8g7rQ=h310"
    ],
    "comments": [
        "Missing something Its lovely. Works well, looks great. My problem is rather specific, but I would love support for other dice (i.e. D20, D12, etc.) It would be great to use my watch for dice rolls during D&D.",
        "Definitely improved, good app! Revising my review as this has been much improved.  Now supports up to 6 six sided dice, and it seems that the time for the \"animation\" of the dice rolling has been shortened slightly. Now usable for most board games. Good job!          Review on original version: Only supports a single six sided die, \"Animation\" makes it slow.  Should improve to at least support multiple six sided dice on a single roll.  Would prefer to see it support multiples of most popular die types (d4, d6, d8, d10, d12 and d20)",
        "Works as intended. It works as it should, but it should have more dice options.  It'd be nice to be able to throw in a d8 d12 and d20 into the mix.  We are wearing android, so you should already know we are way to nerdy.",
        "Has a lot of potential. I love the simplicity, it works just as it says.  Curious though - is there a way to \"HOLD\" a die (Long press to toggle)? If you could keep a die (or more) from rolling on the next roll, it would serve as a perfect tool for playing dice games like Farkel or Yahtzee.  If not, then I would HIGHLY suggest adding this functionality.  Moto 360 by the way.",
        "Works well. needs fast roll option. Works well. Would like to see the option to remember the last number of dice being used, as well as the ability to turn off the animation which just wastes time and power.",
        "Needs other dice support Would buy an addon for 1$ that allows me to roll d20 and d10, will also change review to 5 stars :)"
    ],
    "recentChanges": [
        "- New graphics",
        "- Support for more than one dice"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=rocketstartups.weardiceroller&hl=en&gl=us",
    "appId": "rocketstartups.weardiceroller"
}