{
    "title": "Wear App Launcher",
    "summary": "A stylish Android Wear application launcherLeft edge swipe to open.",
    "icon": "//lh3.ggpht.com/PePzcb86BrYq2RO56l3zRzRZ9LcxNNMv5EUae9Eld101NwK4Owy79jBX_geImSOjEA=w300",
    "price": "$1.49",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.9,
    "reviews": 122,
    "developer": "RBApps",
    "developerId": "RBApps",
    "developerEmail": "ronnieballe@hotmail.com",
    "developerAddress": "Nørregade 5\n8660, Skanderborg",
    "updated": "March 4, 2016",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "A stylish and customizable application launcher for Android Wear.The Wear App Launcher lets you browse and launch your Android Wear apps by simply swiping the left edge of your screen to bring up the launcher, showing you all the applications currently installed on your Android Wear device.----------------------------------------------------------------------------------------To start using it on your watch the very first time, open \"Wear App Launcher\" manually from your regular application list on your watch, this opens up the launcher and also registers the left side swipe-area for future launches.----------------------------------------------------------------------------------------- Optimized for round displays- Optimized for square/rectangular displays- Choose how your applications are presented (2 or 3 columns)- Change the order and visibility of your apps in the launcher- Open the Wear App Launcher by simply swiping from the left edge of your screen*- Low memory/battery usage, the Wear App Launcher is only started when you swipe to activate it.- Customize the swipe-area size- Switch between multiple running appsAfter installing the Wear App Launcher, please run it on your phone for a quick introduction to getting the most out of your new Android Wear application launcher.On your watch, you only have to start \"Wear App Launcher\" manually the very first time after installing or upgrading it, after running it the first time, the left side swipe-area will always remain active, even when you restart your watch (about 30 sec. after boot).Enjoy your new Android Wear Launcher.",
    "descriptionHTML": "A stylish and customizable application launcher for Android Wear.<br><br>The Wear App Launcher lets you browse and launch your Android Wear apps by simply swiping the left edge of your screen to bring up the launcher, showing you all the applications currently installed on your Android Wear device.<br><br>----------------------------------------------------------------------------------------<br>To start using it on your watch the very first time, open &quot;Wear App Launcher&quot; manually from your regular application list on your watch, this opens up the launcher and also registers the left side swipe-area for future launches.<br>----------------------------------------------------------------------------------------<br><br>- Optimized for round displays<br>- Optimized for square/rectangular displays<br>- Choose how your applications are presented (2 or 3 columns)<br>- Change the order and visibility of your apps in the launcher<br>- Open the Wear App Launcher by simply swiping from the left edge of your screen*<br>- Low memory/battery usage, the Wear App Launcher is only started when you swipe to activate it.<br>- Customize the swipe-area size<br>- Switch between multiple running apps<br><br>After installing the Wear App Launcher, please run it on your phone for a quick introduction to getting the most out of your new Android Wear application launcher.<br><br>On your watch, you only have to start &quot;Wear App Launcher&quot; manually the very first time after installing or upgrading it, after running it the first time, the left side swipe-area will always remain active, even when you restart your watch (about 30 sec. after boot).<br><br>Enjoy your new Android Wear Launcher.",
    "histogram": {
        "1": 15,
        "2": 10,
        "3": 8,
        "4": 30,
        "5": 59
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/gXpcTS_pL_rMz3zxL2NvDGVDY1C7u0ygR1jDYn300P9ePSe_9RUhF91bdao3ZyLbJAI=h310",
        "//lh3.googleusercontent.com/wEphsvynYyEHIQTZQ20Zx90y9VF-9EQ7pyNNQcmNr2QglZAjXAEgXW-55idT0312GlE=h310",
        "//lh3.googleusercontent.com/WVg_og0cDkT-mWuUgJGmxlySBX9e7i091QXiOvBXyWupByAPwRCFmYuns3ovAsE59fhu=h310",
        "//lh3.googleusercontent.com/zYyhV4IhIUlvmKtlQW-JdG9Y9QFO41QjEHTRsIqeRIZn5HvA9xWibyHxyk9fdsc23A=h310",
        "//lh3.googleusercontent.com/biNSJYkDuAvnQYVUNo7WZ0QK-9qgtY4O2CHONk1WbqhylYVbPfwjwynbMOlxW6boDA=h310"
    ],
    "comments": [
        "Lot's of screen space wasted by app icons and label fonts being so tiny compared to the two other major wear launchers available here in the play store. Also this launcher has very few customizable options for the end user. It does run very smoothly but those microscopic font/text label sizes and tiny icons makes this launcher almost unusable unless used with magnifying glasses.",
        "Help or give refund please Will change if you tell me how to stop app from blocking permissions from other apps like motobody and maps.",
        "Simply awesome seamless integration! Definitely worth the price. I have tried every other launcher for my moto 360 2nd gen, and this is the only one that actually works well every time. It works so seamless I would swear it's part of Android wear. This launcher works every time on the first swipe from the left side just as quickly and easily as the native wear launcher swipes in from the right. This launcher does exactly what it is supposed to do, and it does it flawlessly. There is no need to take out the phone to adjust settings as everything is done right on the watch",
        "So far this is the best launcher app for me. so far. I say so far because Ive only had it on my huawei watch for a short time. I can open my watch face and  hold the left side of my watch , feel a vibration and swipe right and there are all my apps. I can select the number of rows (I selected 2 rows works perfect for the round face) I can move my favorite apps to the top; of the rows and I can hide the apps that I don't use. What more could I want for a launcher? I would next like to see the battery drain and will u;date, but so far I'm loving this. I can't tell you how many launchers I downloaded and deleted before finding this one !  Most of the others have lag or you have to swipe a couple of times to open them. Not this one!",
        "Great app but I have to uninstall to access permissions for other apps (screen overlay detected).  Re-organizing my apps each time is not fun....",
        "Surprisingly fast! Tried most of the other launchers out there, they are all slow and laggy when used with Facer watchfaces, this is the only launcher that is fast and snappy. Takes a while to set up but once it's done, your good to go!"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ronnieballe.wearlauncherpro&hl=en&gl=us",
    "appId": "ronnieballe.wearlauncherpro"
}