{
    "title": "StarLine",
    "summary": "StarLine: Accessible Telematics!",
    "icon": "//lh3.googleusercontent.com/GoIB1V_uB88UWEtv1W8InsdEu7KWPiQBh3RtrheB6oz9X7RzgHyArsAlxRZr0aCQz0k=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.1,
    "reviews": 18894,
    "developer": "StarLine LLC",
    "developerId": "StarLine+LLC",
    "developerEmail": "android@starline.ru",
    "developerWebsite": "https://starline.bz",
    "updated": "February 20, 2018",
    "version": "Varies with device",
    "genre": "Auto & Vehicles",
    "genreId": "AUTO_AND_VEHICLES",
    "size": "Varies with device",
    "description": "StarLine Telematics: Your vehicle on the palm of your hand! Download the free StarLine mobile application to manage your car security settings from your smartphone. The application will work with any GSM alarm systems, GSM modules and beacons by StarLine. Use the demo mode to learn more about the application. For non-commercial use only. The positioning accuracy depends on the GPS signal strength and may vary according to the map service of choice.APPLICATION CAPABILITIESSimple registration- Register your car security system using a simple installation wizard. Easy selection of devices - Work with several StarLine devices: convenient for owners of several vehiclesEasy to set up and manage - Arm and disarm your car security system; - Start and turn off your engine at unlimited distances - (*) Choose auto-start parameters with certain timer and temperature settings, set the time for engine warm-up - In emergencies use \"Anti-hijack\" mode: your vehicle's engine will turn off at a safe distance from you - (*) If you turn over your vehicle for repair or diagnostics, set your security settings to \"service\" mode - Find your vehicle on a parking lot by initiating a short siren signal - (*) Adjust shock and tilt sensor settings manually or turn them off when parking in a busy place - Create shortcuts for often used commands Easy to understand your car's security status - Make sure that the alarm system is on- (*) The intuitive interface allows interpreting and understanding all security messages at a glance. - (*) You can see your equipment SIM card balance, the car battery charge, the engine temperature and the temperature inside your vehicle Get messages about any events with your vehicle - Receive PUSH messages on any events with your vehicle (alarm, engine started, security mode switched off, etc.) - Select the types of messages you want to receive - Browse the history of engine start-ups - (*) Learn the equipment SIM card balance: low balance warnings delivered via PUSH messagesSearch for and monitor your vehicle - (*) Comprehensive monitoring with track record. Study the tracks, the length of each route, speeds on various legs of the trip- Find your car on an online map in just seconds - Select the most convenient type of map for you - Find your own location Quick Help - Call the StarLine Technical Support Line directly from your application! - Rescue and assistance service numbers have been added (you can add your local phone numbers, too) - Feedback form has been incorporated into the application. (*) This function is available only to owners of products manufactured since 2014 (with \"Telematics 2.0\" sticker on the packaging)We are always happy to answer your questions. The StarLine team is on call 24 hours a day Federal Technical Support Service: - Russia: 8-800-333-80-30 - Ukraine: 0-800-502-308 - Kazakhstan: 8-800-070-80-30 - Belarus: 8-10-8000-333-80-30 StarLine LLC, developer and manufacturer of security telematic equipment under StarLine brand, retains the right unilaterally to introduce changes into design and the interface of the mobile application. StarLine: Accessible Telematics!",
    "descriptionHTML": "StarLine Telematics: Your vehicle on the palm of your hand! <br><br>Download the free StarLine mobile application to manage your car security settings from your smartphone. The application will work with any GSM alarm systems, GSM modules and beacons by StarLine. Use the demo mode to learn more about the application. <br><br>For non-commercial use only.<br>&#x2028;The positioning accuracy depends on the GPS signal strength and may vary according to the map service of choice.<br><br>APPLICATION CAPABILITIES<br><br>Simple registration<br>- Register your car security system using a simple installation wizard. <br><br>Easy selection of devices <br>- Work with several StarLine devices: convenient for owners of several vehicles<br><br>Easy to set up and manage <br>- Arm and disarm your car security system; <br>- Start and turn off your engine at unlimited distances <br>- (*) Choose auto-start parameters with certain timer and temperature settings, set the time for engine warm-up <br>- In emergencies use &quot;Anti-hijack&quot; mode: your vehicle&apos;s engine will turn off at a safe distance from you <br>- (*) If you turn over your vehicle for repair or diagnostics, set your security settings to &quot;service&quot; mode <br>- Find your vehicle on a parking lot by initiating a short siren signal <br>- (*) Adjust shock and tilt sensor settings manually or turn them off when parking in a busy place <br>- Create shortcuts for often used commands <br><br>Easy to understand your car&apos;s security status <br>- Make sure that the alarm system is on<br>- (*) The intuitive interface allows interpreting and understanding all security messages at a glance. <br>- (*) You can see your equipment SIM card balance, the car battery charge, the engine temperature and the temperature inside your vehicle <br><br>Get messages about any events with your vehicle <br>- Receive PUSH messages on any events with your vehicle (alarm, engine started, security mode switched off, etc.) <br>- Select the types of messages you want to receive <br>- Browse the history of engine start-ups <br>- (*) Learn the equipment SIM card balance: low balance warnings delivered via PUSH messages<br><br>Search for and monitor your vehicle <br>- (*) Comprehensive monitoring with track record. Study the tracks, the length of each route, speeds on various legs of the trip<br>- Find your car on an online map in just seconds <br>- Select the most convenient type of map for you <br>- Find your own location <br><br>Quick Help <br>- Call the StarLine Technical Support Line directly from your application! <br>- Rescue and assistance service numbers have been added (you can add your local phone numbers, too) <br>- Feedback form has been incorporated into the application. <br><br>(*) This function is available only to owners of products manufactured since 2014 (with &quot;Telematics 2.0&quot; sticker on the packaging)<br><br>We are always happy to answer your questions. The StarLine team is on call 24 hours a day Federal Technical Support Service: <br>- Russia: 8-800-333-80-30 <br>- Ukraine: 0-800-502-308 <br>- Kazakhstan: 8-800-070-80-30 <br>- Belarus: 8-10-8000-333-80-30 <br><br>StarLine LLC, developer and manufacturer of security telematic equipment under StarLine brand, retains the right unilaterally to introduce changes into design and the interface of the mobile application. <br><br>StarLine: Accessible Telematics!",
    "histogram": {
        "1": 1704,
        "2": 1009,
        "3": 1638,
        "4": 3759,
        "5": 10784
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/FmhQT-kAxzqew7LAwOVs-GuVEGudSYE_HWJUffW98Q9Le-ZrAlyUflZt7-isK6hlBV4=h310",
        "//lh3.googleusercontent.com/2H-u37fxOVnQgZ8E-B1O2HQZixqaYJuIqc1jHiwfl3MUW7gdixGOtNAEUdN-E6NTVw=h310",
        "//lh3.googleusercontent.com/yT2dCsaQK5ayzQ0buVaW1gt7MLwyIUwzEuxB0qUybdRVvg_ojpNw0sUn00kBMHOHuhg=h310",
        "//lh3.googleusercontent.com/1MwhZX4IVbVWptogouS8EK04Nf2Tze7m4RxfyibRmLvQa8MhrVxvYhpSWc8Tz1jJcW08=h310",
        "//lh3.googleusercontent.com/Mw-wAntTzzFRZNZ_sRHbzoB-y8hjFrZvMY3h34E66tko29LUeiiDw_nqoItukZf6MA=h310",
        "//lh3.googleusercontent.com/MDQgrqBZGtfAnlnbmVbso_4G3gojS9nF0bUSAaTxPVoXvzj_vWW671ssoauMVSRFDbI=h310",
        "//lh3.googleusercontent.com/Fhvb3_4yeKV-75L0qnE6fFE4-Q1tLH5IVaKNaLYvYDKjYyHfwHvecRfeB_wilg-bGRkw=h310",
        "//lh3.googleusercontent.com/0ARQporRfnTlcnISimlYSfj5hLInVNKrquy27R6O1BG2R4mc75rfS_kew3DWhbfLzTg=h310"
    ],
    "comments": [
        "Все время глючит (90%).",
        "После последнего обновления, приходится вводить пароль каждый раз. Неудобно. На моем телефоне отпечатком пальца и так все обезопасено. Верните опцию не спрашивать пароль каждый раз",
        "Подключил e96bt через Bluetooth, ожидал большего функционала по настройке и программированию. По факту - стандартные кнопки и информация, имеющиеся на брелке с двухсторонней связью.",
        "Разработчики добавьте пожалуйста выбор языка в настройки. Телефон американский,  перепрошить на Русский нельзя. Очень хочется приложение на Русском.",
        "кнопки не активны. перезагрузил на samsung s8...без изменения. не могу завезти.карту видит только где стоиь без передвижения...???",
        "Показывает что машина в другой стране ..."
    ],
    "recentChanges": [
        "- support advanced settings for 6th-generation devices",
        "- enhancements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ru.starline&hl=en&gl=us",
    "appId": "ru.starline"
}