{
    "title": "TaxovichkoF: order a taxi in St Petersburg online",
    "summary": "Fare from 33 rub. Taxi arrives in 5 min. Wi-Fi. Online and credit card payment",
    "icon": "//lh3.googleusercontent.com/7-bx4FedTmeShN8oRuFs4pNwnINIEtu5gtoK_ftGL3F6D1Au0TYbN_jhVcZyKm6zdw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 7709,
    "developer": "GRANAT",
    "developerId": "8413657537146236826",
    "developerEmail": "apps@granat-adv.ru",
    "developerWebsite": "http://granat-adv.ru",
    "updated": "February 28, 2018",
    "version": "1.36",
    "genre": "Maps & Navigation",
    "genreId": "MAPS_AND_NAVIGATION",
    "description": "Mobile application “TaxovichkoF” -  taxi calling button in your mobile phone!• Taxi  fare from 33 rubles• Car will arrive in 5 minutes (within the city)• Free Wi-Fi• Child safety seats• Smart phone chargers• Credit cards are welcome• Online payment + discounts• Silent taxi callIs there a lecture or are you afraid of waking up a child or is it too noisy outside? Order a taxi through a mobile application without saying a word.• Urgent taxi orderDon't waste your time talking to the operator. Order a taxi to one of your Favourite addresses by tapping the screen only several times! Each option is at hand!• Off-line orderWith the app it is possible to call a taxi even without Internet connection. Just fill in the form and all the data will be automatically sent by SMS.• Total controlThe application allows to observe all “TaxovichkoF” opportunities and “equip” your own taxi: car type, additional options, addresses, pick-up time etc.Main features:– Defining the user’s location– On-line car tracking on the map– Automatic fare calculation– Exact pick-up time– Trip time from A to B– SMS – order without Internet connection– On-line payment without any change and tips + discountsAdditional opportunities:– Get information about the driver and influence on his rating– Add favourite routes and addresses– Popular addresses and nearest objects– Create pre-orders for the future– Use alarm-clock to wake you up before the trip– Order a taxi for another number from your contact list.– Message about forgotten things",
    "descriptionHTML": "Mobile application &#x201C;TaxovichkoF&#x201D; -  taxi calling button in your mobile phone!<br><br>&#x2022; Taxi  fare from 33 rubles<br>&#x2022; Car will arrive in 5 minutes (within the city)<br>&#x2022; Free Wi-Fi<br>&#x2022; Child safety seats<br>&#x2022; Smart phone chargers<br>&#x2022; Credit cards are welcome<br>&#x2022; Online payment + discounts<br><br><br>&#x2022; Silent taxi call<br>Is there a lecture or are you afraid of waking up a child or is it too noisy outside? Order a taxi through a mobile application without saying a word.<br><br>&#x2022; Urgent taxi order<br>Don&apos;t waste your time talking to the operator. Order a taxi to one of your Favourite addresses by tapping the screen only several times! Each option is at hand!<br><br>&#x2022; Off-line order<br>With the app it is possible to call a taxi even without Internet connection. Just fill in the form and all the data will be automatically sent by SMS.<br><br>&#x2022; Total control<br>The application allows to observe all &#x201C;TaxovichkoF&#x201D; opportunities and &#x201C;equip&#x201D; your own taxi: car type, additional options, addresses, pick-up time etc.<br><br><br>Main features:<br>&#x2013; Defining the user&#x2019;s location<br>&#x2013; On-line car tracking on the map<br>&#x2013; Automatic fare calculation<br>&#x2013; Exact pick-up time<br>&#x2013; Trip time from A to B<br>&#x2013; SMS &#x2013; order without Internet connection<br>&#x2013; On-line payment without any change and tips + discounts<br><br><br>Additional opportunities:<br>&#x2013; Get information about the driver and influence on his rating<br>&#x2013; Add favourite routes and addresses<br>&#x2013; Popular addresses and nearest objects<br>&#x2013; Create pre-orders for the future<br>&#x2013; Use alarm-clock to wake you up before the trip<br>&#x2013; Order a taxi for another number from your contact list.<br>&#x2013; Message about forgotten things",
    "histogram": {
        "1": 821,
        "2": 207,
        "3": 296,
        "4": 956,
        "5": 5429
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/-DbSz90JrfKMK6btjwYoTRXKJEpUQZRrBXi9gA1_Ny1oUxLwK0jw_s7fZGM6zXiu0Cw=h310",
        "//lh3.googleusercontent.com/RdXBoz3lqrvZ4NZtUPYCUBucMr2rPOFS7aZ05eQyvotDfc0PtK1WietHh_y3Z5QP5A=h310",
        "//lh3.googleusercontent.com/YLtPmb4CqG_Q9MhGiJ_c_AOp1p8bC_Sm2rkN93oQhaPRmeEp3I3FCy8Ubmij3FZDtWSz=h310",
        "//lh3.googleusercontent.com/iw_Yn2rUssHBtaofiPxU5aHM7tenqlRmKkY-cfyFGrqZ2ynDhzjarbsNRGxRB_VAKQk=h310",
        "//lh3.googleusercontent.com/GoJd4Tr4ClNabtC4NOuvb0u9ZAOnOjjzJznw6jTYyaTOHpPtN6j-mJGN0TnrdoPdaA=h310",
        "//lh3.googleusercontent.com/30pJKST-CvDUSZhMaCAstHwe6EHHUVwdh21g1SF1IgJubuOfA91zlCKLbJdU-mmrkB7v=h310",
        "//lh3.googleusercontent.com/wwHeWo-IcIpzYxXp0eBLCvxTS5mXoLS-0uX3gHlFkwku1IKTxp5dNO6Ss-25OI1f-r59=h310",
        "//lh3.googleusercontent.com/MfuschpvSfgd_xzKZ4D_tUCBHPda60roLbG3nCfNQHkICt6G_B2mrWpe2anKy9Q8pp_T=h310",
        "//lh3.googleusercontent.com/lpn18-aPoB8eTqvVBrYi6DxQ0720ZO5fg8p6t8sNZP6Dih6cKGslkXQ41gqMavA8VN0=h310",
        "//lh3.googleusercontent.com/uFvEZ2IlMYdKpPZOrW0df0jg8vXfpvmjVujmWQSedWQF_j8VS-4bI50pIWtkueC1mB-b=h310"
    ],
    "comments": [
        "Супер!",
        "Перестала работать история поездок. Ни повторить маршрут, ни отменить или посмотреть статус текущего заказа.",
        "Невозможно одновременно выбрать в опциях бустер и кресло 9-36 (при возврате в заказ не учитываются). Почините, пожалуйста.",
        "It's impossible to access the app with Finnish phone number (3+7 numbers), please fix it and I will use the app  - Issue fixed promptly and now works well, thanks",
        "Все хуже и хуже работает эта компания. Служба качества не отвечает, а потом делает один звонок и сразу сбрасывает. Так и не смог совершить поездку: сначало час не могли назначить машину хотя я трижды звонил, потом взяли и сами отменили заказ. Так что клиенты этой компании явно не нужны.",
        "Оставили телефон в машине. Позвонили оператору, думали нас свяжут с водителем, и мы попросим посмотреть телефон на сидении. Казалось бы, в чём проблема? Однако, сколько мы ни пытались, нас постоянно посылали по другим телефонам, по которым нам в течении более часа никто не отвечал. На все просьбы просто ПОЗВОНИТЬ нашему водителю, нам отказывали. Неужели, черт побери, это так сложно?!? Просто позвонить ему и спросить, ведь его телефон точно виден в системе! Операторы упорно посылали в отдел контроля качества, в котором трубку не брали более часа. В итоге мы вымолили дать нам номер водителя у четвертого-пятого оператора, но он был не доступен (может вообще левый номер дали). Итог, дорого, а сервис нулевой, нечеловечный ни капли. Никогда не связывайтесь с этой конторой. Так можно и на Uber уехать в два раза дешевле. За что тут переплачивать?"
    ],
    "recentChanges": [
        "Family account –  one account for you and your family!",
        "The sidebar and other windows are now even more convenient.",
        "The app got faster."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=ru.taxovichkof.android&hl=en&gl=us",
    "appId": "ru.taxovichkof.android"
}