{
    "title": "Runbit",
    "summary": "Collect stars, Escape monsters, Hunt animals and challenge your friends!",
    "icon": "//lh3.googleusercontent.com/UlrkhVe7yfNEWHDGF8iJbUwckRDe5MQ7sPN987izdyaidM_LkY1BT8EEs3lQ2a4zuA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4,
    "reviews": 201,
    "developer": "QuidBit AB",
    "developerId": "8905466730517065332",
    "developerEmail": "anders@runbit.se",
    "developerWebsite": "http://runbit.se/",
    "developerAddress": "Drottninggatan 41\n58227 Linköping",
    "updated": "January 28, 2018",
    "version": "5.8.4",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Walk, Jog, Run and explore more, your city turns into a fun game!Collect starsCollect stars on walkways near you! Explore your surroundings. Can be used by anyone, anywhere. Move at your own pace, or use a bicycle. Bring your kids on a treasure hunt that changes every time!Escape monstersDecide quickly as you try to avoid monsters! Get your blood pumping from being hunted. The monsters' speed is adjusted to you with three different modes. How long can you survive?!Chase animalsCatch animals on walkways! Find the shortest way as they constantly move just a little ahead of you. Forget about the time and distance as you instead try to take as many animals as you can!Challenge friendsChallenge your friends and family! Motivate your friends and family by sharing your progress. Runbit makes pictures of what you've done so you can share them on Facebook, Instagram and other social apps.Combine with other appsRunbit works with other exercise apps. For instance you can use your favorite pedometer app and at the same time let Runbit entertain you. Just start both app and run!Run with your smartphoneAlways holding your smartphone in one hand makes it easy to quickly look at the map, choose direction and start moving. Do not look at the screen constantly but use it the way you use a map when orientating.More than just numbersExercise should be fun! Runbit ignores factors such as calorie counting which often are closely connected to anxiety. The focus is put on where you move, not how. Simply less pressure and more joy!No account nor passwordWhy mess things up with registration? Runbit does not need your weight, e-mail, phonenumber, age or favourite colour. Download the app and get moving instantly! All data is saved in the app.Explore moreBroaden your horizons! Discover the enviroment around you. Runbit helps you find new routes instead of getting stuck in habits, no matter if you run, walk, jog or bike.",
    "descriptionHTML": "<b>Walk, Jog, Run and explore more, your city turns into a fun game!</b><br><br><b>Collect stars</b><br>Collect stars on walkways near you! Explore your surroundings. Can be used by anyone, anywhere. Move at your own pace, or use a bicycle. Bring your kids on a treasure hunt that changes every time!<br><br><b>Escape monsters</b><br>Decide quickly as you try to avoid monsters! Get your blood pumping from being hunted. The monsters&apos; speed is adjusted to you with three different modes. How long can you survive?!<br><br><b>Chase animals</b><br>Catch animals on walkways! Find the shortest way as they constantly move just a little ahead of you. Forget about the time and distance as you instead try to take as many animals as you can!<br><br><b>Challenge friends</b><br>Challenge your friends and family! Motivate your friends and family by sharing your progress. Runbit makes pictures of what you&apos;ve done so you can share them on Facebook, Instagram and other social apps.<br><br><b>Combine with other apps</b><br>Runbit works with other exercise apps. For instance you can use your favorite pedometer app and at the same time let Runbit entertain you. Just start both app and run!<br><br><b>Run with your smartphone</b><br>Always holding your smartphone in one hand makes it easy to quickly look at the map, choose direction and start moving. Do not look at the screen constantly but use it the way you use a map when orientating.<br><br><b>More than just numbers</b><br>Exercise should be fun! Runbit ignores factors such as calorie counting which often are closely connected to anxiety. The focus is put on where you move, not how. Simply less pressure and more joy!<br><br><b>No account nor password</b><br>Why mess things up with registration? Runbit does not need your weight, e-mail, phonenumber, age or favourite colour. Download the app and get moving instantly! All data is saved in the app.<br><br><b>Explore more</b><br>Broaden your horizons! Discover the enviroment around you. Runbit helps you find new routes instead of getting stuck in habits, no matter if you run, walk, jog or bike.",
    "histogram": {
        "1": 25,
        "2": 10,
        "3": 23,
        "4": 31,
        "5": 112
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "5.0 and up",
    "androidVersion": "5.0",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/N8lIfd_GtYvTMJg-CzDCyMGAiQH4TgwRTN76aMDJwlB-fWK--oZ8-VBUVF6mjHqSd83r=h310",
        "//lh3.googleusercontent.com/FjoP5_uapyLXUrYIr6m0Qe88FVjxTp4qi_y0vArGHNj7Uaqt2jE8TEHAEsVnLv7uQDc=h310",
        "//lh3.googleusercontent.com/EI6k9jMwhJQWiKL4HjX-lz7cHzQbFOcOdjo8XCEUe5ZM0VXXRt-twPGs6t_rLb0FfTg=h310",
        "//lh3.googleusercontent.com/A-dpHnXUmV3NJVFPhSRDLjjPedVrSnNBd1exQJxIcf_TiUR_wt5wQXf-GpOvWfl2Hfnj=h310",
        "//lh3.googleusercontent.com/mX3u7w4N-SKAEmX3c6EL2mawjNxRzrMooFxAhhVu6FHWIVGNoXy7rNBnyjniiSwUQZHX=h310",
        "//lh3.googleusercontent.com/DIQrQoiI614aZjuFletxb2cP192xAf7oJKQdfCPEHf26uklJtORpZVdleP4-iW_topw_=h310"
    ],
    "comments": [
        "Creative Great app",
        "Just what i need it to motivate me running! This app gives virtual motivation to what would have been an uneventful running chore. This app is perfect for someone who hates running because it is just plain boring. My favorite is chase the animal mode. It motivates me to run longer and faster! Love it!",
        "Could not get the gps to work",
        "Great Idea! What a great concept for an app. I will be using this for my runs soon!!",
        "nt bad",
        "Bob It is great"
    ],
    "recentChanges": [
        "- All new design",
        "- Chase animals",
        "- Escape monsters"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=se.soderstrom.runbit&hl=en&gl=us",
    "appId": "se.soderstrom.runbit"
}