{
    "title": "Tatra banka",
    "summary": "Introducing brand new mobile banking application Tatra banka",
    "icon": "//lh3.googleusercontent.com/c_ZuGu8-lSYgnH7JaddLLAOIl-4wOPoF8XXsTr29hvZ8FUo-4Oo_jJD9ayc03KA4aw=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.4,
    "reviews": 5099,
    "developer": "Tatra banka, a.s.",
    "developerId": "Tatra+banka,+a.s.",
    "developerEmail": "android@tatrabanka.sk",
    "developerWebsite": "http://www.tatrabanka.sk",
    "updated": "February 21, 2018",
    "version": "Varies with device",
    "genre": "Finance",
    "genreId": "FINANCE",
    "size": "Varies with device",
    "description": "As a first bank in Slovakia we introduce a bank application adapted also for your smart watches.The Application provides enhanced Internet banking functionality, extended about some additional features. You can check the possibilities of application in list of available functionalities attached below, or through DEMO function.List of available functionality:1.Accounts – balance, detail, transactions, PDF monthly statement, movements search older than 3 months, option to reply by payment, option to create beneficiary from an account movement, export of movements and daily balances chart, sharing of movement detail, setting of Optional Overdraft2. Debit cards - detail and movements, online card management, the posibility to block a card3. Credit cards – balance, detail, payment from credit card, transactions, repayment, online card management, the posibility to block a card4. Offer of pre-approved credit card, non-purpose loan and others5. Inbox and docbox (Automatic push notification of received messages /documents)6. Payment - in EUR currency to all SEPA 7. Postal orders, invoices and IBAN scanner8. Maintenance of pending payments9. Branches and ATMs 10. Exchange rates 11. Contacts12. List of loans – loan detail (with the possibility to realize extra payment on selected non-purpose loans)13. DEMO14. Standing orders 15. ATM cash withdrawal by mobile16. Spending report17. Beneficiaries18. News 19. NFC Preview20. DDS Pension21. TAM funds22. Assets and liabilities23. SEPA Direct Debits24. Contract documents25. Goals26. B-mail – notification about account or credit card movementsIf you have any additional questions, please do not hesitate to contact us on:- by e-mail android@tatrabanka.sk or- by contacts on our website: http://www.tatrabanka.sk/en/about/contacts.html",
    "descriptionHTML": "As a first bank in Slovakia we introduce a bank application adapted also for your smart watches.<br>The Application provides enhanced Internet banking functionality, extended about some additional features. You can check the possibilities of application in list of available functionalities attached below, or through DEMO function.<br><br>List of available functionality:<br>1.Accounts &#x2013; balance, detail, transactions, PDF monthly statement, movements search older than 3 months, option to reply by payment, option to create beneficiary from an account movement, export of movements and daily balances chart, sharing of movement detail, setting of Optional Overdraft<br>2. Debit cards - detail and movements, online card management, the posibility to block a card<br>3. Credit cards &#x2013; balance, detail, payment from credit card, transactions, repayment, online card management, the posibility to block a card<br>4. Offer of pre-approved credit card, non-purpose loan and others<br>5. Inbox and docbox (Automatic push notification of received messages /documents)<br>6. Payment - in EUR currency to all SEPA <br>7. Postal orders, invoices and IBAN scanner<br>8. Maintenance of pending payments<br>9. Branches and ATMs <br>10. Exchange rates <br>11. Contacts<br>12. List of loans &#x2013; loan detail (with the possibility to realize extra payment on selected non-purpose loans)<br>13. DEMO<br>14. Standing orders <br>15. ATM cash withdrawal by mobile<br>16. Spending report<br>17. Beneficiaries<br>18. News <br>19. NFC Preview<br>20. DDS Pension<br>21. TAM funds<br>22. Assets and liabilities<br>23. SEPA Direct Debits<br>24. Contract documents<br>25. Goals<br>26. B-mail &#x2013; notification about account or credit card movements<br><br>If you have any additional questions, please do not hesitate to contact us on:<br>- by e-mail android@tatrabanka.sk or<br>- by contacts on our website: http://www.tatrabanka.sk/en/about/contacts.html",
    "histogram": {
        "1": 335,
        "2": 136,
        "3": 253,
        "4": 704,
        "5": 3671
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/awG9-Oueg2tHovLP3h2q6IWTplqasdc2OoaXS4ZpibgsuYyC-65pDtXSiCE27w03wkic=h310",
        "//lh3.googleusercontent.com/YXWY0h0wMTQhjp5p0zoUNS_IK4a-SgE11l8KjcWDl51K_RAn_9Qsu2KX8ZoBYAL39w=h310",
        "//lh3.googleusercontent.com/0ug0y1EAVSVS7E9dSkk-mwXIerFEiKdyNg-ZJmWNZdwM5MHOkTdmNo0ACW8YizjGa5s=h310",
        "//lh3.googleusercontent.com/zV9LgNe_ZQyUfiezJJRBd_2sDklyHoXVspvmjXQvFkwUpMS647OMv34rs_ZdGzOHDQ8=h310",
        "//lh3.googleusercontent.com/IlQVPnvtQNnLPctlxKD8EC-JUiQnvAtZaX2UZRFLX2VVRihIJvdxeBhm-_k0btr2Gg=h310",
        "//lh3.googleusercontent.com/7g5nZ8xNYSF6I__ENtt2npf2wcYN5W7j35UT2WuvcBQ9I64Rw8JzmgqlXDMXHjMvAYxm=h310",
        "//lh3.googleusercontent.com/Tjb20onmZ2NOdkmmw10ufwIfg84q8kv_Qw76cy1zTsV167IwsSudiIxhtH3OvCQiqqk=h310",
        "//lh3.googleusercontent.com/EkZMDxQgZ2cQZ1xPO8QqFy2b147Dm1wJdbO8xfDTiD5QmZwcwloi5aYWUQiKtB-t4Q=h310",
        "//lh3.googleusercontent.com/3pazcIVIQ520YsfKTCwegE1M4N-ikolfh6vi5XRwb6_PizH8QXSsAB60thEuyANZxWM=h310",
        "//lh3.googleusercontent.com/MEGuYD9Z52tNeX-EFPfAR_8RyXsCL-0Rwh1FuujVXt2DKxk4VfSVpfCJOiDGNg88FKI=h310",
        "//lh3.googleusercontent.com/97thYTxqR74wcQJEzsVvZ08ryJ4-U7uCuWea3x9WdcF2N7-bTjvvd0NEhL-fz1edU0QH=h310",
        "//lh3.googleusercontent.com/y2KaVGu18ldG58T2jKSL0hgvidfZYllgLl1dH2aZaf940Q3yljxUy5b6NBJV5I3h0Q=h310",
        "//lh3.googleusercontent.com/yC5UmIVAiUlhNcM7AnyE1ak3v4F-NMu8f2O0l2max5bJN2uhV0ED8ChYAkEZEkS5WQ=h310",
        "//lh3.googleusercontent.com/uj4hOLxS2wkJzKQvV7UO3K59aaNWYwRx3Ik4oQ-Yd5Zpa2gtCjEVRDkLFmraw78ZLjyf=h310",
        "//lh3.googleusercontent.com/CKICqW1tPZp7B2w55UWAkBXXmu0vUwEGUWhKeXpzehXwg7OYbJkKu0Y9SpnBPKv0mys=h310",
        "//lh3.googleusercontent.com/xQRBWxKzueQe612f64r1hUQZvAwF4jxigwreWiHfKM5I8JIsdC7SH3u7tzwOeYae_IQ=h310",
        "//lh3.googleusercontent.com/duUbMOT0c7i0aNMOgzXh7WLAB5eim3X0ns_FgDgrWRNvI8Wa5dNXf3DMklZqe-OSMbQ=h310",
        "//lh3.googleusercontent.com/UWpl01QTGmrKKejzr376z-hRKHquCCvCxS-_SZcVz_APKItO0NQSQizxMPaW_4lGXYc=h310",
        "//lh3.googleusercontent.com/rVUhl6Xj0x19GfDCWaaf8GnQjzKvgAego1z0P2RNC6wOVgX0YJdzKumI4HRT4omGig=h310"
    ],
    "comments": [
        "Super apka! Len v poslednom case, neviem preco, sa mi neda prihlasit. Nacitava sa a nacitava sa ale nic z toho. Da sa s ym nieco spravit?",
        "Za posledny rok velky pokrok nielen v rozsirovani funkcionality, ale aj v rychlosti a nastaveni aplikacie. Well done! Chcelo by to uz len viac penazi ba ucte...",
        "Po poslednom update mi neustále vyskakuje upozornenie zo SuperSU, že aplikácia žiada rootovske právomoci. Prečo, za čo, na čo? Vdaka za odpoveď. Navyše to robí neustále, aj keď mám aplikáciu už dlho vypnutu, čiže tam beží nejaký service čo tam furt na pozadí niečo sroti a to ma desí o to viac.",
        "Best banking app ever. Really thought through and fast user interface. All important functionality of the website implemented. Sweet design and English language availability.",
        "Bolo by skvele mat moznost triedit prijmy ppdla roznych kategorii rovnako ako vydavky.",
        "Výborná aplikácia, jednoduchá na používanie, zahŕňa všetko, čo treba. Spending report a budgety kategórii sú tiež super. Napriek všetkým pozitívam, nemožnosť autentifikácie odtlačkom prsta považujem za veľmi nevhodné, hlavne aj hovoríme o banke, ktorá sa hrdí inováciami. Minimálne pri verziách Androidu 7.0+, o iOS nehovoriac, už nie sú žiadne relevantné bezpečnostné riziká."
    ],
    "recentChanges": [
        "Minor bugfixes"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=sk.tb.ib.tatraandroid&hl=en&gl=us",
    "appId": "sk.tb.ib.tatraandroid"
}