{
    "title": "FitWell Personal Fitness Coach",
    "summary": "FitWell - your personal fitness coach: get fit, lose weight and live healthy",
    "icon": "//lh3.googleusercontent.com/mVUYZIh1-Kp_j0HmppmwCF1n9WTC4BRrUpR2H3dSyO_vl8ztrxbY6SgeUFBPlI0Y7krc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 500000,
    "maxInstalls": 1000000,
    "score": 4.1,
    "reviews": 6257,
    "developer": "FitWell Limited",
    "developerId": "FitWell+Limited",
    "developerEmail": "support@fitwell.co",
    "developerWebsite": "http://www.fitwell.co",
    "developerAddress": "FitWell Limited\nNorthcliffe House,\nYoung St\n4th Floor\nLondon\nW8 5EH",
    "updated": "February 23, 2018",
    "version": "Varies with device",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "size": "Varies with device",
    "description": "FitWell is your personal health and fitness coach. Join over 1 million people using FitWell to lose weight, get in shape and live a healthy lifestyle. Fitwell’s healthy diet plans, personal exercise routines and professional workout videos will help you get in shape faster - at home, outdoors or in the gym. Just like having a dedicated 24/7 personal trainer and diet chef, FitWell helps you achieve your goals with smart exercise and nutrition advice tailored to you. Take the FitTest, then let Fitwell monitor your activity levels and keep you motivated with daily coaching reminders.Created together with professional athletes and nutritionists, FitWell features over 300+ workout videos, unlimited exercise program combinations and diet plans for both men and women. It’s the perfect fitness app for exercise beginners and gym junkies alike! A healthier you with FitWell* Get a personal fitness and nutrition plan tailored to your body type and goals. * Get results faster: from healthy weight loss and body toning to building muscle and cardio endurance.* Always know how many steps you’ve taken and calories you’re burning by connecting your favourite wearables and fitness apps.* Personal training (PT) sessions at the tap of a button, with hundreds of exercise videos and workout routines.* Stay motivated every day with meal, water and workout reminders.* It’s a calorie counter, activity monitor, personal trainer and nutritionist - all in one app!Get fit with a personal workout plan* Exercise plans for beginners and experts* 300+ HD exercise videos for body toning and building muscle* Take the FitWell FitTest and track your progress* Use the simple rep timer for perfect form every time* Workouts you can do quickly, anywhere - including HIIT (High Intensity Interval Training), bodyweight exercises, cardio workouts and gym routines. * Workout plans to reach your goals: from beach body workouts to 6pack absHealthy meal plans that make eating clean easy* FitWell takes the hard work out of eating clean. Just follow the plan to get results!* Healthy recipes that keep your diet delicious* FitWell makes following low carb diets, paleo diets and everyday healthy eating simple and easy* Track calories and daily nutrition to get the right mix of protein, carbs and fatFitWell Premium Fitness Coach* Unlimited access to Premium workouts, including zone specific and seasonal workoutshttp://www.fitwell.co/",
    "descriptionHTML": "FitWell is your personal health and fitness coach. Join over 1 million people using FitWell to lose weight, get in shape and live a healthy lifestyle. Fitwell&#x2019;s healthy diet plans, personal exercise routines and professional workout videos will help you get in shape faster - at home, outdoors or in the gym. <br><br>Just like having a dedicated 24/7 personal trainer and diet chef, FitWell helps you achieve your goals with smart exercise and nutrition advice tailored to you. Take the FitTest, then let Fitwell monitor your activity levels and keep you motivated with daily coaching reminders.<br><br>Created together with professional athletes and nutritionists, FitWell features over 300+ workout videos, unlimited exercise program combinations and diet plans for both men and women. It&#x2019;s the perfect fitness app for exercise beginners and gym junkies alike! <br><br><b>A healthier you with FitWell</b><br><br>* Get a personal fitness and nutrition plan tailored to your body type and goals. <br>* Get results faster: from healthy weight loss and body toning to building muscle and cardio endurance.<br>* Always know how many steps you&#x2019;ve taken and calories you&#x2019;re burning by connecting your favourite wearables and fitness apps.<br>* Personal training (PT) sessions at the tap of a button, with hundreds of exercise videos and workout routines.<br>* Stay motivated every day with meal, water and workout reminders.<br>* It&#x2019;s a calorie counter, activity monitor, personal trainer and nutritionist - all in one app!<br><br><b>Get fit with a personal workout plan</b><br><br>* Exercise plans for beginners and experts<br>* 300+ HD exercise videos for body toning and building muscle<br>* Take the FitWell FitTest and track your progress<br>* Use the simple rep timer for perfect form every time<br>* Workouts you can do quickly, anywhere - including HIIT (High Intensity Interval Training), bodyweight exercises, cardio workouts and gym routines. <br>* Workout plans to reach your goals: from beach body workouts to 6pack abs<br><br><b>Healthy meal plans that make eating clean easy</b><br><br>* FitWell takes the hard work out of eating clean. Just follow the plan to get results!<br>* Healthy recipes that keep your diet delicious<br>* FitWell makes following low carb diets, paleo diets and everyday healthy eating simple and easy<br>* Track calories and daily nutrition to get the right mix of protein, carbs and fat<br><br><b>FitWell Premium Fitness Coach</b><br><br>* Unlimited access to Premium workouts, including zone specific and seasonal workouts<br><br>http://www.fitwell.co/",
    "histogram": {
        "1": 752,
        "2": 297,
        "3": 507,
        "4": 976,
        "5": 3725
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/W8zUKcr7OmZhmiQwx4GD-pKTDH8xw4YDu-2X-M7o4wP6eGAovL3ywY2vFANB_pxoES94=h310",
        "//lh3.googleusercontent.com/1WUS-bKFNwMTBnDItgJfFlwl37wVbM27WqnTxNaRI8TxAE3zmRewpCZaQAYvD6YbhQ=h310",
        "//lh3.googleusercontent.com/YsDA0x8PPJLqlHWipgC1xRFylDWtXRBp8e9K0I_7_GV60DJuYHGxc1OFPS8QhR24sGFu=h310",
        "//lh3.googleusercontent.com/m7umPuZnzfdvhOlkR5d4otVNaubUL5-u3De2lMrzJvNmZER3PgCgbPJg-Nf4yc-ylaA=h310",
        "//lh3.googleusercontent.com/SNAfIukgp4x9AHGKT4VTowGien4vfosl-DEx6Ufqzo3n2MHuc3dzt5aDmxPvaptDmbI=h310",
        "//lh3.googleusercontent.com/UyN7VRDYrIAj9fU5GUWq7k9f-MI4gdCvegCxClTA7UHahIZf2SkwIxEy2Hxth73jAg=h310",
        "//lh3.googleusercontent.com/GCZzDXuzDoVQHt5SlnmCZHTgjLPMeuFzL8KUNZayzm9r5FGAk8-aq419iijUg2sjXA=h310",
        "//lh3.googleusercontent.com/Yoswt2jKQ7D0qpJzOn66dcDMz38h6GH9BBOyZYdoayaHL1va0axfornvNVH-JzjSJyo=h310",
        "//lh3.googleusercontent.com/bK6GmvP5b-GeRMTisgpJi2qRlcdXLwazufgKv5_szU4hiqHiNzOQFsmrV1Ojj4XSZQ=h310",
        "//lh3.googleusercontent.com/pJ9oTZEAQzFj4h9RHVhw_piPqZzsn2L1Wwc1fsOx95SkCsc9SQKi9IYKmPt-my2QXHI=h310",
        "//lh3.googleusercontent.com/0l-MXmUehGCbQopu0tyN10Egy7V3rkbWlabF-z9lkcu-Lneb_w7vUt0Thp8CgPD8NTdd=h310",
        "//lh3.googleusercontent.com/00xOavwAJbkM3venc9N9r9uzHr0Ol_wKT4BBtOrgqrh34LOXaSxoWCA3lFTv8GzhNw=h310"
    ],
    "comments": [
        "Great one-stop fitness pal to help with all my training and nutrition needs!",
        "Premium üyelik aldım hala aktif olmadı mail attım dönüşü yapılmadı",
        "Impresive workout.",
        "Adınlarımı saymamak konusunda ısrarcı bir uygulama diğer uygulamalarda rahatlıkla adımlarımı sayabilirken bu uygulamayla yapamıyorum eğer adım saysaydı beş yıldızı bile hakedebilirdi",
        "Charged me twice fore 43 dollars. I never paid for it. Now I can't get a refund for them and it's bogus. This app is a joke. Becareful with this app.",
        "Hi I am facing a problem regarding my workout video when I start a workout it's got download successfully but when it starts the main workout video it got stuck after previewing the workout of 10s. I tried different method to solve this problem like reinstall the app, clear the workout video chache but nothing happen. I tried to report this to you in the app through create ticket but it's also not working as well and give an error while sending."
    ],
    "recentChanges": [
        "New streamable exercise videos that have faster launch times. Our videos are no longer stored in your phone, taking up unnecessary space.",
        "[Android 8.0] New shortcuts for a quicker, easier way to log your meals, activities, weight, and water intake. Tap and hold the app icon to find out more.",
        "Design and performance improvements."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=tr.com.fitwell.app&hl=en&gl=us",
    "appId": "tr.com.fitwell.app"
}