{
    "title": "TuneIn: Stream NFL Radio, Music, Sports & Podcasts",
    "summary": "Stream NBA &amp; NFL radio, sports talk radio stations &amp; listen to podcasts &amp; music",
    "icon": "//lh3.googleusercontent.com/FCd8R1Hovq40hwCW4WlLSX3wtxjFXNpOSsuysPakaTXLRjADgIW-f58dgZ9tbNM1IrQ=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.4,
    "reviews": 1529834,
    "developer": "TuneIn Inc",
    "developerId": "5756372639482561977",
    "developerEmail": "android-support@tunein.com",
    "developerWebsite": "http://tunein.com/support/android/",
    "developerAddress": "210 King Street\nSan Francisco, CA 94107",
    "updated": "February 22, 2018",
    "version": "Varies with device",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "size": "Varies with device",
    "description": "Stream your favorite radio stations, listen to the latest hit new podcasts, and stream NFL radio, NCAA college football, NBA or NHL games live with TuneIn online radio! With 100,000+ AM & FM online radio stations, TuneIn offers sports news radio, podcasts and free music streaming from around the world.Stream NFL radio and sports talk radio, listen to NPR, BBC and other local radio stations, including FM and AM radio, NBA talk radio. Explore a new podcast, stream NBA games, or enjoy music streaming anytime, anywhere.TuneIn Online Radio – Top 5 Reasons to Download:1. Stream AM & FM online radio with local radio & worldwide programming2. Listen to sports talk radio live, including live NFL, NCAA college football games, NBA basketball and NHL games3. Stream NFL radio, college football talk radio, news radio stations, music and podcasts live and on demand4. Listen to your favorite podcasts like The Rush Limbaugh Show, The Steve Harvey Morning Show, & WTF with Marc Maron - Download for offline listening!5. Stream sports talk radio & never miss your favorite NFL, NHL, NCAA college football and NBA basketball games, including live CFB and March Madness broadcasts on Westwood OneOnline radio, news radio and music streaming with TuneIn using Google Voice is easy! Just say “OK Google listen to TuneIn”, “OK Google listen to ESPN Sports Radio” or “OK Google listen to NPR” to get started.Stream your favorite local radio stations for sports radio, stream NBA games or check out new AM & FM radio stations, including ESPN, BBC, NPR, CNN, WFAN, and CBS Radio for news radio programs.TuneIn also has great commercial-free music from all of your favorites genres:• Listen to the best classic rock music, country music, R&B, indie rock, Latin pop and much more• Get in the holiday spirit with Christmas music from your favorite artists• Hear today's top hip hop hits and classic hip hop beatsMotivational music streaming on all of your Android Wear devices helps you to keep the pace during your workout, tuning in with Android Auto keeps you up to date with your favorite sports talk radio shows and hit podcasts during your commute. When at home, lean back, relax and listen to local radio with Android TV!Subscribe to TuneIn Premium for even more great content:• Stream NBA play by play and stream NFL radio all season long• Music streaming 24/7 with no banner ads!• Enjoy exclusive access to over 600 commercial-free music stations, both FM & AM radioDownload TuneIn Radio and listen to varied programming and a wide selection of music, sports, news, podcasts and talk shows from all over the world!Visit http://help.tunein.com/ for FAQs or to get in touch with our support team.Your privacy is very important to us and we make sure to only ask for permissions we really need to give you the best possible experience using the app. For more information please visit: http://tun.in/9ekgZTuneIn uses Nielsen measurement software which allows you to contribute to market research, like Nielsen’s TV Ratings. To learn more about Neilsen's digital measurement products and your choices, please visit http://www.nielsen.com/digitalprivacy for more information.",
    "descriptionHTML": "Stream your favorite radio stations, listen to the latest hit new podcasts, and stream NFL radio, NCAA college football, NBA or NHL games live with TuneIn online radio! With 100,000+ AM &amp; FM online radio stations, TuneIn offers sports news radio, podcasts and free music streaming from around the world.<br><br>Stream NFL radio and sports talk radio, listen to NPR, BBC and other local radio stations, including FM and AM radio, NBA talk radio. Explore a new podcast, stream NBA games, or enjoy music streaming anytime, anywhere.<br><br><br><b><u>TuneIn Online Radio &#x2013; Top 5 Reasons to Download:</u></b><br>1. Stream <b>AM &amp; FM online radio</b> with local radio &amp; worldwide programming<br>2. Listen to <b>sports talk radio live</b>, including live NFL, NCAA college football games, NBA basketball and NHL games<br>3. Stream NFL radio, college football talk radio, news radio stations, music and podcasts live and on demand<br>4. Listen to your favorite podcasts like <b>The Rush Limbaugh Show, The Steve Harvey Morning Show, &amp; WTF with Marc Maron</b> - Download for offline listening!<br>5. Stream sports talk radio &amp; never miss your favorite <b>NFL, NHL, NCAA college football and NBA basketball games</b>, including live CFB and March Madness broadcasts on Westwood One<br><br>Online radio, news radio and music streaming with TuneIn using <b>Google Voice</b> is easy! Just say &#x201C;OK Google listen to TuneIn&#x201D;, &#x201C;OK Google listen to ESPN Sports Radio&#x201D; or &#x201C;OK Google listen to NPR&#x201D; to get started.<br><br>Stream your favorite local radio stations for sports radio, stream NBA games or check out new AM &amp; FM radio stations, including ESPN, BBC, NPR, CNN, WFAN, and CBS Radio for news radio programs.<br><br><b><u>TuneIn also has great commercial-free music from all of your favorites genres:</u></b><br>&#x2022; Listen to the best classic rock music, country music, R&amp;B, indie rock, Latin pop and much more<br>&#x2022; Get in the holiday spirit with Christmas music from your favorite artists<br>&#x2022; Hear today&apos;s top hip hop hits and classic hip hop beats<br><br>Motivational music streaming on all of your <b>Android Wear</b> devices helps you to keep the pace during your workout, tuning in with <b>Android Auto</b> keeps you up to date with your favorite sports talk radio shows and hit podcasts during your commute. When at home, lean back, relax and listen to local radio with <b>Android TV</b>!<br><br><b><u>Subscribe to TuneIn Premium for even more great content:</u></b><br>&#x2022; Stream NBA play by play and stream NFL radio all season long<br>&#x2022; Music streaming 24/7 with no banner ads!<br>&#x2022; Enjoy exclusive access to over 600 commercial-free music stations, both FM &amp; AM radio<br><br>Download TuneIn Radio and listen to varied programming and a wide selection of music, sports, news, podcasts and talk shows from all over the world!<br><br><i><br>Visit http://help.tunein.com/ for FAQs or to get in touch with our support team.</i><br><i><br>Your privacy is very important to us and we make sure to only ask for permissions we really need to give you the best possible experience using the app. For more information please visit: http://tun.in/9ekgZ</i><br><i><br>TuneIn uses Nielsen measurement software which allows you to contribute to market research, like Nielsen&#x2019;s TV Ratings. To learn more about Neilsen&apos;s digital measurement products and your choices, please visit http://www.nielsen.com/digitalprivacy for more information.</i>",
    "histogram": {
        "1": 74973,
        "2": 38029,
        "3": 87251,
        "4": 289033,
        "5": 1040548
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/KZqoS1o6_eDuZlQE0jaXMQ_srT20z1X3WKA2kgiooGGHBQGben2hj0Ey3Xwo89WkMJu0=h310",
        "//lh3.googleusercontent.com/bKTJAivoZZOqJbzISdZgYEPt8m2n23LRurYG1k9VSLCWoGJYSBTzKn7AUw15uHQ2Ow=h310",
        "//lh3.googleusercontent.com/FMoHNGpaccd5otVo1x4sS2q8lWhVccXOzlqLXxulpm3g035T0t78XaHNo6EhvDK5verI=h310",
        "//lh3.googleusercontent.com/HFIfbgZdc0L5ZXo9DkBBdHD1IQzLlf_tGJigUbP4RLDBmXKcKs1xkHxvMakkkoJ_yA=h310",
        "//lh3.googleusercontent.com/5jAtyCbSB2oT_zokTT3wVnpcRg3PfSpgg9EW28S9RWjOLBsP1CTgekQfE3opoxRTqg=h310",
        "//lh3.googleusercontent.com/DznyTmj_WGRgR0uzHxy_SYP_0AKW3GU7RrpQ0i05-9GSTHRvOVX5_1N9jAtCpAH31LM=h310",
        "//lh3.googleusercontent.com/BaeiBcCUQQAMG6tOes594gBYlHfd_MmK_V5T_l8tmrXdmakPj6nTbWbPS8ExIFXJjkjx=h310",
        "//lh3.googleusercontent.com/7XEIpFSad_kYxnqL8lfwH99A8BANYRT4msGFMXLPV4Ix3HfABFwmumlkWv_zSxM1R8Ui=h310",
        "//lh3.googleusercontent.com/e5z5QzeTXUoVYFnwL8sGpn8mBv-eH1qhXcaIhNkRH25Tm1Z-bsmt4DmjOG7fTyTgLz7t=h310",
        "//lh3.googleusercontent.com/huhEhUaXy12y9tVQMJba5SEdVQ8cZiiPPcQW9UKDjG2ZYIPTmzUhZ8tSuH-Tj44Lpt8p=h310",
        "//lh3.googleusercontent.com/thIfQnAyBjKSj3onJct1puftnlX5fHRRf24VhRFuoAhi5QtFXyb62IpM197idVwq2Ei6=h310",
        "//lh3.googleusercontent.com/CrXejeUoJQqeK4d8qtM2_jXwCnDdXAi6wZ-DOz-SmFB-YIXqGAqoyrJwWqJAk1mW1g=h310",
        "//lh3.googleusercontent.com/NhIXkC2SZUbaLnllf5urtdx52LKqzzQKIn3bJ_4yWxjwELfyKM-1Hl9ZZB8MvJqrSA=h310",
        "//lh3.googleusercontent.com/7N7ciTonxEW-bBZOrzkesi-T-n4BOgO4CYEiYcqYVMo8wzqvqfmbPwHSUZiAA8QFgiAi=h310",
        "//lh3.googleusercontent.com/hsGDfnLgFaPn3fyV_tchSlSMA-8XhpTd8SeQisRJZDnBWn51Ld6TolMj5B_XU0MrTA=h310"
    ],
    "comments": [
        "It used be a nice, simple app that I would have one almost all day and now I am.goijg to uninstall it. I understand the need for ads, no problem. It's gone from an ad, to a couple, to sometimes 3 ads with a ten second gap between each one so it's.well over a minute before I hear my radio station. In and out the car all day means it also stopped each time I turned off the car so I'd deal with the ads ten or more times a day.  I'm now just using the browser option to listen online to my radio station, so much simpler for what I need.",
        "This app has nothing to offer that you can not find any place else. It was a great app before when it had audio books then it was a excellent app. I would recommend the free version and not the paid service with audio books gone now you can use a combination of other apps and get what this app offers and end up saving money.",
        "My big issue is layout. Why on Earth do I need  top news feed on my home page of a PODCAST PLAYER??? And with no way to edit the home page layout, the home page becomes useless but to those looking for new things, so really it should be a find your next listen section then a home section. Maybe the premium one is better in layout ,but for the free version  rhe layout is really kind of a joke for convience and personal experience. I only keep it since tunein seems to have contracts with some of my podcast to get episodes earlier then other players,but I really would like to get rid of it.",
        "Every time they come out with an update all of your recents disappear. There's no way to specify your preferences for what shows up on your screen so even if you don't like sports you're stuck with seeing mostly Sports anyway. But I have found it to be the best thing available right now if you're a News Junkie like I am and you want to hear all the news.",
        "I get a lot more buffering with TuneIn than other apps when listening to the same stations. So I can't give it more than 2 stars. Also, why is it now demanding I log in using my Amazon account? I made an account using my Facebook credentials originally and now it won't accept that across all platforms.",
        "I really don't like the new interface. Who puts dark blue as a background!? I believe everyone likes the black background. Did you know that \"blue color\" or any hue of blue is bad for the eyes!?  I'm disappointed."
    ],
    "recentChanges": [
        "TuneIn 19.4 has the following updates:",
        "We’ve freshened up our look! This update brings brighter colors and clearer, easier to read labels to help you quickly find the audio you love."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=tunein.player&hl=en&gl=us",
    "appId": "tunein.player"
}