{
    "title": "Radioplayer - Free UK Radio",
    "summary": "The official free UK radio app. 500 live stations, thousands of programmes.",
    "icon": "//lh3.googleusercontent.com/AFCeuB3NKx8f947fgFqPq9F0PLkt7QnVk7qWcE4JE33CfMGZe9iz3LZJxU9VwEUk2kNG=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.5,
    "reviews": 13909,
    "developer": "UK Radioplayer Ltd",
    "developerId": "UK+Radioplayer+Ltd",
    "developerEmail": "contact@radioplayer.co.uk",
    "developerWebsite": "http://www.radioplayer.co.uk",
    "updated": "February 22, 2018",
    "version": "3.10.306.10",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "The official UK Radio app, now re-designed in partnership with the BBC. 500 UK stations and thousands of podcasts and catchup shows, so you can play radio everywhere you go, with no login required.Find your favourite stations faster, in our fresh new app design. Control your listening more easily, with our expanding playbar. Discover new stations and shows – and see at-a-glance when new episodes are available.Stream stations and shows on all your devices, with Google Cast, Android Auto, Android Wear, and Bluetooth support. Also now compatible with Smart Device Link, for cars.Take radio to bed, with our Alarm Clock and Sleep Timer. Play your favourites with one tap, using Easy Mode. This is the definitive UK radio app for Android phones and tablets.All BBC stations, and hundreds more great British radio streams, on your Samsung, Sony, LG, or HTC device. Tune in to live streams of radio, or browse our on-demand programmes and podcasts, including hundreds of shows from the BBC and beyond. This radio app has everything from news and sport - to pop, rock, indie, dance, jazz, soul, and classical. It's perfect for live Premier League football, Ashes cricket, Wimbledon tennis, F1 at the weekend, Festivals over the summer, and Christmas radio stations. It’s the perfect music app, a great podcast player, and it’s ideal for football live streams too.Follow us on Twitter to get updates and to hear when new stations are added - we're @UKRadioplayer. UK Radioplayer Ltd is a not-for-profit company, aimed at making radio listening easier.We're backed by the BBC (owners of stations like BBC Radio 1, BBC Radio 1Xtra, BBC Radio 2, BBC Radio 3, BBC Radio 4, BBC Radio 4 Extra, BBC Radio 5 live, BBC 5 live Sports Extra, BBC Asian Network, and BBC Radio 6 Music).Our partners also include Bauer Radio (who run Kiss, Kisstory, Magic, Kerrang, Planet Rock, Absolute Radio, Absolute Radio 60s, 70s, 80s, 90s, 00s and Classic Rock), and Global Radio (owners of stations like Heart, Capital, Gold, LBC, Radio X, Capital Xtra, Chill, Classic FM, and Smooth). We also feature community and student stations – so there's something for everyone. Radioplayer - take radio everywhere you go.Note: This app is free to download but uses data which your carrier may charge for. Android 6+ users should disable power saving for Radioplayer to enjoy background radio listening.",
    "descriptionHTML": "The official UK Radio app, now re-designed in partnership with the BBC. 500 UK stations and thousands of podcasts and catchup shows, so you can play radio everywhere you go, with no login required.<br><br>Find your favourite stations faster, in our fresh new app design. Control your listening more easily, with our expanding playbar. Discover new stations and shows &#x2013; and see at-a-glance when new episodes are available.<br><br>Stream stations and shows on all your devices, with Google Cast, Android Auto, Android Wear, and Bluetooth support. Also now compatible with Smart Device Link, for cars.<br><br>Take radio to bed, with our Alarm Clock and Sleep Timer. Play your favourites with one tap, using Easy Mode. This is the definitive UK radio app for Android phones and tablets.<br><br>All BBC stations, and hundreds more great British radio streams, on your Samsung, Sony, LG, or HTC device. Tune in to live streams of radio, or browse our on-demand programmes and podcasts, including hundreds of shows from the BBC and beyond. <br><br>This radio app has everything from news and sport - to pop, rock, indie, dance, jazz, soul, and classical. It&apos;s perfect for live Premier League football, Ashes cricket, Wimbledon tennis, F1 at the weekend, Festivals over the summer, and Christmas radio stations. It&#x2019;s the perfect music app, a great podcast player, and it&#x2019;s ideal for football live streams too.<br><br>Follow us on Twitter to get updates and to hear when new stations are added - we&apos;re @UKRadioplayer. UK Radioplayer Ltd is a not-for-profit company, aimed at making radio listening easier.<br><br>We&apos;re backed by the BBC (owners of stations like BBC Radio 1, BBC Radio 1Xtra, BBC Radio 2, BBC Radio 3, BBC Radio 4, BBC Radio 4 Extra, BBC Radio 5 live, BBC 5 live Sports Extra, BBC Asian Network, and BBC Radio 6 Music).<br><br>Our partners also include Bauer Radio (who run Kiss, Kisstory, Magic, Kerrang, Planet Rock, Absolute Radio, Absolute Radio 60s, 70s, 80s, 90s, 00s and Classic Rock), and Global Radio (owners of stations like Heart, Capital, Gold, LBC, Radio X, Capital Xtra, Chill, Classic FM, and Smooth). <br><br>We also feature community and student stations &#x2013; so there&apos;s something for everyone. Radioplayer - take radio everywhere you go.<br><br>Note: This app is free to download but uses data which your carrier may charge for. Android 6+ users should disable power saving for Radioplayer to enjoy background radio listening.",
    "histogram": {
        "1": 454,
        "2": 268,
        "3": 551,
        "4": 2845,
        "5": 9791
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/REEHcLB8usxD6o6Q1oh8HkzYEU1z8WWeOx0Bw5xAqiqhGgewxag3t6yUWgj6RMW1r4A=h310",
        "//lh3.googleusercontent.com/smgiuBWM8CgczDETD0IluypRlBZOvRgHEAZhWafjV4YIgjNXdrxBwOC-Xevqi9H-lIY=h310",
        "//lh3.googleusercontent.com/PynSKWWAiye2bEa-rOZURpt1_O26pdDctBLVu7H0DMrz8QIzHtnv2vyfG1n3nJ88RhhA=h310",
        "//lh3.googleusercontent.com/LTQJvrDvm3kasnvKb-rtoL-jmiaKIe0qItmR_kr8WYOiiTHUXDxl9k7630yMkuVWsP4D=h310",
        "//lh3.googleusercontent.com/4EnDyXrcw-5b869jO6LTtVkVgNhG1Qvya5sSUf3XQ8Xd-Nb0jxdpDM-iRb2dfrGAyEU=h310",
        "//lh3.googleusercontent.com/qnQcFdocR6xrzabq6CsjZJL5JN7S284GZL0wb5T3sAnI_eImEgCvdDhLeZCJAsE5cQ=h310",
        "//lh3.googleusercontent.com/DFEi1So31g5uS8sLcQoJ19DKesfPGMInFcy0glWCGUDExtCu2RF9HKBGTBxBi575EVc=h310"
    ],
    "comments": [
        "What the hell have you done to this app! Before the update today it worked perfectly! Now I have lost the ability to change stations using my steering wheel audio controls, the app crashes and hangs my phone requiring a reboot. Please reverse this update!",
        "Before the latest update it was just about perfect with the ability to change radio stations with the steering wheel controls in the car which with the new mobile phone law of 6 points and a £200 fine was the main reason I use the app. Now it's just like all the rest with the risk of breaking the law if I want to change radio stations, can you please sort this?  Update. Hi thanks for the reply, I have tried all the things you mentioned but still I can't use the car controls with the new update. I connect my phone via Bluetooth to the car radio system and so long as I click the favourites tab on the Radioplayer app I could select each station by using the steering wheel controls. Since the update it has not worked but this morning I searched for the previous version )March 2017) of the app in apk form downloaded it, installed it and now can use the steering wheel controls again to select stations. Kind regards",
        "Hate the update!!! Why fix something  that wasn't broken? Too much RED and can't change colour scheme. Favourite list is sideways not top to bottom of screen.",
        "Latest update has ruined everything and to top it off it's now an ad magnet. I can get a notification and after the tone has finished the app will replay and ad again every time.",
        "This should be the editors choice. It is easy to use and doesn't cut off.but why change the familiar icon?",
        "Update has improved reliability of alarm function."
    ],
    "recentChanges": [
        "- Better Chromecast display on TVs",
        "- Bug fixes and improvements"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=uk.co.radioplayer&hl=en&gl=us",
    "appId": "uk.co.radioplayer"
}