{
    "title": "Screen Recorder",
    "summary": "Record your phone&#39;s screen! (NO ROOT on Android 5.0+, Easy instructions for 4.0)",
    "icon": "//lh3.googleusercontent.com/O8poWs8jf5CMs8WsCQDUGrVrbEDYnHz3GD-BIZbZcrguPpa3r7Hdr-YwW5AaEubO-ZZP=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 3.5,
    "reviews": 53228,
    "developer": "SmoothMobile, LLC",
    "developerId": "8531961944960268429",
    "developerEmail": "jay@smoothmobilellc.com",
    "developerWebsite": "http://smoothmobilellc.com",
    "developerAddress": "25 Ida St\nHaledon NJ 07508",
    "updated": "July 6, 2017",
    "version": "2.92",
    "genre": "Video Players & Editors",
    "genreId": "VIDEO_PLAYERS",
    "description": "Screen Recorder is the best app to record the screen of your phone. It does NOT require root access on Android 5.0+, no watermark and very easy to use with one action to start and stop recording. Screen Recorder lets you record HD videos that you can immediately share with your friends!The Screen Recorder main features are:★ You can record games, calls, Skype, Snapchat, Meerkat, Periscope and many other purposes!★ You can record the microphone audio, so you can create promotional videos, tutorials and comment the gameplay of your favorite games★ You can record your face in a small overlay window!★ You can easily stop your recording SHAKING your device or clicking on the push notification!★ You can decide when to stop the video automatically!★ You can set a countdown before recording!★ You can customize frame rate and video bit rate!★ You can stop recording locking your device!★ You can decide your recording quality★ Also compatible with Android 6.0★ FULL ANDROID WEAR SMARTWATCHES SUPPORT to start and stop recordingand many other fantastic features!!!This video capture software is used by many professional gamers all over the world! Record gameplay in Portrait or Landscape in Full HD, with upload directly to YouTube!If you have any feedback, bug reports, suggestions or you can help with the translations, please contact us at jay@smoothmobilellc.comBy installing this app you agree to the following privacy policy: http://www.oneaudience.com/privacy/?package_name=us.screen.recorder",
    "descriptionHTML": "Screen Recorder is the best app to record the screen of your phone. <br><br>It does NOT require root access on Android 5.0+, no watermark and very easy to use with one action to start and stop recording. <br><br>Screen Recorder lets you record HD videos that you can immediately share with your friends!<br><br>The Screen Recorder main features are:<br>&#x2605; You can record games, calls, Skype, Snapchat, Meerkat, Periscope and many other purposes!<br>&#x2605; You can record the microphone audio, so you can create promotional videos, tutorials and comment the gameplay of your favorite games<br>&#x2605; You can record your face in a small overlay window!<br>&#x2605; You can easily stop your recording SHAKING your device or clicking on the push notification!<br>&#x2605; You can decide when to stop the video automatically!<br>&#x2605; You can set a countdown before recording!<br>&#x2605; You can customize frame rate and video bit rate!<br>&#x2605; You can stop recording locking your device!<br>&#x2605; You can decide your recording quality<br>&#x2605; Also compatible with Android 6.0<br>&#x2605; FULL ANDROID WEAR SMARTWATCHES SUPPORT to start and stop recording<br><br>and many other fantastic features!!!<br><br>This video capture software is used by many professional gamers all over the world! Record gameplay in Portrait or Landscape in Full HD, with upload directly to YouTube!<br><br>If you have any feedback, bug reports, suggestions or you can help with the translations, please contact us at jay@smoothmobilellc.com<br><br>By installing this app you agree to the following privacy policy: <br>http://www.oneaudience.com/privacy/?package_name=us.screen.recorder",
    "histogram": {
        "1": 15812,
        "2": 1708,
        "3": 3206,
        "4": 3096,
        "5": 29406
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "4.4 and up",
    "androidVersion": "4.4",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/sbZnyXgoP205pZIuIZpglaLpv8ZTd3UkS2lDhH5H1HSGzaUqsPk0swRdPGWASbmnp9Y=h310",
        "//lh3.googleusercontent.com/6KvTnTYGBAksIg6YMzF-Ec6pkaa8650hcuKN4Ji9RDNObxjx81GE3foUX2WUhgz1Ww=h310",
        "//lh3.googleusercontent.com/CkxCmT-K7yBGm0VXizAeWl7KnY_58d-DCotG5dqFGR4PfU3hMNHd6K99U5AWadDmeL-Q=h310"
    ],
    "comments": [
        "What the heck man so you only support 4,5 or 5.0 don't waste your freaking time. And btw you guys are idiots",
        "IT SAID NO ROOT U LYING NOOB! I DONT UNDERSTAND WHY ANYONE WOULD GIVE THIS A FIVE STAR!",
        "Really? Why do I have to root my device. My god plz make an app that doesn't make me have to do extra work just to record a f*ucking video!!",
        "OK. so, I downloaded this and it said to root it so I got a rooting up and I rooted it literally 3 TIMES!! Ughhh! And its still not working! Deleted! Its a waste of time and data.",
        "The Developer is lying you Said no Root!! damn  to anyone try to download this dont do that this apk Content the little Dick",
        "To anyone who's reading this, PLEASE DO NOT DOWNLOAD!! It is very bad. Every time I try to record something else it says, \"SCREEN RECORDER HAS STOPPED\" SO ANNOYING!! I wish we could rate it 0 stars"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=us.screen.recorder&hl=en&gl=us",
    "appId": "us.screen.recorder"
}