{
    "title": "Screen Torch Tablet & Wear",
    "summary": "Screen Torch - Torch for devices without led flash and Wear.",
    "icon": "//lh5.ggpht.com/XYGVGuCFVURM1lBlHDSsBoWjv43Kh4VrqjTrkBoqz-3sOngDMrSfxk8DmXagIQlXIf4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 10000,
    "maxInstalls": 50000,
    "score": 4.1,
    "reviews": 266,
    "developer": "vAlmaraz",
    "developerId": "5549197747559518975",
    "developerEmail": "support@valmaraz.com",
    "developerWebsite": "http://www.valmaraz.com",
    "updated": "May 15, 2015",
    "version": "2.1",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "You can use your device as a simple torch with this light application.It turns on the whole screen into white. Very usefull for phones or tablets without led flash camera.Does your phone have led flash? Download 'Lux miniApp'Why this app?✔ Because it is simple and very effective.✔ Because it has the minimum possible size, so you can use your free space to other apps.✔ Because you can manage brightness.✔ Because it doesn't need any kind of permission. No suspected permissions!✔ Because it has a widget.✔ Because it is compatible with Android Wear.✔ Because if you have an idea to improve the app, we develop it!✔ Because it has no ads!✔ Because it's free!Why not try it?How to change brightness while it is on:First: touch the screen. A seekbar will appear.Second: move the seekbar and it would manage brightness.This application remembers the brightness before execution to return it to its original state at the end of use.Doesn't work on your device? Do you have some questions or suggestions?Contact us!The less size, the more performance!",
    "descriptionHTML": "You can use your device as a simple torch with this light application.<br>It turns on the whole screen into white. Very usefull for phones or tablets without led flash camera.<br><br>Does your phone have led flash? Download &apos;Lux miniApp&apos;<br><br>Why this app?<br>&#x2714; Because it is simple and very effective.<br>&#x2714; Because it has the minimum possible size, so you can use your free space to other apps.<br>&#x2714; Because you can manage brightness.<br>&#x2714; Because it doesn&apos;t need any kind of permission. No suspected permissions!<br>&#x2714; Because it has a widget.<br>&#x2714; Because it is compatible with Android Wear.<br>&#x2714; Because if you have an idea to improve the app, we develop it!<br>&#x2714; Because it has no ads!<br>&#x2714; Because it&apos;s free!<br><br>Why not try it?<br><br>How to change brightness while it is on:<br>First: touch the screen. A seekbar will appear.<br>Second: move the seekbar and it would manage brightness.<br><br>This application remembers the brightness before execution to return it to its original state at the end of use.<br><br>Doesn&apos;t work on your device? Do you have some questions or suggestions?<br>Contact us!<br><br>The less size, the more performance!",
    "histogram": {
        "1": 28,
        "2": 13,
        "3": 21,
        "4": 34,
        "5": 170
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.1 and up",
    "androidVersion": "2.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/hPz8xMhMyNJSgMB5ETRJdmDvbo4C08PI5igmADV-0AqnKWf3CZmMsmVjaCkN5vVOTy5R=h310",
        "//lh6.ggpht.com/hCa8O3OyIHZW7gqbqM1pyQR-fa6djSEX7s2aFrTY5LPknFhUhCWsS-jJGCyIdrBTKHE=h310"
    ],
    "comments": [
        "Awesome App Very useful especially for devices without flash",
        "Great Could see very well in dark",
        "Very brite! Possibly the brightest lite I've ever seen on my Galaxy Tab 3 8.0 and I've tried a bunch of them!  Many I liked but there was always something that wasn't 'just so.'  This one is simple, extremely brite, adjustable, has no ads and works without a bunch of needless permissions, and best of all, it's free!  What more could you ask for?  Kudos to the developer,  job well done.  I might add that this is the first app I've ever given 5 stars.  I like it when things do what they're advertised to.",
        "Good, was perfect on 2.3.4 This is a good app, especially wonderful on previous phone, but on this one doesn't do same job. It only shows white screen at current screen lighting level. I have to firstly raise the screen's brightness to full - manually on 4.2.1 Jellybean.",
        "Great app..... And with no ad's Works great, easy to control.. No ad's. What more could anyone want, thanks devs",
        "Size matters. I seek simple, but mainly memory storage compatible apps. I downloaded one similar to this one which was a good trade but the data consumption is nearly 6 times as much as this app. Calculating. They are both good, but when it comes to storage, less is more."
    ],
    "recentChanges": [
        "Compatible with Android Wear.",
        "Try it now!"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=vAlmaraz.miniSeries.ScreenTorch&hl=en&gl=us",
    "appId": "vAlmaraz.miniSeries.ScreenTorch"
}