{
    "title": "Personal Trainer: Home Workout",
    "summary": "Easy workouts w/ Personal Trainer TrackMy Fitness Home Workout Routines Exercise",
    "icon": "//lh3.googleusercontent.com/BpXQdk0NAf6nQ2oFQt-HR4wmzw7Ykj2ef7biS1S9d8ntC8Y8PWKiU5nvpR1VUPRSOaYc=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.2,
    "reviews": 905,
    "developer": "Track My Fitness",
    "developerId": "Track+My+Fitness",
    "developerEmail": "support@vimo.co",
    "developerWebsite": "http://trackmy.fit",
    "developerAddress": "1172 Castro St.\nMountain View, CA 94040",
    "updated": "January 26, 2017",
    "version": "3.1.1",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Personal Trainer by Track My Fitness is just like having your own personal trainer on your phone or smartwatch. Just select your workout and get moving!- Get faster results with a gym or home fitness program designed by a personal trainer based on your fitness level, goals, and more.- Enjoy fresh, new home workout videos added each week to the app including Weight Loss, Cardio, HIIT, Abs, and Strength Training- Exercise with or with equipment- Gym or home workouts for women and workouts for men- No more pen and paper with easy exercise routine logging. - Workout routines designed by celebrity personal trainer, Coach Kozak, have been used by millions of men and women to achieve unbelievable results.- Expert instruction with full length home workout videos. - Follow your motivational trainer using your phone or Android Wear Watch.- Watch timer instructs you how long to perform each exercise routine and how long to rest. - Get more accurate calories burned feedback then with typical fitness trackers because our fitness app knows EXACTLY which exercises you’re performing!- Stay motivated with remarkable progress tracking including 1 rep max estimates and calories burned - Verbal cues from both men and women personal trainers make sure you’re using proper form to keep you safe and healthy.- 100’s of workouts to choose from including: weight loss workouts, hiit workouts (high intensity interval training), cardio workouts (aerobic exercises), strength training exercises, body weight routines, beginner exercises, weight training work outs- Workout routines by body part include: ab exercises, arm workouts, butt exercises, chest workouts, legs exercises, and shoulder workout routines.- Personal trainer routines work great as home workouts and gym exercise routines.- Follow along with personal training on your Android Wear fitness watch.- The only Android Wear fitness app to auto count your repetitions while you follow along!- Auto repetition counting compatible Android Wear fitness watches include: Moto 360, Moto 360 2nd generation, Fossil Q, Samsung Gear Live, Huawei Watch, Sony Smartwatch 3, LG Watch Urbane, and LG Watch RDeveloper Note:We appreciate your feedback. If you see a problem or have a suggestion, please do not just leave a negative rating (yes 4* is a bad rating, we have a high standard :-)), because we have no idea why. Please tell us the problem so that we can improve the product by emailing us directly at support@vimo.co. Like other reviews have mentioned, we provide speedy support and we typically respond within 30 minutes.Thank you!",
    "descriptionHTML": "Personal Trainer by Track My Fitness is just like having your own personal trainer on your phone or smartwatch. Just select your workout and get moving!<br><br>- Get faster results with a gym or home fitness program designed by a personal trainer based on your fitness level, goals, and more.<br><br>- Enjoy fresh, new home workout videos added each week to the app including Weight Loss, Cardio, HIIT, Abs, and Strength Training<br><br>- Exercise with or with equipment<br><br>- Gym or home workouts for women and workouts for men<br><br>- No more pen and paper with easy exercise routine logging. <br><br>- Workout routines designed by celebrity personal trainer, Coach Kozak, have been used by millions of men and women to achieve unbelievable results.<br><br>- Expert instruction with full length home workout videos. <br><br>- Follow your motivational trainer using your phone or Android Wear Watch.<br><br>- Watch timer instructs you how long to perform each exercise routine and how long to rest. <br><br>- Get more accurate calories burned feedback then with typical fitness trackers because our fitness app knows EXACTLY which exercises you&#x2019;re performing!<br><br>- Stay motivated with remarkable progress tracking including 1 rep max estimates and calories burned <br><br>- Verbal cues from both men and women personal trainers make sure you&#x2019;re using proper form to keep you safe and healthy.<br><br>- 100&#x2019;s of workouts to choose from including: weight loss workouts, hiit workouts (high intensity interval training), cardio workouts (aerobic exercises), strength training exercises, body weight routines, beginner exercises, weight training work outs<br><br>- Workout routines by body part include: ab exercises, arm workouts, butt exercises, chest workouts, legs exercises, and shoulder workout routines.<br><br>- Personal trainer routines work great as home workouts and gym exercise routines.<br><br>- Follow along with personal training on your Android Wear fitness watch.<br><br>- The only Android Wear fitness app to auto count your repetitions while you follow along!<br><br>- Auto repetition counting compatible Android Wear fitness watches include: Moto 360, Moto 360 2nd generation, Fossil Q, Samsung Gear Live, Huawei Watch, Sony Smartwatch 3, LG Watch Urbane, and LG Watch R<br><br><br>Developer Note:<br>We appreciate your feedback. If you see a problem or have a suggestion, please do not just leave a negative rating (yes 4* is a bad rating, we have a high standard :-)), because we have no idea why. <br><br>Please tell us the problem so that we can improve the product by emailing us directly at support@vimo.co. Like other reviews have mentioned, we provide speedy support and we typically respond within 30 minutes.<br><br>Thank you!",
    "histogram": {
        "1": 103,
        "2": 15,
        "3": 57,
        "4": 172,
        "5": 558
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/iAra4SEkqRgn5IO7xQTTw3Ybf0csNuiEwFWfvOjrkjV87z1kTVT9tu459QRPKc1j930=h310",
        "//lh3.googleusercontent.com/f8EejAfqce0a3MS04tBfkqmrKSJ-gn1gKO3_STEFYGgUf0dsi8BTMBhG_XbJFOozqcA=h310",
        "//lh3.googleusercontent.com/vlL7vNfNThEY2IQ7h2lFFgAVhTfMJNzD-P7xiQibT6F7j9NdIPhkLVF2Kg_alciFIw=h310",
        "//lh3.googleusercontent.com/5PTKbWa1Lld-h0kaB9ENVtQ8ZJj7flBReZMW7ZFpqE-afzNaAO1vtyh1XL3xHIEiM2c=h310",
        "//lh3.googleusercontent.com/FQlVLQA4exONcC8ajzHmVbwFl_eX-ql5icEfHCgAUMqXzkj_IDHWixOHRLOgXH-y8V0=h310",
        "//lh3.googleusercontent.com/72kRP5cvo-8DudS5mhzVQkG_tbT-W6zXtqYNjclWNfFzBH3GQfV2ukPOB1iW9jFQBw=h310",
        "//lh3.googleusercontent.com/m18jxJvClEm7RbiMdY-HNyq-BuEdKKZoLmVCN0FyNFCwnw5jRr1qwiGi60Czaf7dz-zt=h310",
        "//lh3.googleusercontent.com/vr8z-SBfzanAGQYmTezH6p36Og7Hk8Buqs2J69wLjl4UJLPGjxOozfA_Vkj0M9lzbKOY=h310",
        "//lh3.googleusercontent.com/OX6OreZ5h2PgpPivsR5pPQDLPjfiFLNtQDousPczNI5HP96PZ_68zvq8U2OL9r_zxv8=h310",
        "//lh3.googleusercontent.com/3941x6NlVl7QmfVOynJ7i5Wiz3nZGceQjzMfFxMiCkv7w8xAwD0wVs_1clrWnCnW6Q=h310",
        "//lh3.googleusercontent.com/geMhm8RzR8RaH9KukSMqpWbm_MxZNZlov4sGaCgGAJZsA7Esvj4AuhjBH1Kw2dZMbw=h310",
        "//lh3.googleusercontent.com/vCzwtYYM6fLfhT-uoUFmmSezD_cqYMJ_1bHqDIuSW0OFheXdr8Gfh3V4dRluFRf6Xw=h310"
    ],
    "comments": [
        "Awesome app! Very well thought out videos that goes at a pace that is just perfect. Challenging but not over the top! Soaking swear after each completed workout. Love that I can take a sweaty selfie immediately after it tells me how much calories I just burned and what it is equal to. Today I burned the equivalent of a scoop of vanilla. :)",
        "Main issues is it doesn't do half the things it says.  Doesn't log my workout,  dosent log goals,  won't let you add weights to your work outs, gives ludicrously low numbers for calories burned, doesn't count reps using a smart watch on the list. I do like the exercises,  but the not logging my work puts is really starting to get to me. I want to love this app but it's performance is making that hard",
        "This app has been broken sense Last year. The funny thing is I had someone response to me just to ask me if it was working then never replied again. The issue is the same it won't let me log my workouts. That was one of the best things about this app and not it just sucks balls.",
        "Great app but it's time for an update needs more workouts added or they can allow the community to add workouts like with skimble",
        "Great app to get you going! Lots of options for work outs",
        "Love using this to fit in quick workouts."
    ],
    "recentChanges": [
        "Faster and better workout videos"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=vimo.co.trainer&hl=en&gl=us",
    "appId": "vimo.co.trainer"
}