{
    "title": "Calendar For Android Wear",
    "summary": "The best calendar for the Android Wear operation system.",
    "icon": "//lh3.googleusercontent.com/DjfKJF6LKI7JajJPosFWcixnP87vr5tBUxbzKVJLIe9S0tEkQls9ES9Lk0p4uuPtZr79=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 3.9,
    "reviews": 1999,
    "developer": "Wearable Software",
    "developerId": "9027257451638050761",
    "developerEmail": "support@wearable-software.com",
    "developerWebsite": "http://www.wearable-software.com/",
    "developerAddress": "Wearable Software\nCedric Larrat\nGrötzingerstr. 73\n76227 Karlsruhe-Durlach",
    "updated": "January 13, 2015",
    "version": "1.1",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "description": "Completely free. The best calendar for the Android Wear operation system. Get an overview about upcoming appointments with the calendar view. Browse your appointments through a day agenda by touching on a specific day. View details for a appointment such as description, begin and end date when touching on the appointment in the day agenda. Swipe left or right to change month in the calendar view. In addition this calendar is simple and easy to use and a great helper for on the go. Download now for free. To start the app. Just say: OK Google...Start calendar. Please note: To retrieve the appointments, your watch must be connected to your mobile phone.Get more apps, games & news about Android Wear with \"Android Wear Center\": http://tinyurl.com/m87stxsFeatures:★ Calendar view, swipe left or right to change month★ Days with appointments are marked red in calendar★ Current day is marked with a square★ Day agenda★ Appointment detailsYou have to own an Android Wear device to use this appCurrently compatible devices:► HUAWEI Watch► Moto 360 Gen 2 (2015)► Moto 360 Gen 1 (2014)► Asus Zenwatch► LG G Watch► LG G Watch R► LG G Watch Urbane (Android Wear version)► Samsung Gear Live► Sony SmartWatch 3Please note:-Make sure your mobile is compatible with Android Wear.-Make sure to pair your phone with the wearable device with help of the Android Wear App.-To open: Go to \"Start...\" and open the app \"Calendar\" or say \"Start calendar\"Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let us know.",
    "descriptionHTML": "Completely free. The best calendar for the Android Wear operation system. Get an overview about upcoming appointments with the calendar view. Browse your appointments through a day agenda by touching on a specific day. View details for a appointment such as description, begin and end date when touching on the appointment in the day agenda. Swipe left or right to change month in the calendar view. In addition this calendar is simple and easy to use and a great helper for on the go. Download now for free. To start the app. Just say: OK Google...Start calendar. Please note: To retrieve the appointments, your watch must be connected to your mobile phone.<br><br><br>Get more apps, games &amp; news about Android Wear with &quot;Android Wear Center&quot;: http://tinyurl.com/m87stxs<br><br><br>Features:<br>&#x2605; Calendar view, swipe left or right to change month<br>&#x2605; Days with appointments are marked red in calendar<br>&#x2605; Current day is marked with a square<br>&#x2605; Day agenda<br>&#x2605; Appointment details<br><br><br>You have to own an Android Wear device to use this app<br>Currently compatible devices:<br>&#x25BA; HUAWEI Watch<br>&#x25BA; Moto 360 Gen 2 (2015)<br>&#x25BA; Moto 360 Gen 1 (2014)<br>&#x25BA; Asus Zenwatch<br>&#x25BA; LG G Watch<br>&#x25BA; LG G Watch R<br>&#x25BA; LG G Watch Urbane (Android Wear version)<br>&#x25BA; Samsung Gear Live<br>&#x25BA; Sony SmartWatch 3<br><br><br>Please note:<br>-Make sure your mobile is compatible with Android Wear.<br>-Make sure to pair your phone with the wearable device with help of the Android Wear App.<br>-To open: Go to &quot;Start...&quot; and open the app &quot;Calendar&quot; or say &quot;Start calendar&quot;<br><br><br>Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let us know.",
    "histogram": {
        "1": 134,
        "2": 142,
        "3": 290,
        "4": 626,
        "5": 807
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/hMZkWz9-Rjnr80t7SMuE0lmEi8mxWO2BcwcEbFf-Yj-7NbvbSjdSB1fMJPp_tJUwFw=h310",
        "//lh5.ggpht.com/kuda2p8gIH01YAy2BamFV681HyArNIWbTf9q1mehYKSihNeiaEZoa547y5J5jKzBKVM=h310",
        "//lh3.ggpht.com/KdN9fpkOoMUhJUEaQPGnsQzM4uuqS_p5zL0pNRmtqRBxA15XntbvRIQirWIntPeGfX4=h310",
        "//lh4.ggpht.com/Ptcfx9fejp9qPPuOgHvQn1kqd9ByflQCrAXQzCf9JrWZ2qFSpiDtjwTClVe4wNJUmysm=h310",
        "//lh5.ggpht.com/_nIa4n6jL-hHiC84Pc2Xa4y0KeEpIb19dHElo08k2Uhj_Gi8_-TNQuMtamGlMbMX8yc=h310",
        "//lh3.googleusercontent.com/s5Quiu2bq0nE8Dz-EBII1YgBqaEU192dtz0vnUYzWiNRJpb58_OTOrWAnZ3-I7uE4vTL=h310",
        "//lh3.googleusercontent.com/K0DAk_EsfwJjCYjdrwcG3BbqgX3G5z5IrnuoxTKCMZVYIK3iMCFnr3PYSJMryp6QSos=h310",
        "//lh3.googleusercontent.com/bEQu19oFEU12-tr6dqJyUm7Hw6oosQyVrzfAGjvyalojf80LonxA1gRb_hWssHBqpA=h310"
    ],
    "comments": [
        "Decent calendar for watch Works well on moto 360 sport.  Noticed a few things though.  First there doesn't seem to be any options for which calendars to show, not too big of a deal, especially for a free app with no ads.  However there is a crash bug.  If you tap a highlighted date and then tap a listed event the app will immediately crash and then restart.  My calendars are all synchronized with owncloud via caldav so maybe my case is special but I can't immagine how that might contribute to the crash, beyond that it works fine.",
        "Is nice but i can not set the first day of the week. All phone settings and calendar settings are good but still nothing :(  Edit: You may wanna look into how you auyomatically set up the first day. Got it to work by changing system language from US english to Uk english. Should be time zone related.",
        "Great App, with one caveat Love the functionality it adds to my Moto 360 watch... however there is one annoyance that many also note: it keeps showing all the birthdays with no option to turn the birthday calendar off. Please add this option.   The other cool feature would be to directly add new events from the App.",
        "Nice, but first day still doesn't change Overall a nice app,  but even after the latest update it does not change the first day of week, even if the description says it does. I need Monday as first day (which is on my phone), but it still shows Sunday. Rebooted and resynced my Moto 360 and Droid Maxx several times - no effect",
        "Really is the best Well actually, I don't have anything to compare it to other than the calendar that came standard on my watch, but I quickly fell in love with this one. You can easily identify days with alerts/reminders/appointments and tapping the day will bring up a list of the activities. And it syncs with Google calendar nicely. Couldn't ask for a better calendar for my watch.",
        "Good App, just what I needed....hope it improves. I installed this app and this is an excellent app,  what I needed for my ZenWatch.  I can see the day, events, and drill down into the event details...     Update: I have the latest version and I appreciate the development team in making the suggested changes for \"Location\" data to be exposed.  Thank you...well done.   There is one other draw back.  Google Birthdays... yes we all are affected by the spam of Birthdays from Google, but unfortunately this app does not have a filter to remove unwanted items like Birthdays / Holidays from being displayed.  Other calendering apps allow you to pick which calendars to show, this one does not... it reads and displays all of your calendars in Google, and with no filtering, will show birthdays along side your normally subscribed items in your schedule. My Request: a feature / update with a way to filter calendars and birthdays / holidays. If this is done, it will be 5/5 stars... still a good app..."
    ],
    "recentChanges": [
        "- set first day of week automatically",
        "- display event location",
        "- bugfix for all day events not displayed correctly"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=wearablesoftware.wearcalendar&hl=en&gl=us",
    "appId": "wearablesoftware.wearcalendar"
}