{
    "title": "Compass For Android Wear",
    "summary": "Compass for Android Wear is essential app for your wearable device.",
    "icon": "//lh3.ggpht.com/RkQGesfX9jcraUQy56RV7nIoqgAkJKFom3U9HIqRkxyAOrbezsviyhQ3lRV2uq0TVaE=w300",
    "price": "0",
    "free": true,
    "minInstalls": 50000,
    "maxInstalls": 100000,
    "score": 3.1,
    "reviews": 503,
    "developer": "Wearable Software",
    "developerId": "9027257451638050761",
    "developerEmail": "support@wearable-software.com",
    "developerWebsite": "http://www.wearable-software.com/",
    "developerAddress": "Wearable Software\nCedric Larrat\nGrötzingerstr. 73\n76227 Karlsruhe-Durlach",
    "updated": "February 7, 2015",
    "version": "1.0",
    "genre": "Tools",
    "genreId": "TOOLS",
    "description": "Compass for Android Wear is essential app for your wearable device. It is a professional compass on your wrist, when you need it, where you need it and you never know when I might come handy. Most people know how to use a compass to determine where north is. Few know how to use it as a navigation tool. The ability to navigate with a compass and a map is one of the major skills in hiking. This compass is not just a simple north direction indicator but is intended to be used as a real orientation tool for hiking activities. To start the app. Just say: OK Google...Start compass.Get more apps, games & news with \"Android Wear Center\": http://tinyurl.com/m87stxsFeatures- Simple to use, use it like a real compass- Magnetic strength calculation- Material design- No ads- FreeYou have to own an Android Wear device to use this appCurrently compatible devices:► Asus Zenwatch► LG G Watch► LG G Watch R► LG G Watch Urbane (Android Wear version)► Samsung Gear Live► Sony SmartWatch 3Please note:-Make sure your mobile is compatible with Android Wear.-Make sure to pair your phone with the wearable device with help of the Android Wear app.-To open: Go to \"Start...\" and open the app \"Compass\" or say \"Start compass\"Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let us know.",
    "descriptionHTML": "Compass for Android Wear is <b>essential app for your wearable device</b>. It is a professional compass on your wrist, when you need it, where you need it and you never know when I might come handy. Most people know how to use a compass to determine where north is. Few know how to use it as a navigation tool. The ability to navigate with a compass and a map is one of the major skills in hiking. This compass is not just a simple north direction indicator but is intended to be used as a real orientation tool for hiking activities. To start the app. Just say: OK Google...Start compass.<br><br><br>Get more apps, games &amp; news with &quot;Android Wear Center&quot;: http://tinyurl.com/m87stxs<br><br><br><b>Features</b><br>- Simple to use, use it like a real compass<br>- Magnetic strength calculation<br>- Material design<br>- No ads<br>- Free<br><br><br>You have to own an Android Wear device to use this app<br>Currently compatible devices:<br>&#x25BA; Asus Zenwatch<br>&#x25BA; LG G Watch<br>&#x25BA; LG G Watch R<br>&#x25BA; LG G Watch Urbane (Android Wear version)<br>&#x25BA; Samsung Gear Live<br>&#x25BA; Sony SmartWatch 3<br><br><br>Please note:<br>-Make sure your mobile is compatible with Android Wear.<br>-Make sure to pair your phone with the wearable device with help of the Android Wear app.<br>-To open: Go to &quot;Start...&quot; and open the app &quot;Compass&quot; or say &quot;Start compass&quot;<br><br><br>Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let us know.",
    "histogram": {
        "1": 161,
        "2": 37,
        "3": 60,
        "4": 93,
        "5": 152
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh5.ggpht.com/zpclYrYUZyN-02ScWLVXBwEg1I2jITQSQGw6rJPQvZ66PbUrOdlAj2426B-h442eO80=h310",
        "//lh6.ggpht.com/oCUZQrjp4k7W3Hgq6BOAY5AObYsf9QKfrah9HMQ4_LoOefCROelln8NtjVY8ML4pPQ=h310",
        "//lh6.ggpht.com/9xmypFJcOiqGr_1O89NHTKHhjCeRuskjpX-M2Nj9kCdxyady-QMW5gqsEXoe_v2x1_2T=h310",
        "//lh4.ggpht.com/NRllmgHoy1lsHNe7JnlUm8uI5NULJYVxUKUZgZGzh9nD83HGG4eUtiuYsyrSc0hV9OA=h310",
        "//lh4.ggpht.com/lysd330zEss8zcXz1OtwM6g5OFh2EVE70FFEbSsS632JSwwSajZrzIKxwTymTgK8z58=h310"
    ],
    "comments": [
        "Cant get past calibrate This app is not compatible with the Sony Smart Watch 3. On a SW3 you can not get past the calibration screen regardless of how you try calibrating it. i.e. the instructions in video does not correct thr problem users are having so is seems silly to continue to respond with a video that does not actually help. It would be beter to list the watches you have confirmed it works on...",
        "literally is not compatible. why make an android wear app that isn't compatible with an android wear watch (moto 360)? will give better review when it's compatible. in response to the developer: did you read my comment? I said make it compatible. and maybe be less sassy in your reply...",
        "Unfortunately, cannot give it zero stars. Does NOT WORK on Sony SW 3 - plain and simple. Yes, I watched the instruction video provided to other reviewer with the same problem  (it is NOT for the watch!)",
        "Works mostly Works on my Sony Smartwatch 3.  Would give 5 stars if the author added a smoothing/averaging function so it wasn't so jittery.  (It's twitching +/- 10 degrees even with watch placed on motionless table and no EMF sources nearby...)",
        "Useless Doesn't work on Zenwatch 2. Figured it would if it worked with 1. Oh well, hope there is an update some day. Would be really useful.",
        "Doesn't work on a Sony Smartwatch 3 Keep showing the calibration screen.  To be honest, calibration is to make it accurate.  Even if it is not calibrated, the program should work.  It is stupid to stay on that screen.  Uninstalled."
    ],
    "recentChanges": [
        "Startup check if device supports compass functionality"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=wearablesoftware.wearcompass&hl=en&gl=us",
    "appId": "wearablesoftware.wearcompass"
}