{
    "title": "Wear Spotify For Android Wear",
    "summary": "Spotify is now available on your Android Wear smartwatch.",
    "icon": "//lh6.ggpht.com/p8vU4wBfCyAH3kVimoXQc6junW4zdjWw18oMOtMZKcQpwxjc3m_6t_X8RRwUQiBTDA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 2.6,
    "reviews": 462,
    "developer": "Wearable Software",
    "developerId": "9027257451638050761",
    "developerEmail": "support@wearable-software.com",
    "developerWebsite": "http://www.wearable-software.com/",
    "developerAddress": "Wearable Software\nCedric Larrat\nGrötzingerstr. 73\n76227 Karlsruhe-Durlach",
    "updated": "April 7, 2015",
    "version": "1.3.1",
    "genre": "Music & Audio",
    "genreId": "MUSIC_AND_AUDIO",
    "description": "Spotify is now available for your Android Wear smartwatch. With Wear Spotify you can easily browse your playlists and select your favorite songs without using the mobile phone. In addition, you can regulate the volume and control your media player on the mobile phone remotely. The current artist, song title and album art is shown as notification card on watch. More features will be added soon. Please write us an email first before leaving a bad review. We will resolve the problem quickly. Thank you.Get more apps, games & news with \"Android Wear Center\": http://tinyurl.com/m87stxsInstructions: 1. Login on mobile phone with your Spotify account 2. If you don't have a spotify premium account or if you want offline playback. Turn on the setting 'Play songs with spotify app'3. Start the app on your watch 4. Choose a playlist Features on your wearable: - Search and play playlists - Browse featured playlists- Select and play individual tracks of your playlist - Increase or decrease volume - Turning the shuffle or repeat mode on and off - Play the next or previous track - Pause the media player - Mute playback- Display of artist, track and album art - Start playing an album, artist top tracks or radio via voiceFeatures on the mobile phone: - Option to use spotify app for playing songs (support for offline playback and playing songs without a spotify premium account)- Login, Logout with your Spotify account - Play the next or previous track - Pause the media player - Display of artist, track and album art You have to own an Android Wear device to use this appCurrently compatible devices:► HUAWEI Watch► Moto 360 Gen 2 (2015)► Moto 360 Gen 1 (2014)► Asus Zenwatch► LG G Watch► LG G Watch R► LG G Watch Urbane (Android Wear version)► Samsung Gear Live► Sony SmartWatch 3Please note: -Make sure your mobile is compatible with Android Wear. -Make sure to pair your phone with the wearable device with help of the Android Wear app. -To open: Go to \"Start...\" and open the app \"Spotify\" or say \"Start Spotify\"Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let us know.",
    "descriptionHTML": "Spotify is now available for your Android Wear smartwatch. With Wear Spotify you can easily browse your playlists and select your favorite songs without using the mobile phone. In addition, you can regulate the volume and control your media player on the mobile phone remotely. The current artist, song title and album art is shown as notification card on watch. More features will be added soon. Please write us an email first before leaving a bad review. We will resolve the problem quickly. Thank you.<br><br><br>Get more apps, games &amp; news with &quot;Android Wear Center&quot;: http://tinyurl.com/m87stxs<br><br><br>Instructions: <br>1. Login on mobile phone with your Spotify account <br>2. If you don&apos;t have a spotify premium account or if you want offline playback. Turn on the setting &apos;Play songs with spotify app&apos;<br>3. Start the app on your watch <br>4. Choose a playlist <br><br><br>Features on your wearable: <br>- Search and play playlists <br>- Browse featured playlists<br>- Select and play individual tracks of your playlist <br>- Increase or decrease volume <br>- Turning the shuffle or repeat mode on and off <br>- Play the next or previous track <br>- Pause the media player <br>- Mute playback<br>- Display of artist, track and album art <br>- Start playing an album, artist top tracks or radio via voice<br><br><br>Features on the mobile phone: <br>- Option to use spotify app for playing songs (support for offline playback and playing songs without a spotify premium account)<br>- Login, Logout with your Spotify account <br>- Play the next or previous track <br>- Pause the media player <br>- Display of artist, track and album art <br><br><br>You have to own an Android Wear device to use this app<br>Currently compatible devices:<br>&#x25BA; HUAWEI Watch<br>&#x25BA; Moto 360 Gen 2 (2015)<br>&#x25BA; Moto 360 Gen 1 (2014)<br>&#x25BA; Asus Zenwatch<br>&#x25BA; LG G Watch<br>&#x25BA; LG G Watch R<br>&#x25BA; LG G Watch Urbane (Android Wear version)<br>&#x25BA; Samsung Gear Live<br>&#x25BA; Sony SmartWatch 3<br><br><br>Please note: <br>-Make sure your mobile is compatible with Android Wear. <br>-Make sure to pair your phone with the wearable device with help of the Android Wear app. <br>-To open: Go to &quot;Start...&quot; and open the app &quot;Spotify&quot; or say &quot;Start Spotify&quot;<br><br><br>Do you have any suggestions for improvement? Any ideas? Any issues with the app? Please let us know.",
    "histogram": {
        "1": 197,
        "2": 58,
        "3": 49,
        "4": 58,
        "5": 100
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.2 and up",
    "androidVersion": "4.2",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh4.ggpht.com/FzUHpapTVVMXcwufgoRCYxink13yDlN34sngd5mDJWoAdCH6KDRBwRvv1-XRMcciGT4=h310",
        "//lh4.ggpht.com/xPLX5ZYBHscKJHX0v0NB90UZ06wpz3WF5R81hGGuVx87LAZqgKK8S_lWKxs0jAy-3Ak=h310",
        "//lh4.ggpht.com/cE8x5gbdqhhiB3vRg1HGheBdXuC7OTGw9aFOv5iASchLPPDCph79tLobGXxXD9xbUeI=h310",
        "//lh5.ggpht.com/-Bvo4x8VaLl9m5Kd_9g03oBT1wuScCaihpHGf4c54h6npPx4Km2sEKRtFsL_1aPhPDIq=h310",
        "//lh5.ggpht.com/bEDmISYnBE1OfATLFd3Hgs82FMUpUA2ribU1Lr1QCQaqgCqsflAQZDJssCQSck80Fg=h310",
        "//lh4.ggpht.com/dX4OvePftxPiF8GqDpQOCT4sDkgopXb8H2hOgQEqnaZQZeeJuhk7seLaltaz5MzFIg=h310",
        "//lh3.ggpht.com/D9ToCaINChMdT6ioQN1k6ZvqaP1i8wCkv3MsiJm5x54Zu8RmgOFJc-IusG784O7QzLXn=h310",
        "//lh5.ggpht.com/8cJ5NT1mEu6_3Ep80oCiQ-hdD7_hY1-e_TRRM139YsZwgUF1ZwHuASdmcQr77DNRqoA=h310"
    ],
    "video": "https://www.youtube.com/embed/RjFKXCeeX-8",
    "comments": [
        "Wearable spotify control So far so good. Kinda sucks that I'm a premium member yet the wear app wasn't allowing me the full premium experience. Small price to pay. So. I'm interested to see were the further development with this app. Bosses and customers really get bees in their bonnet when mobile are accessed  on the shop floor. I normally allow the playlist to ride until the wheels fall off. Yet this app allows me to control the mobile in an unconventional manner.",
        "Asus Watch Nice handy app. I work out at the gym and love to just say an Artist name and Michael Buble! It starts playing! It would be nice if you can add queues! *update* starting to lose connection and not reading sodify. Delete and restart, works then will not communicate.",
        "Huge Problem Paid for premium to be able to choose the songs I wanted rather than shuffle a playlist. When I go into \"Current Playlist\" and select a song it does not play the song I choose (yes I made sure I was not pressing a different song). It plays another song from the same playlist. This is a huge problem, devs. Fix it and this app would be great for the Moto 360 and worth 5 stars. Edit: the song I selected, the song playing, and the song displayed are all different. Yikes.",
        "Think you need premium I swiped left, hit chose playlist, hit the one I wanted and nothing happened... I dont have spotify premium but shouldnt it just start playing through the playlist on shuffle??? Otherwise i see no way for the app to be useful without premium.. EDIT: Brought spotify premium and its workin very well now, could be a bit smoother but does the job nicely",
        "... OK, so i got the app and bought the paid version.  It's a nice little app - more reliable than the default watch music control and has more features.  However, one thing that really frustrates me is choosing a song on the playlist and it resetting my position every time. It should remember where i was scrolled to on the playlist.  If this is fixed i will up my rating.  Thanks.",
        "Does not work on my gear fit 2 Apparently this app only works on a few smart watch devices. I tried to email for support got no response. Read the full description before purchase and make sure it is compatible with your device. I would like a refund but i wont hold my breath."
    ],
    "recentChanges": [
        "- Beta: Play songs with spotify app, support offline playback",
        "- Browse all playlists and all playlist tracks",
        "- Browse featured playlists",
        "- Voice commands: search for artist, album and radio",
        "- Mute button",
        "- New designed media player",
        "- Playlist and track caching"
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=wearablesoftware.wearspotifyplayer&hl=en&gl=us",
    "appId": "wearablesoftware.wearspotifyplayer"
}