{
    "title": "Progression Workout Tracker",
    "summary": "Become a winner not only in the gym, but also in life.",
    "icon": "//lh3.googleusercontent.com/zKznxtVfOynMOoKTaejFyo1j2t-adL9syD8E3U0U3X_zn0xpsuhEeRUJw9YrqczPJA=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000,
    "maxInstalls": 500000,
    "score": 4.3,
    "reviews": 3085,
    "developer": "Zoltan Demant",
    "developerId": "4746622660500196871",
    "developerEmail": "info@progression-app.com",
    "developerWebsite": "http://www.progression-app.com/",
    "developerAddress": "Rektorsgatan 14,\n25436 Helsingborg",
    "updated": "April 2, 2017",
    "version": "3.9",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "Fitness tracking made simple, and beautiful. Seamlessly integrated with Google Drive to backup and sync your workout sessions and programs to all your devices. Progression – helping you move forward in the gym, and in life.This is how it works• Pick one of the many built in programs to follow.• Build your own program from scratch.• Workout on the fly. Adding exercises as you go and feel.Track weights lifted throughout your workout sessions with your phone or watch. As soon as you’ve done an exercise once, it’s last used weights will be automatically inputted for you in future workouts.Tap complete workout when you’re done and voila, after leaving a comment you’re taken to the history view where you can find your newly finished workout and all earlier workouts you’ve accomplished. Head on over to the statistics page to view a throughout overview of your progress for each exercise, including graphs displaying your progress over time as well as specific details about your one rep max and other related stats.This is why it worksWhat you achieved the last time you performed an exercise is always available during your workout – allowing you to fully focus on beating it, time after time. By always striving for progression in the gym, you will become a winner, not only in the gym – but also in life. • You’ll be able to tackle everyday problems with ease.• Your confidence will grow each time you break a plateu.• As you evolve, so does your body. Regardless of your fitness goals, improving yourself will improve your body for the better.Tips & Trix• Use the rest timer to ensure you don’t rest too long or too little between sets. • Calculate the number of each plate you’ll need for your upcoming set with the plate calculator. • Drag handles next to input fields allow you to drag the number up and down instead of typing.• Discover! There are over 300 built in exercises, a good chance for you to find new fun exercises to help you on your journey. • Review workouts on your tablet, start them on your phone, and track weights on your watch.",
    "descriptionHTML": "<b>Fitness tracking made simple, and beautiful. Seamlessly integrated with Google Drive to backup and sync your workout sessions and programs to all your devices. Progression &#x2013; helping you move forward in the gym, and in life.</b><br><br><br><b>This is how it works</b><br>&#x2022; Pick one of the many built in programs to follow.<br>&#x2022; Build your own program from scratch.<br>&#x2022; Workout on the fly. Adding exercises as you go and feel.<br><br>Track weights lifted throughout your workout sessions with your phone or watch. As soon as you&#x2019;ve done an exercise once, it&#x2019;s last used weights will be automatically inputted for you in future workouts.<br><br>Tap complete workout when you&#x2019;re done and voila, after leaving a comment you&#x2019;re taken to the history view where you can find your newly finished workout and all earlier workouts you&#x2019;ve accomplished. <br><br>Head on over to the statistics page to view a throughout overview of your progress for each exercise, including graphs displaying your progress over time as well as specific details about your one rep max and other related stats.<br><br><br><b>This is why it works</b><br>What you achieved the last time you performed an exercise is always available during your workout &#x2013; allowing you to fully focus on beating it, time after time. By always striving for progression in the gym, you will become a winner, not only in the gym &#x2013; but also in life. <br>&#x2022; You&#x2019;ll be able to tackle everyday problems with ease.<br>&#x2022; Your confidence will grow each time you break a plateu.<br>&#x2022; As you evolve, so does your body. Regardless of your fitness goals, improving yourself will improve your body for the better.<br><br><br><b>Tips &amp; Trix</b><br>&#x2022; Use the rest timer to ensure you don&#x2019;t rest too long or too little between sets. <br>&#x2022; Calculate the number of each plate you&#x2019;ll need for your upcoming set with the plate calculator. <br>&#x2022; Drag handles next to input fields allow you to drag the number up and down instead of typing.<br>&#x2022; Discover! There are over 300 built in exercises, a good chance for you to find new fun exercises to help you on your journey. <br>&#x2022; Review workouts on your tablet, start them on your phone, and track weights on your watch.",
    "histogram": {
        "1": 190,
        "2": 84,
        "3": 212,
        "4": 639,
        "5": 1960
    },
    "offersIAP": true,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/ZTe12mLBFUwUB5fLJYYaS5Pylr-jB1sa8EJYBAt3_J7IfH6vfHEdETVILQugjOaVVA=h310",
        "//lh3.googleusercontent.com/TqTyu2d0qBD7b6mHTkNdmWWQwDXtxnPqU_Q0xTKNmTov2iOk0n0i_DmKjiXGxZpUXg=h310",
        "//lh3.googleusercontent.com/Rg04PcNnfUceMCseLG5Ka7D1v-8nhkNF1SGS9PZ4QellgZZkPD31Zre29CKv-HcNWQ=h310",
        "//lh3.googleusercontent.com/8MeCya5QDUJjrgAESQKgem8hFJCVNCBM83bIDW0wyDQIye7BBj3BIeM_qcn_YkVJtpNs=h310",
        "//lh3.googleusercontent.com/09TvWXfiuIaKZoNFdxuiVxYfCMIUzG-J7uLFeioDJwmDTObqGz3129waR7RCxQB9BxCn=h310",
        "//lh3.googleusercontent.com/ukAqnWsM9qihdx8TA_NrwRv-x9tZUxqxC77B15BZLk0KjKIRHeVHz8sD5ruhP5xOmMY=h310",
        "//lh3.googleusercontent.com/kmaKMQUE_-MYL68agHx4oly0mTubjfXCfA9tK6Io0cTypjCEojEh-DkYq83quQsvF8FQ=h310",
        "//lh3.googleusercontent.com/B9kjzOQNYjG5nMZokyOd0o9HHtPH8gcNryb5FqmPQ9XrPtSDnLLNilb7cTq5KvVQRUXS=h310",
        "//lh3.googleusercontent.com/DyJP4lot7L1jT201N84v3Q-CIbaQZqrr4zjSvDYqsFpb4ZGqHKhKVy5L3ylkMRfTvxg=h310",
        "//lh3.googleusercontent.com/T-w3YOjRfLwfS2aAiiWMMDv-SOaBRy7n0VOJOXimJCWYlZ7nKshtCUNc_2Qbno6dndI=h310",
        "//lh3.googleusercontent.com/1ClFBGlsj79niwrMr9SgAw1fx4LYrImfziHYnb2oNdMpItGeR-wUfPKAQZ8gyqbgEZCg=h310",
        "//lh3.googleusercontent.com/K29zHJWveCOwjvoNpy3QM8Jme3PWqvy6HSjBvQCTyC6NtYG8Z0v4msIfOB3um9Nl3OA=h310",
        "//lh3.googleusercontent.com/w1VmfDIirvBALZAygTsDjFlmB53l3jmJQPsRViCClmVIrW2VIi4Ygq0MourZyj4J2Pg=h310",
        "//lh3.googleusercontent.com/HzHRetqJzsHyJlZwhmwFk1EVQVIz9xhZnXcN5MjH9n5ugWAY0ozKoK85lyZFvyZdwc4=h310",
        "//lh3.googleusercontent.com/URLH1jRWVyOpPBrdcv6m3RUFVbTIqJRW4FIxcMQvlyo8DXcGVvYvg33xw86LH5rHzxE=h310",
        "//lh3.googleusercontent.com/RlCMBBiT9ndI8LkZXF3sqj8IDdkoNIS4vFX-CIUDZn6Tck-u_YMsj1dNG2YhtfxAtdk=h310",
        "//lh3.googleusercontent.com/bpifJPmg4e-l5x4M0wZuDGkgHIpbrzMoKSUYmFwnwARtO6Iyx_wX2C2AiZam8Kn_1RI=h310",
        "//lh3.googleusercontent.com/6znQzHK5AmvjtvjWkDYJh5t9qFCxN7o7aVpQVEMq8uGmd6bcNceyn6D-B0oN0HNdoMA=h310",
        "//lh3.googleusercontent.com/Wry5O3anZpuYfqNFMHGSjFZ6vdQTgHoMzLTJpJSyr9-0L6jxjaZvAVHRqo6DjW8ioWI6=h310"
    ],
    "comments": [
        "Great app, i have tried quite a few workout trackers and I keep coming back to this one. I wish there was a way to set up workouts so that you could program in a few full day of workouts and then create your workout based around plugging in the days to your schedule. For example I am on a workout that goes \"ABA\" the first week, and \"BAB\" the second week. It would be nice to be able to create two days of workouts then set it up in a schedule as opposed to manually configuring every workout for the two week period.",
        "Truly amazing app! I used to use Redy Gym but have been pulled away by all of the thoughtful little features of Progression Tracker. I love that when I complete a set, it moves on to the next exercise, the rest timer is a floating holo button, so if I leave the app, the timer is still visible, and the ease of building and updating my own program is amazing. And that's all just in the Free version. Statistics and graphs of your progress can be unlocked in the Pro version if you desire. But the core features are all Free which is just fantastic! I am definitely upgrading and the dev truly deserves it. Thanks a ton Zoltan!",
        "Great app.  My only issue is that creating a new workout plan takes forever and there is no way to keep them if you change devices or have to reinstall the app and there is no way to share workout plans.  If they could make everyone have a log in profile that you could save your workouts to, this would solve the issue.  This could also help to be able to share a workout plan.  I always work out with my girlfriend and if we are going to do a new workout plan, we each have to spend about 20 minutes plugging in each exercise.",
        "This is exactly what I have been looking for. Has a great list of pre assembled weekly workouts for all types. There is a demo of each exercise in case you don't know what one of them is.  My only problem is there are some common exercises I would like to see in here including boxing types, jump rope etc.  You are able to add an exercise but I would love to see an area for suggestions where you can officially have them added. Going to upgrade cause it's worth the money.",
        "I've used jefit and multiplier other workout trackers and none of them have every feature I wanted except this one.  The developer promptly got back to me with a question I had and also said that he is still working on the app which is great considering many other apps aren't still being worked on. Highly recommend.",
        "This app has everything you need to easily create and record workouts.  You can see your progress through stats.  My fav part is the timer you can setup so you know when it is time to lift again. Thanks for an awesome app! The dev does respond if you have any questions/issues."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=workout.progression.lite&hl=en&gl=us",
    "appId": "workout.progression.lite"
}