{
    "title": "Progression Pro Unlocker",
    "summary": "Become a winner not only in the gym, but also in life.",
    "icon": "//lh3.googleusercontent.com/4Iry9kBS1YNJN16MZS7DSNukXHfcDOYTGIAlgjviQ7z9rIyR20MEfQoVrucWIped4pm0=w300",
    "price": "$5.49",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 4.7,
    "reviews": 115,
    "developer": "Zoltan Demant",
    "developerId": "4746622660500196871",
    "developerEmail": "info@progression-app.com",
    "developerWebsite": "http://www.progression-app.com/",
    "developerAddress": "Rektorsgatan 14,\n25436 Helsingborg",
    "updated": "March 20, 2015",
    "version": "3.2",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "description": "This is the pro unlocker for Progression Fitness. Use it to gain access to all pro features - now and forever. By upgrading you also support the future development of the app.Fitness tracking made simple, and beautiful. Seamlessly integrated with Dropbox to backup and sync your workout sessions and programs to all your devices. Progression – helping you move forward in the gym, and in life.This is how it works• Pick one of the many built in programs to follow.• Build your own program from scratch.• Workout on the fly. Adding exercises as you go and feel.Track weights lifted throughout your workout sessions with your phone or watch. As soon as you’ve done an exercise once, it’s last used weights will be automatically inputted for you in future workouts.Tap complete workout when you’re done and voila, after leaving a comment you’re taken to the history view where you can find your newly finished workout and all earlier workouts you’ve accomplished. Head on over to the statistics page to view a throughout overview of your progress for each exercise, including graphs displaying your progress over time as well as specific details about your one rep max and other related stats.This is why it worksWhat you achieved the last time you performed an exercise is always available during your workout – allowing you to fully focus on beating it, time after time. By always striving for progression in the gym, you will become a winner, not only in the gym – but also in life. • You’ll be able to tackle everyday problems with ease.• Your confidence will grow each time you break a plateu.• As you evolve, so does your body. Regardless of your fitness goals, improving yourself will improve your body for the better.Tips & Trix• Use the rest timer to ensure you don’t rest too long or too little between sets. • Calculate the number of each plate you’ll need for your upcoming set with the plate calculator. • Drag handles next to input fields allow you to drag the number up and down instead of typing.• Discover! There are over 300 built in exercises, a good chance for you to find new fun exercises to help you on your journey. • Review workouts on your tablet, start them on your phone, and track weights on your watch.",
    "descriptionHTML": "<b>This is the pro unlocker for Progression Fitness. Use it to gain access to all pro features - now and forever. By upgrading you also support the future development of the app.</b><br><br><br><b>Fitness tracking made simple, and beautiful. Seamlessly integrated with Dropbox to backup and sync your workout sessions and programs to all your devices. Progression &#x2013; helping you move forward in the gym, and in life.</b><br><br><br><b>This is how it works</b><br>&#x2022; Pick one of the many built in programs to follow.<br>&#x2022; Build your own program from scratch.<br>&#x2022; Workout on the fly. Adding exercises as you go and feel.<br><br>Track weights lifted throughout your workout sessions with your phone or watch. As soon as you&#x2019;ve done an exercise once, it&#x2019;s last used weights will be automatically inputted for you in future workouts.<br><br>Tap complete workout when you&#x2019;re done and voila, after leaving a comment you&#x2019;re taken to the history view where you can find your newly finished workout and all earlier workouts you&#x2019;ve accomplished. <br><br>Head on over to the statistics page to view a throughout overview of your progress for each exercise, including graphs displaying your progress over time as well as specific details about your one rep max and other related stats.<br><br><br><b>This is why it works</b><br>What you achieved the last time you performed an exercise is always available during your workout &#x2013; allowing you to fully focus on beating it, time after time. By always striving for progression in the gym, you will become a winner, not only in the gym &#x2013; but also in life. <br>&#x2022; You&#x2019;ll be able to tackle everyday problems with ease.<br>&#x2022; Your confidence will grow each time you break a plateu.<br>&#x2022; As you evolve, so does your body. Regardless of your fitness goals, improving yourself will improve your body for the better.<br><br><br><b>Tips &amp; Trix</b><br>&#x2022; Use the rest timer to ensure you don&#x2019;t rest too long or too little between sets. <br>&#x2022; Calculate the number of each plate you&#x2019;ll need for your upcoming set with the plate calculator. <br>&#x2022; Drag handles next to input fields allow you to drag the number up and down instead of typing.<br>&#x2022; Discover! There are over 300 built in exercises, a good chance for you to find new fun exercises to help you on your journey. <br>&#x2022; Review workouts on your tablet, start them on your phone, and track weights on your watch.",
    "histogram": {
        "1": 3,
        "2": 3,
        "3": 2,
        "4": 13,
        "5": 94
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.1 and up",
    "androidVersion": "4.1",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/1vmsPUe3XJR7SXhxKWechDu7Hbn7JRZKekYMUZEvN1QDYMdmZUXH5QvC0QTVX5b0GQ=h310",
        "//lh3.googleusercontent.com/Sq6mMGXjpNU-JNXebQT71pidn9tcyzYY5cS2Ix4hBUhy6rVc2fFwvKDRok9bf4HELw=h310",
        "//lh3.googleusercontent.com/HnHvnz8Om4TBzpDItto1GA1XBSQGxiPpUS2B7MvXhAAwxlHyFe3ZPU6f1KxVJZQgt1U=h310",
        "//lh3.googleusercontent.com/DVGb2O7MK6-Y69FQs_pG69y1CXsn4TyFB9KRknM7kDkT2fi52dTGLnehO5I_WkXQ_yHw=h310",
        "//lh3.googleusercontent.com/MqsgEDHcM2IfP4YnZEWGXLZLKaAugFZ5tWevFVzwOVHOaCQRxuLc-MzrlEl8lsvEw3KG=h310",
        "//lh3.googleusercontent.com/rOUU6RkIhZHkKyxMj3iFxlUHbc3fva1mZG98o0cfAvHTBOjI5QKujIaIT7-IJkTkwCZj=h310",
        "//lh3.googleusercontent.com/Ur15ikKQUJu1oFVnYzUf_zbEpC1lreTrevVwDKix32hQJ5LAUvJaXnAvoPGWPjzlBb5s=h310",
        "//lh3.googleusercontent.com/3YLlSJTWVTseNJvqe6g-8StjmUQE-NL3yC3dvjcOXy7viPiv9pcOMEVrF_Nkq2Omy48=h310",
        "//lh3.googleusercontent.com/u9zWSKiWMbMWbnLaxkyOWFAl06Dn2V7yoaclgh5SILAxQPIKIC3Ja3aPiqCGsU1b0RM=h310",
        "//lh3.googleusercontent.com/RdhVTAYlB-THwUFh2qIEDXDxKE9XapU-cycJ-xC2y07jw0xpQE8i0CCW72CQ3z4meQ=h310",
        "//lh3.googleusercontent.com/WPNZadaRLVZye_5KYcl1gkuJlvKRAlbyRSr29jVlXjCQAucd_47NJqUL_q9Rsanob8Yu=h310",
        "//lh3.googleusercontent.com/Rsij7dC_3lpdC7hQ07gBJkiCftpvFJn5D96kCO0LIzTPjjx77ur2ODHR_OlFf7knRmw=h310",
        "//lh3.googleusercontent.com/6uym8WBWyxDMqC46e0BzDYuK7aYjwimTX5iQpv9Vv_-0ZEQojkuL9FGc5JgqRgu_fd4=h310",
        "//lh3.googleusercontent.com/a9gI1bYIFehEHNaPc2XjNV1WDK1lY9_LH1Aqpqglr6pd7JtZXmnAAAurzcljR3bhz80=h310",
        "//lh3.googleusercontent.com/sOPhRh0sUkuHiY3FQjnaZOIduWm6v-aHJGqzjzRhTzp-LORnUjOttx7HrzI4QmkRBI4=h310",
        "//lh3.googleusercontent.com/l6P0s6k5enApX86YrrPYhzh9MblFLPcc86vkssCuE_DNaX7a-7_C2EVbLopgA8bE9g=h310",
        "//lh3.googleusercontent.com/q9s_F05vw18vsP0eiSaxRzcmrw-GmXvCLvjEoCBeootuERLfw7URteh7ltcvwSANkg=h310",
        "//lh3.googleusercontent.com/9zneJMPHAO_5GAQtREIeFK1PCkiGEn6pL_jgPSI6uC9jsQXcdVsdWVKu7ggSSLYRgvm0=h310",
        "//lh3.googleusercontent.com/XoYch86-H7cvBcBRsFs1oRBA0Uy8wlv8DKxyrrt-rXTl56HM5goTfLVLt_w5qZIiiQs=h310"
    ],
    "comments": [
        "Great app, works better than most and I've tried most lol. Worth the money for Pro. Good to setup, great sync to other devices, good tracking or progress, good modern material design, good summary charts by muscle group, good template workouts but also easy custom workouts. Improvement suggestions would be , allow drag and drop change the order of excercise added to a workout as they can change weekly , and, allow to delete an excercise once added. Simple things but would make usability massivly better",
        "This is one of the best apps either in free mode or in the pro version. I started using it about 9 months ago and have just paid for the app as it is simply the best training / personal fitness / bodybuilding app out there. I have lost 45 lbs and gained strength in the process. Thanks for this app!! I couldn't recommend this more!",
        "Brilliant App I love this app!  It's simple, powerful, and easy to use.  It's not cluttered with useless bells and whistles.  It's a very useful application, with a clean and simple design.  It's easily worth the $5 cost of the pro version.  The application's designer more than earned it!  It's a well thought out and executed application design.  Brilliantly done!",
        "Love it I love the app. you do have the option to export your data but it doesn't export your routines, and it would be cool if it could back it up in the cloud by itself, also it acts up a bit with Android wear",
        "Fantastic app. Helps me track everything I do in the gym and lets me see the progress I'm making (or not making.) My only complaint (and only reason I took a star off) is that when trying to make two different superset groups, it will not let you add the same exercise which really stinks. I'd love to be able to create two different groups for super sets and be able to have the same exercise in each. If this can be changed, I'd gladly change my rating to 5.",
        "Motivational, keep stats on all your workouts Very worth the money. I just wish it had hip extensions! And if \"legs\" broke down into glute, hamstring, quad. Developer is very responsive and said he was working on it. :)"
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=workout.progression.pro&hl=en&gl=us",
    "appId": "workout.progression.pro"
}