{
    "title": "Wattpad  📖  Free Books",
    "summary": "Unlimited FREE books you&#39;ll love.",
    "icon": "//lh3.googleusercontent.com/OhhxSvYx7d5-_cb0lwFYPLmzL7H04i4ZFGEnLnZcyDrcvktpA3iDe3av-K1HIw9d_V4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 100000000,
    "maxInstalls": 500000000,
    "score": 4.6,
    "reviews": 2753205,
    "developer": "Wattpad.com",
    "developerId": "Wattpad.com",
    "developerEmail": "support@wattpad.com",
    "developerWebsite": "http://www.wattpad.com",
    "developerAddress": "36 Wellington Street East, Suite 200\nToronto, ON\nM5E 1C7",
    "updated": "February 28, 2018",
    "version": "Varies with device",
    "genre": "Books & Reference",
    "genreId": "BOOKS_AND_REFERENCE",
    "size": "Varies with device",
    "description": "Discover WattpadAt Wattpad, we’re connecting a global community through the power of the story. On Wattpad, you'll find all the stories to keep you hooked! Discover free stories and books created by writers around the world.  Whatever you’re into—whether it’s romance, science fiction, mystery, comedy, action adventure, fantasy, young adult fiction or fanfiction—you’ll find it all for free on Wattpad.ReadSave your favorite stories and take them with you wherever you go—even offline. Can’t put Wattpad down? Simply sync your account so you can easily pick up where you left off, whether you’re on your laptop, tablet or phone. ConnectJoin the community! Connect directly with writers and other readers and discuss the latest plot twists by leaving comments alongside the latest stories. React in real time as new chapters are added, share your favorite lines or create beautiful visual quotes. Read together! Share your library or create reading lists so your friends always know what you’re reading.  WriteGot your own story to tell? Publish it on Wattpad and share it with our supportive community. Create a new draft, add chapters to an existing story or add a cover, all from the app. You can even get creative with one of our monthly writing challenges. When inspiration strikes, you’ll have Wattpad right in your pocket. Stories you’ll love. Discover stories from well-known authors including Anna Todd, Scott Westerfeld, Tyler Oakley, Margaret Atwood, Paulo Coelho, RL Stine, Dan Brown, Christopher Pike, Pharrell, Zayn, Felicia Day, Jennifer Armentrout, Meg Cabot, Marissa Meyer, Gena Showalter, Hugh Howey, Kevin J Anderson, and Maureen Johnson. Already a Wattpad fan? Follow us on Instagram, Facebook, Twitter, Pinterest, and Snap to stay up-to-date on your favorite writers, stories, contests, and more! Instagram: https://www.instagram.com/wattpad/Facebook: https://www.facebook.com/wattpad/Twitter: https://twitter.com/wattpadPinterest: https://www.pinterest.com/wattpad/Snap: Search for “@wattpad”",
    "descriptionHTML": "<b>Discover Wattpad</b><br>At Wattpad, we&#x2019;re connecting a global community through the power of the story. On Wattpad, you&apos;ll find all the stories to keep you hooked! Discover free stories and books created by writers around the world.  Whatever you&#x2019;re into&#x2014;whether it&#x2019;s romance, science fiction, mystery, comedy, action adventure, fantasy, young adult fiction or fanfiction&#x2014;you&#x2019;ll find it all for free on Wattpad.<br><br><br><b>Read</b><br>Save your favorite stories and take them with you wherever you go&#x2014;even offline. Can&#x2019;t put Wattpad down? Simply sync your account so you can easily pick up where you left off, whether you&#x2019;re on your laptop, tablet or phone. <br><br><br><b>Connect</b><br>Join the community! Connect directly with writers and other readers and discuss the latest plot twists by leaving comments alongside the latest stories. React in real time as new chapters are added, share your favorite lines or create beautiful visual quotes. Read together! Share your library or create reading lists so your friends always know what you&#x2019;re reading.  <br><br><br><b>Write</b><br>Got your own story to tell? Publish it on Wattpad and share it with our supportive community. Create a new draft, add chapters to an existing story or add a cover, all from the app. You can even get creative with one of our monthly writing challenges. When inspiration strikes, you&#x2019;ll have Wattpad right in your pocket. <br><br><br><b>Stories you&#x2019;ll love. </b><br><br><br>Discover stories from well-known authors including Anna Todd, Scott Westerfeld, Tyler Oakley, Margaret Atwood, Paulo Coelho, RL Stine, Dan Brown, Christopher Pike, Pharrell, Zayn, Felicia Day, Jennifer Armentrout, Meg Cabot, Marissa Meyer, Gena Showalter, Hugh Howey, Kevin J Anderson, and Maureen Johnson. <br><br><br>Already a Wattpad fan? Follow us on Instagram, Facebook, Twitter, Pinterest, and Snap to stay up-to-date on your favorite writers, stories, contests, and more! <br><br><br>Instagram: https://www.instagram.com/wattpad/<br>Facebook: https://www.facebook.com/wattpad/<br>Twitter: https://twitter.com/wattpad<br>Pinterest: https://www.pinterest.com/wattpad/<br>Snap: Search for &#x201C;@wattpad&#x201D;",
    "histogram": {
        "1": 94713,
        "2": 52282,
        "3": 131307,
        "4": 330421,
        "5": 2144482
    },
    "offersIAP": true,
    "adSupported": true,
    "androidVersionText": "Varies with device",
    "androidVersion": "VARY",
    "contentRating": "Teen",
    "screenshots": [
        "//lh3.googleusercontent.com/11vB6zFUMtB4MnG9EvcVxElvutNRGPLeklIx8ROnkwKl_MS_zbXH1WMNguGJFFkCYdW9=h310",
        "//lh3.googleusercontent.com/_VZU6DeQRBYfIxRQb2qlO64AHRHSMGCk4_LTBz4PbhlO6n1fR8MCxr-Uc3_cScTS2g=h310",
        "//lh3.googleusercontent.com/01O4685YkFhwMMVQwU2phZVfaIN78lFAnffbA9muTTfZa_87elfoAKnA5DL1Uo5urmQ=h310",
        "//lh3.googleusercontent.com/2TZCw3U4zTEZI4grLcBv-RfZOMKQahh9khgdMqTobbHEYYqkaaihcolcQnFju93cr0U=h310",
        "//lh3.googleusercontent.com/EDhVkYhxlM515fVqhfoG488Id_fn0ATYT3ySMnHStYWydRE8lXuTOdMgFbIjs0xqUjI=h310",
        "//lh3.googleusercontent.com/aDATXTMYMAhaiOoIcZncX_fyMjQ2DoT6PAxdFHPsO2pTfkWpIvBoVknpb2fLfs-P-VUA=h310"
    ],
    "video": "https://www.youtube.com/embed/elXOHM9y7FA",
    "comments": [
        "PLEASE FIX!  I love the app, been using it since I was 15. However there's a problem with saving stories. I've been trying to write a new story and it's simply not saving. If i log out it deletes the story completely. I thought it might be my phone but I've tried it on my tablet and on the website as well but nothing is working. Please fix it.",
        "Wattpad is trash. Especially when you try to save a chapter but then it messes up the whole book interface. I couldn't even get into my other books, it just appears blank",
        "This app used to be very good, now...not so much. Constantly login off, and it takes forever to log on again. Sooo many updates, but it doesn't get any better. That's why you shouldn't try to fix what wasn't broken in the first place.",
        "The app is okay but with the new update is UNBEARABLY slow. Im waiting up to ten minutes at worst for my stories to load, even with an extremely strong internet connection. This is unacceptable and needs to be fixed.",
        "I can give you a 5 stars but when im editing my stories sometimes it wont publish i tried again later and it still says an error occured and it always so slow to load up my stories sometimes when i press the edit button it works but it only shows at the top edit story thats it i cant see my story there i only see at the top edit story pls fix this and also why cant i connect to wattpad",
        "I really regret that i update this because it's SO SLOW im waiting for the story to load for about 5 minutes, please fix this as soon as possible, then i'll rate it 5 stars tnx."
    ],
    "recentChanges": [
        "For those in the US & Canada, Wattpad Premium is here! This version unlocks the ability to have a completely uninterrupted reading experience while giving those who can the opportunity to support the app we all love. Can’t go Premium? Don’t worry, the app you know and love isn’t changing, this is just another option for those wanting to go ad free."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=wp.wattpad&hl=en&gl=us",
    "appId": "wp.wattpad"
}