{
    "title": "Skible Dialer For Android Wear",
    "summary": "Skible Dialer provides you functionality to make phone calls from Android Wear",
    "icon": "//lh4.ggpht.com/CdiQXY27O2pKZmJsZ5BkcsVQ-sII9c4INPiAYcmraN9CPP_Ydlr1TeY3A5LzKKZgDw=w300",
    "price": "$1.49",
    "free": false,
    "minInstalls": 1000,
    "maxInstalls": 5000,
    "score": 3.3,
    "reviews": 84,
    "developer": "Uladzimir Klyshevich",
    "developerId": "Uladzimir+Klyshevich",
    "developerEmail": "support@wrt.mobi",
    "developerWebsite": "http://www.whiterabbittek.com/",
    "developerAddress": "8 March, 2\nst. Rozhanka,\nSchuchin district,\nGrodno,\nBelarus",
    "updated": "September 19, 2014",
    "version": "1.0",
    "genre": "Communication",
    "genreId": "COMMUNICATION",
    "description": "Skible Dialer provides you functionality to make phone calls from Android WearFeatures:-favorites contacts-dialer-settings-optimized round and square views",
    "descriptionHTML": "Skible Dialer provides you functionality to make phone calls from Android Wear<br><br>Features:<br>-favorites contacts<br>-dialer<br>-settings<br>-optimized round and square views",
    "histogram": {
        "1": 22,
        "2": 4,
        "3": 10,
        "4": 21,
        "5": 27
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "2.3.3 and up",
    "androidVersion": "2.3.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh6.ggpht.com/O3Q-YBY4G_Ng563ulVs5poOK3lqshsGMPUamO6HrQNofbwMC-Gc7aA6POVOk06Qk_w=h310",
        "//lh6.ggpht.com/PvyXCoDs5KUkwbTgaPWUG0b60_vLjMexmpsSviCyzjZbYAjk9KBZknf7ohX4AFoOzOqw=h310",
        "//lh5.ggpht.com/2ifDTMYuTrGRaB43hMmYrIIU8ARmQv_Jq3jRpEQrOd2YNz_Id1LtmbUq_tWXW2q0cA=h310"
    ],
    "comments": [
        "Redesign favorites list for round watches The app is OK, works good, but the favorites need to be redesigned in my opinion. Full screen photos and the name written over it because the list view has too tiny pictures. Sometimes the favorites don't load up. I, personally would appreciate it, and I think others too with round watches. And one last thing: when in a call, it would be nice to have the ability to swipe left or right to hang up. Found only one bug: when entering the app, it re-calls the last person who was called with the app",
        "Does not work I have installed this app. I am using LG G smart watch. When i tried opening this, it says no contacts even though i have contacts on my mobile. Even i  tried sync contacts but no use. Please let me know how to proceed or kindly refund the amount. Thanks  ..   Yes , I have favourite contacts. Its not even showing that. I am using Samsung Galaxy S3 phone",
        "Not working This app is not working at all on my moto 360 connected with my note 4. Try to make call but nothing happen. Contact sync also always notice that I did not connected with phone while on android wear I can see the status is connected and can change the watch face. Waste of money buying this app.",
        "PLEASE HELP! I have a moto 360 and when I go to the app on the watch it says no contacts repeat sync, how do I sync contacts to this?",
        "Working great on moto 360. Seems to work great with Moto 360 and a Note 3. I turned on the speaker option and it has worked with all of my tests so far.",
        "I don't get it. When I open the app on my phone it takes me back to this page. And I can't sync contacts so It won't work."
    ],
    "recentChanges": [],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=wrt.mobi.skibledialer&hl=en&gl=us",
    "appId": "wrt.mobi.skibledialer"
}