{
    "title": "FNB Banking App",
    "summary": "The FNB Banking App allows you to bank when and where you choose.",
    "icon": "//lh3.googleusercontent.com/w5wm4oVIYXuGlZGndac8YDh-yrpAnOzJJmqQIbdkhThh1ZBOn-PdiHaScgQF7O2Dnk4=w300",
    "price": "0",
    "free": true,
    "minInstalls": 1000000,
    "maxInstalls": 5000000,
    "score": 4.2,
    "reviews": 26940,
    "developer": "FNB",
    "developerId": "9189134633805139989",
    "developerEmail": "fnbappsupport@fnb.co.za",
    "developerWebsite": "http://www.fnb.co.za",
    "updated": "February 14, 2018",
    "version": "5.5.0",
    "genre": "Finance",
    "genreId": "FINANCE",
    "description": "The FNB Banking App embraces the future of help – helping people to help themselves. Managing your financial life has never been this easy with the ability to transact, borrow, invest, protect and communicate all in one place.Download the App to see for yourself.Select the Help icon on your home screen to see answers to frequently asked questions or select FNB TV to view video tutorials._____________________________________________FNB Pay - Supported on NFC enabled devices with KitKat 4.4 or above Fingerprint ID - Supported on devices with a Fingerprint sensor running Android 6.0Watch App - Only available on Android Wear supported devicesSecure Chat - Only available to Premier, Private Clients and Private Wealth _____________________________________________By downloading or using the FNB Banking App for smartphones, you agree to be bound by the license agreement located at https://fnbtouch.fnbconnect.co.za/software_license.pdf . This agreement is incorporated into this notice for reference.If you do not agree to the license agreement, do not download or use the application.Terms & conditions apply.",
    "descriptionHTML": "The FNB Banking App embraces the future of help &#x2013; helping people to help themselves. <br>Managing your financial life has never been this easy with the ability to transact, borrow, invest, protect and communicate all in one place.<br>Download the App to see for yourself.<br><br>Select the Help icon on your home screen to see answers to frequently asked questions or select FNB TV to view video tutorials.<br>_____________________________________________<br><br>FNB Pay - Supported on NFC enabled devices with KitKat 4.4 or above <br>Fingerprint ID - Supported on devices with a Fingerprint sensor running Android 6.0<br>Watch App - Only available on Android Wear supported devices<br>Secure Chat - Only available to Premier, Private Clients and Private Wealth <br>_____________________________________________<br><br>By downloading or using the FNB Banking App for smartphones, you agree to be bound by the license agreement located at https://fnbtouch.fnbconnect.co.za/software_license.pdf . This agreement is incorporated into this notice for reference.<br><br>If you do not agree to the license agreement, do not download or use the application.<br><br><br>Terms &amp; conditions apply.",
    "histogram": {
        "1": 2590,
        "2": 888,
        "3": 1853,
        "4": 4820,
        "5": 16789
    },
    "offersIAP": false,
    "adSupported": false,
    "androidVersionText": "4.0.3 and up",
    "androidVersion": "4.0.3",
    "contentRating": "Everyone",
    "screenshots": [
        "//lh3.googleusercontent.com/3YxSRc_Sox_NllshRMXLA73uoi1x-pIOjQKZYpoHtKZabMNuNAeDk46Gfimq69yc2g=h310",
        "//lh3.googleusercontent.com/WC4BmeqxWRHUIkoo4jFTWy_PiwBFhQh5Z1DJnzlESXPVq2zRHOz_59QnypySA_cpXVZV=h310",
        "//lh3.googleusercontent.com/238GpUhhBw1Mii8BJJ2akEZYqHiUH8xfqL3IRrPCp1DucFMPeWobGhe5dQ3LExQ6Ag=h310",
        "//lh3.googleusercontent.com/ctq307aSXyDcJuSD8_IgO5p6oGDZhOpVjJAuY3zY-g6JA7nt1qGzc1xkmAba8UjDf7E=h310",
        "//lh3.googleusercontent.com/6Y9dMVGUXXwm_CHMo3PaZR41Tnm2yK88rTeX3g6wmvtzjKhVEqpDa5rZtoYZNZ028Ec=h310",
        "//lh3.googleusercontent.com/R6qClYP9Kz4qvTbb0yqBBFxmK-3bVqG2cP86B8zVcKk-wmacg4B52DirTlXzPcgFWS5y=h310",
        "//lh3.googleusercontent.com/VbFBU7fdelbXpcHxqNtKaAfs9ji29UEhna4Qj6iesYByHWFvx799M8s8EtK070ALY9o=h310",
        "//lh3.googleusercontent.com/YI5H2d5eSa5CUuRjR3rLK9oR5XVgqcQeE8OcjW67PAGAVFGBsRBFCb5sS64obaff_A=h310"
    ],
    "comments": [
        "Wonderful App! i only use the website on my laptop when i need to increase limits and the likes, otherwise i do 99% of my banking on the app. i hate going to the bank, and  with this app, the bank is always with me.  I understand the frustrations of some users. sometimes the problem is not with the technology itself, but us as users need to learn how to better use it. I think the team developing this app should be given a bell! Fantastic job, and keep it up.",
        "Very convenient app, quick and easy banking when I'm on the go. My one complaint is that the Login button is not placed under the password field like normal, it is hidden (under your hand) at the bottom of the screen! I have pressed the 'Login as another user' button so many times it's not funny. I mean, it's RIGHT THERE!",
        "I have a new Samsung Note8 and I can't get fingerprint sign in activated or setup FNB pay. I get an error that my phone is not compatible. I phoned the banking app support team but they was not much help. Is there a way to get this issue escalated?",
        "The FNB Pay option is still missing on NFC-enabled Huawei devices. There needs to be an easier way to verify the app. I have changed devices a few times, and can no longer verify new devices.",
        "Only issue is that I don't and items under the My vouchers and the app is up to date. Some people have it some don't and I can't understand why.",
        "The App is fine but am dissapointed that they sent  sms saying I can reverse some unauthorized  payments  but I don't see these icons on  the app. Apparently  I must update the App but I cannot see how to do that."
    ],
    "recentChanges": [
        "Help – Find answers to frequently asked questions.",
        "Maintenance of Credit Card Limits – Shift limits between Straight and Budget, decrease limits and add or maintain Auto Payments. Click the chevron next to your Credit Card.",
        "Investment Account Instruction Maintenance – Set up notice to withdraw, manage interest, view pending instructions or close account. Click the chevron next to your Investment Account and select Manage my Account.",
        "Legal - View the FirstRand Relationship Agreement."
    ],
    "preregister": false,
    "url": "https://play.google.com/store/apps/details?id=za.co.fnb.connect.itt&hl=en&gl=us",
    "appId": "za.co.fnb.connect.itt"
}